{
    "entity": "Keyboards",
    "text": [
        "I was diagnosed with carpal tunnel syndrome after 2 years of using a ‘regular’ keyboard. My doctor recommended pain medication and wrist braces, or using this keyboard. I’ve used this brand keyboard now for 8 years and just purchased my second. It was almost instant relief. Keeps me comfortable all day at my office job. I’ll never go back to a ‘regular’ keyboard.",
        "I type for work, sometimes this 18 hours a day, never less than 12 though.; and I work 6-7 days a week. These keyboards are wonderful. I'm on my 3rd one, in the past 5 years. I have tried to make others work, but I simply look like a monkey trying to type on anything else, this is the Mercedez or Keyboards.....you will NOT be disappointed. I have used many keyboards over the past 20 years, none come close to this model. I type about twice as quickly on this verses any other keyboard, the difference is amazing.",
        "As a transcriptionist who logs 10 hours a day on a keyboard, I am pretty tough on them. This keyboard is my top choice: It's ergonomic to prevent carpal tunnel, the keys don't stick so I can increase productivity, and it really takes the abuse from my constant \"banging\" on the keys. Holds up really well to my usage, have only had to replace after unfortunate incidents with coffee and the like! I have used this particular model for years and would not dream of switching.",
        "I'm not sure what Microsoft is thinking, but the lettering on the keys is done with a thin font with off-white printing. It's very stylish looking, but functionally useless. You can only read them when the room is fully illuminated, and they scrubbed off within weeks of my purchase. I'm a touch typist who does not pound or mush the keys. So for the letter to last under 3 weeks when they should last 3 or more years is very poor construction indeed. Whoever built it obviously did not test it adequately. Come on Microsoft, after decades of experience, you should have hardware that's MUCH, MUCH better than this!",
        "The keys are so stiff and loud. I felt like I had to punch the keys. My hands started hurting within a half hour due to the pressure needed to depress each key, where they were not hurting before. This is not a quiet or soft touch keyboard. I will be returning this ASAP.",
        "I've been buying these keyboards for several years now and they invariably stop working. Keys stop responding or when you press one key you get several extra characters. What's terrible is that the lifespan has decreased. The first one I bought lasted a few years, the next one lasted only a year and this most recent one broke after only a month. I didn't spill anything on it. Yesterday when I started up my PC, the 'C' key stopped responding. After messing around a little, the 'C' started working but now Ctrl-Alt-Delete stopped working. No more of these pieces of junk.",
        "I recently purchased this and an ergonomic mouse because I get terrible elbow, arm, and hand pain from computer usage. This \"ergonomic\" keyboard actually exacerbates my issues. I'm looking into a 2 part keyboard instead. For me, bringing my hands in is one of my biggest issues. I didn't realize that until trying this keyboard. So in that regard I don't regret buying it but it's definitely going back. Also why doesn't this have a backlit option? I'd still be returning it either way but prior to my purchase that was something I really wanted but was unable to find in an ergonomic design.",
        "I'm not sure if anyone else has had this issue but my red pointer finger is having pain in my joint from stretching it to reach the y h and n keys. I type on a laptop a bunch and decided to get an erogomic keyboard and with in 2 days for use my joint hurts. I'm 29 and have never had joint issues before. I'm bummed because I like the keyboard other then that and wanted to like it.",
        "I have used several of the wireless version of this keyboard for over a decade with great results. I was experiencing wrist pain when using a standard keyboard for more than a few minutes. While it did take a few days to grow accustomed to the dramatic angle changes of this keyboard, my pain went completely away! This keyboard is a cheaper and more readily available version. While the wireless capability was nice, it wasn't what I would call mission critical. I would highly recommend this to anyone who keyboards a lot and is starting to experience wrist pain.",
        "I telecommute and at my PC 8+hours a day. Should have got the more expensive business version. I use Crtl+c and Ctrl+v a lot. After 2 months, the C and V are already starting to wear off. This non business version the letters are on the center of the key, vs. the upper corner of each key on the business version where the printed letter will get struck less. I'm going to have blank keys soon. Otherwise, a comfortable keyboard. I upgraded from the white 1999 version of the same model. Same ergo layout, added cushy wrist support, few more extra buttons to support computing in this century.",
        "Great keyboard. A much more natural typing position than traditional keyboards. I needed about a week of sporadic typing to adjust to the layout, but that was about it. I also noticed quite a bit more travel on the keys (the amount of distance you push down on the keyboard until the keystroke registers) than I was used to, but was able to adjust to this also within the week. If you're used to laptop keyboards, you'll notice it as well, if you're used to a stand alone keyboard, their will be much less difference for you.",
        "Keys bind when typing, resulting in low actuation. The space bar is atrocious, a 3\" bar with only one sensor in the center doesn't work. Unless the keys are pressed dead center they will bind, returning for a better board.",
        "It's not a clicky keyboard, it's not a massive keyboard, it's just a good keyboard. You have to be willing to learn the feel of the layout, but once you do your hands with thank you. It's getting harder to find these. They will not last forever, that is why they were not super expensive. But if you don't want/need/like fancy \"clicky\" keyboards and just want something that works and keeps your hands in a natural position, try to get one of these. The printing on the keys will wear off with use, but you don't get one of these if you are a \"hunt and peck\" typist that needs to look at your hands, this is for touch typists.",
        "As an accountant, I use the number key pad alot and for some reason they made the wrist cushion smaller so half my hand pad is off and its not the most comfortable. I really wanted to love it since I've been working from home but it just doesn't fit my need.",
        "It may not be pretty anymore but I still love this keyboard. Very comfortable for hands and wrists, all keys work as they should, and I'm on the computer keyboard about 8 hours a day, almost every day. After 8 years I am still completely satisfied. The tape job I did does not affect the keyboard's performance at all. The fabric ripped and needed taping about 2 years ago. The keys have the feel that is just right for me. Very happy. Order it with amazon as the seller, not a 3rd party. That's what I do for amazon orders.",
        "I have used this model of keyboard for many years. First one misbehaved by not accepting first press of Shift key. Assumed it was due to age. Ordered another one and found it was doing the same thing out of the box. Unfortunately, waited too long to return it and am stuck with it. However, have ordered a replacement, unfortunately not ergonomic. Many of the ergonomic keyboards on Amazon have received poor reviews for function or reliability, so am going with a gaming keyboard with good reviews. Will miss ergonomic typing position with new keyboard. Not quite clear why someone can't make a good, reliable, ergonomic, possibly-backlit keyboard!",
        "It stopped working after 7 months. That's 2 weeks after the included support stopped. This is the third one we purchased that had issues with in a year. The letters wear off with minimal use and two of them are completely useless because after you press one key you get several extra characters. I tried their online service and all I get is a server error. I went directly to their website support and all I get is a notice that they can't sign me in due to an endless loop error.",
        "Microsoft, in the past, sold this same keyboard style in a wireless configeration and included a matching wireless mouse. Microsoft discontinued the wireless model, which I believe was a grave error, as the keyboard was perfect for its intended purpose. This keyboard is a close second, only lacking the wireless option. These keyboards should also have illumination built in. My previous keyboards, wired and wireless, also have a propensity to lose the letter markings on the keys.",
        "Since the beginning had several key recognition problems. Sometimes letters A,C,Z,X stopped working and then started worked again. Recently the Shift key from the left side does not work to capitalize letters but activates other functions, like shortcuts. Even do I like the design of the keyboard is really unreliable and does not get the job done especially when you depend on writing son much. I probably got a refurbished one instead of a new one as advertised. I do not recommend this product.",
        "good keyboard. on the quieter side. but what's really annoying is how the space bar has a tendency to get stuck or more effort is needed to register the use of the space bar. i believe that i've only encountered this issue with microsoft ergonomic keyboards--dating back to when they only sold the cement colored ergo keyboard. hopefully, they can fix the issue with newer iterations of the keyboard.",
        "The layout of the keyboard is confortable, however, the quality of the product is the issue. The keys are sticky with a lot of friction which make typing difficult, requiring a lot of effort. Also, it is too often that the keys need to be pressed multiple times to work. If you lay your wrist on the built-in wrist-rest , it will also cause many keys not functioning. Overall, it is very painful to use this product! The idea is good, but the built quality is so low that makes it not ergonomic at all.",
        "I am not sure if my body chemistry has changed or what, but finally the last Microsoft 4000 Ergonomic keyboard I bought the white letters are not fading off. I thought maybe it was me along with some other people who have complained of the same thing. Maybe Microsoft has finally fixed this issue?? Love my keyboard, they last a long time and I don't know where I'd be without them. Saves my wrists, good touch response. I don't use many of the special keys, but I do like the right-sided numbered keypad.",
        "The one flaw stinks though. The letter wear off! Yes that is right! My \"M\" key and my \"V\" key are almost worn off completely so I guess its a good thing I don't need to look at the keyboard to know which letters are which. I type all the time, and while they keyboard is comfortable and works as it should I am disappoint that \"Microsoft\" of all company's would make a keyboard that the letters where off! Seriously?! Also I think the F keys are set differently. I swear F5 was refresh and this keyboard does not seem to have a key compatible with \"refresh\" which unfortunately I used often. I hope this review helps.",
        "Been only using this key board for a couple months, and nearly all the home row letters have worn off. Not sure who is manufacturing these for Microsoft, but they are failing miserably. I have been using 4000 series for over 10 years, and I still have the first one, and the only letter that is worn off is the \"S\" key. Quality Level Is Declining, As Is My Review.",
        "I type a lot on a daily basis. I found my computer keyboard before this was starting to hurt my wrist and it was getting worse, so I figured it couldn’t hurt to try something like this. I’m so happy I bought this. My typing amount hasn’t gone down any, but my wrist is feeling 1000x better. Like others who have reviewed this, I do find the space bar is sometimes difficult to press. That’s really the only complaint I could have with this, however.",
        "The last time I bought one of these keyboards, two months shy of four years ago, it was only $21. Why the magnitude in the change of price? I no longer believe in its bang-for-the-buck value. No keyboard that is made as cheaply as this one is made, is worth $60.",
        "As a software developer, this is the best functional and ergonomic keyboard I have found. I can type for hours and feel no cramps. Convenience keys (mute, volume, play/pause, calculator, etc) are great. It's a keyboard that feels so good, you forget it's there. The only bad thing about the keyboard is that the letters rub off way too easily. After a year or so, the most used keys are no longer visible because the key label is gone. If you are a pure touch typist, it's not crippling but for people who need to look at the keys every now and then, it could be a major pain. See picture.",
        "A good replacement for a Microsoft Natural Keyboard 1.0A. Due to a recent system build [upgrade from a 6 year old motherboard/cpu] - I discovered that the newer motherboards don't typically have ps/2 port anymore so this was a necessary upgrade as well. The only downside is that Amazon shipped the keyboard in the original box = no padding during shipment. Luckily everything arrived without any damage and in good working order!",
        "Item arrived in original packaging, no outer box, and it was crushed. I returned it. I currently own one of these keyboards and do love it. I was buying this as a back up. I can't type on a regular keyboard anymore. I spend a lot of time at the keyboard and this is awesome for that. My shoulders aren't pinched together in an unatural way, hence I don't have the fatigue.",
        "20 inches wide and 10 inches deep, this is a large keyboard. System did not recognize it when I plugged it into my highest speed USB port but easily solved by plugging into a lower speed port, after which it could be relocated back to the higher speed port. The built-in wrist pads and split-keyboard design ideal for users with arthritis and/or carpal-tunnel. Only complaint is how easily one of the flip-up rear elevation feet came lose (dimple broke off).",
        "I have used Microsoft keyboards for years and always had a good experience. My Microsoft keyboard I have been using for years had the \"X\" key stop functioning. I ordered a new keyboard and the day I got it the space bar started sticking and I had to return it. The 2nd Keyboard lasted a week until the space bar also started sticking. These keyboards are horrible quality and I would suggest you never purchase one.",
        "The big issue I have is the letters wore off of several keys. I now have keys that are just black and I can't tell what letters are there. Thankfully I know how to type but for a daily use keyboard there should be some way of better protecting the print on this",
        "Pros:Nice ergonomic design Cons: For some reason it tries to discourage use of the \"Function\" keys. Every once in a while the \"F Lock\" key turns off (I didn't press it I swear!) and then the Function keys stop working!! (So make sure the bottom most green light is on, or F Lock has been disabled) I never use: (There is additional MS software you need to load to enable these, but I don't think it's worth adding the bloat) All the grey keys on top (Outside the 1-5 buttons, they work in Linux just fine) The Zoom slider The Back and Forward buttons at the bottom",
        "I bought them for years. They used to be good. But their quality started getting worse and worse. I kept buying more and more of them, hoping to get a good one. None of them last a long time anymore. Keystrokes get missed more and more after the keyboard is a few weeks or months old. Especially the space bar. Finally I gave up and bought a much better keyboard with a different key layout. I'm still getting used to it, after so many years of using the 4000.",
        "I had this keyboard for many years and unfortunately I spilled a cup of coffee on it and well you know what happened. I wasn't sure I would find another keyboard like this but when I found this on Amazon I was thrilled. I order it and love it. It is so comfortable to use and there is no wrist fatigue. As far as I am concerned it is the best ergonomic keyboard out there.",
        "Microsoft has been perfecting this model for years. Can't say enough about it. Makes a world of difference with my desktop PC. Only thing I could ask is for them to put this out in a smaller footprint (and maybe without the num pad) for mobile/laptop/fits in the bag use. Have had to, sadly, go with another smaller ergonomic model that clearly was patterned after this superior and time-tested design. Will buy again as appropriate for needs.",
        "The ergonomic keyboard is great !!! Years ago the only keyboard was flat. Used it for years when I was working. Hands felt cramped. My last ergonomic keyboard gave up, and I had a spare \"flat\" keyboard in the closet. Had to use this for a little more than a week, before the new ergonomic keyboard arrived. How I hated the \"flat\" keyboard !!!!! Couldn't even type - had to do the \"hunt and peck\" method ! The ergonomic keyboard is so comfortable, and I can again type like a whiz !!!",
        "I bought this same keyboard about 10 yrs ago and finally had to replace it after a second coffee spill. The new one has a slightly softer key stroke, it's quiet and less clacky than most. Once you get used to this split, ergonomic design it's hard to go back. I don't use the pedestal that comes with it but love the palm rests. For the price, you can't beat this!",
        "This keyboard works exactly as expected. This is the second keyboard I own of this model. Just be aware that it has typical keys that require a lot of throw and typing pressure compared with low-profile keyboards. If you are used to that, then this keyboard is perfectly fine.",
        "I find the flat keyboards very uncomfortable to type on. If you use Microsoft Word I think you will appreciate the comfortable angle of this keyboard. The only thing they could do to improve this keyboard would be to backlight the keys. I type 50 wpm but still glance at the keys now and then! The price is decent. This is my 2nd one since I wore off the letters on many keys on my old one after many years of use. I picked up a bottle of clear nail polish to cover the numbers/letters on these keys to avoid repeating my error. I highly recommend this item.",
        "This keyboard functions as designed. Great hand placement. Keyboard is angled for natural placement and all the functions appear to work find. I've been using these types of keyboards for years now and it is more comfortable, at least to me. For those thinking about switching it does take a little to get used to but you will like it if you give it a try.",
        "Here's the scoop. For ergonomics, it can't be beat. It will take you a few days to figure out how to adapt but when you do, you will see an immediate relief of wrist/hand fatigue. I have transcribed for 20 years using these ergo keyboards and show no signs of CTS. HOWEVER...why not 5 stars? THE LETTERS RUB OFF ALMOST IMMEDIATELY. So if you're a light typist, you'll probably be okay for several months. If you transcribe, say goodbye to the A, S, E, H, K, AND L. The keys all work but the letters are gone. I haven't looked at my hands typing for years but if you need to, you may want to reconsider",
        "This is the 2nd Microsoft Natural Ergonomic Keyboard I have purchased. I have had one at home for 5 yrs or more and it's still in great shape. I just bought one for work. Using this keyboard alleviates the neck and shoulder pain I had been having sitting at my desk all day. I won't be going back to a standard keyboard.",
        "I've had these keyboards for a long time. After purchasing a new one to replace the old, I've noticed that some of the keys require a significant amount of effort to trigger, almost as if they are sticking (not firing when pressed). They will fire but only with a hard press, much higher than the others. Super annoying. Previous model, the Y,H,N,T,G,B keys all stuck (didn't fire when it should have). As someone who types for a living, this is more than disappointing.",
        "I've tried other \"ergonomic\" keyboards, but this is my favorite; it is just as though it was invented for me. This is the fourth one I've ever used, I just wear them out (read: get too much stuff spilled on the inside and don't feel like cleaning it out again). Better price than other types of ergonomic keyboards, too. Please keep making them.",
        "I've purchased four of these keyboards. Love the design and feel, but the printing rubs of FAR too soon. The latest one I bought, less than a year ago, several letters are already half peeled off. They need to address this problem. It makes no sense for letters to rub off within a year on an expensive keyboard.",
        "I love this keyboard!!! I had one when I worked in an office and would type for 6 to 8 hours a day nonstop! I now use it at home while studying for college. I love that my hands don't get fatigued with it and it helps me type so much faster!! I have it attached to my laptop at home and then when I need to take my laptop to class it just stays home and I take my laptop. Easy to connect and simple to use! So comfy!!!",
        "I can't use a regular non-ergonomic keyboard. Just bought this to replace my 6 year old one that survived multiple floods (me being clumsy and spilling my drinks on it, etc). Great for my wrists and love the smoothness to the keys when typing. Only complaint is that after only about 1-2 months of use, the C letter is already rubbed off. My old one had a few letters rub off over the years, I loved it because those people using my computer who need to look while typing had a VERY hard time using my keyboard. LOL",
        "I have tried probably 8 other keyboards over the years only to donate them. This one, with my numb carpal tunnel fingers, wrist and joint pain, is pretty perfect. I just keep buying them. In fear they may stop making them, I may buy 6 next time. Deaths generally from me stupidly spilling liquid in them. Otherwise, very durable.",
        "Normally I would give this a great review. Love the style, is great for long figures and very comfortable using. But the about nine keys on left side of keyboard stopped working after a few weeks. Had to return. Maybe it was just a fluke, but it was very inconvenient especially since it took longer than expected to arrive.",
        "The first one they sent never did work, returned to Amazon and they sent another. If all you do is want it to type is OK. If you want to program other functions, good luck. Comes with no software or instructions. MS will not support any issues if you buy from Amazon? I did find the software to make it work, but broke my MS mouse functions. I'd look for another manufacturer that supports what they sell. Amazon is great, but didn't realize them being involved in a sale changes product support.",
        "I love using ergonomic keyboards and this keyboard was a pleasure to use, however, I wish it were more durable. I've had a few of these, both at home and at my workplace, and unfortunately, the electronic switches and such start to fail shortly after the warranty expires. It's great for office work, especially if you type a lot, but be prepared to replace it about every year. Definitely do not recommend for gaming use.",
        "Very comfortable. Loved it at first. Accidentally spilled some water on it. Wasn't even very much, but it's now completely broken. The price has also increased from $22 to $35. Not happy. Also, the space bar on my replacement is very loud and clunky. Not excited about that since it's between EVERY WORD! The replacement requires me to unplug it and plug it back in every morning. If this keeps happening I'll return for a full refund. There are better keyboards. Final review. Product is junk. Sad, because it was comfortable. 😩",
        "T-his keyboard worked OK but started failing`g two years into a t-hree year warranty. T-he warranty documentation su`g`tests `coin`g to t-he web site but t-he web site doesn='t offer a way to file a warranty claim. You need to call into Microsoft='s automated p-hone system and t-he system doesn='t respond to +\"warranty+\". T-his isn='t an expensive keyboard but t-he lack of support tells me t-hat I s-hould switc-h brands.",
        "I absolutely love love love this keyboard! This is my 3rd purchase, only because I've spilled or am just flat out rough on them. I've tried other ergonomic keyboards and none are sd comfortable as this one. Once I got used to it there was no going back! I have tendonitis and work on a computer all day so this was a life saver.",
        "I like the feel of the keyboard--substantial and not thin or lightweight. There are many functions of the keyboard that I'm learning about and look forward to that journey of discovery. I don't understand the need for the \"skirt\" on the wrist/palm rest side (underneath) of the keyboard. It is an unnecessary elevation for me.",
        "Keyboard dont work right, they will not exchange it for one that works right, DO NOT BUY from this company !!!",
        "It cured my ulnar nerve pain. But shortly after the 30-day return period, the keyboard crashed sending unprovoked signals to the computer that caused stuff to flash around (the Windows menu flashed on and off like a warning light making typing impossible). There was no physical damage to cause this, no keys were sticking, it was an internal cross signal. The IT people confirmed it was the remote keyboard and concurred it was defectively manufactured. It was definitely coming from the keyboard. I replaced it with a Logitech and everything returned to normal. Now I am out $50.00. Logitech works better and cost less.",
        "Can't be beat for proper keyboard design. I use a keyboard ALL DAY. Mine all sit on slide-out trays and are at exactly the right height for me to keep wrists in a natural position and very straight. I think I have very low chances for developing carpal tunnel syndrome - - knock wood. I use these keyboards for my Macs too! There's a keyboard mapping App called Karabiner - that lets me make my keys be the same as on my PCs (in the office) but with Mac functionality. I do think Apple is missing the boat by sticking with just a \"straight\" keyboard.",
        "Love the keyboard to the max!! If you were taught to type proper and you spend lots of time in front of your PC this keyboard might be for you! It does take a slight adjustment to keeping your hands relaxed at the wrist in a more natural position then proper typing form with elevated wrists but even gamers can adjust easily; WASD and ALL your macro/hotkeys are set apart from the other side and makes finding those keys in the heat of battle just THAT MUCH EASIER!",
        "I have been using this style keyboard for over 20 years so I am likely biased. But I use the standard flat keyboards all the time as well and this one is so much more comfortable for my arms, wrists and hands. My old one finally died so I replaced it with a new one. Was happy they were still selling them.",
        "Very nice looking keyboard but much bigger than expected. I still own one of these that is probably over 10 years old and it still works but the keys are getting noisy. This new one was very quiet everywhere except the space bar which sounds like a clicking/tapping sound from an old typewriter. It is obnoxiously loud compared to the rest of the keyboard. Unfortunately it is so loud that I fear it would annoy people I sit near at work (it annoys me and I'm the one typing) so I'm returning it and will try something else. Too bad.",
        "I purchased one of these when I began having symptoms around 2004. At that time I spent about 6 hours a day on the computer. My symptoms went away immediately and I continue to use the same style keyboard. It does take time to adjust, but is worth the effort. If you type well, it is seamless. If you peck and search, it is worth the effort.",
        "This keyboard has a great feel and is great for my 8 hr office job..which is saying a lot since i have a closer relationship with this keyboard than my own husband. However the letters wore off very quickly, and I have been searching for about a year for stickers to cover they keys. I'd love to make this keyboard last longer, since there is really nothing wrong with it..but I need to be able to see the letters at times. 17+ letters are now gone..and more are fading. Disappointing since I now have to spend money on a new one due to a simple issue of ink on a key.",
        "As a Risk Management professional I understand the importance of using an ergonomic keyboard. It does make a difference and assists with the prevention of injury. I have an ergonomic keyboard at work and decided that I wanted one for home. It was important to me to get one at a good price. This keyboard has worked beautifully and I'm very happy that I brought it home. I asked my daughter to install it which she did with no issues. My daughter has begun using an ergonomic keyboard and hopefully she will continue. Based upon the price and performance I can definitely recommend this item.",
        "I learned to type on a keyboard just like this, I like the ergonomic feel and the way the keys feel, the space bar is a little harder to press than the other keys, but I really don't mind that. The only thing that I would say is that depending on use, some of the letters on the keys will fade away after a couple years (just for reference I use mine every day).",
        "Microsoft did a good job making this keyboard. It takes a little getting used to, but it does not hurt my arms after typing for a long time. it has programmable function keys and extra keys that I hardly use but it is built in a way which is comfortable to use. Others who don't normally use an ergonomic keyboard may find it difficult to use though. It is naturally raised.",
        "I had been using silitek sk6000 keyboards for many years but my stash has run out. This is the closest keyboard to that one. Works fine, good hand position but the keys are noticeably mushy. Nothing you can't get used to but IMHO bad enough to knock off a star. I have one at work plugged into a dock and another at home. My home work machine still has a working sk6000 on it.",
        "Bought this keyboard in 2012 and have been using it Monday - Friday since then. No complaints, works great. Takes a little time to adjust to the layout. Some of the pad covering on the left side has started to wear off after all these years, but I would expect that after 8 years of regular use. I would definitely buy this keyboard again.",
        "I love this keyboard. The keys are quiet and do not make any noise. I will be able to really tell how much I enjoy it in a few weeks due to me jamming my right hand and it's hard to type right now. However, the flow of the keys seem more natural and the way my hand lays is more comfortable. If you have never typed on a keyboard like this it won't take but a few days to get comfortable with the layout. I would advise you to just try it. It's a really nice product.",
        "This is my third Micro$oft ergonomic kb in the last 20 years. That's an average of 10 year life span which is remarkable.",
        "Between my work and my play, I generally spend well over 8 hours a day on a keyboard. This ergonomic keyboard proved less straining for me to use for long periods and has helped stave off the dreaded \"carpal tunnel syndrome\" so many heavy computer users fall prey to. I have just pain worn out two of these already. They stopped functioning as intended, but I definitely got my money's worth out of them first! I heartily recommend it!",
        "Typing is such a breeze now. I've had it for about a month now and I'm so glad I finally bought it. Update: Had it for a year. Still very happy. And yes the letters on the keys do wear off. So what I did was paint over them with clear nail polish. It did the trick and they haven't worn off anymore. I suggest you apply the polish before you begin to use it. I spilled water on the board and the V stopped working. So i ordered another one. I've been using a standard HP keyboard and I realize how much easier it is to type with this one.",
        "It's a good keyboard. It will help with your carpal tunnel (like I have). HOWEVER 1) No backlight. Seriously? EVERY KEYBOARD THESE DAYS HAS A BACKLIGHT. (Let alone a motion sensor backlight) 2) The function keys. Right next to F12 (hounded by most programmers) is a \"Disable function keys\" Really? Genius. 3) #1 kills it, #2 kills it more Bought a Tesoro Lobera Spectrum and the Brown Cherry Mx keys have helped out. This piece of crap lays on the floor..",
        "This is my second time purchasing this keyboard. Last one lasted 5 years and I abused the hell out of it. The keyboard design makes it much easier for me to type for long periods and noticeable increase in touch typing speed. The keyboard is dropped on the floor 2 to 3 times a week not a single problem works great unless there is an amazing advancement in keyboards I will purchase another one of these when I finally destroy this one.",
        "No one makes ANY comparable keyboard that offers any comparable features of your toggled optional modes. Some things can't be exactly copied and the Microsoft Ergonomic Keyboard is one of them. No more expensive than the psuedo-copycats when you buy it from AMAZON!",
        "I've been using these split ergonomic keyboards for years, and they really make a difference in wrist comfort if you do a lot of typing. Admittedly, they're a little awkward to use at first because of the split keys and the tilt of the keyboard, but you'll get used to it very quickly because the posture is so natural. This particular keyboard is great - high quality. I've had mine for a couple years now and it still works like new. No sticking or bad keys. A great choice to go with if you do a lot of typing.",
        "I use split keyboards because I simply HAVE to, due to severe arthritis in hands. I have purchased several of these keyboards, and they reliably quit working for me in 3-4 months. Press one key and get 2-3 different characters. I purchased this current one on July 16. It's November 5th and the \"P\" key and the \"[\" bracket key already require an extra backspace to get rid of the g and h that appear along with them. Hitting 3 of each would give me pgpgpg [h[h[h. The keyboard is comfortable, but NOT durable. Buy it only if you can afford to replace it every 12-16 weeks.",
        "This keyboard hurts my wrists. I spend a lot of time programming, so I thought I would like this keyboard given the claimed \"ergonomic\" design and based on positive feedback from some colleagues. I've had this keyboard for about a year or so, and I really dislike it. The upward slant and elevated keys irritate my carpal tunnel syndrome. I also don't like the actual key action. When you press it, it's too soft and it takes too long to push down all of the way. I think I'd be better off with a mechanical keyboard or a slim keyboard with chicklet keys.",
        "Hands down the best keyboard I know of for serious work -- not a gaming keyboard obviously. I have bought several of this model for years for different computers, and they last for a long a time. The only thing that happens after a couple of years of heavy usage, the letters on the keys start fading. Wish Microsoft could fix that. Other than that, a solid product.",
        "I love this keyboard! I originally purchased one 6 years ago to use at work where I was on it 50-70 hrs a week. Other than the space bar being noisy, it was exactly what I was looking for. Recently, one of the keys stopped working, so I shopped around and purchased a different type of keyboard that was said to be ergonomic and wireless. THAT keyboard was absolutely terrible, so I returned it and purchased this one...my old stand by. I was pleasantly surprised to find that this updated version has quieter keys (including the space bar). The only thing that would make this keyboard better is if it was available wireless.",
        "I was using the keyboard fine and then it stopped working after 2 months. The keyboard just stopped responding to any presses. The lights come up but no keys works. Tried using on different PC and OSes, same issue. Ended up buying a different brand keyboard.",
        "This keyboard simply REVOLUTIONIZED typing for me. I struggled for decades to hit the right keys with the slabs of ham I have for hands, constantly hitting two keys at once, and getting utterly lost on the keyboard every few keystrokes. I even tried a keyboard with extra large keys, and a keyboard with brightly color-coded keys. No good. Finally I bought one of these. And suddenly I could type. Absolutely amazing. I do not use the plastic riser that fits onto the front. I simply steady my hands lightly on the big padded areas that are part of the keyboard itself, and off I go. For once, I can truly say \"Thank you, Microsoft!\"",
        "I have used this style keyboard over the last 20 years working as a medical transcriptionist - It has saved my wrists and elbows TREMENDOUSLY from what could be quite painful after doing this job for a long period of time - My keyboards usually last for at least a year or more - they do not stand up well to having a beverage dumped on them - what keyboard would - I have a very powerful keystroke - so eventually some of the more used keys just wear out - and after at least a month there are no longer letters left as I have worn them off - I LOVE THIS KEYBOARD....",
        "I was using the Logitech K350 previously and even though it uses a good palm rest, it was getting difficult to type. I wanted to check out these ergo keyboards and tested it out at best buy and bought one. However, as soon as I unlocked one of the levers of the palm rest, it became ridiculously loose and I returned it. Purchased the keyboard from here as it was $30 ($4 cheaper than crappy buy, whose quality in products as dropped and is a ghetto store since especially since circuit city closed down and competition reduced; which in turn has caused my businesses whose competitions close down to drop their quality :( )",
        "**update** 12-2-16 I would still love this keyboard EXCEPT I can't read the keys because the letters have disappeared! I tried painting them back on and the paint won't stay. VERY DISAPPPOINTED at this point!!! Microsoft should be ashamed! I should have returned it. This taught me a lesson. I love this keyboard but some of the letters have worn off of the keys in 2 months time...not ideal. I wonder how much worse it will get.",
        "I have one major gripe about this keyboard. We've had it less than a year and the letters are already worn off of four of the keys. It's a quality issue; the key labels aren't etched into the key. they are just painted on top of the flat key. So they wear off very quickly. I expected better quality from a Microsoft keyboard and also for this price. Also, we aware that this keyboard is too big for many women - my wife has a hard time using it. Due to those two factors, I'll be replacing it soon.",
        "It has helped my wrists so much! I've been using it for a few weeks now and have had quite the improvement in wrist pain and discomfort. There are a lot of buttons I dont know what to do with and it disnt come with a booklet. I'll have to do some research, but otherwise, it's been great!",
        "I love this keyboard! So comfortable and it resolved my tendency for tendonitis. After a few years of use, eleven of the keys are hard to distinguish... three of the keys are now blank. I'll by keyboard label stickers before I'll give up this keyboard.",
        "I do a lot of typing at the computer, and I prefer an ergonomic keyboard. This one more than meets the requirements. My hand position feels natural, and the keys have a smooth feel. I feel that I can type a bit faster and more accurately on this keyboard than on my previous ergonomic keyboard This keyboard has a number of keys that can be programmed to do such things as zoom or open the email program. However, I have been using mouse clicks for so many years that I almost never use those keys. Still, I imagine some people would find them useful.",
        "this keyboard helps relieve my carpal tunnel stress so much. i have it both at home and i work. using these has helped me gain strength so that i can hold things and not worry about randomly losing strength and dropping them. plus there are so many additions to the keyboard, like volume control, pause/play, mute.",
        "I'm sure this is a great keyboard--all of my family loved it. But I bought it for myself. Keyboards are very personal, and this one just didn't fit me. No one's at fault here, it just didn't fit me. So my search for the perfect keyboard--nine years and counting--goes on. (Family members would have this but already had keyboards that were \"good enough.\"",
        "Overall like the layout. But, half the keys stopped working after 2 months. Reloading drivers didn't help. Irritates me to no end that Window 10 is not compatible with prior natural keyboards. I have two that wont work with my Dell XPS/window 10 operating system. I am returning this 4000 and will try another. I'll revise the review if the second one indicates I got a \"Monday morning\" keyboard with the first one.",
        "I prefer this keyboard because of the angled and spread layout of the keys. For me it does fulfill its name of \"ergonomic\". The only improvement would be the extra large \"carriage return\" key of the old IBM Selectric typewriters, but we'll never the those again. A bought a pair because the price was below usual retail, and these do breakdown. It takes only one bad letter key to render the whole keyboard useless. This is the fourth one in maybe ten years, so quality/durability may not be the greatest. This is a large keyboard that takes up quite a bit of real estate on your desk. Oddly shaped 20\" widest, 10-1/2\" front to back.",
        "This is my 3 one over the years. The last one I fried. I had a short in a lamp cord and it was right beside the keyboard. I actually saw the spark transfer. It did not travel to my computer. That was lucky. Excellent keyboard.",
        "I bought this keyboard at Best Buy and brought it home to Venezuela to use a replacement for one I bought a few years ago. After a few months I installed it and much to my surprise the space bar doesn't work. On checking on-line I find that this is a problem that has occurred a number of times and there is no solution that I could find.. You can get it replaced under warranty but that's not much use to me considering where I live. I had to reinstall the older one which works just fine - it's just wearing out.",
        "I definitly love this keyboard. For the past 26 years I've used just \"standard\" keyboards. But with me spending so much time out of my day at a desk, I felt it was important to ensure the long-term comfort and health of hands. While much of my strain comes from using a mouse, the keyboard is also a heavy burden. I was worried about the hand position on this thing and that I wouldn't get use to it. Within a day I was very comfortable with it. I'm glad I switched and now I wish every workstation I sat down at had one of these (and none do!). It's a great price for a great keyboard.",
        "This is great if you have Carpal Tunnell. I will admit it took a little getting used to the split keyboard- maybe about a week. Once I did though I never went back. The height And angle is just right. I love having the number keypad since I deal with numbers all day.",
        "As someone who has issues with wrist fatigue and flexibility, this is a must. When they say \"Natural\" they mean it. My hands fit right where they need to be and my wrists feel exponentially better. Don't be intimidated thinking that you will not get used to this change. After a few emails you will wonder why you didn't get one of these much earlier. I feel like I am cramped when I use other keyboards now. I hope they cam make wireless keyboards at a reasonable price point in the future! Until then I will be using this and I am very happy.",
        "I've had this keyboard (using just for work) for three months and the keys are sticking terribly. Nothing like clickity clackity along and getting 12 n's in a row (or t's or u's). And now it's too late to return. Really cuts down on productivity when you have to stop every other word to fix words."
    ]
}