{
    "entity": "Keyboards",
    "text": [
        "Keyboard works just fine, it's durable and easy to type. I had no problems with this part. The \"moue\" however is horrible. Like another reviewer stated, you have to push down on the button to get it to move, and mine was extremely stiff and eventually hurt my thumb after just a short while of casual usage. It is finicky, does not respond well, is not even remotely accurate and is just plain bad design. I would recommend a bluetooth mouse to go with this keyboard and skip its mouse entirely. Everything else worked great and was configured very quickly.",
        "A few things I didn't pick up from the description before I bought it: 1. This is an IR keyboard so you must have an IR receiver in your PC to use it. 2. Because it is IR, you can program it to do your TV functions as well (NICE!) 3. The \"track-stick\" is kind of a pain, but you get used to it. 4. The multimedia keys are back-lit, but not the whole keyboard. 5. Works perfectly with Windows 7 Media Center Overall, it's a very good value for the money. I am considering buying a 2nd one just in case these disappear and I need a replacement.",
        "Something I missed from the description (although not others comments - wish I'd read them) is that this keyboard DOES NOT INCLUDE AN IR RECEIVER! As a result, it only works with computers that shipped with windows XP media center edition and included a specific IR receiver. Only consider this keyboard if that description fits your computer. Pity, as it is well built, looks nice. Something that critical should really be in the product description though.",
        "Great for watching videos on my plasma tvs over the internet. I already have an infrared remote so it works perfectly with the ir receiver. Despite being IR, it works at all angles and seems to have excellent distance, way more than my rf keyboard. I Bought two keyboards for two different tvs in my house, one works great. On the other board, the mouse responds much differently, it seems to move much faster and that does not appear to have anything to do with breaking it in. I think they will always be different and so kind of a pain when using the other one watching tv in the other room but still manageable.",
        "I wound up returning this. There are better Media Center options out there (See Gyration stuff). Here are my gripes: - Requires Media Center IR receiver - not included - Pointing nub is very difficult to use - not useless, but really not good - Line of sight needed - this is obvious, but there are options that don't require line of sight Overall, the difficulty using the nub was the deal breaker for me.",
        "A great keyboard with an esthetically pleasing and very ergonomic design. I have a media center in my living room and it completes the experience well. All the shortcuts keys to for the media center are right there. As many reviewers, I had a hard time with the pointer to control the mouse but by going to the control panel -> mouse and reducing the cursor speed (nearly to the min) it ended up working nicely.",
        "- Easy to get it working - Package from Amazon was new and perfect - Great functionality (sleep, dvd menu, MCE menu), volume, channel change It is of course directional being IR. I'm using it with Vista Home Premium edition and both this and my IR remote seems to get stuck every once in a while - for instance if you are doing down menu it keeps going down and does not stop. Only reboot fixes that.",
        "This keyboard remains the best Home Theater Media Center PC keyboard I've seen to date for size, comfort, ease of use and price.",
        "I purchased this product despite reviews of poor mouse quality. The mouse is different than expected, but not in a bad way. The trick is to be aware of the pressure you exert in a particular direction with the mouse. I have owned this keyboard for less than a day, and I have already adjusted to the mouse. To reiterate other reivews, the reciever is NOT included, but this was not an issue as I already had the Media Center remote control and reciever. I have used this keyboard with both Windows XP and Windows 7, absolutely no issues with either one, and incredibly easy setup; no software needed.",
        "Point of fact I never took delivery of this device though I did order it. Attempted to purchase this keyboard which seemed perfect to control WMC but turned out seller was out of stock when they took my order. Amazon quickly refunded my money of course but I'm still not sure what disappoints more: 1) the seller advertising on Amazon what it doesn't have in stock or 2) not being able to acquire this device anywhere any longer because believe or not Microsoft makes excellent hardware designed to work specifically for Windows products better than anyone else.",
        "I could go on for a hundred words but the gist of it is that this is just no good. Pointer/mouse is useless, keyboard works ...most of the time, but not consistently enough to use without constant aggravation.",
        "This product would have been great if it had been clearly marked that you need an Infrared Sensor hooked up to your computer in order for it to work. Some computers come with them, most don't. If you are looking to buy a wireless keyboard with built in mouse I suggest a different product. By the time you buy everything you need to get this one working properly you could buy a nice WiFi keyboard.",
        "The keyboard is nice, but unfortunately I didn't see anything in the online information regarding it not coming with a receiver. I now have to either return it or purchase the receiver to connect to the PC",
        "Even though I have the proper version of Windows Media Center and even though I have the correct type of IR receiver (which has to be bought SEPERATELY) the keyboard still will not work. Ironically, it will work with the XBox (which I found out by mistake when it turned on my Xbox when I was trying to figure out why it was not working with my computer). Save your money and buy something that will actually work.",
        "the keyboard is rock solid, and surprisingly works with the xbox 360, but it does not come with an IR receiver. Because of this, it is pretty much useless for a computer as the computer will have no way to interface with the keyboard. If you have a Media Center Edition computer that came from a retailer with the IR reciever than it will work great for you.",
        "First, you have to locate and download a patch for media center to get this to work, not a big problem. More importantly, this operates via IR which I thought would be OK, but ended up being a major problem. I often lost key strokes when typing. Also the \"mouse\" portion is difficult to use because you have to press down fairly hard to get it to register. I would not recommend this.",
        "I like the keyboard, but it just sits there because I don't have Windows media center and the IR receiver that came with my video capture card doesn't seem to recognize this keyboard. I'll probably install Win 7 soon so this hopefully I'll get this up and running, but until then I'm forced to go up to the machine by the TV and use the old wired keyboard. More work to be done setting this keyboard up....",
        "Item as described. Great price. Fast shipping. I use this keyboard to watch movies or surf the web while still in the bed!",
        "I bought this keyboard not knowing what you expect, when it arrived i was so excited to open it and put it to work, come to find out it works only with xp and requires an infrared receiver,bummer,my laptop has neither,so i had to buy another one and the feel of it is way not close to the Microsoft. I wish they ould make one that is windows 7 compatable and 2.4GHZ capable..If one could be make i would surly purchase one. Sonny",
        "I like the keyboard, but the little joystick mouse replacement is really difficult to use. You need to push down on it, but only the perfect amount, too much and it doesn't work.",
        "The product is advertised for Windows XP Media Center Edition, but works fine for Vista Home. Despite any advantages this wireless keyboard has over wired versions, it fails when it comes to the mouse functions. Remember when you used the touch button on the center of you laptop keyboard the first time and thought, \"That's awkward\" but soon enough you got used to it? Well, this one you won't get used to. Please, Microsoft, make one with a touchpad.",
        "I am using this product with XP Media Center Edition. Has quick keys to manage playback of media, infrared reception is OK, battery duration is reasonable, it feels confortable as a keyboard, but please FORGET ABOUT THE POINTING DEVICE, IT IS USELESS. I finally ended up purchasing a high range optical wireless mouse. Much, Much better.",
        "This kb/mouse combo is horrible and underdeveloped. The mouse button gets stuck, the IR connection is very weak and the mouse knob is extremely sluggish and unusable. I do not recommend this keyboard as you will be disappointed.",
        "Arrived in appropriate time without the receiver. Luckily my old receiver still works. The item was clean and works well.",
        "While I'm sure this MCE Keyboard is awesome, Its a damn paperweight if you do not already own an IR Reciever as it does not come with one. Essentially I bought a cool looking showpiece because Amazon neglects to even mention this fact. It is still my fault for not checking reviews. Buyer Beware.",
        "This is just what I needed to interact with my Media Center PC that I have tucked away in a cabinet. Works wonders!",
        "Simply put, I thought the keyboard was backlit. I should have read closely...only the media keys are. WHATS THE POINT? Backlit = dark room...duh! Then as it shows up with this minimal disappointment, I find that there is no IR receiver with it... what a rip off! I will probably return it even though people say the keyboard is great, I'd rather go bluetooth. DIRTY POOL.",
        "iam still using this unit and it work as expected no complaints i will ask family to buy if they are looking for a good piece of good equipment",
        "DOES NOT COME WITH IR RECEIVER. its a paperweight without it. why no one else mentioned this in reviews before I have no idea. weak sauce.",
        "I don't like this product. The keyboard function did not work consistency. The pointer did not work.",
        "Set up easy. Mouse takes some getting use to, but was a good buy. Would recommend this product and seller.",
        "I actually started with this keyboard and a few years later tried a blue tooth logitech keyboard. After using this one for so long, the logitech just doesn't feel right. This keyboard feels \"natural\" when using with media center. My only two cons would be the IR--bluetooth is way better, and the mouse pointer. It takes a while to get use to, but it could be more user friendly. I would give this 4.5 stars if I could just get a blue tooth version.",
        "I bought one of these a few years ago -- it was close to useless, as if you type faster than about 1 keystroke per second, it drops keystrokes. If you type \"amazon\", it's likely to come out as \"an\" or maybe \"aao\" if you're really lucky. Since it failed in the modest task that was its charge -- I mean, come on, how do you use a keyboard on which you can't type? -- I rate this as the worst keyboard I've ever used.",
        "The first week I thought I was the problem and continued to work with it but it hasn't gotten any easier to use or any more reliable. Very rarely does it pickup all of what I'm typing whether it's a web address or an email. Half thte time the arrow buttons work to navigate through the Windows Media menus and the other half it's the specific buttons you're supposed to use. Don't waste your money.",
        "I have a new HP HTPC; loaded and runs flawlessly. I purchased the keyboard as the icing on the cake; but it didn't work. The seller stated it would work with Vista 32--as did Microsoft; but after days of searching the web I cannot find a driver update that enables this functionality. Windows Update shows there are no available updates; but it just will not work. A real shame; as the keyboard has a great advertised range and is aesthetically, very pleasing. I am very disappointed!",
        "Using this with Vista Ultimate. Range is fine, and it doesn't need a direct line of sight to the receiver. Having the additional functionality of the full keyboard and mouse is great, I've been able to disconnect the dedicated set and still have full control of the PC inside and outside of Media Center from the couch. While not required, this certainly adds to the usability of this as a regular PC. It also makes media searches and labeling much easier. The backlit media keys are great when watching movies. The form factor is easy to store (slides unnoticeably under the front edge of the couch) and is light enough to easily hold one handed.",
        "As mentioned, the layout of the keyboard is great... It's comfortable, has most the shortcut's I'd want, however it's designed for Media Center, and Media Center only. No IE/Internet shortcuts are present, which in my opinion is a bad design. Everyone that has a Media Center PC, also has Windows XP \"professional\", which could use those short-cuts. My largest gripe about this product is the mouse. Why Microsoft makes you press downward, in addition to the direction of the mouse is beyond me. We've had it about a month now, and despite other users saying it gets better with time, ours has not. I was expecting a laptop-like fingermouse, and that's not what this keyboard has.",
        "The mouse button is not very easy to use and my keyboard stopped working after 2 years (yes, i check the batteries)",
        "For the price you pay, you'd think it would at least be functional. I should have read the reviews before purchasing. I thought the mouse was defective and almost through the keyboard through my wall in frustation. From what I've read, it's just the way it is.",
        "The keyboard portion works great, but the mouse leaves a lot to be desired. The keyboard has a good feel and operates quite far from the receiver. The mouse is a pressure sensitive button that goes from no motion to jumping a significant distance making it hard to select things on the screen. Even with practice it is almost unusable.",
        "Agree with previous comments regarding pointer being difficult to use and getting better with more use/experience. Other than that, I'd recommend an option to have ALL keys lit instead of just the keys to either side of the normal keyboard. Would be a drain on battery life, but would make it much easier to find certain keys in the dark (e.g. Backspace, Delete, etc.).",
        "Amazing keybioard stylish and functional but you will definitly need the IR receiver from microsot, it will work if u have a remote control wit a receiver also by microsoft. go for it... if you need MSN, tv, music functions...!",
        "I was a little disappointed. Mouse is weak. It's convenient. Feels pretty good in your hands. At worst it's a nice keyboard. I'll probably get my money's worth. I don't expect it's the best of its kind.",
        "I like the keyboard but find I am always hitting the wrong keys when typing. I am using my old keyboard now and am much happier. If anyone wants to buy this one, $15 plus shipping."
    ]
}