{
    "entity": "Keyboards",
    "text": [
        "While I consider a high quality ergonomic keyboard essential to any office worker, I cannot offer comparisons between brands. The price for the Kinesis is a bit ridiculous, it's comparable to similar models. Any well designed ergonomic keyboard will reduce (not cure) discomfort, and significantly increase typing speed and accuracy. Cons: Esc, F-keys, and programmable buttons are small and not mechanical-- you will miss-click them occasionally, and other reviews report them breaking sooner. I do find the Esc key to be fairly annoying, since I use it a lot. There is not a single empty mechanical button on the keyboard where we can assign a macro. Pros: Everything else. After about 2 years of use now, I rate this 5/5.",
        "Comfortable. Beautiful form. Great keyswitches. I just wish they still made it in beige, with the more beautiful, rounded, old style keycaps. I also wish the frame was sturdier to reduce noise while typing. That said, it is the best ergonomic keyboard for the price. Note that, if this is your first ergonomic keyboard, you will need to spend some time getting used to the layout before you will be able to type quickly on it, but once you get used to it, it is a pleasure to use and even faster than typing on a standard keyboard.",
        "Love this keyboard. My daughter suggested it as a way to get rid of carpal tunnel symptoms and I have not had any since starting to use it about a month ago. Initially it takes some getting used to as most of the keys are in different positions, but after the adjustment period of about a week or so, it's fine. Now it takes some thought when going back to using a regular keyboard, though! It is also programmable if you really want keys to be in a certain space. Expensive but worth the charge!",
        "I couldn't get over the arrow key placement, so returned it. Also, I had to move my fingers way too far when typing. I found I had less key-press distance on my apple keyboard - which I know isn't ergonomic - but the I felt the stress on my hands when using this keyboard actually increased. I now have a Matias Ergo Pro, and I have the same key-press distance problem, but no arrow-key problem. I would love to see an ergonomic keyboard with a shorter keystroke!",
        "This keyboard is awesome, my hands were starting to hurt (minimally) and I wanted to prevent a serious injury, so I bought this keyboard, and now I could never go back to a normal keyboard. Also, my typing speed increased by about 25-33%, initially however it was a pain trying to learn to use this keyboard, but once I got the hang of it (about 2 weeks), I now type about 90-100 wpm (my max on a 'normal' keyboard was about 60-70 wpm)",
        "let me start by saying this thing isnt' worth the price...i understand that the construction is rather intricate and probably does cost a lot to produce however the markup is pretty high. it took me about 3 days to get comfortable with this. I still struggle with keyboard shortcuts that my fingers are so used to on normal keyboards but i think I could learn them if i really tried. as far as hand and arm positions. it's pretty great. i have a standing desk and this thing works perfectly for my body structure. nothing is strained and the keys give you nice feedback so you know you pressed them.",
        "I don't give 5 star just because the keycaps are not what I want. Whatever, the ergonomic design has no rival so I decided to keep it. The eight blue keys are good (maybe PBT?). The other regular keys are just of ABS, and ESC/F1-F12 keys are surprisingly rubber buttons... like the ones on your TV remote control pad. My hands are very small and the It's hard to touch ctrl/alt/pgup/pgdown/home/end with my thumbs. That's sad for me. However the keys on the \"contour\" are easy to use, even for the \"[]/\\,.\" keys after several hours of practice.",
        "Despite a few foibles with some macros not always acting as expected and some unexplained key behavior, the layout is so above and beyond a traditional keyboard that it makes up for any shortcomings. High learning curve but worth it. You also will struggle a bit if you go back to traditional keyboards but I won't be. Not having to reach for ctrl, delete, backspace and enter keys is a godsend. The F keys are unstable, but I don't use them enough to be worried or have made macro workarounds (caps lock for esc for vim users).",
        "After switching to the Kinesis keyboard years ago, my wrist problems slowly disappeared. Because of my experiences, I always recommend them for recuperative as well as preventative reasons. This is the fifth Kinesis keyboard I have bought over the years for my family. All are still in use, the extra ones were for siblings, nieces, or children. They last forever. The only issue with them is that they are very pricey. However, I'd rather spend the money on a keyboard than lose the use of my hands. If there was one thing I'd change on them is this: I'd like buckling spring keys instead of what they use now. This would make the keyboard even better (but noisier).",
        "I have carpal tunnel in both hands, but I really enjoy playing pc games. I bought this to help with playing World of Warcraft, its definitely improved how long my hands can go without pain or numbness. I'm not good enough to type with it yet so I still have my old keyboard attached for chat. For gaming its definitely super comfortable and lets your hand take a more organic position. And you can really play around with keybinding once you figure out where your hand rests the most naturally. My only complaint is the price, thats just crazy for a keyboard. its definitely a only if you really need it kind of product.",
        "Sometimes you really can just throw money at a problem and it will go away. My pinky felt like it was going to fall off my hand and this keyboard fixed it. There's two learning curves: training yourself how to type on it at all, and then getting used to switching back and forth from the Kinesis to a standard keyboard. Both are second nature now, and worth the time and money.",
        "The Kinesis Advantage keyboard is simply the most comfortable keyboard I've ever used. However, for those interested in buying the keyboard, I gave it four stars for ease of use because of the time it takes to get used to the new key lay out. Once you're used to it, the key lay out is significantly more efficient. Construction quality is does not differ from any other keyboard. It's a box of switches in a black plastic shell. For the price, I thought there might be more to it. In conclusion, I love my Kinsesis keyboard and I'll probably buy another one if it breaks. Yes I would recommend it to a friend as long as he could afford it.",
        "I was skeptical at first if this keyboard was worth the price. After working 2 shifts (16 hours) I became extremely proficient with the keyboard. My carpal tunnel symptoms abated and no more arm/hand fatigue/pain. I've owned it for almost a month. I don't know how I survived 20+ years transcribing without it!",
        "Over 300 bucks is a lot to spend on a keyboard, but the Kinesis keyboards I've had in the past lasted many years. I have one going on 10 years old. My second one (this one) has failed at only 4 years old (1 year out of warranty) and Kinesis have abandoned the KB500 and no longer stock replacement parts to support it. Only option is to bin it and buy a new one at $350. Not what I expect from a high end, expensive product.",
        "Love this keyboard. I was experiencing hand and forearm pain and this keyboard helps the position of the hands to minimize strain.I love clicky keys (makes me feel productive). Others may find it loud. I like how you can remap the keys. I used keyboard stickers to rename them.Will it cure RSI pain? Probably not, but it is an excellent tool to help.I also added the Logitech trackpad which helps too. PS- I cured my RSI pain with a book called \"The Mind Body Connection\" by Dr. Sarno. Some may not agree but it worked for me.",
        "This is an amazing upgrade to a stock keyboard or any ergonomic keyboard I have tried. While it didn't help my spelling once I got used to the fact that my fingers didn't have to travel so far to type, and a few keys are in a new position, I sped up and relaxed more while writting. I will be buying more for my kids and my wife. I would warn folks though that the USB ports on the keyboard are more or less on the bottom. I use those now for a Bluetooth dongle and a dedicated handset cable so I don't have to keep flipping the keyboard to access ports.",
        "Pros: - I type faster on it than any other keyboard - Key remapping feature is nice - Still works like new after 4 years of use Cons: - No noticeable effect on carpal tunnel - Key bays for the two hands are still too close to each other - The thumb keys have visible circuitry underneath, probably not water-resistant",
        "It takes some getting used to; I was using a standard Apple keyboard before this. It took 1-2 months to get back to my old typing speed, and I'm still hitting wrong keys after 3 months. However, both wrists and my left pinkie finger feel much better, and I love not having to reach for anything. The multiple thumb keys are wonderful. You can program any key to do anything, and that is really great.",
        "Needs some getting used to. I would not recommend for anyone with essential tremor. It has some well placed keys like the backspace and space keys but the Ctrl key is in an awkward place. The curvature makes striking the correct keys a little more difficult if your hands are shakey. No numbers pad but one can be created through one of the keys in the top row.",
        "Overall I love this keyboard, I think it is worth the steep $300 price tag. I've read some other accounts of using this keyboard that say it took two weeks to get comfortable with it, which is consistent with my experience, so the time it takes to learn is less than a month. The benefit is greater comfort, less strain, and faster typing. If you are going to be typing a lot, it's worth it to minimize the damage. Also, it looks like something Data from Star Trek would use to control a simulation in the holodeck.",
        "We have several of these keyboards in house. Once you get used to them there is nothing at all better out there for ergonomic keyboard construction. It's sturdy; the keys are solid and well attached. But, more importantly, I can type for hours on this Kinesis and not have the many aches and pains I get on other keyboards. If you are open to try something new, you will grow to love this keyboard.",
        "This has most likely saved my wrists from carpal tunnel. It was well worth the price and has done everything it claimed to. I use it for every purpose and chafe at using any other keyboard (I'm using it to type this review). Other people have said that the square brackets and curly braces can be difficult to reach when programming; I have not found this to be the case. While the positions *are* a little awkward, I find them no more awkward and difficult to adjust to as, say, the thumb keys.",
        "great product but have to retrain yourself and some keys are in different places to be more ergo. You can set it for MAC, PC or Windows. Check out the research and science behind it. Well worth the money if you keyboard much. I've owned three and sent one back to the company to be refurbished for minimal cost.",
        "In over the two years I've had It I used and abused this thing as a transcriptionist working 20-30 hours a week, putting heavy typing on this keyboard. I have worn out the wrist pads and lost a rubber foot on this keyboard. I contacted Kinesis customer service and they promptly replaced them free of charge when I inquired about it.",
        "Took me a month to get used to it. But I do prefer this to other keyboards. Not only I'm slightly faster, but it is definitely better on my wrists. I also enjoy how easy it was to change the keyboard mappings without having to deal with OS'es crap (I use multiple different OS'es, each one has different hacks to remap keys).",
        "From an ergo standpoint, this is the best keyboard ever. Plus, get this, your typing skills will go up... and no one will want to use your keyboard... THey will just look at it and groan. It takes a week or 3 to get used to... but, once you are... you would never dream of going back. I own 4 of these things now. 2 for work... 2 for home.",
        "Easy to learn. Only the space, backspace, return and alt keys are in new places. But much better places. Switches and build quality are excellent. Not cheap to manufacture because circuit boards like to be flat. So you are getting your money's worth.",
        "Good for typing, not so much for programming as you need to press the keypad button in order to use the plus/minus buttons. My overall wpm was significantly less than a regular keyboard, but I do love the cherry mx brown switches. Overall it feels satisfying to type on, but I type a lot slower.",
        "it looks weird, but it didn't take long at all to get used to it. a major design flaw is that you can only hit space with the right hand, which remains annoying even after years of use. if you are used to using function keys, you probably won't like their size on this.",
        "don't be afraid of the \"learning curve\". you'll get used to it. this keyboard is worth every penny. the ability to type is my livelihood, and w/out this keyboard, i'd be in BIG BIG pain. i started having RSI problems (very scary) but this keyboard helps me manage it. i take it with me when i travel!!!! 2 pain-free thubs up. thank you kinesis!",
        "This keyboard is well designed. I especially like that the keys are close together. Becoming accustomed to the key placement took some time. If you use different computers/keyboards, it is difficult to go back and forth.",
        "The keyboard did help a little with wrist pain, which might make it worth the price, but that is no excuse for making a product that is outdated and of poor built quality. It should honestly be a $150-200 product. It will take a week of consistent typing to get used to this keyboard, as the layout is quite different.",
        "Love, love, love this keyboard. If you are a first time user, it will take a few months to get used to it, but after that, you should have no more pain in your wrists or arms. I typed on this for 15 years. It is the one I am typing on now. I would never switch to the flat keyboards.",
        "Expensive but it worked well for me. This is the second one I have - one for work and another for my home computer. Used last 6 years or so without any issues. Old one had the soft pads onto rest your hand (not shown in the picture) worn out.",
        "This thing took a bit of getting used to, but the only flaws I can find is the placement of the single space key under the right thumb and the inability to adjust the angles on the keypads. I'd rather have a second space key under the left thumb and move the backspace key someplace else, and be able to adjust the distance from each other and angle to each other of the two keypads. Still, after just a few days, the weird, chronic pain in my elbows and forearms is beginning to dissipate - which didn't happen with the cheaper keyboards I have purchased over the years -- and the keyboard is beginning to feel incredibly natural.",
        "I'm a programmer who's had symptoms of RSI for the past year now. After trying both the Microsoft ergonomic keyboards, I can say with certainty the Kinesis keyboard far exceeds the Microsoft models in ease-of-typing, layout (I love how the space and backspace bars are right at your thumbs), and comfort. I'm quite tall and lanky, and never could find a good desk where I could be constantly wrist-neutral without having my knees touch the bottom of the desk with a normal desk keyboard. The Kinesis is designed to sit on your lap, which makes it very comfortable for me...and easy to find that ever-important wrist-neutral position.",
        "I already used an ergo keyboard, so it only took a week to get used to the migrated thumb keys and the large break between number keys. Otherwise touch typing was great. Helped with my tendonitis.",
        "This is the second keyboard for me from Kinesis. Takes a week or so to get used to it. I type all day and it really easy on the wrists. Looks funny but great keyboard. An important part of any ergonomic solution at the computer. Highly recommended.",
        "Overall this keyboard is great and really forces you to type properly and in a comfortable position. The only issue I have with it is that the placement of the various bracket characters is fairly awkward when programming and there's enough of them that it's quite hard to remap them to other areas which also have important keys for regular typing.",
        "An excellent programmable ergonomic keyboard, with two USB slots. I reprogrammed my keys to match the Maltron typing system which relieves repetitive strain. Everything works perfectly.",
        "I got this model first but returned it because is was too scooped out and I kept accidentally hitting the wrong keys. It cost me $20 to return it (I am in Michigan and they are in California). I then ordered the split model from the same company, and I love that one - especially after I put a grip mat under it so it stays in position. BTW, it was the mac model and it works just fine. The split version has extra keys which are very useful, like a \"delete forward\" key which I use all the time (now if it had a keyboard i would be totally in heaven). So, consider the split model over this one.",
        "I love typing on my kinesis. My only complaint is that it is pricey given the hardware quality. For $300, I would want to have a nice sturdy metal keyboard, rather than this plastic thing that hasn't changed in years. That said, it is a great keyboard and I don't regret my purchase.",
        "The different layout takes some getting used to, but compared to the other options this is the best price performance. I have one at home and at work. If you have an RSI injury you still need to do exercises/physical therapy, consult a doctor, but this is a great tool for not re-injuring, when combined with managing the rest of your ergonomics.",
        "I type for a living and was suffering from acute tendonitis. This keyboard saved my job and my hands. They key action is excellent and allows for a very low impact typing motion. The thumb keys save me from overusing using my pinky. The split keys have helped my wrists. I love this keyboard. Would buy it again but its very well made so I dont expect that I will have to.",
        "I have used this keyboard for more than 8 months now. My biggest issues is the old style keys. Most modern keyboards have a very assertive short depression touch. The keys on this keyboard are more like that of the old IBM Selectric typewriters and have a long travel in comparison to a modern keyboard feel. Because of this, I feel that it causes me to inadvertently bump adjacent keys, making mistakes and slowing me down. I was very hopeful of this keyboard, since i type all day long. I will continue to use it because it has helped to relieve the wrist strain i was having with non ergonomic keyboards.",
        "Product as described. Much more comfortable that my MacBook Pro keyboard. I would buy it again. Thank you!",
        "I think 15 years of experience speaks for itself. But I got diagnosed with carpel tunnel 18 years ago, and due to ergonomic equipment like this Kinesis board, taking a daily vitamin B complex for your nervous system, I was able to put off my surgery for 18 years. I know have tendonitis in the right elbow, so I ordered another keyboard to help eleviate those symptoms. Love it! Wouldn't have anything else.",
        "Great keyboard that definitely helps prevent repetitive stress injuries from typing.",
        "I was experiencing some pain in my hands from long hours consistently typing on a keyboard, so I decided to try this keyboard instead. It took about week to get my WPM back up to normal speed, but it's been a lifesaver for my hands. No more pain!",
        "This keyboard is so very, very worth the money. As someone who has suffered from tendonitis for some time, this is the very best keyboard I've ever found by far and I've tried more than a few. I finally bought a second one, so I could have one at home as well as at the office. Hands down, this is so incredibly worth the money.",
        "Typing feels amazing now, and I'd never type on a different keyboard again if I had the choice. The remapping is also a great feature to have. My only potential regret is that I might have liked the Linear Feel version that comes with Cherry MX Red key switches even better (they have an extremely smooth feel when you press them, whereas the Cherry MX Browns that come on this are only medium smooth as there's a small tactile bump).",
        "this is a fantastic device. true gamers will appreciate it. also enjoy and programmers.",
        "Purchased this for one of my people with wrist pain. It took a while to get over the revised key arrangement, but we've seen a decrease in discomfort. The unit is expensive, but very well designed and built. I also bought an Evoluent VerticalMouse. The mouse was much better received.",
        "Takes a little time to get accustomed, but worthwhile if you have wrist or hand pain.",
        "The Kinesis keyboard is legendary. But there was a glitch in the installation process on a Dell PC. Dave at Ergo Works (the provider) went above and beyond in helping solve the problem. Five stars to Dave and also to Kinesis. The keyboard is highly recommended to anyone with wrist, hand, or even finger RSI. I've had four of them.",
        "Great. Arrived in perfect condition. I have two of these (work and home) and they have halted my carpel tunnel and are just brilliant keyboards.",
        "I have bought five of these in my information technology career. It has worked well for me in reducing stress on my wrists. I couldn't work without it.",
        "Be warned. You will need a lot of training to get used to this keyboard. But the efforts may be well worth it in the end.",
        "This is my 2nd Kinesis keyboard ... I highly recommend them to anyone who works at a computer all day long. It really makes a difference with my RSI, it's comfortable and well thought out. For even a greater improvement use this keyboard + the Dvorak layout. It's a difficult transition but well worth it!",
        "Works great. Took a while to get used to. Still not typing at previous speeds over a month later.",
        "This isn't my first Kinesis keyboard. The only reason I bought a new one is that I spilled a glass of water on my old one! I have tendonitis in my hands/wrists and cannot type on a regular keyboard. This keyboard is amazing! I highly recommend it.",
        "It took me about a month to get back to full speed, but I wish I'd started using this years ago. I'm typing faster and more comfortably than ever before. I'd strongly recommend this to any programmer.",
        "It really is the best. Everyone recommends it because it does what it promises. True, a bit noisy (clicky) but all of the other aspects far outweigh that. After using the Kinesis I really dislike typing on anything else. I even bring this with me on work trips (just pad it with shirts/underwear ;) ).",
        "I saw it at google(mountain view), and thought it was very impressive. Some keys' layouts are strange, it would take some getting used to. And it's really a great product.",
        "Took some time to get used to but now I love it. Can now type on this keyboard just as fast as a standard keyboard.",
        "As a developer, I spend most my day at the keyboard. Other keyboards would hurt my wrist because of the angle that I was forced to conform to for long periods. This is one of the first tools I feel fits me just right. This machine is a lifesaver and I recommend it for anyone in a similar profession.",
        "Love this thing, just takes a long time to adapt.",
        "Very comfortable, customizable, and versatile. Less than a month to acclimate to. Unleash the hidden power of the thumb. Easy to switch between this and standard keyboards.",
        "This is my second one in ten years. Love the mechanical action of the keys. Good for work AND gaming.",
        "great item! but no \"insert key\" make me crazy , i use shift+insert to paste in many applications, and i dont wanna remap any other key to replace it.. and now i need to make a foot swtich myself...",
        "If your wrists are hurting, buy this keyboard! It does take a few months to get used to it, but once you start getting proficient at it, you will see results.",
        "My RSI is almost gone after about a month of use. Build quality is excellent. Configurability is phenomenal. I want one for the office and one for home, now.",
        "I am a software engineer and was having wrist and hand pain. This keyboard has helped tremendously in only a couple weeks. I would highly recommend this product, although expect it to take about 1-1.5 weeks to get your typing speed back.",
        "Good keyboard for my hands! Mac and win switch by one combination! Easy define oun combination! 2 USB input on back keyboard =)",
        "This is my second Kinesis keyboard and I truly can't live without it! It has saved me from getting carpel tunnel",
        "all the typos im this post are result of trying to use this keyboard. the posture and key separatiom is very good. it will take some time to get used too. i will update the post againm after i am comfortanble usimg this keyboard.",
        "It was hard to get used to and we stopped using it.",
        "I like this a lot, however it taken me awhile to get used to. Some of the keys are in suboptimal positions for programming.",
        "The only keyboard that can prevent my RSI. Its a little hard to get the hand of it at the beginning but that fades away and becomes really enjoyable.",
        "I had to return this as there were 1-2 keys that are hard to type (I think it's the 'C') key. Definitely requires time to adjust. I didnt have the patience.",
        "Looks like a great product. I am anxious to use it. Well made and innovative.",
        "Only buy if you have incredibly small fingers and hands.",
        "I wish I never bought this. No matter how long you try, it's impossible to get used to this setup. I bought it for the awesome factor, but it's just impractical. I put it back in the box and that's where it's been sitting for the last year. Waste of money.",
        "A great keyboard that is minus 1 star due to the lack of Mac OSX drivers. It simply needs some drivers to fix the useless keys, which are The Right Control key, scroll lock, pause break, key pad, program, and very useful ones such as the SPACE BAR for punctuation... In fact, the latter makes the product entirely useless, so minus 4 stars. Please consider emailing tech@kinesis.com to request these functions if you agree."
    ]
}