{
    "entity": "Keyboards",
    "text": [
        "Couldn't get it to work with my device even tried with a couple of different ones wish it had worked because it was very nice.",
        "IT\"S OK WHEN ON A TABLE WITH PREFECT ANGLE OF THE MIRROR AND PERFECT DISTANCE TO IT BUT AS SOON AS THE KEYBOARD MOVES AWAY TOO FAR TO THE RIGHT OF TO THE LEFT OR TOO FAR FROM THE PDA AND IT DOESN\"T WORK ANYMORE.",
        "i bought it used, just 2 bucks and i got a great product. its easy to use and carry everywhere. it works perfectly with my dell axim x5.you can write even if its connectet to the usb data cable. i love it!",
        "This item was exactly what I needed for my PDA. It worked easily with little setup. The price was great for this item.",
        "I jumped to Linux some weeks ago and got finally got syncing correct for my Tungsten E. However, I never got this keyboard to work with the E. It's true that the E is not mentioned as being supported, but I was told otherwise. Because I'm using Linux and the probs took so long to resolve, I can't return. I can't resell because I don't know if it's not simply broken. Palm says something about \"vcard\" not working with some 3rd party infrared devices for E. Make another choice if you don't use Windows/Mac and/or use Tungsten E.... Beware.",
        "I have a Dell Axim X50, it has bluetooth but I opted for this due to the price difference (though a bluetooth is in the near future). The pros: install was fast and easy, keyboard fells well made key spacing is pretty good only takes 1 AAA battery The cons: stand is cheap and fragile no lap lock, must be on a flat solid surface For the price it's a great deal, and a good keyboard.",
        "Software installed fine, but the keyboard never worked properly. Half the keys on the first one wouldn't work. Tech support first blamed me, saying I didn't install the driver right. Then after sitting on the phone with me step by step, they conceded it wasn't my fault and told me the board was defective. I exchanged it and that one would't work at all. After installing this software 10 times and pulling every trick I can find, I'm giving up.",
        "I'm using this keyboard with a Zodiac that defaults to portrait mode and it works fine. It's VERY compact and portable, tho, some sort of slip case would have been a nice touch. Battery life on a Zodiac is definitely shortened so, be sure to disable the keyboard drivers when you're not using it. I even managed to find free third party Dvorak layout drivers for it.",
        "At first, I installed a driver from the CD, but it didn't work. Then, I went to the support site to download a new driver. It still didn't work except one case.... If I put the keyboard close enough to get a signal, I could use a keyboard. That means I should put something beneath the keyboard to make it close with a PDA. I will return it tomorrow. Unless they fix this problem, don't buy it.",
        "You will spend more time attempting to align the mirror than you will typing. Set up is easy; it's the every day use that is difficult. My Dell has the IR port on top and any movement throws off the beam so that I have to readjust the mirror or move the keyboard. In addition, the manual is woefully inadequate. It does a cursory job explaining short cut keys, functions and screen rotation. Look at other solutions - Belkin failed on this one.",
        "Although Amazon did not include the Tungstens, the Belkin box I bought elsewhere does list them them as supported. They are NOT supported and will cause your Palm to spontaneously hard reset losing everything on your PDA.",
        "bought for my son for his birthday and need to return it. did not work with Sony CLie SJ22."
    ]
}