{
    "entity": "Keyboards",
    "text": [
        "I cannot speak for all devices, but this was a total failure in my case. I am a fast typist, and it seemed that about 20% of the keystrokes were not picked up by my Treo 270. This was simply unacceptable, so I immediately returned it. I cannot determine whether the problem was due to the keyboard, the software, or my old PDA. Newer, faster PDAs might have a better success rate, but the potential for problems will still be there. My suggestion is to buy this somewhere with a generous return policy so that you can return it if it is a mismatch for your PDA.",
        "I absolutely love the wireless keyboard. It is the best investment I've made in awhile. I take it with me everywhere and it comes in handy. I don't have to play around with the little stylus anymore and I love it. I can type a letter, update my contact list, and send email with ease. The only problem I had was the size of the keys on the keyboard. The numbers are not exactly where a normal size keyboard dwould be. With a little patience I worked it out.",
        "Don't waste your money, The PDA holder's three very flimsy support arms will not hold the PDA still, and the PDA holder will not stay up on its own. The battery life is very short. So carry extra batteries, and any where there is vibration (Airplane, Train, etc.) you are out of luck unless you use one hand to hold everything still. If I am going to use one hand to hold the PDA, then why not just use the styli? Caution!!! Mac / Palm users you need a pc and windows to make it work!!!!!",
        "IT IS AMAZING it works great with my PSP 1000 you have to have custom firmware and a homebrew application called piKey to use it on psp and it will only work on the orginal PHAT psp model 1000/100X. and it works great on my Dell Axim x51v! amazing item i have no problem with anything if your looking for a keyboard for your pda or PSP 1000 buy this its amazing",
        "Worked well when I had it. My only complaint is that it clicked to loud and would disturb others in meetings.",
        "While not as good as a regular wireless key board it does a passable job of providing a full key board for my Palm TX. Connection is a dab awkward but functions. The Palm TX recognizes the keyboard right off and if functions appropriately. The only complaint I have is the when the palm is in landscape mode the backboard holder will not keep it in place like it does when it is in upright mode.",
        "I use the the Targus with an IPAQ 2215. I find that's it's indispensable, but quirky. The cradle (rubber covered stiff wires) works best for \"squared\" PDAs (my Ipaq has a rounded bottom and can rock), and you may need to tilt the PDA for the infared bar to point into your IR reader. (If you use a flip-style case, you will have to remove it for the IR bar to beam into your IR reader.) I'm not crazy about the cursor arrow key (it's not a regular cursor \"arrow\" key), and the split-up space bar keys do sometimes have problems. As another reviewer remarked, downloading the drivers from Targus.com is much easier than using their included CD-ROM.",
        "This product has worked wonderfully for me. I have an HP IPAQ and I just loaded the driver and it works. I am still messing around with it as far as all the function keys but so far it is really fun to use and the infrared option is much cheaper than the bluetooth versions I have found.",
        "Ever since I loaded the Targus drivers on my Tungsten C, the battery discharges quickly and won't take a full charge. I've removed the driver, with no change. The next step was to do a hard reset of the Tungsten C and I'm hoping it will take charge. I'm taking this keyboard back for a full refund!",
        "I ordered this keyboard as \"new,\" but what I received was clearly not new. Not only was it not in its original packaging (in fact, there was no packaging, though a little documentation was included), but the item's marred exterior finish made it clear that it was a used item. I would not order from this seller again.",
        "This is a fantastic little item. You can attach your PDA, position the infrared wand and off you go. With this keyboard, you can type and also use a button on the keyboard as a mouse-which is a similar experience to using a laptop mouse. My only problem was with customer service which said the keyboard wasn't compatible with my PDA when in fact it was.",
        "This handy keyboard, full size, does NOT work with the Tungsten T3 in spite of \"universal\" lable and implications of its working with the T3 in some reviews. The T3 is too big for the holder's wire guides. I have always enjoyed Targus products but I was very displeased to find this product so physically inadequate, not just for the T3. The plastic is flimsy, the IR port is clever but poorly designed, and the keyboard has some funny layout aspects. It attempts to meet all specifications of both Palm and PC devices and overstretches.",
        "As a reporter, I decided to buy this keyboard because I was always taking notes at meetings. I would highly recommend it. I used it w/ my IPAQ, and it's lasted two years without ever having to replace the battery. After using it for a couple years, I've found it easier to type on then a regular keyboard. Takes a little getting used to at first. My only complaint is that it just randomly stopped working a couple times. Considering it happened only three times in two years, it's not too bad. Like I said, I really love mine and would recommend it to anyone else.",
        "I have had this item for about a year. I got it for my Dell Axim 5. I really like the full size keyboard. It took no time at all getting used to it. Very easy to set up. Like the fact that you have a mouse option. Only negative is that you get some play where the keyboard is hinged when on an uneven surface. This flaw is hardly worth dwelling over this is a good buy. Researched alot of keyboards happy with purchase.",
        "The rotating wand arm must be aligned to the infrared port of the PDA. The arm rotates 210 degrees but the sender can only point directly to the pivot point. The adjustable arms are laughingly flimsy. As a result I can only get it to work if I hold the pda in my right hand directly above the ir arm. Then it works great but it's an utterly unworkable solution. Instead of a rotating arm which makes the angle wrong. Why not a sliding arm so that it is always at a right angle? Truly awful unworkable piece of flimsy junk",
        "It worked OK for 2 months, but the KB kept on falling off. When I complained, I was told that the KB was not compatible with my Viewsonic v37. Yet, it was advertised as compatible with the VS PPC 2002. The worse came when I upgraded to PPC2003 and the KB stopped working. I contacted Targus and was told that they do not have plans for upgrading their KB drivers for this VS PPC. I do not believe that this should be permitted. If you sell something, stand behind it. Very disappointing.",
        "Awesome! Setup is quick. Works great with my ipaq 1910 !!!",
        "Although a search in Amazon lists this keybooard as compatible with HX 4705, it is not. There is no way to align the IR port of the keyboard with that of the HX 4705. I had to return mine and pay for return shipping charges because Amazon probably does not think that they are misleading their customer. BEWARE.",
        "No way! It does not work with the Toshiba e405, that's certain. Cannot align laser with infrared port located at the bottom righthand side of the PDA -- unless, of course, you are willing to hold it with one hand and type with the other. I'm sending it back.",
        "Do not hope to use this with the XDA II. It won't work. I am very disappointed in Targus for giving this the misleading title 'Universal' and for claiming in their compatability chart that it works with Microsoft 2003 for PPC. Customer support are useless and send out pre-made nonsense that refer to out-of-date web-based help pages. Steer clear!",
        "I have bought two of this keyboard and none of them wor more that want year. I don`t recoment this product, even they don`t give internet support to this device.",
        "I haven't bought it yet but man does it look awesome"
    ]
}