{
    "entity": "Food Mills",
    "text": [
        "Already returning after a single use. I used it to make applesauce, we tried to I should say. About halfway through I noticed a black substance in the sauce (Grease? Metal?) coming from the nut/bolt at the bottom of the mill. I took everything out of the mill and re-washed it. So back at the applesauce, after one batch the black mystery substance returned. So very disappointing after peeling 12 pounds of apples to have something like this happen. Also the little feet that are supposed to rest on the bowl are pointless. I would have returned this mill even if it hadn't started to drip grossness into the food. It felt clunky and uncomfortable to use.",
        "DO NOT BUY! If I could give 0 stars I would. I have worked in the restaurant industry for years professionally. Although this looks like a small version of the good, commercial ricers/food mills, it does not do even an adequate job. First tried it on roasted butternut squash, quite possibly one of the easiest things to pass through a food mill. It left more than half the product above the auger and even with the help of a spatula it would not force through. I am throwing this hunk of junk in the garbage where it belongs. Don't waste your money, buy a more expensive commercial unit.",
        "Stupid mill ruined my entire newly canned tomatoes, it released black substance onto my tomato pot (having stirred more than once) then here they are, black spots 1/4\" diameter on the top, took the stupid thing apart and wiped the shaft with white towel to realize it was grease, I'm furious for the time, money and effort canning to end up throwing everything away, now Amazon tells me that my window to return has expired 5 days ago!!!!!!! I need not only a refund but to be compensated for the crop I lost.",
        "I am returning my food mill because it leaves food behind in the base. I had an old one that was easy and efficient. This one has a blade that doesn't meet the base of the mill evenly, so some food is untouched. Also the knob has a screw that sticks up to irritate the hand of the user. This is definitely not the one I used so happily 30 years ago. It's a disaster.",
        "I am sooooo disappointed in this product. I have been using food mills for over 40 years and never used one that just simply didn't work. The blades aren't close enough to the bottom of the bowl so they don't push the food through. I turn and turn and turn but only pure liquid goes through, because of gravity. Even turning in the reverse direction to scrape up the stuff on the bottom doesn't work. It is totally useless. I recycled the packaging when I first bought it so I can't return it, but what a big, big disappointment.",
        "I purchased it to strain cooked apples for applesauce. The old one is made of aluminum and I wanted to switch to stainless steel. I purchased the larger one to get the job done quickly. It works very slowly, much slower than my old one. Also, despite cleaning it carefully several times, it left a gray deposit in the middle of the applesauce so, I had to throw the applesauce away. I tried it several times and cleaned it several times. I suspect the center spindle is reacting with the applesauce and corroding.",
        "I expected a lot more from this device considering how long its been in production. It would barely push the food through, even after following the instructions to \"turn knob using downward force\". I had to use so much downward force that I actually ended up leaving huge gouges in the cutting blade, which meant there were metal shavings (however small) in the food I had just processed. Considering I bought the thing to make baby food, that was completely unacceptable. I returned it, and from now on I will use my old, and much more efficient, method of using a blender and strainer.",
        "Looks nice, but just doesn't work well. I've been using an old food mill to process home canned tomatoes for sauce. The old mill did a great job of getting every last bit of juice out and leaving just dry material. This mill has two serious problems (at least for small seed items like tomatoes): 1) The bottom has texture and is not flat, so there is always a small gap beneath the blade. 2) The blade does not meet flush with the sides. I noticed material was squeezing up the side walls and wouldn't be processesd, I had to constantly stop and push it back in front of the blade. Finally sent it back.",
        "Lousy design enabled food (cooked, quartered apples) to go over paddle instead of being pushed through the mesh. Also, the few apples I did get to go through ended up wasted as screw/nut apparatus on underside of unit leaked nasty oil into the applesauce, even though I had first washed the unit. Returned it.",
        "My Mom had hers since she was married ans it needed replacement. We were so excited to find they still made the same version. I will say this seems a little lighter in the handle but it gets the job done and is easy to clean. I worried about some other brand using pieces of plastic in the mechanism or not having the swipe on the bottom to help clear what passes through the mill. This is stainless steel and that’s what we wanted. It works great just like our old one!",
        "This thing is worthless! It would not make applesauce out of COOKED yellow delicious apples. It simply would not put them through the mill, it just kept pushing them around and no matter how tight or loose I made the nut on the bottom, it simply would NOT work. I also tried it on COOKED tomatoes and guess what, again it would not work! If I had not already thrown out the box, it would go back for a refund! Absolutely NOT worth the money, time or effort! I used a metal colander to do both the applesauce and the tomatoes. This piece of crap is NOTHING like the one my grandmother had!",
        "This is the worst. It may be a \"Foley,\" but it is manufactured in China. Another reviewer noted that there is some sort of grease on the threads of the mashing blade that did not come off when we washed the unit before its first use. The grease came off in little gray-blue blotches in the apple sauce we were making. I wish I had read about this first. The welds on the unit do not seem very secure either; and its made from the thinnest stainless steel I have ever seen. Just returned it to Amazon and bought an original Foley (made in Minn.) on e-bay for about the same price. I advise you to do the same.",
        "I was very disappointed. The inside of the mill has to small a base to push the food through the holes. There is more room for that part of the mill to be bigger. Because it is so small and doesn’t go from high to low to crush the food it takes forever to finish a batch of anything. It needs to be redesigned back to the original way it was when I bought my first one in 1977.",
        "This is the second Foley food mill in my lifetime. I had one for more than 40 years and swore by its efficiency. The resson I bought this one is because the first was not stainless steel and was beginning to show just spots. I love this mill for making my Italian sauce. It strains out all the skins and seeds from my tomatoes.",
        "I know there are many new electric gadgets for the kitchen, but this tool has stood the test of time and works beautifully. I use it most often making fruit juice from cooked fruit, like grapes. But it is terrific to make tomato juice, too. You don't have to slip skins or anything, because the action of the Foley will separate the skins and seeds, etc., from the juice. It also is very easy to clean.",
        "I bought this foley food mill because I had one before that got too rusty to use, it was old, probably 25 years old. This one works OK. You really have to rotate the handle many, many, many times before the food is all strained. I did not have to work so hard with my old one. I bought this one because it said foley food mill and had the little arm underneath it to help scrap the food off, just like my old one but it simply doesn't work as well as my old one.",
        "No wonder the Mirro company has been around for a long time, their products are the best. I made re-fried beans a week ago and the product did the job I expected. Easy to handle, not heavy and fits over a pot with ease, it is well made, Very good product.",
        "I had great success the first time I used the product. However, the second time I used it to make applesauce. As I was turning the handle on the top, I noticed dark grey spots dripping into my food. I checked the bottom of the mill and there was a TON of grey material building up amongst the apples coming through the mill. Unfortunately I am out of the return window by a couple of weeks so I'm out the money and it's going in the trash. DO NOT BUY unless you like metal bits in your food.",
        "The best thing about it is that it is stainless steel and doesn't rust. I've used the just plain steel ones, and they rust easily, especially when you do like tomatoes or apples that can be acidic. The stainless steel ones are definitely the better (best) option. The size of this one is nice, too. There are also 2 quart ones, but the 3.5 quart is better and can do more at a time.",
        "Simply a classic it makes the best applesauce ever and it’s easy! I was giving my mother’s old Foley food mill as a gift to my sister (sentimental as well as practical in this case) but the only thing that has changed in the design after AT LEAST 60 years is the handle. Our mom's old one had a rounded red wooden handle that is admittedly much more comfortable, and the new one is two metal tubes and flat (see the product photo.) But it's still a perfect design for its purpose.",
        "This old-fashioned food mill takes some effort to use (and clean afterwards) but in my opinion using a food mill is the only method that really works for juicing pomegranate seeds and passion fruit seeds. It's a one-step operation to juice them and it strains out the seedy pulp. Use an apron though! I got this one because the old one I had was aluminum, which can react with acidic fruits.",
        "This is the only one I’ve owned so can’t compare to other models. Takes forever to fully process can of tomatoes. Leaves so much pulp behind I’m wondering if product is working to its fullest. Cleaning it is a nightmare, tomato seeds get stuck in holes, etc., and I know I will end up buying/trying another model.",
        "It does what its supposed to, but not easily. After ten minutes of making apple sauce, I had a bad cramp in my left hand. Also, the paddle bend is too shallow. By that I mean, the blade that rotates and forces the food through the holes isn'tt high enough. You have to work extra hard to make up for it.",
        "Now where as good as the original Foley sieve that was my mother's which finally gave up the ghost. The manufacturing tolerance is off. The blade does not reach the edge of the mill so that it builds up the material being sieved and takes too long to get all the food thru the mill and wears your arm out.",
        "This is just like my Foley Food Mill from the 1940's which broke. But it is even better as it is stainless steel and therefore the problem of rusting that the 40's model had is eliminated. It is still wise to wash it right away so as to not have to deal with little holes clogged with dry food.",
        "Should have kept my old Foley food mill. This one is made of stainless steel. That’s about the only good thing I can say about it. The paddle doesn’t contact the edge of the housing closely enough so food is just pushed up the side rather than being pushed through the holes in the bottom. It’s very awkward to use. I kept thinking it can’t be that bad and kept trying to use it until it was too late to return it. My thought now is to comb the thrift stores to see if someone has donated one of the original Foley food mills. They weren’t stainless steel but they worked beautifully.",
        "I mainly use this for removing seeds and skins from cooked tomatoes which I either use right away or freeze. But it can be used for pureeing anything. You need to press down hard on the handle to do a fast job. My old one wasn't stainless steel and it left a little flavor that I didn't like in my cooking. This one doesn't do that.",
        "foley mills in general are super cool and very helpful, but this is not the most durable version. My handle broke off and also I had to replace the washer at the bottom multiple times with multiple trips to the hardware store. Granted, I do process like 15 bushels of various fruits each summer. It might be OK for occasional use. The high capacity is nice. The stainless steel is nice.",
        "I expected this food mill to take the skins off my apples after cooking them down for applesauce. This turned the apples to liquid, not applesauce. It had come highly recommended, so I was really disappointed. Maybe better for baby food.",
        "The arms that rest on the bowl's edge are weak and flexible. They bend upward every time you put weight on the mill. Returning it now for a sturdier model instead of waiting for the arms to snap off from constantly having to bend them back into place.",
        "1, I love this, my Grandmother had one and this works just like I remember. This one is larger though and holds a lot more than Gram's did. No skins or seeds in my apple sauce, no stings in my squash soup, much nicer than my previous one. 2, I wanted to give 4.5 stars because this would work so much better if the handle was put on from the bottom up instead of top down, so it sat more level and allowed more room in the receiving Pan/bowl instead of tipping so much and sitting so far down in and taking up usable space.",
        "I ordered the Foley Food Mill. It arrived prompt;y. It appeared to be in top notch condition until I tried to use when making applesauce. the turning mechanism kept catching and wouldn't complete the the rotation. I noticed the tip of the turner blade seemed loose but that didn't seem to be the issue. The blade appears to be bent which makes it catch when turning. I couldn't be more disappointed as I was looking forward to using it a lot. It will be going back. No more ordering on amazon. Will want to see it in person before purchasing.",
        "The unit I received in July 2015 is not the same unit pictured here on Amazon and not the same as pictured on the box. The one inside is more cheaply made. It's slightly smaller than the original unit pictured. The stubs that stabilize the mill on top go the bowl are just straight rather than the nice curves shown in the illustration here and on the box. The units with the curved stabilizers work much better.",
        "Support brackets are very cheap. Brackets bent upwards after just 30 minutes of use. We had to 'baby' it for the rest of the day to get our applesauce done. Obviously, made of cheap materials, not up to real world use. Previous Foley Food Mill lasted over 10 years of heavy annual applesauce making. We will be returning this and replacing with a DIFFERENT brand/model.",
        "Received one for my wedding in 1970. Made applesauce with the grandchildren and saw that it was getting rusty. So excited to see that they were still selling the same thing. Bought it happily and looking forward to using it.",
        "Bought this food mill to make applesauce. The paddle seems too far from the side of the food mill, so the apple mush and skins wanted to push out to the sides-- even though I reversed directions often and pushed the apples back down, the apples still worked their way out to the sides, so I never got the full applesauce extraction that I've gotten with my mom's 40-year-old food mill. Very disappointed that it didn't work better-- it was frustrating to use and now I'm out $35. Wish I would have read the other reviews",
        "Apparently I’m not the only reviewer who’s had issue with this food mill. Plainly said, mine does NOT work. This is the only Mirro product I’ve had a negative experience with. Don’t waste your money. I would return it but I threw the box away because of my faith in the brand.",
        "Very disappointing. Everything gets stuck on the inside of the basin. Used primarily for grinding eggs for egg salad. Have a similar product from 40 yrs. ago that still works very well. Don't believe this would work well for applesauce or other ground foods. Will be returning it. May try one with 3 separate size blades but probably not worth it for the 4-5 times per year when I use this product. Will continue to use the old one in the meantime.",
        "Bought it to rice potatoes for lefse. Couldn’t make it through one batch. “Unwieldy.” “Whose is this?” “Worse than the old one.” “What the hell?” I guess it’s sturdy and easy to clean; the ‘blade’ would not move the potatoes down into position, no matter who/how. I threw it out that night just to stop hearing how bad it was from the Norwegian relatives. Blerg.",
        "I purchased this one for my daughter because she wanted to make some applesauce. Nothing better than a Foley Food Mill to do the trick!.",
        "Easy to use and cleans, very smooth rotation. Used for canning tomatoes, and purchased a second one because it works so good. Easy to store and doesn’t take up much space.",
        "Have made several batches of applesauce. Like it. And it washes up nice and shiny.",
        "Bought to replace favorite 30 year old Foley tin one when the bottom part went missing. Well, this one left a black residue in the mashed potatoes the two times I used it. I also had to scrape the bowl continuously as the potatoes would go around the blade. Finally, the wire handle is very uncomfortable. Unfortunately I returned the mill and cannot recommend this product.",
        "Worked well to help mash and remove skin from apples for purpose of homemade applesauce. Shipped quickly. Very durable. Was a huge pain in the butt to wash. I did wash by hand and not in the dishwasher. Worked well and hand crank was not a problem - ever.",
        "LOVE my food mill!!! I can every summer/fall and this has been through the ringer for 2 years! IMve canned so much thanks to this! Wont ever can w/out it!",
        "Very disappointed! I told my friends - \"this is how to mash potatoes\". Blade is not close enough to the bottom to do the job. Lost my original during a move so I was excited to find a \"Foley\". Now it's too late to return it. Don't waste your money.",
        "This food mill worked really well in grinding. My only difficulty was that I found it hard to loosen the ring holding the attachment to the mill. This made it hard to clean. After using the food mill for a while, the ring loosened up and there was no longer a problem taking the grinder apart. I really love what the food mill does, and this one is great!",
        "Very disappointed with the product, bought it because of the many good ratings. Tried to mill cooked beans (soup), but they did not go through the sieve, the all stays in the mill. Thought perhaps it are the beans. So I tried to mash potatoes, same thing. Wast of my money. Bought the mill in October, but did not use it until after the date of being able to return it, so I am stuck with it",
        "I use this all the time, mashed potatoes, tomatoes for sauce, etc. Great product......don’t know what I’d do without it.",
        "I love to use this food mill for potatoes and to make applesauce",
        "I had an OXO Food Mill previously -- the plastic one with three different inserts. I MUCH prefer this one. Why? It's simple, inexpensive, and does the job. It's easy to clean and is well built. (Well, other than the non-solid handle, but come on... a minor inconvenience). If you use a food mill every day for multiple types of food preparation, you may require different-sized straining inserts (small holes, medium holes... you get the idea). However, for basic jobs like soups and sauces, this model fits the bill and does what it's made to do. I'm rather happy with my purchase and plan to use is often.",
        "i bought it so I can get the seeds out of my garden tomatoes and make sauce. I just used it to make about 10 mason jars. Not very many. You really have to work at getting the tomatoe juice through. One good thing, the seeds won't go through and that is what I needed. I even blanched and peeled the tomatoes and ran them through the blender first. Does not work as expected. It might work for mashed potatoes or perhaps some fruit but if you like to do a lot of canning, forget it. I should of listened to all the other reviews.",
        "I use this to remove skins and seeds when making tomato sauce, and while it works, it's kind of a slow process. The construction is a bit flimsy and I've had the nut on the bottom fall off into my sauce a couple times now. It gets the job done, but expect your arms to get tired by the end of a batch.",
        "Can't say anything about the durability of this, since I have used it only once. VERY easy to clean. No assembly necessary. I'm very happy to own this item for a smaller kitchen.",
        "I ordered this for a friend that grows his own organic fruits and vegetables, and does extensive canning. He's had the food mill for a couple of years now and he loves it. It replaced his Foley, that belonged to his mother. Since it's a 2 quart mill, it processes his foods much faster. He had colon cancer, so the seeds from fruits and vegetables cause him a lot of pain. The mill separates the tomato and strawberry seeds so that he doesn't have problems. It's well built and reliable.",
        "Tricky to clean, but makes awesome mashed potatoes and sweet potatoes.",
        "My recipe said to put cooked cranberries in the mill and process. It got too thick and gloppy and did not mill the cranberries properly. Perhaps it will work better for potatoes or tomatoes, but for my purposes it does not work.",
        "I ordered this to replace a 15 year old Foley Food mill that had gotten a bit rusty. I decided to stay with Foley since my mother has always sworn by them, and since this one said it was stainless steel. The only problem I have with it is the center piece that the paddle goes into isn't stainless--it appears to be aluminum that had already started oxidizing by the time I got it. The handle isn't as comfortable as my old one, but since I don't use it for long periods of time at once, it hasn't been a problem. It's easy to crank, and comes apart easily for cleaning. It works well!",
        "I purchased this food mill because it is a realiable company, good price and pretty standard design. The only thing different from my old mill was the way it came appart and the handle. It is so easy to take apart and clean. I had to figure out that I could adjust the screw on the bottom. Once I did that it worked really well. The only thing I didn't like is the handle. It is really uncomfortable and hard to hold. I'm going to have to get some kind of handle cover for it. It is probably to keep it from getting too hot. A silicone coating on a solid handle would solve both issues.",
        "We use this to grind dried red chiles for enchilada sauce. 'Works like a charm!",
        "this mill does not do tomatoes for juicing. literally no juice goes through. my original Foley food mill from 1957 does a perfect job, glad i saved it. the new one being stainless is nice, but it doesn't work. pretty and nonfunctioning. very sad. and i just started canning yesterday and the return date is passed. thought Foley was the gold standard",
        "This is a great product! I would highly recommend. Easy to use and works very well. I used it to strain red chile for sauce and it worked perfectly and quickly, much better than the traditional method. I plan to use it for jams as well. Saved me a lot of work and time.",
        "I have a smaller one works much better but lost the spring to it. This one dosnt seem to be as sturdy. Its light weight. Seeds get stuck in the screen so not easy to clean. Overall not a bad product",
        "Just what I was looking for! Was looking for a heavier gauge metal, but this is great!",
        "I absolutely love the quality of my 2 quart food mill, it's easy to clean too, however turning the level with the small button on top was a other matter, my hands kept slipping so I wrap a small cloth and this made turning somewhat easier. It's work when you are making tomato sauce, but all my gosh it's so worth it ! If you have a large family this does not work for you, I like that is was compact and just enough for two :)",
        "Sadly, this product did not last the years that the previous one I had did. Ordered a new one as the old 20+ year one was a bit rusty. First time running mashed potatoes through this one, the weld that holds the mashing mechanism in place gave way, and it is now useless. Poor design and quality, so wish I had not discarded my old tried and true!",
        "I purchased this in anticipation of a large tomato crop. I had a large amount of roma tomatoes and needed a way to keep the seeds, etc from the sauce itself. This Foley Food Mill was excellent. Saved me a huge amount of time and energy. Very easy to clean by unscrewing the small thumb screw on the bottom. It is dishwasher safe, but I hand-washed it. The larger size will be great for apple season and peaches and mashed potatoes. Do I wish it had a better handle, sure, there are always improvements that we like to see, but this handled the job nicely. Almost an exact replica of the one my Mom had!!",
        "just like the one I grew up with. We made our own tomato sauce and applesauce",
        "Fast delivery, product as described. Am loving using this stainless steel, quality product",
        "It is very awkward to use, I have arthritis so I have a bit of a hard time using this. If I could secure it in one spot it would be so much easier for me to use. Other than that which I think you find with any food mill. It does the job. I thought that I had ordered the one with other plates, but I guess I didn't.",
        "I’ve use this product several times for canning. Easy to use and washes up nicely.",
        "This works great? Just as my 30 year old one, with exception of the handle being made differently which makes it difficult to hold, especially with arthritis! It’s not a solid piece of metal, it’s open. I had to put foam and tape around it just to be able to hold it correctly",
        "Worked perfectly to press Concord grapes to make grape jelly. Easy to clean for sure. Great purchase for sure!",
        "This was a gift. I haven't heard how they like it.",
        "I purchased 3 of these food mills as Christmas gifts for family members and friends to accompany our family spaghetti recipe. No seeds in our sauce! These are smaller than the large mill I have, but I felt they would be easier to use. They are identical to my 40 year old mill, so I expect them to last a long time!",
        "There was no instruction booklet with this product. It was harder to work than I thought it would be. Maybe the bolt needs to be tightened?",
        "The description says “Mirro” brand but what I received does not list the Morro Brand anywhere. It is a cheap version made in China. I am very disappointed!!!",
        "Always wanted a food mill . You really need one for canning tomatoes. Juice Etc. this one works great.",
        "Loved the size of this food mill! Can process quite a bit of food in a short amount of time.",
        "The handle wouldn't turn. The blade jammed and I couldn't turn the handle to process apples for applesauce. I tried several adjustments, trying to loosen the screw on the bottom, but nothing worked. I finally threw it away.",
        "This is a very good product but I happened to get a clunker. The spring kept coming off. I tried to fix it but it did not work well.",
        "broke on 2nd use. I am going to try some other product. Don't know much about these but this one seems poorly made.",
        "Takes seeds out of tomatoes for making sauce. Works great.",
        "This food mill works great. It's larger than ones I've had before so I get done quicker. Easy clean up with the sprayer on my faucet. Well worth the money",
        "Just what I wanted for making applesauce, pumpkin purée, etc.simple",
        "It fell apart as I was ricing potatoes for Thanksgiving dinner.",
        "Love my Foley steel food mill. My grandmother had one of these years ago. I didn't realize they still made them. Great if you want really smooth applesauce. Or really nice jellies. I'm sure I'll find more uses for it as I just got it for my jellies and sauces. Great product.",
        "you have to work in very small batches in order for the product to work right. ultimately, i had to switch to my old one to finish the job. the 'press' for the system does a very poor job of grabbing anything you put in there and tends to just smear the items around the mill rather then press them through.",
        "This is excellent for making applesauce. Easy to use and clean-up is easy too. Well worth the money.",
        "While it cleans up well, it doesn’t mill well. The holes don’t go all the way to the edge and the part that presses the food doesn’t seem to touch the bottom correctly. (Yes, the screw is on as tight as can be). My old one was much better.",
        "Was excited to make sauce again but this product seemed a bit cumbersome. I had to grind the apples twice...the spinner part doesn't go tot he bottom of the pot. Nothing at all like my old one.",
        "My mom has one that she has used for years. When I found this I was very excited. A must have for making tomato juice",
        "If you like to make jelly or jams this is a must. Works great and came fast.",
        "I was able use this to extract the pulp from my garden tomatoes.",
        "I was so happy to find this food mill. It's a Foley, and the quality is the same as it was when my mom used one! Makes the best applesauce.",
        "This is a wonderful product. I am replacing one that I used for 20+ years. I use it for making jam, running pomegranate through to juice and for making red chili sauce for enchiladas, etc. It is easy to clean as well.",
        "Better than the last very expensive one I purchased but not as good as my fifty year old one that got lost when we remodeled our home",
        "We bought this to replace an older Foley Food Mill that has seen better days. Unfortunately, this is nothing like the older product it replaced - although it looks the same. The product is very poorly made. Don't get me wrong. It looks great - just doesn't work. I don't think the Chinese manufacturer that produced this really has any idea of the intended purpose. Shaft fit is very sloppy, which is the key to functionality on these. It is basically unusable. If you have previously owed a Foley Mill you will be sadly disappointed with this product. On the plus side, the seller did give a prompt refund.",
        "This was great! Just like the one my Mom had. We made applesauce with it. We did core the apples first, so I don't know how it would have done with the seeds and all in it. Handle design should have been solid, would be easier to hold on to. Overall would recommend it!",
        "Who knew I'd finally buy one of these? Admittedly I held on to it for a year before I had the guts to use it. Looked difficult. I had my granddaughter use it first and I watched. Ha Piece of cake. What was I worried about? Really helpful. If you do any canning this is a must. Handy, washes up fast, still like new after many uses."
    ]
}