{
    "entity": "Food Mills",
    "text": [
        "Yep - Just like others reported....the scraper on mine broke during first time use while processing about 4 cups of very mushy vegetables for making Hippocrates soup. With that said; this unit was difficult for me to manage. Keeping device stable while processing over a pot was a challenge. I had to try to use my thumb to hold handle part level - which seemed to help. So if you have small hands, size six women's, this will be your challenge besides not getting pissed off if and when the scraper breaks! 2 Stars for stainless steel construction.",
        "Cusipro Delux Food Mill is difficult to use. Reviews say it’s difficult to align and doesn’t work as it should; merely moves the food. It’s too large for me to handle from my bed. (I am in the hospital.) Cuisinart says they will pay for the return postage, but in truth, they will not pick the item up which I thought they would. You must bring the item to a dealer where the item is sold, but there may not be a dealer in your locality.",
        "What makes it \"deluxe\" is a cheap plastic clip that's supposed to function as a \"scraper.\" It doesn't. It falls right off while processing food. I used this once and am seeing if I can return it because it is useless to me. It really doesn't work any better than just pressing food through a sieve manually. You waste a lot of food because it doesn't do a good job of pressing the food all the way through. I can do a better job with a fine mesh sieve, a silicone spatula, and a little elbow grease.",
        "As others have reported, this unit is inefficient and downright ineffective in some cases. Mashed potatoes with any screen is a non-starter - the potatoes swirl in the bowl.",
        "This was a replacement for the one I had for over ten years - the same model. It’s always worked well and the scraper on the bottom is helpful. Just don’t lose it! I wasn’t able to find a way to buy just the scrapper anywhere when mine was lost. (Seems like a good 3D printing opportunity!) Of course, it works fine without the scrapper, just needs a little more manual scrapping.",
        "Very difficult to get the cranking unit clipped - the spring doesn't allow easy installation. When turning the handle the disc lifts and scrapes against the blade. It is very difficult to hold steady over almost any pot or bowl. The little scraper on the bottom is just a nuisance to take on and off, gets lost and the job it does isn't worth the trouble. I can't believe this gets the highest rating. It is VERY badly designed. I won't give it away - I'll toss it after one use.",
        "Got this for my wife. She loves it. It's worth spending the extra for the good one.",
        "I have used a stand mixer for years to make mashed potatoes. After using this I won't go back. I cooked 15 lbs for Thanksgiving and mashed them with no problem. The texture is wonderful. Large amounts may be easier if two people take turns.",
        "Have been cooking enthusiastically for almost 50 years and have used many kitchen appliances and gadgets but this food mill was unworkable. If I had not brought it to to my daughter in Texas and left the box behind at home, I would have returned it. Don't buy it!!!",
        "It is a little hard to snap the cross brace into place. Other than that it works great. My daughter is borrowing it now .",
        "Love this item. Very simple to assemble, disassemble, and clean. Made our apple processing so much easier.",
        "The recipient was pleased with it. I have not used it personally.",
        "The plastic scraper on the bottom was disappointing. Seems well made with stainless steel but they use a plastic scraper on the bottom, could have used stainless steel for the scraper but took the cheap way out.",
        "I was pretty excited to use this for tomato sauce today. Unfortunately, I didn't get any chance to experience the now-maligned plastic scraper, because my box did not contain one. There is, apparently, no way to replace it. 25 year warranty? Really?",
        "Well made, well engineered, and the perfect size. I love this food mill!",
        "The welding on the handle is weak. The handle snapped right off. $86 wasted.",
        "Solid construction, but plastic pin that holds scrapper was really cheaply made for the price .",
        "Great tool to have. takes mashed potatoes to a whole new level.",
        "Smooth and delicious applesauce without peeling the appples makes my new food mill a treasure. Easy to assemble and disassemble for cleaning.",
        "Unbelievable is all I can say; what a difference quality makes. I had an older, cheaper version and fought with it every time. This was a breeze to handle and worked so fast. I love it.",
        "It was well made with attention to detail. stainless steel. Large bowl. easy to use. It was a wonderful birthday gift.",
        "Food mill works awesome. Great product, easy to use and clean up.",
        "Functional and stylish in it's bright stainless construction. An explation of the uses of this product and its three discs would have been helpful.",
        "Way too heavy sand not sharp enough to mash well.",
        "Excellent design works great easy to take apart and clean.",
        "This product will produce more applesauce in half the time as my old food mill. Great product, easy to use and clean.",
        "Thanksgiving day winner! This is the first mill I have ever owned. It worked smoothly and produced the perfect texture of mashed potatoes.",
        "I tried the mill right after it arrived. To be honest the scraper is worthless. It's easier to use a spatula and more effective. The grind seem fine enough and I like the ease of assembly. Now the real proving ground to me will be in the longevity of sharpness and how well it works for other projects, but for the money I was a little disappointed.",
        "We wanted a stainless steel food mill so we reviewed Amazons top five choosing Cuisipro. we have only used it for making applesauce so far but we love the ease of cleaning it comes completely apart, goes back together sturdy and looks like it will last a long long time",
        "I've used this twice and both times the results were excellent. It's easy to use, clean and reassemble. I would recommend this.",
        "I bought this food mill as an upgrade from my ancient aluminum Foley because it got the top rating from Cook's Illustrated magazine. Like several other reviewers, I find that the knob falls off the handle after just a couple of turns, rendering the device practically useless. I have emailed the manufacturer which claims to have 25-year warranties on their products. We'll see what they say. But for a product that costs this much -- now even more expensive than when I bought it -- it should work flawlessly.",
        "This product worked well for me and met my expectations. I used it to make apple sauce and tomato paste. The only thing I would like to see is a way to hold the food mill steadier when turning the crank. It is a wonderful product.",
        "This is a great item that's so easy to use and clean. It arrived at my door in no time at all. Amazon is great to work with!",
        "I bought this to replace my grandmother's ancient food mill, which worked fine, but was ancient, galvanized metal, which had lost its galvanized coating. It would react with anything I processed, and the more acidic the worse... This is great stainless steel, but... The 3 size screens do not go to a size that is fine enough for some things I process. The cherry tomatoes particularly made me very sad. I had to sieve them after going through the food mill!! Also, although it fits larger pots because of its different support design, it rocks crazily as you crank it, which can be disastrous.",
        "I use this at least once a day. I have no problem with how it works. I insert it into a large pot and mill away, no issues. Only problem I have, which has been stated in just about every review is the scraper. Mine is close to snapping. Hopefully Cuisipro will send a replacement.",
        "Turned 60 pounds of apples into applesauce with my Cuisipro food mill. I used the smallest metal grate & still there is particulate matter (pieces of skin, etc...) in every serving. I won't return it because I like that it is all metal (trying to stay away from plastic) and b/c I figure - it's homemade applesauce, it's going to have apple parts in it.... But if I had my choice, it would be nice to have a product that would keep all of the particulate matter out.",
        "I use this good now to desired tomatos, guava and I tried but was not so good with strawberries however it is a life saver for larger seeds.I agree that the plastic scraper pin could-be better organized as it seems fragile all in all a food mill is a wonderful tool for the kit5.",
        "I ordered this product 2 months before I was going to use it. I am really unhappy with the design of the product. It tries to push the peel from the tomatoes and the apples through the mesh and they get stuck under the pusher. I would have returned it if I had used it during the first 30 days I had it.",
        "Bought this because of the great ratings but it's not the easiest to use. I would have expected better for the price. For what it's worth, the one thing I used it for so far was multiple batches of hot sauce - I use it to strain the pepper seeds out after it cooks. It is a little easier and faster than pouring the sauce into a strainer and using a spoon to strain the sauce, but not much. Perhaps it works better on things other than pepper seeds.",
        "I really like the quality of this meal. The only thing that needs better engineering is the screen wapper. The wapper works great when cranking clockwise but jumps off when cranking counter clockwise to purge the apple peelings.",
        "Excellent mill. I use it almost everyday and am very pleased. I don't know how I did without this item for so long! Thoroughly pleased.",
        "Works very well but the pin that scrapes at the bottom of the food mill is plastic and arrived broken. Still works without the pin, we just use a spatula to clean the bottom as we are using.",
        "It was way overpriced. I have seen it for cheaper.",
        "I am a fan of automated kitchen items, so I don't give this food mill five stars. It is, however, a very good mill. I've used it to make the best mashed potatoes I've ever had (my son loved them, too), and a very good homemade spaghetti sauce. It's a little work to turn the mill, hold it over a bowl or saucepan, and keep it all still, but if you want a food mill that does a great job at getting a perfect purée, this is it. It's easy to assemble and disassemble, and it's very easy to clean. I'm happy I purchased it.",
        "It's a good, heavy duty food mill but really pricey. In retrospect, I think I would have been just as happy with a less costly product.",
        "GREAT product!!! Received it just in time for Christmas! My husband loves it, it's Old World meets New World, how times have come around! But it's the BEST! No lumps for mashed potatoes! Great for applesauce too!",
        "GREAT easy to work with Ceaning is a BREEZE Thanks amazon it was Your best Item Review i am so happy with it",
        "Arrived quickly, well packaged, worked as expected. The pin on the bottom took a minute to get the hang of but overall great product.",
        "Does not brind food, just pushes it around, not enough friction to press food through",
        "Works v good. Good fruit squeezer for small batch wine making.",
        "This is a very good product and well designed. The scrapper under the screen seems a bit cheap in design.",
        "I bought this because of the review from America's Test Kitchen. It works as promised, but it's too much food mill for my kitchen. I now wish I had purchased something smaller. This is great for professional kitchens, people who cook a lot of food, or someone who has to have restaurant-grade everything. However, if you're like me (a regular cook) you'll do better to get something smaller and less expensive.",
        "This works awesome , don't know why I didn't get this a long time ago!!",
        "I bought two less expensive Food Mill's before I finally came to the realization that the extra money is worth it for the best food mill available. It is not a tool I use a lot, but when you want to mash potatoes or make a tomato sauce, the quality and efficiency of the Cuisipro is well worth the additional cost. The Cuisipro is so superior to the other two food mill's that I have owned that I am regretting the money I wasted on inferior products. I made mashed potatoes for sixteen this Thanksgiving in half the time thanks to the Cuisipro.",
        "Not worth the price. There is nothing special about this mill. It's 2 quarts, and has a poor design.",
        "I haven't used it yet but it appears to be well made and very good quality.",
        "I have not used it yet but having had similar, cheaper ones ,it certainly seems very good. I am sure it will be very good.",
        "Well built but not functional. Stick with your stick blender and food processor."
    ]
}