{
    "entity": "Plier Sets",
    "text": [
        "These three pliers are not fancy, not top of the line, but they don't need to be. The bi-metal construction is surprising for such low-priced and mundane tools. Handles are comfortable and grip is fine. Bought these to replace 30-year old pliers that had loosened. I expect these to last that long and be in better shape. My opinion of Stanley tools has improved in the last few years. I don't care if they are made in China, so long as Stanley's specs are demanding and are applied diligently by the manufacturer. That appears to be the case here.",
        "Both sets I've purchased had the rubber peel right off the handles with minimal usage. I have no idea why. I was actually just teaching my daughter how to use them and the handles degraded in my hand. I have a similar set from 25 years ago going strong. I must have had the two new ones I ordered for my gradually building my kids move-out tool kit come from a bad lot.",
        "I've noticed that some Stanley tools now come coated in factory grease, which is super unfortunate for people that need tools in a clean(er) environment. I bought these to have something in my go-bag, they'll work but the grease is not the best.",
        "They're nice! I use them maybe once a week, and for that level of work, they're great.",
        "These are such good pliers. They are perfect,I feel like they will last my life. the handles are really comfortable, and the metal it's made out of is not cheap at all, they all have really good grip and are beautifully crafted tools",
        "Perfect for the traveling IT guy! All of these measure in under 7in which is the TSA max for hand tools. Work well for small jobs, if you are doing bigger jobs you will want longer handles for the leverage.",
        "Good cheap tools and the size fits nicely in your hand. The pliers are a bit loose and it would really be nice it the needle nose had a spring to make it default to its closed position. Overall though, a good set at a great price. I'm sure I'll misuse them so it's good they're cheap.",
        "Great quality tools that will hold up for daily use. I purchased to replace my old ones and those lasted 6 yrs of hard labor work. These are of even better quality then my last set.",
        "Nice set, good to have around the house. I am not a professional, but I am very pleased with these tools. Recommended.",
        "These seem so well made - and they're sturdy and the handles feel great. However; they rust for no darned reason at all. As near as I can figure; they rust because they're exposed to the air. Very disappointed with the quality",
        "Excellent as always with Stanley products. You know what you’re getting...quality!",
        "These tools have additional features so that an additional tool is not needed. Quality tools.",
        "The handles on the pliers have rivets and are not smooth as shown. Thus, they collect a lot of muck, dirt, debris, etc.",
        "Bought with other essential items as a starter tool set for grandson. I considered keeping these myself and giving him my well-used tools, but couldn't do it. The handles are comfortable but large. I don't know how long they'll last, but they're excellent for now.",
        "The handles aren't very comfortable. The black part is rough and didn't need to be. This is a nice quality set for the price.",
        "My son loves this plier set and then also having the warranty which is nice to have.",
        "I wanted to create a small, basic tool kit for myself (a single woman). Stanley is a highly-regarded brand, known to be strong and reliable. This is the cheapest price I could find - both on the internet and through stores.",
        "These are Stanley products, and as such, they do seem to be of good quality....handles are grippy and comfortable, and price was fair...would buy again.",
        "the grip is amazing. 6\" is perfect for a man. great finishing. the adjustable plier is somehow useless but the cutter and the nose pliers are amazing",
        "Decent tool set, seems solid in construction, but I haven't gotten to use all the types yet. However, the rubber handles are a nice touch for a better grip.",
        "Sturdy, and good variety for most things I can think of that I would attempt to deal with.",
        "Bought as gift for someone who needed in house tools. Is a good brand for home projects but not heavy duty work.",
        "Used only one as I just got them. They seem well made and the price was very good. Fast delivery. Im satisfied.",
        "I cannot rate this item as I brought it for a gift.",
        "Just got these last week and I'm very pleased so far. The quality seems great for the price, and the handles are very comfortable.",
        "As a construction carpenter, I'm hard on tools. I've used Stanley tools on the job and they last pretty good for the price. They do just fine around the house.",
        "Just as described. Good product at a good price. Highly recommend.",
        "I like it but plier is not that good holding condition, its very loose. ok for the price",
        "These are great hand tools. The grips make these so easy to handle and make your task much simpler.",
        "Grips are great. Full size unlike some of the other pliers sets you see.",
        "I have not used these yet but for my mild use, I am confident they will do the job. Stanley tools have never failed me.",
        "Nice set of tools for ordinary household chores. Price was quite reasonable.",
        "Just what anyone needs for the home. Don't need them every day but when you do and it's not there, major groan. So glad it got them.",
        "Good quality. Bright yellow so you can spot them if you misplace them.",
        "As usual top notch quality just like I have come to expect from Stanley Tools!!",
        "Fantastic! I am always looking for an excuse to use them!",
        "Hard plastic handles, not very comfortable grip for longer term use.",
        "Purchased as a Christmas gift for a family member. Gift giver and gift recipient very pleased with the quality.",
        "Product was just what it was advertised as. Good quality for the price. I am very happy with the products.",
        "I bought these for my fiance since he does some electrical work, he loves them!",
        "I don't have plans to use these for heavy-duty work. Just occasional light stuff. Recently moved from a house to an apartment, and all my \"house things\" haven't yet arrived. This set of Stanley pliers (and another order's set of Stanley screwdrivers) are like Linus' blanket: I feel naked without some basic tools around me. I anticipate that these will do just fine.",
        "Handles are yellow, not black as pictured. Pliers work as expected.",
        "I bought these for working on crafts. The are perfect for that and at a great price I would buy them again.",
        "Stanley Tools should be embarrassed to sell such crap! Simply pick up the tools and the feel is absolutely junk. The metal used must be of some foreign, poor hardness grade. The first time I used the 6\" long nose, they would not grip and function properly. The first time I used the 6\" diagonal clipper, the cutting surface chipped and are no longer of use. DO NOT BUY THIS PRODUCT. By the time I got to use this product, it was past the 30 day return policy. Amazon return policy on tools needs to be at least 90 days. BOO to Stanley and DOUBLE BOO to Amazon."
    ]
}