{
    "entity": "Plier Sets",
    "text": [
        "I'm rewiring my 1892 house and this set has been SO nice to work with. The linesman pliers are the work horse of the bunch, but I've used them all to rip out and replace my first floor wiring. They are all solid and feel heavy and the grip on them has stayed on after 10 months of weekly use. If I lost these, I would definitely buy the same pack again.",
        "Bought for my husband. He loves them. The ones we got were black metal instead of silver, tho. Makes me wonder if they are fakes. However, so far they have performed well. Have not tried anything too tough yet so we will see...",
        "Good heft. I've had them for a while, used a few times, and coated them in wd-40 when I first got them. Other than typical usage they are in tip top shape and get the jobs done. I'd buy them again.",
        "Great set of Pliers and cutters. Look almost the same as the old set I have had for forty-five years. The old set is good enough still, but I decided I needed a new set for my birthday. I have used the dikes and the side cutters and they produced nice clean cuts on three wire extention cords I had to repair with new ends. Good tools.",
        "These are a lot bigger than I had in mind when I ordered them! Please make sure to check the size before you do.. They are kind of huge, which makes them serious work pliers for a handyman more than just simple stuff around the house. I have small hands, so they are not that good for me. Otherwise they are a pretty nice set of pliers.",
        "In rating an Amazon purchased screwdriver I said that it wasn't an item most people could love (unless burdened by the rare screwdriver fetish), like, or hate. I pretty much feel the same way about pliers, but this set appears well made, and I like having them around. I used two recently to open a small plastic container -- that says more about my haplessness than it does the pliers and doesn't add much about the quality of these tools. But I did finally get the carton open with their help.",
        "These pliers were okay, except for the basic one, which was not tightened enough, I guess. They did not feel right and were very loose. Amazon will give me 40% off since I did not want to return them all. The plastic was very hard to open and I had to finally use the blade I bought w/plastic or ceramic blades. Amazing how it works without cutting your hand with light use. I don't care too much for the bright yellow color.",
        "I am creating tool boxes for my grandchildren and some neices / nephews. The Stanley tools seem to provide a decent quality at a reasonable price. So far, Amazon and Stanley have gotten the majority of my tool purchases for my grandchildre. My grandchildren don't need, and I don't want to pay for, top tier professional tools; but low end tools are often a poor bargin. This seem to fill the middle niche nicely.",
        "These are an excellent heavy duty set of pliers. They have no play in the hinges yet move easily without sticking. The handles are great so far and haven't slipped or tried to fall off. They are also easy to with or without gloves. The side cutters and needle nose are my most used and work great. The side cutters cut 12 gauge residential wiring easily and twisted copper wire without leaving uncut strands. The needlenose are great little grippers. This is a very cook set of pliers for the money and I definitely recommend them.",
        "They all seem great. I did add a smaller needle nose and will probably get a larger thinner one for tighter spaces.",
        "Excellent purchase and quality is great. Have been using them for a while with no problem. I would recommend this set!",
        "These are heavy duty pliers for a great price but don't fit my original need. I wanted a matching set for a small house kit so I don't have to go digging around in the garage. These are bigger than expected and will end up being the garage set instead. They seem to be really great pliers and will probably work just fine for you. You'll see in the pictures that they're pretty big for my small hand. I've also included a comparison to couple other pliers we already have (a Kobalt, in blue and Stanley, in red), which are closer to the size I wanted.",
        "I use the cutters frequently on 4ga and some times 1/0 wire(multiple cuts needed.) They do their job. The pliers are decent and don't change sizes on you. The needle nose are fairly big but if you're working on larger equipment then won't be an issue really. Only issue was the grip on one piece was coming off. Just used some sealant I had and it works fine now.",
        "I've got other tools before, and that's exactly what I lack. The key is that I'm happy to have chosen this one for the same kind of product from Amazon. Quality and price are perfect.",
        "Somehow when my things were moved to an assisted living center, my tool box was left behind. I am gradually replacing the tools I find most necessary, nd good pliers are right at the top of my list. I like the feel and weight of these tools. I find the grips on the handles a very nice touch.",
        "These tools have come in handy too many times to count! They have been so valuable to have, and I use them on at least a weekly basis.",
        "These are definitely some heavy duty pliers - too big almost for what I will use them for (motorcycle work, general household use), but only because with the size comes a little bit extra weight and I'm a woman so smaller hands. The quality is there though so if you need some pliers that can withstand some serious use, these would be great.",
        "I was expecting smaller sized tools. Upon receiving these, I was amazed at how large they were. The picture here looks deceiving. However, I am glad they are larger than I thought. They are sturdy and seem durable. I love Stanley tools. My only concern is that I received two of the same. But it is not a big deal really. Great for around the home.",
        "Good weight, very comfortable, & durable! Be sure to mist with a light coat of WD40 between uses 🙂",
        "Good quality pliers set. Good set for average home owner.",
        "I know where they were made and bought them anyway to carry in a boat box. (I coat them well with wd) and am surprised at the craftsmanship of the set I got. very surprised and good enough for now.",
        "Well made pliers purchased for the toolbox on my pickup. These should last my lifetime unless they get run over by a dozer. I did place a small drop of oil on each to allow for smoother open/shut, as they were delivered as dry as a bone.",
        "This set is a big upgrade to my tool set. Very good quality and built tough",
        "I'm always leaving my pliers in weird places and had completely lost nearly all of them so I bought this Stanley set as a replacement for four of them. These seem to be well made and not at all poorly made. To really give a full review I will have to wait a year and see how they hold up.",
        "This is a awesome heavy duty set. the pliers work well and are a nice addition to any home tool box. This set will handle anything except channel lock type applications. Very very nice to have on hand and high quality you know you are holding a tool and not some piece of garbage.",
        "I was leary about the price because it was so low but I received this set and they are nice.they are heavy duty and look real nice. Used the pliers and clippers at work today and really like the feel of them. The cutters are nice and sharp",
        "The handles are a little more beefy than necessary but these are great sturdy tools.",
        "For the price this is a great set of pliers. The lyman pliers could be a little bigger but I mostly bought it for the needlenose, snippers, and regular pliers. Good thick quality handles. no issues in the 2 years ive owned them.",
        "Never had a bad tool from these guys. If anything rusts or breaks I can call them and they replace it for life! It's just the loosing factor I can't seem to find my tools",
        "Great set! I've used them several times already and am pleased with the grip, the weight of the pliers, and they do the job nicely. The snips cut well.",
        "Nice set for all-around home work. Good quality, especially for the price. I had this set for a couple of months now and use it all the time for various tasks at my new home. Long nose pliers - must have for electric/wiring tasks.",
        "I haven't used them yet. They're built strong, and they look great.",
        "A nice set of pliers for my garage. All surfaces align accurately and the pliers function smoothly. No problems. They are a good buy.",
        "Great tool set for the price, saved a lot of money over buying these tools in the local store, quality is great and should work well for just about anybody",
        "Nice set of large pliers set. The recipient loved them",
        "Nice set, especially for the money. I use them for around the house odds and ends and they work great! More than I need for that really, but for this price ya can't go wrong.",
        "This set of pliers an side cutter is well made and stands up to the quality that is expected from Stanley. They are, however, large and if you do not have fairly large hands you should probably purchase the smaller versions.",
        "These will last my life time and then some if I don't lose then. Am going projects around the house, mostly small electrical jobs plus running speaker wire. These are heavy duty for home and have come in very handy.",
        "I bought these to have on hand at my vacation home (tired of lugging tools back and forth). Last weekend I the occasion to use most, they are really of good quality and at great price. I highly recommend them.",
        "Nice set. Never seem to have enough of the right tools handy. That's why I bought this set so I have extras within reach (hopefully).",
        "I think my ex-handyman took a lot of my tools. That's not so bad. My former pliers were old enough to vote. These ones are nice, solid and rust free.",
        "Nice pliers love the yellow handles for finding them when set them down mid-job.",
        "I find that these are larger than needed. They are very sturdy, but just feel too big to use most of the time. I find myself using other tools instead.",
        "I have this set in my mechanic to box that I used for many automotive repairs. I liked it so much I bought another set for my HVAC tool bag.",
        "When you get the blister pack that these pliers come packed in and feel how heavy it is, you realize that these are no lightweight tools. They are thick and heavy with steel, and look like they will last forever, certainly longer than I will.",
        "I'm only giving it four stars base appond my personal opinion and experience and handling of other tool manufacturers, they're not klein or Greenlee but they get the job done it's a good deal for what you pay for.",
        "These have held up to a lot of use and I'm really happy with this set. For them to still be kicking over a year later in my line of work is great. Good value for your money!",
        "I was in need of a good set of tools for miscellaneous tasks around the house. I purchased numerous Stanley tools with a gift card I received. Then I went on Amazon to find the rest of the pieces I wanted. These tools are very good quality and conservatively priced. I have more pieces on my wish list that I will be buying in the future. I appreciate their great customer service and timely shipping.",
        "We were excited to order these due to the Stanley name. We sent them back after seeing them, the quality was very poor, example, the needle nose pliers do not even touch each other to get a good grip. The wire cutters were the same and could not cut the wire due to a sizable gap between the snippers :( disappointed",
        "Good tools, but they rust really easily. Coat them whit cosmoline or Vaseline when you receive them to prevent rust.",
        "Stanley 4-piece pliers set is a great addition to my tool box for small mechanical jobs in the garage. Like the American made and lifetime warranty offered on these tools",
        "Great workmanship. Good Price. Super Quality tools. These will last a very long time.",
        "Nice for the price. They are bright enough to help reduce the chance of me losing them. I will lose them anyways, so I will definitely be buying again.",
        "I purchased this set to keep in my garage to tackle everything from automotive to simple home fixes. The quality has surpassed my expectations and I highly recommend.",
        "Stanley has never disappointed with the quality of their products ! If you don't have any tools and need to buy quality, long lasting products, you can't go wrong with STANLEY.",
        "Fine tools. Get what you pay for, you can tell in the picture what they are, nothing more. No springs, I'd suggest going for springed tools. Great price",
        "Good value tools for the home. Do not know fomr a professional POV.",
        "Stanley is a good product and this is a very good set of tools for an excellent price. You will not be sorry for buying these. Hope this helps.",
        "These are big tools and I like that. They may not fit smaller hands. They feel like they will outlast me.",
        "These are just a bit larger than I would have preferred. Hazards of ordering online, I guess. They seem solid and I'll use them. I do like the grip material.",
        "These tools appear bigger than the picture, they are not the smaller set. Looks pretty durable and works on a few of my projects. A simple and working tool set.",
        "Nice tools, better for a larger hand (sorry Don) exceptional for the price.",
        "Nice set. A little larger than I imagined but I find myself pulling them more than anything else rewiring my house.",
        "These were a gift for my son along with another set of tools. I figure I can just keep building on his tool set. He loves them!",
        "I would have rather these pliers had a rubbery feel to the handles over the hard plastic feel but other than that they seem to be an excellent choice.",
        "I have only had this pliers set for a couple weeks but have already found them useful in several situations. These pliers are fairly large, they may be too big if you have small hands. I found the size to be a perfect fit. The build quality is great, these feel like they will last forever.",
        "Great Tools will enjoy having these in your tool box",
        "Good quality set with a nice substantial feel. Better quality than the store brands I have purchased in the past for the same price",
        "Bought this as part of an emergency repair tool kit for my Chevy Avalanche. Haven't used them yet and hope I don't ever need them.",
        "Nice set of pliers for home repairs. This is a variety of pliers to use in the home for different kinds of uses. It's nice to see them all in one set.",
        "Has the most common plier configurations you'll need. They're good quality and price effective. Highly recommend. The cutters are very effective.",
        "I love this set! Got it on sale during Black Friday. Everyone needs a good set of pliers.",
        "The Stanley pliers are high quality and strong. They are very good for maintenance. the price is reasonable. They will last a long time",
        "Just excellent, really wonderful, this set of pliers Stanley is really what I expected ... perfect for setting quality electrical work. And not to mention the price, all excellent. Thank you",
        "good price, well made, have several sets around the house because you always need pliers/cutters for something",
        "Nicely made very happy with the quality time will tell if they last it is a shame it could not be made her IN THE USA",
        "The dikes don't cut well other than that no complaints.",
        "My husband likes these because they fit perfectly in his largish hands and get the job done. Was a great price for quality tools.",
        "One can never have enough tools for around the house 'Honey-do.\" Now I am saving up money to get me a nice Craftsman tool box to put everything in it.",
        "Clumsy tools. Cheaply Chinese made. I wouldn't recommend it. I would spend a little more and get quality ones.",
        "Amazingly sturdy. Not toys. Should last a good long time. Each does what it is designed to do. No complaint from me.",
        "This is a great option. Good quality, fair pricing and durable enough for consistent use on a variety of projects.",
        "great delivery and very useful tools. looks solid in design always trusted stanley when it comes to tools to be use around the house.",
        "These are STANLEY tools. What more needs to be said other than that this is a super price on this quality pliers set!",
        "Very good pliers. The best I could find after a lot of research",
        "What can I say. I don't know much about tools, but these were a gift for my husband who seems to think they are of good quality.",
        "These equipment are really good. They have different sizes work with everything you would use with. I absolutely recommand it.",
        "they were all big no small ones i still needed a small one. But they are great",
        "Easy-to-use tools. Steel I liked it. Well seasoned material, which makes it possible to work without thinking that it is you can do. Thank you.",
        "The Stanley 4-Piece Pliers Set is a really good deal and the quality isn't that bad either. Good for around the house and whatever else you can think of to do lol. Stanley is a good product and by no means craftsman or snap-on but nobody is claiming that. If you need them buy them...you won't regret it. I would definitely recommend and buy again if needed.",
        "Quality craftsmanship is worth the price...particularly for such \"must have\" tools.",
        "Somebody stole my electric kit and I had to start over. These are pretty nice for the money.",
        "Items are physically large than expected. Feels like a decent set for the money. I will be the occasional user at best.",
        "I like stanly tools for home use. They are one of the least expensive but have a little weight behind them. Perfect for fixit jobs around the house",
        "This are the larger size plier set at 8 - 10\" long.",
        "This 4-piece pliers set is a quality product well made and I'm very satisfied with the purchase. I would buy them again.",
        "All of the tools are high quality, and made an awesome gift to my dad. They're bright and easy to find, and grip...effectively.",
        "Needed a variety of pliers/cutters and this set fits the bill. Very durable and work like a charm.",
        "Great set of pliers. I bought them as a second set of tools to keep in my backyard storage shed.",
        "Solid, all that you need.Very Good price for the quality offered. Buy it with confidence!"
    ]
}