{
    "entity": "Laptop Network Adapters",
    "text": [
        "work very well but does work from laptops from early 2000 because the old modem no longer works only from laptops 2005 that uses today online that use this kind wifi card can support it",
        "I have this card installed on two laptops. Basically, we turn on the machine and we have access to local LAN and high speed access to the Internet via a cable modem. There is nothing to making this card work besides installing the driver and starting to work. The best speed achieved so far is 54 MbS whilein the same room with the router, 48 MbS when located on a different level and two rooms down. Speed drops off when distance increase to over 100 feet and there are ubstructing walls, including an exteriior stucco wall that has signal eating chicken wire. However, multiple machines are hanging and banging on this technology without incident. The best thing: NO MORE CABLES!",
        "It works as advertised if you need wifi over a laptop that doesn't has built-in adapter, this is the way to go. I wish it will be narrower, thats why its not 5 stars",
        "Installed and connected with the wireless modem, but won't allow me to access the internet because the modem and Cisco encryption is not compatible. It works if password protection is turned off, but that's not safe. I share the modem with other users so I can't try a work-around I found on forum boards. Secondly, the signal strength bounced around from strong to no signal without me doing a thing. Waste of money...don't buy this.",
        "Though it is listed for use in ME, I am not able to get a connection, even 16\" away from the signal. I wanted to add wifi to the laptop I carry on trips instead of the small screen on the phone. Even downloading from Cisco didn't help. It always hangs at aquire. Could be the laptop, could be there isn't any service for older OS's hard to say. Don't need the card with newer laptops, because they already have wireless connectivity installed. The seller I got it from packed it very well & it got here from across the country fastest of all the products i ordered that day.",
        "I ordered this item to replace my previous one of 4 years (which I broke from dropping the laptop on it). These units are sturdy and efficient. Word of suggestion to reduce conflicts with XP: instead of following Linksys installation directions (CD software first then hardware) install the adapter first, let XP install wizard start-up and tell you when to run the CD. That way you install the drivers without installing all the proprietary software that can cause conflicts if you change wifi locations often. The seller described item correctly, it would not have been apparent that this was V2 instead V4 like I had previously.",
        "I knew from EveryMac that some Cisco/Broadcom cards could be used in Macs, being seen as Airport/Airport Extreme by the OS. Looked here and saw a review that said it could be used with a Powerbook G4 using 10.4.11, so I decided to try it on a Powerbook G3 with 10.4.11. Worked beautifully. Immediately popped up in the upper right corner, was recognized as an AirPort card and got me access (I had to use WPA Personal instead of WPA2, but hey, it works).",
        "I wanted to upgrade an older laptop's wireless security from WEP to WPA. My old pcmcia network card was several years old and was 802.11b plus had WEP as the only security option. I have a Linksys wireless router so thought the Linksys unit would be a good choice. No problem with the setup but I found the signal strength was low when the computer was in the same location as when using the old card. The price was acceptable compared to local big box stores. The unit did work but users may have less range than would be acceptable.",
        "This is a new-in-box PC-card wireless unit. It arrived quickly, and it works perfectly. It isn’t up to the latest standards for WiFi, but it works with my home system and pretty much any public WiFi system too.",
        "This worked without one problem. I was able to save an old IBM/Lenovo from the junk pile. Good internet connection and the Cisco-Linksys is well supported in Linux.",
        "Super cheap, reliable Wireless G card. *** As with all things PC related, your experience will vary dependent on your IT knowledge. (In other words, don't blame the hammer when you hit your thumb!) These work great if you know what you're doing and what you're buying. This fit the bill for an old IBM Thinkpad that didn't come with wireless. The IBM Thinkpad is long dead but the card will find a new home eventually as it still functions great. This card served it's purpose 24x7 for 3 years straight.",
        "This buscard rescued my old 2002 Titanium G4 Powerbook (667 MHz, running OSX 10.4.11). The older internal AirPort Express cards use an outdated WEP security protocol, rendering the laptop unable to access most WiFi. This works like a charm - I just popped it in and selected it in System Prefs, no driver needed. I did a speed test and found that it's just as quick to download and upload as my newer Macs.",
        "I bought this for a super old IBM Thinkpad that I found at a thrift shop. The card came with a CD with Drivers for it, but after being unable to get the thing to work I discovered that the install disk had the wrong driver for the device. Luckily, the old Thinkpad had a USB port, so I was able to download the driver elsewhere and copy it to the Thinkpad. I ended up returning the product because I decided to toss the laptop.",
        "I bought this card to help my son's laptop receive the signal on his laptop and after installing it; it did not show hardly any difference! He still had a hard time getting the wireless signal in our home while my laptop did great with a different type of card! So one star for fast shipping and one for the price is the best that I can do at this point! Maybe someone else has had better success than us! Thanks!!!",
        "it can be a bitch to set this card up properly in old OSes, but it works great on my Gateway Solo 1200 laptop with windows ME installed, I can't really watch youtube on that machine, but, it can browse google quickly at 10mbps",
        "I paired the purchased network card adapter (used on my laptop) with my Linksys Router. it was a really simple operation and setup was a breeze, just load the software, insert the card, voila, immediate connectivity with the router. I called Linksys help desk in setting up WEP security and that was a breeze as well, the tech walked me thru the process in approximately 25 minutes. I highly recommend this product (Linksys works for me) as well as purchasing from Amazon (Aone seller) for the best price and service.",
        "Great Saleat the time. older laptops will take this not new ones. thanks for item.I like it , . Great Sale, thanks for item. cant think of any more words ha. this is why its a pain to do reviews,amazon needs to many words . How about just great sale , or great transaction ect ect. dont need to write a book to do these feedbacks. Just my opinion. Love em otherwize",
        "The card installed fine and showed fine but showed disable on the machine. I un/reinstalled it several times and eventually did enough googling to find out it's just an issue with an older piece of equipment. Don't get me wrong, it was being installed in an Inspiron 7000 PPI which is like 800 years old but it was listed as 100% compatible per OS and hardware. Just not functional.",
        "I should have paid more attention and given more credibility to other reviewers with regard to Windows 98 SE, older computers and WPA. I wanted this card so I could use my older laptop with Windows 98 SE with my newer wifi with WPA security. Not only would it not install, now I realize I would have been stuck with just WEP anyway... no WPA. Thank goodness it wasn't that expensive.",
        "I recently installed an entire wireless network using Linksys 54g products. The installation took place in one room. The router was to sit in the room with the desktop, but I also installed the laptop in that room because it was easier than walking back and forth to install the software. (by the way this was on a Win2k system) Anyways, the laptop software was very intuitive to use and easy to install, the laptop worked perfectly. The desktop on the other hand did not, see my review there. I recommend this product, but not it's desktop counterpart.",
        "the card was very easy to install, both the software and hardware. The software allows you to revert to the Windows Wireless management, which I had to do while on vacation. The Cisco software didn't do a good job at finding wireless connections especially if you move around to different wireless locations. Its easy to revert to Windows wireless management in that case. Card offers solid connections, at decent speeds for a Wireless G card. It works well with my Rosewell Wireless N router. The extension part of the card sticks out an inch or so, which isn't too bad. Super price on this device makes it a super buy.",
        "Bought several but didnt hold up. This review is like 10-15 years to late",
        "It took me precisely 3 minutes to install the card, including the Windows 2000 restart sequence! It worked perfectly on boot up with the default values. I got much stronger signals than the 802.11b card (Linksys) I used previously. I still use this card on my old 802.11b network in mixed mode although I will be upgrading the network to 802.11g when I have time to do so (I already bought the router for it). I would recommend this card to anyone.",
        "Worked great at getting an old Compaq laptop running Windows 98se to connect to my network.",
        "I had used this for a very old Dell laptop, and it works great. I never had any problems with it connecting to my Wi Fi The laptop is no longer working, but this is still going strong. I gave it to my daughter so she can use it with her son's older laptop that she lets him use to play educational games on the Internet.",
        "This wireless adapter works very well with my older laptops. I only have a few issues with it. Getting it to work with Linux or with a Windows account other than administrator takes a lot of work, if you can get it to work at all (this problem is especially big with some of the more obscure Linux distributions). If you are running with administrator or similar privileges on Windows, it is perfect.",
        "I was very surprised this worked as well as it does. It took a lot of fussing to get it going and occasionly takes a litte fidgetting which have done without help. It gets the desktop to router connection without a cable. Be sure put in the correct router ID.",
        "I purchased this to revive a really old laptop for use with Ubuntu 10.04LTS Netbook Edition. It was extremely effective after installing the appropriate drivers. It supports WPA2 and connects to networks at full G-speed. I gave the laptop to my niece to use for university classes. I am happy with the purchase, just wish there were an easy to configure wireless-N PCMCIA card for Ubuntu... :)",
        "Works great for my old IBM Thinkpad 2626-7OU and Windows 98SE. Now I can connect to the internet through my home Wi-Fi.",
        "I found this on amazon about 3 years ago for my mom's old notebook which is about 10+ years old. Wireless adapters are not available in stores anymore since computers now have built-in wi-fi cards. She now has a new notebook but still uses her old laptop with windows 98. She's had no problems with it, I should know, I'm her tech-support :)",
        "I purchased 2 WPC54G PC cards along with the WRT54G Wireless 54g Router, upgrading from Linksys' 80211.b router and card. The speed increase is great. Configuring the router was a bit confusing, but it was worth it. Small detail but appreciated: card comes in a clear plastic case for protection. My old WPC11 card didn't come with a case. This is helpful if you are going to throw the card in your notebook carrying case or a drawer in your kitchen.",
        "I am a total novice when it comes to wireless, and this product was a breeze to install and use. I have an older laptop, and wasn't even sure that this card would work on it, but it took only seconds to install the software and after I found the correct code to connect to my wireless router I was immediatly online. I was very pleased in the ease of use and installation.",
        "I just received the Linksys 54G router and network card and within 10 minutes I was surfing the net. I couldn't tell a difference in connection speed between my old hardwire cable modem and the 54G wireless system. I did have some issues getting connected via my secure company connection though. Other than that, it was instant and fast. Now I can work on the back deck with a beer at cable modem speed without wires. The freedom is well worth the money.",
        "In a world where network cards are built into motherboards and USB Wireless adapters are practically a dime a dozen I never thought I would ever need to buy one of these cards again. Boy was I wrong. I had forgotten how easy these things just slide in and work. Cisco/Linksys are masters of their craft.",
        "bought it for an old laptop i gave my grandmother. works fine, just slow internet compared to everything else these days. grandma was thrilled with the speed.",
        "Worked great!! in my Dell Inspiron 2650. Great signal strength.",
        "Great product, I bought it nearly three years ago and still works like a charm. We don't have a big house but it works every where, the router is on the second floor and the connection works from the basement, porch, deck, garage and all of the first floor. Never drops the connection and speed always close to 54 Mbps. Linksys has excellent customer service.",
        "All I can say is: \"True\" plug n' play installation in less than 5 minutes + No issues since install = A great solution for getting your wireless network up and running. I have not had a single issue with the product during installation or since, found the product documentation to be excellent, and am very happy I went wireless.",
        "For the price a good experiment but old Dell Latitude CPX with W98 would not load drivers from CD due to defective CD Rom will play with this some more after replacing CD Rom",
        "I have been unable to get this product to work. The phone assistance connecting me to an overseas problem resolution site was unable to resolve issues. After 30 to 40 minutes attempting to resolve technical and language problem, the line would go dead. Even having given my call back telephone number, no call back was made to continue the problem solving measures. Lynksys must create a simpler means to resolve issues. No thanks to buying another product from this company. I would not recommend this product, unless you have the skills to reolve your own issues.",
        "The software is a bit intrusive, but there is a more safe way to go. Plug the device in first, then insert the CD. Exit out of the Linksys program and select in the wizard search removable devices for the driver, your card will work, and you wont have to tolerate the intrusive software that tries to replace system services.",
        "I have an old laptop that I set up to play retro games on my big-screen TV, and it's just easier to download items directly off the internet rather than copy stuff to a flash drive. Drivers still work for Windows 98 and it works just fine with a modern 802.11N router.",
        "The card is OK. In my Dell Inspiron 8200 (a relic I know) the heat can really wear on the cards. This my third card in ~5 years(previous cards were only the B flavor). DON'T USE THE SOFTWARE THAT COMES WITH THE CARD. It runs from your startup folder which means it's one of the last items to load. If you have XP SP2 you are better off using it to configure the wireless, it loads and associates much quicker.",
        "I bought this product from Amazon.com and had to return it. It would not be configured. I owned the previous model (802.11b standard) and installed it with no problem. I purchased this and could not get it to work, even after calling tech support. I have Win XP, and could not figure out what was wrong, so I had to send it back.",
        "Trust Llinksys to help older system or laptops that don't have built in WiFi. Easy plug n play for me at least.",
        "It connects for a while, and when I change the encryption, it becomes very spotty. I try using the repair function under windows, it will fix it if you are connect to the LAN cable. The connection will fail after a while you disconnect the LAN cable. Conflicts with the Windows wireless connection. Very unrealiable.",
        "Worked just fine for a few months, then it died. This was my third one. I gave up and went with an Ethernet wired connection. I do NOT recomnmend this. Only needed on an older laptop. Its really outdated for the ones manufactured today.",
        "My daughters Toshiba laptop WiFi would work intermittently and it would constantly reboot. I disabled the internal WiFi and installed this card. It has wpa2 security and works faster than the laptop originally did. She is happy now and the laptop has not rebooted since. Great card..",
        "Tried to install this card on both a Windows 2000 SP4 PC and a Windows XP Pro SP3 PC with the same result...the drivers would NOT install, no matter what I tried. By the way, I've been working with computers for a living for 22 years, and have never seen anything that can't be installed properly. After wasting about 8 hours of my life trying to install it, I finally gave up and put it back in the box it came in. Installed a different model Linksys card in about 5 minutes with no problems. Unless you have an immense amount of time to try to figure out how to get the drivers to install, do NOT purchase this card.",
        "Worked ok but software not so easy to install. I doubt they make this model anymore. Worked when I needed it for my old laptop most of the time.",
        "Plugged the device in and run the setup disk and works perfectly on a X41 Thinkpad. The wireless device on Thinkpads are crude I could not connect to hotspots or smart phones using the internal wireless of the pad. Cisco has always been the fore runner in computer communications and this device does exactly that. (yes I downloaded and installed the latest drivers from Lenovo)",
        "I've seen nothing but praise about this card so far, bought one myself to use with my B Cable/Router BEFW11S4 only to talk to Linksys support for half an hour and come to the conclusion that its not going to work with my router and I should buy the B version. Its supposed to be backwards compatible with the B standard, but its been four days now and its going back tomarrow.",
        "Gets the job done, about as well as it could be. My range is fantastic. The software could use a bit of improvement -- as long as it's working, it works great, but when something goes wrong, it's hard to fix. But for most users this will give them all they could ask for from wireless networking.",
        "Of course you can't access the wireless network without this unit on your laptop. Not having your laptop directly wired into the home network is the ultimate in flexibility using this unit. With even less than 50% signal strength, I still never get dropped from the network. The WPC54G is the next best thing to being hard-wired! If I need another one of these units in the future, I'll buy it again in a heartbeat! My Dell c640 and I love it!",
        "I had one of this already, but lost it on vacation last year. It came pretty fast and well packaged with information packets and instructions. If you don't have a card bus, which is typically found on older laptops(I have a 2000 myself), dont buy otherwise you'll waste your money, and this isn't the actual wifi, it just enables older laptops to connect to local hotspots",
        "Installed on an older laptop with Ubuntu. It was not easy to get it installed but there are tutorials out there. It works and my sister who just needed a laptop for surfing the web is very happy too. Works well with good range.",
        "The card would not work on a Dell Latitude w/Win2K or on a Gateway laptop w/WinXP. Despite having the Wireless G router/AP, it got no signal when in Infrastructure mode and gave the error message \"No association with AP;\" ad hoc mode got a 100% signal but it still could not ping the router, hence no DHCP server. Downloading the latest (beta) driver did not help. ...",
        "Purchased this adapter for an older notebook that had a broken internal adapter. This adapter works well for the purpose that I purchased it. Software was very easy to load and required no real technical skills. Worked first time.",
        "I was able to stay connected with this around 200 ft away from the router through a brick wall with my old Compaq n600c running Debian. I've never seen it hit even 80% signal strength even when it's sitting directly beside my router though, so that's a bit strange.",
        "Simply would not work. Attempted multiple times with multiple methods to get the thing installed and it wouldn't do anything. A complete dud.",
        "Had received a Laptop computer as a gift. Being new to networking, I didn't have a clue to what should be done. However, was able to set up desktop and laptop by adding this product. I am enjoying the accessibility. Would recommend Linksys products as I also had purchased a wireless router prior to the purchase of the adapter in order to set up my network system.",
        "Am very happy again for shopping online, and to save money and time for things that I need, and would normally not know what I am looking for and to just find it without a sales person trying to sell you something you don't need,",
        "My laptop was real old but this worked, Only problem is since it sticking out on the laptop u have to be very careful u don't bump up against any thing or you will break it.",
        "I missread the ad. I needed a wireless adapter for my desktop computer that is compatable with my Linksys router. The one I purchased is for a laptop. Can't use it and can't find the one I need. I just put it back in the box. Too costly to return.I was charged $10. S & H for this very small item which about 5 times what it should have been. I will never do that again. At the age of 87, I can't afford mistakes like this one. Frank Czagany",
        "It worked well with an older Fujitsu Lifebook computer. The package had a heavy smell of cigarette smoke. Besides the smell of the package the contents and the device worked very well on a Transmetta CPU in a Fujitsu Lifebook P2000 laptop.",
        "I bought this for a Gateway 2000 SOLO 2100 and 2300, but neither of them have Cardbus slots so I can't tell you if or how well it works.",
        "Thought it would wireless connect my laptop to the internet!?",
        "The reviews had me worried, but I found mine to work flawlessly so far. I have used it to convert six VHs-c tapes to digital so far.",
        "Works as designed for our neighbors older laptop. No issues with getting online and they are happy as they serf the world wide web.",
        "After diappointing start, replaced card works. New card out of box was defective. After several sessions with customer service(?) reps. got authorization for RMA. RMA proceedure very confusing, and overly comlicated. Replacement card installed, and WORKS! Lost almost 3 weeks of use.",
        "This was a great thing to use. My laptop back then did not have wi-fi so this adapter helped me a lot and I loved it. It never failed.",
        "I love this item. with windows xp the install was verry easy. I recomend also getting the new drivers from linksys so they are supported in xp. This item will let you connect to B and G networks a very nice advantage then just B. I recomend this to anyone wishing to start a 802.11G or even an 802.11b for less to upgrade",
        "would work great with right pc set up unfortunately I bought the wrong one",
        "Bought this to install in my Laptop. The internal wireless card was inop. The Linksys installed with no problem. I was back on-line connected to my home network in about 10 minutes.",
        "even with the 98se driver on the install cd .........I am still working to get it installed??",
        "This adapter arrived on time and in it's own package. Everything was very easy to set up. All I had to do was put the start-up cd in the drive, wait for it to install, then put the adapter card into my laptop. Poof! That's it. This was so easy I would recommend it to anyone.",
        "Bought the unit to try to get an older Windows 2000 PC to communicate with my network but the PC died before I could get the unit installed.",
        "Older Dell laptop that did not have a wireless card is now working out for a senior citizen working and recovering without being tethered to a desk.",
        "I have purchased three of these and they work great! I've been able to walk down the street 300 feet and stay connected at 1 Mbps. I've connected at multiple Starbucks and airport lounges. Seemlessly switches between B and G.",
        "The people who sold this were extremely fast in dispatching it to me. And since Linksys is a trusted name in Networking products so I was never disappointed upon recieving this product. It just worked wonders for me.",
        "I bought this card to work with my Linux laptop. It does not come with Linux driver and it is not easy to make it work with Linux but possible. If I had to buy another card I would buy some other more Linux friendly vendor.",
        "My wireless went on my laptop, so this little device got me back up without spending money on repairs...or another laptop. Just love it!",
        "This adapter works great and was easily installed. Haven't had any issues with it since installing and it stays connected without dropping signal. Would purchase again",
        "This is a great product. Got it up and running within an hour on Windows XP Pro. The biggest problem was getting the new wireless router to access Comcast broadband. After some trial and error, finally got it going.",
        "I get a full 54Mbps signal even across the house and down stairs. Very fast. I had an installation problem and the support line was very good (answered on first ring and stayed with me to work out the kinks).",
        "It works! Make sure it fits your needs before ordering!",
        "Had trouble getting it to work, using Ubuntu 12.04 on a Dell laptop. The other card stopped working also. Nothing wrong with the card just my problem.",
        "My daughter broke the USB adapter we had so I ordered this unit. It is exactly what we needed and the ease of installation was extraordinary. Not being very tech savvy, this was almost plug-n-play for me.",
        "Received wireless adapter in record time, as promised, and laptop connected to existing WiFi network within minutes - that is, not by following the instructions with the adapter (which didn't work) but rather by inserting after XP was active and it recognized and installed without incident.",
        "completely satisfied with this product orders arrived the day stipulated ... agree with the request if this provider would advise",
        "Plugged it in my 6 year old Dell running XP Professional and it found my home network within 10 minutes. It is still working great. It replaced an old Linksys Wireless adaptor that did not survice a dropped notebook.",
        "I purchased this wireless adapter because a fellow reviewer said it worked with Linux systems. It does work very well! I installed it on a Dell Inspiron 2650 (an eight year-old laptop) that runs Xubuntu. I had to use a different internet connection to find information on how to install it on Xubuntu, but once I did, it worked like a charm. Having the installation CD really helped.",
        "this adapter fit the old computer perfectly and works really good. I am so glad that I found a replacement",
        "I liked it very much. I don't like the requiement the I need to have a number of words to complete this review. Pain in the but.",
        "What more is required of such a ancient computer peripheral? Embarrassed to be owning something old enough to need one.",
        "Grandkids love this wireless card - old laptop that needed a new card. They are happy campers now....no more slow internet connection.",
        "Did not work as expected. Do not waste money on this item.",
        "gave an old Dell laptop to my 9 year old grandson and bought this product for him and wifi works great with it!",
        "This adapter works just fine and so far the laptop its in is working out for me well, I could use more speed",
        "Does not fit the slots in my Vaio laptop, be careful of dimensions when ordering. Did, however, arrive on time and undamaged."
    ]
}