{
    "entity": "Laptop Network Adapters",
    "text": [
        "order this because after reinstalling software lost use of built in transmitter, it is a good unit based on my other computer which has one in use, after ordering this unit found driver to make built in transmitter to work so the new unit is still in the box, but have use the other one since 2007 and have had no problem although I had to remove the d-link software before driver made built in transmitter fully operationable.in this computer, other computer has no built in tramsitter so d-link is the answer there.",
        "I bought a \"matching\" DLINK wired/wireless router to go with this product (the DLINK DWL-G650 wireless cardbus adapter). After spending three hours on my own and about an hour on the phone with tech support, I got absolutely nothing. The computer works just fine with the router when connected with ethernet cable. This wireless card did nothing though. Even though it said I had a 100% signal strength, it would not communicate at all with the router. Sorry DLINK, your product doesn't work and is being returned.",
        "I decided to dust off a 5-year old laptop (Winbook Z1) the other day and install Ubuntu on it. I selected this card because of the Atheros chipset. I can't believe how easy it was to get it working. I plugged it in, installed Ubuntu and the new OS recognized the card. With in minutes I was on the internet, thanks to my neighbor's open WiFi. After a few hours of reading some wiki's and messages, I had WPA running and my \"new\" Linux laptop was on my network. Piece of cake! Great card and great chipset!",
        "This product is not anything special unless you have the D-link DI-624 Router teamed with the firmware updates on both the Router and the Network Card. After that this product is smokin fast. It is just as fast as having a Cat-5 connection. The firmware updates were pretty self-explanatory, if you have any computer experience at all. Even if you don't I'm sure you have a guru fried that will hook you up. Bottom line if you have a need for speed this product will more than get you there and is easy on the pocketbook. Great product D-Link!",
        "Received the card today and had it up and running in less than 10 minutes with zero hassle. Just followed the clear instructions to install the drivers from the CD-ROM, shut down the NB, plugged in the card and re-booted. It found my home network immediately, entered the password - done ! Getting great throughput via my Apple router - within the usual limitation of the truly terrible AT&T DSL connection. Great product, great price , zero hassle !",
        "This card is pretty weak, but also pretty cheap. If you just need an external card for around-the-house close-to-the-router usage, this card will work. If you plan to roam or need a reliable connection from afar, get a better card. It's a good card for the price. Works with both Windows XP and Ubuntu easily. (XP needs the driver utility installed *first*.)",
        "If you have an old laptop with a pc slot and no built in wifi whis works realy well.",
        "The unit performed well. It was a little cranky -- possibly because of the \"new\" operating system,XP. Unfortunately the whole system crashed when I tried to download SP3. At this point I dumped the computer and the adapter in the garbage. Sorry. It would have taken me more work to resuscitate the system thatn it was worth.",
        "The G650 installed effortlessly and i was on the web immediately...This solved the problem I was having with the built in wireless.and for less than it would have cost to correct it by a tech person..Part of my decision for going with D-Kink was success with other products ..the other was a great price at Amazon.",
        "I currently have two of these cards and I have been very happy with them. I haven't had any issues installing drivers. The card always seems to connect and work well. I also have a D-Link wireless router so the cards connect at 108Mbps, double the 802.11g rated speed of 54Mbps. I would recommend this card.",
        "I bought this wireless card adapter for my Dell Inspiron 5100 laptop and got it quickly- only 3 days!! I'm very happy with this purchase because this wireless adapter really works well. It's extremely fast compared to my previous dial-up connection. I went to different electronic stores and used pcmall.com to do research on various wireless adapters having the highest quality with the lowest price but still I ended up buying this.",
        "I got a couple of old PC laptops just for goofing around with and needed a cheap way to hook into wireless networks. These card work GREAT! They allow me to surf, email and even play World of Warcraft with no troubles at all. I am completely satisfied with my purchase!",
        "The Setup was a bit odd as you need to install the software utility before installing the card. Reports connected at 108Mbps because a I have a DLink router that also supports it. You cant' the part that sticks out of the laptop feels a bit flimsy, but it'll probably good enough.",
        "The main reason I got this card is because it working in Linux (It has an atheros chipset), and it delivers. It works great, and the range is awesome. For Windows users, it works great in XP as well. Overall, I am very satisfied with this wireless card.",
        "I couldn't find this adapter locally, so I turned to Amazon.com. Naturally I found it. The price was right, I received the advertised rebate, and the product works as advertised. What more can you want? (P.S.: It's now 7 years later and it still works perfectly.)",
        "I bought this notebook adapter card to increase the wireless range on my labtop. Install was easy and only tool about 10mins. I did see a improvment in my connection, and range. It was worth the money, and I got it fast too. Would recommend it to others.",
        "I have a D-Link DWL-G650 wireless LAN card and it works great with MS Windows XP and Linux! I use Kubuntu 8.10, 8.04, Puppy 4.01 and it just works with my wireless network. A great wireless card, so good I want a second one as a spare...",
        "The D-Link wireless G adapter has been a great addition to my home network. I installed it on an old Dell Latitude CPiA laptop I recently replaced as too outdated. The addition of $[...] of memory from E-Bay and upgrade to XP and this old machine is hanging ten as it surfs the web. I get better wireless connectivity around the house with it than I'm receiving from my new Wi-Fi capable Toshiba. Happy? Yes! Good product, Great price, Fast delivery and Terrific functionality. Oh, and my eight year old grandson is happy to have wireless connectivity in his room.",
        "Was supposed to work with Fedora Linux and it is NOT working at all. Does not auto install as was described.",
        "I got this one to replace the one that died on me. It was fairly old. This one was much faster and arrived quickly. It was very easy to install. I was very pleased with it.",
        "When your laptop's built-in wifi card dies, just buy one of these instead of spending over $100 at the shop fixing it. Great backup wifi card.",
        "Did not install properly. DLInk customer services was not one bit helpful. Drivers have not passed Microsoft's scrunity. I cannot recommend this at all.",
        "This product worked out of the box with nearly any linux distribution i threw it at. it even worked on older hardware!",
        "I got this for an older laptop for a visiting guest. It works just fine, doing what it supposed to do for less.",
        "This product works well, easy to connect, and is reliable. My only complaint is that the lights are there for show and don't really do anything. My last one blinked as it received and sent information, kind of like a hard drive light works. I like the durability and style though",
        "Excellent card. Speed is faster than wired. Extended range is a real plus. Easy set up and reliable connections. Recommend highly.",
        "This is a good product. It replaces an earlier card, DWL650+ that had become dated. Though it still worked, it was not able to interface with some of the newer security demands. This is a much faster replacement. It works well with both XP-Professional Linux (both Ubuntu and Puppy).",
        "just the right thing i needed for wifi to make laptop work with out it didn't any internet loved the iteam",
        "Had to return it. Absolutely would not work with Compaq Presario. Some sort of conflict with one of the chipsets. Purchased a NetGear card and it worked like a charm.",
        "Very good card for the money. Works just fine; tested open and WPA. Good enough range. Atheros chipset. Using on OpenSUSE 10.3 Linux with madwifi drivers.",
        "Easy installation. Worked with no probems. Low price. Arrived in about 3 days after I ordered it, in time for a Christmas gift. What more could I ask for ?",
        "Works great with Linux Mint 13 Cinnamon running the ath5k driver. Getting 48 to 53 Mbps on a router that is not D-Link.",
        "In addition to running without any problems under XP, this card is also Linux compatible.",
        "I had originally installed the drivers wrong, but my buddy helped me out and now it works great."
    ]
}