{
    "entity": "Laptop Network Adapters",
    "text": [
        "RESPECTFULLY'' I would like to take the time to correct a response/statement/review...after some difficulty with communication I would like to say how impressed I was to find this sellers willingness to help and accomadate (forgive my spelling)me with fixxing any difficulties I was haveing w/my order..so please forgive my abruptness,forgive my negative review,...ect.they were even kind enough to attempt to call me(I am in the mountains of northern california and cellular service is equally difficult up here)to I believe see what could be done to assist me.as a wounded veteran I respect and am pleased for the efforts.all my best----> 1stLtntKenney E.Sills O-2",
        "Up until now, I have not been able to connect my Garage (for projects)laptop to the internet. This N card works great with my Netgear dual band router. I can now connect with the world, while working on various projects in the garage. Im very pleased with how wll this works for me.",
        "1. Setup was a pain. It's connected to my router, but, got a wrong IP address which seemed to have been known for a while per the website of the manufacturer.(why don't they do something about it!). 2. Technical support is useless. I talked to a couple of folks in Philipines(nothing personal to the country), but, they're just interested in log in collecting my personal information without providing any value-added technical solutions. Typical cheap call center. I felt like talking to a wall and listened to a recorded information. 3. The range and the speed are not good at all!!! 4. I don't recommend at all.",
        "Needed a replacement PCMCIA card for an older laptop, always liked the WPN511's, and found a fantastic price here! Couldn't be more pleased.",
        "Good product. Netgear has problems connecting if you let its software control it. Best to turn off netgears software and let windows control instead. Other than that great product.",
        "just got it today and I bought it because I had windows vista ultimate and it does not work, it doesn't install, so what im going to do is try it on al the editions of windows vista and get back to you, because on the box is says windows 2000,xp,and that's it.not happy at the moment because to me the description seems wrong",
        "I did quite extensive research before decided to purchase this item. Most of my friends/reviews suggested buying from Netgear. I followed the product guide to do the installation. It went very smooth and took less than 10 minutes. It has been up running for almost two months now, very sound product!",
        "I had no problems with the product. Worked great, and was shipped fast. Thanks",
        "I got this card for a cheap price i was apprehensive at first,I need-ant have been, It has performed very well I have had other netgear cards before,They have all served me well,",
        "We use this card to connect to wifi and it is much better than the previous card we had.",
        "Made an old Toshiba laptop worth holding on to..surfs Internet fine and easy to install.",
        "i use this netgear rangeMAX WPN511 wireless pccard on two older laptops. I got this one for a spare it works great.one that I had for a long time stopped working so it is good to have an extra on hand.",
        "This may be a great card, but I have had to reinstall the drivers twice because it would not connect to the web via the Netgear Router. Now I am receiving a message that this is not a digitally registered copy of the drivers, whatever that means. We have two other cards on older Macs from the old \"Airport\" system which are trouble-free compared to this card. Maybe its my computer, but this has not been a favorable experience for me!",
        "Works very well with the Rangemax router. My DLink card kept dropping signal even at close range. This one stays on all the time!",
        "I'm writing this review way after I bought this card. Honestly I don't think anyone would ever need one of these any more. So I will simply say that it worked fine for me when I had it, no complaints.",
        "I just purchased a NETGEAR WPN511 RangeMax Wireless PC Card to replace my Linksys Wireless G card. The setup was easy and offers a great on-screen wizard that runs when the card is in use. The speed and coverage are as advertised - faster speed and broader coverage for my home network. I am happily enjoying downloading and streaming video while sitting my backyard, far away from the router. I highly recommend this card to all laptop users.",
        "This card makes the CPU usage go to and remain at 80% when it's plugged in. Research on the web tells me I'm not alone in this yet there is no known fix. I had problems with Netgear drivers years ago. I just tried the latest driver, months after buying the card (so they've had time to fix bugs) and it didn't change anything. Sluggish performance, constant calling out to DNS (other cards don't so why would this ione need to?) ZERO starts, unusable but not heavy enough to be a doorstop. I will never buy Netgear products again.",
        "Wow, this was a find! I purchased it in July and have had no problems with it. I actually purchased it from another site \"refurb\" and mine is FABULOUS! I am pairing it with an old Netgear WiFi 11b system, and when I was visiting family, they had the D-Link 54g and wow a tri-level home and I had outstanding signal. So I give this a BIG THUMBS UP! I am preparing to purchase either the Next or Mimo router this evening..so wish me luck!",
        "Purchased this for my laptop (it was supposed to match the Rangemax modem). The adapter was not being recognized by my machine, and I contacted customer service. The customer service rep was obviously from India (suprize!). Unfortunately my inquiry was not resolved and I returned the product back. Probably would explore other brands next time around.",
        "I bought this card bundled with the matching router. The router works just fine but I when I tried to use the card in an XP portable (UK Evesham) it produced a massive slowdown in the PCs performance. The CPU utilization went to 100% whenever I plugged the card in. Using SysInternals process monitor showed that 50% of the CPU was being chewed up by Hardware Interrupts, and the rest by deferred procedure calls. So something was very wrong. It may be because there were 2 wireless routers within range, one a LinkSys and the other the NetGear both oeprating on Channel 11. Whatever the reason, it was unusable.",
        "I updated to this product because of the better security (WPA2) and also found that the time it took for my wireless connection to attach was significantely improved.",
        "This company sent me the wrong card but did send me a netgear dvd so I was able to install it and my old card went back to work so I guess the 17.00$ I paid was not in vain but they should be more careful.At least my computer is working and I can write this review,they probly won't like it but it is what it is! Best Regards, Dell",
        "I have had the PC card almost 2 weeks now. The installation was easy and smooth. The card has worked perfectly, and is much more sensitive than my previous card. Previously I had intermittent access to the wireless network I connect to. Now I am permanently (almost) connected to the network. Downloads are also smooth, speedy and easy. I am very pleased with the card. Richard Carr Flagstaff, AZ",
        "very good product works exactly as advertised great range with system would reccomend this to anyone with a laptop very easy to setup"
    ]
}