{
    "entity": "Laptop Network Adapters",
    "text": [
        "I've been using Linux for about 12 yrs now, but I could not get this card to work on RedHat 5.5 or Xubuntu 9.04 Linux. I've downloaded and tried the drivers from Trendnet and Ralink, but received errors with both. I'm going to continue to try to make it work with RedHat 5.5 on an Pent4 machine and hopefully it works soon, or i guess I'm going to have to return it. I don't use MS Windows at home. Right now the error is dpm.o is not formatted correctly.",
        "This is a very reliable network card with good range and supports all the latest and most secure encryption methods. I am using the WPA2-PSK and installation was a breeze. I installed this on a old laptop (Insipiron 1100, 2003 model), which has both Windows XP and uBuntu 9.0.4 and it was quick and easy to install on both the operating systems. Its priced very fair. Im glad I made this purchase.",
        "The product does not work well. It loses connection frequently even when 2 feet from the router. Would not recommend it.",
        "I installed this on an XP laptop. The software that came with it to manage it did not work at all, so I had to uninstall their management software and then use XP to pick up the drivers and manage the card. So, far it works well on a Linksys wireless router...",
        "Installed on an older Dell Window's XP laptop, running Linux Mint Isadora. Started working immediately, no tweaking required.",
        "This card had the worst range I have experienced. I am using it in conjunction with the matching Trendnet Router. I have 4 year old wifi cards that work better then this card.",
        "I was amazed that the Web express slot on my notebook was so small; somehow I thought that the \"Express slot was larger than this; it's actually a little larger than a stick of double mint gum. Slides into the Express slot with a \"click\" and two little lights on the protruding edge wink as a connection is made with your wireless source. So far I think it's really very strong, and reliable...but I've only used it sporadically for 6 days. It was double the price at \"new ovum\", than compared to Amazon's vendor here. I wanted an \"N\" \"Express slot\" and they were the only place I found that had the trendNet...TrendNet's CSRs are very good, too.",
        "The previous version Trendnet TEW card for wireless G worked really well for me. So I was hoping for same experience in upgrading to Trendnet wireless N. But unfortunately this card have stability problem and would often disconnect. Now I've to constantly do a manual disconnect and reconnect to establish network connection. I think it's better that I revert back to the previous Trendnet wireless G.",
        "I am using the card on an older IBM T22 laptop. I have upgraded the bios. However, in comparing this card with a Cisco Aeronet wireless g it is not faster in the N-mode than Cisco in the G-mode. I am using a Belkin Wireless router to a cable net. Perhaps the drivers are not up to date. The transmission speed says 170-230mbs vs cisco 54mbs but...the upload and download speeds measured from Time Warner Cable are less for the N-mode than the G-mode. I don't get it. Maybe noise impairs these speeds, but the bottom line is that is not faster.",
        "Love this for my laptop. replaced a USB wireless connector which was bulky and using precious ports. Install was quick with CD, connection is superb at the max rate, and worth every penny of the $50ish I paid."
    ]
}