{
    "entity": "Laptop Network Adapters",
    "text": [
        "2nd one ive bought. Having trouble installing the drive due to incomplete upgrade from win85 to win98se. Not the wifi adpt. Fault. 1st one works great in another old laptop. I'm sure I'll buy again when I get another dinosaur to resurrect.",
        "I purchased this Linksys WPC54GX4 Wireless-G Notebook Adaptor with SRX 400 to replace a Linksys Wireless-G notebook adapter that broke. It was meant to be! I was having to go into my router more than once a week to update the settings because the router would stop recognizing the old card. No more! The new notebook adaptor is very compatible with my Linksys wireless router. I have no connection problems on any floor of my house. I am pleased.",
        "Had another adapter from Netgear that didn't work very well at all. I felt maybe my laptop was just getting too old and I just couldn't use wirelessly anymore; Gratefully,, Lynksys was easy to install and set up and it works and has been ever since. For a few times I had to re-type the WEP, which was inconvenient and worried that I would have to do that all the time, but after awhile. it stopped and now just works very well. So, I'm very glad I bought it. Not only that the price is great!!!",
        "Was hard to get it setup with the disc and I wish I had known this item was obsolete now because I would not have ordered it",
        "Great product for the money. Unfortunately the one location I planned to use it (across the house) did not work, so I would not say that the range is that much better than on other adapters. I have an older 3com one with retractable antena, which worked a little better. Software is fast and easy. It scans for networks pretty fast, and gives many options to type in WEP keys. It does a good job overall, so I would recommend it for the older laptop that came without wifi.",
        "I was in a rush to replace a worn out unit. After searching through the local retailers, I found Amazon.com had this product for a fraction of the local price. It arrived within a few days and works great. I have learned to regularly check whatever I need at Amazon.com first for price comparisons. Warren Petracek (Denver, CO)",
        "This product has worked for me quite well. I use it on my work computer when I travel for business and use it on my home computer to help communicate with my wireless router throughout my big house. The only beef I have is that if it is not attached to my work computer, I get a bothersome dialog box asking if I want to send a error report when I boot up. That's my only complaint so no 5 stars but I recommend it wholeheartedly even so.",
        "Excellent seller with very fast shipping! Got it for a great price, but would not recommend this product. Got it for our laptop to take on vacation to Florida to keep up with email. No matter where we were we had a difficult time picking up a wireless connection.",
        "I bought this product because I also have the linksys router. It works very well but not expect to have more signal than the one you have if you have another brand of wireless card already, I was expecting that but realise that the signal its the same but the product works great.",
        "This unit has locked up my computer every time it is plugged in. I have to unplug from the 120v and remove the battery. Of course I have discarded the packaging so I an out the return. It started locking up on a game and the last time it locked up when trying to access the net. Seems that no matter what is used it does not like it. I have tried not using the Linksys connection but that does not work either.",
        "I installed a wireless network using the WRT54GX4 and three WPC54GX4 cards in desktop pc using a pci to pcmcia bridge card. I also have a WPS54G print server on my network. All use WPA2 for security. The speed is awe inspiring for a wireless network, as well as the range and coverage. I give LINKSYS an A++ on this one.",
        "This wireless card installed with no problems. I found the range to have improved compared to my previous 6 year old Linksys card. I would have rated this card a 5 but I couldn't get it to work with Windows XP (service pack 3) auto wireless configuration option. I was forced to install the Linksys software to recognize the card. Once installed it worked like a charm. I would definitely purchase for the price.",
        "The unit was easy to install for an old timer with no education and only basic knowledge of electronics. Maybe Less! The performance is great and the construction of the unit seems to be better than the previous unit, which fell apart from repeated removal.",
        "It is a little slow, but that is to be expected with tech this old. It is also for an old tough book running puppy Linux which was not very plug and play. If you are running Linux check your distro before jumping on this card",
        "Bought this for emailing while on vacation. Excellent product the WIFI was down in our hotel. But I was picking up signals from other businesses over a block away.",
        "I got this Linksys WPC54GX4 adapter to replace an adapter that was 6 years old used with my Windows XP laptop. It connects readily and the price was right ... $[...]",
        "Works well. If you use the setup on the supplied cd you may have problems getting it to work. I found that installing the unit into the laptop and letting windows do the installation works. When windows asked for the cd then I inserted the cd but not before.",
        "The card drivers installed without a hitch and I am getting good performance. Great deal for the price. What else can I say?",
        "Nice wireless adapter -- it picks up signal nicely. My second one of this kind -- the first one still works well, but I cracked it (and haven't gotten around to sticking it back together well)",
        "Wanted to return but no luck,so used it ones and it still laing in original box unused.",
        "product received was as advertised, and in great condition. Would buy from this vendor again.",
        "I just installed the Linksys WPC54GX4 Wireless-G adapter in my older (2003)Compaq Presario laptop and linked to my Linksys WRT54GX4 router. It works flawlessly and I am getting 246 mb of speed upstairs and 70 feet away from the router. This adapter and the router exceeded my expectations!",
        "Installed easily, no problems. Works in all rooms of 3 story home. Arrived well packed with instructions and within the time frame as stated. I'm very happy with this wireless adapter.",
        "I'm using it with an older Thinkpad 770z. No issues at all with setup, range and performance are fantastic. Love it!",
        "I loved everything about this purchase...the brand, the price I paid and I always feel good about free shipping! It was delievered on time as stated and I was happy all the way around. Thanks Amazon again!",
        "I've never had a problem with any Linksys product. They are always fully functional at a great price.",
        "This product was a replacement for another wireless card that broke. So far, it has been reliable and the signal has been great.",
        "Saw the other reviews on this product - apparantly it does not last forever but so far, it works quite well.",
        "Very easy to install, well written instructions. Have had no problems with the product. Does what it is supposed to do.",
        "The setup and installation of this Adapter card was seamless and took all of 5 minutes or so in my 2004 Celeron-powered Toshiba laptop, whose own internal wireless adapter burned out for the second time in 4 years. Since i'm using a factory wireless-B router through Embarq that came w/ my DSL, emanating from the back room of the second floor of our brick/hardwood house, i was concerned that i might not get reception throughout our downstairs. There's been absolutely no problems. And the card hibernates and wakes up with the laptop perfectly too. It was a great buy for us.",
        "I found a great price on this item being offered by an Amazon merchant (brand new, factory sealed box) to replace my older Linksys Wireless-G notebook adapter. I did this at the same time that I upgraded my Linksys Wireless-G Router to a Linksys Ultra Range Plus Wireless-N Router. I swapped out the router first, and then the card. It wasn't until I installed the new card that I was able to realize the full power of the new router. So far, very very good.",
        "Being new to the wireless scene, I was a little leary as what to buy. After reading the reviews, I chose the Linksys card. I have not been dissapointed. The card was very simple to install and get up an running. Simply load the software, and plug it in. I appreciated the WPA passkey security settings to compliment my home network. Range is not a problem. As soon as I did a search for available networks, I picked several networks in the neighborhood, some more than several hundred feet away. I would recommend this product.",
        "I'm using Linksys Wireless-G routers with SRX400 with no problems whatsoever, but this particular notebook adapter caused nothing but problems. I could not boot any laptop with it inserted in the adapter slot. If I left it in the adapter slot and booted, the laptop froze. I had no problems inserting and using once the laptop was already started, but who wants to pull out an adapter every time you shutdown? Linksys wasn't much help getting it fixed and at the time I wasn't going to wait for new drivers to come out so I ditched it for the wireless-g USB adapter and have had no problems since.",
        "I love this network card it works great. I think that it is one of the best. Ever since I have used it I have had great internet connection. It is far better than my built in network card. I would recommend this product to anyone with a router or any other type of wireless network in their house. I hope you enjoy this product as I am enjoying it.",
        "I installed it as laid out in the instructions. It worked for 1 week then when I unplugged it and tried to plug it back in my computer would freeze. I shut off the Windows Zero config utility and just run it off of the software, no luck. I tried to uninstall the software and reinstall it but it kept telling me I couldn't because the driver was already installed. I tried to run it off the Windows software, no luck. I even tried to use system restore and go back before I installed it to reinstall the software but got the same message. I quit.",
        "I tested this product in a compaq 2100US laptop. I Compared the reception to a built in Intel PRO/Wireless 2200BG Network connection in a DELL Inspirion 6000. The Linksys card had better range and signal strength than the internal wireless had, but not the advertized 10X faster and 3X farther. It kept the connection at 56K over a longer range but retrieving the web pages over the extended distance was like being on dialup. It was worth the $26.97 price I paid but I would not pay top buck for this product.",
        "I needed a wireless notebook adapter and someone suggested this product. I bought it, installed the software, plugged in the WPC54GX4 in a wifi location, and everything installed and connected without a problem. How often does that happen?!",
        "I bought this product after I look at all the reviews about. I decided to get one for my HP laptop. I pop in the cd to do the step by step process. After that I try to connect to the network and no network was in range. The Linksys Power and Link doesen't light up when it said it was active!! It only blink twice and nothing more. I dislike this product I just waste my money for nothing! =/ I voted for 2 stars because the mailing system is good it shipped within 3 days....",
        "I have not had a single problem with this. Installed by the instructions and it started working first try.",
        "i've used allot of different adapters but this one is got to be the best ever. the Linksys WPC54GX4 work with all routers,but when you pair it up with the Linksys WRT54GX4 router look out, my range increased and i'm getting upwards of 250mb of speed, setup is also a breeze",
        "Purchased this along with a new Linksys WRT54GX4 router (the latest from Linksys). The installation was easy. And most important the combination reached areas in my home that my old router could not even come close to. In fact I can now go to the barn (200ft away) and go on line. This new MIMO technology is great.",
        "This is my first experience with linksys products. Up until now all I could get was dial up. I found it very easy to set up and it works excellent. It is truly long range. I am very pleased with it and wouldn't hesitate to buy linksys products again",
        "My old laptop did not have wireless built in. I bought this item, the price was good and the adapter worked great. It picked up on the surrounding neighbors who had wireless. I am glad I bought this product! No need to buy anything else.",
        "I upgraded from an older, slower Linksys card. This item provided the faster response that was looking for.",
        "When work with WRT54GX4 with SRX400 this adapter ROCKS! Got full bar of signal and 240mps all around the house."
    ]
}