{
    "entity": "Laptop Network Adapters",
    "text": [
        "Could not use it. It did not have enough product information on Amazon description for a lay person to understand. This was for a workstation not for a lay person to attach to a new monitor and start using as her main computer. Had software that had a strange name I didn't know and couldn't use. Windows 10 immediately started updating itself with Microsoft and completely filled the storage memory -- and was not completed! Useless from the get go. I should have noticed it was a 2 gig hard drive but I didn't. Needs more information on the seller's page. It is in a drawer, don't know what to do with it.",
        "The provided software is largely immaterial to the Linux user, only implementing the drivers (in conjunction with ndiswrapper & wpa_supplicant) found in the /Driver/NT/ subdirectory of the supplied CD. This is a good, full-speed performer for pretty-much any Linux-based laptop/notebook, you'd care to throw at it. WPA & WEP are fully-supported, and connections are easy to establish and maintain over relatively long distances between the card and AP. Overall, I am very satified with the operation of this card, and would recommend it for those who have concerns about providing wireless b/g connectivity for Linux-based laptops & notebooks. I would buy another one, were the need to arise.",
        "Bought an old laptop and needed to link to my wireless router. This had great reviews and a better price, I should have spent a little more money. It works fine within 30 or 40 feet but unless you are in the same room the signal drops drastically and dl/ul times increase accordingly. Overall a fine product just look at something else if you want to use your laptop in other parts of your house.",
        "I received it in 2 days from Worldwide in California. And I live in Vermont. It took me a week to find out how to install it on my Dell Inspiron 9300 but it works lika a charm. The instructions can be found at [...] for all wifi makers and models. You have to wade thru a lot of info but this is the most up-to-date site I found. For Ubuntu 9.10 it came down to one command: sudo apt-get install b43-fwcutter Next I will try it on arch linux and add my comments.",
        "My building has free wireless; unfortunately I'm the farthest from the router so my signal is weak. After trying a $50.00 USB N adaptor I talked with a neighbor who uses he connection a lot. He had this adaptor and let me try his. It works better than the more expensive USB N adaptor. So I returned the N to the big box store, saved some cash and have a better connection. It works great and is a pc card, which still leaves me with both of my laptop USB ports available.",
        "This is great for older laptops because lot of them use the older 1.0 USB ports and it struggles to send and receive signals. I prefer this plug and use then USB connection due to it's always better and more reliable, (my own personal opinion). I recommend this product to anyone, especially if you have and older laptop.",
        "Needed this quickly. It got here fast. Was a little concerned because the price was so low, compared to all of the brick and mortar stores. Needn't have spent a second worrying. Perfect condition. Works just as it should.",
        "I ordered two from WorldWide Dist. and boy do they have their act together. I placed my order @ 10am and it shipped via Priority Mail the same day! Plus, the price $16.95 included shipping!! I put one in an OLD IBM Thinkpad 600x running XP, no problems and a lot better signal than the old \"B\" card it replaced.",
        "For some reason, it froze, then will connect to the wireless, but will not go to internet; it did in the beginning. Go figure. Trouble shooting suggests an address conflict with another device on the network. Pain. Don't have the energy to call Linksys and get help.",
        "I have an older laptop that didn't have a wi-fi card installed. I bought this and love it. The set up took only a blink of an eye and I'm up and running. Very reliable and dependable. If you are looking for a wireless adapter I would recommend this one.",
        "Excellent tool for connecting older model computers to the Internet. The only issue is speed, but if you need this type of device your lap-top is too old to be concerned about speed. I was happy to be able to use the computer, finally with a Internet connection!",
        "I don't know why I waited so long to get a wireless card for my notebook. This item works great. I have had no problems. My signal is strong out on the patio, and even upstairs. Makes my old IBM Thinkpad like new!!!! Love it!",
        "After installing my new modem and router, I inserted this card into my laptop. It installed much quicker than expected, which was a pleasant surprise, and it works great. I've never had wireless access before, so I was surprised to see that it picked up several wireless networks around my neighborhood!",
        "I purchased this one to use the \"speedbooster\" feature in mhy router... Could not see any performance change. Also the card takes a LOOONG time to acquire IP address... I would stick with the built-in WIFI.",
        "I purchased this item to give my ageing IBM Thinkpad wi-fi capability. My software-engineer son had no difficulty in installing it on Windows 98 (Second Edition). I have limited experience with using it to date, but it has functioned well at my local library. It is not clear whether all features (such as SpeedBooster) will work with Windows 98, but the basic connectivity appears OK.",
        "This is the earliest (oldest) version of the Linksys WPC54GS Wireless-G adapter. Consequently, the Linksys warranty is void and there is no technical support available. The NEW item that purchased was already out of date and useless BEFORE it was even shipped! The item was useless to me because of unresolved installation problems.",
        "While the product I received turned out to be faulty the seller was very helpful and they were quick to refund my purchase price. I will be doing business with them in the future.",
        "The service and speedy posting of this product was excellent and the card works Great..Just what I needed and at a very nice price..",
        "Works great here in Brooklyn NY, and if you are on the go or need to locate extra wifi spots, this unit is a help with the software provided!",
        "Do not buy this product. You can read the review and know that most of the time this doesn't work. Linksys doesn't provide support. If you want to return, the seller charges restocking fees and shipping charges. I called and the cust rep can't tell how much refund I will get back. I am not spending postage without knowing how much I will get back! I posted review before and it mysteriously disappeared. I filed a complaint to Amazon regarding the integrity of the systen and now I am posting my review AGAIN.",
        "Works great.......easy to install in minutes and all my laptops work fine. Could use a range extender.",
        "I bought this adapter to use on my laptop, which runs both Windows XP and Fedora Core Linux. I was disappointed to discover that the card is only supported under Windows, requiring special drivers that presumably deliver the SpeedBooster functionality. I was really looking for a 802.11G card and figured \"Hmm...SpeedBooster, why not?\" Now I wish I had gone with Linksys' standard WPC54G card instead.",
        "I use this for my old Toshiba laptop. This product was easy to set up using Ubuntu. It didn't work right out of the box, but was able to get working with a simple tweak to the settings on the laptop. I have been using this product with no problems what so ever.",
        "This is an old notebook adapter. I bought this to replace my old one. It gets the job done and is reliable.",
        "I purchased this product to help my laptops computers to connect Wireless to my Internal Netowork, it is excellent. I sure recommended to have it.",
        "If your laptop has a pcmcia slot, but no wireless integrated internet card. This adapter will provide you with wireless internet access. set-up is easy,cost is low, and internet access is good. Linksys support site provides drivers for all versions of this card if needed.",
        "Great product and delivery was as scheduled. Currently using the product on my Dell laptop. Thanks.",
        "Item was sent promptly in good condition. Had to return as son provided one and seller was prompt with refund. Highly recommend and would use again.",
        "Install software...plug in card...it works. What more could you want. Signal reception is good all throughout 2 story house.",
        "It was very simple to install and the speed is great. I am using his card on an older laptop and it's great.",
        "Does not work ith recent routers that are secure, sold by worldcom, you will loose ur money",
        "I use Linksys WPC54GS in my notebook to connect to my WRT54GS router with very good results. It stays connected all the time in the Speedbooster mode. Although the signal strength is not always at the fullest but it never loses a connection. I haven't tried to explore the range of the wireless connection but I don't have a problem staying connected within the boundary of my house and lot. Setup was a breeze. I installed the software, keyed in the security settings from my router, plugged in the adapter and bingo, the notebook was online!",
        "the card works great . some of the previous reviewers are just not computer savy . the card is usually recognized immediately by the computer . if for some reason it does not work then just go to system info and click on device manager and look to see if the driver is installed . if it is not installed it will have a yellow question mark on it . just click on that and reinstall the driver then restart your computer and voila you're connected . computer ignorance should take the blame in the previous reviews that were negative . the product works great . good luck !",
        "I just set up a home network with Linksys BEFCMU10 EtherFast Cable Modem, Linksys WRT54GS Wireless-G Broadband Router with SpeedBooster and this Adapter. The set-up of this Adapter was a little troublesome. My problem was I didn't use a 10-digit WEP password, instead, I used a 8-digit password. I wasn't given any error message, neither I can find any help from the linksys web. Once I changed to 10-digit password. This adapter works very great, fast and makes me very happy.",
        "I'm a novice to the wireless internet. This card with the linksys speedbooster works quite well. I had some trouble setting it up with WEP encryption but linksys support had me up and running within 10 minutes. Tried D-link before, it's complete junk (no wonder they're practically giving it away with rebate). Spend a little more, you'll be happy.",
        "I use this WPC54GS with my Thinkpad T30. Setup was easy with the software they give you. I also bought the WRT54GS router. I have a cable modem so its very fast. I can be online at the kitchen table (with my thinkpad) while the kids are online in the study. Had an issue with setting up when my laptop did not get connected to internet. Just redid the settings and bingo it worked. Pay attention and write down settings while you do the initial router setup. Your adaptor settings must be the same.",
        "Maybe the card was defective, I don't know. The box says it would work with my BEFW11S4 which is 802.11b, but it didn't - I could connect to the unit, but couldn't get to the internet. All my other Linksys stuff has worked great - that's why I bought this. I got a D-Link wireless card and it worked immediately.",
        "I purchased a Linksys WPC54GS after buying a Dlink wireless card that simply did not work with my IBM laptop. The installation procedure on the Linksys was very smooth and intuitive and it worked immediately after installation. The card gets decent wireless reception in all areas of my house (with my Linksys router with SpeedBooster). All-in-all a decent product with good performance. The speed could be a bit better but at least it works!",
        "The Linksys WPC54GS Wireless-G card that we ordered was shipped and received quickly. The installation was fairly easy, directions included with card. Since the setup, the card has enable us to receive/send emails using Comcast DSL while visiting family, the wireless network available at a major chain hotel while on business travel, and at home on a secure Verizon wireless network. It is simple to search for an available wireless network, change between the last used service provider and reconnect if the signal gets dropped. Once home again, it recognizes the need for a secure logon and requests the needed connection information. We highly recommend this product.",
        "I got the wpc54gs after reading the others reviews with the idea that if it does not work i will just return it. i am so glad i got it. this card was easy to install. i had no problems with the card the only setup problem i had was with my was were to put the router. I can use my laptop up to 50 feet away from the router and still have an excellent signal and connection speed. So bedfore you listen to these not so handy, less able people get it try it you will love it. realy if it doesn't work for you wireless my not be the way for you right now.",
        "This is the second one, the first one I got really didn't work. There is not a lot to choose from out there so this is as good as I could find. Does not work as well with the matching modem as i would have thought. The booster is just a gimmick, it didn't really boost anything.",
        "It is just that simple. And fast enough for most uses. If you have an older laptop and need one of these cards there is not a better choice PERIOD!!",
        "CD spun up, couple of clicks, this Linksys card inserted into Dell Latitude C610 without mini pci card, followed instructions, couple more clicks, and online. It performs as expected, range is as expected, no disconnects as yet, using Linksys wireless router also, signal diminishes to 20% at times but bytes still get sent and DSL speed remains constant. It works for me, and was easier than I expected",
        "Not uch to say, works some times, for some reason, I need to go thru a lost before put it to work , every time I use it it changes my IP address",
        "Bought the card to match the Linksys Speedbooster Router, but the card didn't work well enough...My old Orinoco card (802.11b) worked seamlessly with the router also the inbuilt Intel-Pro wireless card (802.11g) worked with the router without a glitch. I tried upgrading the firmware etc as specified by Linksys but it didn't help. Finally I am returning the card.",
        "in my bed at 11 AM!!!! at sencod floor of my house the router is at the first!!! my laptop have a great signal and a good quality, i am using my msn, my outlook and the explorer, for some people this card means troubles acording to the reviews for means freedom!!!!",
        "I was so impressed with my prior experience with Linksys products expecially with WPC54G network adapter that I decided to go a step further and bought WPC54GS network adapter card with speedbooster. Since then it has been a nightmare to make it work with IBM thinkpad. The customer service is total waste of time - very curteous but with no technical help whatsoever. Now instead of getting enhanced performance with speedbooster, the signal strength has dropped almost 75%.",
        "Pound for pound (gram for gram) quite possibly the best laptop card out there. I have had no problems at all with connectivity anywhere in my residence. Ease of usage: Put in CD -> point and click setup -> put card in -> surf the net!",
        "Notebook adapter works well. However, I am not getting the range as advertised. My home is 3600 sqft. Having low signal problems in the kitchen. If you are needing more than 50 ft of wireless range I would definitly go with the new wireless N set up.",
        "I Purchased this card along with the Linksys Access point. The configuration software will not load after installation. The card works only intermittantly. Tech support is useless and responded by telling me to try it in a different computer. So rather than buy an new $1500 laptop to get my $50 card working I dumped it. I was surprised that a company with such a well recognized name could be marketing such a crummy product.",
        "Very easy to install. Directions were explicit and had no problems. Working fine at this time. Used the free shipping from Amazon. Would not do so again. Took too long- 10 days. Would pay the additional price in the future to have it shipped normally.",
        "I have no idea why these people had so many issues. I took it out of the box, plugged it all together, my laptop saw the network and connected to it.",
        "After two weeks of dealing with Linksys Tech Support I was finally told there are no drivers for the WPC54GS and Texas Instruments CardBus Controllers. If you're not sure what controller you have open Device Manager and expand your PCMCIA Adapter.",
        "It works just like it says. I was looking for a wifi card to replace one I broke and got a great deal on this one. So far it seems to be a good product.",
        "Like brand new, received it in the original box, software included. It works like a charm. The price was unbelievably reasonable. WOW.",
        "I bought this item for my father. it is easy to use, and work great. my father love it so much!",
        "Worked like a charm, easy to install didn't use the provided software because we were replacing a B card.",
        "This was easy to set-up and use. It receives the signal from the router in all the rooms in my house.",
        "THE ROUTER CARD DOES NOT WORK, MY OLD ONE WORKS WITH THE NEW ROUTER BUT THE NEW CARD DOES NOT WORK AT ALL, SO I NEED A REFUND FOR IT, OR A REPLACEMENT, THANKS"
    ]
}