{
    "entity": "Tool Bags",
    "text": [
        "I love Veto Pro bags. I own 5 of their products for different things, I bought this bag as my go to for my most common tools (hammer, pliers, screwdrivers. I also can fit my drill in it. It is one of the smaller tool bags but fits quite a bit. Veto Pro has the highest quality bags I have ever come across. They are expensive but will probably last a decade or two, or three, so very worth it!",
        "I had the MC for about two years through my Electrical apprenticeship. Now that I'm a 5th years (final year) I have a lot more tools than I used to so I upgraded to this LC. I was worried it may still be too small but I was very wrong. It's perfectly sized for me. I'm an IBEW Inside Electrician. (Commercial and industrial construction and remodel mostly.) and it fits all my tool plus some extras perfectly with plenty of room to spare.",
        "Bag is made well but pockets are to small and zipper cover should have more play for screw driver handles hard to zip closed they stick out to far",
        "I admit that this bag is relatively expensive, but when you are done with your job and can see all your tools standing up, you can inventory your tools in a flash. I have a specific location for every tool in this bag and always see when I left one out of place and retrieve it or them before I leave the job. There's nothing worse then loosing a tool and having to back track, especially when each tool is 30 to 60 bucks apiece. Highly recommended if you want to see whats in your bag right away.",
        "Awesome bag! I'm giving it a four star because it's not made in the USA. This bag helps me organize and find the tools that I need fast and easy. So far I had it for over a month and wished I knew about this sooner when I got into electrical trade. I usually fumble through my toolbag trying to find the tool that I need, not anymore! So far the best tool bag I've bought yet! Two thumbs up. IBEW LU332",
        "Best tool bag ever, the rest of them would wear out or I would get tired of them. This is so functional I will never get tired of it.",
        "Excellent tool organizer bag. Not too big nor too small to carry with you. It works for me. At first I was skeptical of it quality or the way it was going to feel. Go all my needed hvac tool just for service and all my bigger tools are just in a regular bag.",
        "I've been installing and servicing electronics and communications systems for 15 years. This bag is the best one yet, and I've owned some from department stores, electrical supply houses, and platt. It has detailed storage for small tech drivers, crimpers, etc up to telephone test sets, meters, etc. I have a tendency to really test the zippers some times, and they never fail. As another user said, I think this will one will be fought over when I'm gone.",
        "What can I say. This thing is built like a tank. My problem is I always overload which makes it heavy. Love the bag",
        "My husband asked for this bag to replace his backpack style tool bag. This bag has held up far longer than any of his other tool bags and he's pretty rough on them. We will definitely be purchasing the Pro Pac model again.",
        "Perfet tool bag for any plumber, confortable grip to carry and comfortable shoulder strap as well. Highly recommend it, best tool bag ive owned and ive been a plumber for 30 years.",
        "The Veto Pro Pac LC is the smallest closed top tool bag that Veto offers. I use it for HVAC/refrigeration. This is a really nice toolbag. It carries everything I need. The base is plastic so you can set it in a puddle and it doesn't soak the bag. The pockets force you to keept everything organized. I can quickly check the bag before I leave and confirm that every tools is in its place. This helps me not leave any tools on the jobsite. The zippers are big and heavy duty. My toolbag got stolen once and I bought another one. It's that good.",
        "It works well. It's heavy weighted when filled and heavier than a typical bag when empty.",
        "Very well made tool bag. This bag is good for those who don't want to carry every tool they own, they one's you used all the time. If you want to carry all your tools, go bigger.",
        "This bag is as good as it's reputation and worth the money. It's bigger than I expected- I'm glad I got this rather than the next bigger size. I was on the fence until I saw it in person.",
        "Bag is well built and thought out. It turned out to be a little to tight to comfortable fit my day to day tools and such. One of my coworkers saw it liked it and bought it off of me. I bought the larger bag. It is nice to know the tools I need will be in the bag not in the truck, which is why the extra bulk and weight of the larger bag is worth while.",
        "Great bag for HVAC. The zippers don't always \"mesh\" right, but this doesn't seem to effect the functionality of the bag. I added rubber feet on one end to keep the bag from \"skating\" off of pitched shingles.",
        "My husband was complaining about his tool bag so I did some reviews and decided to surprise him with this one. He loves it! He was able to condense two different bags into just this one and his tools were more organized.",
        "Simply put, This is the best tool bag I have ever owned and I've had a lot. I've been an Refrigeration tech for nearly 20 years and this bag fits more and is more organized than anything I've previously owned. We'll see how it stands the test of time but so far I love it.",
        "I bought this bag, and it really does put all my other tool storage solutions to shame. I like that it keeps everything organized and in view. I can zip it open, roll the panels and snap them down, and put it on my workbench when I'm home - then just zip it up and take it with me if I need to work elsewhere. No more 'two tool sets' problems! Just a note - you can slide a hammer through the large d-rings where the shoulder strap attaches. There are nice touches like this throughout the bag. Very solidly made, it should outlast me.",
        "Our son is a plumber and loves these bags. He says that he has already soaked the bag, but his tools were kept dry. Sounds like a pretty solid testimonial to me!",
        "Boyfriend who is an electrician LOVES this bag - he's the envy of his co-workers on the job site. He is not terribly organized and this bag does it all - not too big either.",
        "This is expensive and a bit on the heavy side but very well built. However it has been a huge time saver for me as I can find my tools quickly and they are organized. If it could build out of durable but lighter materials that would be an improvement.",
        "I have been a automation tech for over 9 years and this is the best single item I've bought for my trade.It will last for years and holds just about anything.All of there products are made well,a great investment for anyone who travels for work.",
        "This tool bag is much better than I expected! The quality of materials and workmanship is top notch, and there are tons of separate pouches for all your gear. I have it completely full of tools, and the wide padded strap makes it easy to carry long distances, without digging into your shoulder. The zippered flaps fold back and snap out of the way, which is great when moving around short distances, and the plastic bottom should last much much longer than the fabric bottom of my last bag. Would highly recommend this product. Thank to VETO for building something like this, finally!!!",
        "Great tool bag-Keeps everything organized Only few months old-no problems with zippers or material.",
        "I am the Facility Director for a large health club I need to be able to take a variety of tools with me all the time.. This bag is the best Ive seen in 30 plus years in the maintenence field.... Get one you wont regret it",
        "This bag is great for the HVAC Tech. It is durable. It is on the heavy side so I would get the bag that will fit your tools, buy a to big of bag and your bag may be to heavy. This bag is just the right size for what I do.",
        "I have been using the bag for about 2 months and its Great. The tools stay put when the sides are closed up even if the bag is dropped. The handle is nicely cushioned with rubber and the shoulder strap doesn't dig.",
        "Very high quality. Is use as a mechanics bag for service calls at a production facility.",
        "LOVE this bag as it shuts and tools stay put!",
        "I've own a lot of tool bags in my career. The Veto is by far the best I've ever owned. The LC is the prefect size for my needs with out overloading me down by weight and is very ergonomic. Everything is right there right where I can see it ever time, and the design prevents all your tools from getting mixed up if it takes a roll in the work van. Very good construction.",
        "ThiS bag takes every bit of punishment I put it through everyday. Tools are easily accessible and the hard PVC base keeps it upright. Nice bag defiantly worth the price considering I was spending $50 + a year on junk tool bags. A+ to river connection for customer service!!",
        "I have purchased many of the Veto PRO PAC XL and LC toolbars over the years for my service technicians and I. We work in the dental industry and service and install dental equipment. In working in a 'professional' environment, our service technicians must maintain a professional appearance and our toolbars must reflect this as well. Our Veto bags make us better technicians!",
        "The two largest zippers broke.now it stays open all the time.",
        "This is a quality tool bag, no doubt about it. The product description was exact.",
        "this piece is off the hook! the best tool bag i owned in ten years of my HVAC career. If You like to be organized and dislike losing tools (this one damn nearly tells You whats missing in it lol) You have to get it and i guarantee You will love it.",
        "My husband said this is the perfect work tool bag.",
        "nice bag but kind of small for my needs. hammer won't fit inside. plus too pricey for being made in China",
        "Recommended by a technical friend - this bag works great and is indestructible!",
        "This bag is the best thing I have purchased in a long time that I have been totally satisfied with. This is my second veto pro pac purchase and it won't be my last. These tool bags are the toughest on the market.",
        "Excellent shipping, great bag. Bag has a lot of pockets of different sizes. The fold down zippered doors allow for easy identification and removal of tools. Great buy.",
        "Great Tool Bag. Got my first one ripped off, had to get another. Although its a little too big for my needs I'll never carry anything else (unless they make one 3/4 size).",
        "By trade I am a marine mechanic, I don't believe that this bag was actually designed for mechanic use ....but it works great very well made. I am able to get all the wrenches, screwdrivers, rachets and cordless driver into bag with room left over. I was hesitant to spend the extra money on this bag but after getting it and using it, it is well worth the money.",
        "good quality, I have never had a toolbag this good and well designed",
        "This bag is great, I love it. It's very convenient, just what a Tradesmen needs.",
        "Great tool bag. Professional plumber for over 30 years, best bag for service work. Very durable. This is my 3rd bag. I pass down my old bags to my guys.",
        "This is an excellent tool bag, it carries a lot more stuff than my tool pouches and is well worth the price.",
        "awesome bag...lots of compartments for everything...real heavy duty...will last a long time...also bought one for my father in law...he went thru 3 tool bags last year and he's loving the quality and durability",
        "The Veto bag has been very helpful. It is able to hold all the tools I need for my job in a well organized manner. It also zips closed to contain everything within to avoid spilling and also out of the weather. I would suggest the Veto bag to everyone needing a well built and organized tool bag.",
        "This is my 3rd one!!!!!!!!! They keep getting stolen so they must be good. I can't go to work without it.",
        "Item arrived on time & as advertised... extremely well constructed... all the storage room I could need... should provide years of tough service...",
        "Greatest tool bag that I have ever used period. Only exception zippers always fail at the top angle corner of the flap on the bag. I would pay more for a quality brass zipper, that would stand the test of time. Always lube mine with a dab of candle wax. TT.",
        "This bag is an outstanding product! Even better than I expected. Not cheap ...but will last forever. Gobs of pockets! If you like being organized, this bag is for you. I even made a few extra pockets by super gluing some partitions to the ones behind them.",
        "Awesome bag. Well constructed and durable. Exactly what I needed to keep my tools organized and its easy to carry with me at work.",
        "We have been using these tool bags for 8yrs. in my business and they are the most durable I have used in my 38yrs. as an appliance tech.",
        "2nd bag i've bought. first lasted 10 years and i only replaced because the zippers broke. this one came from china, so not sure yet of the quality, but seems the same.",
        "This tool bag is well made with heavy duty zippers and lots of pockets inside. I do wish the interior was a little taller so you could fit longer tools inside. Also, the outside pockets are pretty small.",
        "Been using it for a year, everyday and holds up well.",
        "My partner loves this bag; he can carry the most frequently need tools easily and in an organized manner. The bag is strong and well designed.",
        "Very well constructed.A lot of room for tools that I need to make my repairs. I was very impressed to see how this worked out for me. I would consider these before any other bag out there. I may purchase the larger one in the future.",
        "I have two of them the zippers lasted a few years..... Cost two much to get them fix.",
        "The bag is tough and versatile. I'm sure it will long outlast all the other tool bags that have came and gone before it.",
        "Awesome bag, best investment in tools I've made. Keeps your tools well organized vs any other bag that just turns into a pile of tools you have to sift through to find anything. This is the third one I've purchased; first two got ripped off, one last year and once this year. Locking your van helps with that...",
        "Great bag for any mechanic that needs to carry tools were ever they go. Theifs like them also. Needs tracking device option.",
        "This is an excellent bag. It is very well constructed and I greatly enjoy the strap that it comes with.",
        "I do like my tool bag in which I can fit and organized some of my tools that I use everyday.",
        "Veto Pro Pac's used to be great when they were made in the USA. Still a decent bag, although the zippers tend to blow out on them.",
        "Excellent everything needed, wanted, and using for. The many tools routinely use fit within and is easily toted out and about. Thank you",
        "I absolutely love this bag. At first I thought it was stupid to spend so much on a tool bag. But it's worth every penny. I can never go back to using another bag.",
        "The tool bag is nice but I felt it was over rated for the function. Mainly used it for onsite repairs of networks and telephone systems but found that although it was a nice looking, strong built bag, it was difficult to find my tools in the shadows of the zipper pull down. I also didn't like the way it carried, it felt unbalanced. I switched back to a cheap $25 dollar aluminum case from HD which I have to replace every year because they fall apart.",
        "Amazon gave me a refund, so not upset with Amazon. The manufacturer website falsely advertised American made products. This bag was made in China.",
        "I chose this item hoping to solve the organization issue with tool bags thinking this was the answer. After loading all the compartments with my tools, what I found is that the bag is too heavy for a service related tool bag as it can weigh as much as 80 lbs when fully loaded. I also found with the two side entry system and all things being symmetrical, that I had great difficulty deciding which side of the bag which tool was on. Now granted it may be my inability to organize in general, but I think this bag has great intentions, but falls short of the mark."
    ]
}