{
    "entity": "Tool Bags",
    "text": [
        "I am extremely happy with this bag. I use it for various tools but mainly screw drivers and pliers. I do wish the interior pocket had some dividers but with it being open I am allowed to store larger tools. Over all the bag is well made and well worth the money. I have had the bag for a few moths now and have abused it pretty well. Other then needing a bath it is holding up very well. Don't forget to hit the helpful button.",
        "I am a plumber, and I find this to be the perfect bag. The 2 exterior pockets keep all of my hand tools from small to large, easily accessable and organized. The main interior compartment holds my bulkier items and has enough room for my hacksaw and 18\" level. I sprayed this with multiple coats of Kiwi heavy water repellent and while not waterproof, it does stay dry in light showers. Any prolonged exposure to heavier rain, and water will seep through. I carry a hair over 60 lbs of gear in this bag on a daily basis, and have used it for 3 months now with no signs of wear. I would buy it again!",
        "This thing is huge. In a way that is the worse thing about it. I loaded it with electricians tools and have room to spare. I love the way I can zip it up and the tools are protected from falling out or getting dusty. Yet, when unzipped, they are easy to see and retrieve. Both sides have the zipper cover and both sides have multiple pockets. This was not real clear to me in the description. Lots of room in the middle for multimeter, wire nuts, wire staples, and the like. For me a little smaller version of this would be perfect.",
        "One month after purchase, the bag split at the zipper seam. I am not a person who overloads their bag because I am constantly carrying it and a heavy bag is a no go for me. Very disappointing. Ended up buying a Veto pro pac.",
        "Best bag I've ever owned. I was searching for a bag that offered everything the Klein bag offered except for the price. This one fits the bill and if I ever get my hands on the Klein version, I will make a comparison review. This bag has pockets for EVERYTHING. I also have a set of red 12 volt cordless tools and I can fit the jigsaw, hackzall, the impact and the drill gun inside it at once. It is phenomenal so far. If there's any complaint, I will recommend upgrading the shoulder strap because the one supplied gave out rather quickly. I replaced it with a padded golf strap that works very well as a replacement.",
        "Bought this for work because I wanted to try tool bags instead of my usual toolboxes. So far I’m impressed with the rigidity of this bag, the overall space, and the organization. As a specific kind of electrician I’m required to carry a plethora of wrenches, screwdrivers, general tools, and standard-also-specific electrician tools; this bag has enough space for all that and then-some. After only a few months the bag has held up well to the extreme test of the elements and the weight of the tools putting stress on the stitching. Will post a future failure edit to this review when or if this bag decides to break down.",
        "I have been through quite a few tool bags trying to find the right size and combination to fit my tools. This one is by far the best. Very easy access to the side pouches that can store an incredible amount of hand tools, large and small. The centre is big enough for a drill, charger, other hardware, parts and cleaning materials. My fully loaded bag is about 40 lbs, though the shoulder strap itself and the hooks on the bag handle the weight fine, the hooks on the ends of the strap not so much. I replaced them with carabiner clips. Highly recommend this bag!",
        "I loaded mine up with electrician's tools. Nice organization, plenty of storage capacity. All my primary tools on one side, secondary tools on the other. Middle storage is a first for me; no more dangling tool pouches, hammers or fish tapes. I wouldn't load it up with anvils, bricks or steel, seems to be middle heavy weight; perfect for handyman or electrician. My old open top tool bags would roll around the trunk and spill my tools out. I like the closed sides, no more tool spills, weather resistant too. Shoulder strap seems a little light. Carry handles sufficiently strong. My first CLC product. So far so good.",
        "It's sturdy and seems it will last a while, but the handles and shoulder strap are very annoying. There's no stiffness in the handles, so when it is loaded up, it squeezes the fingers when picked up. The shoulder star is worse because the clips on the end are not designed well and fall off at a touch while the trap itself is far too short. While it is durable, I'm not sure I'm going to keep it for long since I have such a hard time actually carrying it.",
        "The bag was not in very good condition, the strap (the main selling point for me) doesn't work at all. One of the connectors was broken right from the start.",
        "Thought this was going to be a great tool bag. Was I ever wrong! I put open end box end wrenches, pliers on one side and screwdrivers & nut drivers on the other side. Wrenches are not big ones so the bag is not overloaded. The bag will not stand up when set down on a flat level surface. It just sort of collapses & falls over plus the individual pouches that tools are placed in just sag down. Very unhappy with this bag or maybe I expect too much since I previously had a Veto Propak. Should of bought another Veto!",
        "This is a nice bag, made of thick material that should last a long time. I will update my review if it fails prematurely. It's large enough that you can fit an impact/drill combo in the center pocket with a couple extra batteries and a charger no problem. The side pockets are well laid out and big enough to hold an assortment of tools, while also providing smaller pockets for things like pens or center punches. I'm really happy with this bag for the price.",
        "i really like the pockets on the two outer zipper pouches. i have all of my hand tools organized in the pockets where i can find them and only the big stuff (drill, impact, drill bits, battery charger ETC,) inside the center compartment. It does get heavy mine loaded with tools only is close to 40 Lbs. it is also wider than me and hits things that i can squeeze past easily when carrying the bag using shoulder strap. all in all i am happy with the purchase it just needs wheels...",
        "This bag has tons of organized storage. CLC bags are always made decently and this one is no different. The only draw back is that both sides of the bag open and fold out. Im an electrician and use a cart to move around my tools and material, so it does take up a bit of real estate on top of the cart. I just ended up putting my most frequently used tools on one side. When its all zipped up it is a few inches more narrow then the big CLC bag the next size up with the metal carrying handle. I like it so far. Approaching 5-stars for me. Nice bag and almost perfect.",
        "Like: The bag does have many pockets to fit in most of the tools and keeps in place. Dislike: Comparing to my other bag 22\" big mouth bag This bag feels smaller and fit more tools than this new bag. The middle big pocket is small and deep which hard to find, had to pull several tools to see the bottom of the bag. But the sides for the pockets are great! I'll use this bag for small projects.",
        "I have no doubt the clips on the shoulder strap will fail and zippers misalign daily. Don't even trust the strap while walking across the room. 2 months in, clips on shoulder strap have sprung and will not stay closed so strap falls off every time it is set down.",
        "this tool bag works great. has enough pockets on both sides and frees up the main compartment for larger tools or drills. I compared this bag to the husky 18in large mouth and the 18in total tool tech and this clc has better tool storage. I also like the size and shape of this bag better then then husky. The husky bags were stiff making them bulky and does not conform to your tools. The clc is slightly thinner and more flexible which allows you to pack your tools and and the bag conforms to your tools.",
        "My husband LOVES this item so much! He works in construction and this thing is packed to the gills! No joke, it's so heavy I can barely lift it, and he carries it with him all over, and has access to everything he needs. He's told me at least a dozen times how much he loves it and how glad he is that I bought it for him (birthday gift). He's had it 2 months now, and it seems it's holding up quite well, with everyday heavy use. Highly recommend!",
        "Versatility beyond compare. I love all of the easy to use dividers in this bag. Both large front openings are LOADED with individual tool compartments. It has really helped me organize my work tools. The large compartment is great for my drill and a few boxes of screws and a few other tools that came in small cases. I have not had this but a couple of months, but it seems like it is built very well and should hold up to work day use very well. It shipped fast as I have come to expect from Amazon.",
        "This is, overall, a well made bag. The bag itself is sturdy and thoughtfully laid out with enough pockets of enough different sizes to suit a variety of needs and uses. I keep one side pouch stocked with basic hand tools and the other stocked with test equipment. The large middle compartment can hold a lot of gear. A lot. This is a big, big bag. I detracted a star because of the strap. The clasps on either end wore in about a month of use and would come off the metal loops when the bag was lifted. I fixed the problem with JB Weld because I don't see myself removing the strap.",
        "I returned this and I don't remember why. I remember getting it, observing that it was missing or lacking some key feature that I wanted, and immediately repacking and returning it. Damned if I recall what that feature was. Don't get old, kids.",
        "Well made. I use this to organize all my short handle garden tools, bonsai tools, fold up saw, pruning shears. Lots of compartments to hold tools. Absolutely love the two front sides. You can easily get access to various tools nicely organized. Love the front and side pockets for shears and garden gloves. I even put a Japanese medium size pruning shears in the center compartment. The back can also hold small tool for quick easy access. I got a fold up dolly to use with this so I can effortlessly wheel all my tools to where I need without making trips to the garage to change tools when I trim the flowers, shaping a few trees. Love this!!!",
        "This is a great tool bag for me. It is right at the maximum for what I can carry in one hand. I’ve stuffed it to the gills. If you are a pro, you are going to want several different bags, both for weight management and organization. If you are just an amateur handyman, this one bag is big enough to cover all of the basics. Smaller bags will leave you wanting more room. The sides flop open to leave easy access to the tools once you are working.",
        "Eats tools for breakfast. So many in fact that weight can be a problem. Fully loaded best use may be storing and organizing tools in the shop or vheicle. Design makes it easy to see the tools so you don't have to dig to find what you need saving time and frustration. For something smaller to haul tools from the truck to the work check out the CLC 1537 tool carrier.",
        "Exactly as advertised, and as prior reviews recommended. No surprises here, mine was identical to that shown except for the lack of the carabiner (not sure what I'd use it for anyhow). This is listed as weighing 6 lb. Filled with all my tools it comes to 26 lb total. Rather weighty, but mine is limited to at home use. I would by this again in a heartbeat. In fact, if I were younger (retired) I could envision owning two of these.",
        "I bought this bag to replace the similar Dewalt model. It's similarly priced, but that's where the similarities end. It's built out of tougher nylon, for starters, with beefier clips and grommets for the shoulder strap. The side pockets carry more hand tools than some local hardware stores, and the center has room for at least a drill, driver, oscilalting tool (and batteries and charger for all for those), hammer, crowbar- and has room for more than that. The only downside I'm finding-and this is a reach, really- is that it's very easy to pack it so full of tools that it becomes really, really heavy; but that's more my fault than the bag's.",
        "I have had the same bag for over 14 years. Used every day in construction. It just started to wear our on the bottom and tools were falling out. So I searched everywhere to find the same one. It holds all my hand tools. It has two sides which open. One side I keep screwdrivers and nut drivers other side pliers and wrenches. Middle section I keep bigger items such as hammers and multi meter.",
        "I love this tool bag its built tough and strong and looks great. I am very impressed with the quality and amount of room and compartments it has. I can fit all my tools from my hammer, 16 inch winding rods, sockets, screwdrivers literally everything I need to complete my job. I am a garage door technican and it suites my needs and has made me more efficent with the big access zipper pouch its very easy to find what you need. I've used other bags and used a bucket pouch for years I loved but this bag takes the cake.",
        "Use it everyday. Excellent organization. I have a lot of bags/tool boxes and this is hands down the best if you have a lot of hand tools. So many pockets within the zippered pockets so they will not fall out. Sturdy bag, have had it for over a year now...no tears, no holes, no broken zippers, no problems other then mine weighs like 60 pounds and the little clips that hold the strap broke almost immediately. Easily fixed with 2 carabiners. Don't really use the strap anyway unless I'm carrying a bunch of stuff a long distance. I can't recommend this bag enough. That said, don't overfill it, which is easy to do.",
        "Good amount of pockets, seems well built. Would give it 5 stars, but like another reviewer mentioned it could be improved with interior pockets in the large compartment instead of everything in there loose. Even a couple of straps with snaps to keep drills and other tools snug inside would be helpful. Still a great bag!",
        "High quality, pockets galore. I'm a union Electrician I take pride in my tools this bag will have you organized and looking professional,no more rummaging through your bag or dumping them on the floor to find what you are looking for. I love this bag, it would be perfect if they added a LED light for the center compartment so you can see what you are looking for in dim environments ,l solved that buy purchasing a five dollar led light.",
        "Large bag with lots of pockets. My first one lasted several years. Stores my electrical tools where they are easy to find. Strap is strong and comfortable. Zippers are smooth and work well. Being a large bag means it holds a lot of weight, and all of the seems and materials hold up well for a long time.",
        "Bought this bag a few weeks for finish carpentry type tools and I love it. The perfect bag is like reaching a point in life that I will have enough tools, it may never happen. This bag is darned to close to perfect though! A few of my carpenter buddies are now buying these bags after they got to play with mine... Highly recommend!",
        "The bags are great I’ve had several over the years and typically wear them out no complaints on that but the straps and the buckles or junk the last when I ordered the buckle actually failed within a week or just getting cheaper and cheaper for the quality of the bag they need to improve the buckles",
        "Very well made with many pockets of various sizes for an array of tools and other things. I like the giant pocket in the middle, it's perfect for my drills and larger items. With all my tools in it, the bag weighs around 45lbs but I got everything I need in there.",
        "Really like the product. I’m an electrician that does mainly residential work. I use one side for my main hand tools and the other side to hold tools for services, pvc, and larger tools. In the middle I have enough space for drills, chargers, saws, rotosplit and more. Solid bag and have really enjoyed it. My only thing is that there is no tape holder so I ended up cutting mine off an only one and used electrical tape to tape it to a part on the bag. It’s held up so far and completes the bag for me",
        "I did a bit of research when choosing this bag. It seemed everything was either overly expensive, poorly constructed or too big to e mobile. I am very pleased with this bag though. Granted I haven't put it through its paces yet what I can say it... Pros: * Bigger than I expected. Not so big as to be difficult to handle but plenty of space with lots of pockets and organizers. * I love the straps that keep the zippered outer panels from completely falling down. * Seems super well made and heavy duty with strong rivets, seams, and shoulder strap. Cons: Non yet.",
        "I bought this for my boyfriend and he absolutely loves it. It had more compartments than he realized. He fills it with almost every tool he has and it has held up. I highly recommend this for anyone looking for a durable tool bag. Many spots for different tools. Highly highly recommend.",
        "AMAZING!!! I got this for my boyfriend because his previous tool bag was a complete disaster. He used to just throw everything into the bag. finding anything was a mission and sticking your hand into the bag was like russian roulette. I never have to hear \"can you find this?\" anymore because all of the pockets help him stay organized and actually find things. the bag is really sturdy and the zippers are strong. the material is very durable and the shoulder strap is a bonus.",
        "The bag is as expected and a quality tool bag. The problem is all of the extras that came with it . I know I was only supposed to get two cockroaches with the bag and I got several more than that. I also got a tick included with it. I'm not sure if it was because of some special promotion that the tick was included. If your having a problem with the insects in your facility you might give me a call and I can give you the name of my exterminator.",
        "This bag wasn't suited for me, it's way to big for typical construction. I'm a union electrician, this bag fit all my tools and room for more. Considering I lock it up on the job in a shop provided gang/lock box, it take up too much space and the other electricians always ask whos gang box. If your on a jod where you need a bag for lots of tools, this it for you. I would say you can fit almost everything in it. If your a carpenter, the levels will not fit 😁",
        "best bag I ever had, use it all day everyday many many times a day. sturdy and lots and lots of space. the middle area works perfect for the random things that wont go in pockets like tapes and gloves and drills and bits ect. I would highly reccommend this bag. HOWEVER it is a larger hand bag and I often have to use the shoulder strap due to its heft when packed. this however is not a negative as I just have lots of stuff to carry for my (HVAC) job. the space in it minimalizes the trips i have to make to the truck. best money i have spent on amazon in a while",
        "Excellent tool bag, I have one that has been used in commercial construction for over a year and is holding together well and all the zippers still feel perfect. The handles alone are great for carrying it but the added shoulder strap makes carrying a bag full of heavy tool much much easier.",
        "High quality product. Sturdy built and heavy material. Way too heavy for me to carry once I added my tools. Definitely not built for a woman to use without putting it on a box with wheels Would be nice on a big Craftsman toolbox set but difficult to manage as a stand-alone",
        "This is a GREAT BAG!, it's a BIG BAG! The functionality and quality you get for the money is pretty nice. Quality products without people and since CLC is a common brand with the guys I work with the longevity of their bags is well known to me. Unfortunately this bag was just too big for my needs.....I ended up buying the smaller 1537 model which is still very roomy for what I need. Certainly easier to sling over the shoulder when necessary...even so, I still had to talk myself into sending it back Some photos for a size comparison if they upload",
        "Misleading advertising... I use lots of really small stuff, bits, screwdrivers, pencils, etc. the website shows rows of small pockets along the front of both sides of bag; perfect I thought. When I unzipped it there were none. Not one. Now I have to just throw them in a big pocket and root for them every time. Less than impressed by far...",
        "This is a awesome tool bag for the person that needs to carry lots of tools. I was surprised to the amount of different items that will fit in this bag. You will not be disappointed! The quality and thought out design is great.",
        "I think this is an excellent bag and considering the cost, it's a great value. Except for the plastic clips holding the shoulder strap the bag is heavy duty. It looks and feels very durable. I've got several CLC bags and they're all very sturdy. These aren't lightweight bags and once a collection of tools is added they're fairly heavy. But I doubt a lighter duty bag would hold up well over time. One addition that I found helpful was to add a piece of thin plywood (1/8 or 1/4) inside the bag on the bottom of the main compartment. It creates a flat bottom and adds a bit of protection from below.",
        "Very durable, lots of pockets. Holds a ton. I use it for all of my electrical stuff. The outside sections have tons of different sized pockets. One side I se for tools the other side used for tape, pens/pencils, zip ties, screws etc. The middle section can hold a bunch and I use it for switches, sockets, gang boxes, etc. This is my favorite tool bag.",
        "I bought this to consolidate the tools we carry for our travel trailer. This replaced a simple bag I was constantly emptying to find the tool I needed. This review is just my initial assessment, I like how the bag packed up and the organization provided.",
        "This bag could carry the world. There are many compartments to separate your tools and equipment by jobs so you you're not digging to the bottom like a dog looking for a bone. Very good quality materials used in its construction. Heavy duty comes to mind. I received many compliments from several tradesmen. Of course I told them where I got it.",
        "I bought this when I outgrew my first bag (the one that lasted through my 20s, before I was a homeowner). I really only needed 50% more space; this is probably 100% more but the intermediate bags didn't zip shut or offer the multitude of useful pockets. PRO: durable, lots of pockets for organizing, everything zips shut (I REALLY like this; no chance a tool will spill out, snag on something, or go missing). CON: big, heavy. When 75% loaded I can barely lug it around the house. Wouldn't want to carry it on my shoulder more than 25 feet. Even empty it's a large, heavy bag. I wish they offered the same features in a smaller size.",
        "I am a professional handyman with over 20 years and construction so I have a wide variety of tools specializing in all trades this is the first tool bag that I was actually able to fit all of my tools in and not have it be overcrowded I actually had the inside compartment available for larger things such as my drill this is very well made and I love the fact that it has the elastic straps on the side I was able to put my Carpenters hammer, a large level, and my pry bar all in the side elastic straps it has many pockets for your drill bits as well",
        "This bag is big and heavy. I can put almost every till I own in it. I was trying to replace one of those back-pack bags that the zipper broke on. So i just wanted an open top bags that the zipper wouldn't get messed up, so i jyst put the same amount of tools in this bag that could hold three back-packs of tools.",
        "The bag itself is awesome. I'm an aircraft mechanic so I'm always going out on the tarmac to different aircraft. The bag fits everything I need and more, plus I can take it with me on-board the planes. The worst part of this bag is the strap, primarily the clips. The shoulder strap is nice and padded, but the clips themselves are so cheaply made, there isn't enough metal to keep them from popping off all the time. I needed to get a different strap that was more heavy duty. If it wasn't for that, it'd be Five Stars.",
        "Fits in the gangbox perfectly, which is why I am very happy with the bag. Under the bag in this picture is my tool belt so i only take up a little space in the box. The bag is narrow but deep. In the middle, main compartment I have an impact gun, drywall gun, router, charger, 4 batteries, line laser( in the case), a DX35, 3 way, my extra hammer and knee pads. There are tons of pockets on the sides but I dont have too much in them. If you filled all the pockets with small hand tools you could easily make this bag way over 100 pounds. I just have clamps, markers, pencils, gloves. Stuff like that.",
        "My only complaint is the strap clips are weak. Large bag holds quite a bit and then some. Can get really heavy and stretch clips for stap till they break. Easy fix to add some higher strength carabineer clips. Otherwise extremely well built.",
        "This is a great bag. It is big enough to hole everything and small enough to carry in my large saddlebag. It is very versatile. The middle space is open so I can throw anything in there. I have had drills, pneumatic nailers and hoses, parts boxes, cords, caulk guns, I can put another tool belt inside this bag for things I want on my belt. The outside pockets are great for seeing the tools. When you open up both sides it is laying wide open. All tools visible and organized. I love this thing. It feels tough as well.",
        "This is really a well designed bag. I use it as a ditty bag for film production. It has a really large interior that opens up like a massive cavern and the sides fall down to reveal a plethora of little pockets - very useful for carrying my tools. So far its been holding up to some proper punishment over the last few months",
        "I looked and looked without being able to make my mind with all those tool bags. I choose a great one. One would be hard press to find a bag that size that will hold all those tools. Good material. Well thought out. Buy , you will have no regrets.",
        "What I like the most is tool bag that has mani compartments, and that help me to keep the tools separated and well organized. I also like the size of each compartment they are not to small or to big. Also I like the size of the whole tool bag, because it fit perfectly inside of one of the drawer of my tool box. I use that tool bag to carry the tools that I need the most especialy when I have to work on the second floor, because I can’t role up my tool box thru the stairway, I like the design, the color andI like the design, the color and the quality on how it’s made.",
        "100% great tool bag – big enough to hold sockets, wrenches, screwdrivers, pliers and all of the basics. The construction appears to be very good - excellent small compartments and the zippers appear to be high quality - the bag is not too big so that when it is full it is not too heavy - comfortable carry handles. I highly recommend this tool bag and the price is very good.",
        "Seems well made. Tough material. Stores enough tools to be too heavy to carry very far. I'm glad to have it. Should take organization to the next level for me. I may be in 2 or 3 different places in one day.",
        "if you use the center pocket for loose tools you will be dumping this bag often. There is space for tool in the side areas but usually they all end up in the center eventually. Quality of the bag was very good on the one I received so no complaints there",
        "This bag is perfect for my set of basic tools. I worked in a marine boat yard as a mechanic and this bag easily held everything I needed on a daily basis. It can actually hold so much that it can get quite heavy but the bag can handle it easily. All the side pockets are perfect for pliers, ratchets etc. and the interior holds my drill and other larger items. The only issue I have is that the inside compartment has no pockets or separators so while it holds a lot it gets kind of messy. I've had this bag now for over two years and it's still holding up strong. Highly recommended",
        "I love it! I put all my tools that I use around the house for minor repairs in it (ends up weighing 37 pounds, LOL) and now have everything I need when working on a project without having to run out to my tool chest in the garage.",
        "Buyer beware! You may want to buy the next smallest one, which Amazon also sells. Once I got tools loaded, bag weight was extreme. Quality and construction is Supreme.",
        "I bought this for my husband a couple years ago for Christmas. He carried everything in it, his drills, screwdrivers, wrenches, etc... everything. When he stopped working to go back to school last year, he sold it along with his tools to his brother, but now he is begging for another one! This is the sturdiest tool bag I have ever seen -- it is tossed around daily, weighed down by a TON of tools and it is still holding solid! I am gonna be purchasing another one today for my husband's birthday. :D",
        "Tough as nails. Only bad thing is the shoulder strap. The clips to bag bend easily and causes the strap to fall off. Bend them in some with pliers and they stay put. If you do HVAC servicing this will hold 90% of what you need easily. Or 110% of what you need as an installer.",
        "Love the side pockets for easy tool storage and organization. Nice deep pockets. Interior of bag is not cluttered with extra pockets that make it hard to remove and place wrench and screwdriver holders. Easy to load but can get heavy.",
        "Im an Electrician and the layout of this bag was perfect. The side compartments are well suited for the tools I use while the center bag holds my lager tools, tool pouch and pouches for tips comfortably. This bag is professional in its appearance and practical in its design. Best bag/toolbox in my 20 years as a tradesman.",
        "Tried many tool bags over the years, for my application a field service technician, it does the job pretty well. PRO's: Lots of slots to hold hand tools, center compartment large for hammers, sawzall and channel locks, exterior zipper pocket and other open quick access pockets are great. Heavy duty construction can the job-site abuse. CON's: Not the bag's fault, but since the bag is large, it's easy to overload and can get heavy.",
        "This is hands down the best tool bag available. Everything is perfectly compartmentalized for everything you would keep in a standard toolbox. The pockets keep everything neatly organized and makes finding tools quick and easy. The side pockets are tall enough for 12\" slip-joint pliers. The large center compartment is great for larger hand tools and power tools. Construction is very durable. The only thing it lacks is small part storage, but that is easily remedied by getting a couple of small plastic parts boxes which fit great in the center pocket.",
        "Good bag. Well made and well designed. Only reason not 5 stars is mine was shipped without the shoulder strap and due to Amazon’s system I can’t seem to ask for a shoulder strap without returning the whole bag. But the bag is good enough I don’t want to wait for a replacement.",
        "It is way too big and I love it! Loaded up as I keep it the bag is far too heavy to carry around the city, but the organization is excellent and I drive a good amount of the time so it is usually in the trunk. This is now my mobile tool set, if I will be walking around I grab the essentials and toss them in a go bag. The material can take a beating with no tears so far, the handles are very strong, the pockets are endless, I am just very happy with this purchase. My intern is less happy when he has to carry it but I am willing to make that sacrifice.",
        "I purchased this tool bag to keep on my RV. It has worked out perfectly and allows me to keep ALL of my most used tools and meters handy in one convenient and portable location. Although I have only had it a short time, it appears to be holding up quite well. The heavy duty stitching in key stress areas makes me believe that I will be using this tool bag for many years to come. I also love the multiple storage areas on both sides of the bag and the large interior area is perfect for storing my drill and larger accessories. I highly recommend it!",
        "It lives in the trunk of my car and works much better than the Klein Tradesman Pro bag for my needs. Has enough of the right size pockets for car/bike tools and the center pocket can hold a 5 gallon jug of oil along with plenty of other items. The zippers are a little stiff at the beginning but smooth out over time. Overall I'm very happy!",
        "Used to carry tools around in 2 different 5 gallon buckets over the years. This bag does a great job of getting tools organized with a spot for everything that I had. Only negative would be the clips for the shoulder strap. I read other reviews that mentioned these were the weakest link in the bag. I agree. Will be replacing those with something a little more heavy duty. Great buy. Would recommend to anyone wanting to organize their tools in an easy to use tool bag.",
        "When it's full of tools, it is damn heavy!. I found it the best of all my tool bags as far as organization goes. The center section was perfect for my test instruments and the outer pockets and sides suit hand tools very well.",
        "not for me. I'm a smaller person and when i tried to put majority of my things/tools in here, i couldn't carry it. 5stars cause it's an awesome tool bag. i made the silly thing buying such a heavy bag. I'm just too small for this. i still use it though. but stationary jobs.",
        "This is a very good bag. A lot of us no longer want to use the outer pockets in the more common tool bags for various reasons: tools might fall out or you end up scratching the surface of other objects, etc. CLC makes quality tool bags, nevertheless, this bag is on the large size. They really need a 16\" version that's a tad narrower and shorter (same proportions, basically). Either that, or put wheels on this thing. There are no other bags like this in a 16\" size, except for one, that I won't mention because it's been discontinued and I need to buy it first before they run out of stock. ;)",
        "Have this one loaded up with all my tools and carry it everywhere. Lots of pockets of varying sizes for all your hand tools in the two side pockets, and a nice deep pocket in the middle for power tools. Seems very well-made and durable.",
        "Great bag, with a good Pocket Layout. Guys are always looking for a better way to store and use their tools, and this was a good option. My only concern was bag wise, when I put all the tools in it, it was too heavy to carry. So I went to a smaller backpack from my work tools and repurpose this bag for a home tool kit. I won’t be carrying it around much, but it keeps all the tools organized",
        "I love all the pockets that keep my tools standing upright. I'm the type of person the likes to reach into a tool bag and grab the right took without having to look at it. The fact that all the tools stand upright allows for this. Bag is larger than expected. When I wear this one out I will be getting the next size down.",
        "This is one of the best tool bags I have ever owned. It has plenty of storage pockets for just about every tool. This bag holds all of my telecom gear, as well as parts, and specialty tools. One drawback is the shoulder strap is not manufactured to hold excess weight. I would recommend this bag to anyone wanting a inexpensive alternative to C.H. Ellis, and Platt tool bags. The price just can't be beat. Now if they could produce this same bag with high quality wheels and a 40\" telescoping handle, they would have a real winner.",
        "The carrying strap broke on the first use, and I wish it had more small pockets but you get what you paid for. It feels like it weights a million pounds once all loaded with tools, my previous bag didn't have this problem but it was a different style so i cant justify that as a star deduction.",
        "Excellent tool bag. It's big - it's heavy - it's full of tools! This looks to be a real work-horse. My husband loves it. Just as advertised. Well worth the cost.",
        "Great bag for the money- Just not a fan of the poke system, as you can easily loose smaller tools down the rabbit hole- I think they should re-evaluate the visual aspect of the design. Allowances for a material that you can either see through, or has short and LONG pocket systems.",
        "So far I’m liking this bag I can put my heavy hand tools on one side and my light hand tools on the other side, my meter and other stuff in the middle, zip it up and it stays organized. Time will tell if it holds up but my last clc bag lasted 5 years.",
        "I haven't really tested the durability long-term yet but this bag works well and has plenty of storage for my tools. Seems to be well-constructed.",
        "I use this product for every aspect of daily life. The construction of this bag is great. has a lot of space and pockets to save all tools. Great looking bag.",
        "Almost two years later I am still abusing this very durable case. Metal connectors for the shoulder strap both broke, but if you lifted my bag you would not be surprised. 4 wire ties on each end and it is back to normal. My co-worker liked it so much he too bought one. Love the side pouches with all the tool pouches . Very durable. If this one ever gives out I will definitely buy another one just like it unless the company has an even better one.",
        "My son asked for this for his birthday. He is currently an electrician apprentice and loves this bag! Holds everything he needs. It looks and feels like very high quality",
        "This tool carrier is one of the best I have seen. It is very well made of strong material and should hold up to work conditions. It has numerous pockets in the two outside compartments that makes it organized and easy to find your tools. The inner compartment is roomy and has plenty of room for socket sets and power tools. I have fit most of my tools into it so I can just grab it and go and be confident I have not forgotten some important tool. Of course with all the tools, it is a little heavy but it seems stout enough to handle the weight and the shoulder strap makes it easy to carry.",
        "I have spent a great deal of my working life as a carpenter and cabinet maker either building or modifying tool carriers. Metal and wooden carpenter tool boxes, tool buckets, open top tool totes, I have tried all types of configurations. Some worked better than others, but none were ideal. The CLC 1539 Tool Carrier has worked about as well as any I have purchased or made. That is not to say that I found it to be perfect. Some modification for my specific needs were necessary and, no doubt, more are in its future. Overall, a very useful bag.",
        "I drive a tow truck and this bag carries all of my tools, and in truck gear short of my lockout kit and thats impressive. It has made lugging my gear in and out of the truck so much easier. If your looking for a opentop bag to hold a lot of gear this is the one to have.",
        "This is a very large heavy bag holds lots of tools . Don't think I would want to carry fully loaded all the time . But is a great bag",
        "This bag is well built, looks good, more storage and pockets than any bag I've ever owned (and I've owned alot). I have everything in this bag, screwdrivers, a big assortment of pliers, wrenches, channel locks, 130pc. bit set, socket set, 2 drills, multimeter, hammer and the list goes on. Only complaint is there is no tape loop to hold your tape like most bags have (does have clip for measuring tape) but it has a small carabiner that is ok for 1 roll of electrical tape but can't hardly fit plumbers tape on it. Oh yeah did i mention !THIS BAG IS HUGE!!!!!!!!!!!!!!!",
        "Excellent design. The pockets are the right quantity and right size in the right places. Unfortunately, the material is pretty thin and after loading it, the bag has lost most of its shape, unless “pear” is a shape.",
        "all the pockets on BOTH sides really make finding your tools easier. i thought the bag would be too large and was considering the smaller 1537 bag but i'm glad i pick this one up. Its much better then the usual Huskey bags on the job site and this one just feels like it'll out last those"
    ]
}