{
    "entity": "Air-Compressor Accessories",
    "text": [
        "Completely stripped out the threads on the barrel because the unit would not operate at lower pressures, get to 35-40 psi and the unit pumped caulk but would eventually 'pop' the barrel off the (very shallow) threads. Re-thread, pop, repeat. Eventually the soft aluminum gave out and I'm not talking about 100 tubes of caulk, I mean 1. Returned and may pick up a competing brand for future projects but did the remaining dozen or so for this project by hand.",
        "As an avid DIY'er, I have used hundreds of tubes of caulking. When you are using an extremely viscous (thick) caulking, it is really hard on the hands to squeeze the trigger on a standard caulk gun to get the product out. This air powered caulk gun is the hand saving answer. Easily squeezes out OSI and mechanically mixed epoxy caulking with ease. Let's you concentrate on a smooth application of the caulk material. Highly recommended!",
        "What a great idea! Easy to use and made a tough job almost enjoyable. Went through 7 tubes of caulk and could still feel my fingers! I have to deal the seams on an aluminum building requiring 12 or more tubes and that's no longer scary. It takes very little air pressure to make this work so be sure to set your regulator WAY down before using this. I shot a ribbon of caulk 3 feet the first time I used it.",
        "Had to wait for a warm spell to try this, return window expired so I can't return. Concept is good but it was very hard to get get a good seal, keeping air from leaking. The tube use coarse threads on the ends which would be fine but they are poorly matched so as they are tightened they will become crooked. The rubber seals are to hard so they don't conform to the caulk tube to make a right seal. When I was able to get a fairly tight seal the the unit did work fairly well.",
        "I did not expect the air to leak out. But it works great at 150 psi. I dont have the old pressure switch and safeties for 120 max. Sure saves on my arms hands and neck muscle. If i knew this was and did and gow well it worked several years ago, i might feel younger today. If you have someone that has to use any thicker calk tube goods and it will fit this gun, encourage them to get one. They will love you for it later.",
        "If you've ever tried to dispense some ocntruciton adhesive in the cold, you know how badly it can gnarl your hands. This is a really great tool for anything but the smallest caulking jobs. It can push a dried plug out the tip of a tube of caulk with ease, so it will handle even the thickest goop you've got the shoot. Good price, solid metal construction, dispenses evenly and predicatbly once its adjusted properly. My only complaint is the trigger is a little too close to the tube body. Just not perfect ergonomics, which costs it one star. Other tip: wrap the first five feet of your air hose in masking tape to keep it clean.",
        "This is awesome. I used it to redo sealant on the rubber roof of my RV. Saved my hands. The instructions are REAL clear that the air needs to be regulated to 10-15psi. For my job I needed 20psi and occasionally 25psi. Start low and work up. If the material keeps coming out after trigger release, it's the tube not the gun. It was hit and miss for me and more likely to run when tubes were full. The trigger is in a stupid spot, but whatever.",
        "I used it today with construction adhesive and worked great. Some people complaint that the trigger pinched their finger, I did not have any trouble with that, although the trigger is a little awkward. The flow stops immediately unlike a mechanical gun. The proper pressure is not clear as it says max pressure is 90 psi, I used at 10 psi and was the rate I wanted. At 90 psi it would have shot out like a SuperSoaker. Unlike a mechanical gun you don't know how much is left unless you disconnect the air and take the cartage out. Would have given 5 stars but trigger could be better.",
        "I have been getting Loctite 3x poly adhesive that is bone crushing to dispense. I ordered this, got it the next day, and love it. Some fiddling with the pressure, I assume depending on the viscosity of the individual tube, which varies greatly. Once you get it working for you, it really works great, and is essential on large projects.",
        "It works relatively well. I have some really thick concrete seam and crack filler and it took setting the pressure nearly to the max (50psi) to get it to work, but it was alot easier than doing it by hand. Getting the metal sleeve that goes around the caulk cartridge to seat correctly was a little problematic, but I got it to work. My \"standard\" size cartridges were about a quarter inch too long, but I could trim them with a razor blade.",
        "When it worked it was way better than squeezing a lever gun. But the screw-on barrel is finicky, and if it's not perfect, the thing leaks air and of course doesn't expel any glue. At this point the threads on the barrel on our gun just don't work well enough to seal at all anymore, so it's back to the lever gun.",
        "Excellent product. I used it 5 minutes ago to seal the corners on the wall panels I'm installing and it came out nice and even. It's slightly heavy but that's okay with me. The only bad thing is that once you install the air fitting it wont fit in the original box for storing. I'm not buying a case for this, so I'm just going to store it loose.",
        "Some other reviews mentioned the trigger as being uncomfortable.I was wondering how bad it could be? Well, it is awful - I ended up taping a small block of wood over the handle. Not great but it worked ok. I ran the compressor at 50psi, and other than the initial start of a tube which tended to come out way to fast, with just a little practice I was able to get a decent bead down. I went through 10 tubes, and overall it was worth the money.",
        "This really saves your forearm muscles from overstraining when you have to do a lot of caulking. Works great. Speed of dispensation depends on air pressure. I've found that around 60psi works great for me. The gun is a bit heavy, so your arm actually might get tired if you're doing a lot of caulking above shoulder height. But still a great product.",
        "This is a very good tool at a good price. It is not hard to get used to and “bleeds off” well for good control of the bead. Maximum recommended pressure is 25 psi which I find a little low but that could be due to the pressure control/gauge on my compressor. Play a bit with the pressure and you will quickly find what best/right is for you. There is one thing though that almost made it lose a few stars: The trigger! One can only have compassion for the person whose hand the Campbell Hausfeld engineers designed it for. That said, a Dremel and about 15 minutes of re-designing/re-engineering takes care of that problem.",
        "I was hesitant to purchase this after seeing negative reviews but I'm glad I did. The tool is excellent and performs reliably once adjusted for the material you are using. it's lightweight and easy to load. I run mine around 20-25psi for thinner materials, and as high as 60psi for thick contrsuction adhesives. One reviewer mentioned pushing up on the trigger instead of pulling back on it, and I found that to work well for me -- it's a function of hand size. I'd buy another one in a heartbeat if I needed it.",
        "Ok this thing worked perfectly to caulk some joints with Vulkum 116. I had a gap that was very large and would take a lot of caulk to fill. To do this with my hand pump gun would take forever. This thing cranked out 9 tubes of caulking in about 5 minutes. It is clearly the single best tool I have bought in a long time. I was worried about the reviews being mixed, but this thing has saved me from having a sore arm.",
        "the cylinder is too deep for the cartilage had to cut 1/4 in off to get it to seal tis the reason that it was opened before I received it was returned so I got a tested one to try very pleased",
        "Some people complained about the trigger, but they must have redesigned it cause it worked perfectly for me. Had to apply some very thick windshield calk and without this gun, it would have been impossible. Well worth the $30 bucks if you already have a compressor.",
        "But you may want to do a few dry runs first if your projects require precision. Caulk may ooze out too quickly so cut the tip of the caulking tube a bit smaller than you normally do when using a manual gun.",
        "I used this to apply the windshield adhesive to my jeep, and it pushed out the very thick and heavy goo right out of the tube! I could not afford the comercial gun just for that use.",
        "I read the other reviews. I agree that this trigger is dumb. But I knew it before I ordered it. I ordered it anyway. I'm getting along in age. The contemporary caulk guns wreck my arthritis. This is really an excellent product, at an excellent price. AND when you release the trigger, it immediately releases the air pressure and it stops oozing caulk immediately, unlike a conventional gun. This thing works. But if your read this, please don't come back and say how stupid the trigger is. It is. If that is a big deal, don't buy it. Pay more than twice as much for the same kind of product with a better trigger.",
        "This works very well. Pleasantly surprised at how well it works actually. Other reviewers stated they had problems with the weird trigger shape. It does kind of feel strange, but I did not have any problems using it. The seller shipped it fast as well. It is light weight, and doesn't cost much more than a hand pump caulking gun. You cant go wrong with this.",
        "I bought this gun to reseal our trailer roof. The gun has a hard time sealing when a new tube is inserted but the rim of the sealant tube was distorted in shipping them to me. Worst of all is the dismal design of the trigger but for the price I'll put up with it. Three stars for the trigger.",
        "This is a very simple tool. You just adjust your airflow based on what caulk you are using. I would not give it a 5 star because the trigger is not in an ideal position. Your finger hits the barrel when depressing the trigger. It seems they could have moved the trigger down about 3/8 of an inch and it would be perfect. I bought this to caulk between the brick and vinyl siding J channel on my second story when working from a ladder. This made the job so much easier.",
        "This is a great tool and really made the job of caulking the windows in my house very easy. It is very well made and is built like a tank and should last a number of years. This was my first air-powered tool to go with my new air compressor, but it was easy to use even for a novice. I'll definitely look at Campbell Hausfeld for other air-powered tools and accessories in the future. I read the reviews mentioning problems with the trigger and did find it a bit snug but found it helped to start suqeezing the trigger from the bottom like another reviewer suggested to avoid any finger pinching.",
        "Works well after some rigging. None of the tubes I bought would fit so I used pipe thread to seal them in so air would not escape. I still have to use higher than recommended pressure due to leakage,but it works.",
        "Makes jobs where a long, constant bead of adhesive or sealant easy. Used it to apply particularly hard to squeeze sealant for targa top. Did a nice job.",
        "Junk. With 1/4 of the caulk left in the tube it stops. I bought this because I had a lot of caulk to put down and didn't want to have to wear my hand out. Waste of a purchase. Avoid this unless you don't mind throwing away 1/4 full tubes of caulk and buying a lot extra. The old fashioned manual gun works every time. This one, not so much. Waste of a purchase.",
        "Great air caulk gun for the money. You just have to get the air pressure right for the material you are using. Once you get that set right it works like a dream. Only complaint would be it is a little heavy, but I used it to caulk up seal plate on my new home construction and it was a life saver for my grip.",
        "Used this on my 1964 front and rear windows, The finish looks like Safelite AutoGlass company did it. This device made applying the sealant so much easier than the hand caulking gun. Quick and clean.. (you do need an air compressor)",
        "Will not shoot urethane no mater how warm it is. I had to break out the hand gun for that. It isn't even that good to shoot silicone. for me this was a waste on money.",
        "We had a lot of caulking on a DIY construction project. Not only was this a great value, it truly does the job and is easy to use with our air compressor. We would recommend this product.",
        "OUTSTANDING product for DIY, or professionals. Chaulked cracks in driveway, sidewalks quick and easy verses using a manual caulk gun. Makes chores and \"Honey-Due\" lists fun...not to mention saving energy sealing cracks around windows and door. Addictive...you want to find more things to seal.",
        "I had no issues with the trigger. Put down 14 tubes in a row. I had to use about 40 psi. Just adjust until you get the flow you want. If you hear or feel a lot of air coming from the top or bottom collar, just grab them both and twist.",
        "Worked great with DOW U-428 Plus Auto Glass Windshield Urethane after I drilled out the end cap to fit the tip. Smooth action, and saves on labor.",
        "I bought this for my husband who has arthritic hands that become very achy if he has to squeeze a caulk gun for very long. He says this works great and lays a nice, even bead. His only complaint is the trigger. When he is depressing the trigger the side of his finder falls under the edge of the cylinder which ends up irritating that finger. He says getting a callous on that finger is a lot less painful then irritating his arthritis but would have liked to see the trigger a little further down the grip of the gun as it is shown to be in the picture.",
        "Once you figure out the pressure on the regulator, which I settled at 20 psi, it releases a nice smooth bead. Great for big caulking jobs and it’s easy on your hands.",
        "nice little tool. the trigger was not the best design as my fingers get pinched when using it. Also, it's best use is for big jobs where you need a lot of calk or adhesive..it is not a good option for detailed work like calking around countertops etc. I used it with and adhesive to put foam insulation up...that is the job types it works best for.",
        "You've really got to be light on the trigger with this gun but once you get the hang of it your done in no time",
        "As long as you adjust the air pressure correctly it works very well. It does tend to splatter/blow out bubble bursts when you get to the bottom of the tube. I wish there was one for the larger quart size.",
        "Doesn’t seem to work all that well. The caulk doesn’t come out that well even after cutting it several time to make it bigger. Doesn’t seem to seal well. Lots of leakage everywhere no matter how much I tighten it.",
        "Easy to use i like the smooth flow of material iam using did a great job",
        "This is definitely the trick for applying RV caulking. Tap the button and out comes the caulk. You could easily use it with a small pancake compressor. I had it hooked to my upright compressor at about 25 psi. For more precise application, I'll start with about 10-15 psi. No sore hands this time.",
        "The trigger is terrible. I am not having problems with finger placement on the trigger like others have mentioned but when I let go of it caulk still comes out sometimes until I manually push the trigger back out.",
        "Came in so handy when my brother built my tiny house. He was skeptical about it but it surprised him in how easy it was to use & saved him a ton of time.",
        "Saved my arm and hands from tiring out, well made great caulking gun, I recommend this product",
        "This gun works well and has decent control. Release of the trigger stops the dispensing. I use it to dispense grease using refillable caulking cartridges.",
        "Excellent value. However as others have noted, the trigger is a bit uncomfortable - until you sand it to your comfort. I still give it 5 stars because I knew this was an issue when I bought it; 5 minutes and the trigger is good to go.",
        "I was able to make it work, but couldn't seem to get a clean, leak free seal on the air attachment or where the tube loads",
        "Very easy to use. I applied 8 tubes of caulk in no time today. I Love this.",
        "I can't believe how simple this tool is, yet it is so great. I have always dreaded caulking, anything...this gun makes it easy and helps makes your work look professional. By adjusting the air preasure of your compressor, it will handle different materials and the size of the nozzle opening for the work one is doing. Good steady stream of caulking or mortar repair without the stop and start \"bumps\" of the old squeeze type guns. Pull the trigger and chauk away and you will have consistent and continous beads. Can not pass this up for the price.",
        "Makes laying down a lot of caulk effortless. I did need to adjust the psi from my compressor to set the feed rate but their was absolutely no over squeeze because when the trigger is released so is the pressure.",
        "Yes, the trigger isn't the best in the world and takes a little getting used to but other than that I think it is not only very well built but functions flawlessly. I would highly recommend it to anyone.",
        "ITS KINDS CHEAP BUT GETS THE JOB DONE AND SAVES YOUR FORE ARM. IT LEAKS EVERYWHERE, HAD TO GET CREATIVE WITH IT TO STOP IT FROM LEAKING AS MUCH. RECOMMEND ATTACHING A REGULATOR TO IT FOR BEAD CONTROL.",
        "Had to rig it up to work with short tubes of engine sealant, and I need to run a little higher than the recommended 10-20 psi, but the pressure release built into the trigger to stop the flow works well",
        "Excellent caulk gun made my caulk lines super consistent. Like a pro.",
        "Might as well use a traditional caulking gun which I DID!!! can't return it since i can't find the cap!",
        "bought this gun to dispense dow windshield adhesive for a project- the urethane is virtually impossible to apply by hand- if you are going to use gun for this, just realize you will have to increase pressure to 75-80 lbs, instead of 10-20 that manufacturer recommends- at that point, adhesive will dispense smoothly",
        "Bought this gun to assist in the replacing of siding on the house. Have applied over thirty tubes of caulking so far and have no complaints. Have not had the issue that many have noted with an uncomfortable trigger, I have noticed that there can be a tendency to pull the trigger too hard. Although the amount of sealant expended is proportional to the pull of the trigger, there is a point of diminishing return where the added pressure does not change the rate of sealant expelled. Would and have recommend this product to friends and coworkers.",
        "If you lay down more than a dab of caulk once a decade, you need this. Stop focusing on manually pumping the gun and start focusing on putting down a clean bead. The trigger keeps a tight break when released. It is not heavy. One handed use is simple. It is easy to clean and maintain. This is a great tool. Wish I had bought one years ago.",
        "I love this caulk gun was using a manual one and found this on line and ordered it. Have loved this air caulk gun cense the first use of it!!",
        "Never use a normal caulk gun again...attach to air compressor with this fantastic powered caulk gun. Works great.",
        "I used this caulk gun to apply caulk in multiple areas during the remodel of my townhome and it literally SAVED my wrist!! If not for this caulk gun I would have spent up to $300 for an automatic caulk gun as I would not have been able to complete this project. I LOVE LOVE LOVE this caulk gun!",
        "This air powered caulking gun saved me a lot of muscle strain compared to hand pumping construction Adhesives. Although the unit seemed to leak at the cartridge can just a bit, it still worked great. The trigger almost creates a pinch zone for your fingers so not the best design ergonomically. But as stated, it was definitely worth what I paid",
        "Made using caulk gun very easy. Finished job in a couple hours, not all day.",
        "Works real well after you get the psi figured out. I think I used mine at around 15-20 psi. Before that I had it too high and I wasted a lot of caulk.",
        "If you need to caulk something, just get this gun. It is superior to the ratcheting hand pump guns. Lays down a nice, smooth, even bead of caulk. Instead of coordinating your hand and the tip of the tube, one only needs to coordinate the tube.",
        "Use less than 50 lbs of air pressure, buy a swivel air connector, and cut a very small hole in tube. This gun pushes the caulk from the gun with air only, no more plunger to reset with every refill. Air pressure gets every last bit of caulk out of tube! It made very quick work of a huge baseboard remodel job.",
        "Great basic air gun for caulk. I was tired of the uneven results using the manual caulk dispenser. The caulk flowers evenly along edges giving a consistent look and coverage. I do agree with other reviews that discuss the trigger design. It is awkward and fingers can easily get pinched. For the price, this is an excellent tools for the homeowner or property manager.",
        "The trigger is to close to the housing. You can't comfortably press it for a period of time. I had 6 men try it and they all said the same thing. Until they improve the trigger design don't buy. Also, needs a rubber gasket in both ends to seal air in. Had to wrap with pipe tape and then pipe dope to keep air from blowing out. It was a hassle. Ran about 40 tubes of caulk through it with much pain and frustration.",
        "Used it to caulk my windows and siding. Easy to use. Trigger not a issue once you get used to it. Like it because it stops flowing once you let off the trigger. Saved a lot of sealant.",
        "This pneumatic caulk gun worked well. Used it on a couple of projects, and it worked well with a thick epoxy, and also with a concrete type mortar. Both of those wold have killed my hands with a hand caulk gun. I am happy with this purchase.",
        "I had a home repair that required over 50 tubes of caulk. This gun provided an easy way to apply the caulking with little effort. The trigger design could be more comfortable but it was adequate for my needs.",
        "Works well when you have alot of caulking to do.",
        "This gun works great after I ground off the sharp trigger corner everyone warned about!! I used 40 psi air and was able to control the flow of the caulk. I got so I could anticipate when I needed to stop pumping before I reached that end point. I gave it four stars because of the sharp trigger corner.",
        "great tool I used it to apply sealant around suv before installing windshield, worked great . I did make one small modification so it could hold the larger tube for auto windshield install I do like this gun",
        "Was this supposed to come with a power cord and compressor? Mine did not and directions are not clear",
        "Absolutely one of the best purchases I have ever made. It makes caulking so easy it is almost fun. No messy plungers--it is all done with air! I am thinking of buying another so in case anything happens to this one I will have a spare but I do not think anything will happen to this one as it is of very high quality.",
        "Add a regulator and this baby rocks, guys with arthiritis in your hands, buy one now !",
        "Great price works great. I used this gun with very thick and heavy adhesive for putting up a stone wall and a backsplash. No issues, really works well. Good construction and can take a hit or two.",
        "Wear and tear wore this tool out in less than a year. The threaded collars don't not operate easily to insert or remove the tubes and seem to have stripped out of usage! Seems the metal is to soft.....",
        "Had to grind down trigger as others have done. It is painful if doing a lot. Grinder fixed the problem",
        "only complaint is the trigger,,, butt-- an easy fix! use a air die grinder and a carbide burr and in no time it is a custom fit! It uses very little air at 10 psi. I just went through 2 cases of caulking for a lap siding house. It is easy to control the flow and when you let off the trigger the caulking stops. My only regret is I shold have bought it a long time ago.",
        "the trigger switch is awkward as it is very hard on the finger....it's a design fault...",
        "A five year old must have designed the trigger to fit his finger - not comfortable AT ALL for an adult male. At 15 PSI, it pushes caulk out way to slowly. I'm going back to using my manual caulk gun tomorrow. Waste of money.",
        "I was worried the product might not be able to push thick construction adhesive (PL Premium). Temperatures were in the 40s, and it pushed the stuff out no problem, using about 30-35 PSI. I like that the gun has no moving parts. Like others have said, the trigger is a little wacky, being hinged on the bottom, you have to be careful not to catch your finger. But, given the price compared to other tools of this type, you can not go wrong.",
        "Works great. Is nice and sturdy construction not cheap plastic like so many items these days. I bought it for automotive use when applying sealant to large areas like timing covers. This gun makes it so much easier to apply a nice continuous bead of uniform size.",
        "I went through 15 tubes of self leveling concrete crack sealer very quickly and well almost no effort.",
        "you have to use teflon tape to get a good seal on the threads or it will not work good because air leaks.......",
        "Love it. Have wanted one for years. Very low pressure required and makes it easy to process high viscosity materials.",
        "Talk about a time saver! This was a lifesaver for my husband he used 24 tubes of chalk over the weekend and it is still going strong.",
        "I love it....this is perfect if you use the glue..sometimes the glue can be very very painful to come out but with this, it is not a problem.... The only issue is that you have to be careful and not get trigger happy and start glueing everything thing because its so easy to use....",
        "This air operated caulking gun takes the hard work of the Manuel gun for wasting caulking of various applications!",
        "Like everyone else says... get an adjustment knob so you can adjust the pressure. I got one with a little round knob from harbor Freight. Use a grinder to modify the trigger. After that, it's great and the price can't be beat!",
        "works good for larger projects. you do have to test out the pressure prior to using. You have to turn the pressure way down to get it to come out at a managable speed.",
        "I have to put a VERY thick sealant on a product at work, this tool makes it possible. Most caulks & sealants only require about 10 psi , the sealant I apply requires almost 60 psi.",
        "I use this to reseal transmissions at work and it’s become my favorite tool. Definitely worth buying. Highly recommend using it with a regulator",
        "worked good with windshield urethane sealant. nice smooth action. make sure you regulate you air down to 10-15 psi. i had no problem getting a good seal on the caulk tube",
        "Why on earth they put the trigger where they did is beyond me. This is such a simple tool, it should have been easy to make a usable one, but a day of caulking will leave you with a seriously sore trigger finger."
    ]
}