{
    "entity": "Air-Compressor Accessories",
    "text": [
        "At the moment I only wish to say the description and photo are incorrect. It states and shows there are brass pieces included with this kit. There are NO brass pieces in this product. I have yet to put anything together as yet to check proper seal, so I may need to update my review. UPDATE: No leaks with this kit. Be sure to use tape. I just used a basic plumbers tape on the threads and pressure holds on each piece. Still disappointed they claim brass parts. They won't even reply..... Too bad.",
        "Well, all of the parts leak. I guess I should have known better, but CH is generally known for making better products than this. I have one of their pancake compressors I purchased 8 years ago, and the fittings for that all work just fine with no leaks. I bought this kit to expand my accessories to go with the new compressor I got. Can't recommend this set at all. Also it doesn't say in the description that the blow gun is limited to 90 psi - you don't find that info out until after you open it up. I'm returning this and will purchase a different kit.",
        "I have an older Campbell Hausfeld compressor that I don’t use much. When I do use it, it’s for light-duty, easy stuff like inflating tires (automobile and bicycle) or pool toys. For that sort of usage, this kit is fine. The pieces aren’t the most air-tight but it works and the price ($14.48) was great.",
        "This stuff is made CHEAP!. The tire inflator almost feels like plastic and had issues filling a portable air tank, barely getting air in. Put an old brass one on and it inflated in under a minute. The trigger is VERY small compared to others and basically is only good for the ball inflator. The end connector will only fit tiny attachments like the ball inflator. Most items had little weight to them and some look more like plastic. Just cheap garbage overall. These are basically disposable attachments. If you are even remotely serious about your tools, spend a few extra bucks and get something better than this.",
        "It’s a descent starter set or if your in a pinch set. It does not come with tape you’d need to wrap the fittings. The tire inflator is plastic, so be careful not to over tighten and break it while putting the hose attachment/fitting on it. The blow gun requires putting the attachment on it (with small hole) in order to attach the ball inflator or pointed end to blow, which is odd why it wasn’t just made to fit the two attachments, by passing the attachment with the holes. Overall, it’s ok for the price though.",
        "Works wonders with my little air compressor. Makes it so much easier to fill up tires by using the long connection. It was a pain having to try to fit the smaller connection my compressor came with in between wheel spokes to fill up my kids' bike tires. Plus, with the quick connections, I'm able to switch from airing up tires to airing up air mattresses or basketballs in a flash. However, I would recommend some thread tape be handy as air was leaking out of the adapter at the threads when I put this on my compressor. Thread tape fixed that problem quick.",
        "Unfortunately, after four moves within a handful of years, I misplaced a lot of the pieces in my original Campbell-Hausfeld set. I bought this as a replacement, but all of the parts included in the package feel much cheaper (lighter) than what I used to own. In fact, a few of the parts I originally had were made of brass, not whatever metal these are made of, and feel much nicer. I'm not confident this set will hold up. Yet it was the only name-brand set I could find here on Amazon (aside from the offshore junk with the unpronounceable names).",
        "For the cost, it'll do the job. Definitely would not recommend for serious jobs or daily use. I occasionally use my compressor maybe once a month, and even then it annoys me a bit. The main issue is that it leaks air from some of the parts; almost all of them in my case. Can't be my line otherwise all attachments would leak. I've tightened it to what I can without damaging and theres always some leak. Just hope you dont have my luck.",
        "Some of the nipples will not thread onto the accessories, when they do start threading they won't go on very far and, no I did not cross thread. Even the ones that do go on leak air around the threads even when using thread tape to seal the joint. If these are made of brass they are a different brass than I've ever seen before. Since they were inexpensive I'll probably not return them, too much of a hassle for a $13 item.",
        "Misleading description, the only thing metal in this pack is the quick connect adapter, everything else is either plastic or low grade aluminum. The inflator barely engages on standard schrader valves requiring excessive pressure and the quick connect adapter (the only actual metal/brass component in the entire pack) leaks on every tool I insert and the gauge is made out of plastic. The price is right, but beware, you get what you pay for with this bottom of the line kit.",
        "I bought these considering my grandfather used Campbell Hausfeld years ago and he told me they were the best. I guess times have changed and quality has gone downhill a bit. They work fine but they HAVE to have Teflon applied to each joint. If not you will hear hissing and lose pressure. They don't have a \"quality\" feel as well but so far they haven't let me down. Price is right and if your an occasional user like myself these should do just fine, but buy Teflon!",
        "I bought an air compressor but no ancillary attachments by mistake. Got these as 'hold me over' until I could research more expensive options. However, these are actually holding up with some pretty heavy duty work. My only complaint is that the seals on the hose attachment come loose easily. That said, I'm using this in extreme conditions so these should do exceptionally in normal conditions. I've been using my set with an air hammer to complete a hardwood floor project.",
        "Some the question's asked aren't well thought out. Durability, hello, I just got is how would I know? Value also depends on how well each item works over time... So looks good in the packaging, company has a good reputation, about $1 per item in the pack for the price I paid so pretty good up front value. The use over time will tell.",
        "This was cheap, and the parts are all there, but the utter lack of any kind of case to hold the numerous parts makes it not really worth it to me. It comes in a cheap vacuum formed but of plastic you will destroy opening up. That means you’ll probably end up dumping the various nozzles into a black hole of a tool box or drawer, eventually losing half the set (if you’re like me, anyway!).",
        "Not the best move if you need durability in the shop. Wiil work but hard to modulate the blower device. Inflator OK on only car tire type air valves. Did not work on bicycle Presta fittings. Crudely fabricated and plated so making connections requires teflon tape always. Not precision stuff here.",
        "I advise that you avoid this and pick up something of higher quality. The metal is extremely flimsy, the threads are super stiff, the fitment is very bad, and the utility is poor. Leaks everywhere, even with Teflon tape. I don't expect this to last nearly enough to recoup the cost, but I preemptively decided to toss it and get a better alternative.",
        "The quick disconnect has barrings that fall out as soon as you pull the sleeve back they fall out on the floor don'y buy this set its crap I have no idea how this got so many positive reviews it is a terrible piece of equipment.",
        "Can't beat the price! You need teflon tape to keep air from leaking and two wrenches to secure them. One part goes to your air-hose and turns it into a quick change type connection. The other parts use the male end of the quick change to install the blower, inflater, etc.",
        "Same product at Walmart for 5 dollars less. Product is minimal in quality and includes items that I've not used in over a year - never used since purchase.....would be better to buy individual tools as needed.",
        "I bought this thinking it was going to be all i needed for my compressor, but after installing it I realized it was a low quality product the tire filling tool is cheap and has no pressure button and can not be connected to pressure handle, had i known i would have bought a different kit.",
        "A very handy 17 piece inflation kit with all types of required hardware to inflate just about any thing you need to inflate. Saves time and trips to the hardware store. This is a great adder to a general tool box.",
        "This seems like a decent kit for a DIY or home user. I would probably want something more substantial if I used these fittings every day in my job. I tested a couple of the fittings and found no air leakage like others have reported. Although I did use PTFE tape and wrench tightened all the fittings. I tested this set on a brand new Porter Cable pancake compressor and a brand new 3/8\" air hose.",
        "When I actually got everything tightened up so that it wasn't leaking its pretty good although the stem for the tire valves got stuck partially open after a few uses and took a couple of good knocks to get it back into position again.",
        "If you're new to compressors, buy this. It has all the converters you need to be able to just pop in and pop out a tool. Otherwise you have to screw on and screw off any tool you want to use. I wish it came with more female tool tips, as it only came with two, but it the one it came with work well. I have no leak issues or anything like that. Highly recommended to anyone buying a basic air compressor for home use.",
        "Bought a few of these, as they contained an assortment of the connectors, tips, etc, that I needed for use with 2 different air compressors I have. Bought during an amazon sale, so it costs less than buying same set locally at walmart. Worked fine with bot of my compressors. Connectors worked well and threaded parts fit well. No problems yet.",
        "For the price you get a lot of fittings. It pictured brass fittings which there aren't any so it's not what's pictured. The tire gauge air gun and tire chuck all feel like plastic. But the fittings are good. They don't leak. If I paid more than the $7-8 dollars I would have returned it. So for the price it will do.",
        "some of the items came busted but the things i wanted/needed have worked well, the connectors and hand air nozzel",
        "They are kind of cheap feeling but if you use your air compressor on occasion as a shade tree mechanic/carpenter, these will do just fine for you. Make sure you use some PTFE tape on the threads and there are no leaks. The assembly is a piece of cake and all the components work just fine. There are better ones out there but if you don't do it every single day or even give it heavier than normal use, these will do just fine for you and save you some money as well. I'd definitely buy again if I needed more fittings.",
        "Expect to use some Teflon tape on the threads to prevent leaking. I'm not sure that should be considered a defect, so I feel a little bad about marking it down from 5 stars. The feel in your hand is not as solid as what I had anticipated (the part with the trigger) so I don't know how that will hold up. Pressure gauge is not made of metal but worked as expected. I bought the kit for the tire inflator, which worked perfectly.",
        "The connectors are all great. The down fall to me was the cheap coil hose. While installing the ends the hose kinked. Not a huge deal just really cheap plasic hose doesn't stretch out all the way because of the cheapness. Other than that the conn is ctions all work great.",
        "So far I have had no issues. Works well for the price. I do suggest to use some Teflon or PTFE tape to wrape around the threads to help create a better seal. I did not use any and have a slight leak and will be picking up some tape to rectify that.",
        "We bought these add-ons to use with a new pancake compressor. They're decent quality and get the job done. Wish it came with a storage case of some sort, but no complaints otherwise.",
        "Great little kid can't beat what you get for the price we bought it specifically to make blowing up pool floats easier in the summertime and we use it with our Craftsman pancake air compressor",
        "I’m going to inflate anything I can find an orifice that will accommodate these nozzles. You’ve been warned",
        "Pretty cheap construction... the tire pressure gauge is so light and flimsy that when I tried to check my tire pressure it gave me a much higher reading than possible so I checked with another gauge I have and got the correct reading...doubt these accessories will last very long...",
        "I like the set, it is what I wanted. I haven't used it yet since the tracking said it was delivered on Saturday and I didn't receive it until today, Tuesday.",
        "As others have noted, the actual kit that I received dud not match the picture in the description. The 1/4 male female coupler is missing. But there are two of the needle inflators.",
        "As others have pointed out, the air chuck does not let any air pass through, and you can't inflate tires with it. I dock them one star for that, otherwise I would have given them five stars. The rest seems to work OK, the fittings fit and if you seal them properly they don't leak. But the tire chuck is worthless.",
        "Very nice product! Includes everything I needed to connect up to my Porter-Cable 6 Gal. 150 PSI Portable Electric Air Compressor. Needed to add Teflon tape to all of the quick disconnect fittings but that is standard for all air compressor products.",
        "This accessory kit has many options to use with an air compressor. It would be perfect if it came with some kind of case to keep them in. Just a simple pouch of some kind would be great!",
        "Thought it was too much until the grand kids came and I had to inflate the swim inflatables. I did buy another tire gauge with the inflater all in one piece for autos. system snaps easily and does not leak.",
        "Was a perfection addition to little portable air tank. Thank you",
        "I really only needed the air blower nozzle, but as a cheap add on item why the heck not have some other components lying around. The quality control isn't the best but you already knew that.",
        "Must have for air compressors. Works well with porter cable to inflate tires, add a stapler/nailer (not included). Provides all the connections needed to easily connect and disconnect a hose (not included).",
        "They work but the quality of the metal and quality control is lacking. Some of the threading is marginal at best and are a pain to attach to any equiptment. Cambell Hausfeld's kit is made in China......Maybe that's the reason for the poor quality control",
        "I have had better...but these will work. The threading just feels pretty messy and the blower is pretty flimsy feeling. I would probably look for another set if I decided to buy something else.",
        "A nice little starter kit for when you first get a compressor. I've used the air spray nozzle countless times and the fittings have come in handy for using getting new tools ready for use. Make sure you have teflon pipe tape too to seal the fittings!",
        "Good set of parts, the QC's seem to hold the air quite well (up to 100PSI or so is what I've tested so far). The only issue is that I wish the hand valve had the same input and output sizes so I could use it with all acessories - instead it is only good for using on inflation of sports balls and other small needle/port inflation items.",
        "It leaks. Sure, you can use tape to fix that, but I don't expect leaks right out of the box. At least ship tape with it if it's a known problem.",
        "The hose is cheap plastic and sprung a leak after first use making it worthless.",
        "Product kept leaking air and the quality felt poorly made.",
        "Someone gave me a nice compressor but I didn't have a hose or and fittings or attachments to use. This is a nice little starter kit! Had fittings to connect my new hose to compressor and everything else I needed to get started with small tasks. Quality doesn't seem bad, but I don't really abuse tools. *Get some thread seal tape for the threads, otherwise you'll probably get some air leaking at connections*",
        "I don't think this would be good in a garage or for heavy use. Feels chitzy.",
        "Bad product cheaply made. Flimsy metal. Top of pressure gauge shot off on first tire I used it on. DO NOT BUY!",
        "Had exactly what I needed in it and a whole bunch of other pieces. They seem to hold up fairly well.",
        "First set Tire guage blew up on firt try replaced whole kit because of it. ?Don't know if new guage is any better but with the replacement of intier kit how can i complain. Did not have to return broken guage or other parts of first kit, so ended up with two kits. A ok seller",
        "This kit is cheap and has good quality connectors minus the fact that they're not brass. If you don't mind not having brass, this set is a no-brainer.",
        "Great kit. The handle where it pivots on the air gun is a little sloppy and the tire inflater seemed a little cheap but they work great, Didn't try the tire checker yet but all the other stuff is fine, nothing leaks.",
        "Fittings leak and parts aren't labeled correctly. This is junk. I can't use it out of the packages as advertised and will be buying another kit that is higher quality. Very disappointed.",
        "Got enough connections for the pancake compressor. Its nice having tire fill options and pressure tester. If buying a compressor but don't know what accessories to get, get this one. It has everything you need.",
        "Overall good kit. Just make sure you have some sealing tape for threads.",
        "Bought this Accessory Kit as a necessity for the aluminum tanked California Air Compressor I also bought on Amazon.",
        "Used several of the pieces to do things like pump up tires and fill kids balloons. No complaints.",
        "I've even used plumber's tape with little success. Not a good product I am sorry to say.",
        "Bought this kit for a Bosch air compressor. It’s a great kit with everything you could need.",
        "This 17 piece kit puts the final touches on the Bostitch BTFP02012 6 gallon compressor I ordered. The quality is great. I'd highly recommend this product to anyone.",
        "These are cheaply made as reflected in their price. Avoid getting them if you can. My order was received with a broken air gauge ...",
        "I bought this set my new compressor that I got on Amazon it is cheap but it works well same product that was sold at Harbor freight company .",
        "The kit is great, I wish there was a small spool of thread tape included",
        "Cheap low quality crap. Almost feel like they’re made out of plastic. Don’t waste your money.",
        "tools had to be made fit, but for the money ok!",
        "tire gage is plastic and it broke on the first time using it but its easy to put it together and at any moment it can fall apart again, the air chuck is making a weird noice on the inside of it but it still works and doesnt leak, so far ehh",
        "just grate kit with everything you will need for home use from basket balls to car tires!",
        "Wish it had an attachment that would actually clamp down on or latch onto a valve stem. Also the fitting is not the best (can feel the air seeping out under pressure) but maybe the is an issue with the hose I have.",
        "Nice to have them you can fill just about anything with air.",
        "Everything works good and easy to connect the one thing that would make this better is if it had a piece that would air up bike tires. As we have Mt bikes and road bike this would be great.",
        "Everything in the kit is ok except the hand air release tool leaks air and the compressor can not keep up.",
        "Junk! Tire inflate piece was broken Tire gauge does not work. The chuck you use to clean with the attachment does fit ? I will buy a set from some other company.",
        "Although I was not fond of the packaging for the price, the items have so far held up and they all get the job done. Overall I am satisfied with this product",
        "Tightening the crap out of these and air is still leaking out slowly causing generator to be used more frequently.",
        "I had to wrap some plumbers tape around the connector end as the air leaked a bit. Working great on my portable Campbell air compressor.",
        "Price is good, quality is decent. But I noticed too many redundant fittings, could have include other fitting to expand its usefulness.",
        "Comes with everything you need to use a basic air compressor. Even comes with extra quick disconnect fittings in case you get a tool that doesn't have one.",
        "Junk. The pieces that are suppose to be connected do not even fit together. None of the plugs screw all the way in to either the blowgun or the chuck.",
        "Arrived on time, everything was there, and the pieces I have used have worked. They feel cheap and I've already had one piece fail. Not sure why, but one of the couplers just stopped working after 4-5 hours. Bottom line, this set is a good way to get up and running fast and cheap, but, eventually you will need to upgrade to better pieces.",
        "Cheap stuff. Even for the price, it's cheap stuff. It does what it says it does, but these chucks are not what I would rely on, on a regular basis. I am using them as spares in my truck, which will be used next to never. They will probably work well for that. The fittings are decent steel fittings and keep this a 3 star buy.",
        "Its okay. Not great quality, but has all the components I needed in the kit for a good price.",
        "In my opinion, this kit is a piece of junk. Spend a little more and get a better kit. The main problem is the threading. Because the items are not properly threaded, a seal is not established. Therefore, there's a leak. Where there's a leak, there's less pressure.",
        "good set to have for when you need to inflate ect. and you can't find your Milton brand parts which are superior with a price to go along",
        "Durable, accurate description, I have not had any issues in the 3 months that I've h been d the product",
        "everything that I need to keep my tires in check as well as other uses. nice buy",
        "Quality is pretty low. But it was not very expensive. In all fairness, all the pieces work just fine.",
        "I mean these work for light duty or hobby level but dont buy these if you are buying for daily shop use. The connectors are ok but you can really see the quality or lack there of in the tire inflator and air duster",
        "Everything was just like the picture. Works fine. The pressure gauge was cheap and did not work.....but I was kinda expecting that (thus the minus one star). The \"pull switch\" is what I needed, so glad I got this kit.",
        "It's okay. It does the job. Parts feel kinda chintzy so I don't know how long it might last. The parts seem like they are die cast metal using the same metal as a Hot Wheels chassis. About the leaks you may experience with this set, use teflon tape to seal the thread.",
        "This is a basic kit which works as designed. The tire gauge is a bit flimsy but it works. All other components seem to be of good quailty. I do wish they would have thrown in a small roll of Teflon tape (or other thread sealer) since it is needed to use any of the connectors. Overall, its a good value for the price.",
        "Seems to be well made, haven’t used all but those I have work well",
        "same as the other one star reviews. not brass, and they all leak. the fittings wont even fit/not leak with others fittings in the same set.",
        "This kit is okay for lite duty use. If your a home owner who just needs a few air compressor accessories then buy this set, it works fine and the price is good. If your a shop you probably know this kit isn't designed for daily use.",
        "Good product but beware this is not commercial grade. At about $20 you get what you pay for. You'll need to use sealant tape (white tape) that seals two threads together for leaks."
    ]
}