{
    "entity": "Sharpening Stones",
    "text": [
        "Just remember it needs to be broken in before you can expect the grits to be accurate. Also, the coarse side is not as coarse as you would expect, if you want to remove a lot of material (to form a primary bevel for instance), get something coarser or use something else. Definitely designed for pre-finishing.",
        "Product was pretty good, until it peeled very slightly from one of the holes. it was very slight, less than one of the circles on the plate. DMT, help me replace this quickly, and thus greatly appreciated, the plates were very good for restoring several chisels & plane irons. the blue side cut pretty well then red side to hone and sharpen it. The red side is pretty good and could get the blades sharp enough to cut hair off your arm. I think though if you want to get things even sharper, its better to also get the next very fine as well. I plan on making that a purchase later since i've had pretty good results so far.",
        "After further review. Diamond dust is almost off of both sides after 1 1/2 months use. very disappointing. Would not recommend.",
        "This is a great tool. My only complaint is that DMT's sense of \"coarse\" isn't the same as mine. The coarse side of this stone is about the same as a medium India stone, and the \"fine\" side is a bit more abrasive than a washita stone. That makes this pair of stones useful for maintaing kitchen knives, once you have them in shape. If you have serious work to do, buy the Extra-coarse/Coarse and pair it with the Fine/Extra-fine stones. The base is well-designed and perfect addition.",
        "DMT diamond plates are fantastic. I have the fine/super fine and just got the course/fine. They make very quick work of resharpening an edge. The fine/super fine are great for edge maintenance; about 10 swipes on so either side and a strop and your blade should be shaving sharp. The course is great for establishing a bevel. I also use these for sharpening plane irons and it does a fantastic job on those as well as knives.",
        "I'm a furniture maker and use my chisels and planes quite a bit. I've used whetstones, oilstones, diamond sharpeners, etc. None of them have given me an edge as razor sharp and consistently perfect as this one, AND I can easily rinse it off with water when finished. I bought mine a few months ago and spent an entire day meticulously sharpening edges and flattening the soles of my handplanes, zero complaints and I'll probably add another grit selection in the future.",
        "I’ve been using this to sharpen my woodworking tools for a few months. It seems the blue surface is not as coarse as when it first arrived. This was disappointing, as I intended to use this as my most coarse grit surface for establishing primary bevels on chisels and plane blades. I don’t think I would buy this set again.",
        "With all the newer and harder knife steels out today this combo will take care of them all. Put's on a good working edge without any trouble. You can continue with finer grit stones if you are looking for a polished edge. Using this combo followed by a strop is all you need for a EDC (every day carry) or that utility knife in the kitchen.",
        "Clips that secure stone to stand were deformed and could not secure stone to base. I find my sharpening stones do a much better job and leave a much finer edge on my tools.",
        "Great sharpener. It is super simple to use and is incredibly flat. Just a little bit of water and the occasional wipe down to remove the leavings and you can sharpen forever. I used it with theto completely rework 4 old chisels and my block plane. The combination resulted in better than new tools. The only warning I'd give is that the \"coarse\" side is slow at removing a large amount of material. So reworking an entire face (like I had to do with the chisels and plane iron) will take some time and elbow grease. But it's a good workout.",
        "I have sharpen knives (Of all types) for over 55 years. This is to include scissors and fine knives. As someone who knows the ins and outs of sharpening, the DMT 8\" is all the stone one would need. I think it works best with water. This gives a relief of friction. The base is very solid. I put it on my wooden bench. I highly recommend this fine tool. K-",
        "I have had this for a month now. I have a set of kitchen knives that hare been difficult to sharpen. With these while it still takes time I have been able to actually get a good edge. I still prefer my stones but when car camping this is lighter and more friendly with knives that are used for food since no oil is need",
        "Great stone, works quickly and easily. No more paying to have my knives sharpened, and can be used to sharpen about any edge. All my kitchen knives, camping knives, fillet knife, pocket knives, multi-tools, machete, Swiss Army knives, etc... remain razor sharp (and therefor safer!) year round! Indispensable tool built for a lifetime of use, therefor saving money. Great investment.",
        "Great purchase. Sharpened knives quickly and very well. Easy to use. Easy to clean. I threw out the carbon stone sharpener I bought previously. It was frustrating to use. Very happy I got this diamond sharpener. Makes sharpening knives enjoyable. I am not lending this to anyone.",
        "Well made. Very little pressure needed to sharpen knives. Numerous Youtube videos on different ways to use......almost too many! Watch them anyways to get a better understanding of what the product can do. Instructions in the box are very limited. I use water with my stone and also purchased a DMT extra fine stone to further my sharpening. This two-sided stone will give you a razor sharp edge without the extra-fine stone.",
        "I have a nice collection of sharpeners: Japanese stones, diamond rods etc.. every time my wife asks me to sharpen a knife I find myself going to the DMT, it is fast, effective, clean and easy to use",
        "Finally! I'm finally happy with the edge on my Spyderco Dragonfly. The blade is VG-10 and I've never been happy with it until I got this stone. I tried regular stones, drag-through sharpeners, and an off-brand diamond. I tried fancy sharpening systems on display in the major sporting good store. Every time it would roll the edge, or just plain not get a cut on this blade. This stone from DMT did perfectly, and fast!",
        "This is so much better than using a whetstone that gets dished out every time you scrape something across it. QC has been an issue with some other DMT stones, but this one has been great. A pink eraser works well for cleaning up the stone when it gets messy.",
        "Very happy with the DuoSharp. I looked at a lot of sharpening systems before this but determined that I don't sharpen things often and wanted something that was super simple. This fits the bill and has worked out perfectly. I used it to clean up some chisels and plane blades and they are all very sharp now. Glad I bought these.",
        "I bought this sharpener after doing quite a bit of research. I use Global knives in my kitchen, and they were hard to sharpen back to that original Razor edge that they came with, and I wanted. This diamond sharpener does the job! Great design, and simple to use. Just run a bit of water over it for lubrication and afterwards to clean. My knives are like Razors again, and I am loving it. Great Job DMT!",
        "By far the best knife sharpener I have ever owned. Used a traditional stone & oil for years, but the coarse / fine sides make it a snap. The only thing I wish they’d include would be a 20° wedge guide, but I made one from a piece of scrap wood. It works for everything from my hatchet to my Becker Campanion to my son’s small folding pocket knife to the chef knives in the kitchen. I highly recommend.",
        "The coarse and fine work great and as expected, however it is not dead flat. Great for sharpening knives or small chisels, but slightly concave on one side and convex on other.",
        "If you have a really dull, long knife, this stone what I've found to be the best cure on the market. I must have a dozen tools I have used over the years and this is the one I use when I need to set up the edge. The coarse side will remove any nicks and sets you up for the fine finish. For what it is worth, I then move to a ceramic and finish with a strop for an incredibly sharp edge.",
        "I love these diamond sharpening stones. This one cuts fast and does a good job sharpening. Obviously, if I was better at holding the correct angle I'd do a better job, but that's my weakness, not this stone. I'll keep practicing!! The diamond stone wears well, doesn't wear a \"curve\" like a rock stone, so it will last a LONG time! And having the course on one side and fine on the other is great; just flip the stone to continue to a finer edge.",
        "This is a good sharpen, however I wish it came with a finer coarse.",
        "I have tried a lot of knife sharpeners over the years,and this is my favorite.I really enjoy a sharp knife in my kitchen,and keeping them sharp is helped by storage.Never put your good sharp knifes in a dishwasher or drawer ,thrown in with a bunch of other knivesThere is a company youtube website for instructions( is it really very good and easy to follow),what comes with is basically the bench stone and not much for how to use it.Yes, I would buy this again,perhaps as a gift.",
        "I've had one for years and just bought a second one for a kitchen savvy friend. Highly recommended.",
        "This is dope. Raises a burr quick and you cannot gouge it like a whetstone",
        "I’ve had smaller pocket size stones and hones galore. Nothing compares to a proper bench sized unit - like this one! I considered classic Arkansas whetstone etc etc, but ultimately decided to go “high tech” with the diamond abrasives. I look forward to adding other grits for courser/finer work.",
        "Quickly sharpened 6 dull kitchen knives of various sizes, including a butcher knife. When I started none of them could cut paper, now they all slice through paper with ease. This sharpener has a large sharpening surface and is great for sharpening knives of any size. The directions say you can use it dry or with water. I recommend spraying the surface with water, the sharpening movement will feel smoother.",
        "Brought back our kitchen knives to original sharpness in 10 strokes on the coarse side. Don’t waste your money on cheap stone or sharpening tool.",
        "Great way to sharpen kitchen knives. Bought this one for my son. I have had this same sharpener for years and it still works great.",
        "Not sure how it sharpens compared to others. seems good though",
        "5 strokes in either direction is all it takes on either side. Excellent product, without a doubt the best way to maintain sharp Chef's knives. It makes sharpening your knives so easy that you have to remind yourself that they only should be sharpened about 4 times a year. The rest of the time use your steel to realign the edge.",
        "For the price this stones does exactly what I want it to do. I collect knives, do leather work, and just started wood working. I am using this stone to sharpen quite a bunch of different style blades, chisels, and steels. It is a fantastic product and anyone can learn to sharpen well with it, if they practice.",
        "Big and sturdy. Great for large implements. Can level up soft stones, too. Got it for my big knives and axes.",
        "Have been using this mostly to keep a draw knife sharp during heavy use. Has been working very well. Was worried about the base a bit but no movement or rocking with a very heavy hand-forged tool. I appreciate the handle on the bottom, I use it to work on the bevel side.",
        "Excellent option instead of course Whetstones! I wouldn't rate this as Fine/Course but Course/Medium Coarse. There is no way a 600 grit is considered fine in knife sharpening, perhaps chisel, but not knife. The diamond mesh doesn't load up and moves material easily and efficiently. 600 grit gives a toothy edge, fine for most kitchen and pocket knife duties.",
        "Great as always! These things are always flat I mean flat flat. They don’t seem to wear out at all. I’m talking after the break in point. I love these things!",
        "I am a wood and stone carver and it has helped me a lot to get the razor sharp edge that I need. The holder is plastic, but seems to work fine.",
        "Didn’t dislike anything! I used this sharpener to edge several pocket knives as well as kitchen knives.",
        "I bought it for my husband who is a chef and he actually liked the product a lot, however, after the first use, the surface started coming off as you can see on the pictures.",
        "I have 3 of these. Cutting rate goes down with use but continues to work. Best used submerged in a pan of water. Don't push too hard, doesn't help and bows the \"stone.\"",
        "Practice on a very old, dull knife. After a few tries, using these stones knife will be very sharp and ready to use. Good quality, good price. Will pay for itself within a year's use.",
        "It works. I think I will supplement with an extra fine stone too. The base is sturdy and holds the stone securely.",
        "I have resharpened all of my knives and scissors. They all work better than new. This tool saved me a lot of money.",
        "Be careful not to over-use this. It's a workhorse, it's aggressive, and it will remove material quickly.",
        "It made all my knives and cleavers sharp....easy to use too. I keep this in my kitchen drawer, so I can use anytime I need. I hate dull knives and I cooked a lot. So far, before I found this I was using ceramic knives...still using them but now the other knives useful too",
        "Convenient and useful right out of the box. I don't know how long it will last or how I will know if it is worn out, but right now it is an excellent product. I use it to set my primary bevel on chisels.",
        "The “stone” is nice. I have the coarse 325 and fine 600 combo. The plastic base is cheap. Better than nothing ... but not by much.",
        "After doing some research it's obvious to me why they charge more then others. I highly recommend this product. Will do a great job on your knives, it did on mine.",
        "This sharpener did what it advertised. You need to know how to hold your knife before it works. But once you learn that, it only takes a few strokes. Am pleased with it and will take to our daughter's place this weekend to sharpen her knives with it.",
        "Very easy to flip sides. Identification of grit could be a little bigger, but works okay. Sturdy, non slip.",
        "Every DMT Sharpening product I've used has been excellent. The 8-inch DuoSharp Plus Bench Stone in Fine/Coarse is no exception. It sharpens knives quickly and well. The plastic base is more sturdy than I thought it would be, and holds the bench stone well. This is a fine product. Thumbs up!!!",
        "Love this sharpener. My kitchen knives are always sharp now. I gave two as gifts this past Christmas.",
        "I found the DuoSharp easy to use. I am a man with little spare time and need my edge to come back fast. With the two sided fine/course, I have it all right there. If you want to just get basic kitchen/field sharp, this will work by itself. If you want to get knife geek sharp/polished, you still need to get a finer stone and maybe even mix in a strop. The stand works great and doesn't move. I have sharpened my 10 inch kitchen knives with ease.works well on the small stuff too. Brian",
        "Got this for my father in law for Christmas and he loves it. I have an old DMT sharpener that belonged to my Dad who passed away in 1999 and I still use it and it is the best. But you can bet that I am asking my wife for one of these sharpeners next year.",
        "I have been sharpening knives, axes, wood planes and chisels for a few decades and until recently had not \"discovered\" these diamond tools. What a revelation! Now I have to find someone to give all my old fashioned stones to. And I have a pile of them! This tool is high quality and does just what it says it does. And it is simple to maintain and store and use. Be caareful with it and be careful with the blades you sharpen on it! Great tool!",
        "extremely well designed ,easy to use and does a great job sharpening my knives",
        "Got it scratched. Can't measure how serious it is, the second photo has the biggest scratch in the middle.",
        "Brilliant. I thought I was just a talentless clod for not being able to put a decent edge on my tools or kitchen knives. I read so many articles that make sharpening sound like a dark art, but like everything else the quality of your tools matter. This is a very good quality tool and I've been able to put excellent edges on planer knives, kitchen knives, putty knives and block plane irons. This is one of those tools that make you \"happy\" all the time. It's always a pleasure to use a cutting tool that has an excellent sharp edge on it, whether it's cutting veggies in the kitchen or planing an edge.",
        "Product is rescuing cutlery that had long since lost its edge",
        "Perfect for the initial sharpening required of large, timber frame chisels.",
        "This is a great sharpener. The one I purchased has a course side and a fine side. I use it sharpen my knives on a regular basis and now they are always sharp.",
        "great diamond stone and base this is all you will need to get your knives in working condition but if you need a high polish you will need some ceramics",
        "I reshaped the bevels, sharpened, and stropped 2 hatchets to a shaving sharp edge in less than 30 minutes. Kitchen knives only required a few strokes on the fine side.",
        "All our knives are super sharp now!!! Easy to use and will last a lifetime!",
        "I bought the course/fine stone. There isn't a huge difference between the two sides but if your blade doesn't have nicks in it the stone will put a quick decent edge on it. I use a couple different finer grit oil stones to refine the edge to a razor after I use the DMT stone. I will most likely buy the extra fine and extra extra fine stones as well",
        "DMT diamond stones are my favorite for sharpening knives. It takes very little effort to keep a razor sharp edge on my knives.",
        "Started from watching a you tube video and had to have it. Works so well and fast. Nothing like a good sharp knife when you need to get the mis-en-place!",
        "Works as advertised. Takes a little practice to get to hold the knife at a constant angle, but sharpens extremely fast.",
        "Well made . easy to transport and stays on bench well . Plates are bonded well and flat .",
        "Works just as expected. The plastic bench is not as sturdy as I thought it would be. I hope it holds up!",
        "Awesome diamond sharpening system. Little pricey, but does an awesome job.",
        "Great sharpening tool. Never have to worry about not being flat, never have to tru it up, and is fast cutting. Excellent for all hss tools",
        "Does a great job sharpening any knives I have. I should have bought one of these years ago. No \"cons\" that I can think of.",
        "I bought this based on the comment from the user who said it was great for their Global kitchen knives. I bought it for the same reason. It puts a fantastic, functional edge (e.g. slice a piece of paper without tearing) on the blade in just a few swipes. I have not managed to take anything to a razor-sharp (e.g. shave hairs off your arm) edge. I think I need a finer grit for that. However, I do know what I'll be getting my dad and FIL for Father's Day.",
        "This is the sweetest thing since rock salt. You just slide the blade across the diamond surface, and Wow. Sharpness. That 's it. A sharp blade.",
        "My Knives are amazing!!!!! nice since I have pll coming over more for club meetings.",
        "Had some seriously dull good quality knives and this stone brought them back to life. Easy to use once a week to keep them staying sharp. Highly recommended!",
        "It's wide and long and feels of good quality. Sharpens fast. The stand works pretty good. It holds the sharpener tight. It moves a little as you sharpen. I would recommend this diamond sharpener.",
        "This is a very high quality sharpener. It is expensive and worth the money. Keep it wet to avoid clogging.",
        "water to wash away debris makes this benchstone easier to use around the home. fine/coarse is more like fine/medium but both cut pretty fast.",
        "As advertised. Fine ranking is a little more course than I'm used to but its a quality product.",
        "This diamond bench stone is awesome and makes it very easy to sharp knives.",
        "Keeps my kitchen knives and other tools like chisels, carving knives etc sharp!",
        "Best knife sharpener I've ever owned, and I've owned a lot. I hunt, fish, camp, etc. and this is a one time have it forever never need another one knife sharpener.",
        "If you are into hand sharpening, this product is by far the best i have ever bought, everything about it is perfect for geting that kinda sharp that people say wow, for the ones that know what they are talking about.",
        "Suggested by relative who has one to try this tool for sharpening my SS kitchen knives. It did a great job with large and small knives. Much, much better than electric sharpener",
        "the shipment came in a very timely manner and the DMT sharpening stones are top quality. I use them to home my woodturning tools. Really helps to get a razor sharp edge on these tools.",
        "This product has worked really well for me. I'm still learning as I go how to sharpen things, but I'm really impressed with the DMT products. This tool even has a handle on the reverse side you can hold onto and take it to the item that needs sharpened, like an axe for example.",
        "I got this for a person who has a leather craft business. He actually chose it and passed along the gift suggestion. He was delighted to get it and says it does an outstanding job with keeping his many knives sharp.",
        "Finally got a decent size sharpener that makes the job of sharpening all my knives , except serrated ones, fast and easy.",
        "Very handy kitchen tool to keep my knifes nice and sharp.",
        "Gets every blade I own razor sharp. Really well made. The base is a champ, it doesn't wiggle at all once it's on a flat surface.",
        "You need to know how to use one of these but if you do its great",
        "Amazing how quickly it takes knives to a sharper point than they ever were.",
        "I am a sucker for sharpening stones, sharpening gadgets and gizmos--anything that promises razor-sharp knives. With this purchase, however, I think I've come to the end of my quest. I learned about this diamond impregnated device from Rudolf Dick's \"Japanese Knife Sharpening,\" which is a must for any would-be sharpener. Stones demand work to make sure they are perfectly smooth and level. The diamond sharpeners are far more care-free. Become a steel-master with this book and stone.",
        "Product is as expected, but I got it real fast",
        "I have only had this for a couple of weeks and have sharpened several knives, a pocket knife, two filet knives, and 4 kitchen knives. Seems to sharpen easier, quicker, and better than my old honing stones."
    ]
}