{
    "entity": "Sharpening Stones",
    "text": [
        "Bought this to clean up nicks and burrs on machinery. Just used it for cleaning up a 9x42 milling machine table. The previous owners did not appear to be careful about maintaining the table as there were a lot of nicks and dropped tool marks. I coated the table with wd40 and gently ran the stone across the table and was able to clean all of them up.",
        "Stone came used when I ordered new. Not happy. Had to spend a while getting the stupid swarf that was ingrained in the stone out. Other than that, good stone. Came flat, sharpens my knifes, does all that a stone should.",
        "Sharp kitchen knives are important to me. These stones allow me to keep my cutlery in good shape with minimal effort. Only wish the manufacturer would mark the grit level on the stones or the box for clarity.",
        "It claims to be flat but it's not. Fortunately, if I buy two more I can make a flat one... I do struggle to appreciate that mode of creating repeat business.",
        "A classic stone for a perfect edge. I also use it to remove any burrs on my machines ground surfaces. I am very pleased with this purchase. The packaging worked so it arrived in good condition.",
        "Great stones for using around the shop. Nice and flat, work great.",
        "you can't beat a good stone and strap. the strap has compound embedded for a fine edge. this is a good company and the products are well made.",
        "I have been trying to find a proper sharpening stone for several years since my best stone went missing. Finally I can get a good edge on my blades.This stone rocks!",
        "Took me a little practice to learn how to use the stone but enjoy cooking with sharp knives!",
        "Very nice. Just recommend taking some very fine bead blast bead and surfacing it on a flat piece of steel with some oil or solvent. Then this really becomes even smoother.",
        "just what I was looking for, levels mating surfaces such as engine cases. Very fast shipping",
        "awesome sharpening stone for my pocket knives as well as my wood working tools",
        "Great stone for breaking edges off of surface ground materials, and sharpens lathe tools and knives very nicely!",
        "The best scrape stone I've ever used. (Well, the second anyway.)",
        "Love this stone! Perfect for on the go machine repair!",
        "On time and as advertised. Perfect for what I need.",
        "Far superior to the water stone I purchased. Works great.",
        "Nice flat, free cutting stone. I use it to sharpen lathe bits and machine scrapers.",
        "I love this stone it works well for the knives I own. I would recommend this to a friend or anyone",
        "I use this as a first step in my sharpening ritual. The coarse side Gets a good amount of material off for minor reshaping, while the finer side gets the sharpening going and prepares the blades well for the next step with shapton 1000 grit, followed by shapton 6000 grit.",
        "It's a great stone for general shop use. However, it's very prone to becoming packed with material when stoning aluminum. I keep mine in a Tupperware container half full of mineral spirits to keep it lubricated.",
        "In most of the factories in which I have worked use this exact stone. There is a reason why. The coarse side is effective without being too coarse and the India oilstone on the other side is an India oilstone enough said. Both sides do their job without producing grit. I have other stones because I sort of have a thing for them but this one is the only one I truly need.",
        "Good stone. Flat stones precision surfaces well. Best for large surfaces like machine work tables. Not meant for small jobs.",
        "Product was received on time and exactly as described. I would recommend this to anyone interested:)",
        "The stone itself is great. The description says that the original item was $151.- due to it being in a special anniversary box. I envisioned some sort of wooden box because these stones were in a wooden box many years ago. The stone I received was in a simple cardboard box with a pretty picture on it. Not exactly what I was hoping for.",
        "I should of gotten the 8 inch there both made in Mexico sadly get their oil I use it out Kurt vise and Haas VF1 TABLE seems small I will get the 8 inch later",
        "Overall a nice stone and came in a nice cardboard box. I’m taking off a star because the different sides of the stone are not marked in any way as to coarseness. The difference between the two is so close I’m not sure I’m using the finer side",
        "Used this to stone internal parts of a Contender as the action was stiff and hard to open. A few passes with this stone and there was immediate improvement. My father is 75 and was having a hard time opening the handgun. This was just the ticket to making it smoother for him. Sits with my gun workbench among the tools. Would buy again.",
        "I have 3 1” by 6” stones that work well up to 9” blades, but sharpening my machete is just impossible on those small stones. However, this sharpening stone does the job well and fast.",
        "A great stone for sharpening. I have a few stones this one is my best one and go too.",
        "A great stone for the money. Was able to sharpen 2 knives in no time. It is aggressive so be careful with the angles but I really like it",
        "Norton are the only stones I buy. So easy to clean with wd-40, and super solid for surface finish.",
        "This stone work very well if you follow the instructions.",
        "I found this norton stone fast and easy to use. It is cleaner and more versatile than my water stones.",
        "This Norton stone works better than any Arkansas stone that I have used. The coarse cuts fast to create an edge, and the fine leaves a very clean and sharp edge that will cut well. Finish with a leather strop, and you will have a shaver.",
        "I use this in a manufacturing setting. These stones are great for removing high spots off die plates, burrs form reference surfaces without affecting the surface.",
        "Perfect for sharpening my Chisels. I use Simple green for the lubricant, rather than oil.",
        "Works very well for setting initial edge to produce a razor edge with arkansas stone.",
        "These stones are great but I learned that really the secret it to use the correct oil for the stone. All of the oil sold has way too much oil in it. Think about it, oil lubricates and prevents friction, something you don't want when sharpening. Make your own oil by mixing mineral oil and paint thinner. The oil to thinner ratio is around 1 to 10. You know you have it right when you rub some between your fingers and it's not very slippery. Make sure to constantly clean the stone with new oil because you will now be removing a lot more material.",
        "Sent me the wrong stone twice....the picture does not match the product"
    ]
}