{
    "entity": "Sharpening Stones",
    "text": [
        "Synopsis and full disclosure: I've not purchased the tri-hone version, only this two-sided hand-held version. This is a good sharpener and I like it, but it's best suited for light touch-up in the field. When concealed in the handle, the sharpener has a tight fit. However when the sharpening stones are exposed, the interlocking handle has some lateral play. The slight play throws me off enough that I have a slightly uneven edge between the two sides. Typically, I perform bench-top sharpening on a fixed stone and my edges are even/straight. Because of this, I believe I would have been better off spending extra for the tri-hone.",
        "Hands down the best sharpener I've ever owned. I've tried stones, the stationary kind that sit in countertops, long skinny ones, you name it and none have been able to get a blade sharp likes these. I primarily use this for very thin curfed Japanese knives I use everyday in the kitchen. I also use these on all of my hunting knives for meat processing. 1 Tip - read the instructions carefully on how to use this correctly as it is different than other type sharpeners.",
        "I have a bunch of different sharpeners around the house and whenever i see something different i want to try them. I love having razor sharp knives, but somedays i am lazy and don't want to use my stone or wheel. This sucka is awesome, a couple strokes and i can shave arm hair or meat like butter.",
        "I have been using this sharpener for two years now. I am a professional chef and work on a boat. I sharpen all my kitchen knives with this tool. The sheath makes a very secure handle which protects your hand from the knife edge when pushing into the blade. I like the \"fine\" and \"coarse\" at the top of the file because it's hard to tell them otherwise. I sharpen with two angles using the coarse for the high angle and the fine for the final edge. Finish with a shark and it is as sharp as a new double edge razor blade! Shave the hair off your arm with not problem.",
        "This is my second knife sharpener from Smith's. My first was the pocket pal and that works very well when it comes to quick and easy sharpening small knifes. But I needed something to handle some of my bigger knifes. So I decided to get this one and I have to say I am impressed by the quality, how compact, and how lightweight this sharpener is. You can easily place this inside your backpack. Partially rubberized cover/handle that makes it comfortable to grip and use. It gets the job done by sharpening small and medium size knifes.",
        "The sharpening surfaces work well - I can get a quick edge. However, the handle doesn’t snap onto the stone (for storage or for sharpening), which makes it come apart when storing it and (even worse) makes it almost impossible to get a grip when trying to sharpen. Unfortunately, since a handle is the interface to a device like this, a broken handle means the devices usability is greatly reduced. That is why I had to rate this so low. If the handle were fixed, it would be a solid 5 stars.",
        "I bought this same product seven years ago and had nothing but praises for it, using it to sharpen our kitchen knives for the seven years. Finally the diamond chips wore down so I bought the same product since I was so happy with it. But after only four months, the new one was worn down more than the old one that lasted seven years. It is now so smooth it is useless. Would have rated it zero stars if I could.",
        "I am a woodcut artist who carves wood all the time so I am particular about my carving knives and other tools being scrupulously sharp. Kitchen knives bother me because they never are or stay sharp, and gardening trimming tools just lose their edge very quickly. This light and portable tool is perfect for taking along on a job in the back yard or to the kitchen for a quick do-over of the knife I need before preparing dinner. Easy and intuitive to use, delivers a fine edge quickly and stays clean. Perfect for every sharpening job.",
        "This is actually able to take material off of a ceramic knife blade, which is what I wanted. I really wish I had gotten a proper block, however, since you absolutely cannot use this stably on a surface. That's a price-point issue though, so no points off for that. Fact is, I was able to grind down a busted-tip ceramic knife and put a new sharp point on it. Wasn't quick, but then again I was doing some heavy material removal.",
        "great diamond coated tool for sharpening pocket knives and kitchen knives. fits easily into backpacks as it stores within itself. 2 sides for coarse & fine sharpening. does an extremely good job of putting a fine edge on your knives - no matter how dull they were to start with. lasts a ton longer and works way better than those stick sharpeners - and doesn't remove all the metal shavings off your knife like a carbide sharpener does. highly effective - and i'm a highly satisfied customer!",
        "Needed a compact knife sharpener for my field knives that would fit nicely in my truck. This fit the bill. Relatively light weight and has a case to protect the diamond impregnated sharpening sides. Like it has different grit size. Have used it twice on a folding and fixed fork knife and quickly put a nice edge on both. Neither blade was in really bad shape. It functioned well for what My need requires. Seems it should suit my needs for a long while.",
        "This sharpener is not as good as the granite stone I replaced with this. Too bad I threw that rock away already. This is a great sharpener for people who don't like their blades super sharp; for fear they'll cut themselves. UPDATE: After less than 4 months of light duty personal kitchen use, it has chinks along the edge and has lost its bite.",
        "Have been using this stone since April 2020 here at my residence and just now the glue which holds the handle on to the two sided sharpening sides finally broke down. I am trying to repair it by using Gorilla Super Glue Gel so we shall see if this adhesive holds and doesn't break down due to the honing oil that I use which is Dan's Honing Oil. Otherwise than that there have been no issues at all. Keeps edges crazy sharp.",
        "My friend brought one of these sharpeners on a bear hunting trip, and we used the sharpener several times when we processed two bears. We saved a lot of time, and effort, by periodically sharpening our skinning knives during our processing. I had a brand new knife, but it still became dull. However, I used this particular sharpener to quickly revive a razor-sharp edge. The sharpener was easy to carry, handle, and use. It worked so well I bought one for myself.",
        "Four stars because, my opinion, it could be an inch longer. I carry pocket knives for work. Not big ones, but nice ones. This stone ger them super sharp. Then just maintenance and it stays sharp. So over all it's great but that one inch could help with a more fluid swipe of the blade on the sharpening surface.",
        "I have used a previous model for years and recently thought it just wasn't the same so I ordered another. After comparing the new one with the 6-year-old model, I realized I should have replaced it sooner. Good longevity, just don't cheap out when it starts to take longer to sharpen. Buy a new one,",
        "When you reverse the handle so as to extend this unit for use, it fits very loose. This is not a desirable situation for a knife sharpening stone. Also, this product is over priced. There are better on the market. ONE star, at best.",
        "As stated before this is the only knife sharpener that I use I live on a hunting ranch that I own and I am constantly cleaning and skinning game. This is the single best knife sharpener you will ever buy once you get The Knack of it it is amazingly easy to use. It's all i use to sharpen my knives then I touch them up on a butcher's Steel",
        "My 'go to' sharpener for most knives. Puts a good edge on blades. I usually finish with a ceramic butchers 'steel'",
        "This is my favorite knife sharpener. My buck 110auto is easy to sharpen with this handy tool. Highly suggest it .",
        "I use this for fine tuning or maintain an edge on a blade such as for hedge shears, lopper blades, i.e. curved blades and straight blades. It is a clever design with the handle acting as the housing while connecting to the actual diamond surfaces to provide a comfortable and sturdy grip. Gives a sharp edge !",
        "I highly recommend this 110% it does the job if you do it the way it says your night will be short trust me I split my finger wide-open it hurt any blade who cares there’s a little blood thank you",
        "I have to give this a mediocre at best rating. You can get your knife sharp enough to cut very easy to cut through items but if you are looking to get your blades razor sharp don’t bother with this one. Smith’s is a great brand buy you are going to need to step it up to at least the 3 stone sharpener.",
        "I have used these for some time now. I keep one in my backpack and one in the kitchen to touch up the Chef's and Paring Knives used on a daily basis! This sharpener does a good job on blades that have been properly profiled on a large stone. This is not IMHO intended for major blade rework or for profiling an edge!",
        "The product is exactly as described. The combination of the two grits, groove for tip sharpening, color coding, plastic/rubber construction, locking sheath, etc make this a very convenient, portable and durable sharpening tool. Its not going to get you razor sharp but it will keep your field tools sharp enough, do it quickly and take a butter knife to good enough skinning quality in no time. Its also light weight and requires little to no maintenance. The only \"problems\" I have with it is the width and no easy way to lay it level and supported. Both issues are easy to remedy but perhaps aspects for the manufacturer to look at for improvement.",
        "There diamond knife sharpeners are great have one , bought one for a friend, one Side coarse, one side fine, nice handle to store the stone in. This will sharpen without any oil , will sharpen blades faster than the a regular stone. Happy! Try one you won’t be disappointed!",
        "I bought this knife sharpener to hopefully give new life to a cheap-o Gerber blade that I've abused for some time with no sharpening. The blade had a few moderate dings in the edge, and wasn't sharp enough to cut the packing tape on the box this sharpener came in. Using the coarse side with a little bit of water, I was able to take the edge down past the nicks in the blade, and it sharpened right up after the fine side of this sharpener followed by a ceramic rod (not included). I like that the sharpener stows inside the handle for easy carrying.",
        "I've bought a number of these. One for personal use and the others for gifts. Every cook needs sharp knives. This sharpener works great, but it's not appropriate for sharpening serrated knives. I like how the sharpener end stores in the handle.",
        "While I'm only giving this 4 stars, I do think it's a good sharpener. I had one for a few years and just bought another one to keep at my cabin. The diamond surface works very well and give you a lot of control over the sharpening process.",
        "I've had one of these for years. It is my most used sharpener. I purchased this one as a gift. With a little practice it's easy to use. The business end can be remove and slid inside the handle so it's easy to cary along camping or in a backpack. The medium side is to reshape the grind if needed, and the fine side is to put on a nice edge.",
        "Does the job nicely and has a nice price tag. If you want a similar product for traveling you might consider. Smith's sharping handle makes it a little more cumbersome to pack (the sharpening blade does come out and reverses into the handle). This sharpener, however, also really does the job well and is much less expensive. Nice for your kitchen drawer.",
        "I like this knife sharpener for quick touch-ups for kitchen knives & pocket knives & etc.",
        "My coworkers have this same sharpener. They all love it and I agree, although for some reason the one(s) I got on amazon have defective castings where the outer sleeve won't stay locked on. The indent that keeps the two parts attached isn't protruding enough so it won't engage enough with the mating part. Otherwise great product. Wish they would fix the casting issue. I returned the first one, but the second one I got had the same problem.",
        "Wow is all I can say. I bought this on a whim because I had some 'gift card money' to use up. I've had multiple knife sharpeners, including some rather expensive ones. This is obviously quite manual. But what a fantastic job it does when used properly. Took me about 20 minutes to sharpen every knife in our butcher block with amazing results. Very, very happy with this. The case, handle works perfectly for keeping your hand safe and is comfortable to hold. Well done Smith's...",
        "Like it, quick easy way to put a edge on your knife.",
        "I have a drawer full of knife sharpening tools, but have never been happy with the results - or at least not for long. Some seem to do ok for a while, but then either break or stop working. I expect to get a lot of use from this little tool, and I will regain a drawer in my kitchen when I toss out all the other things. All my knives are sharp now, and this tool is what will keep them that way. The only thing I would change is the size. It would be easier to use if it were wider, I think. But that's probably just going to take some practice to overcome.",
        "This is a great sharpener. Just 5 swipes across each side of the sharpener gave my knives literally razor sharp blades. My test for a good knife is how it will slice a ripe tomato. After sharpening, I was able to easily slice through a tomato. One thing to be aware of is if your knife is extremely hard steel, just stroke it just lightly about 6 times on each side. That should do it. I would buy this sharpener again. It is that good.",
        "Puts a great edge on in no time. This is my second one. Love it",
        "recently i used it to sharpen and old tree branch clipper that was very dull from over use ive had for many years and was never sharpened. in less than 10 minutes i sharpened down the blade of it sharp enough to cleanly cut into paper and it was like a hot knife through butter when i went out in the yard and clipped some branches.",
        "This is a great sharpener BUT Walmart has it cheaper at $14.97! Like a dummy I bought this item from Amazon before checking Wally World. That won't happen again. I can't send it back to Amazon because I now have to pay return shipping of $5.03 so I will have to keep it. Back to the sharpener....this is really a great item. It puts a great edge on a knife and is very handy to use around the house or in your hunting kit. I've used several of Smith's sharpeners in the past and this is one of their best.",
        "This is very easy to use and I keep it in a drawer next to my evening chair where I can take my knives and sharpen them in the evenings while watching TV. I also take it with me camping to keep my pocket knife in good order each day.",
        "This is the easiest and best knife sharpener around. Double sided, so its specific for sharpening smooth after you use the rough side. I bought one for my home and one for the road.",
        "It may seem convenient to be able to store this sharpener in its handle but it actually limits the length that is actually usable. It remains to be seen how well the surface will hold up. I had a cheap Smith's multitool with a sharpener in it and the \"diamond\" surface wore off completely in no time. This is clearly a higher quality piece.",
        "I purchased this with the expectation that it would but a decent edge on a pocketknife and would be compact enough to keep in my gear bag. I was amazed how may tools I've sharpened -from fish hooks , wood chisels to hatchets.",
        "Work very well although the grip is a bit bulky and doesn't let you get a low angle and still use the entire length of the sharpener also their is a very annoying line down the middle which drives me nuts. I much prefer the DMT double sided diafold , but if your on a budget this will do the job .",
        "The product was delivered as promised. It is nice in today's market exchanges when both parties keep their word. I will not hesitate to use this company again. As a matter of fact, I have put this company on my favorite list. Thank you",
        "I just received this sharpener and the sharpening end does not lock into the handle what so ever. If you turn it upside down it falls out. It dos sharpen ok though, just wish it would lock securely into place.",
        "I've been using this sharpener for a month or so now. Great field sharpener. I can replenish the edge on most of my machetes, axes and utility knives in just a minute or two. For a really fine edge I would and do use a stone set but this will give you a serviceable edge when you don't have the time to do that or are in the field. Keeps my knives sharp during butchering. It is compact and easy to use. If you use your knives and don't just keep them for show, you need one of these. Very pleased with the purchase and priced reasonably.",
        "We use it for our camping knives...a long blade machete and a 4.5\" fixed blade knife. It keeps them nice and sharp. I also love that the cover snaps onto the stones to create a handle, therefore saving space...perfect for outdoor utility. As someone who works in a professional kitchen and has experience sharpening knives, I know that it's easy to wreck your blades if your not sharpening right. I wish this stone came with thorough instructions, but it doesn't so be sure to read up on the internet to make sure you're doing it right!",
        "Wow, this is quite a bargain! It's made of diamonds, so it's safe to use (as opposed to the many products that release toxic horrors when used). It's very heavy and solid and well made. It has the added feature of storing inside of its handle, making it compact and attractive and protecting it from being dirtied in a toolbox or trunk or your pocket. There's also a spot where you can attach a keychain or hang the sharpener from a hook. It's easy to use and does a nice job sharpening knives, and I expect to be using it probably for the rest of my life.",
        "I use this product to maintain both my household knives and my fishing knives. It works fine with both and, so far, requires little time and effort to bring a knife up to par. It also stores easily with sheath concept.",
        "User friendly. Keeps knives sharp while in the bush. Extremely handy with perfect size.",
        "My favorite knife sharpener. Keeps all of my kitchen and work knives razor sharp. Easy to use and very durable. It sits in its own handle as a case and doesn't need water to sharpen.",
        "This is, hands-down, the best way to keep a good sharp edge on my kitchen knives. I also use it to keep my pocket knife sharp and periodically take it with me to sharpen my daughter's kitchen knives too!",
        "Sharpens as advertised. Handle a little loose but added a wrap of tape and that tightened it up.",
        "Great and stone compacts inside the handle for smaller storage. I bought this to sharpen my Cold Steel shovel and Trail Hawk while camping. It's just the right size so you dont cut yourself while sharpening anything like a smaller stone. It worked perfect, this stone is better for sharpening items like shovels, axes and machete's than for a knife. I have always been a fan of the verticle v shaped ceramic sticks for sharpening kinves and although this item would work, its better for larger blades.",
        "Sharpened my Mora and my camp axe as soon as it arrived. Didn't sharpen to a shaving edge but then I didn't strip. Works well enough to put a good cutting edge which is good enough in the field. This tool gives me the piece of mind that I can sharpen my knife and axe if they need it with out waiting to get home.",
        ".... affordable diamond knife sharpeners. Quality and well designed for using.",
        "I really like the sharpener because it is well constructed and it works very well. I bought it to sharpen pocket knives with. I like that you just pull the stone straight out of the holder and turn it around for storage inside the handle. That works really well to protect the stone when not in use. The sharpening surface is 1 inch wide by 4 inches long. One side is the coarse stone and the other is the fine stone. It is a high quality, well built system. I would buy from this seller again also.",
        "This is a great field sharpener, but I also use it at home. It's compact, and you can store it anywhere; it fits great in a bug out bag or survival box. I can get my smaller knives pretty sharp with this thing. It's simple to use, and it is 2-sided with a coarse side for dull knives and a finer side for knives that aren't that sharp, but aren't dull either. Although it could be a few dollars cheaper, this is a good value sharpener---more than adequate for the field!",
        "I have hand problems and find it hard to use the small stones. This stone is easy to hold and feels comfortable. Puts a great edge on all our knives. No other stone I have tried is comparable with ease and price combined!",
        "I use this handy pocket size stone to sharpen my scythe. The stone part fits neatly into the plastic handle making it the perfect size to carry while working. Other stones did not include the fine in combination with the coarse grit, like this stone. My only concern is the life of this stone and how it will maintain its sharpening ability after heavy use. While time will tell on this issue, it fits my needs perfectly and does a excellent job.",
        "I’ve always liked smiths sharpening products however was disappointed with this purchase. The sharpening stone is great but is very loose in the handle and all but falls out. If I could do it again I would buy another brand.",
        "I bought this as a Blind friend of mine uses this and after he sharpened a knife for me I knew I wanted one. On first use I was not very impressed as it was really rough but after sharpening a couple of knives the surface started breaking in and started working like his. This is a very simple to use, and does a fantastic job. I also like the way it is made with color coding and the snap on cover. This has become my go-to sharpener for all my work knives.",
        "This sharpener is fast to use, well-made, and easy to store. It stays in my tackle box (unless I need it elsewhere--then it goes right back).",
        "This sharpener is a pocket version of a boxed unit I keep in my shop. The handle reverses to enclose the dual sharpening surfaces, making it a compact package to carry in your field back, if not in your pocket, as it is a little heavy to cart around in your pocket, in case you are bored and want to sharpen your knife. But as an addition to your kit, it is ideal, and will keep or restore your knife's edge quickly and effective Contrary to description, it is 9 inches open and 6 inches closed.",
        "This is also a must for your camp bag, normal kitchen knives, to your bug out bag. It's not as fast as the Tri Hone, but I have 3 in different places so I always have one camping, in the kitchen, and one in case. I used my last one so much, the handle broke after a year of hard use. The stones were still in great shape. Just keep them clean and lube when needed",
        "I've never been any good at sharpening knives, but this one works well for me ... I highly recommend using their 'Smith's Sharpening Solution' with it (it's almost a soapy mixture) ... Instructions say to NEVER use an oil product on this ...",
        "Since buying the Smith's Sharpener it has become my go-to knife and axe sharpener both at home and out in the woods backpacking. It is extremely easy to use, compact, light, and leaves you with a dangerously sharp blade! What's not to like, right? I keep one at home, one in my backpack, and one in the car. I would highly recommend this to anyone in need of a lightweight, easy to carry around sharpener.",
        "Love that the file is protected by being able to tuck into itself",
        "Great construction, works great for what I need it to do. The handle is very comfortable and the file itself lasts! I still have it and use it regularly and is been months since I've ordered this. Came packaged very neatly and securely so no damage.",
        "Bought for my son who is a large game Fish fisherman. He loves it!",
        "Puts a nice edge on my knives, but the abrasive seems to be wearing off on the course side. Time will tell how long this thing performs.",
        "In the kitchen I use my Japanese wet stone. For touch ups or in the field this sharpener puts a super sharp edge on your knife. A friend had one I tried it and was sold.",
        "I have had a lot of knife sharpener and this one is one of the best ones I have used in a long time.",
        "Works great for quick sharpening of small tools like gardening shears and pruners. Also great on tools that don't require a keen edge like a machete or axe. If you have something that needs to remove a lot of metal though, I would opt for something coarser and bigger like a DMT continuous diamond plate. Wouldn't use it on fine edges like good kitchen knives though. Plus the handle doubles as a cover which is great for when you want to carry it with you.",
        "Ease of use, compactness and price make this sharpener one of the highest value sharpener in the market. I just need to use 4 strokes on each side of my blade with water as lubricant and 3 cycles, the blade become very sharp. Then I just rinse off the metal particle, dry with tissue and everything is done. Great product.",
        "Excellent smooth sharpness and goes on easy. Diamond cut that delivers a fine cut in such an excellent sharpness cut. Be careful cause the blade comes out so sharp that it will cut so easy and so regular that it can be immediately sharp and feels so good. It looks and feels so well that you will love this diamond cut machine. It is so easy to shave and get a nice cut. It doesn't take that long to get a nice cut. I was so pleased with the shape and sharpness. The price is not that bad.",
        "After about an hour it is starting to put an edge on my harder steel blades. My benchmade has been worn down to about the sharpness of a spoon and I have had no luck putting an edge on it with any \"stone\" sharpeners so I would consider it a winner. The course side will reshape a cheap blade quick so I can see this being a great addition to my camp/hiking setup.",
        "Other than a fine wet stone these are the sharpeners I use the most. I bought 2 to replace the one I've had for at least 10 years and finally wore out.",
        "I bought one for my kitchen and ended up having to buy another three because my husband kept stealing them for his gun room, hunting bag, and carving knives...",
        "A razor edge is a few swipes away. This is an easy to use tool. The edge I get from using this thing amazes me every time I use it. Buy this stone you won’t be disappointed.",
        "Sharpen your knifes quicker with this handheld sharpener. Lost my first one, bought this recently. Dont know why i waited a year to get the replacement. Reccomended for anyone who has even a pocket knife.",
        "This is a good handheld sharpening tool. I have the electric sharpening tool for my knives, but this one is good for when you are in a pinch to sharpen something. I the handle/sheath is very handy indeed.",
        "Very very nice hook sharpener! I've tried many less expensive ones some worked others not that great - but this is by far the best hook sharpener I've ever owned and will definitely last a long time. Stop thinking about it and get it.",
        "Great tool like the compactness of sliding into the handle. I use it to sharpen flints in my muzzel loading rifles, works great. Also does a Superior job on all my knives, highly recommend it.",
        "Does not stay locked and handle Larkin shirt had to tie a piece of power cord around it to keep it from falling out",
        "As a sharper it’s great. The case tho doesn’t fit. Slips right out. Need tape to hold case on",
        "I bought one previously for half the price and then bought this one and this one is so much better than the cheaper one. Mix knives much sharper than the other one. Good buy.",
        "OK for fine tuning a blade. Had more difficulty starting from a dull one.",
        "It can be a little funky to hold but it puts a nice edge on my knives. I highly recommend watching the Youtube video on how to use it.",
        "FAST ! after downing a crusty hog, used this device to put a good edge back on my no-name skinner.",
        "I have been using Smith's diamond sharpeners for many years; however, it seems that in the past couple of years they wear out much sooner than formerly. In fact, I am still using some that are more than 10 years old while newer ones are as slick as a hound's tooth.",
        "It's a sharpener. It's not anything new or fancy. It has a corrugated surface so you can slide your blade more quickly and smoothly. The handle switches into a case to prevent unnecessary wear and tear. It works really well and it's great to toss in a bag for a trip or bugout scenario. A sharp blade can save your life, and that makes this tool a lifesaver.",
        "This is our file to take camping to sharpen knives, axes etc. Snugly stores it it’s own handle. Husband says it’s great quality and just what he was hoping for. Says it will work just great!",
        "I would have given this a better review but the product is not as pitchured the one I received does not have the hole to hang it up on a hook not happy",
        "Great Addition to a compact sharpening kit Now if they would make a companion two sided strop.that'd be cool",
        "Very pleased with this purchase. Finally found something that sharpens my large garden shears, limb clippers, and scissors. Highly recommend and reasonably priced.",
        "Can get a very sharp blade with this in a short amount of time. I am no expert on blade sharpening I just know good result when I see them and this give them every time. Took it with to Afghanistan and kept my blades sharp the whole time. This is no professional sharpener but if you cannot stop at the corner whenever you wanna get a sharp blade this is the thing you need to take with.",
        "Quality product, but follow directions and know how to use this properly with the proper blade steel."
    ]
}