{
    "entity": "Bolt Cutters",
    "text": [
        "Tried to cut a Master Lock and the cutters actually chipped!",
        "This product is made of inferior metal and it simple bent and chipped instead of cutting. A $30 angle grinder did what these 36 inch bolt cutters couldnt in about 3 minutes.",
        "Will cut wire fence. Will not scratch a padlock. \"Heavy Duty\" refers to the quality of the product, NOT for heavy duty cutting.",
        "As a yard switcher, I have to cut a minimum of 20-30 bolt seals on containers/ trailers everyday and these bolt cutters have exceeded my expectations. The blades, at least after 4 months have stayed sharp, no deformations, and show no signs of hard use.",
        "Like other reviewers I was drawn to this tool by a need to remove a padlock. I had previously unscrewed the latch to which the padlock was attached, opening the gate, but I wanted to be able to re-lock it with a padlock to which I had the key so...",
        "These bolt cutters are great. It's not often I need them, but, for the price...I couldn't go wrong. Easily lopped through a Master Lock that I forgot the combination to. They're quite big and heavy. I could've gotten smaller ones, but, again, it was price. The smaller cost the same, so...go big or go home.",
        "These are HEAVY! They cut through a 175 Master Lock shackle quite handily, but one has to be strong enough to lift and position the cutter tips, as well as have the strength to bring the handles together. If you can not lift a set of 40lb barbells to chest height, then these will be too big for you to handle. They are very well made and do what you could expect from cutters of this size. A tool worth having.",
        "I bought two bolt cutters of different manufacturers, the most popular 8 inch red and this 12\" size, I needed to cut through some pretty thick wire, wasn't convinced that the 8 inch pair could do the job so I bought this bigger 12\" size for a back-up, they both arrived the same day and couldn't wait to put them TO THE test, I decided to try the smaller one first, first one hand then both hands, not even close, obviously made for much smaller wire Then I tried the Neiko bolt cutter and they clipped right through with minimal effort, you get what you pay for , these are of very good quality and worked superbly",
        "I purchased these cutters for my tree stands. The locks on my stands rusted and could not be opened. I received these cutters and was surprised at how extremely heavy they are. While they cut well, they are practically impossible to carry up and down my ladder stands. I was disappointed to say the least. I did keep them as I am sure they will serve other purposes cause the are well made. I will say if you want something easy to handle and use, you should try something different.",
        "I tried to cut 1/8 inch steel cable and it didn't work. I am not experienced enough to know if I'm using the wrong type of tool or if this thing is total garbage. I was able to cut a 1/8 inch bolt, but I had to make 4 cuts and rotate it. It seems like the cutting heads come together, but don't overlap the way scissors do. I would give it 1 star, but I don't really know what I'm doing with this tool.",
        "Was disappointed in the fact that the cutting edge was damaged by small bolts. But it did it's job, sacrificed it's life to clip these 4 bolts. Lucky for me, I really only bought it to cut these 4 small bolts I couldn't reach with a hacksaw..",
        "These are high quality bolt cutters. I tested this out on an old padlock and was able to cut through it with no problem. Obviously it does take some strength but they get the job done. I'm going to completely honest with everyone. I had absolutely no reason to purchase these. It is literally something I have never needed. However, I'm one of those people who would rather have it and not need it than need it and not have it. Somewhere down the road I'm sure I will need these and when that day comes I'll be glad I purchased it.",
        "I used these to cut through 1/2\" rebar. I cut 100' into 2.5' sections, 40 cuts. My body started to break before the cutters did. Biggest downside is they're heavy but theyre almost 4 feet of metal that is designed to cut other metal, what do you expect? They seem really durable too. To make my cuts I was positioning the lower handle against the ground and hanging my 280lb frame off the upper handle for leverage. Minimal marking was left on the handles and no marks were left on the blades.",
        "I purchased this to cut ordinary wire-frame closet shelves, in particular the Rubbermaid brand with a 1/4-inch thick crosspiece. I am surprised at how difficult it is to cut through this material. I have to brace the shelf and one arm of the cutter on the work table, then bear down with my entire body on the other arm of the cutter. This works, but I pity the person who expects to cut 3/8-inch rod. Bottom line, I'm somewhat disappointed, but just not quite disappointed enough to return the unit.",
        "These are pretty heavy and were difficult to open for the first use. I had to get a wrench out to loosen the joining bolt to open then re-tightened within a torque range that worked easily for me. They cut through chain link like butter, but will not make a scratch on our padlock that we've been trying to remove off a gate since we purchased our home. I used this to take down a chain link fence that had been cemented into the ground and it made easier work of it. Guess I'll need a saw instead.",
        "It's heavy. The 8.6 lbs in the description should not be taken lightly. So you definitely need to be comfortable handling a heavier weight. But it does cut and once I figured how to maneuver this thing it cut through 1/4' galvanized steel chain very easily. I'm happy with the purchase and does seem very durable. I think you could find something lighter and easier to handle, but it would come at a higher price. This thing doesn't mess around and really is heavy duty. Recommend for any large bolt cutting or thick steel chain cutting.",
        "We were cleaning up around some old farm sheds and wanted to move a cattle panel that had box elder trees growing through it. The trees actually grew around the heavy gauge (about the gauge of a medium-sized padlock shackle) wire of the panels, so the wire was deeply embedded. I was able to chainsaw the trees around the panels, but ended up with big logs still attached. With this cutter, I was able to quickly snip the wire and separate the logs from the panels. Definitely heavy duty. Great purchase for us.",
        "Got this for my daughter to use to take down some fencing. Moly steel should be very hard and durable. She said that it worked great at first but that it got dull quickly. I asked her how she was using it and found out that she was using the very tip to cut wires close to tee posts. That is not really how it is intended to be used so I'm yet not sure how it will work when used properly.",
        "These are useless. Wont completley cut the weakest of locks, did make a small dent on a U-lock, not even a 1/4 way in, but the cutter was not \"damaged\" so to speak. which is why i gave it 2 stars.",
        "I own a pair of 30\" Rigid bolt cutters that failed to cut a grade (or whatever they use) 8 Master Lock padlock. The blade on the Rigid cutters actually snapped. These Neiko cutters on the other hand crushed right through said padlock. There is some deformation on the blade, which was a little disappointing after just one cut. At 23 pounds these are a little awkward to position, but they got the job done with minimal effort on my part.",
        "I bought this to cut fishing hooks while shark fishing. The hooks I used are stainless steel size 12/0, not that big and this tool should have cut through them easily. The first time I used it the blades were denting as I struggled to quickly release the shark. Finally, after numerous attempts it cut through the hook but not before the blades of the bolt cutter were completely buggered up. They claim to be steel blades but had the property of lead. Very disappointed.",
        "These worked great! Cut 2 large master locks like butter. I was expecting it to be a little tougher but pretty easy. They are on the heavy side (as they should be) but not overly difficult to manage. The locks were corroded on my outboard motor that's installed on my boat. I hung over the transom and managed OK.",
        "14\" bolt cutters: These are fine quality for the price. The 14\" size is small enough to fit in a portable tool box and strong enough to cut small screws, nails, bolts etc. so you can resist the urge to use your pliers to cut things they're not meant to. Note that the maximum capacity for all of these bolt cutters is clearly printed on the jaw. In the case of the 14\" version, it's 5mm (approx. 3/16\") so choose the correct size bolt cutters according to your needs.",
        "I purchased this to cut a forged lock I had lost the key with! This lock was a special forged steel! I had beat on it until blue!m searched everywhere for the key! Nothing could break this one tough ##XX%$! That is until this bolt cutter! I snapped it off in nothing flat! Most amazing part? The boltcutter's teeth were unharmed! Thanks Neilo and Amazon!",
        "Not the best quality. I bought this tool to cut framing nails behind vinyl siding. The jaws started to show wear after cutting just a few nails. The jaws should be hardened steel - they are not, so this tool won't last long.",
        "If you like absurdly over-engineered toys, this is for you. I've tested this out on several locks and chains around the house, and there's barely any marks of wear on the tool itself. It's very solidly built, and sits in the back of my truck now. That being said, this thing is heavy, and would be somewhat unwieldy if you have a small armspan, or are a bit shorter. Overall, great tool. Cuts locks like butter.",
        "We somehow managed to fit a king size mattress down the stairs to our basement but when we tried to get it back out it proved impossible. We needed something heavy duty to cut the wires of the frame and these were very easy to use. We were expecting to pay a lot more for the quality of this product, very pleasantly surprised!",
        "I bought this because the keys had been stolen to my trailer, and it had 6 padlocks on it that had to be replaced. I cut all 6 locks off and replaced them with new ones in only 5-10 minutes with this tool. It is very sturdy and has enough leverage to get through the locks. It is pretty heavy and does take some strength to squeeze through each lock when cutting. I was very satisfied overall and you can't beat the price anywhere. Excellent bolt cutter!",
        "I purchased this product specifically for cutting a padlock I had lost the key to. However, when I squeezed the handles together the lock was completely unaffected and instead I was left with indents on the blades. I tried three more times with the same results. I'm giving this product three stars in light of this because I should have known that you get what you pay for, especially when it comes to tools.",
        "These are mega sturdy. I used them for the first time yesterday. Someone who lived on my land previously had left a fence behind in my woods. It had fallen but not detached from the fence poles. I was able to easily cut it loose and remove it and even recycle it.",
        "I had a chain link fence that I wanted to cut down into smaller pieces to fit in my garbage can. These bolt cutters worked perfectly for cutting the fence. I didn't have to use much force and was quickly able to cut down my fence. The bolt cutters don't look beat up and I'll absolutely use them on future projects.",
        "Just kidding about the ocean liner anchor chain- BUT it is capable of cutting any large chain you're likely to come across. They are large and heavy, hence the 3 stars for \"easy to use\" category, but they need to be to be capable of bigger jobs and offer good leverage for cutting.",
        "These work great -I can't think of a lock they can't cut but they are quite heavy and hard to use on smaller locks - because it's hard to fit them into a good cutting position - but once there, they work easily and without much effort. Understand that they are heavy to hold and use.and a little awkward when there isn't much space. But, once in position, again, they were perfectly and easily.",
        "This will cut chain link, but I needed to cut through some chains and a modest lock. Failed. Returning to Amazon immediately. This cutter doesn't come close to meeting its advertising claims. And keep in mind the jaws only open to ~ 0.375 in. Think I'll have to spend at least twice as much if not more...",
        "this thing is total junk. Assembly was so sloppy that the jaws did not meet. The jaws are of some softer material, not chromium molybdenum steel. There is no way that this thing could cut the chain pictured in the product description. I tried to cut a 1/8 inch multi-strand stainless steel wire with it. Failed. It would not do a clean cut and could even chew through the wire with multiple cuts. This 18\" Bolt cutter was able to cut a 14 Mil copper wire, that's about it. Oh, probably cold butter too.",
        "You would be hard pressed to open these wide enough to cut a 1/4 bolt. They may do good job on small items but so will a good pair of linesman pliers If you need bolt cutters look for larger ones",
        "Bought to cut wire shelves. Works great. Probably would have been easier if it was longer but we were also looking for something that fits in an emergency kit once done with shelves. These cut clean through without having to cut at the shelves several times.",
        "I used it for the first time after being stored in my shed cabinet for almost a year. Still shiny and looking new, I tried to cut a Masterlock padlock from my gate that would no longer open. It couldn't cut through lock. The jaws just bent around the lock, but it did manage to mar the surface of the lock somewhat. Now the 36\" cutters are trash after one use. I'm not sure what kind of metal it's made of but the Masterlock steel seems to be far superior.",
        "Cut through a standard padlock with a minimum of effort. Barely left a mark on cutting area. I bought it to cut a padlock and that is all I have used it for.",
        "I got this to modify my closet shelves and wondered what else I could use it for. Who knew my husband would find it perfect for clearing horrible vines that are all over the yard of our new home in GA. We have a wooded pine tree acre and these vines are huge and thick and kill the trees. He says the cutter goes through them like butter. If they can take care of the vines I know they will handle whatever you've got.",
        "These are the best bolt cutters I've ever used. I work at the Fred Meyer Distribution Center (Kroger Foods) in Clackamas Oregon and cut the bolts off shipping containers (about 10 daily) on a frequent basis and they cut with little effort. A very must have for industrial work!",
        "Had to cut 60 threaded 10mm rods. Handled the task well. Whatever reviewers said it couldn’t cut probably didn’t put enough force into it. No it won’t cut a large diameter piece of metal with the tips of the jaws. And it won’t work without putting a little effort into it. You’re cutting metal here not butter. This cutter is a good value for the money",
        "I was fooled by the reviews on this item. I didn't notice that all of the 5-star reviews are for the 30 & 36 inch sizes. The 12\" must be for super small items.",
        "This wouldn't cut through a standard Master lock school kids use. Not even close. Also, the jaw bolts are extremely difficult to adjust, making it much too difficult to adjust the jaws. There must be better products on the market.",
        "These are big, heavy, and sturdy! Haven't been used extensively (who goes around cutting locks on a regular basis?) but have held up so far. Made quick work of my old half inch lock with a lost key.",
        "Works like a charm. Cuts through anything like hot knife through butter. It's quite heavy, so don't expect to operate it smoothly all on your own unless you are a clone of Arnold Schwartzennegar. My hobby is in metal working and I cut through 3/4\" thick iron rods like it's no problem.",
        "They got the job done for sure, used em to renew my couch on the 9 gauge wire i needed cut, worked great for it, now i use it in the garden for chicken wire that needs cut to make my own trellising. who knows what else i'll be using these bad boys for.",
        "If you ever need to break out of prison, this is the tool I will have. Chain link fence is no match.",
        "Seem to be good quality cutters. No issues that I can see. So far I'm happy with them and I would recommend them. Assuming they hold up over time I have no complaints.",
        "Had 2 Master locks that were not opened for over 10 years and no longer responded to their keys. To get better leverage use both hands on one handle and prop the other handle against your body. I also recommend to use eye protection as one of the locks had a piece fly off when cutting. The jaws still look good after cutting..",
        "I got the 12 inch and it works good on thin chains, screws and nails. It fits nicely in my tool bag. I accidentally left it out over night and it didn't Rust immediately.",
        "I bought these since I'm a trucker and need them to break high value seals before I back a load onto a dock to get unloaded. I thought these would be overkill, but they are perfect for breaking the seals on the trailers. They are a bit heavy but they get the job done.",
        "Firstly, it arrived used and worn out, as if someone tried to use it to cut something, and whatever that object was, it had clearly won (see picture). Tip was dented, flaking and chipping. Poorly manufactured, returned it same day. Ho to your local hardware store for a real one, this one is just a heavy, dangerous oversized toy.",
        "If I can get these around the part, I will cut it. Don't try to cut hardened steel. Chains, padlocks, most bolts are fair game.",
        "This tool is real junk! It arrived with the coating is peeling off, the blades do not align properly, and the stops do not align properly. I will be returning it.",
        "I've been wanting large bolt cutters for years, and now I really needed them. For the price this are fantastic! I cut through a cable lock and didn't even know it was there. For the occasional emergency use these are great. For daily use, you'd probably want higher quality metal but I don't even know where to get non-Chinese tools anymore without mortgaging the house. These are equal to or better than the big depot stores for much less money.",
        "I am doing some repair and upgrade work to my Motorcycle. In order to be able to upgrade to adjustable push rods and not have to unnecessarily disassemble the upper portion of the engine I need to cut the old push rods to remove them. These bolt cutters cut through the 7/16 \" push rods like they were made out of paper. Excellent tool. A lot less pressure was needed to do the job than I thought it would. If you need a very good heavy duty bolt cutters reasonably priced please buy these! Thank you. J.D.",
        "A standard password master lock from Walmart was no match, but it still dented the blade of these \"heavy duty\" bolt cutters.",
        "Product arrived quickly, unfortunately it wasn't even able to cut through a normal sized stainless steel teaspoon (the handle). Maybe it's only for use on chicken wire.",
        "Barely adequate for the job. The only good thing was the price. I only got it for just one task so I wasn't looking for a quality item.",
        "Had to cut a lock nut off my daughter's tricycle in order to straighten the rod connecting the two back wheels. This made extremely short work of it. I mean, I found the right angle and then a second later was done. That's the entire reason I purchased this particular bolt cutter and it worked beautifully. I'm sure I'll find more uses for it ,but for the time being that's what I bought it for and it worked perfectly.",
        "I had a box spring mattress that I was too cheap to take to the dump so I slowly cut it up and put into my trash. Worked great. Very sharp and strong.",
        "This item was sold as a \"bolt and wire\" cutter. Dunno whether it cuts bolts. It does NOT cut wire.",
        "Did what I need it for. Lost a key to a uhaul lock. It was hardened steel and pretty thick(about 5/16\"). It is pretty heavy. I had to put one handle on you leg to support and use my arms for the other handle to close it. Basic will smash it before the lock was cut/broke.",
        "Worked great for cutting my tomato cage and other gardening wire. Excellent leverage and smooth cut.",
        "Functioned as advertised, strong, well built. Needed to take off several locks that I had lost keys to and it worked like a champ on each lock. Quick delivery at a reasonable price.",
        "I would invest a little more $$ in a better pair. They won't cut through handcuffs very well.",
        "I needed to get a 3/8\" thick U-lock off my bike because I lost the key. I tried a bunch of other techniques people posted on YouTube and none of them worked. So I bought this heavy duty bad boy and cut through it with less than 90 seconds of effort. It was awesome. Keep in mind I am a 200 lb man, and it did require some effort, but from the moment I engaged the blades there was never any doubt I would cut through it. Very satisfied.",
        "This tool is a beast. Cut a master lock like butter. Only deducting one star because of small manufacturing flaws that one just expects these days(blades aren't perfectly symmetrical).",
        "Only works on very small bolt locks. The blade is very soft metal.",
        "Would give a solid 6 stars but limit is 5. Cuts thru locks and lock pins with ease I love my ee tool.",
        "Especially useful in areas where sudden strong wind can arrive.",
        "Cuts through chain like butter. I'm not sure what the limits are on this thing, but so far I haven't come across anything I couldn't cut through. I don't do any industrial or heavy duty cutting. I probably wouldn't use this for stealing bikes. It's pretty big and I'm already pretty slow. That and I'm 35 and don't ride bikes anymore.",
        "Needed this to cut out an old wire fence entertwined with trees and bushes, stuff I have killed with roundup. Piece by piece, really. So far, after ruining a few other tools, I am totally satisfied with the performance of this one.",
        "These are big and heavy, probably best used as a two-man tool, though I managed to make it work by myself. They will cut pretty easily through just about anything that fits in the jaws. I got this item because a bolt cutter is the kind of tool I only occasionally have a need for, but when I need them, I need them to be sure of getting the job done.",
        "Neiko makes good stuff.. But this was just \"okay'. I think it would work for a lot of scenarios. but is definitely a \"basic\" model. It doesn't cut some things that are hardened.",
        "Seem good we’ll see if they work on locks. Very heavy.",
        "Didn't realize how big these were. This bolt cutter is really designed to be used by two people when cutting. This is a tremendous value compared to what you will find at the local Home Depot for the same price. If you plan to use this as a one man operation, get something smaller.",
        "This bolt cutter may be good at cutting bolts but I don't know as I have not had any bolts that needed to be cut...yet. I have however cut some metal wire shelving, nails and other similar stuff. Most of which actually needed to be cut and was NOT simply cut simply because I had a new bolt cutter and spare time.",
        "This works exactly as described. It saved us a call to the locksmith when we loss the key to a padlock. The only downside is that it is big and heavy. I'm not sure where we will store it.",
        "This was useful it helped me and I still have it",
        "I had a rusty chain link fence in my yard that I wanted to replace and these cut through it like a sharp knife through butter. Though I would caution that these are probably not the best for extensive use as they do require alot of strength--i.e., while they cut through metal easily, they are quite heavy. In retrospect, I probably didn't need to get anything as serious as these, but they'll probably hold up for quite a while and cut anything I'll ever need to cut.",
        "The grip is great. It is very heavy duty. We have very complicated locks and this is great. Its very sturdy and its not at all dull after using it so much. Great buy.",
        "Came on time, but the quality is very low. I tried it on a small master lock that I lost the key to and it had no chance of cutting it. It actually made divits on cutting section.",
        "A bit big, but this will cut through almost anything. When I got this, I was just looking for anything to cut through a..tree limbs, bolts, screws, nails, locks, etch...... real fun. Be sure to open up the teeth",
        "I bough this cutter to cut a padlock that I lost its key and didn't do the job. Is possible that was not the right tool for that job.",
        "Always a need for a bolt cutter works great when cutting padlocks that you lost the key to.",
        "It says right there in the title that it's heavy duty, but until I got this thing in my hands I didn't realize that it really was. It's hefty, and looks menacing, like something the A-Team would strap to their van wall. It cuts pretty good. I only used it to cut a light weight swing set chain, and it/I did so with only a slight grunt. Well worth the price, and a good thing to have around as one of those \"I wish we had a bolt cutter...oh wait we do!\" items.",
        "I purchased the Bolt Cutters to remove a bike that we had U Locked to a pipe in front of our door, but subsequently lost the key. This cut through it with some effort, but it was safe, and didn't damage the bike. They are heavy, and seem to still be in good shape.",
        "Works great; my advice--pay the extra for the 36 inch version, as the extra length will make cutting smoother and more effective. Only negative might be the weight--a tad on the heavy side, but still worth the price as long as you are not using it for extended periods.",
        "Huge!!! I love the weight behind this bolt cutter. This will cut through just about anything. Love it!!!",
        "I'm a yard switcher and I use these every night on the job. I've only had them about a week, but so far they have been getting it done. Cut through bolt seals on trailers like butter.",
        "I truly don't thing there is such a think as bolt cutters that will cut a padlock without marring the jaws, but if you buy the 36\" like I did, it will cut whatever will fit in the jaws...",
        "I thought they would have been great and received them ontime but they were too hard for me to use. I needed a bolt cutter with MUCH longer handles in order for me to be able to use them. I returned them without any problem.",
        "Although it didn't come with instructions, I LOVED it! It worked. It wasn't the size I asked for but still it worked!",
        "Great product that easily crunches chain, locks or whatever you put in its way. They are a little heavy but as long as you know that, you should have no problem. If you are an average strength man or above average female, are doing a few to many cuts...you will be fine. If you are not one of the above and will only make a cut or two at a time, you will be OK as well.",
        "Have not used them yet. But it's always better to have them for insurance because the day you DO need them? Is NOT the day to need to buy them. The quality is amazing and I can tell that when it IS time to bust them out? They will do the job.",
        "I used this to cut pieces of 9 gauge steel wire, which is thicker than chain link fence wire. I'm glad I got the 14 inch version, the extra leverage really helps.",
        "WHEN I GOT THEM I SEEM THE THE END THE CUTTERS WEREN'T THEM LENGTH AND OPENED 1/4 MAYBE ETC.",
        "Jaws didn't open wide enough to cut large bolts. Product is very heavy"
    ]
}