{
    "entity": "Bolt Cutters",
    "text": [
        "I bought these \"bolt cutters\" with the idea I would work on a small project, nothing that would exceed the 5/32 inch capacity of the cutter. The Amazon box came today and I eagerly opened the box and pulled the bolt cutter out. Now, I wish I hadn't and just sent the box right back. The pictures attached to this review were taken within 30 minutes of using the \"bolt cutters\" on something no thicker than chain-link fence. That large-sized chuck missing from the right blade make cutting next to impossible. These were not \"bolt cutters,\" just glorified wire cutters and now they can't even cut a rug if they were dancing with Ginger Rogers.",
        "This bolt cutter simply doesn't open up. I'm a pretty big guy and I had a hard time opening the cutters. I tried using wrench to loosen up the bolts but it was literally stuck there. I complained to the seller and he told this is not a first time this has occurred with Tekton. He gave me a prompt refund and said there wasn't any need to return these bolt cutters back to him and he'll be notifying Amazon of this issue. How Amazon continues to sell this clearly defective bolt cutters is beyond me.",
        "The plastic they came in cut my finger, but these cut through nothing. I bought this for work, and it will not do the trick. Had I kept it's original packaging I would have sent back already.",
        "Only cuts very thin gauge objects, thin wire, etc. Purchased these to cut the ends off of some very thin screws, didn't even make a scratch on them.",
        "When I received this, I was disappointed because the description said it can cut up to 3 inch of bolt for this small cutter...I needed to cut some thick chain links from my purse to replace the worn out handles (about the same material and size of a gym locker room lock). I'm glad I gave this a try because it actually cut it (with a lot of pressure and adjusting). I just thought it'll open wider, but it still worked. You just have to keep adjusting it (cut it a little, then move it back...then repeat till it cuts off).",
        "They are MUCH bigger than I anticipated! Holy cow! It might have just been a miscalculation on my part, but that may be an important factor for someone with limited storage space. They are big, bulky, and heavy. HOWEVER, I'm confident they could cut through a solid steel door! They sliced through chain and a padlock like butter (seriously, I had to check if they had even cut yet, it was so smooth). They cut through a fence door of unknown metal just as easily. The only reason I didn't give it 5 stars all around was just because of their size/weight. I will never need another pair of cutters ever again!",
        "I got this to cut k26 springs for nerf gun modding. It would cut only after tearing up my hands from pushing down with my weight against a solid wood table. It would take multiple times to do this. These are pretty much useless to me. My small wire cutters work if I need a smaller spring or wire cut. Very disappointed.",
        "Was fool by the best seller tag am doing better research next time I wasn't able to cut the small wire as shown in the pictures. I definitely hurt myself trying to use it. Would not recommend this brand to anyone waste of money and time.",
        "I am a board member of the local community land trust. Some of the land that we are blazing trails through have a number of old barbed wire fences scattered throughout. The wire cutter that I had at home was not able to cut barbed wire. I was hoping but not convinced that the small TEKTON 8 inch bolt cutter would do the job but I wanted to keep the weight in my backpack as low as possible. Well today it proved itself. It cut through the barbed wire and I am a happy camper.",
        "I used this the 36” to cut one of the Masterlock padlocks that allows you to set your own letter/number code and it was a lot harder to slice through than expected! We managed to get it, but not without a LOT of pushing and putting both of our weight (me and my husband) against the cutter. This is the only thing we tried to cut through, so I don’t want to take off any other stars. If we try anything else I will update the review! It seems that anything thinner than a padlock should be very easy to cut though!",
        "You do get what you pay for. I've had them 4 months and they are at or near the end of their usefulness. I primarily use them to cut annealed wire and 1/8\" steel and aluminum rod, and the occasional 6, 8, or 10 sized bolt. The cutting surface don't align any more and will slip off around the material instead of cutting.",
        "Got this to chop some old padlocks that are inoperable. I know these are BOLT cutters but let's be real, most people use them on more than that. These cut the first lock like butter, utterly failed on the second. The jaws twisted and dented leaving me with a junked pair of bolt cutters. I'd recommend buying a pair with tougher jaws (probably Chrome Moly) or more sensibly just borrow an angle grinder to cut those locks like I should have done.",
        "I needed to cut wires on a tomato cage, which are not very heavy duty. These were not much easier than using just a pair of pliers. They were a little easier than pliers, and did not cost very much, so I am not displeased with them.",
        "Probably good for cutting smaller stuff but for my purpose I wanted to cut a very small luggage lock made my master lock. Eventually I got there after multiple tries and a lot of force. I dunno maybe I'm just a wimp but I'd probably go with something bigger to handle tiny locks.",
        "I ordered this bolt cutter because we have a couch we are cutting up to fit into our city trash cans so that we don’t have to haul it to the dump. There are metal springs attached to the wood on the couch. I wanted to use this to cut them off instead of using a metal saw blade in the saws all. Unfortunately it did not work. Maybe I am just not strong enough to cut through it, but either way I was unsuccessful. For reference the springs are about the size of a pencil head eraser. So not that thick of a cut. Disappointed because they seemed so strong and it’s a nicely made tool.",
        "This is a little 8 inch bolt cutters strong in the dickins when I first received it I almost flipped small but cute but I knew you couldn’t do the job so I tried it out on some cattle panels because through like butter impressed so then I want to the chain-link fence now that’s when I was sold lock stock and barrel I Had a little smile on my face and I was thinking when I made another good deal with Amazon I just keep winning and winning and winning so if you’re looking for a good product by just one you won’t be sorry",
        "I'm not sure what these are good for but cutting small aircraft type cable is not it. Don't waste your money. I ended up replacing them with Knipex 71 12 200 mini bolt cutters. They cost $54 but work perfectly.",
        "I needed a tool for a project requiring 150-200 cuts of solid galvanized 3/16\" wire. This is indeed a heavy duty cutter. It took no more gripping power then a handshake to get the job done. Very comfortable handle grips and the nice adjustment screw to keep the blades at the right distance for the material you are cutting. I contacted the manufacturer for advice on cutting stranded wire 3/32\". The customer service person (Dave) was incredibly helpful. Tekton products are a great value. Maybe most of the tools are manufactured outside of the USA, but they clearly have best practices for quality control.",
        "They look nice.. They are afforadble. But they are not mini bolt cutters.. i tried cutting a small bolt the size of a q-tip once i recieved these.. could not cut threw it if my life depended on it.. the mouth on these barley opens.. should be called wire cutter... and thats it.",
        "They failed after the first 6 hours. Bent on (cheap) springs from a mattress. I wish I could tell you I have deaths grip but sadly I do not. Not worth the money or time to ship back.",
        "I have made about 50 cuts of 10 gauge concrete reinforcement mesh with this tool. It takes some pretty decent effort to complete the cuts, sometimes taking a second \"bite\" then squeezing again. I recommend wearing gloves, as the handles can dig into your hands when the required pressure is applied. The \"teeth\" have held up well so far. Perhaps the manufacturer could use slightly wider, more comfy handles on the next series.",
        "I bought the 8\" version to cut some 9 ga galvanized wire. I should have bought the 12\" for that task as this little thing has barely enough leverage to do the job. The main reason I'm only giving three stars is for the design of the plastic molded handle. It is very uncomfortable to hold, especially when cutting through something that pushes the limit of the tool. A smoother plastic handle would have been much better. Not sure what they were thinking with this ribbed design. As far as durability, time will tell but I've cut about 100 lengths of 9 ga galvanized steel wire and it's holding up okay so far.",
        "I bought this to cut 12 gauge galvanized steel wire, which it does easily. I tried to use my standard wire cutters and it was hand-hurting difficult! These make all the difference in the world. Anything thicker than 12 gauge wire and I would recommend looking for something heavier duty.",
        "Bought purposely to tear down an old mattress box spring and it worked wonderfully. It cut through the spring wires in the mattress box and it made the job alot easier. Just a Heads up, per my husband, the blade on this cutter are not sharp therefore these are made purposely for bolt cutters and only specific things. It does not apply to cutting anything and whatever you feel that needs cutting. May need to look into the Mfg specs and understand further details of usage.",
        "GREAT for cutting wire and nails. Sort of like a big pair of side cutters. You have to get the right tool for the job. Read the description to understand what the tool is designed for and the other reviews saying what the tool will and won't cut, and they buy it only if it's what you need.",
        "This things are heavy but are built like a tank. I haven't cult a bolt yet, but they cut through fence like a hot knife through butter. The major drawback is the weight of these which makes quick and easy use a challenge. Shipping was slow, but the item arrived and was excellent.",
        "I bought these to cut several thick screws that were sticking through the roof and walls of my treehouse. I chose the 12 inch size because I was working in tight areas. They performed beautifully at doing the job and they saved me a lot of time not having to use a hack saw which is what I started with.",
        "This is a FANTASTIC bolt cutter for light to medium jobs. It cut though heavy 5.8\" chain like it was warm butter. The quality of the cutter itself is evident as soon as you pull it out of the box. Best part about this purchase is the price! For bigger jobs, you will want to pick up the larger TEKTON cutters, but even those are priced very well. You won't be disappointed.",
        "I got this to cut the cord for my computer locking cable. It did the job, but I had to use some scissors to finish off the last couple threads. The product doesn't close completely, but I don't know if that's really *needed* for actually cutting bolts. I found the better tool for my needs is a wire/flush cutter, as it actually closes completely. The only issue with this is that, being a cheapo 8-inch bolt cutter, it's hard to get enough torque on the short handles to obliterate the thing you are cutting.",
        "The bolt cutter (and another item) arrived in just ONE DAY! WOW! Tool is precisely as described. The return-to-open spring will be especially helpful for our projects. An experience update: took worked VERY well when cutting 17, 16, 14, and 12 gauge steel wire. Also used effectively to cut 12 gauge and 1/8\" dia steel links. Grip is comfortable",
        "I bought these as an alternative to carrying around heavy bolt cutters when I am working on fencing. These worked ok at first, but then they started to become stiff and hard to open and close...I have lubricated them with WD-40 and other heavier lubricants and am still having a problem...",
        "I got this to cut two 1/6\" bolts under my trailer. Could not do it. It would have worked if I had 2 half-inch diameter x 12\" metal pipes to put on the handles. Lacking those, I used a large pair of channel-lock pliers to squeeze the handles of the bolt cutter. It worked fine and the cutter was undamaged.",
        "The bolt cutters are a very nice size and that is one thing that I wanted, however, they do not cut easily. It takes many tries and a lot of pressure and manipulation. They would work well for thin wire or thin metal cutting. They just don’t work well for what I needed them to do.",
        "It's not without its flaws, had to adjust it (which was more of a challenge than I was expecting), but after some setup, it works great. It works REALLY great when you factor in the cost",
        "Purchased the 36\" for a master lock that the combo was lost it went through it with very little effort and no damage to the jaws not even a slight deformation rubbed some paint off that's it",
        "Bought 30-inch model to cut off two ABUS 64TI/40 Titalium Aluminum Alloy Padlocks whose keys were no longer around. Two give-it-all-that you've-got attempts, two notches on each bolt cutter blade. The bolt cutter cowered. The locks wickedly laughed. I guess I'll have to find other less strenuous tasks for them, as they are now non-returnable.",
        "I use it to cut wire for small concrete patches. It fits in one hand well, but it’s not heavy enough to cut without considerable effort. I’m not a small dude. 6’1, 275- retired military. When it does cut, the handle design is terrible. It pinched my hand every single time.",
        "I use it for cutting 3/32 and 1/8 tig filler wire, does its job. I have been using for 1/2 year 30 hr weeks, no sign of failure or compromise yet. I don't think I would use it for cutting bolts or anything tho, just another cheap Chinese made tool",
        "The best insurance policy to keep in your tackle box especially when you have a treble hook in your pinky and the other end of the plug in a 10lb Blue Fish, and nothing to cut one of the hooks. That really hurt, trust me and if you know blue fish that size they don't lay still when landed.",
        "I have been using this tool on a project consisting of cutting 12\" pieces of Stainless and Chromalloy TIG welding rod and it works great and snaps a nice clean cut. I think the reason some people are having trouble, is in the adjusting of the screw for the closing gap for the material that you are cutting. Touching close for soft material (1/32') and for hard (1/16\") or (1/8\") for snap rod.",
        "I have other Tekton products and this isn't one of there better ones, very poor quality, only good for cutting soft cables and wires.",
        "Would barely cut 3/16 wire. It did cut eventually, but there just wasn't enough leverage to make it a useful tool. I had to squeeze until my hands hurt, take a break and go back and squeeze in the dent that was created. After 4-5 cycles, it finally cut through the 3/16 galvanized wire. Most of the black finish was rubbed off of the cutting edge in the process.",
        "I bought the Tekton 8-inch Mini Bolt and Wire Cutter to hack a roll of heavy remesh (concrete reinforcing mesh) into rectangles. It worked, and for a one-time job, I was satisfied with the tool. But if I had to do this job every day, I'd go back and buy a larger size cutter of the same brand. The eight-inch Tekton is quite robust, and it held up under the abuse I gave it, but it requires too much effort when hundreds of tough cuts have to be made.",
        "Unsatisfactory quality control. Arrived with a screw almost detached. I screwed it in as far as I was able with my arthritic hand, as I don’t have pliers. It works, but I expect products to arrive in perfect condition. I would not settle for less from a hardware store. Given the difficulty of returning an online item, I want the merchant to get it right the first time.",
        "Bought this to put up fence for a dog pen because I was tired of using the old diagonal cutters. These mini bolt cutters were so much easier to use. They are not going to cut heavy gauge stuff because they do not open wide enough but they work as advertised and for less then 9 buck you cant beat the time and frustration it saved update having used these a dozen times over the last year, they still work great. cut anything that i have tried with them as long as it fits in the jaw opening",
        "These things were a lifesaver for me. Cutting think hobby wire and metal. Works awesomely. My only gripe is that the space between the blades is limited, so I can't cut off fingers when customers don't pay the vig. Just kidding. I don't gamble, so I have no idea what a vig is.",
        "Bolt cutters at the big box stores cost a fortune. These are much less expensive and are working great for me. I've never tried to cut anything really tough with them (biggest thing is 1/3\" wire) but they are smooth and cut like crazy when going through some pretty tough wire. Things that cutting with a wire cutter (side cutters) is nearly impossible are simple and easy with these things. I typically buy the \"expensive tools\" at the big box stores, but, for something like this that I'm not going to use very often; this has been a great savings. Very happy with it, I'd buy them again in a heartbeat.",
        "My old wire cutters bit the dust and I bought these to replace them. I've had to wrap my trees with chicken wire to protect them from the beavers that have just moved into our lake, These wire cutters are so easy to use and really do the job. I also have to cut different gauges of wire for various craft projects, and these have really worked on all of them.",
        "This is great HEAVY duty cutter for those big job. While it cut my floral wire if you are not strong or have carpal tunnel its a tad heavy so it may get exhausting. Like ut did for me. I'm going to keep it because every tool box needs a heavy duty cutter. But i will still need to find a smaller ergonimic precision wire cutter.",
        "These are more like powerful scissors. The spring action is very nice. Not going to cut paper or anything like scissors would. But kind of feel like a pair of scissors in your hands. Great tool.",
        "Wanted these for salt water fishing to fit in my pier bag or for use on the kayak. Easily cut 3ot hooks and impressed it broke the big 6ot for sharks. Did notice some paint chipped where the 6ot hook had snapped but cutters didnt have any divets or dents and held up.",
        "Similar to other reviews: Pro: the price Con: 1. required a much more strength to cut nail compare to other Compact Bolt Cutter with similar spec 2. The handle is not very easy on the hand. This made the tool useless. I would buy it for the price if you only use it for one or two cut every once in awhile. However, if you only use it for one or two cut might as well use other tool.",
        "I bought these because there was a five plus year old master lock on my outdoor fence that had rusted through. After reading a couple of the reviews on this product, and because of the reasonable price, I decided to order it. I had my very strong nephew cut the lock and he did struggle a bit getting that lock off,but these worked. I can now once again open that part of my fence. These held up to that lock and I'm sure this will easily tackle any other project I may want to use them for. Definitely a great buy.",
        "They are surely solid little things! I bought them intending to cut thicker wire easily, but I ended up snipping off some fence nails with them, though, if I was doing that regularly I would have gone with the larger 12\" pair, but these work fantastically. I bet they would easily eat up a chain link fence (haven't tested it for this use or type of metal... please only do so if installing or repairing chain link fence!)",
        "My husband and I got these to cut a size 9 gauge galvanized wire and I thought we would be able to use them to cut this and it won't even go through the wire. It will make little dents in the wire, but you have to use a massive amount of force to even get it to a position where it will cut through. I am giving this 3 stars though, because we have had smaller wire that has needed to be cut and it works wonderfully. It also cuts through zip ties like a charm!",
        "I bought this to cut some old barb wire on the property we recently purchased. It eventually did the job, but at times I had to use both hands to squeeze the handle. In fairness to this product, it is a small hand-held cutter, so you will not get the same leverage that the larger cutters have. I would not recommend this for any jobs other than cutting wire.",
        "What I hate are wimpy wire cutters that are hard to use. This tough guy, however, makes cutting wires a breeze. While I would get a bigger tool for cutting actual bolts or padlocks, there's no reason to have anything smaller than this tool since it's compact and punches above its weight.",
        "I bought these, based on previous reviews, to cut ventilated shelving. It does cut the small \"wires\", but not the fatter ones. For $8, I figured I was taking a chance. I'll keep them because I'm sure they'll be handy for crafts, and small projects around the house, but they will NOT cut ventilated shelving. They look fairly well made, though.",
        "I bought these to cut the heads off screws (long story); the screws were at mostly 1/8\" in diameter. The product description said these bolt cutters could handle up to 3/16\" - but they would not cut the screws. Barely put a dent in the threads. In retrospect, I probably ought to have realized such a small tool would be unlikely to work, but I trusted the description. For what they are, they seem well-made enough - they'd probably be fine for something soft like copper wire, they just ought not to be advertised as a bolt cutter.",
        "Just an ok cutter. Needed to cut some a piece of aluminum (maybe steel) rod, but the problem is that the jaws don't align perfectly and it misses to cut on smaller items. Unfortunately had to return it.",
        "Got 14\" to use for cutting wire shelving. It took me about four tries to get through one of the thicker parts of the wire shelving. So I had a kid come help me, who is starting his trainer / body building career. He was able to get through all the rest of them much quicker, but said it was still very difficult for him. I would recommend larger bolt cutters for wire shelving.",
        "I had to replace a set of basic wirecutters that came with a multi-pack of tools, which could bare cut through a bicycle cable. Soon I'll need to remove some barbed wires on top of our backyard fence. I got this since it was a top seller plus the reviews seemed like the Tekton was fairly capable and way beyond my limited use. If it can fit in the jaws, it's gonna get cut!",
        "I purchased these for a different type of project than they're generally used for. I ordered some steal corset boning I had to cut down and my small jewelry wire cutters were not up to the task. These worked beautifully!",
        "Tekton has done it again! For home tools these are all I buy now. Just as good as snap on but without the price! They are fairly new company, so their prices are perfect! Highly recommended!",
        "I bought these for the purpose of cutting multi-strand bare metal cable, which is about 1/8 inch in width. At first, it didn't seem to work and chewed up the wires, but the problem was really my technique. I started wrapping the area to be cut in masking tape and bearing down on the handles--manhandling them, if you will. Bam and pow! The cable was cut in one press. In hindsight, the smaller cutters would have done the job for this cable and the slighter larger size cable that I plan to get. Still this size is very versatile and there is no telling what uses we will find.",
        "I bought these to cut vinyl coated metal fencing. I have over 50 ft. of chain link fence that's loose enough at the bottom for my dogs to squeeze out and I needed to reinforce it. These cut through the metal like butter. I also used them to cut the vinyl ties that secured the vinyl coated fencing. A great product!",
        "Cuts 14 gauge wire no prob. If you are going to be making numerous cuts on this gauge metal (in excess of 50 cuts), you may want another tool, something with a spring assist or something as your hand may start to hurt from making too many cuts in a row. But in does the job and very good price! Shipping was fast as well and is as advertised.",
        "I tried using regular wire cutters to cut the strings on my guitar, but they did not work. So I got these mini bolt cutters instead, and they did the job very well. I don't think that they have the size and leverage to cut open steel locks, but they work well for my purposes.",
        "Bought this to be able to cut through heavy-gauge woven wire mesh fencing (galvanized steel) to make my own tomato cages. I am not sure of the gauge, but the thickest top wire is 3 mm. This tool JUST cuts through it, and I have to use two hands. It works, so I am not complaining, but it's not going to cut through BOLTS of any kind!",
        "Good as a wire cutter, not so good as a bolt cutter. It cuts brads and small nails but will not cut 16d nails, generally soft steel. Worth the low cost, in the vein of you get what you pay for.",
        "This bolt cutter is small, decently weighted, and strong. Like another reviewer stated, it is able to get around a standard size pad lock or chain but doesn't give you enough leverage to actually cut it. You may be able to eventually cut it after slowly eating away at the metal. The jaws are strong as I tried to cut a few larger and stronger locks and left no damage to the jaws but there was some on the lock. Overall unless you plan to only cut smaller things, you will most likely want the larger cutters.",
        "Great addition to the tool box!!! When wire cutters arent enough and you need something a bit stronger but don't want to pull out the real bolt cutters, grinder, hacksaw, or just put that damn nick in your nice wirecutters trying to get them to cut. These things are the ticket!!",
        "These 8\" Mini Bolt/Wire Cutters have been good for cutting stainless steel wire rope that is 3/16\" thick. No nicks in the blade after making many cuts. The handles are hard plastic and not \"soft rubber\" as the Amazon description states. Not a problem as I wear mechanics gloves when using most tools anyway.",
        "Works like a charm! Went to a lumber yard to buy 10' rebar for a concrete project, the price of a 10' and a 20' rebar was about 50 cents a difference, so I bought this bar to cut the rebar at the lumber yard. It went through 3/8 rebar like a hot knife in melted butter. Saved myself 60 bucks in the cost of the rebar which more than paid for this cutter!",
        "I am very pleased with this item, I like the small size and the quality, and tough durability for my 'occasional' use...great to have on hand in my tool kit.",
        "Excellent little bolt cutter. Supplied by an old established American company but like so much these days Chinese made- none the worse for that though.",
        "I bought this bolt cutter because I was redoing some wire shelving in our pantry. I could have used a hack saw to cut the shelving to size, but it would have been very time consuming. This bolt cutters did the trick. Never before using a bolt cutter, it took me all of ten minutes to make 24 cuts in the wire. Saved a lot of time. This bolt cutter is heavy and feel solid in your hand. I don't think a smaller size would have worked so well. For about $20 I saved myself a lot of aggravation and time.",
        "I bought these cutters to cut into a chain for a swing, but either this wasn't the right tool or I don't have enough strength in my grip. I will keep it around for wire tasks, but I was disappointed it was so hard to use for a job that I thought it appropriate,",
        "I purchased these to help remove various chicken wire and crosshatch fencing that was wrapped to protect trees, gardens, and other landscape items from deer and wild animals. These are spring loaded and have a very fluid motion. I would estimate the thickest fence we cut was 10 or 12 gauge. These had no problem chopping through on the first try. Having used over 100 times, these show no signs of wear. I expect many years of use.",
        "im sure it would have worked for what i got it for if i had much more arm strength, but theyre still useful. i tried to cut the handles off some drawers on an old steamer chest and only managed to scrape them a bit. steamer chest was built to last",
        "I got these to cut chain-mail links from 14 guage steel wire because my normal cutters didn't have enough leverage. This thing works like a charm and is the perfect size to use with one hand. Couldn't be happier with it, and I'm sure I'll use it for other things as well.",
        "2 Problems. I am trying to cut off screws that are too long next to boards. This will not come close to cutting them flush. The jaws do not open fully.",
        "These are a nice addition to anyone's tool box. They do exactly what they are supposed to and are very sturdy. Shipped quickly and safely.",
        "Didn't want the real big ones but needed something bigger than my wire cutter. These were perfect. Easy to use and great for the midsize jobs.",
        "Used to cut a few bars of #3 rebar (3/8\") and it worked ok then used it to cut a regular padlock and it would only dent the padlock shackle leaving a dent in both blades. Finally got it to cut sliding it farther down the blades leaving another dent in the blades. About what I expected at this price range.",
        "I used these to cut out my damaged chain link fence, it worked quite well. I'm going to be building a gate and replacing more fence so I will have a chance to really challenge them, if they fail I will update my review.",
        "As small as it is, I don't know why they call it a \"bolt and wire cutter.\" You should not be cutting anything with any significant hardness, like chain-linked fence. Works quite well as wire cutters though, which is why I ordered it.",
        "Surprisingly well made and durable for the cost. I keep this cutter in my boat in case of the unlikelihood I hook myself. I have hooked myself before in the hand with a treble hook and I wished I had this tool to help in removal. It's small enough to fit in one hand and work the cutting action. It cuts a large saltwater hook just fine......I tested that out before it went in the boat. Just buy it....it's the perfect tool for cutting small items like a fish hook. A big bolt or screw......nope.",
        "The product is well built and works fine. I used it to cut fencing about the diameter of a coat hanger and it was ok but a little hard on the hands. I later purchased an 18inch cutter that works better. I am almost 80 and have some arthritis, A fit young person would have no trouble with this tool for the fencing that was working with.",
        "Well...I DID use these to cut padlocks as well as bolts, and though after cutting a number of them over the past couple years the jaws are a little dinged up, they are still working well. I can't complain for the price, and would buy again!",
        "These are great for cutting florist wire and 2mm jewelry chain. I also used these to cut flat sheets of tin and foam core.",
        "Bought this to remove some barbed wire along an old property line and these things work AMAZING, easy to use and got the job done with no problem. My doberman runs in the woods and I saw old barbed wire from when the development was made (they never removed) and it was overgrown, near gopher tortoise holes, now..... all gone!",
        "Needed these to install a chicken wire fence. They worked great and I honestly don't know what I would have done without it. It was light enough that made it easy to maneuver, but very sturdy. They are great to have at home for a variety of projects!",
        "These are great cutters for smaller guage wire, and projects but don't quite open wide enough for larger sizes, or cut as well on heavier strengths of wire... I like that the closure latch folds out of the way and secures itself! Good for home and light commercial use!",
        "These do not work as advertised. If you want a wall hanger they look great. I used all my strength and could not bring the handles together to cut through a lock or chain. I then placed one handle on the ground and used all of my 180lbs t no avail except to dent the cutter blade",
        "I needed this ASAP and got it as promised. When cutting the mesh fence, barely an inconvenience, no trouble at all. Great purchase!",
        "Don't expect a lot for cattle fencing use. Slightly better than cheap 8 inch side cutters. Doubt I will buy again.",
        "They are ok. They didn't work very well for what I wanted but I was trying to use them to replace the $60 cutters my company buys. They won't do that but they do great for small stuff.",
        "I wanted to cut and trim mesh with this product on 16 gauge wire, but it is not possible to get a tight cut against the mesh, leaving no points, because of the shape of the blades. Just about okay for cutting wire, but I found that the grips, when in the open position, are too wide for one handed use.",
        "The cutters arrived with its jaws misaligned- and one jaw somewhat misshapen- such that only one half of the tool bites into the wire or bolt. I intend to attempt to mitigate the issue by filing down the misshapen jaw, but the problem is extensive enough that such a solution is probably impractical."
    ]
}