{
    "entity": "Manual Juicers",
    "text": [
        "We've used a couple of different brands of squeeze-type juicers to mixed reviews. Enamel chipped off one, another wasn't dishwasher safe, the third squirted juice in all directions, rather than into the measuring cup or bowl. This is perfect. Cleans easily, works quickly, and does the job with little fuss.",
        "saw this at a bar, the barkeep used it to squeeze lemon juice for a cocktail, then pour it out the end. i had to have it. I ordered one for a friend that was with me that day. the best use is for squeezing fresh OJ in the morning. i take a few oranges and half them, squeeze until i get every drop. i use the pulp that gets caught in the metal strainer too, if you like pulp just take the curved plastic and metal center piece and tilt it, the pulp drops in. gives you that option.",
        "I don't get excited about many kitchen utensils, but I love this thing! It extracts a lot of juice and keeps a good amount of the pulp out (not all; if you're picky about pulp you'll need to double strain with a fine strainer). Clean up is a breeze. Great quality.",
        "This is an okay juicer. Pros - juice goes right into the attached cup and can be accurately measured in there. It can juice small and large fruit. And it gets all the juice with little effort. It gets more of the juice and is smaller than my old-fashioned metal hand juicer; I can store it in a cupboard with my measuring cups. The cons - Small seeds and pulp can fall into the cup. Hence I frequently have to strain the juice. The way this comes apart is different and was somewhat difficult at first. A good juicer for small jobs.",
        "Does everything it's supposed to. Good build. I mostly juice grapefruit on it, the large side is just a bit too small for this propose but it works out fine. Another winner from oxo.",
        "Easy to clean, quick to use - gets you fresh grapefruit juice (which is sooo much better than buying it in the store premade). i CHANGED MY REVIEW BECAUSE AFTER A YEAR OF MODERATE USE, THE INTERNAL PLASTIC LEDGES THAT HOLD THE JUICER OVER THE CUP BROKE RENDERING IT UNUSABLE.",
        "Saw this on Amazon and just had to get it for my wife. I bought her the exact same juicer several years ago and wasn't able to find another one when she said she would like a second one (the first one always seemed to be dirty). The juicer arrived quickly and is exactly as described. One of the best hand juicers on the market.",
        "I got mine just today, and after juicing a lime for my beer and seeing how well this thing worked and how easy it was, I'm more convinced that OXO has it's corporate act together. This thing is a breeze to use, and easy to clean once you discover the little \"notch\" that aligns the reamer (which flips over to change sizes). I've plenty of seedless limes @ 6/$1.00, but think next time the veggie man visits my apartment complex, I'll load-up on oranges and lemons too! This device opens a whole new convenient and efficient citrus-juicing, easy-clean-up world for me. Thank you for one more functional and well-designed kitchen gadget OXO!",
        "I've only had the Juicer today, but I've already drank about 10 grapefruits. Cut your fruit in half, put a half on the squeezer, twist. It leaves the grapefruit completely empty of juice and pulp. Juice goes into the cup and then you can pour it out of a the spout into a glass. There are 2 sizes, large and small, for large fruits like said grapefruits, and smaller things like lemons and limes (I have bought about a dozen each of those to make some lemonade and limeade). It's also dishwasher safe. If you're thinking of getting this, do it. It's awesome.",
        "I really like the design of this juicer. Looks great and you don't need to worry about spilling juice. It's also easy to take apart and clean. I was excited that is has 2 sides of reamers for different fruit sizes, but both are pretty small. One side is good for lemons, the other for oranges and small grapefruits (with large fruit you'll have to work harder). When you squeeze juice it really leaves the fruit shell empty but a lot of the insides stays between the ridges though. I will recommend it to those who like to have a glass of juice occasionally.",
        "Basically, I think anything made by OXO is superior. I purchased the Citrus Juicer as a replacement after I inadvertently tossed part of my old OXO juicer into the garbage and realized my mistake too late. I had had the juicer for about 10 years and it was still like new. The replacement is identical. It works very well, separating the juice from pulp and seeds perfectly. What I like most about it is how easily it disassembles for cleaning. I often simply give it a good rinse rather than washing it. The Citrus Juicer is in every way a great piece of kitchen equipment.",
        "I like that this juicer has to sizes to use. Good collection cup. Easy to clean and not too big to store. I got this for juicing small quantities.",
        "Does an excellent job of juicing. Set up to pour contents out easily. Has quantity (ounce & ml) markings on the side but these are a little difficult to read. The \"cone\" that is used for juicing flips over to provide a large and a small surface for juicing. Disassembles easily for cleaning. I've owned one for at least 5 years and have used it a lot; bought 2 more recently to give as small gifts.",
        "I squint and squint, but even with reading glasses and good light, I'm pretty much forced to have to pour the juice out into another measuring cup to see if I've squeezed the amount the recipe calls for. And yes, as someone else mentioned, an occasional seed falls through. Other than that, I find this a breeze to use, it's easy on the wrist and all in all makes a very useful addition to my kitchen gadgetry. And I like that it comes in three pieces...makes cleaning so easy. Addenda March 2011: Contrary to a report from another reviewer, I've been washing this on the top rack of my dishwasher--disassembled, of course--from the get-go in 2007 with no problems whatsoever.",
        "Easy to use; just the right size and sturdy on the counter.",
        "Works really well, I like that it is two sided for different size fruit. My only complaint is that the slots where the juice trickles down to the cup are a little big. I have had a few seeds fall through. If not for that I would have given it 5 stars.",
        "This is one of the best designed kitchen products. The blades are effective, the bowl is sturdy and the whole thing functions beautifully from start to clean up.",
        "So, it's \"just\" a juicer but it's one of best things I've ever purchased for the kitchen. * measuring marks on the side * reversible reamer which makes it suitable for juicing lemons, limes or oranges * the bottom of the juicer is lined with a rubberized material -- this is an excellent feature because it keeps the juicer from sliding on the counter as you're using it. Small detail but really important. * dishwasher safe We have a lot more homemade lemonade in the summer because it's so easy to use/clean.",
        "if you have only one or two lemons and don't want to drag out the electric contraption, this will do it. I've tried all kinds of reamers, etc which send seeds flying in your food-this blocks the seeds, squeezes efficiently and has a measuring/pouring cup and comes completely apart for easy throwing in the dishwasher. Leave it to OXO-that company designs well over and over.",
        "I used to use a hand press to juice citrus for margaritas. This juicer does a much better job of extracting larger quantities of juice. It gets it all out. The double sided feature makes for easy juicing of all sizes of citrus. Cleaning the remaining flesh can take a minute but not enough to lose a star.",
        "I love how this juicer offers a cup underneath. The cup offers measurements which come in handy when juicing citrus for recipes. It has a nice pour spout so you don't have to undo everything to get to the juice. Everything comes apart nicely for cleaning. There is two different juicing sizes, and it fits nicely in my hands.",
        "This is a little more expensive than some other juicers, but I bartended full-time for almost a decade and brought one of these with me as well as bought one for home. It's the little things like the ridges on the edge of the reamer that make a difference and if you're juicing thirty limes you will appreciate that.",
        "Works for oranges OR lemons since the reamer reverses. This actually works.",
        "Bought this one for my mom because she was jealous of mine. I love that I can see how much liquid I have and pour it directly. There are two sides, so you can juice small or large fruits easily.",
        "I bought a second one for a vacation home. Like it very much. Well built.",
        "Extremely good reamer, I like pulp and its firmness allows you to really squeeze all the juice and pulp out of whatever it is that you're reaming. Solid product, good quality and nice 2 size head fittings.",
        "The pulp gets stuck in the center with no way to juice it. What little juice you do get is delicious though..",
        "Works really well - one of the better ones I've tried. But it is challenging to clean.",
        "I have arthritis in my hands, and found previous similar juicers required far too much pressure to use. This one, because it has one side with a really sharp and narrow point, is just perfect. Great design, very easy to clean, wouldn't change a thing.",
        "This little guy gets every bit of juice out of my citrus fruits with minimal effort, with no pulp or seeds to worry about. The rubber strip on the bottom keeps it from sliding all over the counter and it's very easy to clean. This made fresh orange juice a realistic part of daily routine, I'm in love!",
        "It is actually a very good Juicer, get's the job done quickly, and it also seems that it's efficient (getting out all the juice). However, cleaning that thing is a total pain. You can disassemble it, but the part of the actual juicer dome is not detachable, so you have to squeeze your finger/sponge through the openings to get all the solid stuff out. As the edges are pretty sharp (which is good for juicing), this can also be a painful experience. I only use it now if I need to squeeze a lot of fruit, as the work needed to clean that thing is not justified for just a glass of juice.",
        "Bought this for juicing small fruit like limes and lemons quickly. Does the job nicely. The slots used to filter out seeds doesn't work great. Lets small seeds fall through. Not a huge problem, but something I have noticed. Wouldn't keep me from buying again.",
        "This things is awesome. Large container for juice, solid grip, and I really like that it has two sizes for juicing.",
        "Amazingly wonderful Juicer. Love how easy it is to use and the metal \"strainer\" keeps the seeds out of the juice. The juicer stem has two sides so can be flipped over and you can use the smaller or larger. So easy and fast.",
        "This worked great with my arthritis! Worked well & nice to be able to put in dishwasher.",
        "I love this juicer! It is so functional with the built in measuring cup and easy to use with the grip. And, it's dishwasher safe, so I actually own 2 for those times the other one is in the dishwasher.",
        "this tool is great. I use two oranges and get 8 ounces of juice basically seed free and pulp free puts trop. to shame. sorry about their luck.",
        "Easy to use and clean. It doesn’t slip at all when using.",
        "Juicer really works good, just what I wanted. Easy to hold when squeezing fruit and easy to clean.",
        "I typically like OXO products, and this juicer is undoubtedly yet another one of their products that I like and will use. It works great for juicing fruit, breaks down well for dishwashing, as well as storage.",
        "Instead of squeezing out juice, it rips off pulps which still contains a lot of juice in them. I got more juice and quicker with other hand juicers.",
        "It's not big enough for a big grapefruit but other than that works fine.",
        "When you are ready to clean it, it comes apart into multiple pieces that all go in the dishwasher. When using it, it is surprisingly stable and very easy to use.",
        "This is fantastic! I have one for my home and one for the office. I use it for lemons. So much easier than squeezing the lemons and you get a lot more juice too. Relatively easy to clean.",
        "My neighbor has one and referred me. This juicer is wonderful for those with lemon trees and have a lot to juice. It works perfectly, measures a cup and comes apart easily for cleaning. Highly recommend.",
        "Weekend hot breakfasts are a tradition here. Fresh orange, grapefruit and (when in season) Honeybell juice is a breeze with this item. Cleans easily.",
        "great juicer the one i have had for 10 years just gave out so i ordered another",
        "holds up well & works perfectly. i love how easily it comes apart for cleaning & the measurements on the sides are great. I've put it through the dishwasher numerous times without any problems.",
        "This juicer is sturdy. It is easy to clean. Juicing 5 to 10 oranges is a pleasant task. Easy and done.",
        "Oxo has the best design for a citrus juicer.Easy to use. Good price.",
        "Very east to use. I am a 106 pound senior and it's easy for me.",
        "Received it quickly and it works great. I have never bought an Oxo product that didn't perform as advertised.",
        "Great and strong, reliable and ergonomic juicer. Have owned one for years - no cracks.",
        "The negative reviews about seeds and being had to take apart and put back together almost convinced me NOT to get this. Every now and then a teeny piece of seed gets into the juice - if I see one I just strain the juice as I pour it. (Happened once and I juice every day) I love the fact it has a lemon side and an orange side. Squeeze an orange? Just flip it over. Squeeze a lemon? Other side. And they're both the right size. Easy to take apart, easier to clean. Easy to re-assemble - you can't put it together wrong.",
        "So much better than any other juicer we have used.",
        "Not a fancy product, but it does the job well.",
        "I am very pleased with this juicer. I have arthritis in my wrists but find this OXO juicer easy to use. It feels sturdy and the juice doesn't slop out.",
        "I use this for lemons and it works great! The pulp and seeds don't fall into the cup and it's easy to clean.",
        "I find this juicer to be very effective in removing juice from the citrus and is stable so I don't spill. The volume marks on the cup are really convenient.",
        "its ok reamers sized for large and small fruit •Measurement markings on container •Disassembles for easy cleaning •Soft, comfortable grip •Dishwasher safe",
        "Worked out as described but it is marked dishwasher safe and the plastic top warped after the first time through the dishwasher. If you hand wash only then you should be fine. However, I'm lazy and I put everything in the machine.",
        "I am using this daily. It is well made and effective.",
        "Best manual Grapefruit Juicer found. Only weakness found was the juice receiver. For some reason I've had to replace the juicer after about 15 mos. They crack and the crack spreads. Certainly worth what they cost.",
        "This product works well and is easy to clean. The two reamers allow for different sized citrus, oranges or grapefruits.",
        "Easy to use, easy to take apart and clean, have washed in the top rack dishwasher with no problem. Gets all the juice out of a lemon or lime very easily!",
        "This juicer has two juicer attachments to juice large fruits, (grapefruits) or small fruits, (lemons and limes). Very easy to use, but not ready for the dishwasher. Very easy to take it apart and hand-wash. The first juicer became warped when we put it in the dishwasher. This purchase was simply a replacement.",
        "I had high hopes for it, but I'm really questioning the design choices of this thing. I've juiced limes and grapefruits and the big side attachment works just fine. Not sure why they included the small side. The fact that there are two sides did convince me to buy it, but at the end of the day it seems like a gimmick. Also, it's annoying that the center part is detachable (related to the first problem). Overall it's okay and I wish I bought something else. Oh, one more thing - the thing doesn't catch seeds unfortunately. The holes in the strainer are too large. I have to use a different sifter to get rid of seeds even for grapefruit.",
        "I simply love OXO products, and this juicer is no exception. It is well constructed and durable. Dropped my old, well-used one on my tile floor and chipped a piece off. It still worked but figured I was due a new one.",
        "I love the pop out / flip over design. My only complaint is that it sequesters the pulp in the middle and you can't get it out all that easily. I LOVE the pulp, so this is a problem for me. If you want to keep the pulp out of your juice, this is a great little device.",
        "Love this juicer. Growing up, my parents had the same one, and when it came time to stock my own kitchen I did research on the best juicer available. Surprise surprise, it was the same one I'd used as a kid! Super durable, easy to clean, and easy to use. I love the built in measuring cup, the reversible reamer, and the grip. Highly recommend!",
        "This is the worst juicer. It leaves chunks of juice sacks behind. After many attempts to juice without getting the proper amount of juice, I have given up on this one. It was a bad purchase. The design is flawed.",
        "Just average and not worth the inflated price. The open design of the reamer is a major flaw. It means that instead of all the juice being forced out of the pulp by squeezing against a surface, the pulp just ends up going into the middle of the cone and getting stuck there. Disappointed.",
        "Perfect for when you need to just juice a lemon or lime for a recipe. • Easy to Store – takes minimal space in cupboard • Easy to Use – Couple of turns and the juice is in the cup w/o the seeds • Easy to Disassemble – 3 parts snap together and release the same way • Easy to Use Pouring Spout • Durable – I’ve accidentally dropped this twice, once on the floor and once in the sink – no damage • Dishwasher Safe – I’ve washed it many times in the top rack Recommended: Yes.",
        "This is pretty easy to use and I don't get any stray squirts of juice. You can quickly shake out the pulp that gets caught in a reamer into a bowl when you're squeezing multiple fruits. I pressed this pulp into the strainer I was using to get even more juice when I was done with all the fruits.",
        "Seems to work better than most other juicers if this style. Having 2 sizes is nice. Only complaint is more difficult to clean due to design required to accommodate 2 sizes and gaps that help juice better.",
        "I really love this juicer. I wanted a juicer that had a container to catch the seedless juice below. This has two size choices for what you are juicing, and you just flip the juicer top easily to choose which one you want. It comes apart easily to clean, you can pour the juice directly out of the spout without having seeds in your juice. The juicer does a great job of trapping the seeds in the top - just tap the top against something and the seeds come right out. Wash it, and you're ready for the next time!",
        "Does what I need it to do, as soon as it can be done, then is easy to clean up. I have personally squeezed lime and key lime juice for about 15 gallons of Cosmopolitans using this product. It is the BEST juice squeezer I have ever used. Two sizes for big fruit or smaller. Strains larger pieces of pulp while allowing most to go through. Pouring spout. Anti-slip feet on the bottom helps hold it steady.",
        "For a perfect marguerita start with fresh limes, and this. Easy to use, clean.",
        "I couldn't be any happier with the product. Like most OXO products I've bought in the past, it does exactly what it was designed to do: it easily and neatly enables you to juice a lemon or orange (turn the juicer insert over for smaller or larger part, as needed), collects the juice in a see-through bottom with both metric and US volume measurements, and has an easy to pour from spout. And it's dishwasher safe. I'd give it 5+ stars if I could!",
        "This is a durable juicer, able to withstand the repeated pressure of frequent use. It comes apart easily for cleaning and goes back together effortlessly.",
        "Handy, well-designed product, as expected from OXO. Gets all the juice, captured in a measuring cup. Reversible reamer comes in two sizes, smaller (lemons, limes) and larger (oranges, grapefruit). Comes apart for easy cleaning.",
        "I hate giving anything 5 stars. But, I've had this before and had to buy it again. It's good that it has two sizes. Cup container is adequate and it washes easily.",
        "The juice catcher (bottom section) of the first one i bought from Amazon cracked on its fist dishwasher run, but Oxo sent an entire new unit as a replacement, and this one works great! It gets out all of the juice. It's easy to clean. There is a rubber non-slip ring on the bottom of the juice container, so it doesn't spill. And no problems with the dishwasher.",
        "Great for oranges, lemons & lines as adjustable, easy to hold & clean, stays sharp. Another great product from Great Grips!",
        "This is the third one of these I have had. It works great for a while and we love it until it bends or cracks...Clearly we like it because we keep buying the same one!",
        "My roommate and I juice lemons every morning for our beverages and I LOVE THIS simple to use and easy to clean juicer.",
        "I had this kitchen gadget before and lost it when I moved. So glad to have it back! It works great, easy to clean if your rinse it off under hot water right away. The grips on the bottom are so helpful. Wonderful, well made product.",
        "Oxo does it again. This little Good Grips juicer is an excellent product. The juicer comes with two reamers, small for lemons/limes, larger for oranges/small grapefruits. The pulp collection area is effective, collects most of the seeds. It stays very stable on the counter when juicing. Clean up is easy.",
        "I couldn't be more pleased with this citrus juicer! It arrived as scheduled,as described, and is the quality I've come to expect from OXO products. It's a breeze to use and clean.",
        "I held off on getting this juicer because I was in a small apartment kitchen without much space. This unit -- the top and bowl -- takes up more space than it's worth if you're in a small kitchen. But if you have a place to store it, the juicer really reams well and the grippy bowl bottom keeps it steady. Another A+ product from OXO.",
        "Want the juice? Get the juice with this excellent juicer. We're very happy with it so far and would definitely buy it again.",
        "Hard to get a hand juicer that will do grapefruits and lemons OXO figured it out of course. Have only done oranges so far and it really gets all the juice out. Wish there was an easier way to save the pulp. Realistically there isn't, so just enjoy a well thought out juicer.",
        "I'm very satisfied with this product. It's well balanced so it doesn't want to tip when you're applying downward and \"juicing\" forces to it. I've juiced dozens of oranges, tangerines, grapefruit (small size) and other citrus delights without any problems. Solidly built. The three components are easy to clean. One caution and some advice: there are some sharp edges here so be careful, and, after about 4 or 5 halves the strainer can get clogged so be sure to keep it clear and get all the juice!",
        "We use this to juice citrus. It does a spectacular job.",
        "Honestly, I bought this because it was OXO. I have never been disappointed by OXO. This lives up to their high standards",
        "Pros: Two sided for different sized fruit e.g. limes vs lemons and oranges Dishwasher safe Measurement markings on the container Cons: I juiced far too many limes/lemons without this.",
        "My wife has started to use fresh lemons and limes more for taste and health. This juicer works great for her. It does not slip around on the counter. With the two different size tops she has used it for oranges and grapefruit as well.",
        "Simple, affordable, easy to use and effective. Fyi, It's surprisingly tough to clean if you don't clean it immediately. Otherwise it does the job quite well.",
        "Very handy, solid and dishwasher-safe. Makes quick work of juicing citrus.",
        "i was in the market for a good, sturdy juicer to get fresh juice for my baked goods... this is just the ticket. the first one i ordered arrived cracked, but Amazon was great and replaced it immediately. this juicer is easy to clean (dishwasher safe) and does a wonderful job on both big and small fruits."
    ]
}