{
    "entity": "Manual Juicers",
    "text": [
        "This juicer was a good purchase. It's easy to use. The short handle is very good. Seems better than the longer handles on the cheaper juicers. All video reviews make them look like they're going to flip forward and bash the user in the face. It juices thoroughly. We are drinking a lot more fresh squeezed juice now. The two things I don't like are hat it's too small for grapefruit and pomegranate, and the metal cone doesn't look like it's stainless. I juice the occasional grapefruit, but they have to be small, and I have deal with the skin bulging out. Your mom has to deal with that too.",
        "Bought this juicer in 2017 for our vacation home that we occupy about 6 months a year. Our use is residential, not commercial. We squeeze no more than 3 or 4 four cups of juice a day. The aluminum basket attached to the post that holds the stainless steel strainer and funnel has split rendering the juicer useless. This is not acceptable in a “commercial” product. Found a $31 replacement part on Hamilton Beach website. Out of stock. I’m going to see if a couple of caterpillar steel straps will work as a temporary fix. Very disappointed in the quality of construction. At our age (68) I thought we would get a lifetime of use not 3 years.",
        "This juicer used to be industry standard. I have gone through 3 in the last 1.5 years. metal pieces have broken, plastic pieces have broken... and this is just from normal use. no drops, no abuse. lame.",
        "This juicer is sturdy and well designed. It is also very easy to clean. I like everything about it except for one thing, the juice is not as pulpy as my old (and loud) Sunkist juicer made . The rotary action of the Sunkist juicer left the orange halfs clean and put more pulp in the juice. In my opinion, this is the difference between pressing and rotary mashing. The trade off is between quiet less pulp vs. noisy more pulp....",
        "As many others, I've discovered that the pressing cup is made out of aluminum and not stainless steel, and is not dishwasher safe. Extremely frustrating to throw away $200 on an inferior product just because the manufacturer decided to safe a couple of buck and try pass off chrome plated aluminum for stainless steel.",
        "This is simply an amazing product. With nothing more than a flick of your wrist, it renders oranges into wonderful tasting orange juice in just a few seconds. A typical orange produces about 2-4 ounces of juice...I generally plan on 18 oranges to fill a 64 ounce pitcher - and you can squeeze that many oranges in maybe ten minutes with a little practice. It's well made, easy to clean and generally built like a tank. There's nothing fancy here...could have been designed in the 1930s. Still, this is definitely the tool of choice to make orange juice!",
        "the cone at the top does not seem to be made of a metal that does not corrode in acidic juices, so you may need to put some wrap over it and keep it clean. Also it tops over fairly easily. Other than that it is a great product, easy to clean and solid. I had electric juicers before but they keep breaking, I like this design better.",
        "I absolutely love how easy it is to get fresh-squeezed OJ with this thing! I just grab a bag of oranges at the store and cut them in half. The juicer is just as quick and easy to use as it looks. - Right out of the box you are good to go! You don't have to be strong to use it -- there is alot of torque with this type of handle. And the clean up is a breeze. Just pull off the pieces, give them a good rinse and voila!",
        "Two words: THE BEST. It is a classic for good reason. This is a sturdy, no-nonsense juicer. Straightforward and only a few integral parts to clean post each use but cleaning is quick and easy. We are thoroughly thrilled and abundantly happy with this gem of a juicer. Thanks Hamilton Beach - and thanks Amazon!",
        "We've been using this juicer for about 3 months now and it's held up great. I was worried when reading reviews of cheaper units where the manufacturer wouldn't replace the parts if they failed (they responded that you have to buy a new unit) so I went with the Hamilton Beach 932 Commercial. I figured if it could hold up to commercial use it would work for me. It's been great. I've had no issues with it. Set up was easy and I haven't had any issues with it. Would highly recommend. Great for orange crushes :)",
        "Exactly as advertised. I've really been enjoying using this juicer. With normal maintenance (i.e., clean it, rinse it, and dry it after each use), I see no reason why this will not last for at least a decade. I hand wash after each use and will dishwasher (top rack) the strainer, funnel, and drip cup every week or so. I use some food grade silicone spray on the threads for the pressure cup and on the drip cup swing-arm spring twice a month. I will probably use some food grade grease on the pinion and rack every six months.",
        "I do like this product - it makes drinking fresh orange juice easy to prepare on a daily basis. My whole family is able to use it. We also make fresh limeade and lemonade on occasion. It truly requires no muscle and is quick to juice. I gave it a 3 because of problems with the connecting screw and the threads of the cone - they easily rust and require extra attention to keep them dry after clean-up. The maker should have used rust-proof materials for a $200+ product.",
        "Pressed over 300 lemons during a weekend festival. Worked perfectly with no issues. If you really want issues listed in a review, the only complaint would be the spring-loaded catch cup is hard to keep out of the way. We would keep a prepared Solo cup under the press waiting for the next order. From time to time the catch cup would swing back, knocking the cup on the ground.",
        "If you need to reduce a large number of limes or lemons to their constituent juice on a regular basis, this is the way to do it. Serviceable parts, and reasonable to clean. Probably overkill for most home users but I have worn out and broken numerous smaller squeezers and juicers. All that I use now is this unit and a glass juicer for smaller jobs.",
        "I got this in 2005 and this is the best for massive juicing. We have orange and lemon trees and now we also have pomegranate trees. Quick and easy to use. The only drawback is because of the height, it could be a challenge to store.",
        "After seeing all the mixed reviews of the cheap ones, I wanted the best. Think I found it. Does a great job and DOUBLED our lemon out put per lemon over the hand held ones. Easy to clean. BUT CLEAN AFTER EACH USE! I could see it getting damaged by the juice over time if you don't clean it after.",
        "For a professional squeeze there is non better. This thing is great for squeezing the life out all sorts of citrus, as well as non conventional fruits like pomegranate and apples. After almost five years of heavy use in a commercial kitchen, we finally had to replace as the gears had been worn down and chipped. Still really life span in a kitchen that plays hard. Hamilton Beach is worth the extra money.",
        "That's right we are YELLING ABOUT THIS PRODUCT. Anyone that has had to sqeezed limons or Limes with a hand held press will understand. My goodness is this thing awsume to use. two bags of lime for Margarita's in just a few short minutes compared to half hour to an hour with hand held press. Don't wait get this one",
        "This juicer would deserve 5 stars if it had an adapter for larger oranges and grapefruits... The larger fruit squishes around the sides of the plunger, and makes a mess... Smaller oranges.. yes, 5 stars...",
        "This was alot to spend on a kitchen tool that is so specific but I have no regrets. It's so easy and clean to use. We had 62 pomegranates on our tree this year and none of that juice was wasted. We drank it, we made sorbet, and we made syrup! Storage space is a problem with something this tall but it's so artfully beautiful I still have it out on the counter!",
        "This is a great juicer for medium to small fruit but you'll have to cut grapefruit into quarters to fit them into this and I only juice grapefruit so I gave it away and am still looking for a larger one that works as well!",
        "Works very well. Easy to clean. Handles Oranges and small Grapefruits without issues. Only problem is you will never go back to commercial juices.",
        "As a bartender, I've used this juicer for many years. This product is so awesome that I bought one for home. Top notch product. Totally worth the price!",
        "After searching for an electric juicer that could handle our homegrown pomegranates, I settled on this hand juicer. Wish I had not waited so long. There is something VERY satisfying in squeezing a half pomegranate until it is juice-less. Believe it or not, my teenager even wants to help with juicing when I pull this out. Pretty easy to clean. Not a big mess and requires NO electricity. Love it!",
        "I am a HUGE fan of juicing. I purchased this citrus juicer because I have at least 1 straight citrus juicer a day, and all the electronic citrus juicers I've used in the past are such a pain to clean. This citrus juicer is perfect for someone who makes a large amount of grapefruit/orange juice in one time. I like to use a strainer after juicing 6 cups to control the pulp level. The juicer is super easy to use and to clean. I like to run the piece under hot water immediately after use and through the dishwasher once a week. I recommend this product to anyone who makes 6-10 cups of citrus juice at one time.",
        "Totally solid, easy to use, easy to clean. Ideal for juicing any citrus, does a great job on pomegranates.",
        "Easy to use with smooth gearing. Minimum effort required for maximum juice. Worth the price premium.",
        "This thing is amazing. I had a motorized unit for our limes, but since we do so many limes, it was annoying. Now I got this thing. Talk about awesome. 30 seconds to clean, awesome drip can and nearly 100% juiced no matter the size of lime or orange. 100% love it and I juice a lot of limes.",
        "I wish there was an option for larger press parts. My pomegranates range from small (3\") to ginormous (6\"), and the juicer is wonderful up to about 4.5\". Good leverage, stability and a minimum of mess. It is fast, too.",
        "Easy to use and clean, solid with strong press squizer , made of a good material. I love it.",
        "I really like this juicer, it's so fast and easy to use and clean! I love to juice cara cara oranges with it and drink it with a straw! It literally takes under a minute from orange to sucking out of the straw! The construction seems durable and that it would last a long time. (However, I would like to see a longer warranty --- 1year doesn't seem very long for the price u pay)",
        "Gets all the juice out with little effort on your part. Very easy to clean. Highly recommend this model.",
        "I really love this! My husband and I had fresh orange juice every morning when we visited Greece. He loved it, and I wanted to get him a gift that would give similar results. This does not disappoint! It’s easy to use the press and it is a simple design that takes hardly any explanation. Cleaning is easy. Makes delicious orange juice!",
        "I love this. Had is for over a year now, and get lots of use out of it. Buy it, You will not be disappointed.",
        "This juicer is absolutely the best out there! I purchased three before getting this one and they were a total waste of money. This juicer is great. I use it for orange crushes and it is so easy to use. We crush a pitcher full in no time at all! Don’t waste your money on any other product!!",
        "Simply the best. The 4 stars is for wishful thinking. Give us a grapefruit/large fruit option/accessory. Change the plastic to aluminum. Solid no-tipping design than can drain citrus with ease. Gave one to my parents too.",
        "I've had this juicer for over a year now??? I use it all the time. It's super sturdy. Every once in awhile I have to take a Phillips and tighten screws at the top and the side where the handle joins...but that's what they're there for!!! part of the quality of this puppy. I have even juiced pomegranate (cut into wedges). Great for fresh juice...better for fresh cocktails.",
        "This is my first citrous juicer. MUCH better for citrous than a centrifugal juicer--far less prep. Just slice the orange in half. If you press down slow and steady, you'll have less problems with juice squirting you in the face. The pulp separator does a pretty neat job. It plugs up after about 4-5 oranges, and if you remove it, scoop the pulp out with your fingers and run it under some water really quick you will get better results. The drip cup is a fabulous idea. overall, very glad I purchased it.",
        "I bought my first worm gear juicer in Mexico in 1970. It gave up 6 months ago. Loved it. I bought the Hamilton Beach juicer because it looked identical and had ALL the same features’ paid less than $10.00 for my first one, The price tag on the Hamilton Beach juicer is high, but the quality is there. I juice every morning and Love this juicer.",
        "Lots of work but makes the best o.j. you will ever drink!",
        "Bought this as a gift for my dad. He loves this item & is a big hit during summer time parties making fresh orange crushes!",
        "EXCELLENT product. I am very happy ! I squeeze 7 oranges every day, from the trees in my yard. the oranges dont stand a chance, like another man said.",
        "For the cost, it does not perform as it should be. Pieces coming loose and juice is sprayed outside of the device.",
        "I love it. This has changed my cocktail making life. I will take this think down to juice half a lime. If you need to juice a bag of lemons, this'll will do it with no issue. No regrets at all.",
        "There are 3 things that are certain in this world. Death, Taxes, and Plastic breaks. The Elbow, Press Stand, Handle, and Gear housing are all plastic. They need to drop the word commercial and just say Citrus Juicer. Yep all those Black Parts you see in the Photo are all plastic. Cup is not SS. I think it may be aluminum.",
        "Don't ask me the number of juicing devices we've abandoned over the years. Each one has its own unique flaws: leaving too much juice in the fruit; making a sticky mess; too much work; etc. This Hamilton beach is as good as it gets. It's a sturdy machine that efficiently and completely juices an orange in no time flat. It runs on human power but effortlessly. It comes apart for cleaning easily. And it doesn't crush the rind into the juice, which imparts a bitter note to juice.",
        "This is the industry standard for commercial juicers. Walk in to any bar and you will find this juice doing heavy work night after night. I use this juicer to juice lemons, limes (stack two on top of each other to get all of the juice from both limes), oranges, grapefruits and pomegranates. This is a highly recommended piece of equipment for any commercial application",
        "I love this machine. ALL of the juice is extracted from citrus. The fresh squeezed juice is so good compared to the supermarket offerings",
        "I loved the juicer but because of its bulkiness I’m returning it for a more smaller one that does the same job.",
        "Bought this in June 2018 but use it only occasionally. Despite that light usage, we realized yesterday that the plunger stem is stripped--making the product useless. We will now be searching for a vintage model, which is sturdier! For the price this should have lasted much, much longer than it did.",
        "used this today for the first time, works great and gets all the juice outta the fruit. A++++ worth the $",
        "This is sturdy, has grip feet for non slip. We have a lemon tree and use this for making Lemonade. Need to squeeze 10-12 lemons for this. Has strainer for seeds. Makes it more of a fun family project and not a chore to squeeze fruit. If you have a citrus tree, this is for you.",
        "Great Juicer. It's easy to clean and makes juicing citrus fruits a breeze. For best results, make sure the metal grate is seated correctly and all the bits are tightened well. Don't press too hard.",
        "I really don’t get the good reviews , this thing cost two hundred bucks and is cheaply made , the squeezing mechanism deviated from side to side when oranges are small , causing a cracking sound....25-30 bucks maybe , but not likely after using ! Sorry this thing is junk and the price is an insult !",
        "We bought this for juicing pomegranates, as well as citrus. It is pricey but built very robust, a lifetime tool we think. It is easy to press with high leverage, easy to clean, and best it doesn't splatter. Just enough pulp comes through that you know this is real juice. It's amazing how much juice there actually is in a pomegranate (or orange), we're seeing how much for the first time. Highly recommended, if you can afford it.",
        "You will see this product all over Baltimore where their go-to drinks are orange and grapefruit crushes. This product is durable and extremely well made. and it is well worth the price tag. We have had multiple friends buy this juicer after seeing it being used in our kitchen.",
        "Worth the money!! VERY sturdy, the side handle is so nice instead of in front. Easy to clean. Love it catches all the juices afterward and you can take that cup out and add to your drink. You don't need a lot of muscle to get all the juice out .",
        "We're fortunate to have fresh citrus available most of the year where we live and my husband just loves to make fresh juice with this juicer. It's a snap to use, easy to clean, and can make more juice/faster than an electric juicer that we also (used to) use. We'd buy this unit again if ours ever quits working.",
        "This manual juicer is perfect for just about all oranges. If you have really big oranges, but them in quarters and this machine will juice them perfect. Most of the time a simple slice down the middle and 3 oranges make a perfect glass of OJ. Scrap the cheap electric juicers if you are serious about making fresh OJ. (I had a cheap Target juicer, that I had blow out within the first week). I have had this manual juicer for two years, and I have used two whole orange trees per year about 30 lbs of oranges, works great!! Once you have fresh it's hard going back to store bough OJ!",
        "Love this juicer! I use this in a commercial setting so the ergonomics of it is very important. Its design saves a lot of strength to juice (as opposed to the press-forward design) and it really squeezes the maximum amount of juice possible! Also very easy to take apart and clean.",
        "This thing is a monster, I first saw this juicer in action at a bar in Key West, after talking to the bartender and hearing they use it daily to juice 100's yes 100's of limes and lemons and have been using it for 7 years with no issues I bought one for home. It is strong and heavy and I can't imagine having to buy another for as long as I'm around.",
        "Great easy to use and does the job better than my electric one....",
        "Bought this to make orange crushes. Squeezes every last drop out with ease. It is expensive but you get what you pay for. 10*",
        "I absolutely adore this juicer! We've had the best Summer ever drinking fresh greyhounds and OJ anytime!",
        "What a great juicer! I spent all summer making lemonade at farmers markets. I went through about two cases of lemons a week. Its fast and easy. It leaves a very small amount of pulp and seed parts in the juice. It's also easy to clean. I love it!",
        "This makes it so easy when I have lots of juicing to do. I have been able to put grapefruit and even pomegranates in it which my hand held juicer couldn't do. Also it gets much more juice out than the hand held squeeze one (although it's a lot of work to pull out and clean for 1 lemon. So for bigger juicing jobs it's great and fast.",
        "This is an amazing tool for a bar, or even for your home. We use it in our bar for making lemonade and for just juicing lemons and limes. It just works, it is simple, heavy, old-fashioned and great.",
        "I bought this as a gift for my wife, and find that we use it quite a bit. I love using it to make orange juice. Fresh squeezed with no added sugar, etc. Just squeeze and drink. We also use it for lemon/lime juice when cooking. Very durable, heavy duty and well liked/used.",
        "I have purchased many lesser quality juicers in the past, however, they never had enough torque to get all the juice out of the fruit. This juicer is the only juicer you will need, ever. It gets every last drop of juice out of the fruit, doesn't move around, and is easy to clean up. And, you can even order replacement parts if ever needed. LOVE THIS!",
        "I love this press, I use it for my lemonade business at the farmers markets. I get tons of compliments on it. It gets all the juice from my lemons which is necessary for profitability and speed of preparation, too!",
        "Expensive, would prefer the plastic parts to be stainless steel. Works very well and other than the materials is well made and finished. The plastic is thick and strong so may not be a problem.",
        "I have a little arthritis nowadays, and a hand juicer is not the easiest thing to use - and they are messy. I am pleased, but be warned, this critter is big and heavy (20 inches high, about 10 pounds.) I did a Margarita and pizza party for some friends, and this juicer walked through 2 dozen limes quickly and easily. I am pleased.",
        "I am a vendor at a major music venue and purchased this juicer and haven't looked back. We make lemon shake-ups so this thing is constantly being used and abused and it keeps on going. Little effort required to get a good squeeze out of the lemon. And the swing out drip cup keeps the mess to a minimum. Our other juicer that we used before this one was always coming apart and made a huge mess when used. We have sold over 2500 shake-ups using this machine which equates to 5000+ lemon halves being squeezed. Getting ready to purchase 2 more from Amazon!",
        "Sturdy, efficient! Love this tool. I use it to make gallons of lemonade. Gets all the juice out of the lemons. We use a twist tie to hold back the drip catcher-we set up like a factory line so it's not useful to us. We'll be permanently removing it now that we've looked into how it is attached.",
        "A great, durable juicer. We are very happy we made this purchase for our bar.",
        "Totally diggin' my juicer, works perfect and I'm buying unique oranges in search of the holy grail! Cara Cara? Valencia\"? Mostly, organic and farmed, not picked a month ago and dry! Love the juicer, works perfect, easy to clean! Word up!",
        "Very solid and sturdy! Super easy to clean and disassemble. Not really good for big oranges or grapefruits but perfect for medium size oranges. Good investment, should last a long time! Very pleased with the purchase.",
        "I got this juicer for my wife as she LOVES making lemonade from scratch. This thing is a lifesaver for this activity. She was going to make a larger batch (Like 24 lemons) just before her birthday so I gave it to her early and she loves it. Basically effortless to use and it does a great job. Little mess and it saves her hands a bunch of straining. It is well made and I have no complaints. I would definately buy it again. Only complaint is that it could have a larger base so that a larger bowl or a pyrex measuring cup could fit between it. Other than this small issue I give it a thumbs up.",
        "The beat citrus juicer ever! Got this on a recommendation from a friend and could not be happier.",
        "Love the fact that there is very little pulp. Also very fast, you can do ten oranges in a couple minutes.",
        "Best item ever purchased. We have a few lemon trees and a bountiful orange tree and now using our Hamilton Beach for a glass of fresh juice every morning. So very easy to use and clean.",
        "We had bought a small electric machine that extracts well with a lot of pulp. It makes alot of noise. My husband prefers it but I prefer this product because it is quick, quiet, and very effective. There is no pulp in the product with this machine. What I really like about it is that it is so sturdy. Our young grandchildren squeezed about 18 pounds of oranges in one day. It worked perfectly. I love this machine. We will have it for decades and then the next generation will enjoy it.",
        "We have been using this for eight years. It is the most efficient juicer for oranges that we have tried. It seems virtually indestructible. We have even squeezed grapefruit but it's not as easy. Although it is pricey I would buy it again because it works.",
        "3lbs of lemons and 3lbs of limes were processed in less than 30 minutes this included all prep and clean up time. I can't believe I waited this long to purchase this. Clean up and use is simple. 3lbs makes almost 2.5 cups of juice. Will make the sweet and sour mix for the Margaritas shortly :)",
        "Good torque for large citrus--love making my own orange juice",
        "I've only had this juicer about 2 weeks but I absolutely love it. Very easy to clean and super easy to juice. The base is very heavy and sturdily made. The moveable parts come out easily and fit in my dishwasher for cleaning. I have wanted one of these for years and couldn't be happier with my purchase.",
        "I have owned this model for 35 years. A most perfect juicer.. This one I purchased for my son and again, perfection. The weight and balance of it cannot be duplicated. I bought 2 other juicers in the past but they didn't compare to the Hamilton Beach 932.",
        "As much as I love it, I still feel like it is a little bit overpriced. It squeezes the oranges fine as long as they are not extremely big. it is easy to clean and very well built.",
        "love it, I also see it at the tikki bars this product is awesome!!",
        "The product works very well and I use it for everything from a lime to a grapefruit. I would give 5 stars if it was a little less expensive. The construction quality is excellent and cleaning is a breeze",
        "Quality construction. We use this all the time! Easy to clean, easy to use. Our teenagers and their friends love to come over and attack the fruit to make fresh juice. And the lemon and grapefruit drops we make aren't too shabby either.",
        "Perfect manual juicer. Rack and pinion system, more powerful than leverage system. Just used to squeeze until the last drop pomegranate, grapefruit and big orange, and it works smoothly and effortlessly. Very fast (two days) amazon delivery from TX, USA to Italy",
        "Never knew a press existed. Always used the electric model. This works perfectly.",
        "I love this juicer. The rack and pinion is very effective and require very little force. The construction is heavy duty but the price is steep compare to other products.",
        "After trying a couple of cheaper alternatives, finally bought this, and could not be happier ( except that I should have got this one first!). I got this specifically for juicing pomegranates, and it does this efficiently, cleanly and without effort. It is well designed and engineered, and other than the danger of letting the drip cup swing back unexpectedly and spilling your freshly squeezed juice (something that you will only do once!) I can honestly say I can find no fault.",
        "I've always wanted one of the manual juicers and finally bit the bullet and purchased this one. I've been using it for about 6 months now and absolutely love it. Easy to clean, juices very well, and is built with a tank.",
        "I bought this juicer to use at our annual New Years Eve party. After years of hand juicing oranges this years party was awesome as we made over 50 orange crushes with. It was the hit of the party and one of our guests has already purchased one for himself after using it. This juicer is well built easy to use and will remove all the juice. I highly reccomend this item and suspect it will be around for many, many years in our household. One of my better purchases from Amazon.",
        "This is a very high quality product. I'ts rare to find something made to last. My family has an orange tree that produces several 100 pounds of thick skinned delicious fruit twice a year. This juicer makes easy work of extracting the juice. In less than an hour while chatting with family on Easter I had a gallon of fresh delicious orange juice.",
        "I would certainly buy this again. It does a fantastic job of juicing lemons, limes, oranges, tangerines, and tangelos. The pulp comes through in the juice (a plus for us) and it totally eliminates any bitterness from the rind. Overall well-designed. The only thing keeping this from a 5-star rating is that the juicer diameter is not designed to accommodate regular-size grapefruit.",
        "It works like a charm. But it is hell to clean! Unfortunately, I stopped using it b/c I hate to clean the thing."
    ]
}