{
    "entity": "Gas Detectors & Alarms",
    "text": [
        "Never got results. If my test didn't work or whatever at least tell me. No reply, no nothing and I followed everything it said, FedEx said it made it there. Tried to find customer service and whatever and can't even get a hold of them. Last time I ever go with First Alert. Don't buy.",
        "Because of unclear instructions, we didn't have the date we collected air. They weren't able to test. Money paide plus $20+ for express. Purchased it again. This time filled up everything correctly. They tested but stated that bag wasn't sealed. It was. Getting another kit thru local university. Wasted too much on this particular test.",
        "If you're reading the reviews, you already know that you'll need to mail the test it out to get the results. I sent mine via USPS flat rate for ~$6. I recommend filling out the form online rather than using the enclosed paperwork, it's much easier. I found the process super easy and was emailed the results in less than a week. It'd be a lot easier if the kit included a prepaid return envelope and just added the cost to the purchase price.",
        "Very pleased with this test kit: reasonable price, easy to use, no testing fees, and quick service on the test results. I did two tests about 2 weeks apart (here in Central PA.). The first test was without an operating radon exhaust system (bad fan motor) and they reported 20.9 pCi/L (Wow!). Then I replaced the fan, started the exhaust system, and after 2 weeks ran another test with results of 0.6 pCI/L. So we're good to go... and we'll keep the new radon exhaust fan running at all times.",
        "I followed all of the directions and mailed it the same day I took the test out of my basement. When I received my results it just said they were unable to be completed \"because the test kit took too long to arrive in our lab. After long periods of time, the radon present in the test kit has decayed to the point where it can no longer be accurately measured...After 10 days, we cannot guarantee a valid test result.\" If you buy this test expect to pay to expedite the shipping because regular mail is not fast enough to guarantee results. The test does NOT pay to return the kit to the lab.",
        "1) Key: if you can't see mold itself, this is actually 100% totally useless. To test say carpet for spores, you need to cut out and mail a piece of the carpet (\"bulk sample\") in a ziploc provided! If I wanted to, I could do that without ordering a $12 kit. 2) In general, unlike other kits that show mold growth (or lack thereof) that you can send or not send, this does absolutely nothing by itself. All you can do is send in a sample. Without an extra fee this product can do nothing at all. 3) The fee for testing is $15, not $10 listed on the product page.",
        "During our home inspection we discovered our property had high levels of radon. We had it mitigated. Within a day levels were back to a safe level, and there's a gauge that tells us how much radon is in the house. It's still recommended to retest every 2 years to be sure. You CANNOT send these First Class, or like some people call \"snail mail.\" Which adds considerably to the overall cost. We sent ours UPS. It cost $24 minimum to get it to the lab within the recommended time frame. Overall it cost less than hiring a professional. So we can recommend it. We'll see what the lab says though, and update our rating accordingly.",
        "I got heavy metal poisoning somewhere and I wanted to fine the source, so I bought this product to test my dishes (which were made in China) and some other items around the house. The dishes and everything else I tested came out negative. Then I decided to test a lead fishing weight to make sure the test was working correctly, and barely got any color change. If it can barely detect lead in a lead fishing weight, I don't see how it could detect trace amounts on dishes. A false negative is the worst possible scenario for a lead test because it could result in thinking what you tested is fine, when it is not.",
        "I did not see my email results and forgot about my test. I also lost my serial number for my test. I thought it was a lost cause. Many months later I contacted the test lab at 1-800-324-5928 and they emailed my results again and printed a hard copy for me. THAT IS QUALITY CUSTOMER SERVICE!!! (Thanks Lauren at Alpha Energy Labs!)",
        "The easy to follow instructions on the box say ‘place on the floor’ while the ‘fine print’ instructions say place 2-7 feet above the floor. My test is done and I now see these conflicting instructions on an insert that tells me how to fill out the mail back form. Why are there different sets of conflicting instructions and how do I know if I screwed up?",
        "Ordered a white label product from China. We wanted to ensure this product is safe, and not take our supplier's word for it. Full scale labs are out of our reach as a startup - and we used this product. We did the leach test on a control negative (white vinegar), 8 samples, and a control positive (wire with lead in it). Both controls exhibited as designed (lead control was black as night and white vinegar was clear). We did try the \"quick test\" but it didn't really work on the lead wire, so I'd recommend doing the 4 hr leach test.",
        "Need to test chipping paint. I did the test two ways and I'm still not clear on my results. I did the vinegar test and the solution never turned cloudy or white like the instructions said so I cant be sure that the test actually worked (no control??). I rubbed with a q tip and the q tip turned color after a while but it seemed like it was only because the q tip got dirty or paint color rubbed onto it. Basically, I am ordering another brand because I don't feel confident with the results of this test.",
        "Very easy to use. I mailed it out and paid extra for faster reading. Got results back pretty quickly. I called the lab and they said they do readings 7 days a week. The results are put in the computer monday thru friday. So no worries if you think your package will sit in the lab's mail room over the weekend. It gets processed the same or the very next day. I was able to log on the website and get the results. And results were very easy to understand.",
        "I bought two of these--one two use in our basement, and one to use in the living room. They were easy to use, and I got the results via email within a week after mailing the tests out. It was so worth it to know that our house doesn't have a radon problem! One thing I will note: make sure to read all of the instructions before using! Especially when it comes to filling out the included forms. I had to print off new ones from their website--not a big issue, they make it really easy--because I didn't realize everything had to be in black ink and capital letters, which is clearly stated in their directions. Oops!",
        "**Update - finally got the results. Don't know what happened with their site or why I wasn't called back, but they came through in the end. Added 3 stars back. I purchased and used a Kidde kit, which is the same company. No issues whatsoever with using the Kidde kit or getting the results, but the reading was a little high, so I ordered this kit to do a double check. Now I can't log into the site to get my results. I tried for days before calling them and all I got was a voicemail. I left a message several days ago. No call back. Ripped off!!!",
        "The radon kit was very easy to use. However, the kit recommends using priority mail to send to their lab in Texas. Priority cost me around $7. That was fine, since it made it to the lab in time, but it was a bit of an unexpected cost. I thought the results I received were very detailed. I had them e-mailed to me. I appreciated that they sent the results by e-mail, and then later sent me a second reminder (with a link to download the results) in case I'd accidentally deleted the first e-mail.",
        "We purchased two of these kits to test the radon levels in our crawl space as well as first floor living area. I give the product and the process to return the test kit a solid 4/4.5 stars. The return package they give you is metalized and maybe 2 stars at best because it's wafer thin. The Woman at the USPS literally tore a hole in the bag trying to put the postage sticker on it. I paid for the expedited service and received my report in a couple days. The entire process start to finish was painless.",
        "This kit is straightforward to use but misleading to buy. In the top part it states it includes all lab fees, which being a the dumb consumer I am, thought that it include the shipping to the lab. It does not include postage. In re-reading it does state this, but I would have not purchased this kit if I knew that. Home Depot has a $9 kit I could do that with and probably spend the same amount as this kit alone.",
        "The test says if you have a value of >2.0pCi/L, take action. The results they send back to us: <2.3pCi/L. So what does that mean? Is that between 2.0 and 2.3, therefore I need to take action? Or is it below 2.0pCi and my basement is ok? Also, the instructions say \"expose for 48h\". I exposed the test for 47h and 55min (only 5min short, which shouldn't affect the test results in a meaningful way, since 5min is only 0.0017% of 48h). So, they tell me that they could only estimate my actual values.",
        "Couldn't find these locally and was happy to find them on Amazon right up until I saw they were not the old style that let you do your own test and you have to pay $10 for EACH of the \"up to 9\" test locations you can do. That works out to $90 if you want to test 9 locations! To be fair I did see that in the description but it didn't fully register until I got it in my hands.",
        "I have no idea what these folks with negative experiences are doing, or not doing with this kit. Perhaps the \"trick\" is that we read and followed all the instructions, filled out all the forms (yes, a pain), don't live in NJ-so no extra fee, and sent the kit back via USPS Priority Mail. We mailed the kit on 11-14-2016, got email results 11-21-2016. With all due respect, think the problem might be user error.",
        "I completed the test for radon, as directed by the instructions, and sent it in to the lab in the cheap bag they provide as a mailer. I waited for the results, and when I received them, the report said \"The sampler was received with a torn envelope. A torn envelope can allow radon to enter or escape during transit. This result is an estimate.\" So I feel no wiser than before, having spent money and time on a test that has given me only \"an estimate\" of our radon level. I wish the seller provided better packaging to send the test back to the lab in.",
        "Not sure what I think about this test, we sent we our samples in and the results they sent didn't match our start and end times we indicated on the test. We emailed them about the discrepancy and they just apologized and told us to add .02 to the total. I get the impression when they get your test samples the results depend on where the dart lands on the wall. Home purchases and sales hinge on the results of these things, you'd think they'd take the time to get it right the first time.",
        "Evidently the directions were not specific about placement. I placed mine under a bedroom table on the floor which may have given me an inaccurate elevated radon level. Mine was 7.1pCi/L, which is double the level recommending radon mitigation. A second radon test from our state KY Environmental Resources specified the test should be at 4-5 feet above the ground and actually came with a plastic hanger. One expectation you can have is to pay for shipping by UPS and not the USPostalService, who cannot deliver it in time to be accurate. That will run you $4-6 in addition. Check your local & state environmental protection or health boards for a possible FREE test kit.",
        "What a rip off, I thought I was getting a usable test kit to give me results in my home. Instead I got the privilege of spending $13 so I could spend an additional $15 for each sample I send in. This is a classic Bait-and-Switch.",
        "I'm planning on returning this kit as it is advertised incorrectly, the pricing is wrong, they want $15 per sample so one sample kit is actually $90 to have tested, not $10 as they lead on. Cruel of this advertiser to waste people's time and money.",
        "As part of our purchase of a new home, we were required to get a radon test. We almost got one from a reputable inspector, that would have cost us almost $200. That is until I found a recommendation for this radon test online. The instructions were intimidating at first, as there were so many things to remember, like how high to place the test, how it had to be decent weather and windows should be closed. But we followed everything to a T. And mailed our test promptly afterwards. The results came only 4 days later, sent on a Tues and received on a Saturday. So overall, great way to save on a test and very prompt service!",
        "Found an adorable mid-century bean pot at the Goodwill and snapped it up. Then I started worrying that I might poison my family if I wasn't careful, so I ordered this test kit. I followed the directions for the \"leach test\" and the pot came up clean! (Yay! Baked beans tonight!) Just to be on the safe side, I tried the test on a piece of vintage pottery that I knew to have lead in the glaze and the results were positive. So it works. Ah, beans, beans the magical fruit....",
        "Purchased this as a less expensive alternative to testing our new home for radon. Test results showed very high radon levels. Ran another test and results showed next to no radon levels. Don't know if it was user error or what but a bit alarming the difference in test results.",
        "Product came with no lead testing solution. Solution must have leaked out a long time ago. There is a little sand like residue on the bottom of the container and zip lock bag. Not what I expected...",
        "I bought 4 test kits and they all worked as advertised. Two were used upstairs first and were sent to the lab via USPS priority mail. One arrived at the lab in 3 days and the other took 5 days. The kits were processed about 4-5 days after they were received. Same happened for the following 2 tests done in the basement. The pairs agreed within 1 Pcl/L. I wouldn't hesitate to use these test kits again.",
        "Although their fire alarms are unreliable (longevity is never what they say it is - not even close), they got this product right. Every aspect of the instructions is clear, and the results arrived when expected.",
        "I purchased a test kit and followed all of the instructions. I wrote out a check and sent the check and test samples together to the address listed. Its been 2 months and the check hasn't been deposited and never heard from the Lab.",
        "When we received the package the liquid used for the test was completely dried out. This item is not available for return on Amazon so I think I might be out $. I would not recommend this product.",
        "The instructions for this kit were very clear and easy to follow. There are only a few simple steps. I mailed my kit Priority Mail via the post office and received my results by email only five days later. There are those who complain they never get their results, I'm wondering if you didn't follow the instructions properly. This company strongly urges to mail the kit back using Priority mail or some other reliable express type shipping with tracking. Luckily my results indicated a level of only 0.9. Anything below 2 is acceptable. Thank you First Alert for this reassuring and user friendly test kit.",
        "Purchased this kit thinking it was all I needed to test for mold in my home. It is $15 per test in addition to what you pay for the kit, plus the cost of shipping it to the test lab (pre-paid envelopes would be great). Test came back and showed hyphal fragments, which could be good could be bad and do not provide enough information to identify any type of mold so, all in all this kit did not do anything for me and cost more than others I've seen out there",
        "This test was fairly close to being accurate. We had a reading of about 14.5 pCi/L in our house from this test and then had a professional come in and retest it a few days later, and got a 12.7pCi/L reading. Not too fair off, and still lets us know that we need to have remediation done. I would definitely recommend testing your house especially if you have an open sump pump. My only suggest is if you don't want to wait for amazon to ship you the test most county offices have test available to purchase for about $10 with the Lab testing.",
        "This test kit was a good deal for the peace of mind it has given me. I work in my basement all day everyday and wanted to make sure im not slowly killing myself (from Radon, not work). Follow the instructions, they're pretty clear. Use the website listed to pre fill out the form. Send the package in once the test is done and wait. The wait is the longest and most annoying part but its worth it. You get a report back with the Radon levels. Mine thankfully was extremely low. Common for the area. I can definitely recommend this!",
        "Some Radon mitigation companies will offer free testing, if you want to go that route. My only concern with that would be whether it is tested in an independent lab or tested in-house by that company (with a tendency to have a lot of \"false positives\" to increase sales of their mitigation systems). If you are looking for an INDEPENDENT LAB to do your testing this is a pretty good option. It was easy to use and reasonably priced.",
        "First Alert solution bottle was empty and the top could not be removed and Amazon says it cannot be returned bc it has a dangerous solution. Ha! DO NOT ORDER THIS PRODUCT BC THE KIT WAS USELESS! There is a button here below in the rating to let you add a photo but it is nonfunctional.",
        "I bought this because it was the cheapest radon test on Amazon that had solid reviews. I saw that you had to pay for shipping, which is fine. I mailed my results with USPS Priority on Monday, it arrived Wednesday, they send me the results Thursday (I paid for rush). Everything went great, they sent me a text letting me know the test was completed, and sent me an email with the results. I did not run any other tests, so as much as I would like to speak to accuracy or validity I cannot. But I will trust it.",
        "Easy to use, I mailed the test per the instructions--USPS priority mail. I received feedback, a full report, within 72 hours of sending. I did not pay for express lab results, and it wasn't necessary. We were able to take these results to our landlord to order a remedy for a high radon level. Very grateful for the quick service.",
        "Just a note, this seems to be a useful enough service, but you get stuck with the tab to send back the sample to the lab, I'd assumed that postage was included and this was all paid for with the package. So expect to pay another $5-8 to send a mailer back with the sample item.",
        "Its nothing except a plastic case to put something in and pay $15 plus shipping to see if something is mold. I thought this was an instant mold test",
        "I bought 3 of these kits to test my entire home. I thought that the price was pretty cheap. When I got the kit, instructions and everything inside was easily identifiable and very simple to use. Hidden fees that I wish I knew about from the beginning. If you live in NJ you MUST pay $10 for each test kit. It's a EPA regulatory fee. Then you must pay $6 per kit for shipping back to the lab. Hope I clarified these fees. Wish I knew before though.",
        "Most importantly I'm disappointed as the cost for the lab analysis is $15 each not $10 as stated in the description, resulting in an additional $45 I'll need to spend. Also I thought this tested air and it doesn't it only tests surfaces. I'm just sending the samples out now so I can not give an opinion on the results or that process",
        "I tested 4 of my coffee mugs, and three tested positive for lead. I wish I had done this a long long time ago. I'm throwing these mugs out and searching for US made lead free mugs. If you need to be convinced as I did that your china made coffee mugs contain lead, it's worth the 13$.",
        "The instructions included in the test kit say that they highly recommend sending the packet back by courier (FedEx/etc.) and not US mail, because it has to get back within 10 days of the end of the test. I mailed my test kit by USPS, it arrived there on a Friday, and by Monday when they processed it, it was past the 10 days, so my results were invalid. The recent USPS slowdowns (thanks Donald!) probably contributed. Anyway, the online information should say that you'll need to pay another $10 or so to get valid results. This hasn't happened with several other radon test kits I've used and returned through USPS.",
        "Used this in my basement as it has cracks and the dr recommended we test as he has had patients die from radon poisoning. I did the 96 hour test. The directions were easy and mailing it was a breeze. I mailed it thru the post office to have a tracking number as advised. Cost $3. Chose the email reply and received it promptly. As suspected, our levels are too high. Now I try not to be down there as much and air it as much as possible until my landlord decides what to do.",
        "I used this kit to validate the results of a professional Radon monitoring service that I used. The kit is very easy to use and the results were within 0.1 pCi/L of the other higher priced service. The results came back very quickly too. I did use the priority mail as recommended by Alpha energy for faster service and tracking. I am very satisfied with the product and service.",
        "I used this a few times as I was surprised my test results were so high but the two confirmed each other. This third one I just bought, though, now announces on their website that, while they will do the time sensitive testing right away, it's uncertain when they will get back to you with your results during the shelter-in-place order. Had I known that I would have waited to test and not spent the money now. But I guess that's to their advantage, right?",
        "Bought this to re-test my home for radon after installing a radon mitigation pump a year ago. Followed the instructions and sent in the kit for testing (NJ residents - requires an additional processing fee of $10). USPS was also approx $7 to mail it out. Easy to use and the results and report was emailed to me within a week. Happy with the kit.",
        "I used test per instructions, dropped in the mail, and received results 5 days later by email PDF (signed lab certificate). They even followed up a few days later to verify I received results. Was impressed with turnaround time even during the Covid pandemic (of course 2-3 days of the 5-days were just the USPS mailing time, so the lab processed the test results in a couple days from receipt. Peace of mind at a low cost.",
        "I assume it’s accurate, and I hope that it is. Vintage steel cabinets tested positive and all my windows tested negative. You will get the smallest possible amount of test fluid. You can probably get more than 4 tests out of it, but there’s no reason it’s this expensive. The materials in lead-test kits are inexpensive; the markup comes only because if you need to test for lead, you’re options are limited.",
        "Expect an artificially high result and then numerous inquiries to install radon remediation from local contractors. Your information is sold to locals who try to sell you a cheap fan in a tube for $1200. Try another brand",
        "I'd like to make this a 5-star experience but the truth is there isn't a clear way listed to contact anyone and it's been almost a month and I have no idea who to call. Very frustrating.",
        "The information is misleading. It makes it look like you need to send in $15 for extra information but you need to send them money to determine even the presence of mold. This thing is just some plastic test strips. It’s very misleading. This thing alone does nothing for you.",
        "Started by buying Airthings Wave Plus electronic radon detector for $230. Reading was 0.2 first floor but 6 in the basement. Action is 4 or higher. Radon fan runs $950 so I thought I'd do the old fashioned mail in type before this expense. $15 First Alert carbon pack spent 2 days in the basement and got mailed USPS $4.20 with tracking sent 3-4-20. Didn't pay the $10 expedite fee. Result came 3-13-20 and also read 6. Glad I will have the Airthings Wave going forward so I know my future radon system is effective. But happy both readings were 6.",
        "We did this and sent it in per their instructions, only to have our results come back inconclusive weeks later. Of course the feedback was user error. They said we did not send it in on time, but we did send it within the recommended time frame. I was tempted to retry this but the whole process is so cumbersome that I didn't want to get taken in for another spin and multiple weeks of waiting for results.",
        "Collected results in my basement from the Jan 15-17th, USPS priority sent from Ohio on the 22nd, they got it the 25th, and sent results back on the 31st. Lots don't include lab test price so this is a good deal, I will probably try it again and see how close it was to original, my results were pretty high in the basement, so I kind of want to try it on a higher level of the house too... obviously I have no way of knowing how accurate the results were, but fast and cheap, and gets me an idea if I should look into ventilation/mitigation.",
        "Simple to use, quick response. Just need to set the pack out away from moving air for 48 hours on a shelf or something per instructions. Fill out the paperwork, pack it up in the provided pouch and send it off. Takes either a 6-8 stamps for USPS or $10 with UPS. I tested twice with this kit, both methods got me test results within 10 days via email and a follow-up snail mail notification. First result was 14, second one was 18. First test I forgot and had windows open for a couple of hours so the results were lower as expected.",
        "Follow Diractions and Free Return for testing. It is important time issues, Do not forget or your test won't work! Get it back to scientist testing Fast, they located in Texas. Free Testing! The EPA is no longer an government info for Radon and other dangerous gases or chemicals that can harm us. Look at the EPA's map for Radon on the web, it will show you presents of Radon nationwide. Know youe risks!",
        "I would highly recommend this over hiring someone for testing for radon. It's a absolute rip off to have a home inspector do this test and charge over 150.00 dollars when you can very easily do it yourself for 10 times less with this kit. Everything is detailed and kinda dumby proof. The turn around time on the sample takes a little while but definitely worth the wait. Pretty easy to read the results as well.",
        "Test wasn’t accurate. Not pleased at all with the way to check on the results either. The phone number to check on your radon test is not a functional number. NO ONE ANSWERS AND YOU ARE UNABLE TO LEAVE A MESSAGE !!!!!",
        "Their radon test instructions did not clearly state that test was to be removed from bag. It seemed it should be, but was so confusing. Of course, the test was inconclusive. I spoke with Owen at the company who said, \"We have this problem all the time.\" I said that he might consider making the instructions more straightforward. Now I have to buy another one. Also, he said he would send by email a picture of the outside of the bag. So far, nothing.",
        "If you buy this product do not buy their recommended shipping label! Within 12 hours of paying $6 for their shipping label our cc information was stolen. I called and informed the company of the issue and they said it was not their issue and if they were \"hacked\" it would be on national news. I hope this information gets to those looking to purchase this product and those in charge of security at the company.",
        "While I think this might be a good test for most things, save yourself the hassle and questioning, and just use a mail in service if you’re testing paint. Especially red paint. It is easy to use and did give us a result, but it was still questionable, since you can get a false positive for other heavy metals. A mail away lab may cost a few dollars more, but results are fast and unquestionable.",
        "They give general instructions on the box on where to place the kit. The detailed instructions on where to place the kit are on the back of the sheet you're supposed to fill out when you send the kit in (after you've placed the kit in the wrong location for 4 days). Waste of money. Going with the AirChek kit.",
        "Update: The company resent the email with my radon results. It had somehow gone to my junk emails and I had no way of retrieving it as it has been deleted and the phone number online had been disconnected. So I’m happy to say that the company resent the email with my particular radon test number and results. I will follow up with another test in 1 year. Thanks",
        "This kit was very easy to use. I got almost double the amount of tests that it advertises with the supplied solution. I got some very obviously positive and some very obviously negative results. I did find that whenever possible, it was best to use the leach method to get the most accurate results. This product helped put my mind at ease with a few questionable items in our house.",
        "Seemed like a good value. Followed the instructions as well as I could. Was surprised to see such low results. Not sure why I expected bad news. Can't speak to the accuracy though without buying several more and comparing. Based on the results the instructions said I didn't need to bother double checking, so I let it go. Pretty smooth process to mail it in an receive results.",
        "I didnt realize it was the type of test I'd have to send somewhere to analyze. it's also one that you have to do scratch and tape samples on your own, which means coming into direct contact with the mold. I am not sure what I expected, maybe something you set over night and it analyzes how much mold is airborne? I need to do more research.",
        "The product discription online made it sound very user friendly. Unfortunately the directions were difficult to understand and poorly worded. I wasted most of the tests just trying to figure out how to use them. I’m still not sure I got proper results. Unfortunately it was a waste of money.",
        "Don't know if this was negligence on my part or just poor attention to detail...but I thought I would be able to detect mold directly with this kit. I didn't know you have to submit the sample to a lab to get analyzed. And yes its extra money obviously. $15/sample that you send. But I hear the lab results are solid and will inform you what kind of mold you got going on.",
        "I bought the test kit at a reasonable price and it was delivered within two days. It was easy to set up the test which I ran for approximately 52 hours. After sending the kit to the test lab I received the results by email within two days. To think I procrastinated on conducting the test for numerous years thinking it was going to be so complicated for something that is so important!!!!",
        "Shipped the product back (test completed) in the self addressed packaging. Has been over a month and have not been given my results. Called and spoke with “Mark” who said he would try to locate my test and I was told to call him back the next day. Several messages in to him have not been returned. Do not buy this test. Would give zero starts if I could.",
        "This was incredibly easy to use and the directions are clear. The one thing I did not really consider in the price was the cost of shipping the test to be processed. I shipped via USPS Priority mail and paid just under $10 to send. It does come with a self-mailing plastic envelope, but the postage is on you (kind of a \"duh\" realization). The report generates fairly quickly once received; two days for me after it was received. The report provides your radon reading and the EPA recommendation for what to do for any measured reading. This was exactly what I was looking for.",
        "We were so relieved to do this test on her own and find out there was in fact radon detector in the basement of the home we are planning on moving into. We were able to do the test for several days and then ship it off quickly. Because I selected the electronic results I got an email the next week with our results of the radon test. It helps us have peace of mind knowing that we are going to remediate the radon and have a safer home for all of us to live in.",
        "This kit was extremely easy to use. Simply record your start and end data on the one-page form included, place the charcoal packet at the lowest level of the home, and then retrieve it and mail it in with the pre-paid envelope provided. The instructions were clear. Results were reported to us via email in a little over two weeks.",
        "I bought this kit after reviewing several different ones. Most of the houses in my subdivision have radon mitigation systems, so I wanted to see how my house would test. The kit can be registered online, which simplifies the process. I ran the test and sent the kit to the lab. Results were made available via email in about a week.",
        "It works fine, and agrees with other measures of the same radon. I highly recommend that everyone should test for radon everywhere. It's present in more places than people realize, and varies drastically from one season to the next.",
        "Works if you follow directions. Just be sure to do exactly as they say and don't expect quick results unless you pay for a RUSH service. Used two of these and got results, then purchased a digital radon monitor and got the same results. I feel confident in the digital monitor now as well as the test kits.",
        "The test was extremely easy to administer, put it in my basement for 48 hours, packed it up and sent express mail. I received my results back in four days via email. That was the good part, the bad? My reading was above recommended levels. I ordered another kit and will be re-testing in another month or so. Another neighbor had to have Radon testing as they were selling their house and the inspection required it. They were the reason I tested as they have high levels also. The mitigation cost them $1200.",
        "I completed the test exactly as instructed and sent it to the lab in the provided padded envelope. The lab said they could not run the sample because the paper back of the test had been tampered with. It was fine when it was sent, so there must have been some damage during shipping; if the test is so delicate, why not provide shipping materials that will better protect it? A waste of time and money.",
        "Ran 2 tests in parallel eight feet apart more than .8 picocuries per liter (pCi/L) discrepancy from one to another. According to the EPA, the maximum “acceptable” level of radon is 4.0 pCi/L,",
        "I wrote down the serial number of the test incorrectly but the test company was kind enough to search for the test results using my address and date. They then emailed the results. Also responded very quickly to my emails. Given my mistake, I would take a picture of the sample with it's serial number rather than writing it down (I even double checked it!)",
        "Wasn't too difficult to use. My test originally came back \"inconclusive\" because I didn't put the end date/time (I did in another section). Once I replied back with the date/time they sent me the correct result. Results came back two days after they received the package. Pretty easy, just read directions carefully.",
        "We purchased 2 of these tests and put 1 in our finished side of the basement and 1 in the unfinished side. Instructions were clear and we got a prompt response when we mailed both in for the results. So glad we did them - as both came back high so we got someone to come out and install a remediation system quickly.",
        "I bought this thinking the results weren't a separate product. To get the results you have to pay $15 each per sample. Oh and they want you to send in your credit card information through snail mail. Get with the times. There's no way I'm sending sensitive information through the mail so someone can open it and steal my info.",
        "Fast delivery, very reasonable price. Easy to use with good instructions and quick results. Other tests require $40 or so payment to give results of the test after purchase, this one is free!",
        "This product is excellent and easy to use. I paid the $10 for expedited results. Two days of shipping and my results were available online the same day received. My first test was high. I am so glad I tested our new home. My kids' bedrooms are in our finished basement. Radon is one of the leading causes of cancer. My builder installed a radon unit. Sealed the cracks and put a radon seal on the wall. Our next test came in at .67. AMAZING. Don't take a chance with yourself or your children. I am going to run this test annually.",
        "We wanted to check radon levels at a house we were purchasing, and this test kit was very simple to use. We placed it according to directions and picked it up 2 days later. We paid extra for overnight delivery to the lab. A mailing envelope is included, postage is not. We paid the $10 extra fee for expedited testing. The lab received the kit the next day, immediately ran the test, and posted the results that same day. So if you want results right away, this kit was fantastic.",
        "The kit includes tape, and a plastic case. You use the tap to put on the area you think has mold, and then you send up to 9 samples and anywhere between $15-$30 per sample to get tested. You could just get a particle tester and it'd be cheaper, or buy some 3m tape strips and it'd be cheaper. This product was useless.",
        "Worked well. Alleviated a lot of worry. Read the instructions fully and schedule when u will start and stop your test so u can send it out on a Monday morning. I put the mailer they provide into a small box and send it priority / overnight so it got to the lab by Weds. for the lab to test.",
        "Test was pretty easy. Instruction were detailed. Fast results. The only problem I had is they share your information with a radon midigation company and you start getting junk mail from that company in my case it was MidAmerica Basement. I’m sure they would deny giving out your info but it’s kind of odd I never received one piece of mail on radon til I used this test.",
        "Initially I though this was a great price for the test kit, until reading the instructions and finding out there are significant costs associated with the testing when sent to the lab. In this case, you don't get what you pay for, or maybe you do. It just does not include testing results.",
        "Amazon stated that the test was prepaid and I had to send more money into the company to get the test results",
        "This set basically contains a small test tube, 2 Qtips and a test solution. And the solution vial was dried up, rendering the kit completely useless. To top that the product is not returnable because of the chemical involved, which was technically not there :0). Five star to Amazon customer service for processing my refund.",
        "You use either a sample bag or tape to send samples to them. You're charged lab fee per sample. Quick concise results via email. If you want further analysis that is available but you have to select that option before you send out the samples. Easy to use. I'd use it again.",
        "I got two of this to see if I got the same results, but one is different than the other one, so I dont trust it too much."
    ]
}