{
    "entity": "Gas Detectors & Alarms",
    "text": [
        "There's quite a bit of paperwork involved to record results, serial numbers etc and ship this to the right place at the right speed, but it's still a lot cheaper than the kits at the big-box stores, and you're able to get quite a bit of very useful data from the testing company about past results in your neighborhood. Even with the extra fee, worth it for NJ residents.",
        "This definitely works and is priced lower than competing models, many of which I suspect are exactly the same thing (and tested by the same lab). I took two stars off mostly because it came with no instructions, and thus I didn't realize until I was done testing and filling out the form for the lab, that I was supposed to record the time the package was opened (= the time the test started). The box looks like it might have been opened, so maybe this one was a customer return that they reshipped.",
        "Are used these in an apartment I am renting. The results came back 8.9. My landlord had a professional service come in and their equipment measured 9.2. They immediately scheduled a radon evacuation device installed in my basement. May have saved my health",
        "I was a little uneasy at first, but i read the directions and this was easy to do. The instructions was straightforward. I sent via Priority Mail as recommended by instructions and received my results quickly.",
        "Specifically says to place BOTH packs, next to one another, 3-4 inches apart. The package only contains 1 (one) pack. Only just read entirely through instructions because now is the time to do it. Had I read the entire instructions upon receipt I would have definitely returned the item. Now I am past the 30-day window. Buyer beware and make sure you got what you need.",
        "Ran the test and mailed it with US Postal Priority mail on Christmas eve ... got our results in under a week (I did put my data into the company's web system to help speed it up). Very clear report, love the details.",
        "Ordered two kits neither of the came with any instructions. Called customer service and got put on hold and then disconnected.",
        "Was easy to use with clear directions. Test results from state showed minimal radon in my basement. Yeah!",
        "Excellent as a preliminary screening test. The processing lab we sent it to went above and beyond to help us through some questions. Be careful to closely follow the directions, and if any questions call them. We will use again in a few years to retest.",
        "No instructions included, even though they are mentioned in the listing, on the box and on the lab form. Had to google it, even then couldn't find them on Kidde's site. Used generic instructions found online.",
        "This test put my mind at ease. The results came back quickly.",
        "Ordered and placed, sent into lab, never received results or feedback, waste of money",
        "Test went well. Easy to use, returned and got my result within a week.",
        "Kidde's good homeowner stuff. Easy to use. Kit looked like it had seen a dusty shelf too long, but it was dated and not out of date. Report came back with only postage fee. Very detailed report with future instructions for various levels of readings.",
        "Item is simple to order, use and get results quickly.",
        "Guess I have to love it . . . . no radon worried here. It was slightly lower than our previous test at another lab.",
        "Cost more to ship test package to lab then the test package cost!",
        "a scam. never got any results. told me it was the mail's fault, and that I could have a free test kit. that never happened either.",
        "Kit works just as advertised. No other fees other than shipping fee to send it to the lab.",
        "Ran the two day test, mailed it in for a couple of bucks postage, got email results. No extra charges, no issues!",
        "I purchased two kits. One of the kits came with the seal open so we did not use. The other kit we followed directions and mailed our kit to the lab. We instructed to have our results sent via email. After a few weeks with no results I called. The lab was super helpful and promised to email the results again, plus gave me the quick result over the phone. Again, results never made it via email. I left a message with the lab to have the results mailed and that never happened. Overall, I'm not sure if I would use these kits again. Or if I do, I would have them mail the results instead of email.",
        "The test kit was easy to use and the results were sent to me very quickly.",
        "This was an all around good experience with this kit.",
        "Easy to use and I liked the fact that the \"reading\" of the results was included in the price",
        "Followed the instructions, sent it to the lab, got results fast. Great value for money kit.",
        "This item did require separate postage to mail, but it was pretty easy to use and the result came back pretty fast.",
        "I found this kit quick and easy to use. I got back a very low radon result, which confirmed what we had found when we bought the house several years ago. The margin of error is high enough that I think if I had gotten a result on the edge I would have felt like I needed a more precise method and a retest, but for a clear-cut situation like ours, I think this kit was sufficient.",
        "I did two tests of my basement a couple of months apart...results were the same both times. Process for using lab couldn't have been easier and the Amazon price was better than any big box retailer.",
        "Excellent product and service was really fast in New Jersey. I will recommend this to anyone that need to do the test, it was really easy following the instructions.",
        "I paid the money, followed directions to the T, even sent it Priority Mail, but never received the results. This was a year ago, and nothing. What a waste of my time and money.",
        "Didn't like the results but the seller was easy to communicate with and very informative.",
        "Followed instructions, mailed as instructed with three stamps. I didn't bother to weigh it like i should have. Came back to me for insufficient postage. Can't resend because the test will be inaccurate.",
        "Was not able to get test completed, do not recommend lab, utilize state test kit quick completed test results with lab no issues",
        "The only other cost is shipping. I got my results emailed quickly, and could track the progress of the sample in the meantime. It was easy to do and I'd definitely do it again this way.",
        "Very easy to use. No instructions came with my kit, had to lookup online how to place unit. Results lined up with past measurements, so assuming its accurate.",
        "URGENT WARNING: Warning: ConsumerReports.com found that the Accustar CLS 100i and the Kidde short-term test kits inaccurately reported 40 percent lower radon levels than actually existed. Results from two labs concurred.",
        "I live in an area where Radon is not a major concern, but I watched a news report locally that mentioned that some areas in my region were susceptible to the gas. This kit is easy to use. I recommend sending your kit in using a priority service to guarantee delivery (as you can track it) and to get the results back faster. I did not have a problem using this kit or with customer service as some of the other reviewers have complained.",
        "Instructions say \"should include two charcoal radon sampler\" There was only one in the package. Would this still show accuracy with only one? I will update rating after testing.",
        "We purchased this radon kit and used it exactly per instructions. My results were emailed to me in were extremely high (20pCi/l). We ended up paying for the hourly reading (Radalink Radon Monitors)from a home inspection company licensed with the equipment. The results were much different - luckily low levels of radon(1.2 pCi/l). I'd say save your $20, heartache over possibly having to purchase the radon fans, and call a home inspector for a more accurate reading the first time.",
        "I'm not sure why there have been so many complaints about this product. I followed the instructions, sent the kit in, and received results. I did notice that the email containing my results went to my spam folder. I'm assuming all of these people that say they never got results requested an email and never thought to check their spam folder!! I would definitely use this product again, and have already recommended it to my friends.",
        "Looks like all the negative reviews have this kit pegged; Consumer Reports, which I pulled up to read, after reading most all of these, agrees. Lowest accuracy and lowest reliability. Thanks for the warnings about the customer service, too. I'm returning mine, purchased but unused, to Lowe's straightaway. Saved the frustration!",
        "I was meticulous in completing the required exposure, documents, and shipping. We placed the kit as described in our new old house for 3 days ending on 1 April. We mailed the kit from the Post Office using Priority Mail on 4 April. The company stated they did not receive the kit until 25 April and therefore did not perform the test. This was a complete waste of money. Do not use this company.",
        "Just as someone else had reported, I packaged up my test, applied the 4 - $046 stamps as the shipping envelope had indicated and sent it off on 02/12/14. Well, today is 03/07/14 and I just received the package marked \"Return to Sender\" because they wanted one additional stamp. According to Alpha Energy, the test is now too old for them to test so this is a complete waste of money, postage and time. Do yourself a favor and find another company to work with.",
        "I followed the instructions sent it in and got results. Just as stated. No problem.",
        "The worst rated of all the tests on the Consumer reports site, with a score of 8 out of a hundred.",
        "I sent my test in about a month ago. Used second day air like they recommended. I have yet to see any results. When I tried to find my test on their website, I was told my kit id was invalid. Total scam."
    ]
}