{
    "entity": "Gas Detectors & Alarms",
    "text": [
        "The detector came not in a good condition. All packaging stuff looks good to me, no damage during the delivering. When I shake the detector, I can hear something loss inside, not sure if some plastic thing was cracked inside. But it works ok, because the mechanism is very easy. When the detector detect the air/gas flow, it will alarm, higher flow rate, higher alarm sound. Besides that, you cannot get too much information from the detector. I don't think this device really worth over $100 .",
        "We got this as we thought we had a gas leak. Turned out we had a venting issue in the plumbing line and did not need this but it does detect gas by the pilot light and you mouth. In the bathroom since we were working on it at the ceiling level it detected gas but we had the toilet off the flange. We first would turn it on. It will made the beeping song. Take it outside to fresh air then come back in for readings.",
        "This Product is great for Home owners,Commercial Owners,Professionals As a plumbing company we deal with gas a lot. We have tried TIF along with other high dollar detectors and this works just as good maybe better! and you don't have to worry about forgetting to charge it when the battery dies down. All it takes is one 9 Volt battery. if your buying one of these we recommend getting the CaseSack Detector Case CD100A to protect your investment. You won't be mad that you picked this up.",
        "Easy to follow instructions. Easy to use unit. Was purchased to help Identify Hydrogen sulfide leaks in a semi large battery containment rm. Found several issues with our containment area we were not aware of. This helped us make a more informed decision on where to seal and how to seal the gas leaks. Possibly prevented a very dangerous situation. Worth every penny. Highly recommend. If you work with batteries, this is a must have addition to your safety program.",
        "I work on gas fireplaces. My unit just stopped working yesterday after 6 months of service. Sending in for a warranty repair today :( I had to send it in for the repair. I paid the shipping. Got it back and it didn’t even work over a day. Had to send it back again on my dime again :( waiting for it to return again.",
        "We had a very slight smell of gas from our gas range. I applied a bubble solution to all the gas line plumbing and found nothing. Then had a service technician come out who basically did the same thing and found nothing. I bought the UEi Test Instruments CD100A Combustible Gas Leak Detector and immediately detected the gas coming from the vent above the griddle portion of the stove and let the detector lead me right to the electronic gas valve which was the problem. Leaks from gas valves go right to the burner and can't be detected with bubbles so this is the only way to go. Only took a few minutes to find the problem. Worked great!",
        "This unit performed as advertised. I used the unit to test, successfully, for leaks on a Propane stove. I also used the unit to, check its accuracy, on an unlit Propane BBQ burner assembly, again successfully. Thank you for a reliable and safe method for detecting Propane and gas leaks. JOHN NORQUAY",
        "This was purchased for a Christmas gift, box had been retaped, inside not in plastic sleeve, and battery shipped in it. Looked to be returned, hope it works ok, as bought for a gift.",
        "Works like a charm. After having the gas company come out several times to both our house and our neighbor's over the last 3 years and finding no issues, I finally got fed up with intermittent gas odors and bought this detector. Within 1 minute of opening it up and reading instructions I was in the back yard searching for the elusive leak and BINGO about 45 seconds later this meter was screaming at me. How the gas company never found this substantial leak is beyond me, but we now have a brand new gas main and I sleep better. Great, well-built detector and very easy to use. Highly recommend.",
        "Works fine, very sensitive to leaks or ambient gas in the air, which is a good thing since any leak still needs to be found. Fast start up and quick reaction to games. Unit just feels cheap like plastic. Wish the volume was adjustable. Soap bubbles set this unit off just like gas does. Use in dry conditions or it will seem like everything leaks. Bubbles showed no leaks anywhere.",
        "Worked OK for a few months, then... Drains the battery after just a few hours - and without showing the low battery indicator. Adjustment knob/dial spins freely without making any ticker adjustments. I thought that this was a quality tool, but I've read several other reviews complaining about the spinning dial. I use this tool in my building science business and find myself more frustrated than happy with it.",
        "This detector most definitely works. I ordered it because I could smell natural gas in my pool pump room. It arrived and I immediately tested it out. I found the small gas leak down to the exact location. The tic rate feature is the best part. I called my gas company and they came out & shut the gas off so the plumbing company could make the repairs. I feel safe knowing that I can check all my appliances and fireplaces anytime. It's not the high-end type you'll see the gas company carry, but it's high-end for residential applications. Make sure you read the instructions on use carefully. It works only if you follow the instructions.",
        "I wished it worked. The box came in already opened in the Amazon envelope so I wonder I might have got a used one. I was so excited to get it and it seemed to detect order when I comparerd between outdoor and indoor air. But then it beeps even in a pile of fresh laundry so I wonder if it detects all scented materials not just gas. After a week it stopped calibrating, returned it. I really wished it worked cause I need to detect odor in my house that plumbers can't find. SIGH..",
        "In addition to testing for natural gas leaks this instrument has proven extremely helpful in locating sewer gas problems. Several times our \"sniffer\" has detected sewer gas we could not smell. Recently our company did the installation of new DWV and water piping on a remodel job but the homeowner decided to save a few dollars by doing his own demo work. He didn't realize that in addition to cutting off the pipes he needed to cap them. We were called in when his newly remodeled home smelled of sewer gas. Using the UEi \"sniffer\" we were able to locate the uncapped DWV piping and prove to the customer that it wasn't our work that was deficient.",
        "Smelled gas underneath fireplace and gas company found leak. Plumber was horrible so I purchased this and it came the next day. As a test, this detected what my gas company did. I was able to finally fix the leak myself and verified with this. Worth every penny. This sensor is very sensitive to natural gas. I had purchased a General Tools sensing stick from Lowes but it doesn't detect slow leaks. Pretty useless compared to this.",
        "UEI admits that it responds to many more gasses than they list, but I think they should mention that it responds to water vapor. Put sensor over some distilled water, or just walk outside when it's humid, and either way the thing goes crazy. I guess it could be useful for finding leaks around doors & windows when humid air is leaking in, but I'd say it \"cries wolf\" a lot if you're specifically looking for solvents or combustible gas. Note it does not indicate how much (if any) gas is present, just a relative difference between two locations, indicated by speed of beeps. Wish it had a numeric readout.",
        "If you have an RV with propane appliances you really need one of these. After days of chasing a propane leak with buckets of soapy water, I got one. Five minutes to read the directions, 30 seconds to find the leak and 5 more minutes to fix it. With a little fiddling with the sensitivity control it will get you close, then lead you to the exact spot.",
        "I smelled gas. For months. But after checking every gas connection I couldn't find the source. This isn't the cheapest detector available - but well worth the money for the accuracy. When I calibrated the unit, then brought it into the house it began ticking like a geiger counter. When I reached the area where I smelled the odor of gas it was clicking so loudly that, if it had been radioactivity, I'd be dead! We were able to track down a pin-hole size hole in a copper pipe under the house. New gas pipes - and I'm safe! At least I'm lucky I don't smoke...",
        "Our furnace had a gas leak that was detected with an annual cleaning. So no telling how long it was there. Bought this for piece of mind. We now can check daily in just a few seconds to make sure we are safe.",
        "I got this to use to test our propane system on our cruising sailboat, on which we live. I have had a pesky leak for some time that I have not been able to find with soap solution. I replaced almost everything, but still had the leak, which I traced using the instrument to the solenoid valve. The tester went nuts even though the soap solution showed nothing. I would give it 5 stars except for the design of the sensor arm. It is so stiff that it will not sit in the flimsy catch on the top right side. I have to use a wire tie to secure it. Otherwise, I great unit at a nice price.",
        "This is a Great Detector, does more than I expected. I wonder how well I could really do my job before having the Detector. If your looking for a Great Detector at a Great Price, you have my Recommendation to Spend your Hard Earned Money on the UEi - CD100A Combustible Gas Detector !!!",
        "I had been smelling gas for a few weeks. My husband ordered this tester and immediately found the source of the leak: a nail from our new roof installation had been driven through a gas pipe. This tester quite possibly saved our lives.",
        "I bought this to test for a possible gas leak from my stove. I tested it by putting it next to a burner that had gas coming out but did not light...and it went nuts. It did not detect anything else thankfully and I was relieved. My only complaint is that you have to set it by turning on a knob on the side which clicks on and you have to adjust it to about a 1-2 second beep, which can be hard to do since the knob is somewhat touchy.",
        "This gas detector does not correctly detect gas leaks, gives false positives and for home inspectors it is something that is not acceptable. The handle of the detector expanded at the first moment that it moved from its initial position and the quality of the product in your hands is seen at a glance that is of poor quality and not as it appears in the photos, it is seen that this brand invests in marketing and cheat people. I need to return it and get my money back.",
        "Have for years used the bubble liquids for testing and wanted another option. I find this tester works really nicely. One has to allow it to \"sniff\" the air around the joint a bit for small leaks but for major gas leaks it fires off immediately (I tested with an unlit propane torch). I found a tiny leak in a furnace installation that would hardly bubble the liquid test. A very nice addition to my toolbox. A padded case would be a nice addition to the product.",
        "Overall operation very good. It would be nice if it came with a case, and the flex stem is a little floppy, but good quality other-wise. Unfortunately it stopped working right at 2 years and 3 months. It says low battery continuously even with a new battery...Useless now.",
        "This is the kind that checks constantly while you are using it, and you set the cadence of the clicks for the no leak. I had previously purchased a different instrument that only made a sound when it found a leak, and automatically calibrated the background no leak level. Too much automation, and not enough feedback so I returned it. This one works great, cost less, and I feel that I can trust it more.",
        "I use this during my home inspections. It seems to work as asvertised. I've \"found\" one gas leak with it so far,, although I was able to detect the leak by smell before I even busted the tester out. It did go off as it should. Make sure you read and follow the directions and this is a good addition to my home Inspection arsenal or as my gf calls it, my marry poppins bag.",
        "Great. So glad I bought. I tend to rent old pre-war apartments and houses and they tend to have gas leak issues. Rather than wondering, \"Do I smell gas?\" then hesitating to call the gas company over a false alarm, I got this and it was smart. Used it several times to confirm leaks, which makes me feel like I'm not wasting anyone's time by calling Gas Company to fix. Gas leaks are very toxic, not to mention, obviously flammable.",
        "We use this propane detector for our RV business. Very effective, easy to use and sensitive. We're buying another unit to put on an additional mobile vehicle.",
        "This works great. Remember to re-calibrate it if changing environments like going inside to outside or even different rooms if they have different humidity. I got this to detect leaks because I smelled something but it turns out my neighbors sewage was leaking underground. I tested it on real stuff and it works great.",
        "The Gas tester arrived promptly as promised. I had a problem in a outside storage area where my furnace was and could smell gas when the door opened but dissapted quickly. The tester quickly located the leak and I contacted the Gas company who came out and tightened a loose connection. How this connection came loose is unclear but is fixed -no explosion. Great serice, product and pricing.",
        "This meter looked used. I have purchased many new meters. Never have I gotten one with the battery already installed and the meter just sitting in the box without plastic wrap.",
        "As an appliance servicer and installer we have used several different brands and makes - all having their pros and cons but I find myself and most of my crews - grabbing this unit before any other when sniffing for leaks. It calibrates fast, has adjustable sensitivity, and lights the area it is testing with a red LED. Easy to use, durable, and reliable. The only Con if there is one is that it doesn't come with a protective case - kind of a bummer but not a deal breaker",
        "works great sure beats the soap bubble spray, found a leak i didnt know I had, the gas companys not going to like me when they have to pump out my 100 gallon tank to fix the leakey valve. Used this pouch and it fits the tester perfect (none comes with it)",
        "Easy to use. Does take a minute or so to calibrate. Helped me find a gas leak missed by pros with soapy water.",
        "This thing is great. I have a really sensitive nose and I kept smelling this weird hint of natural gas in our home. My husband thought I was crazy, so I ordered this and it confirmed a very small leak in the pipe by our water heater. The plumber came and fixed it that day. This device is super easy to use and very accurate. Having it on hand makes me feel pretty secure - it was well worth the investment.",
        "Great easy to use combustible gas detector. A must for every home. It detects leaks in pipes much better than bubbles. I test my appliances once in a while to keep comfortable with the meter and make sure there are no leaks. They should have an option for a hard case at an extra cost.",
        "Detected underground leaks in multiple places. Called out a professional with more sophisticated equipment to work on the leaks only to find nothing was leaking.",
        "It came right out of the package ,and my wife was running all over the house and garage with, it and she came and got me said I had to come out to the garage \"I told you its coming from the garage look at this thing its going crazy \" and it was from the fumes from the leather cleaner I just sprayed all over her seats in her Buick LOL but this device works so so well Thanks now we have a piece of mind when it comes to ANY gas or fumes thanks again !!!!!!!!!",
        "This tester is accurate enough that it goes off when waved over a gin-and-tonic. I suspected a leak for a couple of days but couldn't find it. I had this over night delivered and discovered the leak was in the underground pipe leading to the house. The crews were here during the night replacing the pipe. The peace of mind this tool gives is well worth the price.",
        "Works perfect if you can follow instructions! Obviously some people can't. It's a sniffer. It compares air samples. First local clean air, then air around pipe or fitting. Very simple to use and very accurate. A lot better than my nose!",
        "This unit was purchased by our condo association to assist in locating gas leaks coming from condo units. We've had occasion to use this twice now and in both cases this device accurately pinpointed the unit and where in the unit the problem came from resulting in quick resolution of the situation. The device has more than paid for itself.",
        "Bought this product because my wife and I were waiting on closing on a house so thought it would be a handy thing to have around. Also because one of our requests before closing was to have them get gas leaks fixed at the outside meter and near the furnace inside and wanted to recheck them after they had the repairs made. After they gave notice the repairs had been done, checking over them again with this detector shows there still had been leaks! Great tool to have! Check around your gas stove, gas hot water tank, furnace and dryer. Great comfort in knowing you have no gas leaks even if minor.",
        "Gas tester worked as described. I had a gas leak in my fireplace and used this tester to identify the leak. The gas company could not identify a leak which was very annoying because I could smell a slight smell of gas! After I had a new valve installed, I sold the gas tester to my plumber. He liked the tester too!",
        "The plastic cap which is supposed to protect the sensor is extremely fragile. It broke off almost immediately and then kept falling off in my tool bag. Evetually the sensor snapped off. Stupid.",
        "Great little machine. It definitely works well. Takes a little practice to learn how to use it correctly but once you figure it out you can hone in on a small leak very quickly. The added bonus was we told my teenager it was a breathalyzer and had fun playing games with her till she realized it was a joke. Good machine.. buy one!",
        "I set it up and checked the gas pipes around my water heater and furnace for leaks and found two small ones. Tightened joints and no more leaks. These joints were in hard to reach and see places in joists around furnace duct work. I had used liquid leak detector when installed and saw no leak but this device found them even though small.",
        "Purchased in February 2014, this detector has endured only light, careful use and the thumb-wheel stopped working. Reading through these comments I see I am not the only one. Useless now. Also, while I am venting here I would like to point out that the clip for the flex-line should be repositioned on the plastic casing or a slightly longer flex-line should be used in a future redesign as it is always a struggle to get it wrapped around and clipped. This could be a \"best for the money product\" with some simple improvements. For now stay away!",
        "Great sensitivity adjustment from \"good\" to \"outstanding\". Nice loud click volume, plus earphones can also be used. Led beam at sensor end really helps me see exactly where I have the head positioned. No carry case was provided. The clam shell packaging was cut and the sides split. While the product works well, what I suspect is that someone bought, used, then returned it. Vendor then \"repackaged\" it and shipped it to me as \"new\". I can't find a place to rate the vendor 'Fotronic Corporation dba Test Equipment Depot' (whom I'd ding), but the product itself rates a full 5 stars.",
        "We had a gas leak behind the dryer and realized we really needed to have a gas detector. This gas leak detector is excellent and easy to use for the novice or experienced pro alike. The directions are clear and easy to read. We were able to determine very quickly how much of a problem we had. Definitely recommended.",
        "I actually bought this one to replace the same exact one that I used for years, but suddenly can't find. Love this tool - works great.",
        "Quick delivery, and as advertized! Workedgreattofind a leak that soap wouldn't.",
        "This helped me save time and money by finding the gas leaks in my basement. I was able to get them all fixed at once, instead of having the gas company come out multiple times. The gas company only looks for major leaks so if you catch whiffs of natural gas at times, use this product. It is far superior to the bubbling soap method.",
        "So far an excellent tool to use, have not had to use it for real yet. But so far so good",
        "We had a very slight \"gas smell\" in a back bedroom off and on for months. Gas company came out and couldn't locate any problem. This detector helped me zero in on a very slight leak within an external wall from a corroded pipe. It doesn't provide a read out on the amount or concentration of gas, but clearly indicates when one moves from a lesser to greater concentration. You set the detector for a base level reading and it indicates increasing concentrations as you get closer to the source. The long flexible probe makes it possible to explore difficult-to-access places. Very easy to use.. just read the brief directions. I recommend it.",
        "Finds leaks that don't even show up with the soap spray method. If will find leaks that you can't even smell gas leaking from the pipe joints. Detected a leak on the connection on the flex pipe going to the dryer. Re-taped and tested again and no leaks found. Will even detect CO2 by just breathing on it.",
        "We used this and were able to locate a small gas leak in our basement. I am not a plumber by trade, but this seems like a very professional quality tool and worked well. Just need to keep it away from the kids who seem to have fun using it as a fart detector.",
        "I purchased this unit to make sure my appliances weren't leaking any gas. It works really well and is sensitive. It's so sensitive that if you place it near an open bottle of rubbing alcohol it will go off. It's worth the peace of mind knowing the appliances are hooked up correctly and not leaking any gas.",
        "The detector works great when it works. I purchased 3 of the detectors, the first one the on and off switch broke and the other 2 the caps fell off the sensor and the sensors broke. I'm not purchasing anymore of these.",
        "I own a remodeling company and this thing works a lot better than the standard test of spraying soapy water on joints to see if they leak. I was able to take this under a cook top and pin down the actual fitting that had a leaked, not just the general area.... A good investment for someone to go in and test for leaks once their guys are done hooking everything up.",
        "this is great. we had a plumber out that used one of these to trace a 'smell' and he bragged how his unit was so awesome, so expensive and how it made him invincible (mostly what he said). This unit works way better and he even borrowed it. Enough said.",
        "This is very sensitive and easy to use. I had a problem where my plumber, who didn't have a gas detector and has a poor sense of smell, could not locate a leak that I was smelling. I purchased two of these, one for him and one for him, and it only took him a few minutes under my house to pinpoint the leak. It turned out, a fitting was loose.",
        "Great detector but weak sensor end cover that covers the red light. Doesn't take much to fall apart when trying to put it back in the holster on the device. A thin piece of bllack gorilla tape around seam for now... Works great sniffing for combustable gas.",
        "Bought this to sniff out my propane stove and connections when my wife kept complaining she smelled gas. The unit did not detect a leak but did alarm when I tested it over an unlit gas burner so I'm assuming I",
        "I kept getting just little whiffs of gas every once in a while and decided to buy this. Sure enough, I found a leak and called a repairman immediately. Even the repairman said this was a good product.",
        "What we needed to verify a leak on a gas pizza oven. Came quickly, and works like a charm.",
        "I've used these over the year and have had fairly good service out of them. This last one lasted about 3 weeks . I used it maybe 5 times. I've always had a special carrying case to protect it. i sure hope the extra warranty works out.",
        "I was able to check that this works by testing the gas from the sewer access as well as natural gas from the stove. It does not give a quantified reading or anything like that, just a series of beeps but it is sufficient if you are just testing for the presence of explosive gas.",
        "Works pretty good only thing I’m worried about is that the sensor will get weak overtime",
        "We found the leak and the other leak. Didn't know we had two. One was in the house and that was the one we didn't know about and the other was outside and that was the one we had knew about but wasn't sure where it was.",
        "Worked perfectly until my tech left it in a coach and we'r never got it back....",
        "I use this instrument to test for propane leaks on an aging travel trailer. It always finds the leaks. It can also detect the unburned propane inside the trailer from the inefficient heater. Worth every penny.",
        "This is a very very sensitive leak detector, I can find leaks that bubbles can't. I had to re-secure the on / off switch with loc tight. No other issues with it since then (it was an easy fix). That is the only reason I did not give it five stars.",
        "Purchased when I rebuilt the furnace in my 5th wheel. Works excellent for sniffing out leaks in hard to reach places. Very happy with my purchase.",
        "Excell. I really look like i knw what im doing when i use this",
        "Life saver. Paid for itself on the first use. Was able to find and fix a gas leak myself. If you own property this is a worth investment tool. It will detect a hugh variety of combustible gases.",
        "Great tool to have in your truck. It seems to be very sensitive, picking up the slightest amount of natural gas. Paid for itself the first time we used it to detect a small leak resulting from a hairline crack in a trac pipe fitting. We have also let the plumbing inspector use it to test repair work that wasn't under a pressure test. Easy to use without a long learning curve.",
        "This is one of my favorite tools. Accurate and dependable.",
        "I wasn't able to use this tester because it arrived damaged. The battery door was broken in two places and a replacement item was ordered. This tester is a bit pricey but the battery door is very cheaply designed and made. It was apparently broken by the manufacturer when the battery was placed in the unit prior to shipment. I don't have a good feeling about the longevity of this battery door given that it broke the first time it was opened. The manufacturer should redesign the existing battery door to prevent this from occurring in the future. I'm fairly certain that the battery door will break the first time I have to replace the battery on my new tester.",
        "It has done everything I could have asked for , when my wife said she could smell gas I told her, I didn't but I would check things out the smell with my new Gas leak detector UEi-CD100a. Not only it found the main leak but I found three other small leaks and fixed these also. This is a great tool, I will recommend this to all my friends. Glen",
        "Used it to exactly locate a gas leak, way below what a bubble test could find pinpoint.",
        "Worked great when it was new, but after only 10 sessions, the dial switch broke and now I can't turn it off or adjust the TIC rate, so now I have a $130 paperweight.",
        "I love this ....I have never used or owned one and needed to test for a gas leak...works like a charm ...made me look good and professiona.",
        "any one dealing with gas / propane etc. should own this device. it is worth every penny.. really sensitive, which is a good thing awesome",
        "This thing does exactly what it says. Finds the smallest gas leaks. Mine was literally a pinhole at the back of the pipe. Forget the bubble soap. Too ineffective. This is a top notch tool.",
        "Have had the tester for a few weeks now. right away found the leak I was looking for and one I could of not found without the tester I like that you can change out the sensor. Good buy",
        "VERY sensitive!! Found the propane leak in my travel trailer that I would have never found without it.",
        "This is a great unit for the money and way better than cheapie household styles. It is put together well and seems durable enough to last for years. The adjustable sensitivity works well.",
        "My dad say he occasionally smells gas in the basement which i never did so on a hunch i brought this product just in case follow the small booklet direction and to my surprise found 2 gas leak on near the dryer and one near the boiler so call the gas company and they comfirm and fix it that day",
        "I didn't know if it was worth the money, but build quality surprised me. Found every leak easily, the city gas employee came out and asked me where I got the meter. He liked it better than his.",
        "This tester works perfect for my needs. It's very light and easy to handle.",
        "Well built, easy to use and understand. Very sensitive. Actually exceeds my expectations for the price of the tool. Very solid feel. Should hold up pretty good.",
        "Got it and it worked but was wrong item I needed for inspection",
        "bought this product due to the fact that i always smelled a hint of natural in my home.Went around ant tested all gas connections and found a few to correct.It worked great",
        "I was skeptical that this would work as well as it does. I found some gases coming from the basement which I did not expect. It also confirmed that no more gas was coming from my range.",
        "Tried to check for leaks with bubbles, could not find any. Still got complaints. With in 5 minutes found 2. Bad stove regulator and a slight cracked in a fitting. Well worth the money.",
        "Not very bright light. Could not see anything in the wall. Need to return.",
        "Works well. Given today's technology and the price of this, it should give u a lead readout of the values besides the clicks.",
        "Worthless, gives a positve test all the time on anything at all."
    ]
}