{
    "entity": "Fish Poachers",
    "text": [
        "I have one somewhere, but in my move I couldn't find my other one. I love it for baking cakes for dinner parties, as well as lasagna There are so many other things you can use it for, peppers sausages etc. Just a great fish Poacher with my other uses",
        "Rec’d my fish steamer with one handle on and one handle thrown inside the steamer. Appears to not have been welded on at all by looking at the handle location. Makes it a little more difficult to use but it should work.",
        "Actually bought it to steam things, namely fish. Had to bend the pull tabs a little bit so they wouldn't bump up against the lid. Placed mason jar lids in the pan to support the cooking tray. Has held up to dishwashing so far, although it isn't recommended. Looks great, cooks great, and now we have added a much healthier option to our diet.. As an aside, the pull tabs somehow aren't as hot as expected when finished cooking.",
        "clean, elegant, does what it says. And $100 less than Sur La Table",
        "VERY CHEAP. It arrived with one handle completely broken off. Even if it wasn't defective, it would still be a peice of junk. The handles are tack welded and the tack welds are TINY. Half of them didn't even fuse. Bottom line; it's too poorly made to be useful.",
        "Following others' suggestions for using this poacher as a fish steamer I crimped the handles on the insert plate and placed it in the vessel handles down. It is not necessarily the most stable setup, but we have successfully steamed many a small black cod and other fish to a tasty conclusion. Use chopsticks inserted through the holes on the insert plate to remove with fish when done. Good product that allows us to steam our fish without breaking the bank. I estimate that the product has a long life span and will never need to be replaced.",
        "I didn't get this for fish, I got it to do clarified butter poached beef tenderloin. It's sizable enough to handle a full sized tenderloin primal and deep enough to actually poach the beef without roasting it. The removable tray is also a great help to lifting the roast to rest. I have used it twice for tenderloin, and once to roast a mass of vegetables. I might eventually get to fish, but right now, it servers it's purpose for me!",
        "Beautiful piece of cookware. Used it to make an olive-oil poached salmon. Would highly recommend...",
        "I loved this so much, that this is my second one I am getting so when I have gursts I can do 4 steamed fish! Great product",
        "Makes wonderful poached salmon. just remember to lightly oil the insert.",
        "Received broken. One of the outer handles had broken off and I guess they placed the handle inside of the pot, put the lid on, wrapped it up and shipped it. Kind of sucks because the handles were originally tack-welded on...",
        "Light gauge steel, but good value for the price. Received it the next day in time to poach a fish for my party. Yay!",
        "THE FIRST ONE I GOT, ONE OF THE HANDLES ON THE INSIDE PIECE CAME BROKEN. I CALLED AMAZON AND THEY SENT A NEW ONE WITH OUT QUESTION, THANKS AMAZON! I LOVE THE POACHER AND HAVE USED IT SEVERAL TIMES, IT IS PERFECT.",
        "This was a gift for my son and he likes it good construction Stainless steel great for cleaning and good value for the money",
        "The first poacher I ordered was returned because one of the lifter handles fell off while unpacking. Now, today the second arrived and the handle on the pan fell off in unpacking. Since I didn't use either I can't comment on it's cooking performance.",
        "It looks small in the picture. It actually is fairly large. Good for even a large fish. Put water on the bottom. Place fish on the holder. Turn on the gas. Steamed well, efficient and easy to clean. Happy with purchase.",
        "This is a fabulous pan for steaming fish. I love it 👍🏻",
        "Twice this item arrived with a broken handle. I will not be ordering a replacement.",
        "Nothing fancy, but sturdy, well-made, does its job nicely, easy to wash up... it's great. Only problem is that it's a little small -- just big enough for a steelhead -- no real chance of getting an Atlantic salmon in there.",
        "Good quality for the price. It's not something we will use everyday, but it will be nice to have when cooking whole fish.",
        "A high quality product. Pretty enough to leave out on your kitchen counter on display. Well made",
        "Excellent. Just what we needed. Poacher arrived on time and as described. Samlon steaks were delicious. Worth the money and more",
        "I had never poached fish before, but this worked fine and the fish was tasty!",
        "Decent enough poacher, but design is slightly off and steamer tray sits on bottom, not off the bottom as it should be, and the finish seems to already tarnishe after just several washes.",
        "Bought it as a present for my father in law and he thought it was great. Uses it all the time.",
        "Use this all the time! I love our steamer. I put it in the dishwasher for easy cleanup.",
        "Love this pan. Use it to steam asparagus and artichokes too. Haven't used it to poach fish yet, but one day I'll give it a try.",
        "Good price and well made. Arrived in perfect condition and worked perfectly for making Christmas dinner. Happy with this product, would recommend.",
        "Norpro Stainless Steel Fish Poacher. This fish poacher is wonderful. I ordered it for Christmas dinner salmon. I used it on top of my gas range and cooked half a salmon to perfection. 10 minutes per pound. Great buy, great product. If you like healthy fresh fish, this product is for you.",
        "it is exactly what I was looking for and the price was unbeatable ; why is it that it requires so many words?",
        "Can't make a bad fish dish with this. Love it!",
        "The poacher is everything that I expected contrary to some of the negative comments in the previous reviews. It is well made, adequate gage of steel, and cleaned up without leaving salt marks (I didn't put salt on the bare metal without liquid). It could be a little wider to provide for large whole fish, but its the standard size. It looks great, almost like an object d'art.",
        "Good quality for the price....does what it is designed to do...... typical made in China workmanship but what do you expect for under $30.",
        "Solid construction, at first I bought it for a scientific experiment but it did not meet the dimensions I needed so then I decided to poach a fish with it. Worked.",
        "I bought this as a water trough for our dogs. We remodeled the kitchen and a large round bowl wasn't a good fit, so we use this. It holds a lot of water and sits close to the cabinets on a mat, out of the way. It cleans easily and works great for our two small Dachshunds, as well as our 70-lb English Shepherd.",
        "This fish poacher is way too big. You would need a 3 or 4 pound fish to use this. One that is a third or half the size would be perfect.",
        "Very disappointed in this product. Used it couple times and already has rust spots. Poor product.",
        "Beware this is not real stainless steel. It rusted! Very unhappy.",
        "We use this to poach salmon in hot weather...and top with a cucumber sour cream dressing. Love it and it looks great on a kitchen shelf.",
        "We've poached a whole fish and fillets for two separate meals. Both very successful. Fits nicely on two burners and works just we had hoped.",
        "Use it to steam red grouper and works good, although I had to bend the ends of the pull up handles around the rim outward to hang the perforated rack to elevate it higher for steaming. The bends depend on the customer's preference. It needs the body to be wider and deeper to accommodate the whole fish inside the body and a taller lid, not a flat one like the product.",
        "Excellent product! Worked perfectly to poach salmon! Excellent value, why pay more? Very pleased!",
        "No real valid complaints. Does what you'd expect. I was thinking about buying the all clad version to match with the rest of my stuff but at the end of the day, glad I bought this because we just don't steam/poach fish that often.",
        "After reading the reviews, this item seemed to be the best bang for the buck. The price even includes free shipping. Yes, the stainless steel is thin but it's well polished and easy to clean. Plus, you use less wine, spices, and water, to poach with the cover off on a low simmer.",
        "I'd never poached a fish until I got this. I've used it a couple of times and really like the way it cooks. Good quality.",
        "The product is just as advertised. I have used it twice to cook whole fish and the result was delicious eveytime. I wish they made it a little larger to accommodate even larger fish.",
        "I poached a fillet of salmon and it turned out very well. I was very pleased that the salmon could be easily removed from the pan. The pan cleaned up very nicely.",
        "Makes cooking fish easy and healthy. Thank you! Great product.",
        "Really love the way poach fish taste and the pan helps make easy to do it",
        "My salmon usually turns out a bit dry. But this was perfect. You can cook it in a brine, wine, ginger ale (yes ginger ale) and its moist and perfectly done.",
        "Not only beatiful but strong and easy to handle. Excellent for doing \"ESCABECHE\", good for fish,rabbit,rock hens and duck. Fits very well on large refrigerators.",
        "Always wanted a fish poacher to prepare that special steamed fish recipe, and this item satisfied my requirements. I first shopped locally for a fish poacher, and found this exact item in one of the stores specializing in kitchen items, but at a much higher price than Amazon. The poacher appears to be well constructed, and I would definitely recommend this item to anyone interested in obtaining one.",
        "I received the product and everything looked fine with it. It was purchased as a gift for my sister. Unfortunately during the second use, the handle broke off and is not repairable. The product is poorly made. Since I was beyond the return policy timeframe I am not eligible for a refund or even an exchange. It has been a very disappointing experience.",
        "1. The product description includes \"Made in USA.\" It is not. It is made in China--at least according to the box it came in. 2. Before buying this product, I looked around the Internet to try to find the weight of stainless steel. At parkers-pantry.com, I found the following in addition to the product description posted at Amazon: Brand: Norpro Name: Fish Poacher Manufacturer SKU: 280 Material: 18/10 Stainless Steel. Dimensions/Capacity/Size: 4.5\"H x 18.0\". Special Features: Perforated rack insert Warranty: Yes. This is very lightweight metal. 4. After using the poacher once, I found the bottom surface became pitted. I would not recommend this product.",
        "What you see is what you get. I have a long, center burner on my stove and this pot fits perfectly. As it says elsewhere, it can also be used to roast. I am glad I got it.",
        "For a bargain priced fish steamer, this will do. It ain't Caphalon quality. The tack welded side handles look suspicious, and other reviewers have stated that the handles do break off. But to move up to a much better made fish steamer will cost 5X the money. I steam fish twice a year, so I don't need a $300 copper French made hand hammered pot. You probably don't either."
    ]
}