{
    "entity": "Fish Poachers",
    "text": [
        "I chose this particular poacher due to the dimensions listed on the website. When it arrived it looked small so we measured. It is 6\" wide, not 7\" and 4\" tall, not 4.5\". Sadly my dinner party is tomorrow night and the salmon I purchased according to the dimensions listed does not fit in the pan. The dimensions printed on the box reflect the smaller size.",
        "We love to cook seafood but have not tried poaching, which is relatively easy and also a healthy way to cook fish. Poacher arrived in perfect condition. We have an oval shaped gas burner so the poacher fit well on it, rather than having to straddle two burners. We also plan to use it in the oven. The poacher is nicely designed, and easy to lift out the contents. We'll be using the poacher frequently, and maybe for other uses as suggested by reviewers.",
        "Opened the box and one handle fell off just pulling it out of the plastic. I have a huge crowd to poach Salmon for in less than a week. Not a happy camper!",
        "This was a gift for my son & he loves it!",
        "I really did not dislike anything about it. I steamed fish in it which came out very well.",
        "Needed a pot to steam a good sized fish and this was perfect. Have to remember to grease the steamer tray tho', the fish stuck to it.",
        "Worked very well on my stovetop. Followed directions time and temperature. Good results.",
        "Perfectly on time for Christmas Eve. Good quality for its price.",
        "but since I do not make poached fish a lot, the investment into a quality poacher did not seem warranted at least for me. If you don't mind how light and cheaply made it can come in handy.",
        "Great product! It worked out perfect for the fish I steamed.",
        "I bought this poacher in September 2009 and used it 3 times before the handle fell off, dumping the fish and the poaching liquid all over my floor (and thankfully not on me)! It really is dangerous and poorly-made. The handles are not riveted onto the pan (as they were with my prior fish poacher) but are \"stuck\" onto it.",
        "Beautiful shiny stainless steel finish and is very sturdy. The removable shelf made it very easy to remove the fish without breaking into pieces. Clean up was easy.",
        "It's the perfect size for Baby back or St Louis ribs. We steam the ribs until nearly done, then grill them. The water underneath turns into a lovely pork broth.",
        "I bought this poacher (new) from another source and washed it in the dishwasher on 'light cycle' and had placed it on the counter top. When I then picked it up to store it, the handle fell off. I had never used it. Thank heavens I didn't have it full of boiling liquid when this happened. The sticky label on the bottom said \"made in China\"."
    ]
}