{
    "entity": "Spatulas",
    "text": [
        "Beware, the handle is made of plastic, not silicone. It melts immediately on contact with a hot rim.",
        "I have generally had great experiences with OXO products, but this turner is an exception. After less than a week of use, the silicone outer coating has split, revealing the metal underneath. Now there is a tear and hole that will trap water and food and grow bacteria. I am very disappointed. Also, this product is not available for a refund, according to Amazon, so I would have done just as well to throw away $10.",
        "I bought this in my never ending search for a non-stick pan compatible turner that functions similar to a metal one. Looked at reviews and this seemed a good choice. Unfortunately, I went with the larger size. It is too flexible and too unwieldy to serve as an everyday useful tool. I almost never use it—my old nylon turner with the melted edge still works better. If you want to try this type of silicone turner, I would highly recommend buying the smaller size.",
        "Bought mine in January 2017 and the silicone has finally ripped around the corner of the metal insert. This is an excellent flipper, but a scrapper it is not. Treat it as it was designed and I assume it will last longer than 1 year. Go buy a wooden spoon to scrape and use this to flip. I use this on my Le Creuset skillet, which you cannot use metal on. The silicone outer shell combine with the strength of metal in this product did the trick. I'm buying another one right now, but don't use this to scrape your pan and this should last.",
        "Excellent spatula. Most importantly, both handle and business end are silicone, which is great if you are like me, and tend to leave it on really hot surfaces from time to time. I would also note that it is larger than I had imagined, which for me makes it great for larger pans/dishes, but a little bit tricky for making a bunch of sunny side up eggs in one medium sized frying pan. Check out the picture, I provided beer for scale 😄 Overall I highly recommend it.",
        "It's cracking after a few months, no extraordinary use. This is a poor purchase.",
        "I made a mistake buying this thinking it was the new version of a spatula that I used and liked for years -- same shape and size, but different in importantly, unhelpful ways. It's way too heavy, the flat part is rubbery and too thick so it doesn't slide under well and food sticks to it. Not a good product in my opinion. Can't see a benefit to the weight, the thickness of the flat part, or the rubbery stickiness. Definitely would not buy again ... and throwing it out because I can't see a good use for it. Surprised that Oxo, which is a great company, would put out such a product. Makes no sense.",
        "Have had the “Small Silicone Flexible Turner” for 10 years and the silicone finally gave way. Came back to purchase a replacement and decided to give the “Large” Turner a go. Love the size - it is a nice set having both the Small and Large for various fry pan cooking activities. The spatula itself has a thin metal inner covered with silicone so it does not scratch your non-stick pans but offers great function - holds it shape when you are flipping things. Great product - the fact that I searched to purchase the same one again after 10 years speaks for itself!",
        "I've had an endless number of spatulas measuring about 5\" long. That was what I was looking for when I went to replace my old ones. The small ones are not so easy to find so I bought two big ones -- one really big one with holes and another big one without. I tried the latter and found it was much much easier to flip a hamburger with a longer one. The same with a piece of broiled chicken. I haven't tried the big, wide one with the holes yet but I have similar expectations. But I don't know how sturdy the flipping surface is yet. Even so, I'm converted.",
        "So far this is working great. I got it specifically to use with my electric griddle. Normally I use cast iron, so I am always using metal utensils. Now I needed something for a nonstick surface. After reading reviews and understanding that it's metal underneath the silicone, and it can be prone to breaking through the silicone, I am only using it for my electric griddle and treating it very gently. I'm hoping it will last. So far so good. It's a great size for pancakes. I'm glad I got the larger one and not the smaller one.",
        "Too flimsy to even support and egg, and if you try to get a refund, it says it's \"not eligible to be returned\" even though that's not warned of anywhere on the product page.",
        "OXO is the best I love this. My only complaint is it could be stiffer. That’s said I still use everyday. If this review was helpful please let me know by clicking the “Helpful” button below the review.",
        "I found it difficult to use for most of my needs, but it might be perfect for flipping, say, a large filet of fish. Wish I had taken good look at the dimensions. It takes up more drawer space that I am willing to grant it, so is stored with other items I seldom use, farther from the action. It is, however, sturdy and easy to clean and of a quality I expect from OXO.",
        "This is the first OXO product that has disappointed me. Both the one from Amazon and one from a local kitchen store stick to food. Flipping omelets just didn't work, and leaky grilled cheese stuck even worse. The non-stick pan cost less and worked perfectly, but I had to clean the OXO Turner with a knife. Except for food sticking, the tool is as advertised. FYI 2 other OXO flipper types - pancake and omelette - work well without sticking to food.",
        "Trusty silicone turner! Durable too! Don't let its big turner and seemingly short handle fool you! It is actually the perfect size! My mom borrowed it for some intense use (saute vegetables, fried rice, and even grilling salmon) and she loved how it held up. Definitely will get it again! EDITED: I noticed some reviewers saying how the handle/silicone melts. The silicone/handle are not meant to handle high heat for long periods of time (i.e. letting it sit in the pan or letting the handle sit on the edge of the pan), so of course it'll melt that way. Smh.",
        "My second identical OXO flipper. This is the gold standard by which all silicone flippers must be judged. Sturdy, yet flexible and very long lasting.",
        "This spatula is great, particularly for fried eggs. The silicone does a great job of not sticking to food. In fact, when I first bought it, I had trouble flipping eggs because the eggs would slide right off the spatula. It has never warped, melted, or otherwise deformed when used on very hot skillets. This and a slotted spatula take care of 90% of my spatula-related needs. The only downside to this compared to a typical spatula made of a hard polymer or metal is that the tip is not as strong, so it does not work as well for breaking up ground meat/sausage or scraping meat bits off of the bottom of a pan when making a gravy.",
        "This spatula has the right width to work with, and the silicone makes a big difference in performance. I've tried others that were metal, plastic with a high temp resistance but none can compare to this one. It's worth the money for the quality you get.",
        "Works great, seems well made, and washes up nicely. Only issue is it is a bit on the thick side, so getting it to slide easily under something like a fried egg takes a little doing. I had an old Cuisinart spatula with a very thin plastic or nylon blade that I liked better because of the thinness of the blade. Alas, it got caught in the drawer and broke. The silicone will definitely be more durable.",
        "I have had one these for years. I bought this as a gift for someone. Like all spatulas, if you get dried egg on it you may have to run it through the dishwasher twice. The handle will melt if you leave it on the edge of the pan but overall it is great for eggs, large pancakes, and it’s sturdy enough that I even flipped a small chicken. I couldn’t recommend this higher.",
        "I thought this spatula would be perfect to flip pancakes but I was woefully wrong. This spatula is terrible. I wanted to use it in my nonstick pan. The spatula us rather flimsy and wasn't able to make it under a small pancake in a well oiled pan. Back to my metal turner for this task.",
        "Like anything else I had to replace it after a couple of years.. it tore through at the covering of the metal under the silicone.. it last for about 2 years and worked very well.. I think it's a good buy..",
        "Believe the other reviews when they say that the sturdiness of this spatula is weak. I can barely flip potatoes. Dont buy.",
        "BLUF: Best spatula made. PROs: Flexible, non-scratch, non-stick, works great in combination with my silicone baking mats. CONs: None. I discovered these spatulas when looking for a small cookie spatula. The cookie spatula worked perfectly, and I was so sold on these that I've gotten rid of all my other spatulas and replaced with the various sizes of these silicone spatulas for all my spatula needs. The silicone washes easily by hand or comes out perfectly from the dishwasher. Won't scratch or stick; works great with silicone baking mats also.",
        "I'm in heaven. The spatular is so steady and dependable. I love that it doesn't bend and twist like those grocery store turners. This has become my go to and I couldn't be more pleased.",
        "Would have preferred one-piece construction, but couldn't find one. The OXO works well. Silicone is much better than nylon for certain things, like turning eggs. Eggs stick to our old \"non-stick\" nylon turner, but not to the silicone. Also, silicone has a higher temperature rating than nylon, and it's more flexible. If you're facing a choice between the two, get silicone.",
        "Good all around spatula. However not what I wanted. The business end is thick. I did find the correct ones at my local supermarket. All of the OXO gadgets are great just not the one I was looking for.",
        "My \"dollar store\" turner snapped like a twig one day so I decided to get a real tool for my kitchen. I read the reviews and bought this and am totally happy with it. I use it mainly to flip burgers and fish fillets in my iron skillet, and to gently get fried eggs out of my nonstick skillet. It works fine, and the front edge doesn't seem to be degrading at all. Sometimes the dollar store is the answer, and sometimes the right thing to do is pay for quality.",
        "OXO generally make solid products. This one is no different. I replaced one I used for many years after the silicone edge ripped. My only criticism is that it’s wider than my other one.",
        "Don't know if I got a lemon or what, but there's a large deep gap underneath where the handle goes into the spatula part, and there's no way to get in there to clean out whatever gunk would inevitably accumulate in there. I threw it away.",
        "My daughter and I now have the OXO silicone turners in all sizes. The first one I received as a gift from my son. They are sturdy, easy to clean and I can prop on the edge of skillet without worry of melting! Great gift! Great purchase!",
        "Superb spatula. My kids kept melting others by leaving them in the pan while cooking and forgetting the process. This is super and very tough. It seems to stand up to neglect. I only gave it a four instead of five stars because of its size. It's fine and efficient for me. My much smaller wife is happier with the smaller version of this, which she finds easier to use. We use both every day. By the bye, both sizes are great at manipulating, separating and even shopping food in the pan. The spatulas are very stiff on the sides and you can work food you're cooking without damaging non-stick skillets.",
        "I love and trust OXO products. I was very disappointed that this spatula broke the first time we used it. The end store away from the metal form it was attached to. Very surprising, so perhaps a random defect.",
        "This is very sturdy and cleans so easily. I mainly use it for individual pizza from the oven to the plate. It is wide enough so it does the job in one lift. Very pleased with the product.",
        "Nothing wrong with it, but as others have noted, this is a LARGE spatula. I have decent sized hands, and it's nearly as big as my hand.",
        "Exactly what we wanted - not as floppy as some silicone spatulas we've had in the past - which is a good thing. The steel body gives the flat portion a little bit of rigidity while still maintaining some flex. I like it a little better than the 100% silicone spatulas for use on our non-stick cookware. The feel and the weight are exactly what you'd expect if you're familiar with OXO products. Couldn't be happier.",
        "Best turner I've found. The flat part is oversized so you can flip a large amount all at once. It's flexible at the end so it's easy to slip under cooking items, but further back it's stiffer and can support a good-sized portion. I liked it so well, I bought four so there would always be one clean. ***UPDATE*** As other reviewers found, after about 6 months, one of our turners split to expose the metal inside. I contacted OXO and they shipped me a replacement right away, no hassle. Great turner and great customer service.",
        "This one replaced my old turner and it is larger than the last one. It still is very handy and useful. This brand is reliable. So much better than all the other spatulas out there.",
        "I intentionally bought the large turner thinking it would work well for making pancakes on my grill. It turned out that it was too big to really work in that situation and I am now looking to buy a similar product but with a narrower blade.",
        "Great spatula but the only \"flexible\" part is the very end. Honestly, it's difficult to flip eggs, pancakes, etc. But it's great for everything else.",
        "It is so large that the flexibility of the blade is an issue when I'm trying to flip large amounts of food or prevent food from sticking to the bottom of the pan. At the point I only use it when I'm too lazy to wash my other spatulas, and when I do, I usually regret it and sometimes start washing dirty spatulas before I finish cooking because it gets so annoying.",
        "I have several of these. I use them all the time. I received my first ones in 2009. One finally started to show wear this year. This is the first time I've had to replace in over a decade. I am very happy with this brand and would recommend it to anyone.",
        "Good quality, like most OXO products I have purchased. These are nice when you need a larger spatula/turner. I find this turner works very well on a pan full of hash browns - it can flip a lot at one time. Like most silicone products I have tried, they are hard to clean. They come out of my dishwasher with the paddle looking like it was never washed. I use a scrubber sponge with extra detergent to get them looking really clean. Otherwise, an excellent product.",
        "Always had a hard time flipping pancakes (I make 'em big). This turner looked like the right stuff for use on my GE range's nonstick griddle, and it is, size-wise and flexibility-wise. However, the flipper's bevel is reversed so slipping the upside-down flipper under a pancake to check doneness is a cinch, whereas trying to slip it right-side-up under a pancake to flip or remove the pancake is quite problematic. Most of the time it results in a squished pancake. Unfortunately, I didn't used the flipper until more than 30-days after receipt, so I'm going to live with it (though I may call Oxo... their Customer Service has been good to me previously).",
        "Great spatula! I did a lot of spatula research before buying this. I was dubious about the quality, but it's been awesome with heat, cleaning, functionality, etc.",
        "I bought this for common kitchen tasks, flipping and moving things around in a pan. The large is just too big to be practical. I'm going to get the small one.",
        "This is the second OXO turner I have owned. While I love the metal handle and the beveled edge, over time these tend to get stiff and brittle. More than once, I have had a big chunk of the edge snap off while cooking. As Alton Brown would say \"that is not good eats\" Still, when they are new and unchipped, they are one of the best spatulas out there, especially if you are worried about scraping the non-stick lining on your pans.",
        "Noticed I set the edge on a pan and it melted a bit. I love the spatula, great for flipping things. The size is also great.",
        "Really liking this so far, my old spatula was melted and hard to clean, this one is holding up well and easy to clean!",
        "A nice sized flexible turner and very well made. This will withstand heat and will not scratch my non-stick pots and pans. It is heat resistant to 600F. The turner is safe in the dishwasher. This turner has a flexible end that makes omelets very easy and convenient. it is stiff enough to break apart browning ground beef, as long as it is not too frozen. I do feel the handle is slightly shorter than other turners I owned previously.",
        "When your are flipping something of broad expanse in your pan or on your griddle, this is the tool that works.",
        "My nonstick pan will stay scratch free. I've used these for years. I wouldn't use any other kind.",
        "One can never have enough good spatulas, I think. This product hit the jackpot for me. It's medium sized, and very well-made. Yet another OXO Good Grips great product!!! Would highly recommend.",
        "I've learned I can always count on Oxo for well designed and solidly constructed kitchen products. This spatula is no exception.l The blade is generously sized and covered with silicone with beveled edges. It's easy to slide the blade under virtually everything I cook and the solid construction makes turning things like pancakes a snap. The silicone is heat resistant to 600 degrees or so - a range that covers all of my cooking. The handle is comfortable, but a bit shorter than I prefer. Modestly priced, this spatula is a good deal.",
        "Well, it's just a kitchen utensil so you can't get too excited about it but for what it is, it is great. Good build quality. The silicon part is flexible yet firm.",
        "This is a spectacular burger flipper! A little larger than I expected, so not great for eggs in a small frying pan.",
        "I especially love that these came in large, its really good for turning omelettes and fish without breaking them! At first I was worried over the silicone melting, as I have used several rubber-tipped cooking ware against my non-stick pans, and they have all melted even with simple stir-frying. However, this turner have been amazing so far, it's the only one that was able to withstand the stir-frying temperature! Have been using it for a couple of months now and it is still like new.",
        "I liked my original so much that I bought this one as a replacement. Original one cracked after about 5 years of use. I think I got my money's worth.",
        "Very cheaply made and not that flexible. You get what you pay for! Inaccurate description, should read as silicone coated, not just silicone.",
        "The spatula is sturdy and holds up to my nonstick pans. I don’t feel a greasy residue after washing it and it’s great for flipping pancakes. I’ve used it every day for the past few weeks and still no wear and tear on the silicone edge. Overall, a very good product.",
        "I just love this spatula, or turner, as I've now learned. This will take care of the biggest grilled cheese and not melt like the nylon versions. I'm a total convert to the silicon version. No frills, all function and dependable. Thank you Oxo!",
        "Not good, not bad, but a little floppy. Should be $7 from one of those dress for less stores.",
        "Never had a 4\" before. It just makes turning food easier. Sometimes it is the little things. jay",
        "I had one of these before a fire took it and everything else I had in my home. I had loved the one I had before, so I ordered this one, not realizing it was much bigger than the one I previously owned. My bad, though, because this is a really good spatula. (Sorry, I don't call these things \"turners\".) It's stiff yet flexible enough so that I can shinny it up under things like pancakes and eggs. Highly recommended. Now, though, I have to order the smaller turner ... this one is kinda big for the small 8\" skillet I usually make over easy eggs in!",
        "Good silicone spatula. Sturdy and great for non-stick frying Pans and pots",
        "I instinctively trust OXO products and own several items, including another flipper. This one is way too bulky. I could practically flip a deer with it!",
        "I'm somewhat disappointed in this item. While it is a good size and can handle many eggs and large pancakes, the handle has proven not heat resistant. See the photo. After frying eggs this morning, I took the skillet off the heat and left the turner in the pan with the handle leaning on the side of the pan. I came back 5 minutes later only to find the handle had melted on the side of the skillet. Why on earth is a turner touted as heat resistant not fitted with a heat resistant handle? Fortunately, I caught it on time and could scrub off the melted plastic from the pan.",
        "Thin leading edge. Turns food. Solid construction. Easy to clean. I'm the guy who always breaks the egg yolks when flipping them in a pan. Or I WAS that guy. Since I got this, far fewer egg yolks have prematurely erupted in the pan. I mean, I'm still human, but this thing has set me up for success.",
        "This thing is pretty huge as far as spatulas go. It's super thin, which makes it great for slipping under delicate items such as fried eggs. Being silicone, it cleans up great and doesn't melt when it gets hot. Don't be too aggressive with its edge, as the metal inside will eventually break through the silicone if you use it to do things that it wasn't intended for (*ahem, like I might have), such as scraping hard, left behind items off of the frying pan.",
        "Great size for pancakes. Easy to clean. Flexible enough to get around corners but rigid enough to handle heavier food items",
        "Glad I bought it. Needed something for non-stick other than what I had. Glides right along.",
        "The greatest spatula you will ever own. Easy to clean. Eggs don't stick to it. Head resistance. Sturdy. What more can you want!",
        "Very well made. Perfect size for pancakes, grilled cheese sandwiches or anything else that has some heft that you need to flip. Nice and thin front lip to get under eggs etc.",
        "Preface: I love OXO as a brand. Over half of my kitchen is OXO brand stuff (favorites are myand, least favorite isand is the only item that I disliked). This item is very OK... if it was any other brand I would have had a lower expectation/standard going in. The silicone part is too long and flexible- essentially making it hard to use to actually turn anything over. Has caused a few messes in my kitchen that would not have otherwise happened (I cook a lot... was not all user error). I won't \"un\"recommend this, but there are better items out there.",
        "I ordered this one size too large and I wasn't able to return it. I don't like when I can't return something when it clearly doesn't work for me.",
        "The turner was mainly bought for making hot sandwiches. It's easy to hold and flip the sandwiches and goes well with the new non stick pan",
        "Perfect for our non-stick pan and for flipping our pancakes this morning. Very pleased but a little floppier than i expected but overall i'm not too concerned with that.",
        "Well built, but the large turner is a bit larger than I was initially hoping as it isn't all that firm at the end and heavy food items will fall off. However it has done the job and large fillets of salmon, pancakes etc are easier with this large tool",
        "In general I find OXO products to be well-designed, durable and affordable. This spatula is no exception. Happy with my purchase.",
        "I've used several OXO kitchen products for years. They're all great. This turner is still as good as new after 4 years.",
        "Wish it was a little smaller, feels bulky. Hopefully I like it better in 12” pan I just bought. Feels to big for 8” egg pan.",
        "not sure how to review something like this, it has flipped a couple dozen burgers and still hasn't melted.",
        "Great spatula, great quality and big enough to handle anything! It does seem to be less useful flipping sunny side up eggs for some reason, but overall I love this kitchen tool.",
        "Got for cast iron purchases - this is great to use and no fear of scratching! Love OXO.",
        "I got this a bit over 3 years ago. Probably used it twice a week since date of purchase. Worked fine until yesterday when the half of the leading edge of the silicone fell apart.",
        "Excellent spatula. It's large and great for flipping things. The silicone seems to be quite tough. I use it to cut into things like sausage and frozen meat fairly often, putting a bit of strain on the front edge and so far I don't see any evidence of failure after 4-5 months. I'll probably buy another one of these if my first one ever breaks.",
        "Works great with my electric pancake griddle - other spatula have melted!",
        "A known trusted brand good quality but would prefer it be a bit more sturdy",
        "Looking at our order history, it appears as though we have to buy this product every few years. The handle melts, and the metal pokes through the silicone after a couple months, nullifying the “good for nonstick cookware” quality entirely. One time the silicone actually FELL OFF of the metal. Fail.",
        "Metal center makes a great pan safe utensil quick cleanup",
        "Love this spatula, but after using it for a year (almost everyday) the corner of the silicone cracked and the metal is exposed. That happened on a smaller one I had and I simply (not too easily) peeled off the silicone and now its's a most fabulous metal spatula for my stainless and cast iron pans. (Use a razor blade/painter's scraper.) I suppose one year is not so bad for such a great tool? I suppose I got a \"two-for-one\" deal.",
        "Does what we need it to do. Sturdy and easy to clean!",
        "Glides effortlessly on my pans and doesn't burn. It is a bit larger than I expected. Blade itself is 4\" x 6\". Looking at other reviews i will be careful of the inner metal breaking through the silicone.",
        "The turner face was much larger than stated in the description. Actual was 6\" X 4\". The description was 4\" X 3.25\". Would have ordered the small.",
        "Perfect! Nice and large surface area! Bigger than an average spatula and that’s exactly what I wanted",
        "Large doesn't describe this. OXO makes such great quality products that I was SO looking forward to getting this one. Don't get me wrong, great spatula & great quality but Whoa! a little TOO big for what I needed. I have a friend who it fits in well with & she loves it ... exactly what SHE needed.",
        "OXO is one of the few brands that has a blend of appealing appearance and function. This turner is sturdy enough to peel products off of a pan, easy to clean, and extremely heat resistant. It also looks good. I mean, it's a spatula, so really, it doesn't look that different from other spatulas, but it's the tiny little things that make this just a bit more attractive.",
        "These spatulas are the only kind I will ever use again",
        "Bought one of these in the store a few years ago. Best spatula ever! Glad to find all 3 sizes on Amazon. I bought them all!",
        "Excellent! Perfect for a quality non stick pan. Great for eggs and pancakes! Love it so far, better than the cheap nylon stuff that starts to fray on the end."
    ]
}