{
    "entity": "Spatulas",
    "text": [
        "Working as a short-order cook during my college days, I've flipped my share of burgers on the griddle. These grill spatulas get the job done, and for the price, you can't beat em.",
        "Have you ever wanted to feel like one of those Japanese steakhouse chefs, flipping meats and veggies and making jokes about, \"Butterflies\" as you flip the coagulated milk product over the heads of your customers? Then look no further! These are sturdy, solid turners with flexible metal paddles and solid wooden handles on them that, when you have one in each hand, make you feel like a real pro. Using these on my new outdoor griddle, I have no issues with flipping, turning, and fiddling my food to perfection. Now....if only they came with holsters for my hips.",
        "They are too long to be of any use in a normal pan. The rounded ends mean you can't turn a pancake, or a tortilla without ripping the thing to shreds. Can't use if you want anything other than scrambled eggs. They seem durable but of course they will be since I can't use them!",
        "Handel rivets not tight. Metal thick and unfinished, maybe suitable for barbecue grill, not a kitchen frypan. Free return if I travel 45 minutes to a UPS store, $6 to print a UPS label for local drop-off. Angry at Amazon; I'll use the free drop-off at Goodwill.",
        "Ordered these as replacements for our home kitchen, with low to medium expectation of durability and quality. My husband, a professional cook/chef for 40+ years and pretty scathing about \"mail order\", was very impressed and pronounced them restaurant quality utensils. They are pretty heavy duty and definitely not for coated or non-stick cookware.....great for my cast iron and stainless.",
        "but I found that the edges were very jagged and sharp from the pressing process that created them, and this jagged edge scrapped the seasoning from my outside griddle. No biggie, some oil and high griddle temps got the coating back, but a bit more care and quality control in the factory would have saved me the trouble. I have used them two or three times now, and after a couple of trips through the dish washer, the wooden handles are starting to get a bit loose, but I'm sure that they are supposed to be hand washed and not meant to undergo the dishwashing cycle, so I'll say that's my fault and won't blame the cheap spatulas.",
        "Decent set for the money, I would definitely buy again. They could be built a little better, especially the handle, but this shouldn’t keep you from buying it. They do their job and they look nice.",
        "Bought as gift and they loved it. Handle fits well in large hands and weight of each item is solid for easy chopping and flipping on flattop.",
        "They are a bit larger than I need for daily cooking but will come in handy for larger projects. They are decent quality, unlike some of the plastic or silicone spatulas.",
        "Rivets holding the handles on were not set. Handles came apart. I found the rivets and set them properly, and now they work fantastic.",
        "You can certainly buy more expensive spatulas but why? This is for a barbecue, I'm not trying to impress anyone I'm just trying to flip a burger without singing all the hair off my arm and these do the job. This is a great deal on a pair of spatulas, and if you're a burger masher you'll like the perforated one. But if your spatula needs to say Cuisinart, Le Creuset or Victorinox on it to make you a better burger flipper than God bless you, Amazon sells those too..",
        "These are much larger than I thought them to be. Heavier too. Seems or good quality but I bought them to simply use in the kitchen, thinking they were smaller so will be returning.",
        "This sure is a bargain, I doubt I will use the one with holes in it, except as a spare if the plain one gets lost or damaged. The flat part of the spatula is almost too long, and the edges are a bit sharp, but the tool is eminently useful, to turn six rashers of bacon at once or easily flip an egg or pancake, I mostly use on an electric griddle, but would be handy on a BBQ grill also. I will hand wash as I would not expect the wood handles to stand up to repeated exposure to a dishwasher, quality is quite good, very well put together.",
        "After being exposed to repeated cleaning and sanitizer over a couple months they developed spots of rust. They're good turners but I was expecting they'd be more durable.",
        "Bought this to replace one's at work. Handle rivets have to be replaced already. We don't use both everyday. Otherwise happy with purchase for price.",
        "I have used the several times over the past few months and they work great. They seem to be made really well and the stainless steel is sturdy. I'm able to place a ball of ground beef on my griddle and flatten it out with no problem or worries of it bending or breaking.",
        "These are very good quality. I use them to do cheesesteaks on a big flat top. I do food vending at festivals and such, so they get a workout for sure. They work great. I've had them for almost a year and they are still in very good shape.",
        "My husband got a big outdoor flat top griddle and bought these to use with it. He loves them and uses them often. I've even used them myself to flip french toast. It has a nice feel in the hand and they are well-made. I definitely recommend this set. I would say, as with all wooden handled products, be sure to wash these by hand and not put them in the dishwasher, in order to prolong the life of the wood.",
        "Been wanting a pair of these for a while finally just ordered them. Handle seems flimsy? Maybe a bit loose is the best way to discribe. Gonna try and find a way to tighten them up.",
        "Just got these today, what a horrible product. Handles are not tight, all wobbly and shaky, and are the cheapest grade material imaginable. You can’t even let them touch anything because they easily dent. Have not used; and won’t. Garbage.",
        "I little flimsy, and feels a bit cheap when trying to move food. I don't like the rounded tips, especially when I'm trying to move food around like fried rice.",
        "Says stainless but apparently not. Already had issues with rusting spots.",
        "the one with the holes in it the handle which is wood, was loose n the steel bounces around, other than that, it would have been a nice set. great for moving around stuff on a hot grill",
        "rivets holding the handle on were already fallen out upon delivery.",
        "Started to rusted after only a few months of being stored in my outdoor kitchen drawer, which is in a covered and screened patio.",
        "I got these for my husband to use on grill. He loves how long they are. It keeps hands further from the heat and plenty of surface area to pick up to hamburger patties.",
        "Great spatulas . We bought a set for my father in law to use for grilling this summer. Great weight and length.",
        "The material is rather thick, and I had to chamfer the end so the tool could slide under the foods it was being used to move/flip; after the modification the tool works sufficiently well.",
        "I like them. My wife says they are too big. What does she know? Hmmm. Oh well I’ll order her a smaller one.",
        "These turners are very heavy duty, with very solid handles. I use them for our BBQ, and they're so stiff I can use them to scrape the grille before I start cooking. And, they don't flop around when I'm turning a big pork rib or chicken breast. These things have made my BBQ duties much easier.",
        "These really do the job, and they look great in the kitchen. They are fantastic omelette spatulas.",
        "This product was purchased for a restaurant. I was VERY disappointed as it was extremely flimsy. I wanted to return them But they can't be returned. They would be ok for a personal kitchen or a little kids play kitchen. But they do not hold up in a commercial kitchen",
        "Decent spatulas. Wood handles loosen up after several uses, but are more than still usable. Don't leave them submersed in water for extended periods of time and you won't have a problem. Clean them up when you're finished, coat them with oil, and you won't have a problem with them rusting.",
        "These arrived with what appeared to be discoloration spots on the steel surfaces. Additionally the handle rivets were loose and allowed the whole handle to wobble. After one hand washing the wooden handles are falling apart.",
        "These are great for the money. I was worried about the two spatulas were going to be too flimsy and light weight. Not so. The stainless steel is great quality and so are the wood handles - well riveted and of nice quality. The stainless blades are heavy and nicely finished. Buy 'em for the summer grill, you'll like them!",
        "If you own a griddle you need these. Be warned though, if you leave them on a hot surface, the metal running through the sides of the wooden handle will get hot.",
        "Got these to go with my new lodge grill/griddle. Used them this morning to make bacon and eggs on the new grill. There isn't a whole lot to say about flippers - but these worked great, are long enough to scoot under all the bacon and easy enough to handle to serve the eggs.",
        "These are total junk. They can hold no weight and if you bend them slightly the rivets Pop out! this is worse than stuff from the dollar store",
        "Works great! Flipping two at a time! Would recommend to anyone.",
        "It seems like they are going to last forever, I use them almost every day and they are working perfectly.",
        "As many other reviewers commented, the handles are not riveted on well / tight. There is a slight gap between the wood / steel turner / wood sandwich. As a result, the steel wobbles a little. Plus food and liquids can get into that gap and it would be very had to clean out. Item was returned.",
        "They work but are cheaply built. The rivets on one of my spatulas are loose with no way to tighten them.",
        "These work fine, glad to have stainless turners. The wood has turned quickly, appears that it has not been treated. Hope it lasts.",
        "Caught a splinter from it before my coworkers stole the one with holes in it",
        "This was perfect, good wood handles and perfect size for my cast iron skillets and BBQ grill. I also purchase a 7.5 inch spatula, and I definitely use the 7.5\" more often. Metal thickness was perfect, not too stiff, but sturdy. Cleans nicely, but I don't put them into the dishwasher, only hand-wash.",
        "Very wobbly on the rivet of one of the spatulas I give it a few uses before it breaks 😤",
        "I had this less than 1 week, using it for breakfast and dinner and one of the rivets came out and the second rivet is starting to come out. Would be nice but just not well put together.",
        "Handle is affixed by 3 poorly installed rivets. It falls apart in a matter of weeks. Avoid!!!",
        "These are great. I bbq a lot and I use these a lot. No complains but I also don't know what else to write about them. They are two good quality spatulas that make my bbq easier.",
        "Not super strong, but a good size and gets the job done.",
        "A month old and already a little rickety. Not sure how long they will last but I like using them.",
        "WOW!!! ordered this on a sat and got it in on Monday. the spatula is stainless steel and does not feel cheap at all. especially for the price... My boyfriend loved them...",
        "Can not be placed in dishwasher. The first and only time the item was placed in the dishwasher, all the finish was removed from the wood handles and the handles began to split.",
        "Bought these for use with our new Blackstone Griddle. They work pretty well but the handles are loose and the spatula part seems to flop around too much.",
        "Makes turning pancakes, salmon, tuna and any other delicate food that need flipping a lot simpler. Works great on a griddle or BBQ grill. It may work with a skillet if you have a very large one (12\" or bigger), but it won't work so well with a smaller skillet.",
        "My son has been wanting longer spatulas to make his specialty Philly cheese steak sandwiches. He's very pleased with the heavier metal blade, which picks up onions, steak & mushrooms perfectly to put into a bun. Thanks!",
        "The rivers on one spatula were not right, thus making the handle loose and wobbly.",
        "Product performed as expected. Don't know about durability as I have used only once",
        "These are AWESOME for cooking on the grill. Solid and sturdy...I picked up a whole meat loaf with the one with holes and it did not phase it one bit.",
        "good turners, but the metal is a little thick, making them a little stiffer than they should be, a little more flexible would make a better turner.",
        "Perfect! Doesn't work as well in smaller pans on a stove, but very high quality product!",
        "Cheap construction - both 'blades' arrived wiggly and loose in their handles. Large gaps between the metal and wood. Will last a couple of years. Not worth the bother of returning.",
        "A little flimsy but for the price they work, at some point I will purchase restaurant quality but for now these do the job.",
        "Excellent spatulas. Very solid. Handles need a little finish sanding and oiling, but that's my own personal nit-picking.",
        "And that's not a bad thing. They look good and so they are. I just need a bigger flat top grill.",
        "So far this is a great product. I've only had it a couple days, but worked great on my philly cheesesteak.",
        "Worked great with our grill. Hope to enjoy them alot",
        "the product was ok but are very poorly made, fell apart by the 3rd use",
        "I brought these for one of my employees and they work great I like the way that handles are screwed on",
        "Good metal quality, my only issue is the wood handles are a bit lose and seem with time they will come off. Needs to be more sturdy. But for the price you cant really complain! Cheap and works",
        "Nice as the $20 a piece kind sold at the box stores",
        "Loose handles, the thin metal is too flexable, and they aren't anything like professional models.",
        "Pretty good but handles have very poor material of wood. It is not well sanded and gave me splinters.",
        "Not real stainless steal. after some years of used it started showing the inner and getting oxidized. I do not recommend if you are looking for real stainless steal as the description says..",
        "Very, very cheap quality. The handles aren't attached well. I returned them.",
        "Beautiful cookware! Very durable and perfect for any cooking need.",
        "These were cheaply made. The handle was loose on both. It did do the intended job but I don't see these lasting more than a month before the handles completely fall off.",
        "I bought these to use at work. The metal is flimsy and the handles are poorly attached. They aren't so bad that I feel like I need to replace them immediately but they are most certainly not professional quality, which was one of my search criteria. Fine for home use.",
        "too thin and too flexible. so do not use these as much.",
        "Nice and sturdy, nice handle. Perfect for stove top cooking and our out door skillet!",
        "Good sturdy design, very comfortable in your hands to cook with.",
        "The handle was loose out of the box and fell apart on less than 2 weeks. Wouldn't recommend or buy again.",
        "Again different ways to use it. I use it on the grill, grilling make easy.",
        "They work as expected. Price was the biggest determining factor. Inexpensive, but just what I needed at a price I was willing to pay.",
        "works fine. wod doesnt like a dishwasher though. The woods get rough fast.",
        "Wish it had a hole on the handle to hang or a string of some sort to hang on my grill",
        "Good set for the price. One of the handles was a little loose. Not riveted very well but works fine.",
        "The durability is what im looking for, they're just too long for me.",
        "A little flimsy couldn't flip my 1/4 burger without it bending.",
        "Awesome stuff, exactly as described. These remind me of what I used back when we didn't complain about making burgers for minimum wage.",
        "I have used them 2 times and the stainless is starting to pit",
        "these are hefty good and a little big for home use unless you have a griddle and a gaggle of chillins.",
        "Great spatulas at a great price. Very sturdy and my husband loves them for his grill. Will definitely buy again if needed!",
        "Just the right size for the BBQ - work great.",
        "Real deal commercial grade spatulas. Quality metal, quality handles. I expect I'll have these until the day I drop dead.",
        "Great set for the price. Yes they are a little flimsy, but nothing that impacts performance. At this point you couldn't ask for more.",
        "A good product. Sense of use are really good. ... Recommend.",
        "They're ok. The handles are loose because the rivet isn't tight enough.",
        "I've had these for about a year and use them for hibachi at home. They work great and have held up well. I would definitely purchase these again.",
        "I gave my son this for Christmas for when he BBQ's this summer. He really likes the item. Got a set for myself also. Love them."
    ]
}