{
    "entity": "Spatulas",
    "text": [
        "Worst product on amazon. It bends while using it. All of the nails holding it together fell out on the first time using it. The whole thing fell apart.",
        "It would be a very helpful if Amazon adopted a standard product description format : Length , Width and where relevant : depth . I needed a tool that's 14.75 inches wide . This spatula's blade is only 6.5 inches at it's widest point . The product is well made -so I'll keep it .",
        "My sister saw the one I ordered for myself and ordered five of them as Christmas presents for friends and family after commenting on the beveled edge (which I hadn't noticed). She bought boxes of pancake mix to include in the gift. We also use them when we barbecue since the width is perfect for flipping burgers and fish and other items. This has been an item that I've purchased and actually use rather than having it sit in a drawer forgotten!",
        "Durable, nice sharp edge, well-attached handle, big wide blade, does everything we ask it to and more. Flips eggs, cuts meat, slices pizza, and goes right in the dishwasher. Handle firmly attached and hasn't rotted despite almost constant use and washing for several months. Haven't seen any rust on it. Loved it so much we bought a spare.",
        "This is exactly what I wanted. Sometimes buying online the product descriptions aren't what's expected. This is perfect! Nice heavy duty, beveled edges, perfect width and size. Short of using it to chop wood or chisel stone this should last longer than I will.",
        "Cheap wood handle destroyed by first encounter in dishwasher. All the others I have are hard plastic. Shame on you!",
        "Use it everyday six days a week has definitively saved time and effort cleaning my grill with the scraper and perfect for flipping and pressing burgers as ordered. We have went from 80-100 to over 180 burgers a day and without this product I would have longer wait times. MUCH appreciated. Sturdy Design perfect flexibility, easy to clean and maintain. Definitively put some miles on it and it has withstood the daily beating of the restaurant business. Thank you.",
        "Absolutely perfect for picking up pie dough once it has been rolled out. My pie dough always breaks apart when I transfer it from the dough board to the pie plate. This solved the problem. So happy I found this, I even purchased one for my daughter.",
        "Bought two of these turners for our pancake fundraiser where we serve around 800 people in a six-hour time period. Our Flippers loved the large paddle size and light-weight of these turners. The beveled edge made it easy to slip under the pancakes. Cleanup was easy also.",
        "This item is everything it advertised, The only reason the overall rating is a 4 is because it is a bit thicker than my wife was hoping for to be able to get under pancakes. Other than that this item is working well for all other uses.",
        "I wanted this spatula to help me remove mini pie pans from the oven, and as such it works perfectly. Also, it's nice and solid, not too light and not too heavy, and it's attractive, too. What's not to like?",
        "...Not as large as I thought I mis-read the measurements, I will keep it provided it does not fail before it's return date. Feels very sturdy.",
        "This performs every bit as well as more expensive spatulas I've owned. It can also scrape a pizza stone after using it quite admirably. It's no slouch. Durable and strong. Yet not too expensive.",
        "This big guy will flip pancakes like nobody's business! Great for personal pizzas, too! Forget the negative reviews. The people who complain about this spatula have zero culinary chops. If you know how to use a spatula, correctly, this unit is a winner, in the kitchen. Highly recommended!",
        "I got this large spatula to aid in turning thin pancakes, and it serves me very well. Think it will be good for turning burgers on the grill too.",
        "I love my Fox Run cooking implements. I got all of them, including the large cookie spatula, which is great for flipping large pancakes. They are stiff and sturdy and have a wonderful sharp edge that can get under the food being flipped. They work wonderfully with my new stainless steel pots and pans. The handles can't be melted by resting on the edge of a hot pan. I have all my new stainless steel implements in a stainless steel holder on the counter (the pancake flipper is in a drawer) and they look very professional with my stainless steel stirring spoons and whips.",
        "These have a hanging loop, which puts it above all the others I use! There's also full tang. Very durable, and sharp enough to cut when needed.",
        "It's a little bigger than expected but that's not a bad thing if you want a big, strong metal spatula!",
        "I am happy with my purchase. I was replacing a similar spatula. This one has been great. I would recommend it.",
        "Just what I wanted. I accidentally melted the handleI of one I just purchased recently. I had to re-order one right away.",
        "Great spatula for pancakes. I would recommend putting a little bit of oil on spatula before useing each time. Works better .",
        "I got this in order to make giant pancakes. I have used it several times. I cook pancakes in a cast iron skillet. It was a little tricky getting the spatula under the pancake but worked out great each time. I would definitely buy this again. I will probably use it to make a giant cookie sometime in the future.",
        "Only the top and bottom of the handle are covered but not the sides of the handle, so you still need to wear a glove if it gets hot. All sides should have been covered.",
        "this is what my wife wanted for Christmas. A wide spatula goes well in her kitchen",
        "I didn't give it 5 stars because it arrived kind of scratched. Amazon is the worst at packaging items and this item seems like it gets scratch very easily. Anyways the item is kind of heavy and big, which is great for making big pancakes or omelettes. I definitely recommend it if this is the type of food you are looking to cook.",
        "Nice quality, good price, great size (BIG!) Flip cookies etc...no problems.",
        "This spatula is so handy for moving large things from one place to another. For instance when transferring cake or pizza from one plate to another.",
        "Did a pancake breakfast for about 100 people. It worked well, I did sharpen the edge a ly to scoop under the pancake better. Biggest issue as others have said is the fairly easy to bend handle. Decent product for the price",
        "Worst product on amazon. It bends while using it. All of the nails holding it together fell out on the first time using it. The whole thing fell apart.",
        "Really makes pancakes easy. It is big, so the pancakes didn't fit in the toaster. But that's user error.",
        "Works great in my cast iron pans! Really gets the big jobs done.",
        "Large is right, and I love it. Have not used it a lot but it is heavy and it is large and it worked just fine for the pancakes i made the other day. I didnt make small pancakes so didnt get to play but Im happy with it as is.",
        "this spatula is HUGE! Too big to use for anything in a skillet. But will still be useful for flipping big meats on the grill.",
        "the intened use was smashing burgers on my blackstone grill, but the handle was too flexable.",
        "We love making stuffed casadia. This made turning over mucho easier!",
        "The size was large enough to bring a big pizza from my oven with ease. The product is sturdy and well made. Good pricing. Very satisfied with this.",
        "A great spatula for our cast iron pan. It’s done great in the dishwasher.",
        "Extremely durable. Great for a grill but not as easy in kitchen pans for flipping pancakes due to thickness.",
        "I like this product, but it has its limitations. When you flip pancakes, it's awesome. When you flip a quesadilla, it flexes an abnormal amount. Really good for cookies, but for the price you pay, it should probably do more than just cookies as the title indicates. Thin metal kills this product. Thicker Gauge metal would be better.",
        "this thing is great for big pancakes toots very good quality",
        "Well constructed durable materials but edges need to be filed to debur as they are very sharp.",
        "Larger than I expected but sturdier than I expected, too. Got this to flip grilled sandwiches. Haven't used it yet, but I'm very pleased with the spatula and it's better than I thought it would be. Looking forward to trying it out soon!",
        "We needed a spatula/turner for a cast iron frying pan. This turner does well, washes easily and has won my husband's seal of approval. It is perfect for his many cooking adventures using our cast iron.",
        "I was looking for something to flip pancakes, omelets,hashbrowns and such. This is perfect. Fits comfortably in my hand. Feels sturdy to last, grabs the whole thing to be flipped. I like it very much.",
        "This is the neatest thing since ice cream! It's good for our cookies and small pizzas",
        "Nice durable spatula. Returned it due to being smaller than I expected (my bad).",
        "It was hard for me to gauge how big this spatula would actually be- I want something large I could use for steaks to pie dough if needed. This big boy can handle it all! I love it, now I need to find a spot big enough to store it! If you are in your kitchen a lot, you will always find a use for this very versatile tool.",
        "Finally I can flip my pancakes without wreaking them. Love it.",
        "Works great for making quesadillas, big spatula, makes it easy to flip in the pan",
        "I use this big ole thing to make smash burgers and the occasional cookie. It’s perfect for getting under those crispy bits. Only slight downside is that it bends under pressure, buts it’s easy to fix.",
        "As other people who did not reads all the reviews I find out that any small amount of water left in any crack or crevice will rust. Disappointing to say the least.",
        "This is well named as a cookie spatula. It's very large for a spatula. There's a review that says it can be used for pizza, and yes, it might be helpful for pizza, but it's still not nearly as large as most pizzas. If I hold my hand over the metal part, with my fingers spread out wide, that's about how big the metal part is. I haven't used it yet, but I'm sure I'll like it. It's nice and sturdy. But it showed up when I searched for \"pizza peel.\" If you want a pizza peel, don't buy this.",
        "LOVE THIS! It's used everywhere! I chase the dogs with it, I slap the spouse with it...no, just kidding. Very useful for grilling (think burgers, or fragile things), baking (cookies, cakes, etc). Really puts all other spatula's to shame - buy this & throw the rest out!",
        "It's much \"handier\" size than I expected. Bought it for pizza use and it's seen a lot more duty than just pizza.",
        "Just get it and you will suffer no more with a small spatula.",
        "love it for making hash browns that is what i bought it for",
        "Know from the start this is a heavy spatula. I love the size, it's perfect for my needs. Would I buy another? I think not - it's a little too heavy. But I think it'll hold up forever.",
        "Bends out of shape easily and feels awkward... am returning.",
        "This is the best we have found for making Smashed burgers!! You will be very happy if you purchase this one.",
        "Great tool for cutting or turning scrapple and other food in the frying pan.",
        "Great value - well built and will last forever if used the right way. The handle will bend if you apply significant pressure, but remember that this is for cookie and baking. If you want a pry tool for the garage look elsewhere. If you want a great spatula for a budget price this is an excellent buy.",
        "I bought this for flipping hash brown potatoes. Works perfectly for that and I've been using it for 6 years, so it's durable, too.",
        "This is the perfect size spatula for tarts, pies etc",
        "The size is good, but broke after using twice. Screws all fell out.",
        "perfect size. very strong. just what I was looking for. Thank you for a great product.",
        "I love this thing! it is big enough to flip pancakes and burgers with ease. It's well constructed and feels solid in your hand.",
        "Perfect! Big enough for hash browns,pancakes,anything that requires heavy duty spatula",
        "I always mess my pancakes up when trying to flip them. Not anymore! Really heavy tho..",
        "Very flimsy metal in my opinion. This one is somewhat sturdier",
        "If you order something like this on a specialty sight it is $125! This one was $15 and it is perfect!",
        "Well made, perfect for pulling a frozen pizza out of the oven.",
        "Love this!! You'd be surprised how many foods you can thuds with --- including pizzas!",
        "This is a good heavy spatula. I had a flexible, plastic one that would bend trying to lift anything.Threw it away after getting this one. Good price too.",
        "Very high quality. Is an xmas gift, but I expect it will work very well.",
        "Works great for cookies. Should not use on non-stick surfaces. Very well made and heavy. Nice tool to have in the drawer.",
        "great for lifting pizza from the oven.. Pie plates too. I was looking for something that I could retrieve frozen pizzas and this works great",
        "I love this spatula. Its so much easier to get the cookies off the sheet while still warm without messing them up.",
        "Spatula is HUGE!! I love it, I can make pan sized pancakes without using 5 spatulas now!",
        "This is the largest spatula I have owned, and it's been amazingly useful. It's very well made and makes me feel like I'm performing for TV when I use it.",
        "nice size, not to big or heavy. Great for the grill and oven to take out cookie sheets with no sides on them.",
        "It's a nice size but I expected something more flexible to use for pan cakes, eggs and personal size pizza. This spatula is very thick and awkward to use.",
        "I USE IN MY KITCHEN FOR MAKE PANCAKE Y TORTILLAS AND CACHAPAS (SWEET CORN CAKE). THE DELIVERY IS FAST. THANK'S AT LOT",
        "This is also good for pancakes, pizza and other uses when u need a very big spatula.",
        "The beveling at the edge is too sharp and too thick and it cuts whatever I'm trying to turn... eggs mostly.",
        "Flipping omelets or pancakes is so much easier with this spatula",
        "If you want a ginormous spatula this is it! If you only want one large enough for a good sized pancake , this is not it! Can't even fit it in my drawer with my other kitchen tools. Ended up paying $40 at William Sonoma for a large metal one. Too much $$, but great quality. Really, how hard is it to make? You can find plastic large ones all over, but not metal.",
        "Love this extra large cookie spatula! Works great on my pancakes, too!",
        "wish more things weren't MADE IN CHINA!! other than that huge disaster on fox run's part, this spatula is very sturdy",
        "I have this one spatula that I love.. Come on! We ALL do. Alas, mine was a little worse for wear. It was beginning to rust in places and everything I used it for would stick mercilessly. Finally, I began searching for a replacement to my most used kitchen utensil. This spatula is it. It's beautiful, balanced. and what I love most? It's short handled! YES! You don't have your hand back 9 inches trying to flip an egg, or pancake! It's great and I love it. Oh, I still have my old one. I don't use it but just cant bring myself to let it go yet. Y'all pray for me, would ya. :)",
        "As others have said the rivers are loose but I can deal with that. I don't put it in the dishwasher so I may just use a little epoxy or JB weld or something like that cause the problem is that the handle material is not equally thick under the rivets. I sharpened the bevel to my liking & now I'm a happy camper. After using a few more times I found the bends need reinforcement. If any force is used as in scraping the top of the griddle it easily bends. A rib of some kind would take care of that. Bottom line don't try to scrape with it.",
        "Solid built mid-sized spatula. This is probably more suited for indoor cooking as the handle isn't very long. Note: The instructions and the description state that this needs to be hand washed. This is very true! I didn't think about it and after one run in the dishwasher, it developed rusty spots. I'm sure I can get the spots off, but I didn't think after one use... My mistake, but I was surprised that after one dishwasher run the metal rusted.",
        "Brand new out of the box and the handle is already loose. It was not riveted on properly. I'm debating on whether I should take my chances with replacement or just return it altogether. Seems other reviewers have also had issues with loose rivets.",
        "It is two weeks old now and the handle is coming loose. I have not seen a rusting problem as others have complained about. It is not made of a 300 series stainless steel such as 316 stainless as most stainless steel cookware because it is strongly magnetic. It could be made from a 400 series stainless steel, like stainless steel knives, which could be why some people have seen corrosion when run through the dishwasher. I have washed it at least 4 times in the dish washer with no signs of corrosion. If the handle didn't come loose I would be happy with the spatula",
        "Perfect for cast iron cooking: Straight beveled front edge, rounded corners. Feels durable. Only downside is durability of handle; it's going to bubble or melt if you let it get close to flame. So don't do that. Otherwise, the handle seems fine. Other commenters have mentioned that the blade is somewhat sharp. This is true, but it's only about as sharp as a butter knife. Also make note that it is not dishwasher-safe, despite being made of stainless steel. (\"Stain-less\", as they say -- not stain-proof.) I'm getting a second one as a backup because this is the only product I've found that meets all my criteria for a good spatula.",
        "So i was excited about this... I get my package and it heavy and feels durable but i open it and it looks used and feels like its falling apart.",
        "I would have given this a 5 star rating except for the bend between the handle and the spatula plate. This is usable but this area is marginally weak. If I try to pickup a soup bowl from the microwave the handle-spatula connection feels like it could bend, so I support the combination with a pot holder and it is usable and my hands are protected from the bowl heat.",
        "Made well and does what it is supposed to do. It has a nice weight to it, in fact it seems heavy enough to use on a grill to flip hamburgers. I have used for pancakes witch was lovely to be able to pick up the whole thing. However due to the size if it would be a bit awkward if you were trying to use it in a small pan.",
        "Oh my god it’s so huge I thought it was a weapon! This is huge, I never saw one this big except maybe for an outdoor grill but I love it and I’m keeping it because if you are baking cookies, one swoop and you’ve got all the cookies lifted from the baking sheet!!",
        "For reals this thing is stout .... For those MFs that said this thing is thin and breaks easily... not the case.. but if you doing masonry work yeah... it won't last long... Great product st a great price",
        "This is great for flipping quesadillas and moving cake layers when building a layer cake. I gigged it a star on durability because the metal between the spatula plate and the handle seems like it could be a bit more substantial. That'll be the weak point. If it bends, it'll bend there."
    ]
}