{
    "entity": "Muffin & Cupcake Pans",
    "text": [
        "The manufacturer directions for using this were a bit confusing, but they suggest NOT using spray oil because the pan is already non-stick, and the non-stick pan spray can cause a film to form. I have had flawless cakes and other baked goods without spray oil (and even without butter). I have been hand-washing it to make sure nothing compromises the non-stick coating -- this is a great piece of baking equipment that I'm hoping will last for years!",
        "I made my chocoflan and it worked great and got it out the mail the same day and went straight to baking and the cleaning up is so easy",
        "Love this pan!! Sturdy and has some weight to it. I've made 2 cakes (blueberry lemon pound and pineapple upside down cake) so far and they came out easily by using Baker's Joy baking spray. It holds at least 3 cups of pound cake batter. If you buy it, you will not be dissapointed.",
        "After seeing an on line video about making pineapple upside down cake with this baking pan, I went ahead and bought it. I am glad that I did and have baked several pineapple upside down cakes now using this and they have all turned out delectable.",
        "I bought this pan to use for all kinds of bundt recipes, but used it for an Angel Food cake for its first trial run. I was a bit concerned because you are really supposed to use a tube pan for angel food, however, it turned out great, and I had no issues releasing the cake from the ungreased pan. I find the rim edges to be a bit sharp, but in handling with care, this was not an issue at all. Great bundt pan!!",
        "I've been using a bundt cake pan for 25 years. Slightly oil it and let cake cool and then flip over for perfect removal. Decided it was time to get a new pan as old one was getting scratched up. Tried 3 times with this pan and every time it sticks. When the cake finally comes out chunks are left in pan. Ordered a different pan and hoping for better results.",
        "I made the perfect Pineapple side up cake for a Pastors event and the pan was perfect for the design of the cake! Easy to clean but be very sure to use a plastic spatula when removing your cake or you will scratch up the pan. Also it was heavier than I imagined, very sturdy and worth every dime. From LaQuisha Rochester,NY.",
        "Nice, hefty pan. Not a single cake has gotten stuck, which is so important for a bundt cake! Cooks the cake very evenly. Overall a wonderful product.",
        "The Amazon driver left the package containing this pan in front of my garage door, and I ran it over when backing out of the garage. When I fished the package out from under my car, I was sure I’d find a mangled Bundt pan. I was pleasantly surprised to find that the pan hadn’t suffered a scratch. Surely, if this pan can survive being run over by a Volkswagen, it is sturdy enough for anyone’s Bundt cake needs.",
        "Meh leaked. Very disappointed would not recommend this unfortunately it leaks making matters worse the nonstick scratched while taking a piece out with our plastic spatula.",
        "This was a great deal! The pan is perfect for keto bread and bagels especially since its non stick.",
        "Really disappointing pan! I’ve been making a refrigerator cheesecake for many years, and decided to get a new pan. This pan had the cheesecake stuck on so badly, I really had a mess trying to get it out. When I lifted the ring up, big chunks of my torte came up with it! This is NOT non-stick! This never happened in my old pan. Waste of money.",
        "Spring Form Pans he’ll make the perfect cake. No more fighting to remove the cake from the pan! No more scraping to loosen the cake from the sides or bottom.",
        "This pan is quite heavy duty! I was surprised at how sturdy it is. Cake didn't stick, and came out very easy. Would I buy it again: Yes.",
        "Looked at cheaper pans but landed on this one. Glad I did - it's very sturdy and worked perfectly. I saw some mixed messages in other reviews about NOT using any non-stick spray. with this pan. Thats not what the directions say - if your recipe calls for non-stick spray then use it. I did and my cake was perfect. This is a durable pan that I'll use for many years to come. I recommend.",
        "This pan is just what I was looking for. Super non-stick, great size for keto buns, eggs, etc.",
        "This s a very heavy duty pan. In the picture you can't see that it is actually two part. The cone part is soldered or welded onto the main part of the pan, but not very well. I made some monkey bread and all the melted butter seeped out of this seam, messed up my oven. The bread was ruined. We washed the pan and then filled it with water. Within a few minutes the water level was even with seam and the bowl we set it contained all the water.",
        "This bundt cake pan 🎂 is great quality product! It is well made, sturdy and heavy, a good heavy not heavy like ughhh I can’t pick it up what a hassle but heavy as in a great made bundt cake pan! Love it and cakes don’t stick. This has been a great purchase, my mother loves it! So glad I found this one, so if your looking for one I don’t think you’ll be disappointed with this one either happy shopping.",
        "Very happy with this set. It is very heavy and thus far has been dishwasher safe. I have used the sheet pan several times since purchasing and see absolutely no wear from the dishwasher. All the pans used have cleaned extremely easily, whether I have hand washed them or put them in the dishwasher. I do alot of cooking and have had a difficult time finding durable, heavy bakeware. This set exceeded my expectations and I would definitely recommend.",
        "This is a sturdy Bundt pan that is truly non-stick. I sprayed the pan with cooking spray just before filling with batter, and cake released perfectly! No gunk left in pan, either. Tip: Let cake sit upright in pan 5 minutes before inverting pan on baking rack.",
        "I like the sturdiness of this pan. I bought it to make a pineapple upside down cake. I thought it wouldn’t leak but it did. It is easy to clean. I still recommend using parchment paper when using. My cheesecake crust stuck to it because I thought it wouldn’t stick without parchment paper.",
        "I like cuisinart great products for the price but a few of there products do disappoint me from time to time. These banking pans rust in the dishwasher even though it says dishwasher safe. Aswell as the non stick coating is flaking off or bakes to the food I'm cooking. Will try to warranty exchange and see if the new ones do the same.",
        "I love these pans. I bake a muffin recipe in them and end up with 6 large cookie thingy's . Easy to eat with your hands.",
        "Pretty. Almost a copper color. Meets Cusinart quality standards. Easy to use. Gave it as a gift to an excellent cook, and she loved it.",
        "This pan is great. I’ve he’d it a few times, and my cakes have come out evenly baked. The pan is not too hard to clean, but I think it should be hand washed.",
        "Nice heavy non stick pan. Have enjoyed using and experimenting with.",
        "Made a cheesecake, no leaks or other problems. Seems sturdy enough, well made product. Cleaned up easily. Hope to get many years of use out of it.",
        "I have been debating whether or not to buy this pan. I am really happy I did! There are so many great recipes you can make using it. It's really sturdy and a great quality pan. I am very happy with my purchase and I use it frequently.",
        "I haven't used this yet with batter in it but based on how quickly water passes through it, I kind of doubt that it is leakproof. I will however update this review as soon as I've used it. It is heavier than my other springforms so that is a plus.",
        "I don’t really do a lot of baking so I just use this for the first time. That was also the reason that I didn’t want to spend a whole lot of money for a Bundt pan. This pan is great. The cake came out of the pan perfectly without losing even one crumb. And the price was excellent. So glad that I picked this.",
        "This is definitely a heavy duty pan. Pretty thick and heavy and I love using it. Make sure you spray or grease it well cause when your cake sticks it is just a sad disappointing pile of cake you will get. But I guess that is baking 101.",
        "Starting changing color after the first bake and i returned it",
        "I have owned many toaster ovens over the years. Unfortunately, the baking/cooking pans were always a total disappointment. My thanks for the quality and workmanship of this starter set...perfect heating and EASY to clean, for starters.",
        "Love my baking pan! Used it for the first time last Friday. I made a chocolate/raspberry cake and it came out beautiful and yummy. My family loves it. The cleaning was easy. I followed the instructions and washed it by hand. It’s a nice pan to add to your baking collection.",
        "Once you put your cheese cake in, you can't even lift it to put it in the oven. It all pours out of the bottom. Totally useless.",
        "I have been looking for a good springform pan for awhile. I was very disappointed with this one because it leaked horribly. I am still looking for one that is well made and doesn’t leak.",
        "A lot heavier than the one my mom used to have. It seems like it holds heat longer than the thinner ones so you might want to give it more cooling time before removing the cake. Non stick surface works well and is easy to clean. Very happy with this item.",
        "I love Cuisinart items and this one was amazing! I used it for a rum cake I made at Christmas and the cake just slipped right out perfectly clean! So easy to wash up and very lightweight. A fantastic value right here on Amazon!",
        "I used this pan to make an Oreo cheesecake for my boyfriend's birthday and it held its shape great, it was easy to snap open and close, and perfect size. You can make a thick cheesecake or a thin one as well. I would definitely recommend this spring-form pan.",
        "I love this nonstick muffin top pan. We all now the best part of a muffin is the top. With this pan all I get is muffin tops. II will probably order another.",
        "This is a sturdy, durable really nice bundt pan. It is the 4th \"Chef's Classic Bakeware\" pan that i have purchased from Amazon. They are priced well & have a lifetime warranty. I plan to buy more in the future.",
        "I'm so glad I chose this one. Works as it should: no leakage, easy to clean. Also, it came with important instructions for the care of the pan which were very thorough (i.e., never soak). At this price, why buy any other.",
        "Great I love it. Very nice , my old thing is the top of the cake still sticks. I've tried without spray. Because the instructions state not to. And I've tired with spray. Still sticks a lot less with spray",
        "We love this pan for breakfast food. We use a piece of turkey with an egg in each circle and it’s perfect size for kids handheld breakfast.",
        "Really like the heavy and sturdy feel to this. I just used a little butter flavored Crisco shortening to grease it before pouring batter into it. My first chocolate bundt cake came out perfectly.",
        "I like Cuisinart brand and it is as expected, great! I also received it right on time for the time I was given.",
        "As always Cuisinart lives up to my expectations. This is a heavy duty pan . Cake came right out with no effort and was baked to perfection. Clean up was a breeze. Highly recommend",
        "Worth every penny! Much cheaper compared to similar products but works fantastically. I covered it with butter to do a spinach flan. It detached easily, no breaks! Happy Thanksgiving!",
        "The weight of the pan surprised me. It was so worth every penny. The cake turned out beautiful and the non stick (didn't spray the pan) came right out, clean up was a cinch.",
        "This product sucks. It completely broke and came off its hinges 2 months in. Waste of money because now the return window is closed. Not durable, not good. I probably got about 8 uses from it and that's it.",
        "love this product, i have been wanting one for a long time",
        "I like to prepare my rum cake here is perfect for that. I going to buy other to give to my daughter for Christmas she is gonna love it.",
        "I make cakes and rolls - pull a part bread in my pan - and this is a perfect weight and it cooks evenly! Also, really easy to clean especially between the curves.",
        "I absolutely love this! I use it to make pull apart bread and it’s amazing. Non stick, super easy to clean, and it is very sturdy. I can see myself having this for years",
        "I really loved this. Material is great. My cake didn't get stuck inside :) it has been really long that i couldn't find a good cake container. It was easy to clean.",
        "This is great, but smaller than I am use to. It is good quality and no stick, easy to remove cake.",
        "Very nice pan and easy to clean up. My only issue is that it was smaller than I e expected. Great value for the money.",
        "These are not like the original pans but I believe they will work just fine. Glad I purchased.",
        "If you like muffin tops then you need this pan. Quality for sure. Brought two....one for mom. She loves it.",
        "The pan seems to be alright for baking but the edge is reasonably sharp. My wife slided her finger washing it normally. Definitely returning for a pan with a rolled edge.",
        "I thought it would be thin one, but it's not it really nicely made.",
        "This is very easy to use, cleans easily and I get perfectly shaped ketobread buns every time.",
        "I mainly purchase cuisinart pans for their quality and durability that lasts many years. They are superior to other brands and you can feel it in their weight. They just feel like a good product. They use this brand of pans on all the cooking shows. I made hundreds of mini cheesecakes in these pans and they were to die for! Hint: make sure you set your pan in another shallow pan filled with water so your cheesecake doesn't crack too much!",
        "Excellent pan! It's not flimsy but study and substantial. The non stick coating is great. I thoroughly enjoy baking in it!",
        "This a your classic bundt pan. Serviceable but not very interesting in design.",
        "This pan is heavy and sturdy. It has a light colored interior so no temperature adjustment is necessary. It was fairly easy to grease and flour, but there is a seam where the inner piece is attached that you must be very careful to grease thoroughly and clean carefully. Overall, though, a nice pan that performed well. I'm happy with the purchase.",
        "This is a nicely constructed pan with a pretty good weight. Not too light and not too heavy.",
        "I use it to make keto bread and it works great for this purpose",
        "Test run turned out a perfectly baked product & slid right out of the pan.",
        "I am so pleased with this bunt pan. Made perfect holiday cakes, so easily. Non-stick and cleans up very easily.",
        "not only did my cake come out in pieces, I had to chase the pan over the counter as there is no place to get a good grip to turn it over. Wasted money.",
        "I have been using Cuisinart products for over 13 years and love them. This cake bundt pan is very pretty but the cake doesn’t come out easily. By the time the cake came out of the mold it was broken. Very disappointed",
        "I truly love my Cuisinart Bundt pan. It's is made out of a strong material. I have baked two cakes since I received it less than two weeks ago. The cakes came out of the pan with such ease. I would recommend this to everyone looking for a good pan.",
        "I used this bundt pan for the first time and it is excellent. My cake baked evenly. I especially like the fact that it came out of the pan easily--looks beautiful. Cuisinart does it again. Recommended.",
        "Wonderful pan! Love \"Nothing Bundt Cakes\" bakery here but quite expensive so decided to try my hand in making bundt cakes. Love this pan! Easy to use, durable & easy to clean. Will continue to use with different recipes. :)",
        "Great bunts pan sturdy. My other one has a bottom that detaches and cake leaked under it so I bought this one.",
        "I try to maintain a lowcarb diet so i got this to make caveman keto buns. It's awesome and the same size as the deli slices i use the buns for. I also use this as a cookie sheet because then i don't have to waste parchment paper.",
        "Great bu dot pan. Very sturdy. Cakes bake very well.",
        "I was pleasantly surprised when this pan arrived. It is much heavier duty than I expected. It should last for many years to come! No problem with the shipping or packing. I'm totally satisfied.",
        "This pan is very sturdy and makes very nice cakes.",
        "Heavy duty baking pan. Sturdy and worth the value spent. I'm a starting baker and love my pan.",
        "Easy to clean , will be last along time I really happy with it",
        "Very nice. I haven't used this type of bakewear in a long time. Was very glad I ordered it. Great weight and easy to clean!",
        "Moved and by accident left my other one at the old house. So I got another one just like it. Easy to use, easy to clean.",
        "Well made, and the bottom is quite heavy. I believe it will do it's intended job just fine. So the price is reasonable.",
        "I used this pan for the holidays and it worked out well...........good product!",
        "Very good quality pan. Easy to clean, very sturdy, and exactly what I wanted.",
        "Best bundt pan ever. Great construction, easy to clean, Would be terrific wedding shower gift!",
        "I had to replace my old bundt pan & this one gives perfect results every time. As long as you butter & flour the pan, you won't be disappointed.",
        "The mic didn’t stick to it, it was super easy to use. It is a little expensive.",
        "Brand new, first time I pulled them out of the dishwasher and rust water came from the pan.",
        "I actually bought one of these over a year ago. I bought this one as a gift and had it shipped to my cousin in CA. We are into a way of eating that is wheat free and low carb. This muffin top pan is perfect for making our own \"hamburger buns\" out of nut meals/flours. Recommend it highly.",
        "Works just the way I want it too. A great investment baker. Necessary for a \"from scratch\" baker.",
        "As hoped for. Wasn’t disappointed at ALL. I would buy this again",
        "Worked great for my keto cheesecake! Released easily, super simple to clean. Love it",
        "I bought this and, after just one use, it started leaking and almost ruined my oven. If you're baking anything with heavier batter (mine had apple slices in it), I don't recommend this pan.",
        "I greased and floured the pan just like I have always done with my old pan, which by the way, sticks and leaves some of the cake inside after cooling and trying to remove the cake. This pan just worked perfectly, cake popped right out. Love it.",
        "Great!Use this pan very often.Very good quality and cleans up easily.",
        "So everyone has seen the Seinfeld episode where Elaine starts the muffin top shop..... I always thought it was a great idea but a bit wasteful. Now Cuisinart has come up with the solution! If you are the type of person that doesnt like the crispier muffin tops as opposed to the bottoms, this pan is not for you. I love it because it makes a large muffin top that is a little larger than normal tops but overall is less food than a hole muffin. What a great idea!",
        "Easy to use. Even cooking. Cleaning was a snap. Heavy duty not flimsy."
    ]
}