{
    "entity": "Muffin & Cupcake Pans",
    "text": [
        "This was not a mini muffin pan. The wells are much wider and very shallow... more like a mini pie pan. The quality of the product is excellent, but it’s not as advertised at all. I had to check the pictures in the ad to make sure I wasn’t crazy. The pictures show a mini muffin pan. I put photos up comparing it to an actual mini muffin pan to show the significant difference.",
        "I really wanted to love this pan, and don't let me stop you from getting it. It has tons of pros, but one con really gets to me. Pros - hasn't rusted even a little after tons of washes and use fits standard muffin cups nicely muffins and cupcakes both rise nicely stacks well for storage cons - The edge is very narrow and hard to grab to pull out of the oven To make that issue worse the material does not slide easily out of the oven. We have many pans from many brands, but this particular one has a lot of friction with the oven grate that other pans don't have.",
        "Bought my first Nordic Ware muffin pan 15 or so years ago and it is still going strong. Bought another one just because I needed a second one. Non stick may be cheaper, but they sure don't last as long. I get reliable browning and cooking every time with these. I don't really need to rotate them, but I do anyway because directions always say to do that.",
        "Used today for the first time for raspberry muffins. It baked beautifully. I had read the review regarding the size of cup, but I put a cupcake liner in this one, and in my current older pan - the liners fit the same. I do not bake huge muffins, but so far, I love it!",
        "Super sturdy pan that I suspect will last me much longer than any nonstick pans I've had! It also holds heat better, so I get better and more even caramelization on what I'm baking. I made mini rum cakes and they turned out perfectly! Stainless steel can be harder to clean than nonstick but I think the pros outweigh all the cons, and with proper greasing, food releases easily enough.",
        "Nordic Ware pans are the best pans. Stop looking and just buy this brand in everything you possibly can. Don't leave them sitting to soak. Just wash them. Otherwise they tarnish (does not affect the quality of the pan). If you like your pans looking shiny and new as these came, wash them after they've cooled but don't allow them to soak. They cook incredibly even and all of my muffins just pop out. I've given this as a gift to my niece and myself.",
        "This muffin pan made the best and most evenly baked muffins ever in the history of my muffin baking. I make most of my muffins from scratch. After using two old pans from years ago that were not baking evenly, and the bottoms would stick no matter how much spray oil I applied, I finally woke up and bought this fabulous muffin pan. I have two of their oblong cake pans and they are also the best I have ever had in my kitchen. I am very pleased and highly recommend Nordic baking products.",
        "The muffin tins do not have an indent/line around each circle. Take a look at your muffin pans and you'll see what I mean. I never gave it much thought but these clean up so much nicer. I do seem to need to bake muffins longer, though.",
        "Like others have said - this is NOT a mini muffin pan. It's a mini tart pan. The cups are broad and shallow. I'm disappointed, because I want to make mini muffins, not mini tarts. Otherwise, it's a lovely, sturdy pan.",
        "This was an exceptional purchase for the value of purchase but with the lid which helps use the muffin tin as a storage container for baked goods/ easier to travel also. Going to purchase a few more very soon. Price higher in the local retail stores and that was a deterrent for me. Shipped quickly. Recommend to others. Fits well in small ovens and more than one can be used at a time because design does not have silly useless handlebars in the overall design. Bakes well and evenly.",
        "I knew the moment I lifted this pan out of the box that I was holding a quality piece of bakeware. It is sturdy as a tiny ox. I use muffin liners when I bake with it, so I can't speak to its release tendencies, but I have no issues cleaning baked batter drips off the top of it. Aluminum should be cleaned swiftly and by hand, and I take care of it appropriately. I put it on a sheet pan for easy grabbing and to prevent spills. And it's USA-made. Nordic Ware does a good job and this is a great muffin tin!",
        "These are the most sturdy muffin pans I've ever used! Others we've had bend when you shake water off them, but not these. For everyone asking about toxic non-stick surfaces, these muffin pans are just metal; no non-stick goo.",
        "Having learned to cook in restaurants, I really appreciate quality, commercial-grade equipment. This is simply the best muffin pan I've ever used. The alumunum is hefty and the workmanship is outstanding. To address issues raised in other comments, standard-sized paper muffin liners fit perfectly, and it's not a good idea to put this in the dishwasher. The detergent contains phosphates that will corrode aluminum.",
        "I bought these for my granddaughter. They are a wonderful one solid piece of metal. No,rims welded in tomcatch batter and make cleaning a nightmare. The cups are closer together than some other tins but not a problem. They are sturdy, solid...very well made. The price is good and the size a bit smaller than mine but will fit nicely side by side in many ovens....I am so pleased I have yomresist buying a set for me since I already have 3 very expensive tins. Wish they were one solid piece of metal.",
        "Nordicware is the absolute best! Made in USA baby !",
        "Whether your an occasional or avid baker quality pans are essential in any kitchen. Self taught cook who never understood how much more difficult I was making baking by using cheap pans until I bought my first Nordic Ware. Loved it so much I bought EIGHT more. Wanted a quality aluminum pan and when I ran across this with the addition of the convenient lids I knew I found the right ones, pans are great and the lids really push this product over the top.",
        "I bought one of this pan from a discount store and it is a wonderful pan, so I ordered a second from Amazon. I've used them several times and they still look brand new. They are very heavy and will not warp. Nothing has stuck at all, everything has popped right out and cleaning it is easier than the nonstick pans I've used in the past. Baked items brown beautifully, and I am simply delighted with these pans. I'm actually thinking of ordering the matching cake pans even though I just bought new nonstick ones, because these pans will definitely last longer and are healthier to use. Highly recommend this line of pans!",
        "Nice, heavy pan. Cupcakes came out great. Lid clearance could be a little higher. Won't work if frosting is high, will get smushed! I would still recommend. Just keep the profile lower, maybe try lid on your highest cupcake. Can't speak to the durability, but it seems sturdy.",
        "This muffin tin is heavy-duty, commercial grade. The shiny surface produces even browning, without the danger of burnt, dry edges that you can get with darker surfaces. It's hard to find a truly top-quality pan like this one anymore -- I highly recommend it.",
        "I got these because I read that aluminum pans like this work best for cupcakes. They are great quality and have held up great. I treat my baking equipment very well and only hand wash.",
        "This is a well-made, heavy duty muffin pan. I've used it with and without paper liners and it works well , distributes heat evenly. I put it in the dishwasher (which will discolor it slightly but doesn't impact anything else) and it cleans well.",
        "Super nice heavy duty pans. I was surprized how heavy they were I instantly knew they were good quality. Defiantly worth it they never rust even in the dish washer. My mom has as to replace muffin pans and cookie sheets like crazy until she bought this brand. We treat them the same and she hasn't had to buy anymore since. Very pleased with this product my favorite part is it has a lid so u can leave muffins or cupcakes in there instead of dirtying a container or trying to dumb with plastic wrap.",
        "I bought these a couple of years ago, and I really only use them for occasional baking. Somehow, one of the pans developed a huge hole. I have only ever hand washed them, so this is really disappointing. With so many other good bakeware options, I would look elsewhere.",
        "Makes evenly baked cupcakes and muffins. This is my second one. I got rid of all my old ones that couldn’t match this set with respect to professional grade baking",
        "This brand is great! Love the pans and love that they come with lids!",
        "Love that the bottom part of my cupcakes arent browned and the cupcake cooks very evenly. I had been looking for a pan to match an airbake pan i have because i make cupcakes, cakes and desserts to sell. Additional bonus that it has a lid that fits great!",
        "Not coated, so I don't have to worry about those chemicals. And easy to clean because I can use commercial cleaning solutions on it since it is all Aluminum. I can also scrub it with my sponge without worrying about scratching the non-stick coating since there is none.",
        "I am replacing these with ones I have had for 47 years that are really beat up! They are heavier and better made than my old beat up ones!",
        "Greatest muffin pan! I absolutely love it. It cooks the muffins or cupcakes evenly, cleans up well, and you can leave it soaking with no worry about rust. I also appreciate that it is not covered in dark non-stick coating, which always made my baked goods get too brown. I wish I had found this pan 20 years ago. Love it!!",
        "Love these pans! I gave up on nonstick and will only use these.",
        "This brand of bakeware is the best. Little more money. For me, worth it. Bakes even and consistent. Being aluminum, hand wash only. Put in dishwasher and they will turn dark gray. Not fun scrubbing off.",
        "This pan is much heavier than I expected. Nice sturdy quality, and it has some kind of non-stick finish that makes it very easy to clean. The aluminum pan doesn't result in burned muffins like the dark non-stick Teflon-type pans. I'll get a lot of use out of this pan!",
        "Can't believe I have been making cupcakes with non-stick muffin tins my whole life! The cupcakes turn out more moist, less brown on the outside, and they cook A LOT more evenly. Invest in these instead if you want your cupcakes to really shine.",
        "Perfection! I didn't want a non-stick pan, check. I love that the lid fits perfectly on the bottom & doesn't take up any additional storage.",
        "I wanted something that didn't stick so I didn't have to scrub after each use - or that I didn't hear my husband complaining about scrubbing. This is nice. It cooks evenly, doesn't brown to dark, and cleans easily. The muffins and mini frittatas come out easily lightly greased and not greased respectively.",
        "I wanted to use this muffin tin but it has a black residue that won’t go away. We hand washed it after we received it. I then went to grease the pan with a napkin and coconut oil and the napkin turned black. We hand washed it two more times and it still has the black residue. Unfortunately, we have never been able to use it.",
        "No more scrubbing muffin spill-over out of the seems in the cups. Equally great for baking large meatballs.",
        "I am not a fan of coated (non-stick) cooking pans, so was delighted to find Nordic Ware had thick well-made, good size pans. So happy with my purchase. Might take a bit of extra soaking, but there are no seams that trap batter, so it is easy",
        "Theres no little lip at the top edge of each cup where on other pans, the metal from the cups meets the metal of the pan. This is so important because it makes this pan CLEANABLE, which dramatically extends the life of the pan. It is also heavy and well made, so its a winner.",
        "Love these muffin pans. (I hate the nonstick pans, they scratch and don't work after a while.) Aluminum pans are the best. They are easy to clean and last forever. These are really sturdy. You will be able to pass them onto to your kids!",
        "Nordicware is probably one of my favorites. Bakes evenly and the lid makes it easy to transport. The only things I would change is the lid height so that you could transport cupcakes that had icing. As it is, even if it's almost flush with the cupcake top, it'll stick to the lid. Also, would be nice if the fit was a teeny bit tighter. Not a deal breaker, though. Still a great set.",
        "I love the Nordic Ware Aluminum products. First they are made of one single sheet of Aluminum, no rolling of edges or pressed/rolled cups. So much easier to clean. My mini muffins cook to perfection, they are evenly baked without the outside being over baked or the middle section needing a little more time to completely cook.",
        "I love that this isn't coated with a non-stick surface. It will last forever and ever without rusting. The lid attaches easily and securely. After using it for a few times, I'm going to order a couple more. It would be a great gift idea--bake cupcakes or muffins in them, wrap a bow around the muffin tin/lid and give a beautiful and tasty gift!",
        "THese Nordic Ware pans are absolutely the best ever. They are heavy weight, seamless, and do not warp. I have had a set for years and purchased these for my daughter-in-law. The lids are perfect for carrying cupcakes to events. All the Nordic Ware Natural Aluminum pans are great. I have them in all sizes and shapes and would recommend them very highly. You won't ever have to replace them.",
        "Works perfectly fine for mid-size mini muffins. A word of warning, I had another one of these earlier and accidentally put it through the dishwasher despite the instructions saying hand wash only. They really mean hand-wash only as the finish gets completely ruined, so make sure you pay attention to care and you will be happy with this.",
        "These cook great and evenly. Our problem with the dark pans is our oven burns everything on dark sheets. Not an issue with these Nordic cook ware.",
        "Bakes evenly without over browning. I always use cupcake liners for muffins and cupcakes for easy cleanup.",
        "These muffin tins are lightweight, bake evenly, and clean easily. They don't have a nonstick coating so there is nothing to flake off over time, and with a little spray oil they release muffins very well. Attached is a photo of the tins after a batch of chocolate chip muffins.",
        "Very well constructed and sturdy material. Not a thin metal pan. Lid fits very well. Will but from this seller again.",
        "Love this muffin tin. It's easy to clean, seems pretty heavy duty. Our muffins bake uniformly (we also use muffin liners). No complaints at all. I've had it for over a year.",
        "Made a decision to upgrade my bakeware - so glad I did. These are sturdy and easy to clean. They also seem to do a much better job of evenly baking.",
        "These pans are heavy duty, seamless, easy to clean. Best cupcake/muffin pans I have ever owned.",
        "Love this brand. Definitely hand wash otherwise it gets discolored in the dishwasher. Bakes wonderfully.",
        "Thick aluminum pan. lid is very useful. Will not rust like my old non stick.",
        "I bought this muffin pan because my other one would not fit into my Breville smart convection oven (best counter top oven/toast oven ever). This one fits with a little room to spare! Very happy with the purchase so far but have just received it and not used it yet but I'm sure it'll be fine. My regular size paper muffin cups fit perfectly, they extend about 2 mm above the tin. The pan has a few minor scratches but that does not matter to me as long as it makes good muffins.",
        "I have some Nordic Ware baking sheets, and I absolutely love them. So when I was in the market for cupcake pans, I decided to buy this brand again, and I'm happy I did. These cupcake pans are very sturdy, they're made out of heavy weight aluminum, and they're all one piece. My cupcakes came out beautiful, evenly cooked, and cleanup was easy. You get what you pay for, and this one is definitely worth the money. It will last for decades to come.",
        "I preheat this pan in the oven just before using. When the oven reaches the proper temperature I spritz the cups with cooking spray and pour batter directly in. Even crustless quiches haven't stuck to the aluminum. Clean-up is a breeze with hand washing. The lid is wonderful to have and even fits the Nordic Ware 1/4 sheet pan. Very nice quality!",
        "I love the material, very sturdy. It's too bad that the holes are too close together. If your muffins rise, the tops will merge together.",
        "The pan is fairly heavy, which helps distribute heat evenly. It's only a pain to clean because it's a muffin pan but still much easier to clean than nonstick ones.",
        "It's Nordic Ware. Nothing else need be said. It's the best there is.",
        "A bit heavy, but bakes nicely. The cup size is slightly larger than some other makes, but not a problem. Quality make of pan.",
        "I'll make this short and sweet: The Good: They're shiny aluminum, so you won't suffer the crispy bottoms as you would with dark pans. Additionally, there's a bit of thickness to the bottoms of the cups, so it will heat and bake very evenly. The Bad: They're shiny aluminum which reflects heat, so my 14 minute cupcakes now take 16-17 minutes to cook. Lastly, since they're aluminum they can dent if not handled with a bit of care. The Verdict: For under $12, you won't find a better value. Period. I've searched high and low for shiny cupcake pans to avoid crispy cupcakes and these are the real deal.",
        "Holy cow....simply the best muffin pans ever. Very smooth and heavy, the edges are rolled and the whole top is even with no places for stuff to stick, so it is super easy to clean. I use just a little spray oil, and muffins just fall out.....golden and perfectly cooked. These muffin/cupcake pans turn out a much better product than either my old Teflon coated or my silicone pans. And, they are made in the USA! Big plus.",
        "I love these muffin pans. I am not a cook. I don't like to cook at all. I do like these muffin pans. They are lightweight, but heavy duty. They distribute the heat evenly and are easy to clean. They stay this light aluminum color and don't turn icky brown. I've used these for muffins, cornbread, breakfast quiches and cupcakes. All turned out well. These would make a nice gift for a new house, Mom's day or the chef in your life.",
        "This pan works great. It won't fit standard mini muffin paper cup liners. I just use coconut oil though and the muffins come out really well.",
        "The muffin tin was stained and heavily scratched. I am wondering if the reason these were a reduced price was because they are seconds? If so, that should be included in the description.",
        "Love these! They are a heavier pan. I would definitely order these again.",
        "While I love the quality of the pan itself, if you are going to ice cupcakes, you will be unable ot use the lid at all. The only time you can use the lid is if you truly just make muffins... and even then you might squish the top of the muffins a bit. Great quality pan, I just wish the lid was a lot taller!",
        "What a steal. This is a great item to add to your collection and at a fantastic price. Lid is finicky and does not stay locked on but is better than no lid at all.",
        "This pan works great. I greased with some coconut oil spray and the muffins slide right out. It's nice that it is cut out from one sheet so there isn't any joints at the top of the pan. BUT there is a slight groove at the bottom of each cup - I don't understand why the groove needs to be there, but it makes cleaning a little troublesome when you have some stuck.",
        "This is not a mini muffin pan. It is not a full size muffin pan. It is a weird in between size. You will not be able to find liners for these. Almost all my other baking pans are Nordicware so I am disappointed that these won't work for me.",
        "I wouldn't call this a muffin pan at all. I don't see how you could manage to get enough batter into each crevice without it overflowing to even create a muffin.",
        "I added a little oil before adding my ingredients, and it turned black! I washed it and it turned black",
        "This is the best pan I've bought! I was afraid it would stick, but not only it doesn't stick as it bakes so evenly that I feel happy to pop those beautiful golden cakes out of it every time. Also very easy to clean, specially because it feels sturdier and I'm not afraid to scratch it.",
        "These seem well made. I’ve used them several times - clean up is easy and no rust!",
        "Maybe I got a bad one, but the lid would not stay closed, and more importantly this pan is shallow, and normal sized muffins get squashed when the lid is closed (or you try to close it). The lid popped off repeatedly so I gave up and just stored it away somewhere. I'd return it if I could.",
        "My new favorite cupcake pan. The way these guys distribute the heat is amazing and lets your cakes get a great slow rise; way better than my steel pans. Will definitely be getting another. Great price for an aluminum pan as well.",
        "Nordicware is quality. should list the cup dimensions on description. they are 2 inch. bigger than I expected.",
        "Very disappointing. Both pans had holes in them. Quality control was not what I expected from Nordic Ware.",
        "In the desciption, it mentioned non-stick one area, but not nonstick in another. It's good....I just should have clarified. The recipient wanted a non-stick. Good product, just confusing description",
        "I love Nordic ware! This is a wonderful product and I keep buying more and more Nordic ware. I bought cookie sheets, bread pan and a skillet. Time to buy another cookie sheet and a small skillet.",
        "The pan looks great, and I like that it's nonstick. However, the lid is not very high so would not allow for cupcake icing. Fine for muffins.",
        "This is a nice heavy weight metal pan. The wells are not as deep as most muffin tins are though.",
        "I dont like the ridges. Makes clean up hard and my muffins stick because of them.",
        "I like this, but the cups are outrageously close together. If one were to fill the cups even just a bit too much, the tops would crowd and bake into each other or become misshapen. However, I don't like cupcakes with tops and am careful to not overfill, so I have not had an issue and I love this pan.",
        "I use it all the time but very hard to clean.",
        "I love these pans!!! Cooks evenly without burnt bottoms or gooey centers. Pricey but absolutely worth it. Will become a cherished heirloom for my grandkids and their children for sure!!!",
        "These are the best muffin tins I have ever had! I love the seamless design. Heavy-duty for years of hard use. Rolled outside edges give firm gripping edge and prevent bending. Two of these cost a lot less than one 24-cup commercial tin with matching quality and much easier to store in the home kitchen.",
        "I purchased this aluminum pan because the non stick one I bought was too dark and tended to burn the bottoms of the muffins before the tops browned. This aluminum pan reflects the heat better for a more even browning. Sure, you may have to grease the cups, but a spray of oil does the trick just fine.",
        "I bake (and store) blueberry muffins with crumb topping in it weekly. The lid keeps them fresh, does not smash the tops and allows for easy storage in the refrigerator and travel. My friend now is doing the same thing. Great product! Cleaning has not been a problem for me. I soak and lightly scrub - no problem.",
        "worked well with blueberry muffins. liberally buttered cups before placing batter.",
        "Love Nordic Ware. I buy all my baking pans from them, never disappointed.",
        "Heavy duty aluminum with noticeable weight. Works very well in making crab cakes!",
        "Purchased specifically for the cover. I was making cupcakes for a going away party at work. Unfortunately for me, the cupcakes were huge, so couldn't use the lid without squashing them. Otherwise super easy to clean, solid muffin tin, just watch the size of your cupcakes/muffins.",
        "Where have you been all of my baking life?!?! They are wonderful and no rims for dough to get caught in, clean up is so much easier.",
        "I chances upon a Nordic ware sheet pan set at Costco and haven’t looked back. Gradually replaced my baking dishes with Nordic Ware. Used these pans to make my first batch of cupcakes for a party and didn’t disappoint. Nice even cooking and no sticking.",
        "Love these! I have more than one because I bake a good bit. I highly recommend this.",
        "I have no desire to use non stick pans...hate chemicals. This pan is well made and all I do is coat lightly with coconut oil and there is absolutely no sticking. Cannot figure out why anyone would want to use a chemical laden non stick pan instead of this one.",
        "All my Nordic Wear products are amazing and this is no exception. Super robust and easy to clean. Definitely recommend.",
        "Awesome awesome pan. You do not see this type of quality nowadays. I am a critical reviewer. I challenge anyone to find a better made pan for the price. Durable and heavy aluminum."
    ]
}