{
    "entity": "Computer Speakers",
    "text": [
        "I purchase this set of speakers from Amazon in 2010! Its been SEVEN years, and they sound as though I had just bought it. After so many PC builds, these speakers remain and continue to impress. For a 2.1 setup, the sound is amazing. The bass is loud. A controller knob allows you to power on the system, adjust the volume, as well as adjusting the bass. A headphone jack is conveniently located there as well. Logitech makes high quality product and this is one of them! If you find this review helpful, please click 'helpful' button at the end of this product review. Thanks!",
        "Although this speaker system is no longer in production, for anyone looking to buy and old one or, possibly, a newer equivalent, I can recommend it. I used it for a television rather than a functionally limited speaker bar. The Z-2300 was far superior to the built-in television speakers and provided lower bass than my much more expensive (non-THX) stereo speakers. I have owned two THX-certified sound systems and they've both been exceptionally good.",
        "I bought this speaker system for my husband for Christmas 8 years ago, and is still works as well as it did when I bought it for him. Granted, at this point it may not be \"state-of-the-art\", but it still sounds good. He recently gave it back to me because he bought an all-in-one computer that has built in speakers. I plan to connect to one of my computers that we use as a server since the speaker system I had on this computer stopped working.",
        "I've owned these speakers for about 7 years now, and I can tell you I have never come across another set of 2.1 speakers which have come anywhere close to these. The sound is amazing and can only be matched, not beat, by other high-end speakers. The volume switch is great and has an easy-to-access headphone jack, as well as a power button. The bass is solid and does its job. Overall there is just nothing to complain about. Worth every penny, and I'll never feel like I have to shop for PC speakers again.",
        "I bought these speakers 7 years ago for $118 right here on amazon and they are still kicking hard. Zero Issues. This was a great purchase. If you turn the bass up, It's like you're at the movies. Great for movies and gaming.",
        "I have these connected to my current system. The 5500s are in storage. All I can say is this... If you plan on playing music beyond half volume.... Make certain that there is NOTHING of any value on a close-by shelf. They will vibrate until they hit the floor!!! Been there, done that...",
        "I bought these so long ago four about $150. I have literally DJed house parties with these. These are probably the best set of speakers I have bought. Sadly, one of my satellite speakers has finally died. Thought It was the wire, so I re-wired it, but same. update 9/3/2020 Great Speakers, NOT WORTH $1500",
        "Building a new PC and thought, maybe I'll upgrade my speakers. Turns out these are still one of the top rated sets you can buy. I paid $110 for them in January of 2011, and they still sound great.",
        "Used daily, still working 10 years later! Awesome sound for the price.",
        "I don't understand why this system is not made anymore. It is better than the systems that replaced it. I bought one some time ago for my wife's computer and I liked it so much that when my Altec Lansing speakers (that I had for about 20 years) finally started having trouble, I immediately looked for this system, not knowing it wasn't made anymore. I generally don't buy used equipment but I like this speaker package I took a chance buying one used. I am so glad I did because the system looks and sounds brand new and I could not have gotten it any other way. I still bought through Amazon's marketplace.",
        "These speakers were a gift for my boyfriend and he is very happy with them... they replaced his old Klipsch THX PC speakers, and the output is about the same. I gave appearance only 4 stars b/c I think the silver/plastic look is a little tacky; however, the hardware itself is sturdy. The manual volume/control is a little on the \"big\" side (about palm size), which is what we wanted. FYI~ there is a newer model for these speakers: the Z623. After reading reviews, I opted for this one, because although the newer speakers have some additional features, the Z-2300 serve the main purpose: solid sound for casual gaming and general music listening in our home office.",
        "I've owned these since 2009 and they're still rocking hard. No problem whatsoever with them. Really nice sound for any type of music I hear. They take a beating really well. The satellites have fallen and survived many 4 foot falls. I've owned many 2.1 speaker systems but these are the best I've ever had and the longest time I've ever owned the system. The rest have either had a satellite go bad, the sub-woofer going dead or a total system failure.",
        "I bought these in 2010, it is now 2014 (april) and I have one of the small speakers that blew, and the other speaker is about to blow anytime. I play these loud only one in a while, so that is a bummer, they have been great speakers though for the last 4 years. I have had the neighbors complain about how loud they get 3-5 times over the years, so if you want loud these work well. I have always enjoyed them, and only giving a 4/5 stars due to the speakers blowing, Maybe though I can still use the base box and get new speakers?",
        "That's 7 years ago. That's right, and I spent $103 on them back then. Total cost, including shipping. These speakers are AMAZING. That subwoofer is AMAZING. I love them. They are such high quality. This is as good as you're gonna get. I love music, like any normal human being, and listening to the newest stuff out of these speakers is always a pleasure. Thank you, Logitech. You have really surpassed yourself. Although it seems they don't even make these anymore. That's such a shame.",
        "It's truly amazing how well this speaker sounds. I have the Kilpsch ProMedia 2.1 and at first I thought this was best sounding system but then I gave the ProMedia to my wife and decied to try this system for Logi. Well..let me tell you this system is the one. If there is anything negative to say...it might have too much bass!!. I really like the ability to power of the system form the control puck where as with the Kilpsch I had to either leave it on...which I did (for over 4 years) or use the switch on the back of the sub. Another plus was this system from Logi was cheaper than the Kilpsch.",
        "I have had these speakers for 9 years they are still in perfect working order. I have no reason to upgrade them they sound great and work just fine for my computer.",
        "I liked the sound produced whilst this set was working. I purchased in June 2010 and the right speaker stopped working last November 2010. Luckily it was in the warranty period and Logitech sent me the revised model. I was actually about to purchase the z-5500's, because they were on sale, for my parents but seeing how fast these speakers bust, I decided not to. Recently I saw these went on sale again for even less than I paid on the June sale. I would have purchased another set to complement my current set but I thought I may not be so lucky this time around. I hope these z623s last longer.",
        "The sound quality of these speakers is amazing, the sound is deep and well balanced. One suggestion though try to put the subwoofer far as possible from your pc especially if you are going to listen to loud music (that much vibrations can't be good for your hard drives). Two minor detail bothered me a little. First the headset plug on the remote disables the speakers when the headset is plugged in. This forces you to plug and unplug the headsets everytime you use them. Also the cables are a little short giving you less choices in where to put the subwoofer. But overall the power and quality of the sound makes this item an amazing buy.",
        "Tremendous sound, especially for the price. I always elevate the bass in my music, and these give me all the boom, rattle and sub-woof I could ever want, with fantastic clarity. For those who don't like that particular sound, it's easy to adjust the bass down--there's a bass knob right on the desktop control, so it's easy to reach. I bought my first set of these speakers for the office and they were so great that I bought a second set for home. They are easy to install, they don't take up very much room, and the output is superb. After about two years, I haven't had a single problem with them, and I highly recommend them.",
        "I have been watching alot of movies now on line from Netflix. The movie quality is great over broadband, but I still had the old speakers that came with my PC. I originally looked at BOSE PC speakers, but they were very expensive, but did sound really good. I was originally skeptical of the Logitech Z-2300 speakers because they weren't very expensive. I still went ahead and ordered them. I have had them for a couple of months now, and I love them. The quality, especially for movies is fantastic. They are powerful little speakers, with a great booming bass bottom. I really enjoy them. And yes, the subwoofer is pretty big, so be sure you have room for it.",
        "WOW WOW WOW!! Pros: -Excellent sound quality -tremendous, wall & floor shaking BASS!! -bass adjustment -long cords possible Cons: -can be too much bass for certain genres of music, even when bass is turned all the way down -subwoofer is bigger than it apppears online If you're looking for loud speakers for your computer, MP3 player, or other devices that have a headphone jack, you need not to look any further than these! You won't be disappointed. I love mine. I would buy them again & I would definitely recommend them to a friend.",
        "I purchased this for my son for Christmas. I thought I'd hook it up and see how everything sounded. Man... am I impressed. The 8\" long throw woofer delivers incredible bass. The main speakers sound great as well. This is a 400 watt system. You can really feel the power if you crank up the sound. Be aware that this woofer sounds amazing because of it's size and weight. This baby is big and heavy! If you're cramped for space this may the the wrong system; but, if space isn't an issue, and you want loud, clean, powerful sound, this is a great value. I got it for $79 and free shipping.",
        "For the money, this system is powerful and will fill a room with music with great base. I like jazz music and have found the treble to be lacking. I listened to this system side by side with a Geneva XL system in my house recently. Now the Geneva is $2000. I felt this system held its own in a sound comparison, although the high end missed sublte parts of the music. Overall, for the money, it is a strong performer. The base and volume adjustment is also convenient. I did have problems with the small tweeters fading in and out sinc day one. I have just lived with it.",
        "WOW, I'm still excited every day when I turn on my PC and play music through Windows Media Player 11 and build-in sound. Was considering buying a sound card, but it sounds sooooo good, decided to save my money for something more needed. Had many other PC speakers before; this one is way better than anything else!!! Very loud; cristal clear sound and very strong sub! Very cool control also. Looks very nice too, like expensive electronics. Bought it very cheap, for about $70!!! Anywhere else it's over $130 still. Thank you for the great product and price!!! Highly recommend, will be very happy with it!",
        "Greatest 2.1 sound system ever made - too bad they dont make them anymore. I also own a logitech z623 - its a worthy \"successor\" but not as good as the original. Great sound and clarity for a 2.1, can turn it up to max volume without any distortion, and more bass than you can shake a stick at. Its the bomb.",
        "I bought this item to replace a 5.1 set I had been using with a Windows PC. When I switched to a Mac, I really needed a 2.1 setup. I originally was considering a lower-end model, but I read a review that suggested this one instead. I spent a little more than I was planning to, but I'm glad I did. The sound is outstanding. The wired controller is simple to use, with controls for power, bass, and volume. Speaking of bass, there's plenty of it. I can't think of anything I'd change on this, with the exception of the color: I'd have preferred to choose black over silver.",
        "This set rivals a decent living room system, sounds great!",
        "Purchased these 6-7 years ago...used them hard through those first few years of college, then continued to use them once in my first home! I have now been making recordings recently and these have been the audio playback option of choice for my electronic drum set as they have the appropriate amount of bass to handle the bass drum input surprisingly! I am currently using them as I speak. Rich, full sound with simple to use interface and sleek setup which does not appear outdated whatsoever (even as we approach a decade later!) Continues to impress me daily, if I had the choice I would buy again!",
        "Heaven, I'm in Heaven! I was supposed to get my Logitecs on Tuesday. I got them today! You gotta love Amazon, man! I set it up and low and behold... Music, pure Music. Very crisp satellites and a subwoofer to rival my Z-5500 Digital which would never fit under my desk. This sub fits under my desk with 6\" air clearance, except in the back, so that is a very minor adjustment. I'm listening to an analog recording on vinyl of Dooley Wilson singing \"As Time Goes By\" from \"Casablanca\" and all the pops and scratches are on the LP, and not in my speakers. I'm in love.",
        "Great speakers for the price price I paid for (black friday). Sub sounds great but the speakers aren't as clear as my very old ACS90 but gotten accustomed to them and don't really notice anymore. A treble knob would have been great too. But these sound great for speakers that were made around 6 years ago.. It seems through many reviews thought that longitech's costumer service is horrible and quality control on their products aren't that great either.. I hope these will last.. Wanted to purchase another one but price had gone up by +35 like a day later..",
        "like the title says, great for the price. easy to hook up. easily capable of volume greater than most people want/need. very bassy, but good across the whole range. makes listening through your computer a pleasure, especially with the vast amount of free content (especially itunes radio) available. not the most stylish or compact, but great sound and a great price. convenient wired hand control that sits on desktop (single knob bass/treble, volume, on/off). recommended for anyone except audiophiles and those with moderate to severe anal-emotional disorders.",
        "I have had these speakers for 8 or so years now. Can't believe it's been that long...but they sound wonderful. Gives you lots of base if that's what you like and they can get very loud. I also like the fact that you can plugin headphones into the controller. they are also very sleek and modern looking. This was a great investment. I imagine they will keep booming for another 8years. Quality product.",
        "These are the best 2.1 speakers that I have ever owned and they were at my front door within two days of ordering them (Standard shipping!!!!!). The only thing bad that I can say about these speakers, is that you can't turn the sub woofer completely off and the satellites could produce more highs and mid tone definition. Believe me, the sattalites still sound great and since they are connected via RCA cable, you can pick up a better set or use the ones from your old system. I bought this system because I love my logitech z 5500 so much and needed a 2.1 system to dedicate to my mp3 player.",
        "I recently realized I rarely use my stereo anymore, so I thought I would buy a cheap set of speakers for my MAC untill I could decide what to do. I now feel there is no need to ever own a stereo. I'm hearing things in my music I never knew was there. The separation of instruments and the feel of the bass is incredible! I'm not a technical person as far as audio equipment goes, but these have to be the best deal around. I had a simple question about placement, because I expected it to be more complicated; they answered my e-mail on Sunday of July 4th weekend. 10/07: I just bought another one.",
        "I'm not sorry that I bought my Z-2300's. The sound is clean at moderate sound levels with satisfying bass. Music and games are enjoyable and the design looks nice enough that you won't be ashamed to have them in your family room or living room. My downstairs PC has somewhat better sound but it's connected to a full size stereo. I'm not sure how to rate this, for the price it would be five stars but compared to other packages available at higher price, we'll say 3+. More expensive systems have higher volume levels but most people will find the Z-2300 to be loud enough.",
        "I had purchased the Logitech Surround Sound Speakers Z506, let me tell you if you are thinking of these smack yourself, cancel the order, and switch to the Logitech Z-2300 THX-Certified 2.1 Speaker System with Subwoofer. They are more than twice as loud and clear as can be. You can seriously damage your hearing with these speakers but if you don't want to do that the mid level volume is excellent. you lose the 5.1 true but gain so much in performance you'll forget about 5.1. To note the sub is HUGE so make sure you have room.",
        "Hands-down, the best speakers I have ever owned. Great sound quality, clear, and crisp. Unfortunately for me, the left speaker jack in the sub woofer stopped working after nine years of hard labor. I've bought a sound bar sense to replace the speakers, and it doesn't even come close. Please revive these awesome speakers.",
        "i dont want to just listen to music, i want to feel it.",
        "These are great speakers! I have a 5th Grade classroom and these can just blow the kids away.... Nice clean/clear voices, great depth to the sound. For the price, I don't think there is anything on the market that could possibly match them for the price. I would seriously consider using these for a home theater system as well (it even gives you the cord to do it if you want to). There is nothing else to be said. Only thing I would change is having longer cords from the subwoofer to the speakers (or better yet wireless)....they are pretty short so I had to get an extension so that could be placed strategically in the room.",
        "There are some really good technical reviews for these speakers, so please see some of the top-rated reviews for that sort of information. I can only add that the speakers are great, and not just \"great for the price.\" But at this price, they are truly wonderful. Deep, rich, sound. Very easy setup. As a helpful hint, you can definitely use these for a television set. For newer sets, just put the plug into the headphone input. It is definitely more of a complete tv viewing/music listening experience with these speakers. I really don't think you'll be disappointed.",
        "in a month mine will be 4 years old and its been great! it can get really really really loud without distorting. i can crank it and hear it all the way across the house with no problem and no distortion. for the sub to be only an 8\" it can boom when i got these, from my research they were the best 2.1 computer speakers out there. and they were for years and years not much else to say after knowing they are the best, or were one of the best for years",
        "I purchased two pairs of speakers - the Logitech Z2300 and Sony SRSDB500. The logitech speakers are 200W while the Sony speakers are 300W. Despite the supposedly lesser power, the Logitech speakers are waaaaaaaay better. The Logitech subwoofer is crisp at all levels, including low volume while the Sony speakers sound weird. The highs and middles on the Logitech also sound much much better. Only difference is the Sony speakers had an input for an MP3 player. That was not a big requirement for me as these speakers are connected to my computer and that is all I need.",
        "If you read all the reviews on this product then you can't go wrong. It's incredibly loud and the bass is awesome. The bass is actually quite large so make sure you take that into account if it will be used underneath a skinny computer desk. I am using this system with my xbox 360 and all the sound effects I was looking for is so cool. Came with the right adapter too - that was a nice touch by Logitech. You won't be disappointed with the price either. If you compare the wattage with other systems, you know you are getting an incredible deal.",
        "*GET ONE BEFORE IT IS SOLD OUT, LOGITECH STOPPED MAKING THEM IN SEPTEMBER, AND THE REPLACEMENT CALLED THE Z623 SUCKS COMPARED TO THIS, GET ONE QUICK! great speakers. these things actually push out bass you can feel, unlike the entry level s-220 that is only capable of pretty much \"mid range\", i had them, so i know. I got them for 80 bucks, which is a big steal for the power they produce. Yes, they will shake a house, and it goes low, makes sounds that only an 8in can do. the looks don't matter, its all about the power, which it is. anyone complaining about mids use a equalizer.",
        "I actually purchased this as a small stereo for my apartment. We have no need for true surround sound so this was a great alternative. It's so convenient to be able to plug in any audio source with a headphone jack. The sound is awesome. I had to turn the bass down because the sub really does it's job. This thing gets really loud! I can't even turn it up past halfway. Awesome sound output and awesome power. I'm very pleased with this purchase and would recommend this to anyone.",
        "So I guess I expected a 200 watt system to put out some pretty loud sound. Well it did, but then the satellite speakers started making the same noises as the subwoofer (and ONLY those noises). I had a party a few weeks after I purchased these speakers on Black Friday, and turned the volume up to 50%. So fortunately I was within my warranty, so I returned them and got a replacement set, but if I had that party say during January, I would have been stuck with ruined speakers. Anyhow, these are great computer speakers for the $75 I paid for them, and definitely a worthwhile investment. But heed my warning!",
        "Bought this 2 years ago. Stuck with it cause I was too lazy to return and it was a significant upgrade to my old $20 speakers. In the beggining I occasionally lost sound from my right speakers, I fixed it by turning the control on then off. Sometimes it wouldnt be a problem for weeks at a time until it decides to act up again. I've finally had it and buying a new set today. This time a surround system, and if this one acts up it be on the return plane within the hour.",
        "I had this system for two years. It worked great and NEVER gave me any problems. The bass on it was tremendous for a computer based sound system and it also had great clarity. As stated before the only drawback for this system is lack of a true midrange but who cares. This baby can boom! I've had both this one and the klipsch priced in the same price range and i must say that the logitech beats the klipsch hands down in terms of overall performance. If you have the chance to purchase this system. Do it! You won't be sorry.",
        "I purchased this speaker system years ago maybe around 2011. Still use them today, great little setup, the subwoofer sounds good, and has held up through several moves and still works great.",
        "7 years later going strong superb sound quality that lasts",
        "I could get detailed, but it's not necessary. The bottom line: You're not going to get a better system for the price. For what you're paying your getting a system that competes with a tier above it. It won't compete with a $600 system, but it's still very good. It's not perfect, the mids are slightly lacking. The bass however is fantastic. It's loud, it's clear. It's very good. It's well built, it's heavy (35lb box). You get what you pay for, in this case you get a bit more.",
        "Wow, These speakers Jam. Sitting hear in my office they sound better than my Kenwood 6 way speakers. I'm in a smaller room of course, but I'm still hearing my music like never before. The highs, lows, and separation, awesome. I tested them first with some gospel like the Gaithers to hear the harmony and then I cranked up some Disciple to shake the pictures on the wall. These are far superior to any PC speakers I've heard anywhere. The speakers I bought were refurbed but you wouldn't know it. And considering I only paid $79 bucks minus the $30 for using an Amazon rewards card. Thats $49 bucks. I'm very happy. Halleluuuuuuuuyaaa.",
        "These computer speakers are truly amazing, the bass is incredible!!! The subwoofer with these speakers is ever more powerful than my 200 watt subwoofer for my surround sound system!!! The subwoofer really produces quality, deep bass while the speakers produce loud, crystal clear sound. I have had 4 other pairs of computer speakers and these by far are the best computer speakers that I have ever had! If you want good quality computer speakers with a lot of bass then these are the speakers for you!",
        "Best computer speakers I have ever owned by far. Unfortunately they seem to be discontinued. I hear little distortion at even very high volumes and the subwoofer definitely works. If anything, I would say that the subwoofer may be boosted a little too much if set to medium on the remote. Overall though, I haven't run into any problems in the almost 2 years that I have owned it. It is odd though that my desktop sounds significantly better than my laptop when using these speakers. As a result, my laptop is connected to another sound system via a digital connection.",
        "Excellent sound. Deep, rich base and good definition right across the audible spectrum. I have used these speakers in a room 30'X50' in size, and they filled it with beautiful sound. They're easy to transport, or just to sit hidden away on your desk. The controls are easy to use, and the base control is an excellent feature. No problems after two years of use.",
        "These speakers are pretty good. The bass is great. The high frequencies are decent, but the midrange is lacking. I had a ten year old pair of Boston Acoustics before this and it was very clear that these speakers couldn't match those. After having these speakers for about a year I don't notice the flaws so much anymore because I've gotten used to them. But my first impression is what I remember most. I really like how the headphone jack is attached to the readily accessible volume knob.",
        "If you don't like overpowering, sometimes overwhelming bass then these speakers are not for you. Other reviews are right - there is very little mid range. There is a bass knob on the remote but even if you turn it all the way down, the bass is overwhelming. I am using them for my computer monitor so I can get by with their performance. If I try to play music, I get annoyed. I should have sent them back but the restock charge for opened merchandise and shipping cost, I may as well keep them.",
        "If you need a set of speakers for your computer, and don't want to spend more then $150... get these. I used to have a set of Z5500 on my PC before but I moved them to use with my PS3 and my main TV. I was considering another set of the Z5500 for my PC, but i realized i didn't need them so i down graded to the Z2300. Best down grade i have ever made. These Speakers Sound Loud and Clear. Im a huge Logitech fan, and they have not let me down with these. These speakers are so loud, i don't need to play my music thru my media system for a party.",
        "I saw the complaints about the missing middle that some others had made but decided to take my chances. Turns out all the reviewers were each at least part right: the top and bottom are good, clean and loud for the money but the middle was missing. I debated returning it but ultimately decided to get a splitter so I could hook up my original Sony VAIO speakers at the same time, and then with all 5 speakers going, and the Sony filling out the middle, it sounds pretty good. So make what you will of my experience but be forewarned of both the good and bad of these speakers alone.",
        "Bought this for my daughter who uses it with her laptop and TV/DVD player. The satellites generate a surprisingly big sound in her 15' x 20' living room and the subwoofer moves considerable air. There is a tendency for the sub to overwhelm the satellites, but that's easily curbed by backing off the sub's volume. The compact satellite speakers with their modest footprints are easy to position while the sub enclosure can be tucked away pretty much anyplace. Excellent bang for the buck.",
        "These speakers have got to be the bargain of the century at only $114. I put in a DVD movie and could not believe the sounds that were coming through my computer. I do not like my speakers sitting right in front of me on my desk. I like them on the top and angled away. I was worried that I would not have enough wire, but I did. Another inch away and I would have be heading to the store for extensions. If you are looking for a set of speakers that sound awesome and won't break the bank, get these now!",
        "This system is awesome!!! I can't imagine finding anything better for the price. The sound is clear, loud, and the bass is amazing. It is very easy to connect to many different media sources, such as cell phones, televisions, computer, etc. I did buy a digital device to adapt the laser output of one tv to the head phone jack. People often comment on how good the sound is.",
        "Listening to NPR's The Thistle & Shamrock on them right now. Good, room-filling sound, and we never crank it anywhere near its full power. Setup is simple and obvious. We feed various sources to these speakers: laptop, Android tablet, Blu-Ray/DVD player, FM radio, and occasionally cassette tape (for something we don't have in CD or MP3 format).",
        "I had an under monitor mounted speaker and decided to get an upgrade. Bought this Z2300 system. It was like night and day. The bass filled out the sound great and the two smaller speakers worked good. After 6 months, I started noticing a lack of bass. I unplugged the two desktop speakers and hardly nothing was coming out of the bass box, just a super muddy muffled sound. Maybe I blew the speaker, but I don't crank it up often. Looks like I now have a 20 pound slightly vibrating paper weight. This sucks.",
        "Great product besides the damage, contacted the seller before writing the review, didn’t get a reply. Basically the seller sucks! Its falling apart slowly but surely.",
        "I'm very happy with the sound quality out of these relatively inexensive THX certified speakers. Excellent bass, mids, treble. The design is very nice as well. Highly recommended. Tip: If you are going to use speakers of this quality, be sure to have a good sound card that can output a clean and clear signal. I noticed an improvement when I went from my motherboard's onboard sound to a Turtle Beach Santa Cruz sound card. The sound was clearer with better (deeper) bass and treble.",
        "These speakers arrived a few days after I placed my order. They were very easy to set up and the reviews of others before me helped me fine tune the system for optimum auditory pleasure. My roommate had logitech speakers on our computer before he moved on. They were a different model but good quality. These are very good too. Don't expect them to kick out the same sound as your home stereo system. Most people will be pleased with the quality. I've had a few different computer speaker systems over the years and these are far, far better than average. The price is quite fair.",
        "We bought this system to use with our Dell Jukebox (Ipod/mp3 player) for our bedroom. We were blown away by the full rich sound these speakers put out and the base gave a great \"bottom\" to the music. We don't blast the speakers and mostly enjoy jazz music. We could not be happier with this purchase and for the price we couldn't beat it. We just saw the same system \"on sale\" in our local big box audio store for $134.00. Can't say enough good things about this system.",
        "These speakers offer unvelievable sound quality for the cheap price. If you ever needed something louder than these for in-home use you are mistaken. The only thing that I found the slightest problem with is transportation. There are a lot of wires and the sub is very heavy. Also, I lost one of the little screws that the controller screws into and it creates a little buzz on some songs. You can only hear this up close though. This is entirely my fault, but it really doesn't decrease the quality of the speakers at all. Anybody lookinh for some really powerful speakers at a good price should consider buying these.",
        "This system rocks! The bass is sooooo deep, the volume capability is incredible. The earth moves when you turn the bass up, the floor shakes, its a housequake! Glorious, even when turned down with the headphones on still sounds good. I've had these for five years now and the only annoyance is that the headphone jack is a little twitchy and sound cuts in and out unless you position the plug just right, and don't move. But after five years thats not too bad.",
        "Wow!! I am impressed...and I consider myself to be REALLY picky!! These speakers ROCK..literally!! They are worth every penny! I'm glad that I did the research and settled on these. The sound is clear and crisp and the bass is unbelievable, whether you are listening to hard rock, jazz, or country. I love the volume and bass hand controls. Some people take the black speaker covers off, but I think it sounds great either way, so I left them on. I'm very happy...best purchase I've made all year!!! :)",
        "For the price, I couldn't be happier with these speakers. They have A LOT of bass, but the whole range of sound is pretty good. I've been listening to everything from hip/hop to classical to movies and haven't had a single complaint. The subwoofer is gigantic and takes up a lot of floor space. I've been practically using it as a foot rest; it's that big. The desktop speakers are small and the sound control is very convenient and easy-to-use. I'm pretty impressed!",
        "I currently own 3 sets of Z-2300 2.1 speaker systems, one connected to a PC and the other two connected to entertainment/HDTV systems. The quality of the sound, even at high volume levels, rivals systems costing much more. Tuck the sub woofer away, you still get a lot of sound from such small speaker cabinets. A good alternative to higher costing multi-media sound systems.",
        "I have had these for about a month now, and they are amazing for a 2.1. I am not an audiophile by any means, but they sound good, and are clear even at high volumes. The only gripes that I have, and the reason that I can only give them four stars, is that they only have one audio input, which means that if I want to use them for my computer, and my X Box, and my mp3 player, then I have to unplug from one and replug into another. Also, the cord on the volume/bass control is not very long. Other than that, I could not be more pleased.",
        "So far I've bought two sets of these, and loved them both. For the price it can't be beat. Even on 1/3 volume, these things are pretty damn loud. The bass sounds fantastic, and they are much more clear than the Z-523's, and are worth the extra amount of cash. For any of you comparing the Klipsch ProMedia's, look away.. Cnet gave these much better reviews, and not to mention the ProMedia's are overpriced. Hell, get two sets of the Z2300's for only a little bit more!",
        "After doing a lot of research on what to buy, I finally settled on these Logitech's. I've been all smiles since I plugged them into my Audigy driven system. The sound is very crisp and clear, base response is excellent due to a sturdy subwoofer and the two satellites on top of my desk are bright and balanced. They look great and I love the remote volume control with its balance knob. I've just finished downloading a couple of Christmas albums and they sound way better than expected. Yes, the subwoofer is pretty bulky, but it fits under my desk without any hassle or compromise in sound quality. Good buy for the money.",
        "Easy to hook up, wonderful sound. Great base, small foot print on my desk. I put the sub woofer on the floor under my desk. The sub woofer is rather large, but pumps out the bass. 12/19/2012 The input jack from this unit into my computer has malfunctioned. I have to toss the whole thing. It can not be fixed or repaired. Seems like a waste of a lot of metal, plastic and other components that will be put into a landfill once I remove it out of my basement.",
        "WOW, WHAT WONDERFUL SPEAKERS. I HIGHLY RECOMMEND THEM. THE HIGHS ARE SOMEWHAT LACKING...NOT AS CRISP AS BOSE. IF YOU LOVE A LOT OF BASS THESE ARE FOR YOU!!!! THE SUBWOOFER IS HUGE, VERY HEAVY!!! THESE SPEAKERS ARE WELL WORTH THE MONEY. THE SOUND FILLS UP THE ENTIRE HOUSE. MORE THAN ENOUGH VOLUME FOR A BEDROOM. CONCLUSION: GET THESE SPEAKERS, YOU WILL NOT BE DISAPPOINTED!!! JESUS LOVES YOU: ROMANS 5:6-8",
        "The upgrade was perfect however if they only had a treble adjuster that would be great. Many reviewers complained about the size of subwoofer and they are right cause the size is a little extreme. i still managed to accommodate considering the size of room and desk location. the Bass is awesome and the overal sound is clear. Amazon had the best price, however it took about 9 days to get them. Good thing it wasn't critical. I would recommend this set.",
        "Not as awesome as surround but this setup has great sound. Had a problem with the first one about 9 months in, the left channel went out. Logitech shipped me a brand new set after a brief phone call. Arrived in two days. Now I use one in the garage (one channel and one sub) And one for my pc.. Proud owner since 2008 Logitech all the way!",
        "This sound system is simply amazing. I purchased this after reading many reviews about it and decided to take a chance with it. Wow... It sounds great! Such bass and highs. The clarity is awesome. A bit pricey but worth it. I mean, how often do you purchase this sort of item anyway? I asked myself this and decided on spending the extra on this set and couldn't be happier. You get what you pay for folks. I would highly recommend this system.",
        "I love these speakers. I think they may be the best I've ever had. And I used to be an audiophile. I can especially appreciate them now that YouTube offers such good sound quality. The whole process was excellent--they arrived before I expected them, and the packaging was perfect. They were easy to unpack and set up. Very good. Great bass and treble notes. Great life and clarity. What music! I recommend them highly. A musician friend recommended them to me.",
        "These speakers work very well with my Apple Mac Pro system! The sound is rich and clear, with solid bass. Installation is a snap, and the sub fits under my desk on a shelf. I purchased these over their replacement due to the reviews that said the replacement systems weren't as great sounding, and I'm not disappointed. From classical to country, I love listening to these so much that I actually don't get as much work done at times due to my pausing to listen. Highly recommended!",
        "I could go on and on but I'm going to keep this short. These things have pumped out everything I could put through them. Great sound! Deep deep base. Great midrange and treble. If you purchase these to listen to your PC through or the music from your phone you will be SO very happy. I have yet to find anything about this sound system that I don't like. I'll likely buy another for another room in my home.",
        "Best I have ever owned really sound great and had an amazing kick loved these",
        "These speakers are amazing. I give a gave a 5 on everything except ease because everything was awesome except I had to go into my sound card options and turn off some things for the speakers to sound the best, but once I did the speakers sound amazing!! Control nob is nice and smooth and has a clicking power button. If you are looking for high quality build and sound for a low price this set of speakers is amazing. *Other thought* The bass was bigger than I thought it would be, but because it is bigger the bass quality is better. Priced around and amazon was the cheapest.",
        "Bought this as a gift for father in law. I've used it quite a bit now though and would buy it again for myself. Speakers can be turned all the way up and stay very clear at high levels. The bass can get a bit distorted if you leave it turned all the way up and turn the volume to the max but that can be expected with any subwoofer. Overall a very nice system. The corded remote controler is very nice. Built solid and has been played very loud for long periods of time for over a year now and still no problems.",
        "had this in my room for a while and it did everything I needed it too. Definitely on the bassier side of sounds but that's what I like. Can be easily adjusted to your tastes. If you got an EQ on your PC or media device control is even greater. Moved into a quieter neighborhood so nowadays I got this plugged into my cigarette lighter in my SUV and bump my MP3 player around town. Cords could be longer but it works for my purposes.",
        "I was in the market for a some additional speakers for my media players. This Logitech Z-2300 system was more than I expected. Others have reported that the satellite speakers are on the weak side, but all you have to do is add a EQ(MONKEY MEDIA,REALPLAYER) and problem solve. I now have crisp highs and more than enough bass. It's not high end equipment, but I think it's in close competition. I have yet to try it on my PS3. Purchase this product with confidence. You won't regret it.",
        "I absolutely love these speakers! I listen to every genre of music but these speakers crave Dave Mathews, Santana, Indian music and anything instrumental. Don't get me wrong, the subwoofer can handle hard rock but the satellite speakers are so crisp and clean that they almost seem to \"show off\" when tested with intricate Jazz or new age multi-layered instruments or vocals. (I now hear instruments that I didn't hear with my standard speakers). The system absolutely fills my (250 sq ft) bedroom. Absolutely no distortion at higher volumes. I highly recommend these speakers --the low price is the icing on the cake.",
        "I bought these based on a strong recommendation from CNET, and they were right. These speakers sound excellent and provide a great amount of bass from the large subwoofer. The remote is very helpful too. I got very lucky to get these for $90, but I would pay $200 for them if I had to buy them again. I guess word got out how good these are because as I right this they are selling for $350. If you're looking for great computer speakers, congratulations, you just found them (but recommend buying in the $200's).",
        "I bought these a few years ago. I thought my computer speakers were okay before this. Oh my gosh! Having a sub-woofer makes all the difference in the world (if you are listening to music)! I am a computer consultant (and musician), and when I work with a client that is into music, I recommend adding a good sub-woofer system. It makes all the difference in the sound.",
        "This system is quite amazing. I was pleasantly surprised when I turned it on the first time. The subwoofer and the speakers have such great frequency response. The little wired remote it comes with is very handy. It has volume and bass level controls on it so you don't have to fumble around with the controls on the computer. Overall, this product is great. If you're thinking about buying it, please do because you will not be disappointed.",
        "When I first hooked up these speakers to my Dell XP laptop, they didn't sound as wonderful as I thought they were going to. They were kind of flat with very little bass. I was disappointed. Just by accident, I stumbled upon a checkbox in the \"Volume Control -> Advanced\" settings screen called \"PC Spk Mute\". I checked this on and the speakers were reborn. The sound is incredible with wonderful bass. It was a huge difference. Everything sounds great. Why this has to be checked on, I have no idea. So, notebook users, if it's not sounding great, then try turning that switch on first.",
        "While the bass is plentiful and tight, the satellite speakers could use some improvement. The mid-range is pronounced and the highs are thin for my taste. Would have been nice if the satellites were not hard wired. The remote design worries me - if it goes bad, you're out of luck as everything is hardwired in-line. Overall not a terrible system for the money - the sub is the best feature,",
        "This has been a cnet.com editor's choice since 2004, and that speaks for itself. Of course, the proof of the pudding is in your home. I loved it. What I did not love was that two weeks after I bought it, amazon.com ran a special that knocked $25 off the already excellent price. Bummer! The system's sound is room-filling, can be chest thumping and is a world apart from the usual computer speakers one has come to expect.",
        "Dude this thing rocks i have had in the past pieced 2gether systems , but this thing is a beast in sheeps clothing man it thumps harder than it looks , my downer is that it tripled in price since march and ticks me off. the new version is cheaper because from what i can see it is not a deep throw sub. i payed 119 n march now it is 320 so much for buying ANOTHER RIGHT NOW. DONT KNOW IF IT IS WORTH 320 BUT U W0NT BE DISSAPOINTED !",
        "I bought these about 8 years ago and they still bump as hard as when I bought them. I sticker bombed it and it looks great.",
        "Speakers sounded amazing at first.. I was very pleased with the sound quality . . But after about 6 Months the left speaker started to sound funny. Then after 7 months the left speaker totally stopped working.. So after messing around and plugging the left speaker into the right speaker input i realized that the speaker sounds fine. . It is the input on the back of the subwoofer, not the speaker that is the root of the problem. It just totally stopped sending sound. total crap.",
        "This is my second set of these that i have purchased and completely satisifed! I don't need the extra surround speakers and these do the job better than most others. If you like to enjoy music or movies on your comuter these are great! I have one set for my desk top and the other set in my bed room for the lap top. I recommend these to anyone that wants to ditch the $30 set of speakers they might have or even for their first set of upgrades. Well worth the money and would buy a third set if i ever feel the need."
    ]
}