{
    "entity": "Computer Speakers",
    "text": [
        "I originally bought this to use for my tv, and it has not failed me thus far. However, since it was so good, it has been repossessed by my sister until I pay off a couple favors. Whether it be music on TV or movies on the computer (or vice-versa), these surround sound speakers will do the trick in a pinch. Next up, karaoke-compatability! Pros: -Loud+ deep bass. Excellent for my 20 x 40 entertainment room. -Works excellent in compatability with gaming or regular computers -Exceeds expectations when connected to TV (accessories may be required) Cons: -Wired, and a tad short at that. (Maybe it can be fixed with some accessories) -Limited control on sound besides volume and superbass.",
        "I've been using this system for over a month and love it. The quality is much better than my old Creative 4.1 set. I was mildly skeptical of this system before buying it, and almost put the extra money into the Z-5500 (a friend of mine has this system, another great Logitech product), but I'm glad I didn't, especially what I use it for; the occasional game/movie and music. Sounds great at both lower and higher volumes.",
        "Excellent system for those that don't want to spend much over $100. You probably shouldn't invest without also adding a sound card. I bought the speakers first and many games just don't have settings for on board audio that utilize all speakers. They sound great. I have no problems with too much bass or any issues. I have rear speakers mounted on stands and cords are plenty long enough. I just move them out of the way when not in use. The sound quality was awsome compared to my 2.1 Creative and 2.1 Logitech speakers.",
        "I had the older 5.1s from logitech, This one is MUCH better. Playing BF2 scares me now because explosions are loud accurate and shake my desk. Music sound much better with the sub this time around it is a sealed woffer design so it will sound better. Less distortion. They get really loud with movies and music with what seams like no end. Crank it to 11!!!!! HEHEHE Get it!!!",
        "I have been very pleased with these speakers. I use them both for gaming as well as listening to mp3s and they have yet to let me down. I have played these speakers at maximum volume numerous times and there is no distortion what-so-ever. Another feature that I like is that the headphone jack is on the remote control unit, which makes it very accessible to late night jamming when I don't want to wake the family. I have no complaints for these speakers at all - do yourself a favor and pick up a set, I promise you won't regret it or Amazon will refund your money if you do!",
        "Great sounds with lots of thumps on the bass. plays extreme well with dvds thats encoded DTS /THX . It also matches very well with 22\" or bigger screen. give it like mini theather feeling and sound. one small con about this items is no control on treble other than that . It has great sound if you like full bass.",
        "Purchased these speakers used but the quality level was still great! Use the audio ports on the motherboard and quality of sound produced is wonderful. No need for extra sound card because I'm only using it for home listening pleasure. Overall a great purchase and great price TOO!!!!",
        "My boyfriend, who I gave these speakers to for Christmas, says they work very nicely. To quote \"I didn't even hear that bassline before.\" It came quite quickly, in less time than I had anticipated. And it was as much, with shipping, as Best Buy was charging to get it from the store (only Best Buy was backordered, and Amazon was not). The shipping was quite a lot though.",
        "I just got rid of these speakers. I donated them to my friend when I moved from Texas to Alaska. They still worked as perfectly as they did they day I got them. Everything about these speakers was perfect. The sound carried well, and did not distort at high volume.",
        "For the price there are few PC speaker systems that can compare with Logitech's. I have had these for some 5 months now and haven't been disappointed once. The sound is great and they just flat out look nice. The corded volume control is nice but the red lights on the controller is a strange choice for color. The bass does sound good after some tweaking but for really nice bass you will need for fork over a little more $. For this price I recommend these speaker for anyone. They will meat your movie, music and gaming needs.",
        "I went from a 500w. amp. and 5.1 speaker system to these self powered Z-5300e's. The new speakers sound just as good as the stack of electronics I was using before. They're great. Get them while you can as they have been discontinued for wireless models.",
        "These speakers are great ! The sound is fantastic ! No Problems and it brings gaming to a new level. Guild Wars,Halo, and Company of Heroes sound great ! From the music side The Greatful Dead,ColdPlay,and the Kaiser Chiefs have never sounded this good!",
        "Great upgrade for the home office... good sound quality... no distortion or hiss. About those short speaker wires though... I needed another $50 worth of cables to get all of the speakers in the correct locations.",
        "I upgraded from an older Altec Lansing 4.1 speaker setup. These Logitech's have about 10x the power than what I had and they sound AWESOME!!! The matrix mode upmixes my non 5.1 PC games and really makes them sound better. The cords were not as short as some have said, but with my desk and room setup, they were just the right length. Every room will vary. I am VERY happy with these speakers. They really rock the house, and the wife complains more about loud games than before, so I know they are doing the job!!!!!!",
        "I actually use this speaker system for a Home Entertainment system in my computer room and have no complaints. With a couple adapters, you can hook almost any audio device to this system (it does not have an optical input). I do wish I had purchased the model with the wireless remote control. All in all, this system rivals the expensive system I have for my living room. Great product from a great company.",
        "OK so so many people are complaining about too much bass, and to them I say uh what? This system is great with or without a computer. I have mine hooked to my computer and the sound is amazing, I upgraded this from the logitech x-540 system. The bass is deeper clearer and you can feel it. The satellites give good mid and high range. My friend also purchased the system and uses it with a game system and they are happy with it as well, for the price difference Bose is not worth it.",
        "Used on my computer in my bedroom with Creative X-Fi Platinum sound card: the sound is better than my Kenwood home theatre in the living room, movies sound fantastic and I can hear the \"bad guys\" sneaking up on me clearly when I play Counter Strike or Unreal Tournament 2004. The bass is actually too loud and had to be turned down all the way on the wired remote AND turned down further with the settings of my sound card but...after that...I am nothing but thrilled with the sound. Highly highly recommended.",
        "Got these speakers a few weeks ago and I love em'. Been using them for music, tv, and video games. Amazinig sound from the satilites and the sub does its job. Right now I have it set up in a large carpeted room, so I can't wait to see how it will preform im my small, tiled, concrete wall dorm room. My only complaint would be that the back speaker cords are too short, but that should easily be fixed with a cheap RCA cord. Nice work Logitech and thanks for making affordable, high quality systems for us college kids.",
        "I have pushed the speakers to the limits and they were able to handle what I could throw at them. They are the perfect complement to your pc with a 5.1 or higher soundcard; they do not have their own decoder so if you want something that does true 5.1 for a console like xbox or PS2 you need to get the z-5500 but if your pc allready has a decoder these are more than adequete for a home office or den.",
        "Even though it seems a bit pricey, it's well worth it. You set this up, and it just blows you away. Great options, great sound, GREAT SPEAKERS! Don't forget to put the sub below the desk though. A must buy!!",
        "I love this unit. I made sure I did my research before buying this. I'm glad I did I read most of the reviews and was glad I purchased this. This is made best for gameplay, don't turn the vloume up it just might blow your head off.(its that loud) I saw that the price for this went up 2 weeks after i bought it. Originally 75.00 bucks used but for me it was worth it. So if your looking for something good at a reasonable price def. check out this item its worth it for sure.",
        "This system is WORTH EVERY CENT. the sound quality is simply awesome. i use it with my Laptop, which has a high def audio card. couple it up with the Logitech 5.1 to RCA converter and then a RCA to 3.5mm cable...and I was all set. TRUE 5.1 sound. The bass is EXTREMELY strong (just the way i like it) even when turned all the way down on the system. the wires for the front speakers are a little short and so is the remote cable, but nothing to lose sleep over. All in all, an awesome buy.",
        "These speakers are simply great. I can get them so loud that I can feel the bass pumping my heart for me, but they still do a great job at lower levels. With a good soundcard, you can watch DVD's in 5.1 surround sound without any hassles. And at this price, this makes them the best deal you'll ever find on PC surround sound systems.",
        "this thing is sweet and the bass drops really heavy when i'm playing bf2 i feel like the war is happening in my room!!!!!!!!!!! very good buy!!",
        "These speakers are godly... Blows my old speakers(TDK Tremor S60's) away. Pure crisp sound! The pictures does not do this system justice. It actually weighs 45 pounds and the sub is HUGE! Like previous reviewer says, setup is purely simple, all color coded. You cannot beat the Price/Performce plus free shipping(more like next day shipping, thanks UPS!) and rebate? Amazon's made an offer you can't refuse...",
        "This system is a great value for this price. I purchased mine years ago for about $200, and I would probably pay that again today for the quality it gives. I've hooked this thing up to both my pc and my dvd player for years now and haven't had any problems, except that the neighbors complain about the noise. Super powerful bass!",
        "Absolutely awesome speakers, the sound clarity is amazing for the price. Only issue I have with these speakers is that they have a little *too* much Bass.",
        "Cheap, good quality, and have lasted me for many years.",
        "Pros - Ease of installation Sound Quality Plenty of Base Corded Remote Controller Cost Cons - Corded Remote Controller You need a 5.1 capable sound card to enjoy the sound quality For the money this is a great system that produces a very clean sound.",
        "I'm enjoying these speakers, the cords are short for a medium - large room so I had to buy extensions at radio shack. I guess that means I payed more to use them in my medium size room (about 11' x 14'). The mid range is a little crushed but that would be nit-picking. They are a good value for the price.",
        "If you listen to music then you will need to purchase a decent sound card to work with this item, even then the music sounds muddy. But it still works fine. For games and movies it is an amazing system for the price. It is better on games than movies.",
        "i have not had a problem with these speakers. i bought them about 3 months ago. they are the best speakers i have ever bought. i play all genres of music through itunes and they work amazingly. the only downside is the length of wire. but i have worked around that to set them up in my office perefectly.",
        "These speakers provide great sound for mp3s, movies, or games. They blow my old 2.1 speakers out of the water. The remote control, which has a built-in earphone jack, is very convenient. These speakers more than meet my PC needs. The subwoofer is powerful, so you may need to turn it down a little.",
        "The Logitech Z-5300e 5.1 5-Piece Surround Sound System is amazing for the price... It pushes the bass hard... but that is never a problem for me. I especially liked the adapter for my Xbox, which allowed me to play with 5.1 Surrond sound :-)... When hooked up to my computer, I have enjoyed the clarity of sound produced. On occasion it is always nice to have the ability to vibrate the furniture in the room. Best buy sells the Logitech Z-5300e as one of there best computer speaker systems for almost double Amazon's price! I would buy it again. Amazon is the way to go! Good luck",
        "These speakers are great, everything I was looking for. I bought them as a surround sound system for X360 and it's easy to set up and makes Call of Duty sound awesome. Only problem is the short rear speaker cables, but nothing that can't be fixed with some extension cables.",
        "Had this for almost a decade and still going strong.",
        "Works great for the price. Bass is a tiny bit overpowering, and I had to dial it down to almost nothing when listening to music. Overall a good entry-level surround set for what you pay. If you need more inputs, go with the 5500.",
        "these speakers get LOUD! and sound GREAT! ordered on wednesday, here it is friday and i am listening to them. best buy wanted 200$ for the SAME THING. amazon > * only thing i would recommend getting in addition to these speakers is a 5.1 sound card ( on the way as i type ) and longer RCA cables for the rear speakers. other than that i would buy again!",
        "For the price these things rock, almost crystal clear sound at very high levels, and the bass is huge!! I set these up to play with guitar hero II and they rock! Not quite as good as the 5500 series but with 1/3 the cost, definitely worth it.",
        "had these speakers for a few months and i love them. They sound good all around and they come highly recommended.",
        "Even though this system is a bargain, a surround-sound system it is not. It is a 3-speaker system. That's because the far right and left speakers are so dominated by the booming bass as to render them to be nothing more than bystanders.",
        "I did some homework before I bought these speakers. First Amazon has the best price. My son already has these speakers and he gave them an excellent rating as well. I listened to them once and was sold. Great base and I love the ability to surround myself with sound, so the extra speakers accomplish that. Overall, I'm very happy with them.",
        "Had this set for almost 6 years now. It still works great and delivers loud, THX quality sound. Highly recommended for great audio at a reasonable price. Logitech has always made fairly good speakers in my opinion. They're not Bose, but they won't break the bank like Bose, and they're heads and tails above anything made nowadays by Creative Labs / Sound Blaster.",
        "Its very nice system, Has a nice base sound to it, Feels like ur bumping ur system as if it was a car system down a populated street with heads turning.",
        "I just installed them and they sound great. A big improvement over the simple stereo one that they replaced.",
        "Perfect sound! Love it, but if you plan to have a speaker in each corner of even your small office, hit the RadShack and buy extention cables.",
        "This are excelent speakers. However lack of a proper user manual or explaining how to plug them in more scenarios. Also before buying this Speaker System get a THX sound card or you'll not enjoy them properly",
        "Lot's of bass, but the speakers cut out or crackle every once in a while, especially when watching a movie, or listening to music. Rear speaker wires are way too short. Not bad for the money, but they could be better.",
        "Awsome sound for a good price that is valuable and you will keep them forever and ever without wasting another pennny.",
        "These speakers are a great addition to our computer. They produce great sounds for gaming. The price is right.",
        "We purchased this system less than two years ago. It has seen light to moderate use. Several days ago, the speakers started intermittently cutting out. This afternoon, the subwoofer popped several times--then caught fire! Fortunately, my son was able to extinguish the flames before much damage was done. Beware!!!!!",
        "Great product for the price. Really liked the external volume control. Bass is serious. Found it difficult to keep under control. RCA speaker cables were too short for me. Think I'm upgrading to the 5500's.",
        "This product is great. One of the best and best price I came across.",
        "The speakers are have good quality of sound for the price and the sub is amazing",
        "SHE LOVES THIS ITEM AND CAN'T BE WITHOUT IT, ALWAYS AT HER DESK",
        "These speakers never worked properly with my Audigy 2 ZS Platinum sound card. The sound quality was not that great either. Various speakers worked at various times but never all together. Before I boxed it up and shipped it back, the right front speaker hadn't worked in a week and a half. I ended up buying the Klipsch 2.1 pro media speakers that I had owned previously. They finally broke and I had used the Logitech Speakers to replace my old Klipsch 2.1s after reading all the positive reviews on Amazon. The Klipsch speakers blow the Logitech speakers away. 'Nuff said.",
        "Enjoy the speakers. My games sound cool!! My videos that I record sound great with the 5.1 sound when played back. Excellent choice for Multi-Media Center computers!!"
    ]
}