{
    "entity": "Computer Speakers",
    "text": [
        "Good USB travel speakers. Great convenience not requiring a separate power supply. I'm a professional trainer and these V20's set up fast and project sound in a large room for 30 people or more. Nice case which is required, protects speakers and easy to pack. Great to have after work for listening to music in the hotel room. They are not accurate transducers yet are satisfying enough especially for their size. Media controls on speaker are also convenient and work well. Markings / buttons could be slightly larger.",
        "This is a very portable, good sound quality, solid built and durable speaker. It lasted me 10 years before it broke. Unluckily, I can't find any more speakers that has the same quality, price and built anymore to replace it.",
        "I bought these speakers for use in teaching a dance class using digital files on my laptop. They replaced a little Altec Orbit, which was a nice little speaker, but just didn't have enough power. One space in which I teach is a multipurpose room in a church basement...big space with ceilings of about 20 feet. The Logitech speakers do a nice job of providing good quality sound and...the big consideration...have plenty of power. Love the fact that they can be adjusted to compensate for the sound output level of the recordings, which are by no means uniform. They are light and easily fit in the second compartment of my laptop case. I would by these again in a hearbeat.",
        "We needed some speakers for travel that were both compact and usable! We did our research and really preferred the look of these over other models. We were a little nervous (having not based our top 'must-have' as great sound) but we were completely satisfied. The V20 Notebook speakers performed really well with MP3 playback, movie watching and Talk Radio. Yeah, they don't have a nice deep bass or warmer middle but they get their power from the USB port! A massive improvement over the built-in notebook speakers and they look cute too. One downside is the lack of a AUX input. Other than that, we are very happy with the purchase. Oh, the travel/storage case is great too.",
        "We love the fact that they do not have to plug into the wall just to suck up more energy while not being used. The sound is better than the laptop speakers, but, as one should understand, not a replacement for a home stereo. They do, however, allow you to hear your streaming radio, music, or videos across the room, and still be able to hear it clearly. The flip-out stands in the back are great. They come with a decent zippered pouch for traveling and mobility. I highly recommend these speakers over any other speakers in this category. We have owned three laptop speakers like this, and these are by far the best.",
        "Excellent speakers for use with a laptop. The case makes them easy to transport, the controls on top work perfectly (and with Windows XP the current volume level shows on the screen as you make adjustments), and the sound quality is excellent. We use them at our church with a laptop to play DVDs, and while they don't blast to the back row (which is good, or the front row would be deaf), they make themselves heard well and get picked up by microphones with no loss of quality (as opposed to the laptop speakers, which sounded bad by themselves and worse when amplified). Better than similar portable speakers costing twice as much.",
        "I purchased these laptop speakers for a portable video editing system. I need speakers that reproduce audio fairly accurately and, for the size and the price, find these speakers to do a great job. They're small enough to be able to pack them into an oversized laptop case. I love the single USB connection, which frees up my headset jack for other needs. The only two drawbacks I find so far is because of their small size, you can't crank them without getting some distortion and lower frequencies aren't as great as if you had a subwoofer. But at normal sound levels, these speakers are really great!",
        "These speakers pack a nice punch for their size and price. I was using clunky speakers with wires all over the place. These speakers connect to my laptop with a USB cable; no power cord, no transformer, just two speakers connected to each other and then to the laptop. The sound quality is pretty good and they meet my needs. Caution: the speakers can only be spaced about 3 feet apart because that's the length of the cable between them. And the USB cable is only about 18\" long. Keep these parameters in mind if you are considering them.",
        "These offer nice sound, but I've found that for some streaming video the sound is not adequate and your abilty to crank up the volume is limited. Also, it appears that sometimes one can not use them in a plug-and-play manner, having to have them connected to a port with the initial boot-up rather than after the computer has already started. The carrying case is not, but they're not actually my idea of easily portable. I have a high opinion of the Logitech products I've purchase, and overall I like these speakers, and use them with a Dell notebook with satisfaction.",
        "I needed some small speakers for my laptop so I could get streaming audio in my project trailer. These little guys fit the bill perfectly. I am very impressed that so much sound can come out of such a small enclosure. One reviewer noted that these speakers are \"walkers\" and that's true. The bass response is powerful enough to make them move around my desktop. But I wedged them and easily overcame the problem. This product came in a very nice case and is very well made. Overall, I am very satisfied especially for their modest price.",
        "Quite happy with these speakers sound quality is very good and good design.",
        "[...]. The speakers are great! My Dell 710M laptop with XP/PRO recognized the speakers without a hitch. I have listened to all flavors of music...punk, reggae, classical, and rock. The speakers produce good sound quality. The audio control buttons on the right speaker are a nice touch, and the blue LED power light is really not that annoying. My speakers came with rubber feet, and rubber covers on the fold out stands. This prevents the speaker bouncing other reviewers have experienced. Buy them!",
        "These speakers are a great value for the price. Don't expect \"boomin\" volume but I was surprised by the bass and midrange \"kick\" these little puppies have. It sounds like these guys come with some sort of invisible subwoofer! Bonus points for: sturdy/functional carrying case, no power cord required (runs via USB cable) and solid feel of speakers themselves. I've become an Itunes junkie recetnly and your songs will sound completely differnt/better through these vs. your stock laptop speakers! Give them a shot.",
        "Yikes I wished I had known about the problem USB audio device has with Vista prior to picking these up (as detailed by another reviewer). I too am having problem with Vista except I actually got sound to work for a split second on a Sony laptop with Vista SP1 but then nada. The so called hotfix that I found online from microsoft won't install and says it's not for my system. I also tried getting these to work on my Vista SP1 Dell XPS and that's a no go. Perhaps this is the reason logitech and amazon had the $[...] MIR. Factoring the rebate, I now have an $[...] paper weight :(",
        "I bought these for my girlfriend's Toshiba laptop. We often watch movies in the living room, where electrical outlets are at a premium in her small apartment. With these USB-powered speakers, it's as simple as opening the sturdy case (included, which is nice) and plugging them in. Other reviews mention the power of these speakers, and it's true -- just turning them to half volume results in loud, clear, non-distorted sound, perfect for watching movies or working on the computer in a small space.",
        "Excellent sound quality. I'm no audiophile but it works well for me. I don't care for the button-based volume control, I prefer a knob as it's more sure. Also the extra features such as \"play\", etc. to control devices seems silly to me. Not all devices are supported and it's not clear when you buy it which might work. However, the speakers are exactly what I wanted.",
        "Love these speakers. A software clash prevents normal speaker/headphone operation on my wife's laptop so she has had to resort to listening to everything on USB headphones. I bought these USB speakers for her and they have proved to be awesome. Excellent tone. I love the on speaker controls. I do wish that the cable was slightly longer though...",
        "At first I was a bit loath to spend a lot of money on speakers for my laptop, but these speakers are totally worth every penny! First off, the speakers are small and you get a small packing case to put them in when you travel or whatever. But despite their size, they really kick out the sound, the sound quality was really impressive. The bass started making the speakers rattle around a little, so I have something to weight them down, but they're great for rocking some tunes or watching a movie!! A great buy in my opinion!",
        "Yes they are compact, and they have a nice case, but they are certainly not as loud as I had hoped. I had a pair of dell computer speakers worth $10.00 that sound much better than these. But maybe that's the price you pay for having the convenience of all connections going through the USB cable. The build in kick stands don't stand locked, so the speakers aren't completely stable if you move your computer with the cable attached. I found they fell over a lot.",
        "Purchased these speakers to take with my projector to use with powerpoint presentation to several different groups. The speakers were great. They produced enough volume so that all of the people in the large room could hear the video clips. They were extremely easy to use - just plug into a USB port. You need to make sure that the cord is plugged all of the way in and be sure to adjust the volume on your laptop as well. They are so compact and easy to carry in their case. I can put the case in my purse and have my hands free to carry all of the other things I need.",
        "i'm very pleased with my V20 speakers. no, this compact set does not contain a woofer for powerful sound, but if you are just looking for some nice clear sound from your laptop, these are great. i like to listen to \"xm radio\" when i am online, or even when i'm cooking in the kitchen. these speakers are sufficient to produce a rich enough sound for me. very easy to hook-up...a no brainer for the price...especially with a rebate or promotional discount. go for it!!!",
        "Bought this product couple of months back and still satisfied with the V20. It has huge bass effect and sound controls on top for a quick pause. No issues. Also got a good looking case. Sounds are nothing less than perfect, for the price. Pros: Compact, huge Bass, Storage Case, external controls, no additional power cable needed, sounds PERFECT for price, No issues so far. Cons: Full sound, which I use rarely, will move the speakers across the table. USB based, so needs to go with a system only. Cannot use it with other sound systems.",
        "These speakers sound very good for their size. The physical design is superb. They are compact and come with a great hardshell carrying case that's a little smaller than a typical text book. They sound very good up to about 80% power. After that, they start to distort a little. These are perfect to use when ambient noise is not too loud and you want to power your sound via your computer's USB port.",
        "Let's face it - integral laptop speakers are just not made for music. These speakers have really good sound for their size. They are well-made, easy to set up (plug in to a USB port and you're done!), and have a very nice storage case. Occasionally they act up, but I've found if I just unplug and re-plug them in, Vista reinstalls the drivers and everything is fine. Overall I'm very pleased.",
        "These USB-powered speakers showed up right away on my MacBook. They sound great, but the stand design makes them move around the desk when played loud. I compared these with the V10 notebook speakers, and decided that to keep the V10 speakers, because they are easier to travel with. If you plan to stay in one place, and don't mind moving these back or taping them down, these are nice speakers.",
        "These speakers work great. Bought them to use a sound source for watching netflix movies. We could not hear the soundtrack very well on the computers internal speakers but with these little babies, No Problem! Comes with a nifty carrying case, only needs one cord (usb) to plug directly into the laptop. No power cord. Volume controls on the top of one of the speakers. I couldn't be happier. Recommend to anyone who wants to improve sound quality without a lot of hassle.",
        "Pretty much what I expected from inexpensive desktop speakers. I purchased them because they are USB powered, so there's no unsightly power adapter and AC wire. Surprisingly, unlike noted by earlier reviews, the touch buttons on the speaker work fine on my Mac Pro, using OS 10.58. Sound quality is good for playing internet radio and ITunes while I work. Obviously not high quality, but still pretty enjoyable. All in all I'm very satisfied with this purchase.",
        "I purchased this product to use with my laptop computer. The product ordering, payment, shipping and receipt went as planned. The product itself was better than I had expected. The carrying case is stylish and stores the connecting cables and speakers safely for storing on the shelf or when traveling on the road. The volumne and sound qualify is good for a small set of speakers. Setup is easy.",
        "The speakers seem to work well. It is convenient to plug into the USB only. The speakers are too big for traveling. I really thought these were a little smaller, similar to the ones I have seen at the local computer store. I probably should have looked at the size a little closer before purchasing. All in all, it is a pretty good purchase for approximately $[...] after rebate.",
        "These speakers are amazing for their small size! The sound quality is great! A huge improvement over the laptop speakers alone, with a much more full, deep sound than expected. Very easy to use, just plug into USB port, no other plugs/power necessary. The latest version of these speakers had no compatibility problems with Vista. Nice little carrying case. Highly recommend!",
        "I'm very happy with these speakers! My laptop audio jack was shot so decided to go with USB. Very good sound and can easily take them on the road along with the laptop. Small but powerful and good sound. Have to be careful not to play my nusic too loud in the motel room and disturb the neighbors. Great little semi-hard case to protect them traveling. easy to use - they were truly plug and play with XP.",
        "These speakers are fine for general purpose only since most laptop speakers are too low to for you to hear from a distance, i mainly use these to listen to talk radio online so i don't need too much features. The nice thing is that the speakers are usb and don't require too much power. However, if you need speakers to listen to music that is heavy in bass, this is not for you, since the speakers tend to physically 'skip around' from the vibrations of heavy bass. So if you don't want your speakers to fall off the desk and you like classical, then these are for you.",
        "i got these maybe 7-10 years ago, but i have em until this day! the USB powered thing is super cool but getting distortion after going beyond 70-75% of the volume kind of sucks. i'll get some more volume and dimension to the sound compared to my laptop, but not that much more. they do the job for now, but if i were in the market for something like this again, i'm sure there are better options.",
        "After trying this set out, I decided to return it and get the older but larger set of Logitech speakers that had the adjustble speaker volume controls. I just felt I wanted the bigger and louder sound output. These speakers are OK as portable speakers, but i returned them to get the larger speakers.",
        "These speakers are an excellent value for the money. Installation couldn't be easier. With a simple connection to a USB port, you'll be listening to superior audio in seconds. These speakers are light and come with a carrying case that fits easily into your laptop bag. I highly recommend this set to anyone looking for external laptop speakers for less than $60.",
        "These speaker sound really nice. They have an issue when using XP and Vista. They prefer to be the only device in a USB port or they sound bad. So if you have a USB mouse or similar it will affect sound quality. Apparently there is a Microsoft fix for this so don't let that put you off. The speakers in their case are as large as my netbook, a tad bigger than I expected, but the sound quality makes up for all the cons.",
        "These speakers have very good sound, but set-up instructions were unclear. They said to just hook them up, but I had to experiment to get them to work; I hooked them up with my laptop off, then turned it on, and that worked. The carrying case is solid, but these are comparatively large speakers compared with others on the market. The controls on the top of the speaker are quite small and close together, so it's hard to operate them (when they're hooked up, they go on automatically when the laptop is turned on). Otherwise, a very good product.",
        "These speakers produce good sound for the money. My only gripe, and it's a small one, is that they're a little awkward to position. The arm that comes out of the back and the speakers themselves are rounded so the base is not a solid as it could be and since the cord is kind of stiff, the \"move\" if you don't give them enough slack.",
        "Excellent sound! The size is convient and easy to carry along and the case is nice. I use it with Windows Media Player. Some times I have to click on a song more than once to get the sound. If a song is playing already and I plug in the speakers, they do not play until I click on another song. It is not a major thing but it does seem odd.",
        "Considering these are USB-powered and portable, the Logitech V20 are great buys. Treble and bass are clear. As others have mentioned, the bass maybe distorted if you crank it up too much. Other than that, I would rate the sound better than many Dell desktop speakers. I highly recommend these speakers for your laptops!",
        "I connected these speakers to my HP laptop (with Vista) very easily. Seemed to work fine. Then I tried a different USB port. No sound. Went back to previous port. No sound. An afternoon spent checking for drivers and connections, diddling with Control Panel settings, etc., did no good. I am returning them. Perhaps they were defective, but I'm not going to try the same product again and go through this hassle.",
        "After seven years of use in our home office (we run our company from home - light to medium businesses use) they are still going strong.",
        "The speakers provide very clear and ear-pleasing sound, with the controls on the right speaker serving as a virtual remote control for windows Media Player. I knocked off one star for the very short cord between the notebook and speaker. I suppose I could use a USB extension. I originally bought them so I could hear the GPS voice more clearly in the car. They certainly accomplish that! But they are equally effective at reproducing music. (My music collection of 300+ CD's is on my notebook.) I've congratulated myself for buying them.",
        "great little speakers... been using this type for years on all of our computers.",
        "Yes, the hook-up to the computer could not be simpler. The sound is very good for a purely USB-driven speakers, and plenty loud for my office. The traveling case is cute and easily fits into the laptop case. The only draw-backs are that the short cords allow only for a maximum separation of three feet between the speakers, and the volume controls are knobby push buttons that are not very easily controlled. I would much prefer a dial. Aside from these quibbles, its a good pair.",
        "I have had the speakers for a few weeks now and they are wonderful. The only thing I would caution people about is that when pressing the buttons to adjust volume, balance or 'mute' there is no -click- audibly and there is no noticeable 'give' to indicate that the button has been adequately pressed.",
        "I bought these to use at work to play music and they were absolutely perfect! I love the nice case they come with for travel. Good sound and easy to hook up!",
        "These have great sound quality for my laptop, but it depends on the media quality you are listening to. I find on Youtube some of the videos have bad audio which makes the speakers crackle when loud. If I get a good Gaga video on Vevo, well these speakers rock. FYI I don't think there is a laptop out there with good speakers, have been searching for awhile. If any of you know of a good laptop with awesome speakers for under a grand, well let me know! I am happy with these puppies for now.",
        "very good sound for the money. small, neat and well packaged with the included carrying case. excellent for laptop. wires are somewhat cumbersome since connections may or may not be on opposite side, depending on your computer.. but overall, i'm well satisfied",
        "Good sound for speech and movies ,however music is tinny sounding . Not adjustable there is no woofer for the bass .Easy install plug and play. expensive for the type of speaker though . sound level is hard to adjust because the buttons are so small . I would buy again because there is nothing on the market with the usb style of installation .laptops hhave very poor sound so we are forced to buy a louder sound system in order to hear anything clearly .",
        "Bought these years ago, and they are still working very well today. I like that they came with a carrying case, is completely USB powered, very powerful, and stylish.",
        "I have purchased 2 sets of these for sales staff that are on the road all the time. They love that the speakers produce sound clear and loud enough for a good sized presentation and are still small and light enough to carry in the same bag as their projector.",
        "One of the best computer speakers out there for the money good range durable and highly portable. my first set of these speakers finally had a wire break after 6 years and only because they were used and abused so much. We never even thought of looking for different set, we just looked for them again. the metal construction makes it a winner..",
        "I've had these speakers before but my puppy ripped the USB part from the speaker. I was livid that she did that so I was hoping this model was still being sold. After looking around I found them and the speakers I got are in better condition then described! I love these speakers and I will be putting them higher up out of my puppy's reach! Great product, highly recommend this product to everyone.",
        "I've been around sound equipment my whole adult life, have an above average feel for it. First time out, these speakers worked fine. Second try, they were completely blown. Scratchy, garbled, etc. These are useless, don't waste your money.",
        "Very nicely crafted speakers. Speakers are light, but material feels and looks very sturdy. Produces very good high to low range sounds for such a compact size and being powered solely by the laptop USB drive. No installation needed, laptop will automatically recognize speakers. Easy to use controls, and comes with a very nice molded foam/nylon carrying case. Only one minor setback is a USB cord could be a little longer depending on the setup you are using, though this does not subtract from its ratings.",
        "The logitech V20 speakers for notebook computers do the job well. Great tone, volume, size convenience and design. We use them for small meetings in our conference room, and also while at my desk just for music.",
        "I have a Vista x64 laptop. Although the design and features and even sound quality are good, the sound would abruptly stop after a few minutes of use. Unplugging and replugging into same or another USB port wouldn't work, neither would rebooting. Leaving the speakers unplugged overnight seemed to solve the problem, but the problem would recur within a few minutes of use the next day. After 2-3 days of this the speakers were returned.",
        "I wasn't happy with my Sony Vaio's internal speakers and was looking for small notebook speakers. These fit the bill perfectly. Easy to setup. Controls are simple to use. I'm not a sound guru but I think these will work fine for most people.",
        "These speakers sound great and the small footprint is very important. My daughter took them college and you can imagine how small their area is. I bought my wife a set and after hearing them we bought a set for our daughter. Great Buy.",
        "I bought these for use with my Dell Studio 17 laptop and they are great - good sound and plenty of volume. No problem installing on Vista 32-bit Home Premium edition, either. I am extremely happy with these.",
        "I like the sound of the speakers, but they vibrate all over the place. Need to find a rubber mat to put under the speakers to settle them down. The search begins! I found simple cloth pads do the trick.",
        "I did a lot of research out here prior to ordering these speakers and most everyone had a favorable review. I purchased them in May with no problems and they worked great with my Dell laptop. In late July they quit producing sound...it appears they are working on my control panel but no sound comes from the speakers anymore and the mute button is not on. Unfortunately I am past my month return date so I am stuck with $50 speakers that don't work anymore.",
        "Robust carry case, fantastic sound & easy to connect. As a flight attendant, these are without doubt, the best compact USB speakers I've come across & at a rediculous price. Outstanding value & a quality product!",
        "I was pleasantly surprised with the Logitech speakers. The size and appearance are just what I needed. The sound is great and they take up very little desk space. I am very happy with this purchase.",
        "Bought these in 2008 and they still work great after a a few replacement computer s",
        "These speakers work well with my new Lenovo laptop (with Vista) whose internal speakers are of no use. Logitech speakers provide good sound and sufficient volume. I cannot make them work on my another laptop,HP zd8000 (with XP-Pro). They are recognized and installed by Windows, but give no sound. Oh, well, HP zd8000 has Harman Kardon stereo speakers built in, which are pretty usable.",
        "This pair of speakers bring you a great quality of sound. Their controls are very easy to access and they're very exact in performance. Simply plug in and sound comes off the speakers !!!",
        "I like them but they do tend to dance at high frequencies, and they can't handle really high volume. Good sound though, and I agree with everyone else, for the price, you can't beat it.",
        "I was very pleased with the sound range and quality of the Logitech V20 Speakers. They are very well made and function perfectly, giving surprisingly high quality performance for a USB-type speaker set up. A perfect escape from the ridiculous built-in speaker that comes with most laptops.They're compact, sharp-looking and easy to connect.",
        "Well, they are really nice looking speakers except they don't work with Vista. Like many others, they worked great for 15-20 minutes, then stopped working. I tried everything - then I went and plugged them in an XP machine and they don't work there either. It is not worth the shipping to send them back otherwise I would! Avoid.",
        "These logitech speakers are portable and create fair sound. It's to be expected of a device that runs off of USB power.",
        "These little speakers are great! They have great sound and come in an awesome little case. I was really impressed and they were much cheaper on Amazon than any store I looked at.",
        "I needed a set of portable speakers to reinforce the playback of video clips at my corporate presentation-training sessions. This compact set provides quality fidelity for conference-room settings. And its zip-up carrying case lets me pack the speakers into my carry-on bag without any fuss.",
        "The price it sells for is a bargain and the products works great. i would recommend this product. I would rate it 5 stars!",
        "I got the idea of how these speakers work when I heard it from a friend's laptop. I was so amazed about the sound it produces and it's really great to use when listening to music and watching movies. :) I will definitely recommend this product. :)",
        "These speakers work very well, they are not a hi-fi piece, but they are practical when you need a better sound of your notebook.",
        "Small, easy to use. I had an initial problem getting them to work ... not the fault of the speakers, but my lack of knowledge. I contacted the company and they responded immediately with the solution. I've used them enough that I am very satisfied with the sound and the ease of operation.",
        "I like these speakers. I put on Pandoa radio with my Tomita station to give them a good testing. They passed with flying colors, except the bass end is a little tight. They would be excellent with a sub-woofer. Later I learned to ajust the tone on this speakers through the mixer, I boosted the bass and the result is very good. The bass is richer than before. No need for a sub-woofer now. I highly recommend these speakers.",
        "Outstanding product - Quality sound and it's own built in sound card. Connected these speakers to my 17\" laptop to watch a DVD and the sound will blow you away. GAC",
        "The speakers are easy to setup, but I had hoped they would be a bit louder than they are. Great for close, personal use... but if you want to \"crank it up\", you might want to look elsewhere.",
        "These are some awesome speakers. I have no comment on the Vista thing as I use XP... and furthermore for the record: XP >>>>>>>>>>>>>>>>>>>>>> Vista. Vista sucks, quit using it. But I've had these for almost 3 years now with my Dell Inspiron E1505, and they've been awesome. I love that they're so portable! Good quality sound, I play music and watch videos and do a little gaming on my computer and these things just rock. Proud owner a several Logitech products!",
        "Perfect speakers to take along in your briefcase. Great sound and nice carrying case. USB eliminates the power supply \"brick\". Also, works with my Mac Powerbook!",
        "I bought these for my 19 year old daughter. She was very skeptical because of their size. After only 1 or 2 songs she was won over. She couldn't wait to show others how great they sound.",
        "From the apparence to the look, and the price, you couldn't find a better deal!!! And it even comes in with a little cute case! I liked it the first fight I see it, and I love it even more now!!!!!",
        "Overall a good speaker, but for the $[...] I can't tell. (I got a $[...]) rebate. Good speakers as long as you keep the volume under 70-75% of its capability after that the sounds is DISTORTED. Anyone looking for really high decibel stuff keep away.",
        "OK - they don't sound like your home theater system, but they are a great solution when on the road. Pretty large sound, easy to use, nice case included.",
        "Logitech never fails to impress! I had never though USB powered speakers would sound so rich and vibrant. When using them I suggest you use a wooden surface if possible, as the speakers will resonate well, and due to a smart design the surface will serve to enhance their sound. VERY well worth the purchase, especially if the rebate is still in effect!",
        "Usually these speakers have good sound quality.It's possible to get a bad set sometimes.The second time I did get some defected ones but the seller was kind and just getting started in her new business.So I'm merciful because she's providing good service and a no hassle return.I will buy from them again.These came from FORT WORTH ANTIQUES BOOKS AND MORE.",
        "The speakers set up quickly and work great. I didn't have very good sound on my computer, so this helps a lot. They came with a nice case as well",
        "The Logitech V20 speakers do an excellent job for their size. There are easy to install and very portable. Sound quality is quite good.",
        "These speakers are just what we wanted. They really serve our purpose.Our lap top is always opened on the desk. We don't travel with it.",
        "Bought these for my daughter when she was leaving for college. I finally got to hear them and was truly imprest. Even the case they come in is well constructed for traveling to and from college. Now I want a pair for myself!!",
        "If you're looking for notebook speakers or small desktop speaker these are a great value. The sound is amazing for such a little speaker and a great value for the price. I would recommend these.",
        "The Logitech V20 speakers are a good set of mobile spakers for a laptop. You may want something more elaborate for a desktop, but for a laptop they're great. Came with a sturdy carry case that fits nicely in my backpack. Another plus is they are powered through the USB port so there is no extra power supply to fuss with.",
        "Pros: Great sound. Easy to use. Convenient case. Cons: You have to plug it in a few times before the computer recognizes it.",
        "This is a very good option for portable speakers, easy to install, great sound and powerful enough for a 50 people room. I try others but really find this very appropriate.",
        "I was searching for something which is small enough and also does not need separate power cable and this is the perfect choice for that. It became very difficult for me with the speakers on my laptop to listen to all those beautiful videos on the net. Sound quality is good, it is just plug and play. Definitely Recommend.",
        "Had to send them back to logitech. half the time windows did not recognize the device, does not work with itunes (even the latest version), and the volume and mute controls never worked. Too bad because the sound and portability are great.",
        "Great sound from these speakers....just a little unstable with the stand, otherwise I'm very satisfied with them.....The bass end is very good also."
    ]
}