{
    "entity": "Computer Speakers",
    "text": [
        "Z5500's are the greatest speakers ever! I bought a new 7.1 config lately, and feel empty; I have a theater in the bottom of the barn, and originally it was z5500's and they got replaced by this new Onkyo, which sounds OK, but the 5500s are legendary for a reason! They will rock your socks off! I'm sad that Logitech is going smaller, but that is where the market is at, but when I get some scratch together I'm gonna buy me some 5500s again! They are legendary for a reason! Whoever designed these guys was a monster genius!!! lol, seriously...",
        "I remember when I buy these speakers in the 2010, now is 2020 and still rocks. These speakers survive to the Mayans 2012, earthquakes, wildfires, tsunamis, racism events, zombies apocalypses, Thanos snap and now Covid 19.",
        "As this has become my bedroom's main sound system instead of being on my computer, I was looking for another 2.1 logitech to replace it, when Amazon notified me that it was two days shy of being ten years ago that I purchased this system. I cannot say enough about how fantastic this system has been for me. A decade of booming base, great surround and lovely tonal quality. If you find one used, buy it, I'm going to have mine till the day it dies ( a sad day indeed).",
        "Hi. I've been having this Logitech since they came out, about 5 years now, and in my personal opinion, they are the best speakers you can buy!! Great sound, just as clear and powerful as the first day. So proud of my bought, never planing of change them or upgrade as there's nothing better than this. 1000% recommend.",
        "This system has seen a ton of use and it still works great",
        "Update: I bought this in December of 2007. I still have it and it's still awesome. As someone else wrote, this thing is a legend. I'm so glad I got it when I did. I've read in the past that the newer model is nowhere near as good as this one was/is.",
        "For a computer, this system is pretty crazy. I've had mine for close to 10 years now and it still rocks. I have it in a 12x12 ft bedroom with a computer and monitor it packs plenty of power for that room. Beware of the Pricing though. This is a $400 system. Don't be fooled by some of the sellers marking it up to $1600+. The Z906 appears to be the Z5500 successor, so if you're looking at something similar to this one, I'd look at that.",
        "THX certified. This is (was) a difficult cert to get, and when you hear these you know why. Excellent sound for the size. Fantastic",
        "I bought these speakers 13 years ago and they are still going strong. I've had them in 3 different houses and they are still my current sound system for my entertainment center. Daily use for 13+ years. I'd say that's an easy 5 stars.",
        "12 years later, one of the best speaker purchases I've ever made. Incredible sound for a set of computer speakers. Absolute hall-of-fame 5.1 system.",
        "My current sub/amp was bought used as I had a habit of hooking larger speakers up as satellites. Blew one up. Put a fan in the next and fried it too. But boy was it loud for a time. Now on my third sub/amp using the front and middle channel Logitech speakers and PolkAudio bookshelves for the rear (and better mid-range.) Have a USB fan behind the amp fins at all times. Not as loud as some of my prior incarnations, but still crazy loud, and crisp and clean. Use an old HT Omega sound card, of the same vintage, and that helps immensely, but hard to configure for Win10. Best computer speakers for under 700$ ever made.",
        "I decided to go back and rate some of the products I really got good use out of and this is one of them. Bought in 2008. I'm not an audiophile but the quality seems great and everything is working after pretty much daily use for 9 years.",
        "I have literally been using these speakers for about 10 years.. and the quality is just great for my small room (They easily have PLENTY of power left for bigger rooms too!). These speakers are immensely popular and for good reason. The sound quality in movies and games are just epic. I don't know if I would ever switch up to a different set. The size of these and the sounds they produce are perfect. You're essentially saving all kinds of space, and getting theater sound, out of these tiny bad boys. You won't believe your ears!! They pack a mighty punch. LOGITECH. Thank You for making these.",
        "Love these speakers and I purchased them here in 2004! I've been using the optical cable for everything, tv, blueray, video games, apple tv, chromecast ultra, etc. They haven't given me any trouble.",
        "The best purchase I have every made in my whole life! And i'm writing this review after 8 years of having bought these speakers. It makes so much difference to be listening music, movies, skype with a surround sound. No problems at all. I change my room constantly, I unplug everything and re plug them and they are still the same as they were the first day I bought it.",
        "Amazing speakers for the price! Probably the best you can get anywhere near this price point. I'm only docking them one star because they are an utter PAIN to wall mount. If you take the feet off the speakers to install a wall mount there's a tiny bolt inside that isn't actually secured in place and falls out inside the speaker, so you need to completely disassemble the speaker to attach any other kind of mount. Not a huge deal, just frustrating.",
        "Still have it, 10 years later, and works like a charm. The only issue is the light on the control panel has started to go dim, but everything else from craftsmanship to sound quality is A+. Wouldn't sell it for the world",
        "I paid $210 USD for this set over a decade ago, and they're still going, with no plans for swapping them out in the near or even distant future. If Logitech were smart, they would re-release these and keep them around, because they're undoubtedly their best speaker set ever offered. A used Z-5500 set is going to rival any other solution.",
        "For the system it is the speakers and base are clear and loud. Speaker material gives a weighty heft that implies a level of quality not see in this category of speakers. Only negative is the wall mounts. They're plastic, attached to the speakers and overall a bit wonky. Not something that instills confidence when attaching them to the walls. Removing them looks to be such a pain that the option to do so really is not an option. I can't really subtract a star for the mounts though, since the price was impressive for a remote controlled 5.1 system.",
        "First of all I have to say this speaker system sounds great. I have them hooked up to my Dell PC and I'm perfectly satisfied with the way they sound and I love the subwoofer. But for some reason the designers decided that the mounts for the satellite speakers only rotate around in one direction, which makes mounting them not only particularly difficult, but it limits where they can be placed if you want them aimed in a specific location. I finally found mounting locations that accommodated this flaw, but this placement was not optimal. Therefore, I deducted one star. Otherwise, I'm very happy with the sound quality and they look good in my office too.",
        "This speaker system is great. You'll think you're actually shooting a gun or breaking glass or running through a jungle. They're great.",
        "After reviewing different sets of speakers, this one is the best! Don't even think on spending more for similar systems with a fancy brand. Logitech is by far better in sound, design and quality, comparable to Bose, Kiplisch, Altec etc....but for many dollars less! I've been enjoying the true sound and quality of dozens of dvds, xbox games and my IPOD, resulting in clear and loud sound, with great bass power and excellent sound quality, zero distortion! Great option for your computer, home theater or videogames, by far the best option available, even better than the early Logitech's Z680 which by the way were incredible. This set of speakers rules!",
        "I bought this speaker from amazon asking myself. Wow! let me check how long it has been. December 2006. Is still in use up till this very minute. This speaker is one of the best of the best. I recommended it to you to buy this speaker. I will buy it again if anything would have happen to the one I have. That's for FACT. Excellent Speaker....Excellent Speak. Thumbs up to the engineer.",
        "I've had these speakers since 2006 and it has been one of my best purchases since. I've never had any hiccups with my stereo, even after constant traveling back and forth from college. They sound awesome and they can go really loud too... and god do I love the sub. By no means will this replace the higher end home theaters, but there is no better speaker set for the price. I use my set mostly for gaming, from the laptop to play music and movies, and basic cable. I feel it shines most when I'm playing games, but it's good in all settings. Definitely a good investment since the price hasn't changed much since I've bought it.",
        "I originally purchased the Z-5500 for gaming on my new computer. While it's great for games, lately I've found myself sitting at the desk just to listen to music, even though I own a great stereo and a home theater unit. The sound reproduction is fantastic! The controls give you many different options. The small speakers produce BIG sound. I've read that other reviewers think the sub-woofer produces too much base, but I've got it configured just the way I like it with my sound blaster X-fi. I would highly recommend this system, although the sub is HUGE, so make sure you've got plenty of space for it.",
        "I've had this system for about a month and i could not be happier with it. The sound is incredibly clear and ear bleeding powerful. It destroys the compitition in its price range and higher. High quality satalites with port holes on each of them. The sub is abusively loud. Punchy not muddy. Nice input options as well. Controller is nice to have. Games and movies sound outstanding. Great individual speaker control. Music sounds crisp, punchy and dynamic with virtually NO distortion at max volume (which will hurt you). I love this system!!! A+ from me with no complaints at all. BUY THIS NOW!!!",
        "bought these from Amazon in March 2006. 5 years ago. They're still going strong. They're my primary home theater speakers. I use them with a digital projector, and the true dolby surround sound coupled with a 10 foot screen, it truly is a \"home theater\" experience. The DTS and dolby digital decoding work flawlessly. I run an optical cable from the DVD player. I'd say overall use is about about 50/50, music and movies. Works great for both. Maybe a little heavy on the bass for normal music listening. But easily turned down with the remote. Really good sound at a really good price. tremendous value.",
        "I've owned this sound system for a few months now and am thoroughly satisfied with it. The sound is clean (distortion free), especially in the lower frequencies. The massive subwoofer produces just the right amount of deep bass sounds without being overwhelming, much less causing distortion. I listen to classical music and Barbershop harmony, occasionally \"Big Band\" music. The Logitech Z-5500 handles all ranges very well. The separate sound control unit is a bit cumbersome and takes up space; however, the remote control which comes with it. compensates for the slight inconvenience. The system sounds great, I recommend it and the price is not bad at all. William Staubach Rotonda West, FL",
        "love the sound that flow out of them and they can kick",
        "This is the best sound system I have ever heard. It beats my Z 680 which I accidently destroyed by a water spill. The woofer is much larger. When I saw a lot of plastic where there was metal I was concerned that the sound would not be as good. But it is better. I would recommend this to anyone looking for the type of surround sound found in the theaters. During games it will shake your seat bottom and the floor and maybe even the neighbors floor if they live too close.",
        "These are solid speakers. I got them at a nice price after discounts and rebates. Pretty happy about it. They work well and I have them hooked up as a budget home theater set. Granted, they're not the best quality, etc. But they get the job done. I'm not the biggest audiophile either. I found speaker stands (SSR43) that work perfectly with the satellites if you want stands for this set. It takes some manual intervention [...] and also ends up voiding warranty I think, so take your chances. My setup is great though.",
        "I was searching for good digital speakers for my new rig and came across this model which was raved about by users across multiple websites. So after spending quite a while convincing myself that these were the speakers that I should be going in for, I finally took the plunge. Trust me when I say this, I AM NOT DISAPPOINTED. These speakers are way more than just a bang for the buck. They are high quality, premium surround sound equipment and will lighten up any living room to the pedestal of a home theater system. Great going Logitech !",
        "I like a lot of bass and clear sound and I hate most \"desktop\" or \"computer\" speakers. I did quite a bit of research before I bought these and so far, they are great! I had some amazing speakers before these and they went out on me, so I was not sure if these would be up to my standards. I think they sound great and do an amazing job. Really the only small conflict is just that the remote has to be fairly close or pointed directly at the unit to work. Other than this, I think they are fantastic! I will follow up with another post if something comes up.",
        "You really can't go wrong with this one. Not great response but what do you expect for less than $300? On the other hand, The possibilities for this surround system are endless. Want something just for the effects to complilment your bedroom wide screen? How about using it for a dedicated gaming sound system, (this is how my daughter has it configured). It's our second one. First one died as a result of recent electrical storm, (Yes the circuit was 'protected', but so what). Couldn't be happier for the investment.",
        "These are the best speakers that I have ever owned!!!!!! for the price, there is nothing that BOSE can put out that can touch the z5500. Pros: power, clarity, loudness, design and just overall the best preforming speakers that I have ever owned. Cons: Smells bad when sub woofer is being pumped to the max and the heat sync on the back will also get very hot, possibly causing damage to the amp. my solution was that I bought a little cheap $10 fan from target and it keeps the amp at room temperature.",
        "I have a analog/digital TV receiver and video converter for my Mac computer so I can watch TV on my computer. I bought this system so I could watch my TV with surround sound. I wasn't sure what kind of quality I would get out of computer speaker. I was so surprised and so was my husband!! They cost much less than regular surround sound systems and I can't tell the difference!! Logitech you are awesome for creating such a wonderful system for computers! Amazon you are wonderful for selling it at such a great price! Thank You!!!",
        "A Thousand Flipping Dollars?!?!?! I have owned this system since 2007 and it is friggin' AWESOME. Nothing else, (except possibly a Klipsch) even approaches it. I use it both as a HDTV Surround System and a PC Surround. The Subwoofer/Amp unit crapped out on me at just under 2 years old and Logitech replaced the entire unit for free, including shipping back the original system. Great, great service. But I paid $349.xx for it. At a grand, you gotta be kidding me.",
        "The Logitech Z5500 speaker set is one of the best deals around... You get all of the features and benefits of a dolby digital decoder, true sourround sound and a digital control unit. Sound is fantastic- You may find that tweaking the equalizer settings on your media player/sound card will greatly improve and balance the sounds output. The best part... It can play loud, too! Cranking it up to its full potential produces deep, rich pounding bass, without even making the amplifier's heat sink very hot to the touch! A best buy!",
        "I used this system to connect to my XBOX 360 and a 50\" Panasonic Plasma. The sound is incredible!!! Room shaking bass, high, clear highs. The THX certification says it all. The only draw bakc is that it has limited connectivity. One optical in, one coax digital in, and and IPOD connection. If you design your entertainment system right this set will do it all. I use my XBOX 360 as a DVD player and for games obviously. I had to buy and Optical cable splitter so that I could also connect my DirectTV. Small inconvenience, and well worth it. You will not find a better 5.1 system for this price. This is already my second set of Logitech speakers.",
        "I bought this Logitech Z-5500 as my computer speaker about two years ago. I would say this is the best computer speaker that I've ever had. I play lots of hard rock, heavy metal, new age, folk songs in mp3 format. I am very picky on sound quality of the music that I listen to. The Logitech Z-5500 delivers very accurate and powerful sound in all frequencies. It works best in a room that is not so large. I have purchased hundreds merchandise from Amazon so far. The Logitech Z-500 is among my top 5 best buy. I recommend it to the ones that have picky ears on music like I do.",
        "I got these a few months ago.. Still going strong. These are loud and have a lot of crisp bass. I was running an analog stereo speaker system before on my PS3 and then I hooked up the optical to the 5500 system; the sound was hands down the best sound ever heard (next to Bose). I use these on my main TV to run Bluerays/DVDs/games off of my PS3. It cannot get much better than this. The price has gone up since I got them.. They were 188 bucks on Amazon when I got them.",
        "for computer speakers, these things rock, its rich full of features and i can connect them to any device needing sound ranging from my ps3, my laptop, or to my lcd hdtv. it offers coaxial, optical and direct sound options so i hav everything plugged into it. the subwoofer is awesome. its like an earthquake in my apt and its so crisp. logitech has outdone itself, i dont know how they can ever make any better speakers than these, but if they did, i'd def hav to hav them. these r remarkable speakers...",
        "Overall: Are you kidding? I paid $186 minus a mail in rebate to Logitech for $40 back in March of 2008, shipping was free ($146 total). You can't beat that price! Pros: Great sound (loud clear powerful), easy setup, the best 5.1 computer speakers available. Cons: Sub is large, and buzzy sound (from time to time) when in stand bye mode when other areas of my home are powered on (lights, appliances etc.) No regrets, would recommend to anyone even at the current Amazon price of [...]+",
        "I have a home built computer which I recently updated to watch Blu Ray Movies. I have watched a few movies and the speakers are an excellent complement to my system. They are easy to use and control. I have an optical cable for my Playstation 3 and the sound is great. It has 6 Channel direct connection, an optical connection and a coax connection. You can switch between connections. I have my computer and Playstation 3 hooked up to my speakers. It comes with a remote which is easy to use.",
        "Got these for a great price. Using them with my new 40\" 1080p and Blu Ray Media Center I built. Using both the Digital and Optical with no issues. Sound is good, switching sources is fast, and the remote is very handy as I keep the receiver unit above the main display area. Warning - The Sub-Woofer is HUGE! I had to remove shelves to fit into my display area.",
        "unless you are willing to set up a surround sound system with your computer, complete with expensive receiver, this is as good as you are going to get. Sounds great, loud, tons of options. decodes for you or accepts your decoded signal. None of these products, or sound cards really explain optical and its relationship to which system is doing the decoding. If you have a great soundcard and this product, how do you know which decoder you are using? does it matter?",
        "This is exactly what I wanted to go with my Sony all-in-one computer. The computer has optical out, and the Z-5500 has optical in, and the processor and amp in it produce amazing sound. The control unit is quite handy and easy to place within reach without the big footprint of an amp. The high quality sound has made using the all-in-one computer a completely new experience. In my opinion, the Logitech Z-5500 gives me one heck of a lot for the money.",
        "these speakers are amazing.....got them about 2 weeks ago and just hooked them up last night.... and boy do they ever rock the house.....they are clear and the bass blows everything away out there....buy these...you will be amazed at the sound they produce.....i also have 2 sets of z680s from logitech....but these blow them away....i also have a set of klipsh pro media 5.1 speakers they are very good also....but the logitechs have more to them for less...and they come with the remote.the klipsh have no remote.or digital or optical input. im going to order another set of these and sell of the z680s....these are worth the money.....",
        "I have owned these speakers since 2008. I am sure the model and some of the aesthetics has changed over the years, but these are phenomenal speakers. I still use them and I use them more than any other sound device in my house. I can drive all of my neighbors nuts with half the volume and the sound is great, clear and precise. I would not hesitate to buy again - they are great.",
        "These speakers are amazing. I had them for a couple of days and then gave them to my mom for Christmas. My friend also got these without consulting with me and he loves them! They can be hooked up to three different sources (regular jack, coax, and something else) and it's complete surround sound. My friend hooked it up to his PS3 and his TV and his computer. It has amazing sound and cool features (like test each speaker to make sure it's working) It also comes with a remote. The only cons I can think of is that the subwoofer is huge! It's a pretty big system, but a pretty big sound comes out of it as well!",
        "I'm writing this review after few months of the purchase. Its one of the great products from logitech. Its been 5 months now. Its performing very good so far. Good quality...but not sure about the durability...Really creates a theater effects at home. bass sounds amazing...great vibration for the price..i have watched lot of movies in DVD with this system...truly crystal clear sound...ideal for mid sized bed room or living room...so far no complaints...Amazon has delivered me a quality product.",
        "Bought this 9 years and 8 months ago and it still works. I have to say this is an awesome speaker that performed great throughout the test of time. I use this in my man cave from movies to gaming.",
        "When I got this speaker system, I was wondering about its ability to put out sound. Don't be fooled by its size. The Logitech Z5500 Digital 5.1 system puts out sound like you wouldn't believe! This system could be a good replacement for a home audio system that is in your living room where the TV is for watching movies or using your media center with it. I'd recommend this system to those who would like killer sound but can't get themselves to spend alot of money for it!",
        "Great system. I would recomend it. However the subwoofer will cause metal to vibrate and add unplesant tones. It comes with a warning though to keep it at least 2 feet away from electronics and monitors. Should add anything influenced by strong magnetics. Do that and everything seems OK. Good reproduction of music even my sons stuff that he says is music. Games, you can hear the crickets and feel the explosions.",
        "These speakers were pretty legit. I got mine for like $299 on sale back in '05 maybe. I had them until '08 or '09. Never had any trouble with them. Bass was a little loose sounding but man this system would blow you away. Quite honestly with where technology has gone in recent years you can get something comparable to this for a small amount of money.",
        "These are the simply the best speakers that you can buy for your PC for the price hands down! Someone on here said that the knob on the control module did not work well, but I have had no issues with that. I put these speakers in an custom built arcade/jukebox machine and they are phenomenal! These speakers are simply awesome! They even have a digital coax input as well as an optical input for devices like a DVD player.",
        "I have a 32\" Toshiba HD TV and I have several pieces of electronics connected to it. I have my computer, Direct TV, Xbox 360, and a Toshiba HD DVD player hooked up to the TV and the TV has an optical output connection in the back. So I just hooked up the Z-5500 Logitech to the TV and presto the sound gets reproduced through the Logitech system. It automatically senses what type of sound is being fed to it and adjusts accordingly. This unit is perfect for my office/playroom I am impressed with the sound, and would recommend it to anyone.",
        "I only paid about $280 for this and it fills the living room with sound. The sound quality is not the best but it is pretty amazing for something so cheap. I have heard a Bose system that cost about $1500 and this sounded louder, more clear and had better low end frequency.",
        "Bought this product and received it in 2 days. Hooked it up to my pc's soundcard, only to get a loud hum from the system. When the control pod is attached to the subwoofer i get a loud hum, when detached, nothing. I get no sound in optical, or coax when hooked up to my dvd player. This product cost me $400, and I did not receive my money's worth. Also, you can not return it to Amazon. I'm going to call Logitech, and see if they can help me. I can't give a more in depth review til I hear it working correctly. Maybe I received a reject. I'm about to find out.",
        "absolutely satisfied in every possible way. tight, strong base. crisp highs, excellent clarity and separation. great remote & control center. good looking all around. ez setup. more volume than i could possibly stand!!! louder than a person should be around. great price & 2 day delivery from Amazon. beats all stereos i've heard up to $2k. i read reviews on these speakers for the last couple of years and regret waiting to order. absolutley satsfied in every possible way.",
        "I was looking for a speakers set to be used with my livingroom's HDTV, after read several reviews from many websites about Home Theater Systems I chose to buy The Logitech Z5500 because its specifications were just that I needed. I have plugged it to the soundcard trough SPDIF cable, the quality sound and performance delivered from these speakers is amazing, I have watched some movies with Dolby Digital Sound, DTS, THX,... and I have done some sound tests and let me tell you that the subwoofer could blow your mind. My brother in law came by to my house, saw it, loved it and bought another one to him inmediately...",
        "The product sounds nice, looks nice, and has good connectors and features. But, overall, I was much happier with logitech's speaker systems 6 years ago. The volume level on this unit, despite claiming ridiculously high wattage levels, is nowhere near what I used to get from a top of the line, similarly priced logitech system of years past. Other than that it's pretty good, but for a top end unit that claims such high wattage, it's not even 1/3 as loud as the room shaking system I had for a similar price quite a few years ago from the same manufacturer. I can certainly use the system and the sound quality is good, but it's not what I expected.",
        "First and foremost let me warn you that the tip of one of the audio cable broke off. I noticed this when I unwrapped the cables. Had I put that into my sound card and had it break off in there I would have been very very upset. Wonder if they'll send me new cables? Second, the bass is not that good. It's probably the best available for a computer, but it doesn't produce very deep bass.",
        "Wow! I bought this set specifically for my home computer because I listen to music all the time while on the internet. I thought it was about time I purchased a real set of speakers and I most definitely made a good choice. The bottom line: you are not going to get a better 5.1 surround system for the price. The subwoofer pounds and the satellite speakers are crystal clear. Buy this system. You won't regret it.",
        "These speakers a nice for the price. I already own a pair of Klipsch Promedia Ultra 5.1s. I tested them back to back when I first got the Z-5500s in this afternoon. Really good but not great. The highs aren't all that nice. But like the title says, I got this to watch movies on the TV and it's great. Wonderful speaker system. Couldn't recommend it more (since the Klipsch Ultras are discontinued).",
        "The optical input does not work well. I get a buzzing/humming noise when using optical cables. No, it is not the cable, as it works fine with my other sound system. I'm currently working with Logitech tech support, but they are really slow and don't seem to know any more than I do about my sound equipment. Anyways, I'm stuck with using the analog inputs which work fine--I guess. Digital surround sound sounds better, but I usually forget about it while i'm watching a movie. ***EDIT: I sent it back to the factory and got a new one, works fine now.",
        "It was good system, but did crap out after a few years",
        "The perfect 5.1 system. If you can find it, buy it. Had mine for nearly a decade and they still THUMP!",
        "I bought this speaker system for a new computer I just Purchased. The setup was really easy. I like the control unit that sits on the desk. It is so easy to control the volume or plug in a headset if I listen to music late at night. I am surprised how big the wolfer is. It takes up a lot of space. The units are built very well. I have had it for a couple of months and have no complaints.",
        "Well, cannot be too bad a speaker set if I have bought 3 of them! No issues with them for years (and years). My kids enjoy them too. My friend actually uses a set for his living room as the speakers are small and the fashion police (wife) will not allow \"unsightly\" speakers. Price is not really an issue as I have had them for while so ROI has been great! I love these speakers!",
        "I bought my Logitech Z-5500 back in 2005 and it is still going strong now in 2011. I love the sound quality and the build. It has survived 5 years of move in and out of college and is now a great setup for a grad student on a budget for their tv surround system. I could not be happier with this speaker system. It is perfect for use with a computer and a decent setup for a tv. It has the power to reproduce great bass for action movies and techno and yet produces crisp highs for classical music. A great buy all around.",
        "I guess it is best audio system for PC in existence. The bass is thunderous and precise and the speakers are loud and quality! I can turn this thing all way up and no distortions! I hooked my DVD to it and WOW the movie comes alive! For all that beauty and sound it provides it is very inexpensive and affordable. Highly recommend! I will be buying second set for a family room.",
        "I have Dell XPS 710 series maxed out for video and digital editing. HD 5.1 audio capability in my speakers is a must and these speakers are perfect. From thunderous base to shearing high pitch... no problem. What is most impressive is there ability to crisply drive both ends at the same time allowing you to composit things like thunder and glass fragments hitting the ground. The wattage is nice when you simply want to feel that base move you!",
        "I actually needed a better sounding system in order to properly hear the studio mixes my musician friends were sending. Yes, I could still opt for some studio monitors, but this system is a true stereo system allowing me to hear the songs as anyone else would through a decent system. No distortion,good clarity of highs and lows, and no need for more power......just the right fit.",
        "I finally got to experience the raw power of the Z 5500's. I received mine today and these speakers are simply awesome. The bass was so thunderous that it actually shook my wall shelf on the other side of the room, making my CD's fall off on the floor.If you are looking for a great set of speakers for a little over 200 bucks, free shipping get to Amazon fast.They won't last at this price.",
        "Shipped VERY fast (and FREE at that time I ordered)!!! Considering the size and weight of the package it is very convenient. It surely beat the hassle of buying this in the store. Sounds amazing for the size of the speakers (and the price of course). Unlike other's, my speaker cable is not permanently attached to the speaker so I can upgrade the cable when I want it. The master console is fancy. Cons: - Stand by power consumption is about 18 watts - bummer. - Cannot customize the tone (bass - treble) not a big deal. I'm quite happy with this purchase.",
        "I've never been able to turn this system all the way up. In my small room it would just be too loud. This system sounds great. The only problem is I had to upgrade my sound card because with the quality of these speakers you could hear the cheapness of the Dell OEM sound card that was in the system. I would totally recommend this to a friend and I was able to get it at half-price of what I had seen it other places (with free shipping!). Props to TigerDirect and Amazon.",
        "I bought this a few days a ago and it shipped overnight which was very nice. Pros:great sound, easy set-up, no need to buy a reciever Cons:I Needed a converter cable to hook it up to my TV, the wires to the back speakers were not long enough. Over all a great system and with about $20 of extra cable/wiring I was able to get it set up and running in one try.",
        "I have three of these systems that I've had rangeing from 2 years to 2 months. Best system for price/benefit. Straightforward audio,toslink, and coaxial inputs, understandable reasonable size display, simple remote, auto detection of input type all work well. Would be nice to have a longer cable (or extendable) between display and subwoofer/amp. Would be nice if speakers had more mounting options (like to the ceiling). Main advantage is reasonable price for good sound and usable with computer or HDTV.",
        "This is a fantastic speaker system. The sub woofer is huge for computer system, but then again I use my computer for everything, blue ray movies, gaming and music. It has a control panel that lets you adjust setting with remote or touch and the best feature when listening to music is surround sound 2x it uses all the speakers yes all 6.1 of them",
        "I would find it hard to believe that you could find a better 5.1 surround sound system in this price range. I'm using the analog inputs with onboard sound for music and occasional dvd watching and it sounds great. I can only imagine how good it would sound in digital mode. The satallite speakers are loud and crystal clear. The sub gives you more clean thumping bass than you could ever need. Plenty of adjustability from the control panel or the remote. And quite nice looking to boot !!! I'm very happy with my purchase !!!",
        "Writing this review a few years late, this system is superb, I wish I can buy another set again",
        "These speakers are the bomb!!!! I owned and still have there lower line ones X-530 i belive also 5.1 Both had very good quality! The x-530's i could listen to at full blast (very loud might I add) And these i cant even get past half way with everything turned up. From the optical to digital to coax inputs these speakers have it all! I have to say id rather stay home and watch a movie with these than go to the theater and watch the movie there. They are that awesome!",
        "I purchased these to replace my tried and true Klipsch 4.1 speakers (blown woofer) and so far I'm very impressed with them. Bass is tight and not overly boomy and the controls over a wide range of options. Gaming in 5.1 Dolby Surround is awesome with these. Midrange and highs are also great, but I recommend you tune it with an equalizer (X-Fi in my case) for your room size.",
        "I bought these when I bought a HDTV and I think I enjoy them more than the TV! The bass and overall sound this system puts out is amazing. Watching DVDs with this 5.1 setup is like an entirely new experience. The first movie I watched was the first Lord of the Rings and it blew me away. Buy these, you won't regret it. Highly recommended!",
        "I replaced a Creative ProGamer (G550 I think) set of 5.1 speakers with these speakers to gain an optical input. As soon as hooked them up I was delighted with the sound quality. I'm also hoping that an R/F modulator that is being delivered will allow me to hook my XBox 360 into the coaxial input. My new definition of heaven is to play the Freddie Cole station on Pandora through these speakers.",
        "This is a very reasonably priced, great system. I have purchased two other Logitech systems previously and this one did not disappoint. I have my computer and XBox 360 hooked up to it and the sound quality is amazing. My 360 is hooked in with an optical cable and the 5.1 sound gives me an edge in games like COD 4 and Halo 3, where I can hear footsteps coming from specific directions, leading to many knives in opponent's grills. I highly recommend to ang gamer who can spend a little bit of money. It is worth it and will increase your enjoyment for years to come.",
        "I came from the Logitech Z-680 speaker sets and the only reason I purchased this one is its in the same ballpark as the z-5500 The 5 small speakers feel lighter and have plastic feet VS the metal ones of the z680 they put out great sound, The sub woofer is larger than the z680 however it does not put out the amount of power as the 680 did. A huge positive over the z680 was the improved Control panel/volume It react quickly to your turns no matter how fast or slow you turn the knob. If you were not a fan of the z-680 being \"boomy\" the z-5500 is the way to go.",
        "For $269 & free shipping you can't beat it. I wanted to feed the sound from the TV, VCR & DVD via my TVs audio out jacks, but you need Y-adapters that Logitech doesn't include. They show them in a diagram but I couldn't find them listed as an accessory on their web site or at my local Circuit City, Specialty Electronics Store or Radio Shack (haven't web surfed, tho). Radio Shack did have a work-around - an adapter for connecting a source to 3 sets of earphones + 3 male/male 1/8 mini cords. Not elegant but it works. We're having a blast (literally) with these speakers.",
        "I've had these speakers for over a month and I absolutely love them. They sound amazing, the bass kicks hard, they're clear and there are numerous inputs in receiver module. These speakers are great for anything you need be it music, movies or video games. Only word of caution is that the subwoofer is HUGE. It's literally as big as an ottoman. But other than that, these are great speakers that will suit your needs. You will not find a set of speakers in this price range that also has a receiver. So if you are on the fence about this purchase, go ahead and buy these!",
        "This unit replaces an ancient Yamaha computer 2-speaker system. Needless to say, the sound quality of the Logitech is much better. I am extremely pleased with the quality of the sound and the ease of setting up the system. The only criticism I have is that the length of the wire between the subwoofer and the control unit is not very long. The shortness of this wire and the length of the speaker wires limited my choices in placing the units in my computer room.",
        "I have these plugged into my IMac with a 3.55 mil plug into the earphone jack of the computer, this system will knock your socks off, I wish they could get the price down, but I still feel it's a good value for its performance",
        "The sound quality is extremely clean and I have only used the stereo inputs. The bass hits really low too. It doesn't push as much air volume as you would think a 10\" sub would, but you definitely can hear and feel the bass around the house. It's sounds so good I might even buy a second system for my TV. For this price I do not think there is a better deal anywhere. This is the best electronics purchase I have made for a PC ever!",
        "Easy hookup to optical out of an iMac. Great sound. With this system and a LCD projector you have everything you need to turn your office into a home theater too. My only problem is chasing the kids out so I can get some work done. I use it mostly for DVDs and movies downloaded from iTunes. I am eagerly waiting for HD movies on iTunes. I have watched some of the TV shows with HD and 5.1 sound and you can really tell the difference. If your DVD has 5.1 sound it is worth checking that the sound preference in DVDplayer is set to digital out.",
        "These speakers were easy to set up and sound fine. The center speaker is especially good for spoken voices. Gaming and 3D effects are all great. At higher volumes, however, there is noticeable distortion in music. There is ringing, echoing, booming, and instruments don't sound the way they should (harmonics are missing or altered in volume). The speakers are fine for playing songs etc. in the background, but I can't use them for seriously listening and concentrating on any music. I'm sure these speakers create distortion in any kind of sound, but it's only a problem for music.",
        "Amazing speaker system. Installation was easy and I am incredibly satisfied with the speakers so far. These speakers sound great and are by far the best deal you can get with THX certified 500 watt 5.1 surround sound speakers. My only complaint is that the system does not include any optical (Toslink) or mini Toslink cables for use with many laptops and desktops that do not have S/PDIF outputs. Most Macs and laptops have either optical or mini optical outputs so the inclusion of this cable would be a nice addition for such users.",
        "bought this like 5 years ago now and i'm just now getting around to reviewing it. i've put SO much sound through this system, the majority of it being at VERY high volume, and it still works just as well as the day i got it. 5/5!",
        "From the minute you lift the box you know you're dealing with a heavy weight...most of it in the sub-woofer. Setup is straight forward. The audio wire is even color coded to prevent phasing from reversing polarity. The sound is full and dynamic giving life to surround sound movies and games with quality expected from significantly more expensive speaker systems. The only drawback when using this system with a computer is the shear size of the sub-woofer and speakers. It's tough to squeeze it all into a typically small workspace. In my opinion Logitech has created a 5-star thouroughbred for the serious gamer or movie aficienado.",
        "Buy this product and delivery was fast. Comes well emapacado perfect box arrived. The product is original and excellent. I recommend it",
        "I've had these for about 5 years now and am absolutely impressed with how well they have held up. I paid about $300 for them though!"
    ]
}