{
    "entity": "Computer Speakers",
    "text": [
        "This is a fantastic system, if you have nothing else that is wireless. I have the G7 laser mouse from Logitech, which I cannot use at the same time the speakers are on because of interference, and also it completely destroys your wifi, also your cordless phones (if they are 2.4 ghz) are useless, my xbox 360 controllers can't be used when the speakers are on. It's so frustrating. So if you're thinking about buying this system, and you have a bunch of wireless stuff (phones, mouse, keyboard, game controllers, router, whatever) don't do it, 2.4 ghz is oversaturated, and the z-5450 seems to interfere on ALL 2.4ghz signals.",
        "I bought this item because I wanted a 5.1 speaker system for my PC in my new home for games especially. This thing can really crank for what doesn't seem like a big system. The subwoofer is more than enough for any room and the wireless rear speakers sound great. Just be aware that the center and front speakers are not wireless. Maybe in the future they can have an optional rechargeable battery or something else for the wireless rear speakers instead of having to plug them into a nearby electric socket. Other than that, very good quality!",
        "This system is great, though I am a bit puzzled why there's a switch in the back of the control unit to switch from stereo to 6.1. All of that should be up front or on the remote. Another thing is that when it is on stand by, it consumes enough electricity to power a light bulb bright enough to light my dining room (a florescent). It doesn't save your settings if you cut power to it either. Overall, still a great system and has great sound. I'd still recommend it to the hard core gamer or HDTV watcher.",
        "Worked great especially in our smaller townhouse. Mostly reliable and the speakers produced great sound for their size. The wireless back surround speakers was an excellent feature and it never caused us problems. Only issue was with cable input, the unit shuts off without warning. I think the issue is receiving signals digitally on HD programming but during analog commercials the unit can't handle the different signals. This happened for both Time Warner and Verizon Fios.",
        "Man did I ever fret over which set to buy. There was so much info about this type of product on the net that I almost didn't get it. I am so glad I did. They work great and the wireless is absolutely as good as wired in my setup. They also include a very intuitive software interface. Easy to use and setup. I added the optical input adapter for a few bucks more.",
        "in Few words Great crisp clear sound using my creative X-Fi Extreme Card (not using creative software plus they have not released for Vista as yet anyway). Not So Good: You really need to bump up rear volume to to get a good feel of rears in 5.1 surround sound mode which is non Dolby/DTS 5.1 The control console/display unit heats up a little which initially concerned me but so far it has been working like a charm. I definitely recommend it. All the best!!",
        "after 10 years it still it work fine good quality",
        "It seems that the hook up for this set of speakers favors computers more than television. However with an adapter purchased from Logitech on line, It works just fine on my TV. Its called a \"Game Console Adapter\" and has two RCA type inputs and three of the smaller outputs that fit the speaker system. As far as the wireless speakers go... I love it. They do have AC power cords, but I'd rather do that than replace batteries all the time and I have no shortage of outlets for that. They work perfect for my application.",
        "I had a conflict with the z-5450's and my brand new wireless G7 mouse. When the speakers were on, the mouse was very stuttery. Articles and reviews of the 5450's explain there is a conflict with 2.4GHz cordless phones...and guess what frequncy the G7 runs on too? I had to eBay my G7 and buy a corded G5. There is also a hiss from the rear speakers (only) that I can't figure out, so I'm living with the minor annoyance. The sound on the system is very good, I'm satisfied with listening to music, movies, anything.",
        "bough a used one for 600 ok panel led display did not work no service manual , it sounded ok added bose desk speakers kicks ass , but I have a z series I payed less than 200 for in 1999 just as good except for the wireless",
        "Although the rear speakers need a power plug, this system solved my problem of being unable to run a signal wire to the back speakers from the front. The sound is OK, not awesome, but not bad. Better than the TV speakers by a long shot. They can also be nicely controlled with my Harmony remote.",
        "excllent set of speaker and control unit,good sound for your computer,makes playing games and listening to music alot a fun,very good quality for anybody looking for some good speakers for there computer these are it",
        "For someone that knows nothing about this product I like the ease of hookup and the sound is very good. Only thing bad is the volume, now I cant use my tivo remote to control the volume i must use the remote that came with this and that's a pain. Maybe Ill figure something out.. Would be nice to have the thing smarter so it picks up the right signal automatically like if its Dolby then do this and if its pro logic then do that or if its DTS then do this .. ect.. Found lots of info at dtvo.c0m on how to hook this up and also videos",
        "The sound and quality of these speakers is the best i have purchased",
        "Very good quality for the money when I bought the set",
        "HI !! I got this unit at a remarkable price . The sound quality rivels my bigger and more expensive system. The wireless rear speakers are great!! No hum or white noise on low passages. Highly recomend. Hope this helps out future buyers.",
        "They have fabulous sound for such small speakers. The only problem I had was once I installed Vista I could no longer get sound our of the wireless rear speakers unless I used the PLII effect. I think it's a logitech driver issue that logitech hasn't come up with a solution as of yet. I spent many hours on the phone with Dell, Microsoft and Logitech to no avail.",
        "within my budget and perfect for this price ... make sure you have a plan in advance that where u gonna keep the front and rear speakers .... if u gonna place them on stand then add another 50 to 60 dollars and make sure you get the right stands that go with them and not just any universal speaker stands",
        "Faço questão de teclar em Português. Pra quem estiver no Brasil saber que esse não é um Kit Multimidia normal. É um home-teather completo se você colocar um Mac Mini, que foi o meu caso. Tenho na sala de casa um completo sistema de entretenimento. Todos os meus MP3, filmes e podcast agora estão tocando num grande audio. Recomendo a todos. As caixas wireless realmente funcionam.",
        "Excellent speakers. Using with a home theater PC. The bass output is so good I had to turn it down for normal TV use.",
        "This is a great system. I replaced an Altec Lansing ADA-880 speaker and this is a major improvement and that system was no slouch. This has better bass and a fuller sound and the wireless rear speakers work flawlessly. I love it! Very Satisfied in VA",
        "This system has great sound... I am pleased with that but the rear wireless speakers have no range and don't work half the time.... you have to have them like 10 feet from the transmitter in order for them to even pick up a sugnal. And don't plan on using a chordless phone around them.... Great sound but this system is worth.... 150-175 tops...",
        "These are very nice speakers to set up and use. The wireless rear speakers just help get rid of wiring clutter, although you have to plug them in to a power outlet.",
        "very good, worth the money. If you want a louder one, go for Z 5350",
        "the speaker system was everything my son had hoped for; works great; delivered in a timely fashion; the transaction went smoothly and as expected",
        "Best system under 300 $ I've ever had..No need wire with rear speakers, Works good with MacBook Pro,surround good. If you don't want to spent more than 300 $ on good system this is what you looking . Don't wait just buy it and enjoy.",
        "I use this for my surround system, hooked up to a Media Center PC. It works like a champ. No problems with the system at all.",
        "I did some research on this speaker system before buying it, and I thought I had a good idea as to how it will perform. After having it for about a month now, I am blown away by its capabilities and its sound quality. The price was right, and was perfect for my applications.",
        "I have gotten this speakers three month ago and it is really good ,sound are clear and perfect.",
        "There is a problem with this specker set I purchased, now no sound and 1 rear speaker does not work, please contact the seller.",
        "Some of the most annoying speakers I have used as of yet. I loved my [,,,] logitechs but needed more bass etc. I bought these last week and have had nothing but problems with them. The wireless speakers are crap they go in and out and if you have wireless internet forget about it. Id rather have them wired like the z-5500s. I would not recommend, get the z-5300es much better",
        "I am in speaker heaven. The sound quality blows away other speakers 2x the price. The wireless rear speakers are beautiful - they sacrifice no audio quality and they were easy to hang and look great. To get the best sound, you definitely want to set up the speakers in a square and keep them all at the same height - when you get them in a square the sound is resonating and it's just perfect. I'm hearing detail in my music that I've never heard before. And when I play a movie it's theatre-quality. Highly recommended.",
        "Pros: Awesome Base... i love the base.. watching any movie or HDTV with 5.1 is great. Clear sound and plenty of input types.. you can even manage the sound level for each channel. Cons: Satellite speakers could have been upgraded to be a little better. I changed my front satellite speakers to cube speakers. and the Sound now is AMAZING!!! it now matches the sound quality of the system. the only other con is that i wish the sound out of the rear speakers were a little louder..",
        "This is a great system. I don't know about the other reviews and there problems, but mine works just as promised. I have one of the wireless speakers plugged into the same power strip as my Netgear wireless router and have never had a problem. At my old address, there were several people that had home Wi-fi and it worked fine there to. The only grip is that the rear speakers output is not adjustable. I would like a little more out of them, but ,even in retrospect, I would still buy this system.",
        "Rear speakers worked for one day. Sounded outstanding for one day. Everything powers on, the sub woofer, front speakers and center but the rear ones won't fire no matter how many times I push the pin in the holes on both the console and speakers. Nothing. The front ones and the woofer put out great sound but would liked to have the surround effect. S.O.L. with these speakers. They make great Mouse's and Trackballs but pass on these speakers. I'm not the only one, check the forums on Logitech's site.",
        "I bought this system and the Bose Acoustimass 6 at the same time to do a direct comparison. I was pleasantly surprised at the great performance, especially from the wireless speakers for the rear channels. Clean highs, distortion free midrange and great crossover for the subwoofer. The Bose is back in the store and the money is back in the bank. You do not need to spend big, to get big performace out of little speakers.",
        "I bought this system after I read a review in a computer magazine.For the price this unit delivers very responsive base as well as very good highs and lows. It has a remote control and truly wireless rear speakers. The rear speakers require that they only have to be plugged into an A/C outlet to function. I am amazed at the surround sound when playing DVD movies. The unit has inputs for 3 units. 2 standard optical and 1 coax. For the price you can't beat it. As usual [...] had it at the lowest price",
        "Fantastic speakers when they work. My Brother and i both have a pair, but they frequently drop out, powering off entirely. They also cause a lot of wireless interference if you have a wireless network around. It's a shame, because it's a marvelous sound for such a compact and affordable unit. Thought it might have been a lemon, but both sets have the exact same problems.",
        "these speakers are ******* great but not worth $1300 worth around $900 but with more and more rear speakers dyeing the value must go up.",
        "The sound is great. ... The number of inputs is great. It does optical! Yahoo! The only problem, for me, is the remote control. ... It feels cheap, and the little buttons sometimes get stuck in the depressed position in normal use, so that the control (let's say Volume Up) continues after release, and it gets too loud.",
        "i just got them in. setup was a snap!!! (very cool) the sub is great. they put my old speakers to shame logitech 503.if you want a real good sound, this is the one to get. trust me you will love the sub-woofer.. and it will shake the walls... and playen games it rocks.......",
        "I give high score to this system. Maybe not for audiophiles but it is well balanced for most consumers. Sound quality is impressive consider the compact size and wireless speakers. The wireless signal to satellite speakers is down convert to 48khz; but it still creates surround effects nicely. Overall the system offers good sound and features for it's price range. The system decodes 5.1 Dolby and DTS digital signals with 2 digital optical inputs. Wireless satellite speaker is definitely the biggest selling point. If you want surround sounds without surrounded by wires, this system is a good buy.",
        "i love the surround sound system, it sounds great. i especially love the fact that the rear speakers are wireless. what i was disappointed with is that it is advertised as being able to work with both your desktop computer and entertainment center... and while this is true, if you plan on hooking it up to a gaming system, television, dvd player, etc you will need to buy converters (i bought mine at radioshack) to hook the rca cables for audio into the system. the only inputs for the system are for like the sound cables usually used for computers. either way, i eventually figured it out and i really love the sound system.",
        "This system works as advertised. Set up easy, rear speakers are 'wireless' with only power connections to be made. Sound is crisp clear bass is deep, enough to fill out a mid-large sized lounge. I bought these over the 5500 b/c of a) the wires b) I live in a two bedroom apt with a roomate and i thought it would be useful to have the wireless speakers moved over to the lounge when we had company over. For what i needed this system fits the bill.",
        "This is my first surrond system so I have nothing to compare it to, but I must say that it is quite impressive. I have not had any problems with the wireless rears. The lows are a little boomy though. But all in all, a good starter system.",
        "Great product. Wireless setup works best if you have an outlet on the wall behind you. No need for extension cords then. While the system isnt competely wireless, it does do away with traditional speaker wire to the two satelite speakers. Awesome bass. A few weeks after purchasing this system I dropped one of the wireless speakers and it stopped working. Amazon had another entire system shipped and at my house BEFORE I had the old one boxed up! Great service.",
        "The only glitch I found was that the set up of where to plug which cords in did not tie to my computer system but a call to Logitech very quickly resolved that minor issue. I could not hear the hum that one reviewer spoke of earlier, even with all other sound producting items turned off. I admit the control is not impressive but then other than for first setting it up and very occasional changes, what does one even use it for? I use my computer's controller. Other than tailoring the sound for your preferences, simple volume control is all that I need and the computer does that just fine.",
        "After owning this system for two years, the wireless rear speaker stopped connecting to the receiver. The solution in the product manual doesn't work and logitech support can't provide a solution. If you're willing to mail in your receiver they will offer to give you up to 50% off the z-5500. Because of their inflated prices, it would actually be cheaper to just buy the z-5500 from amazon. Logitech's prices are too high for a poor product quality and incompetent tech support.",
        "I ordered these hoping to replace an old set of logitech speakers. What a disappointment. These are supposed to be PC speakers right? The first set I was shipped was completely broken. The second set worked, but there is one big problem. They completely disable my wireless router and cordless phones. THIS PRODUCT CREATES HORRIBLE INTERFERANCE. Needless to say I returned them and will never buy logitech again.",
        "Great system in every way. The only drawback is the plastic stands, which can't be swiveled and give you limited mounting options. But note that you *can* use universal speaker mounts on the L-R and rear speakers (it doesn't look like you can do it with the center speaker, but the center speaker's stand swivels up and down, so that's not a big problem).",
        "Just what I needed - 5.1 channel speaker system with the freedom to take the two additional rear-satellites and put them in a separate room to enjoy stereo sound transmission here and there. After that - easy enough to put them back to return to the full 5.1 DD or DXT listening configuration in the screening room. - IR remote slow response rate - the headphone jack could work all-the-time - just the main speaker-power could be switched ON/OFF via remote (or a button on the control box or both).",
        "I was a little worried about the latency between the main wired attach front speakers and the wireless back speakers... and I honestly say I can not notice any. I also do not consider myself an audiophile, but it's tremendous value and quality for what I paid for, and it makes setting up small home theatre clean and easy. I rather these speakers than any other $200 from BestBuy or Circuit City. Another plus is for $200 these are the only THX certified speakers you can get for that price.",
        "I recently purchased this Logitech system for my computer because it was very well reviewed and wireless. The configuration of the room required a wireless setup. I cannot give enough praise. It came in 3 days instead of 5 to 9. It was very easy to set up. We did have to purchase a new sound card in order to use the 5.1 features, but that was cheap and easy to install. The quality of the sound is amazing! I love the purchase and recommend it highly!",
        "Overall, the system was ok. I liked the looks of it and the sound quality of the wired speakers was on par with other systems in the price range. The wireless speakers had low continuous static that once I realized it, I noticed it everytime and it got pretty annoying. I returned the item and got a Samsung system and like the new system much better.",
        "Nice packaging but dissapointing. For 100-200 bucks maybe but $350 is way too much for this system. The rear speakers have to be connected to an outlet so the wireless aspect is useless unless you have outlets where you want the rear speakers. Logitech is an excellent company but speakers may just not be their nitch.",
        "These speakers are great. I've owned bose speakers, 8:1 creative sound speakers, and a prior model of Logitech peakers. By far, the power and clarity of Logitech speakers are superior. One great aspect of these speakers are that they are really easy to install. The only negative point is the requirement to plug in the \"wireless\" 2 satellite speakers into an outlet. Otherwise, best of bree for speakers in this price category.",
        "This item delivers. One draw back is if you have a lot of components to hook up such as a dvd, Xbox, playstation etc. you will need to buy a component switch. I would highly recommend. Its a great alternative for people who cannot run speaker wires thorough threir house.",
        "This is by far the best system I've owned. I bought a different system from Circuit City but wasn't satisfied with the sound. A friend recommended this one to me, and I couldn't be happier [ and it was less expensive then the one I returned to C.C.] If you want a fine stereo sound without investing too much of your \"hard earned cash\" then this is the one for you.",
        "I ordered the Logitech Z-5450 speaker system with high hopes. The package arrived promptly and I installed it as per the instructions. The instant I powered up the sub woofer smoke started to come out of the speaker and the unit smelled of electrical burn. I never got a note out of the system. I'm sending the whole thing back to Amazon and will write another review on how the return part of this transaction goes. Yuck! Logitech? I don't know what to make of their equipment. My one experience is not good.",
        "I got the z-5450 for the price combined with the wireless rear speakers. I just didn't want to run speaker wire around my condo and this was a great solution. I am using it for my home entertainment system and it works well. The 2 optical inputs are all I needed. The only thing I haven't figured out is how to control it with my universal remote.",
        "This is a great 5.1 system. I bought it because as a composer I strarted with multichannel works... this is a 100% compatible for a macbook pro... and you can use it through optical out and is compatible with Logic Pro... so, you can choose the 5.1 Template and voilá...!!! and for movies is great too... :-)",
        "This surround sound system is amazing. i bought for my own room to go along with my xbox 360. i have tryed playing my 360 with panasonic,bose,sony,ect. this one definitly sound the best. i would definitly suggest in getting it. the one thing that i dont like about the sound system is the remote. If you are gonna get this system then i highly suggest in getting a universal remote with.",
        "First ignore other posters who spent too much on cables. Digital is digital and ANY optical cable will be the same regardless of brand. Remember that 1's and 0's which are being sent are always 1's and 0's.The data being sent is not analog so when a digital cable is concerned it will either work or it won't so don't get suckered into spending way too much money for a cable that won't make any difference. That said It's a great setup sounds amazing with my Xbox360, HD-upconverting DVD player (LG LDA-511), and all the 5.1 content from my cable provider. I have no hesitation giving a 5 star recommendation!!",
        "I like this system the sound is clear and super bass.....for a smoll room is so wonderful",
        "This is an excellent speaker system for the small living room along with your computer. The sound is distortion free to very high volumes, and it reproduced movie sound with excellent fidelity. Listening to music on this system is good except for some complex classical or ambient works.",
        "i have a media center PC, Xbox 360, Dish network and this set up speakers allows me to elimate the need for a stereo. the sound is incredible, we have had a few times that our dog has looked around the room, as she follows the sound. i plan i getting a second set of these for the TV in the bedroom. everyone that has heard them is amazed.",
        "This system is a great buy, the bass is unbelievable. I am a college student and we set the system up throughout the room and our room shakes as does the floor, and the girls above our floor have come down to find out what was making there floor shake, so if you are looking for a powerful system for a good pricem this is the system to buy. Also the installation is quick and easy so no worries on that.",
        "I have been looking for this 5.1 system for long [wireless surround speakers]. Logitech did a great job on 2.4GHZ wireless surround speakers. No distortion or noice. I agreed with one of the reviewer. We still deal with [electrical] wire from the wireless speakers. Overall, Z5450 is amazing system to have.",
        "Bought these for my Son for Christmas to use on his PC for gaming and watching movies. The sound quality is very good. The rear speaker responce is excellent and surprising enough there was no interferance from his other wireless devices, i.e. joysticks etc. Saved @185.00 by buying them through Amazon.",
        "The speakers are nice the set up was pretty easy. The digital inputs are great for a tv or dvd player. It was a lot better than buying A/V set up for everything. The only thing is the rear speakers have to use a/c outlet i'd rather have speaker cable.",
        "If you want to turn your pc into a home theater system without running wires, this is a must have system. Works great with my media server and plasma screen. Add Belkin wireless keyboard for enhanced experience too!",
        "Or the ease of use. This system has worked great for us and has brought new life to our DVD player, Xbox, and multiple other A/V devices. If you want great sound quality and easy set up--get this system. It even looks great.",
        "very good at sound and base. wireless rear left and right is my favous part. Make sure you have Optiocal output to the device, without it,it's just suck.",
        "Excellent set of speakers, powerfull, sound great and a great value for money. The surround is superb, however the stereo lacks presence.",
        "The z-5450 has good points, reasonable cost, ease of use and ease of setup. It has a major fault in a buzzing noise made when the unit is turned on. Give this item a pass, wait for the next generation and a guarantee that this problem has been corrected.",
        "i just got it and man i love it got it hooked up to my tv.xbox360.and my pc man the sound on this is great me love it (= so i have to gave it 5 stars",
        "Awesome 5.1 sound from a computer! Reasonably priced and easy to get up and running.",
        "These Logitech speakers are very powerful; I bought it for my boyfriend and he loves it!",
        "These speakers can only be hooked up to a computer. I ordered them and not until I received them did I realize that they did not connect to a receiver/ampifier. These are not speakers you would buy for your home theater system.",
        "I have been using this for about a week now. The setup was quick and error free. I have to get a coffee table just to hold all the remotes. You would think LogiTech would include a coupon for one of their great universal remotes."
    ]
}