{
    "entity": "Ice Cream Machines",
    "text": [
        "Freezes ice cream faster than our old one. Love the handle on the bucket. Makes it easier to get it out of the freezer when we get ready to use it. Easy clean up.",
        "This is a nice little machine; easy to use and fairly quick. There's a certain amount of trouble involved. You have to make sure the canister is thoroughly frozen and the ice cream mixture is chilled, which means you have to think way ahead. But it's not that difficult. It doesn't really make a lot of ice cream, so if you want a lot, real quick, then go to the supermarket. But for that homemade taste, this is a good choice, and it's enough for about four people. I'm glad I got it.",
        "I tried it for the first time, and I think it did a decent job, in spite of the fact that I did not freeze all my fruits. After twenty minutes or so of stirring, my ingredients had the consistency of soft ice cream.",
        "arrived as expected, no problems with the packaging, 40 minutes in a 22 hr frozen containter, and it made perfect ice cream....will definitely purchase from this vendor again",
        "Nice little maker, does a good job. As the others say, make sure to get your custard down to fridge temp; America's Test Kitchen reported get it down to 40 F, and the freezer part of the maker down to 0 F.",
        "I bought this after reading the reviews here-after using it twice I am totally happy-everything as claimed. Great texture ice cream, quick churning, easy to use and easy to clean. Great recipes included. Tip for those in tropics-like me-freeze the mixture for a couple hours before pouring into bowl.",
        "Met expectation. Kids enjoyed seeing the process. Clean up minimal which I liked. Would buy it for a gift.",
        "The ice cream is too icy when done and if you let it go too long it begins to melt instead of getting smoother.",
        "now we just eat homemade ice cream and my kids love to choose the next flavor and try it",
        "I made my first batch of chocolate ice cream the other day and it was better than store bought ice cream. It was easy to use and clean.",
        "Purchased this after reviewing many other similiar in size. This was the cheapest in price. It did make great ice cream but you must freeze container and your mix over night. Mine never got thicker than a milkshake but froze into ice cream. It would really depend on your recipe as with any ice cream maker. It is just small. Enough for 2-3 adults.",
        "I'm not much of a cook; don't like to make a fuss. Bought this to make another healthy snack and found it too complicated. I bought a blender and am happy with the thick smoothies I am making in 3 minutes flat.",
        "The Hamilton Beach Ice cream maker is going to be a disappointment if you are attempting to make ice cream in a warm climate (such as here in Key West ) without the AC turned on. I couldnt get the HB to get the ice cream cold enough even though the container was cooled in the freezer at maximum setting for 48 hours and was additionally insulated with a towel. It ended up as soft ice cream. I cant recommend this product.",
        "Came without instructions and/or warranty registration and did not work.",
        "very easy to use. makes a good amount of ice cream. no ice or salt needed which is excellent.",
        "THIS IS THE QUIETEST, MOST COST EFFECTIVE ICE CREAM MAKER I KNOW OF. IT IS FAR DIFFERENT FROM THE OLD NOISY SALT AND ICE MACHINES. THIS IS THE FUTURE OR FROZEN PLEASURES.",
        "Very professional, item was shipped and received on deadline agreed upon, for a very fair price.",
        "I was considering a Cuisinart 2 qt model, but read the reviews about how noisy it was. That is why I searched and found the HB 1.5 qt. I received it, and froze the cylinder overnight. I also pureed up fresh mangoes and froze them overnight. Today, I combined the frozen mangoes, sugar, cream and half/half in my Vita-mix blender. Poured it into the HB cylinder and in 20 min, had wonderful soft serve ice cream. I put it in the freezer to ripen. I love the locking/carry handle because that cylinder gets COLD!!! Cleaning the unit is a breeze. I am VERY HAPPY.",
        "I just purchased this a few weeks ago. I have already made at least 6 batches and I am impressed! I was skeptical that frozen yogurt could be any good, but boy am I wrong! It is delicious! Also, easy. Rich frozen custard, also yummy. This baby is bringing out my mad scientist experimental side! The bucket does need to be well frozen, and the room shouldn't be too warm. I have found that one batch every other day works well. (Part of that could be my overcrowded freezer isn't so very cold). Pour in the ingredients, process for 20-30 minutes, eat! Easy to wash, everything is easy. My only complaint is that I may be eating too much...",
        "Not only do we own one of these ourselves but we bought one for my Mother as well. It makes just the right amount for her. I love the way this makes ice cream! No salt or ice necessary. The trick to it is to make sure the maker is completely frozen (24Hrs Is best) and that you make sure your ice cream mixture is extremely cold!! Then this works very well. We haven't had any problems with it and when this one wears out I would definitely buy another one!!",
        "I have tried all kinds of recipes in this maker and can't wait to try more! As long as the bowl is kept in the freezer AND the mix you put in it is chilled, it is FAST and it is ALWAYS easy! Cooler ingredients freeze faster. Comes out like soft-serve but put in freezer a while and it becomes dippin' ice cream.",
        "You do need to let the cylinder freeze, I took advantage of the polar vortex this winter and it froze the cylinder in about 4 hours. The sugar free ice cream we made turned out perfect. Very very pleased with this ice cream maker.. right now the cylinder is sitting in the freezer awaiting the next urge to have ice cream",
        "Works great, A good price and makes a quart and a half of great ice cream with out cranking, and the mess of ice and salt..",
        "Love it ! Have had one in the past and wore it out . Live the convenience and just right for entertaining a few guests!",
        "Made ice cream for the 4th. Everyone loved the ice cream and it is so easy to make. Plan on making some of the other recipes in the book.",
        "Although I have not used the Hamilton Beach ice cream maker, I am sure I will enjoy it. I purchased the ice cream maker because of the good reviews and I feel sure that I will enjoy it just as much.",
        "This product exceeded my expectations. It is compact, quiet and easy to use. I used the recipies that came with the product and it worked very well. If you like firmer ice cream let the finished product sit over night in your freezer. This ice cream maker makes plenty of ice cream. Others have commented that it doesnt make very much. My family of four was able to have two servings a piece. If this doesn't make enough, check your portion size. We are the fattest country on earth you know? These new models are a vast improvement over the old wooden ice-based models, in taste and time saving setting up/taking down.",
        "We've been using one of these for years and it's as good as new. We just keep it in the freezer so it's always handy. We like it so much we've given several for gifts. Just remember to have all your ingredients super cold before you start and you'll have great ice cream! A very good product.",
        "For less $ than most of the others on the market, this is one of the best of the small \"freeze ahead of time\" type ice cream makers. Unlike most of this type, it has enough cold stored to both freeze AND ripen the ice cream. I'm going to buy another so I can make two batches at a time.",
        "This Ice cream maker is outstanding. And so inexpensive. Forget all the negative reviews here. The top locks on very securely, it operates very quietly, and makes ice cream quick and deliscious. So easy to clean fast. The motor top is plastic encase so it can be rinsed off. The bowl rinses quickly too. No one mentioned in the other reviews that it holds a freeze for almost 2 hours. Time enough to make a second batch of ice cream on the one freeze. Heck...for $29 you really can't go wrong. Im making 4 batches of it for the holidays.",
        "My machine arrived today, I was concerned because of a couple of post that said it would not work in a hot house without ac. Well, today as I was cooking in my un-airconditioned home.(98 degrees inside) I decided to make some homemade Strawberry Ice Cream. It took all of 32 minutes and it was perfect. I believe this will be wonderful for me. Raymond",
        "Cheap, quiet, and easy as hell. Our ice cream was outstanding. I am a pretty good cook, but you could be missing both arms and legs and half your brain and STILL be able to make delicious ice cream with this. It's seriously idiot-proof.",
        "We used this ice cream maker once last summer and got OK results... But when we broke it out of storage this year, small holes had formed in the cylinder's interior, and the coolant was leaking out into where the ice cream would have been. Not a safe product.",
        "I tried three times and each time it made a coat of ice around the chamber within four minutes. The poor little motor could not push through the layer of ice around the side. Consequently, what it made was ice on the outside, milkshake in the center and a stalling motor ready to burn itself out. Cool Design. Unbelievably poor quality. Not only am I returning this as soon as possible, I am going to think twice before buying a Hamilton Beach product again.",
        "we ordered this product and were very impressed on how easy it was to use and clean up after being used.I was very portable and is the right size for a family of three people.",
        "I have been extremely pleased with this product. Very quiet, compact and easy to operate. Have tried several different recipes and all have been extremely tastey.",
        "We couldn't be more pleased with this ice cream maker. Simple to use, easy to clean and makes great ice cream. Wonderful product and end result..... without all the mess of ice and rock salt.",
        "It is excellent for our needs... for a meal, you can have enough ice cream for a 4 family members....",
        "This makes the best ice cream we have ever tasted. We checked the temperature of our freezer before beginning and everything worked simply and successfully. The custard-type recipe is very smooth and creamy, not grainy at all. We used half the amount of sugar in the recipe and didn't miss it (we made up for it with the toppings, I guess.) We plan to do some fun experimenting."
    ]
}