{
    "entity": "Ice Cream Machines",
    "text": [
        "Love this ice cream machine! My ice cream turned out incredible. I’ll never buy store ice cream again! But be warned, it’s fairly noisy. I actually ended up putting it in a bedroom when it was churning, because it’s so loud. On the plus side, it only takes about 30 mins to make the ice cream, so it’s not a really big deal. I suggest following one of the recipes in the manual the first go. Also, be patient. Freeze the bowl for the recommended 24hrs. Cool your custard overnight before churning it. The colder your custard and cream, the smoother your ice cream will be.",
        "At first I loved this machine, after 4 uses the unit generates so much heat that it will not freeze the ice cream (which defeats the purpose right?). Save your money and buy the good expensive ones-you'll end up buying one anyway.",
        "Got a faulty machine and seller asked me to contact cuisinart directly rather than trying to offer solution.",
        "I got 2 uses before it broke. Both times the ice cream was quick, easy and very yummy. A little soft but super good. The 3rd time it barely set and we had to freeze it before we could eat it. This time, it just stayed pure liquid. The motor is too hot. I'm past my window to return, but I'm going to contact the company this week. Pretty bummed, as this was a Christmas present to my kids.",
        "I initially purchased the smaller (cheaper) 1.5 liter version, which I loved ... until it broke after about the 5th batch of ice cream. Figured that going up in size might mean a stronger machine so I purchased this unit. I made my first batch of ice cream last weekend and I cannot believe the noise this unit makes while it's churning. It's awful ... and becomes a bit like finger nails on the blackboard after about 5-10 minutes. It got worse as the ice cream got harder. Really, really disappointed ! I gave one of these to a friend for a wedding gift ... I can only hope (will have to check) that she's not having the same issue.",
        "Got one for me, for my sister and my parents and we all love it! It’s easy to use, easy to clean, and best of all it makes some amazing ice cream. For best results on the consistency of your ice cream I recommend not filling it to full capacity. I always go 1.75 quarts since some ingredients make the ice cream expand and spill over the edge. I also freeze the container a day prior to using it. I wouldn’t attempt to make more than one batch in one day, the container needs to be as cold as possible.",
        "We were tired of dealing with our old ice cream maker that required ice cubes, which often caused it to jam up. This machine doesn't require ice cubes at all. Our first batch of ice cream, made with strawberries from our garden, came out a bit too runny, but it hardened up in our freezer just fine. Our next try-peanut butter ice cream- turned out much better. Now we are experimenting with fruit sorbets. We used golden raspberries from our garden and the sorbet turned out perfectly. Tonight, we made mango sorbet and it was so simple to make and very delicious. I am very glad we bought this machine.😊",
        "I tried an experiment. I had read a review that said that the bowls for the ICE 70 was the same as in the ICE 30. I took a chance and bought the 'new & enhanced' paddle that is used in the ICE 70. It works in the ICE 30, and it REALLY is a better paddle. My ICE 30 now makes the frozen mixturebought the 'new and e into a ball of ice cream. When I pull out the paddle, ALL the ice cream stays on it - with nothing left in the bowl. This ICE 30 works great as is, but using the enhanced paddle makes it even better.",
        "For this to work properly it is imperative that you freeze the container COMPLETELY before you use it. I was impatient and used it with the container still slushy when you shake it. WONT WORK! For best results, freeze container in the bottom back of your freezer for at least 2 days. When you shake it you should not hear ANY sloshing. I also froze the bowl I mixed my ingredients in. When I had all the sugar dissolved in the frozen bowl then I pulled the container out of freezer, immediately poured mixture in, set timer for 28 minutes and it work beautifully every time. This is way better than any commercial chemical ice cream!",
        "It doesn't state on the description that it needs to go in a zero degree freezer AND you need to chill your ingredients. If you don't do both for about 12 hrs each, you will not get it to thicken up at all. I would not recommend this icecream maker. The old traditional ice and salt kind work way better!",
        "Love it but there’s a ton of ice cream frozen to the side of the base that is impossible to remove until you let the thing defrost for a while. So you serve what you can, wait a couple hours, then get that thick layer out and eat that. Other than this issue, who knows maybe common one with ice cream makers, is my only complaint. The thing works great. We have enjoyed some delicious ice cream from it.",
        "This is our family’s first ice cream maker and we love it! It’s so simple to use that the kids are making our ice cream and iced milk. It’s also easy to clean! And I don’t know why people say it’s noisy. It’s really not that bad. ***REMEMBER, as a previous reviewer said: 1) Do NOT put it in the dishwasher! 2) Make sure ALL your ingredients are chilled before you put it in the ice cream maker. 3) The ice cream maker should be in the freezer for 24 hours before you use it.",
        "The kids love it. The first batch I made a few weeks ago was a little loose and melted fast. This time I put the whipping cream in the freezer for about thirty minutes and it came out much thicker. I still stuck it in the freezer for an hour to make it a little harder. This is my first ice cream machine and first time deciding to make ice cream on my own. I don’t have anything to compare it to. Really easy to use though.",
        "I should have left this review quite awhile ago, but I've been busy making the most amazing ice cream EVER!!!! This product is exactly as described, easy to use and fun to work with. Such high quality that it actually set off the security alarms when bringing it through customs in Costa Rica. I had to open my suitcase to show them it was an ice cream maker. The guard even asked how long before ice cream will be ready. Thanks for a great product at an very affordable price. I've been using this now for over 2 years and no problems at all.",
        "Following the instructions (I'll deviate once I'm an expert), we made a batch of rich, chocolate chunk ice cream with nuts, raisins and chocolate pieces. I'm so happy with my successful first batch that wasn't soupy or soft serve. Instructions are simple. We looked with amazement as the Cuisinart slowly churned. In a matter of minutes, we couldn't believe our eyes; real homemade ice cream! But alas, I'm going to put on the pounds eating fresh ice cream every day; It's that good. I'm hoping the Cuisinart Pure Indulgence Ice Cream Maker lasts. Next batch, I'm taking pictures to demonstrate how great this machine is.",
        "I had to return this item. It was extremely loud,wobbled and didn’t make ice cream even after being on for an hour.",
        "This machine makes some terrific ice cream and gelato. It works quickly too, much better than a traditional ice cream maker. I like the ease at which you can make things and it’s fun for the whole family. We have made several different kinds of ice cream and gelato and each time it seems to get better as we learn how to get the texture and flavors to our liking. Highly recommend this machine.",
        "I've made many tubs of ice cream in this maker and it hasn't disappointed me at all. I love that I can just turn it on, put the ingredients in, and go. Just make sure the tub is good and frozen. I don't wait until the machine stops before I take the paddle out and transfer the ice cream to a container and put in the freezer. I just make sure it's \"to the right consistency\" before I transfer it to the freezer. I wish I had another tub to use so I could make more than one tub at a time. Some of my recipes make more than will fit in the tub at one time.",
        "I bought this unit in 2017. I used it no more than a couple times a year. I brought it out this year 2019 to use this summer and the bowl is already defective. We froze the bowl for two days and it did not freeze the mixtures. We had to toss out all the ice cream.",
        "I got this machine as it seemed to be right. The best advice is to cool the ingredients 20 minutes before using. I went with 30 minutes to be cerain. Put in the coldest part of the freezer. I found my freezer was not on full cold and so I turned it to coldest. Works fine. Glad I bought this machine. Now if it works for years. CP",
        "Arrived a week ago, used 2X. Ice cream is fun, melts quickly if not frozen after churning. Not sure if this is a defective product, or sound of normal operation, but this unit makes a terrible grinding noise while operating. It also makes this noise when the frozen bowl is not sitting on the rotating axel, so it's not that I haven't assembled it correctly. I plan to request a replacement, but will the replacement also make this awful noise?",
        "This ice cream maker works great, but it's ridiculously loud. I have to use it in the basement because it's louder than a vacuum. Also, for the comments saying the bowl doesn't freeze/machine doesn't work I tried using it in our old basement fridge and it doesn't get cold enough to freeze the bowl. Once I moved the bowl to our fridge upstairs which is newer, it froze. So it's a possibility that your fridge just isn't getting cold enough. Cleanup is very easy and the past two recipes I've made only took me 25 minutes in the machine to freeze. Great purchase!",
        "Machine is very noisy. Only worked one time in freezing ice cream to a soft serve stage. The other 3 times I tried it I had what appeared to be a milkshake (at best) after almost an hour in the machine. This after having the container in a deep freeze (less than 0 degrees) for more than 24 hours and using a mixture that had been in the refrigerator overnight. Not impressed & returned the machine. I purchased another brand of ice cream maker and it works great.",
        "I can't hear myself think over the sound of the motor. Seems more appropriate for a workshop than a kitchen. It mostly works, but the harder the ice cream gets, the louder the motor is. It's deafening and sounds like it's going to burst into flames. Wish I could return it.",
        "I've used this several times now; made vanilla, peach, chocolate, and butter pecan ice cream, all delicious. I use a combination of coconut milk and a little cream, plus Swerve sweetener (erythritol) and usuall some vanilla. The process couldn't be easier. The one surprise is that if you store leftovers in the freezer they will get much harder than store bought ice cream. I guess the commercial ice cream has additives to keep it soft.",
        "I have tried to make simple vanilla ice cream 5 times. I followed the procedure word for word in the manual provided. I froze the Ice Cream Crock solid for 3 days on the last attempt. I have also brought my ice cream mixture down to 43 degrees before trying to churn into ice cream. Only thing I end up with is cold liquid whether it be 30 minute churn or 1 hr churn. Simply just does not work . Wish I would have read reviews online prior to purchase because this is what many many many are also claiming. Very disappointed",
        "Wow!! This little machine is fantastic. I have only made the kind of ice cream that you have to put ice and salt in. Not only is this 1000 times easier, but the ice cream tastes so much better. I have tried various recipes from the book and improvised on a few of my own. I've had great results each time. It doesn't take up much room on my counter and it makes about as much noise as the dishwasher running. Not offensive at all. I highly recommend. Keep the container in the freezer at all times an any time you have the urge for a frozen treat you'll be ready.",
        "This was out of stock for several weeks. When this became available my daughter and I were very excited. We were not disappointed very easy to use and clean up. I’ve seen people complain about the freezer bowl not working properly but we had no issues at all. I had it in the freezer for 24 hours before we used it. We let the maker go for about 25 minutes and then added come chocolate chips and let it go a couple more minutes. It turned out great.",
        "Use it everyday in this summer heat. Love the recipe. Make mine Keto, modified the simple vanilla recipe it had to replace sugar with less powdered swerve and stevia. Then couple tablespoons of alcohol to avoid hardening like a rock! Easy to use and fast. Makes soft serve then have to freeze for harder consistency. No cook recipes are the fastest.",
        "My wife and I wanted a way to make frozen treats without having to go to the store and pay $$$$ for small little pints. We also wanted a way to make flavors you don't see very often (like coconut banana for example). I have been very surprised with how easy it is to make ice-cream/sorbet with this. I purchased two (one for me and one for a gift) so far and will highly recommend to anyone that asks.",
        "OMG! We love this! It makes the creamiest ice cream ever! We have tried a million recipes and haven't been even once disappointed. Do be sure to store your bowl in the freezer for quick makes. Now, it isn't silent, so don't expect it to be. But as the cream thickens it does hush up a bit. It's not noisy by any means but you do hear it working. Cleans like a dream. It's small enough to put away or leave out, even in my tiny kitchen. I love that it doesn't have a million parts to store. Of course the best part is, no ice, no salt. Just pure delicious.",
        "This machine is made well. It is very easy to use and clean. Our ice cream turned out smooth and creamy. I used the vanilla recipe in the booklet that comes with this. I used 1/8 cup less sugar and swapped a 1/2 Tbsp. for almond extract to make an almond vanilla ice cream. It was delicious!",
        "Reading the reviews I wonder if people just don’t know how to follow directions. The freezer bowl must be frozen. The ice cream is not going to be as hard as store bought but if you put it in the freezer it will get harder. I’ve made ice cream several times. Yes, it requires cleaning and yes it is not fully automatic, but it works. I’d prefer the machine with the compressor built in and maybe zi will buy one. I’m not sure if homemade I ecream is better, but you know the ingrients and it is a fun thing to do.",
        "...I thought I might like this thing, but I was wrong: I LOVE THIS THING! Oh my, it's December and I'm making ice cream -- and no, I'm not blaming the climate on this one, this is all me. Anyway, easy to use, hard to screw up (if you follow the instructions -- people who can't or won't read should stay away from products with moving parts) and makes the goods!",
        "This product looks extremely to use. Get an ice cream mixture and pour it in. But no, you have to freeze the entire mixing bowl in your freezer overnight. I don' know a single person with enough freezer space to put that giant bowl in their freezer for 24 hours. Literally all this machine has is a mechanism to spin the bowl around. I'm highly considering returning this piece of junk. Extremely dissatisfied.",
        "Totally disappointed; just received the Cuisinart yesterday. Cleaned it, put the freezer bowl in the freezer over night and tried to make a Lemon Sherbet today. I made the recipe exactly by the one in the enclosed recipe booklet. I had it turning for more than enough... probably 40 min or more. It never became even close to a sherbet, rather a soft slushy... barley. I put it in the freezer to harden. I will try an ice cream tomorrow, if it doesn’t work I’ll return to sender!",
        "I have used a stand mixer attachedcecream maker before. This is a superior method to make icecream. If you freeze the mixung bowl longer you get a firmer result. Mixing longer isn't alwers better as when the bowl unthaws the icecream will melt. Only drawback is it may be loud if up close or a smaller space.",
        "I would recommend this product to anyone, but especially people with special dietary restrictions (lactose intolerance, allergies, etc). The locking mechanism is pleasingly robust and the extended base helps the bowl stay frozen for longer churning sessions (at least I think it does). The bowl does take about 8 hours to freeze completely, but unless you are making ice cream more than once a day this shouldn't be an issue. I just store the bowl in the freezer all the time! My only complaint would be that the coating on the inside of the bowl scratches somewhat easily if you use a metal implement on it, but using a hard plastic spatula works just fine.",
        "I bought mine in 2005. I take the bowl out and freeze it and in 25 mins I can have ice cream. I notice the compressor models take 40, so when I need a new one, I will go with the same model or the newer version that makes gelato too. I have learned how to make custard ice cream without tempering the egg yolks so I love vanilla ice cream made at home, there is nothing like it.",
        "This is the second gelato maker that I have bought from Cuisinart. I Loved the first one so much I bought them for the whole family but mine finally quit working so I ordered a new one. This machine is so loud you cannot carry on a conversation in the same room. Ear protection is a must with this new one. It is larger and makes the gelato in record time ... but the noise is unbelievable.",
        "Works great and is fairly quiet. IMPORTANT to understand, freeze bowl over night until you hear no slushing inside. I put the stir mechanism that goes into the center of the freezer bowl in the freezer also. I also mix ingredients in a metal mixing bowl which was placed in the freezer (or put mixed ingredients in fridge for a bit). VERY IMPORTANT, don’t pour liquid ingredients until the stirring mechanism is in place and the unit is turned on. If you pour ingredients in while the bowl is off it will instantly freeze to the side of the bowl and won’t work as efficiently. Other it works great :)",
        "As usual, I researched off and on for weeks before I purchased this. This appeared at or near the top of nearly every review I read. I used it for the first time last night. It worked well, but wow is it noisy. My husband and I were sitting in the next room, about 20' away, and we had to raise our voices slightly to be heard. (We finally closed the door between the two rooms.) If we decide to make ice cream often we may consider buying a quieter one, even though the one I'm looking into would cost 3x more.",
        "Yeah... NO!!! This thing does not make any ice cream, just some cold weird tasting soup that needs to be frozen for another five hours to turn out with an odd texture, weigh too sweet and resembling nothing like ice cream. What they do not mention is that you need to freeze the base for 12 hours before you even start using it, which delays the process to the next day. The base recipes in the book do not work, and I tried several of them: vanilla, peanut butter chocolate, strawberry. I wasted a lot of expensive ingredients and disappointed a lot of kids over the holidays. What a shame!",
        "This was our second, and a gift. As a quick and easy method to make a cold snack, it is perfect as long as the number of mouths in wait is not too large. We don't make yogurt so I can't say how well that snack is made, but for ice cream, it can't be beaten for convenience. Doesn't make the product real firm, so it needs to either be eaten immediately, or put into cups or a bowl, then the freezer for later.",
        "I love this ice cream maker but I order in September but really started using it in October I use it maybe once a week sometimes less. I plug it in this morning on 1/24/15 and it would not run nothing sounds like motor. Just dead want do anything but make a noise at beginning. It really is bad to buy something and it last less than a year. So for 3 months i use this product it is not worth the money. I am going to try to notify the company. But it is probably a lost cause. My daughter was going to order one I told her not to now",
        "This is a GREAT ice cream maker. It is super easy to use and store. Only possible complaint is the noise- it is loud. Otherwise works wonderfully. We keep the freezer portion in a grocery bag in the deep freezer. Once you have the ice cream mixed get the freezer, pour it in and turn the knob! takes 20-30 minutes to freeze. Works so well we bought a second one as a gift for our grandparents!",
        "This is the second one I buy. The first I used many years but had to leave it to my ex :( Now, this is great, I have been making ice cream every other day or so. I experimented variations of their recipes to make it low calories and low fat. I am using allulose mixed with splenda - allulose helps keep the creamy feel.",
        "We ordered this machine to try our hat at making dairy-free ice creams in our tiny apartment. I know this models was a little bit more money, but it's profile is a little smaller than some of the other Cuisinart Ice Cream makers which was an important decision factor when shopping for our small kitchen. We've now made oodles of ice cream recipes, and even a couple sorbets. Most recipes turn in about 30 minutes, but we've had luck with the freezing bowl staying cold for up to almost an hour. The freezing bowl cleans easily, although it's a bit bulky in our freezer. Now to find more dairy free recipes...",
        "It is way too easy to make ice cream, frozen yogurt, sorbet, and many other frozen types of desserts. No mess to clean up as before with all the ice and salt, The machine is a breeze to use, and homemade ice cream has never been so quickly, easily and spontaneously made at our house. Hence, a danger to my waistline. My only concern with its design is that I wish the clear hard plastic lid that holds the churn in place locked more securely to the base. One day I foresee having to strap it down.",
        "I love this ice-cream maker. I bought it to make Dole Whips. Bought the mix from Amazon. Took a few try’s to get everything figured out. But once we did it was great. Have to make sure the insert is frozen solid. It would not freeze in our big upright freezer but did in our freezer attached to our fridge. Also, make sure to get the ingredients cold for at least a few hours first. For the Dole Whip we tried a few different recipes but the one that worked best was 1 cup mix to 2 cups water. Tasted just like the ones at Disney. Was done in about 25 minutes. So glad we bought this.",
        "This ice cream machine is amazing! I'm tired of buying $4 or $5 pint size ice cream at the store. Expecially when your looking for vegan ice cream. Not to many flavors to choose from. Now I can make my own dairy free ice cream and frozen yogurt without spending too much money. I do recommend this!",
        "It works very well when it's half full. But if you try to do 2 qts it takes well over 45 minutes and the core thaws out before the ice cream is frozen enough, so the ice cream ends up very icy once you put it into a container and put it in the freezer. If you do 1qt at a time it comes out nice and smoothe. But that kind of defeats the purpose of buying a 2 qt machine.",
        "This ice cream maker is the BOMB!! So easy to use and freezes ice cream in about 30 mins.!! The only downside is the bowl that the mixture goes in has to be in the freezer for 24 hours before u can make ice cream, so I'm going to buy another bowl!! Good price, too!",
        "It stopped working between the second and third use. It just hums and doesnt turn to cause the paddle to rotate. Amazon put me over to Cuisinart. The two batches i did make were very yummy. I have 4 other Cuisinart appliances which are wonderful. This one is a failure but a week later mfg said they are going to send me a new unit.!!!",
        "Exactly as described. Only better. Was so easy to use and store. Bought it for my granddaughter and I to use and we love it!! Have had so much fun making ice cream and trying recipes. Would highly recommend this product. If you're looking for an ice cream machine, this is a great one to buy. The only problem we have had is finding a good recipe.",
        "Doesn’t freeze. At best makes it a cold slush. It’s better to just blend your ingredients and put it into a dish and freeze the dish. This thing just makes soup.",
        "No issues with item. Have to run it in the basement because of the noise it makes, but come on, it's only on for 20-25 minutes and the ice cream is sooo good. I can deal with it :-) keep the bowl in freezer and including the time it takes to mix a basic recipe, you will never be further than 30 minutes away from tasty soft serve!",
        "While this works well and we use it weekly, I'm not super impressed with how much is costs vs. how little it does. All that aside, the scraper assembly doesn't \"scrape\" well enough off the sides. It works, but there's a fair amount of ice cream ending up stuck to the sides and hardening more than the rest. I have to check in and scrape the sides with something to keep it mixing properly. Overall, I still like it- it's simple.",
        "This is the second time I have ordered this machine. The first one seem to have a short in the electric cord. It had to be positioned \"just so\" in order to connect to the power source. Unfortunately the new one seems to suffer the same problem. After just one use the machine seem to have a short and had to be positioned \"just so\" in order to operate. I had to make frequent checks in that , at one point it stopped. I had to reposition in order to start it again. I use this to make ice cream for our church fund raiser. I won't be purchasing again.",
        "Great ice cream maker for the money. The cream is much, much better than the gourmet stuff available from the store at a fraction of the cost. I won’t be buying much commercial made ice cream any longer. Easy hand wash and clean up. The only negatives for me are that it’s made in China (please build these things someplace else) and that the motor is ridiculously noisy while it’s running. It only takes 20 minutes, but it’s still a bit much to listen to.",
        "Made 3-4 runs of ice cream so far, and they were delicious! Had to stop temporarily because my chest freezer took a poo poo and I don’t have room in my kitchen freezer for the bowl this thing uses (or ice cream for that matter). Stupid Covid is gonna hold up getting a new freezer for 6-8 months because of plant shut downs. Now I have to wait for ice cream, or else eat 2 quarts in a sitting, but I think I’m up for the challenge...",
        "I got this product under the assumption that it is like traditional ice cream maker without the constant hassle of buying salt and ice. While this product does work and in the record time it boasts of 20-35 minutes. The ice cream leans more to the soft variety being a consistency of a firm soft-serve by the end. If you are a fan of firmer ones, just slapping the result into the freezer for a bit finishes it to that perfect consistency.",
        "This is an excellent ice cream maker - just plan ahead and follow the direction and you'll be thrilled with the results! I made coffee ice cream with coconut milk and Pyure sweetener (stevia blend - purchased on Amazon) and it was incredible! Just make sure the barrel is frozen solid and your ice cream mixture is well-chilled and you'll be rewarded with a delicious frosty treat in about 30 minutes! Well worth the price!",
        "You use this for half an hour to barely thicken your ice cream mixture. Then you put that thickened mixture in the freezer to finish hardening. This does not give you a result the texture and consistency of ice cream. Ignore the positive ratings. Go look at the question and answer section, and the people who \"love\" this machine telling all the people wondering why their ice cream won't freeze all the extra tips and tricks you have to go through to actually get ice cream out of this thing.",
        "Before purchasing, be sure your freezer temperature is 5 degrees (-15 c) or lower! If it doesn't, the cooling bowl will not freeze the mix. My small standalone freezer gets down to only 15 deg F (-9 c). The ice cream mixture only lowered to 35 degrees after 25 minutes. (Mixture must get to 29 degrees to freeze). It's possible to pre-cool the mixture in your freezer (to 30 ~ 32 degrees) *then* add to the cooling bowl. I haven't tried that yet. (My mixture started at 44 degrees). The purpose of the ice cream maker is to stir the mix while cooling to avoid ice crystals in finished mix.",
        "Love this machine!!! We've made several batches of the most delicious homemade ice cream so far. Love that you can make your own base, preservative-free, and add in whatever \"mix-ins\" you want. Takes a little bit of pre-planning - it's best to leave the ice cream bowl in the freezer for several hours, ideally overnight, for best results - but that's definitely not a deal breaker. I highly recommend this!",
        "This maker works great for my vegan icecream mixes. Just make sure it is in the freezer for about 48 hours and that the ingredients have been in the fridge for about the same time. It is a noisy machine however, but a lot of machines that work well are this way. So I am not complaining. It does take about 25-30 minutes to freeze the ingredients. So don't think after ten minutes that its a dud.",
        "I am not sure mine has worked correctly from the get go, the arm inside doesn't really move, the ice cream just kinda goes through it, the machine is soooo loud, its ridiculous, you need ear protection to be in the same room... Like I said, it sooo loud, and I will be returning.",
        "I love this ice cream maker, the first time I made the ice cream I took the frozen cylinder out of the freezer while I was making the liquid mixture, and it didn't freeze as good, more like a milk shake, but that second time I took it out when everything was ready to pour into it, it did leave it on for 30 minutes instead of the 25 it states, and it turned out perfect, I love this machine, we make ice cream all the time.",
        "Works fine, but so freaking loud. I have to put it in the laundry room while it runs or it gives the whole family a headache.",
        "It’s extremely loud. No timer, so I had to use the oven timer. The bucket has to go into the freezer for at least 6 hours before use. And the ingredients have to be made hours ahead of time, and then they’re poured into machine. So unless you have a mixing bowl with some sort of pouring device on it, it’s a mess everywhere. After 25 minutes or so, ice cream needs to go into yet another container to be put into the freezer. Dirty dishes. Loud machine with no timer. Takes hours to make 2 quarts of ice cream. NOT WORTH IT.",
        "Ice cream maker works well. Item arrived fully packaged and double boxed. However, it appeared to have been jarred violently. Possibly dropped on an edge from a few feet? There is a crack in the polycarbonate lid (did not effect performance) and the base of the unit had \"jumped\" its locking tabs. Overall, the unit is fully functional but it did not arrive in pristine condition.",
        "Very loud; but it does make ice cream. I’m giving four stars because of noise. It makes great ice cream, if you use receipt correctly and have it cold enough. Turn it on before pouring mixture in it, we learned on the second try. We have several Cuisinart products still working great after decades of use. Jury is still out as to whether this will be a favorite or stuck in a closet. Soooo loud.",
        "Do you want ice cream in thirty minutes? Because this thing gives me ice cream in thirty minutes. No salt and water needed like with the models we grew up with. I gave it a difficult to clean rating because the freezer bowl will freeze water and anything stuck to it if you're not fast. But that's really the only downside. The ice cream comes out as an amazing soft serve and you toss it in the freezer for a few hours for thicker stuff. No real complaints.",
        "This is the first ice cream maker we've owned. The recipe booklet that comes with it is wonderful. It's June and strawberry season so we've been making strawberry ice cream....the best we've ever eaten. There is some prep work to get the berries ready but once they are in the machine, it only takes 25 minutes for the mixture to firm up. It does take another hour in the freezer to complete.",
        "Ordered Saturday, Delivered Sunday , Icecream Sunday night. This is easy to use, easy to clean and in 25 min you have wonderful icecream. Makes a bit of noise while working but less than my jet like blender ! Would definitely recommend",
        "Perfect for everyday use! My fiancé and I have a protein shake every morning and we love to put ice cream in the shake! It is nice to know exactly what is in the ice cream because we made it ourselves! Highly recommend the Cuisinart Cook book! Lots of ice cream and other recipes in the book! The ice cream storage containers are amazing, they are a separate purchase but great! The machine is beautiful to look at and easy to clean! If you like homemade ice cream and you are looking for a great product, the search stops here!!!",
        "I absolutely love this ice-cream maker. I owned a 20+year old Cuisinart ice-cream maker, that finally seized up. Went to Amazon's website and bought the newer model. It has a bigger gear than the old model and the bowl seems slightly bigger as well. I tend to buy from companies who offer a very good product, for a reasonable price. I highly recommend this product as well other products they sell. If you can get 20+years from a small appliance, in today's world, I figure you simply can't go wrong.",
        "I bought this for the family for Christmas. We've make 3 batches of ice cream from recipes in the book that comes with it. It's super easy and fast. The ice cream was very tasty but the constancy is a bit off. We're trying some other recipes from the Internet now, trying to get a creamier one. We keep the bowl in the freezer so it's ready to go when we want a batch. After blending the ingredients and adding to the machine it really only takes 20 to 30 minutes and you've got lovely soft serve ice cream!",
        "It makes some great ice cream. I would recommend following the recipes in the booklet first and than make sure custom recipes mimic them. My mom's peppermint ice cream never set, but it is a very cream heavy recipe. Expect everything you make to seem too runny at first, but once you drop it in the freezer for an hour you'll have awesome ice cream. The almond espresso recipe was especially good. Try to candy your almonds first to give them a little extra crunch.",
        "I returned a different brand so that I could buy the Cuisinart Ice Cream maker and I am so happy that I did! I love it! I've probably made at least 4-5 batches since getting it- yay quarantine! The recipes that come with it are delicious! It produces a fabulous ice cream or sorbet in about 25 minutes. Just make SURE that your mixture is cold before you use it!",
        "I wish i can say something about this product but I unfortunately was not able to use it because of this quarantine. I do have to say is that when I opened it it seems like it was a good quality and fits well even if you have to put it in the freezer before using it.",
        "Because of coronavirus, we are not going to our local ice cream stores this summer and we can't get ice cream as part of our grocery deliveries because of the summer heat, so we wanted to try making in our. This ice cream maker is super easy to use. There are only three pieces to clean after using. I love that I can store the bowl in the freezer and don't have to worry about having enough ice or rock salt, or about salty water leaking into the container and ruining the flavor of the ice cream.",
        "I researched a lot before deciding on an ice cream maker. This is for use for a two-person household and to make healthy ice cream alternatives. I hit the jackpot with this easy-to-use machine! I bought a second bowl in case I needed to make back to back batches of ice cream. This is such an easy concept - simple to put together and easy to use, cleanup is a breeze. I'm in love with this machine... and I'm a very particular consumer.",
        "I made my first batch of Strawberry Ice Cream and it is great! I have wanted to try to make Ice Cream forever and never realized that I could buy a affordable yet excellent product. I am looking forward to making Sorbet, Frozen Yogurt and expanding and experimenting with my new toy! I am learning the basics of operating the Ice Cream maker and already have some ideas on how to make up some fun flavors. Thanks Cuisinart for another great product!",
        "This is a great product for home ice cream making. It is just the basics. It work great and is simple. If you follow the directions you will succeed. I wish I had a second bowl. I sometimes cannot wait for the bowl to re-freeze. I suspect this is where the failures lie. Make sure your freezer is at its coldest setting. Make sure the bowl freezes for 24 hours. Make sure you let your base chill in the refrigerator for 23 hours. Follow a reliable recipe and you will have success.",
        "Very easy to use ice cream maker with great results. Basic ice creams from the recipe book are very soft (but still good) straight out of the machine and freeze nicely into a more I've cream like texture in a few hours. Custard style ice creams come out more ready to eat. Cleanup is pretty easy too. Loses one start for being super noisy. We run it in our utility room with the door closed to muffle the sound.",
        "We read the instructions, froze the bowl until it was solid & then ran the ice cream machine for TWO hours! We had to turn it off then because it was so LOUD that it was giving us all headaches. & after all that the mixture wasn’t any thicker than when we put it in. This was a Christmas present for my daughter who is now super disappointed...as we all are!",
        "Worked as promised. I left it in the freezer overnight on the coldest shelf. Maybe it was too cold. A layer of super-frozen ice cream formed around the walls and bottom of the tank, maybe 1/16th inch thick. I'll raise the freezer temp next time I try this and see if that helps.",
        "Very easy to use and pretty easy to clean, but SO LOUD! My five year old and I tried to surprise my husband with his favorite ice cream while he was napping at the other side of the house, but the ice cream maker woke him up! That thing is so loud my son often asks to go outside and play to escape the racket. Makes great ice cream super fast if the insert is frozen for AT LEAST 48 hours, no less.",
        "We got this for ourselves as an anniversary gift. It is pretty simple to use, and makes some very good desserts. We liked the rocky road recipe in the Cuisinart book that we also purchased as our favorite. It was very smooth. The pumpkin was an odd texture, but we still enjoyed it. We are now looking for a good vanilla custard recipe.",
        "We have enjoyed having this machine and have used it a handful of times. My struggle was trying to do more than one batch back to back since the bowl was too frozen to really wash out and reuse. Would need to either not wash it, or wait for it to thaw, wash then refreeze. Another idea would be to have more than one freezable bowl thing...",
        "I've only used the ice cream maker a few times, but so far I love it! My family always wants homemade ice cream at summer cookouts but I hate dealing with the ice and salt. This is so easy -- pour in the ingredients and leave it alone. The 2 quart is the perfect size for 4 - 6 people (we like generous servings). Clean up is a breeze, too.",
        "I really wanted to try to have homemade ice cream for my family but this thing was so loud it took any enjoyment out of the family fun! Plus it’s way more expensive to make ice cream using mixes which aren’t returnable! So bummed!",
        "The Cuisinart ice cream maker is sturdy and easy to use. Those that have had problems aren't reading the instructions and most likely skipping steps. It's a little pricey, but you get what you pay for. It's so easy to use that it's eaiser than going to the store for ice cream. Plus, you make the ice cream the way you like it!",
        "Hello, I don't want to complain but I just opened my box up and was prepared to make my first batch of ice cream but my Cuisinart Ice 30BC 2 QT automatic ice cream maker was missing the small circular (#1 part) that goes on the very top. I check my box several times and it wasn't there. If you could please send me that part so that I can make my ice cream I'd appreciate it. Thank you Charlene",
        "Does a nice job but make a hideously loud noise that belongs out in the garage.",
        "Works great. Best ice cream I’ve had in years. And super easy to use. Don’t follow the recipie book exactly though. The quantities in the book are about twice as much as the machine can make. It’ll overflow if you do. Just cut it all by half and you’ll be fine. I use the sumo containers and it fits nicely into one container for each batch I make.",
        "We make ice cream WEEKLY with this and we are so glad we went with the 2 quart size. I had used the 1.5 quart size with my sister in law and when I saw how full it would get with the recipe that we use, we decided it was worth it to get the bigger one. We also bought a second freezer bowl because our recipe makes multiple batches. Our son loves to watch it church and he gets so excited when he sees it out because he knows it's an ice cream day!",
        "This is so easy to use and easy to clean. It has been fun creating new ice cream flavors. Would recommend this ice cream machine specifically over others on the market."
    ]
}