{
    "entity": "DVD Players",
    "text": [
        "Philips DVP642 DivX-Certified Progressive-Scan DVD Player - Wow, I originally purchased this over 10 years ago! Unfortunetly I don't still own it or even know what happened to it. However, I do know that I bought it because it played multiple formats I that I used it extensively for many years. I read some of the other reviews and it did bring back some memories of having to update the firmware because the zoom feature did not work correctly. Despite that fact, I suppose I stopped using this because media steaming became much more efficient that playing CD/DVDs. Anyway, if you have just purchased this item I can tell you that mine lasted for many years and never failed.",
        "Great machine, plays all my dvds, mpeg4, divx... nice picture (especially with progressive scan). Excellent form factor. This is one of the best - I tried many and they all had flaws in MPEG4/Divx. This is the first one which stands up to the claim of \"dvd/mp3/mpeg4/vcd/divx\" player. Yes, I have all these formats. On the dark side - remote is cheap and badly designed. Does not have \"open\" button. On-screen menus are ugly, and obvious things (like switch between progressive scan and non-progressive scan for watching widescreen/standard frame movies) requires 4-5 clicks - instead of a button on the remote. Real bad. But I am willing to live with this, since the player itself is so good.",
        "Please read all the 1-star reviews before purchasing this DVD player. When I first bought this earlier this year, I also was very pleased with it -- it can easily be programmed to play all region DVDs and played most divx discs I tried to play. BUT... 6 months after purchasing, it's dead. When plugged in, the power button flashes red. Cannot be turned on -- will have to dismantle it to remove the DVD inside it. Philips has refused any support or service on this, because it only has a 90 day warranty. This unit was not mistreated and was used very lightly in that time. I will not be buying another piece of Philips electronics.",
        "The player worked fine for six months but now has gone south. After playing a while, the player freezes, sometimes with a totally pink screen, sometimes just the picture currently played - forever. Remote control will not work upon unit freeze. Occasionally it will allow a quick reverse and then play and will continue. Most frequent event is complete freeze followed by turning itself off. One must then restart the DVD and jump to just before the freeze point and then continue to play. Sometimes to the end, sometimes for ten seconds. This is a throwaway item.",
        "I am on my third machine and they all had the same problem. After being turned off for a while, the progressive scan went bad. Going to the menu and turning it off and on again solved the problem but it needs to be reset every time the machine is turned back off. After quite a run around from Philips, they now say this is normal and part of the design. Right, just like a car that only starts every 3rd try. So unless you want to reset this \"feature\" every time you use it, don't bother with this player for HD TV. Sorry Philips, you can't avoid support just because you say a design flaw is \"normal\".",
        "The DVP642 is a very flexible player (disc formats and region hacks) at a respectable price. The progressive scan image quality with component connections on an HDTV is quite good but not great. However, my first player lasted 5 months before it failed to read discs. After a month the second DVP642 player I purchased is now making clicking noises and takes its time recognizing commercial DVDs. Philips offers only a 90-day free exchange warranty and a 91-day to a year \"reduced cost exchange\" - this seems to indicate they expect more than a few of these units to be short-lived. At $10, an extended service plan may not be a bad idea if you buy this DVD player.",
        "About one half of my DVDs are from Russia, and the other half are from the USA. Thanks to Philips DVP642 Progressive-Scan DVD Player this is not a problem. It can be easily re-programmed to accept DVDs from all zones (regions). The trick has been published on the internet. Philips DVP642 plays all video and audio formats. It reads all types of media (i.e. DVD+R, DVD-R, DVD+RW, DVD-RW). I have used it with both wide-screen and normal TVs. With a three-cable RGB connection to a wide-screen TV monitor the picture quality is just perfect. The sound quality is perfect in all cases, whether I use analog or digital sound output.",
        "We purchased this DVD player when our Cyberhome unit stopped reading discs. The dimensions were the immediate draw as the thin profile enabled us to place the unit right below the VCR and still have room above for the Bose wave radio on top of the VCR in the bottom section of our entertainment cabinet. The unit powers up fine and plays great. I would note that if you like to slow down the action (to study golf swings, etc.) the unit only goes down to 8x. The cheap Cyberhome went down to 32x! The only other option to run slower than 8x is to frame by frame it manually with the remote. Otherwise- good unit for the price.",
        "Got one of these, had an awful mechanical clicking noise after loading a DVD and no signal, returned. Got the replacement, it had the same mechanical clicking noise, but it works. sortof. Very bad at surviving disc anomalies. A cheap TV/DVD combo and a 10-year old DVD player can play brand new discs that this DVD player can't. Rarely can we get through a DVD without this player freezing up (have to unplug it to get anything from it) and us moving to another room to use one of the DVD players this one was supposed to replace. Wish I could return for refund, but I'm tired of dealing with it.",
        "I highly recommend the Philips DVP642 DivX-Certified Progressive-Scan DVD Player if you want a good playing machine, disposable product, at an inexpensive price. I wanted an easy to use, no frills, DVD player, that I, myself can use. I do not need an engineering degree to use it (if you know what I mean!) The overall size is quite slim and compact. Set up was a breeze...I did it all by myself! The remote control is fine, but the buttons are small (but most remotes are the same way). Shipping and delivery were quick, in a few days. I am glad I purchased this DVD player.",
        "This is my first attempt to purchase a region free DVD player. After following the instructions of an earlier Amazon customer in the reviews section on this product, to accomplish the conversion, as the owners manual does not reveal this process, the player appears to operate properly. I have purchased one new PAL format DVD and it plays with no problems. Two older European produced DVDs that I had do not play perfectly, but, they do play, one better than the other. At this time, I have had the unit just a month, but, remain completely satisfied.",
        "The thing costs under $60 and it plays most of your downloads. Next?!? If it lasts me 3 months it will have paid for itself just for the ability to watch all my downloads without have to hook contraptions up to my television. I got mine last year and I love the thing to death. I'm impressed with its ability to play just about anything I throw at it. It's an added plus that it plays JPEGs and MP3s as well. I highly recommend this product as a high-end stocking stuffer. I'm buying 5 more for other people for Christmas!!",
        "I've owned this model for almost a year and I've been very happy with it. It plays DVD-R, +R, +RW, VCD and SVCD, as well as Divx movies. You can set it to play NTSC, PAL or both and there's a region free hack for it. My only problem with it is that I haven't been able to get my cable TV remote to control it, but that's probably user error. The included remote works fine, it's just one more of many lying around. For a player that will play just about any format you'll run across at a good price, you can't beat it.",
        "I had this player for about three years and it worked great, playing all different types of discs, different regions, avi files etc. Then suddenly, today the standby light is blinking and the player won't respond or open and I have a disc inside from a rather expensive TV show set. Most of the good reviews are probably from people who haven't had this too long. Yesterday, I would have given this player a 5 star review but a DVD player should last more than 2 or 3 years. Don't buy this. See the other reviews, a lot of people had the same problem.",
        "I bought this because I bought movies for my Mom for Christmas and we don't have a DVD player. I mostly don't know squat about technology and all this wonderful world of electronics, but I managed to get this set up and play the movies. Pretty easy to work although I'm surprised there's no button on the remote to open and close the disk tray (maybe I missed the instructions!). The cord is a little short. And you have to aim the remote exactly at the box. But for the price and my particular beginner's situation, it's great. I can't wait to get more movies!",
        "yes, it is a more than adequate dvd player yes, it is a nice size and appearance yes, it plays lots of stuff \"other\" dvd players won't no, it doesn't play every video codec yes, it is easily made region-free yes, it appears to play ntsc or pal yes, the price is right. so i have bought a few for self and friends. maybe paranoia that some features will not be available in future if powers that be have their way. overall, a really good deal",
        "If you are looking for a solid, entry-level progressive scan player it's hard to go wrong at this price. Add in the ability to play a wide variety of video and audio disc formats and the value is undisputable. This is much more than a bare-bones player. Just in case it's not absolutely clear from the product description, be aware that you do need an HDTV (or progressive-scan enabled TV) to take full advantage of this unit's capabilities. But don't let that stop you. When you do purchase that HDTV you'll be ready to go.",
        "I really like this player, it's very versatile, capable of almost all of the formats and if you are into foreign DVDs it can easily be hacked (just numbers keyed in you can find on the internet) to be able to play the variest other regions. More important to me is it does the job well of playing back PAL DVDs. I have three other players, 2 JVC units and a no-name portable that stutter on some PAL DVDs and this one plays them back flawlessly. Very slim profile, does the job for me.",
        "Divx DVD player for this price is a steal! Highly satisfied with this machine! So far it has played all the videos I stick into this machine, which ranges from VCD, DVD, .avi video files, and Divx-encoded files. One more thing that blows my mind... DVD authoring takes a lot of time!!! and for lazy people like me, I don't want to take time just to author a video to DVD format. So, I simply burn video files into a DVDR, pop it into this machine, and a file-selection menu comes up for me to view. Simple and quick!",
        "Received my Philips DVP642 today, and unfortunately I am returning it today. The disc drive/tray made way to much noise while playing DVD discs. The picture appeared to be fine, and my test for divX playback went good. But I refuse to keep a DVD player that wont give me peace enough to watch a movie without having to hear chirp sounds while spinning the disc. I guess I'll have to look for another brand, and stick with my old $30 KLH brand, which by the way plays fine and makes no annoying playback sounds.",
        "I bought this DVD player earlier in the summer, and have been using it to watch fan-subbed anime DivX files downloaded from the Internet. The picture and sound quality are excellent. Also, I ran into problems when I downloaded and tried to install a ROM upgrade from the Phillips Web site. Since the problem fell within the warranty period, I simply sent the DVD player back to Phillips and received a new one in return. Overall, their customer service is excellent, and the player is great, too!",
        "I love this DVD player. It's slim, lightweight, simple to install even for us technically challenged. Picture is great and it has all the features that one would expect from a dvd player. Even my adult son who tends to be electronically snobbish thought I did well for an inexpensivly priced player. It's an especially great buy with the free shipping. I received the player in just 4 days. I am impressed by this little machine and would buy it again.",
        "It is not a bad DVD player for this price range, and it can play any region and from any TV, I'vd tried DVDs I bought from Japan, England, China, Hong Kong, and everything works well. The only problem I have with this DVD player is that since I hooked it to my home theatre receiver and it is placed right next to the receiver, when it get hot after playing for a couple of hours, the DVD player starts to pause by itself. It is annoying. However, I move it to a different shelf away from the receiver, it plays fine.",
        "This DVD player is undoubtedly the best value for money, especially if you have DivX or Xvid movies, it plays them crystal clear with no lag. It plays any kind of DVD-R+R-RW+RW you can throw into it. The menu is simple to use , the LCD display is not as fancy as some of the other 80$+ dvd players, but then again, this is a $50 player. It does a great job at progressive scan with up to 8x fr and ff. I have bought this as a gift for a couple of my friends and they have loved it as much.",
        "Purchased thru Amazon.com and thru the Electric Company store, this unit has worked fine and does indeed play all regions with excellant picture quality. You don't just plug it in and go , you have to go thru the set up key on the remote and set the unit as you want it to play(screensize,format,language,etc) It looked intimidating at first, but a little trial and error had it up and doing what I wanted in about 30 minutes. I'd buy it again,and the Electric Company store did a fine job in setting it to play all regions of DVD.",
        "The DVD player arrived promptly. The price and shipping charges were quite reasonable. In terms of functionality, it is easy to use and the quality of the picture and sound are excellent. I have only used rented DVDs thus far, so I can not speak of other formats. On rare occassion, it will get hung up on a DVD and one needs to unplug it and re-plug it in to get the DVD to eject. But after this it has always worked. I have only had it for a couple of months, so I can not speak about how long it will last.",
        "I liked this DVD player so much that I purchased a second one the next month. The size is trim and fits great with the television. The DVD's play fantastic! The only thing I wish the player had was a open and close on the remote controll. I have to push the button on the DVD player to open to place DVD inside player and push the botton to close it. Then again to open it to remove the DVD. It would be a perfect DVD player if it all worked from the DVD player's remote controll.",
        "The fact that you can play DivX movies with no trouble makes this player worthwhile. The picture isn't perfect (black crunch, for instance) but it's better than watching DivX on your laptop. However, the user interface sucks. It sucks it sucks it sucks, no two ways around it. I keep hoping that with each new release of the firmware it will improve, but no. Still, for the money this is a no-brainer: if you think you need DivX playback then buy it.",
        "I purchased this unit from North Star Electronics through Amazon. I had a problem with the first unit freezing up to the point where I had to unplug the unit to get it to power off. I called North Star and they gave me the RMA #, no hassle or fuss. The second unit they sent works flawlessly. Nothing additional needed! Plays PAL movies, NTSC movies and DivX files perfectly. I have DVD's from US, UK, and even Australia (Region 4 I believe) and everything plays without problems.",
        "Garbage Like the other negative reviews here .the sucker didn't last more than 4 to 6 months then all the sudden it started to freeze 1st I thought it was a heat issue but it wasn't I also update the firmware still no help. No matter what kind of media or even retail movies I used still no help. AVOID AT ANY COST .Philips 3 months warranty only means the player is build to last between 6 to 8 months only .try the Pioneer Divx player (...)",
        "For someone who averages only a 50-50 success ratio when taping a TV program on my VCR after many years of using the device, this is the ideal product. I bought it based on the reviews and optimistically ordered 2 Region 2 DVDs to try out on it. I hooked it up and within minutes, Voila! It worked immediately. Ignore the manual instructions on setting up regions (it's been altered from the original product), just hook up and play. I've already ordered 20 UK DVDs!",
        "My previous DVD player by JVC was too darn fussy, constantly refusing to read DVDs I had ordered from NEtflix, even after I cleaned them. I ordered this player after reading the reviews that \"it'll take anything you throw at it.\" And indeed it does. I've taken DVDs that my laptop couldn't play, popped them in here and they immediately loaded with no problems. So easy to use that this is also the model I chose when my 84 year old, non-tech-savvy Mother wanted a DVD player for Christmas.",
        "This DVD Player is the best! Whatever I have thrown at it, it plays. When burning a disc, burn it as a cd rom (iso) or a DVD rom (UDF) and it will play almost any format (Xvid, Divx, VCD, SVCD) This is a perfect player for someone that downloads (legally, of course) different formats, and does not want to convert these formats into something that will play in your DVD player. The Remote is pretty lame, but that is the only complaint. Highly recommeded. Get them while they are still available.",
        "I ordered a the DVP642 DivX player as an x-mas present from Amazon. However, I had to return the unit because of technical problems. When playing DVDs, the color was unstable. It was constanty shifting between normal color tones and colors that heavily emphasized the red tones. It was no fun watching a movie. We tried the player with several TVs and several DVDs. To no avail. The DVDs played fine on my old player. I like to complement Amazon for its extended return period over the holiday season. The box was not opened until x-mas, and I would not have been able to return the player under Amazon's standard return policy. Thank you, Amazon",
        "I have really enjoyed using my Multi-Region DVD player. It works just as advertised. If I had any complaint on this product, it would only be the very minor issue that the lettering on the remote control is very small, so when I am hunting for a special function that I don't often use, I need to look a little more for it. Then again, the problem may be my aging eyes and dim lights in the room. Otherwise it is a great machine.",
        "I bought the DVP642 because I wanted to be able to play Divx movies as well as having good progressive output. While the system works as advertised with Divx files, other flaws hurt this device. There is a noticable clicking noise whenever a disc is playing. This comes from the drive tray itself, not the audio output. The remote lacks discrete on/off buttons which makes it harder to integrate into a home theatre environment. To switch from progressive mode to regular output, you have to go through a series of menus. Finally, the picture from the system is not very good, comparable to $30-40 units. In all, unless you MUST have Divx, give the Philips DVP642 a pass.",
        "I purchased some DVD's from the UK for a Christmas gift for my husband. Turned out none of our other 4 DVD players would play European DVD's. My husband found this player, so we took a chance. After reading some previous reviews, I was skeptical. However, we plugged it in, put in the DVD, and it played beautifully. Also plays our kids' Disney DVD's. Happy so far, and will be even happier if the player lasts a few years!",
        "Not only can this thing play every possible format, except for those movies encoded with B-frames and Q-Pels, it's incredibly cheap too! Run, don't walk, to your nearest computer to order one from Amazon! Only problem encountered so far is that sometimes I get psychedelic coloring on playback of certain movies; I suspect it's due to using the supplied composite cable, and not a nicer S-video or component cable.",
        "I bought 2 from Amazon in 2004 at $65 each. One died just before the 1-year warranty expired. Philips sent another free of charge and I didn't even have to send them the old one. When I got the replacement, I put it in storage. Shortly after the 1-year warranty on the second unit expired, it went dead as well. I pulled the replacement out of storage and put it into service only to have it quit after a couple of months. Bought 2 in 2004 and by December 2005 I had no working 642s. Brings shame to the Philips name brand.",
        "I needed a DVD player for my husband to play his region... (erm, whatever isn't mainstream in the US, as he's from Europe) DVD's on. This didn't come programmed to play all regions, but, someone posted the coding to enable it and we were able to follow the simple instructions and get it working with little trouble. The sleek styles makes me happy, and the capabilities make my husband and son happy. :-)",
        "the media i've played on cd-rw's has all worked perfectly without any out of sync audio as can expected from a world with too many codec revisions. however, picture clarity on commercial dvd's just doesn't seem as clean and crisp as my much older, more expensive player this was meant to replace. for the price i'd recommend this player over any $200 video device meant to stream your video files to your home entertainment center. time spent burning cd's or dvd's is much less of a hassle than a constantly running backend program on a host pc.",
        "I love this DVD player. I bought my first DVD player in 97 and have gone through many players for 10 times the price. This player is the only DVD player I have purchased with so much functionality (and its so cheap). Recently I've been enjoying PAL format movies and this player really handles them well. For region free playing. Open the tray and press on your remote 7 8 9 ok 0. Now you are region free as well. Enjoy",
        "Purchased this DVD to be able to play DVD's from the UK. \"Little Britain\", \"Only Fools and Horses\", and \"Gimme, Gimme, Gimme\" all coded for Region 2 play as they should. The reverse button does not seem to work, but I have not really taken a lot of time to learn all the functions of the remote. Only just used it, so I will report back with any problems found.**Update 5/31/05--Still no problems to report! Working out well**Update 2/10/06--Still no problems and music CD's play quite nicely with this product as well.",
        "I was worried about some of the mp3 and video playing capabilities of this player. According to some specs it only plays bit rates in powers of two (64, 128, 256) and only played VBR up to 160 kbps. But this just isn't true. It played my mp3s that were 192 kbps VBR, 160 kbps VBR, 160 kbps fixed bit rate, and 128 kbps fixed bit rate. It also played my short .mpg videos that my sony digital camera can record without any problems. Was able to play a movie that our previous player couldn't. This is a great buy.",
        "Found player by searching [...] and rated pretty good. Was disappointed at first because remote did not have an eject button and couldn't figure out how to show the playing time. Discovered that you had to hold down the stop button for eject/close. Time can be set using arrow buttons when Time highlighted. Seems to play most everything you throw at it. Rated for DivX but haven't tried that. For $62 can't be beat.",
        "Was looking for DVD player with Divx cability. After reading several reviews on different DVD players with Divx, I chose this for its reliability and dependability...and price. I am absolutely satisfied. As it is advertised: it \"plays everything you throw at it.\" I was so impressed, I ordered another within a week of receiving the first. Go for it!!! By the way, not ALL Phillips players are equal. Read the reviews. This is the model to get.",
        "I wasnt expecting a lot from an inexpensive DVD player, but I was expected more when it says that it is 'certified to play Divx movies.' If that is your reason for buying this player, I suggest looking elsewhere. Some divx files would play fine for a while and then freeze the player. Others wouldnt play at all. I realise some audio codecs aren't supported in these players and I confirmed that wasnt the issue here. All of these divx files played just fine on my PC so something isnt right with the Divx implementation on this player. Buyer beware.",
        "I'm nowhere near the expert some of you appear to be with all these divx talk, although I will look into it now that I own this machine. I bought it for only ONe purpose: to watch non-US encoded DVDs. I found a hack online and was able to watch my foreign movies right away. It's sleek and the remote isn't that a pain to use... 4 because 5 means perfection and what product out there is perfect?",
        "I needed a player specifically for Divx and MPG video, and this fits the bill perfectly - and at low cost. It offers a full choice of A/V outputs: Composite, Component and S-video for the picture, and Composite, Coaxial and Optical for the sound. The remote is somewhat small for clumsy fingers like mine, but no complaints, otherwise. And of course, it also plays regular DVDs and CDs.",
        "This is a great DVD at a great price. It was highly rated by Consumer Reports and we love it. It's slim and lightweight, so easy to fit into your components. The picture and playing capabilities are awesome and it even has a mute button that works with our stereo. This was much cheaper than other comparably rated products--a great value--we bought 2, 1 for the living room and 1 for the bedroom.",
        "This DVD player will play almost anything you put in it. PAL, NTSC, SECAM, I believe it's only output is NTSC however, so you'll need an American TV. It will not play the following: Quicktime movies or DVD Rom slide shows. So, for example, you can burn a CD with pictures on it and it will play a slide show of them, however, if you do the same with a DVD Rom, it will do nothing. Hope this helps.",
        "We received ours at the beginning of december. It worked fine until the beginning of april until it died. Totally dead in only 4 MONTHS. Contacted Philips and their best offer is we pay to ship the broken one back and an extra $30+ and we can receive a refurbished replacement. We paid more for the name expecting it to outlast our cheapo Apex that lasted 3+ YEARS. Too bad we didn't get what we paid for. Now we'll just apply that \"replacement cost\" towards a (hopefully) better brand.",
        "I was very impressed with this DIVX DVD player. For the price, it just can't be beat! Works great! I would have given it a 5 star rating except for the following: you can only fast forward at a max speed of 8x and it does not have component in/out. On the other hand, it is very easy to make this player region free. (Do a google search to find out how.)",
        "Like everyone is saying, the Philips DVP642 plays everything I put in it with ease, although it took me a bit to get it set up properly. Like they say, set it and forget it!! I use an S-Video cable and a 6 channel receiver with an optical cable so the picture and surround sound are perfect too. If you burn your own discs, this is the only way to go...my $300 Sony can't touch this unit. And, as always, Amazon delivered very promptly!!",
        "I bought this DVD player a couple of years ago for my daughter who is in college. She has carried this back and forth from home to school several times and it still works great. I also bought one for home and it also is still working great after 2 years. I'm now buying one for my son, who will be going away to college in the fall. You can't beat this DVD player for the money.",
        "You must google a reprogramming step to make this dvd player work for regions other than 1 (US,Mexico,Canada-french). The step is easy, but since I have done the step, some US dvds get stuck on the FBI pirating warning. It's a pain, but I scene select past scene 1 and review back to the start. This only happens once in a while. I expected the player to be region free out of the box. It was not. Customer service is no help, they refer you to the paperwork in the manual where it says only region 1 dvds will work. The internet has sources which give you a code to program your dvd player to specific regions or region free.",
        "I couldnt play some PAL DVD-R from India on my pc or using my old DVD player. I buy DVP642 after reading about its multiformat support and DivX capability. This player played the DVD-R from India without a hitch. It could play all my DivX movies without a problem off of CD-R as well. Extremely satisfied with my purchase. Cons: The only thing I dont like about DVP642 is the remote. The buttons are confiugred so counter intuitively that I always seem to be pressing the wrong buttons.",
        "I have bought three of these. Two that I have used for well over 3 years, hundreds of movies, various formats, reliably. The other two I bought? One for the bedroom (to view my PAL formats) and one to my MOTHER from Germany so she could watch her imported films. Not HD, does not play WMA, but otherwise it has been playing anything I put in there. Cheap, reliable, versatile.",
        "This unit is everything it was advertised to be at a very reasonable price. The ability to make this unit Region Free can't be overstated. On-line the directions to accomplish this are simple. It allows you to view movies that aren't available in this country. So far, I haven't found anything this unit wont play. Definately a great buy.",
        "I received this DVD player today, hooked it up and tried regular DVDs as well as DivX formated movies. It worked just fine and setting it up is just as simple as it can be. Even changing the country code to zero was as easy as described in some of the reviews. I didn't give a five since I just started using it. If it lasts more than a year I will give it a five.",
        "Well, what others have said is true. I bought this to be able to play non-region-1 disks and it works with utter simplicity. As far as DVD players go generally, this one doesn't have a lot of useful features, the display is lacking and I don't know how long it will last but for $49 it gave me precisely what I needed and does it well. An extra bonus that this one does over the one it is replacing is being able to read mp3 DVDs. Days of music on one disk. Nice!",
        "I bought this player 2 weeks ago. It's one heck of a deal for the price the picture is great and the unit is slim and it will fit anywhere. I've owned about 4 DVD players and I really like this one. It's great because I download movies and clips from internet and I can burn .mpeg, .avi and DIVX formatted movies to a CD and watch them on this player. My friends are going to buy this unit also because they like the sleek looks of the player and also all it's features. I'd HIGHLY RECOMMEND buying this DVD unit.",
        "This device is the single worst bit of electronic crap I've ever bought. Like MANY others, who detail their experiences both here and elsewhere on the web, I have had the experience of having my Philips DVP642 DVD player just flat out DIE, and in less than 8 months. Their customer support is rude and shabby, and rather than spending $40+ on their replacement plan to get another of these pieces of junk, which would likely just die a few months hence as well, I'm going to go buy a different model from another manufacturer. Philips will never darken my door with their cheap garbage again.",
        "This has all good features that a good dvd player should have.. it also plays DIVX files that is a plus.. but it is very slow.. going back to menu while playing movie or traversing the menu is extremely slow... sometimes it just takes forever... Plays a normal DVD movie okay.. not too bad.. Its good buy if you have patience for its slowness..",
        "I ordered this new from Amazon in March 2007. I used it probably about 3 hours per week, maximum. In November I was playing a DVD and the unit stopped playing mid-movie. I eventually got the unit to respond to the 'eject' button - and the tray opened out without the DVD. I took the unit apart to retrieve the DVD, and of course haven't played it since. It's due to go to the recycling center. While it WAS working, all the functions seemed fine. However a big big negative is that there is no eject button on the remote.",
        "This machine has worked faithfully in a number of environments and traveled well. My only real complaint is the the aiming of the remote must be more precise than i am used to. I haven't yet read the manual so can't get the display to give me elapsed/remaining play time, but am assuming that it is my ignorance, not the machine's programming.",
        "I can download divx movies and fit like 5 on a dvd and watch all of them on this player. There are very few video files that dont play (if its avi it depends on the codec but most ppl are smart enough to use divx so its all good). Ive never had any problems with the harware so I bought one for everyone in my family (all of them love it).",
        "This is a decent DVD player, especially for what I paid ($42.99). In several hours of use it hasn't frozen up or presented any problems whatsoever. The remote comes with batteries, but it does NOT have an eject/load disc button on the remote, and does NOT come with an s-video cable. This is perfectly resonable as a second DVD player on a secondary TV, perhaps for the bedroom or guest room.",
        "This is absolutely awesome! I've had the non region free model for almost 2 years now and this one for almost a year, they are both still working fine. Divx formats that wont even play on my computer will play on this just fine. It's awesome for slideshows, mpg's whatever. This unit ROCKS! Especially for the price!",
        "There is probably nothing left to say about this wonderful device so here is an extra piece of info you might find useful: When playing Divx disks you might find that the image looks horribly garbled. To fix this, press the System Menu twice. I can't offer an explanation as to why it works. But it works.",
        "This has been a great little DVD player for years and years in our family. It's starting to act up a bit now, but may be needing just a good cleaning:) I have always loved Philips brand and this one too was great quality!",
        "Player works great with all Divx formats I have tried so far. Easy to setup and plays all region encoded DVD's that I have tried. Only problem is that if you a a lot of episodes of TV showes in Divx format, you have to label the single digit episodes 01, 02, 03 etc instead of 1,2,3 otherwise it will put them in the wrong order.",
        "This is one of the best purchases I've made here. Yeah, it doesn't have tons of bells and whistles, but look at the price. What I love about it is that it'll play anything I stick in it. I think it would play a rock if I could jam it in there. VCDs, SVCDs, DivX, MP3s, DVD+/-Rs. I haven't been able to stump it yet. And the picture and sound quality are first rate IMHO.",
        "This DVD was one of the best purchases I ever made. At the time there wasn't many options for watching burned disks on your tv. This DVD supported just about any format out there, and still runs today. If you still burn to disk, and want a low budget option, this is for you.",
        "This player has the most bang for the buck. Unlike many no name brand \"Made in China \" players this one works. The remote is not that bad either. Just hold down the stop button for 3 seconds and the tray will eject the disk. You have to press the stop button anyway when the movie ends. And with the Amazon full refund policy through January how can you go wrong? Grab one while you can. They won't be around long.",
        "Just a short note: where have you (the DVD player) been all my life...! I don't understand the logic of the film industry by not allowing one to watch movies from other regions. Now that I can, I buy local movies from England, France, Holland Sweden and Denmark - which I can see on my regular American TV set. My friends can send me DVDs as a gift, etc. One more happy consumer.",
        "I ordered this DVD player because the price was right. Unfortunately, it malfunctioned and I had to ask the mfg. to replace it. The great thing is Phillips stood by their product and replaced it. The second product works like a charm. I've had no problems since and it's been almost a year. Very easy to use, nothing fancy.",
        "I bought this in the vain hope that my MST3K avi's would finally be seen on my TV. (This is not an HDTV or any such unfortunately) I had it set up in minutes and it plays everything - better than my computer! My Kodak pics look great and I haven't played any mp3's, but I will try. Yes, so far on some of the avi's it looks blocky and the colors run, but there are no hang up's and I have seen some tips on other reviews to help me with my little difficulties. Altogether happy with it.",
        "The original reason to buy this DVD player is to watch DVDs from China. After conversion to a region free player, I can watch almost all of DVDs from China even with high compression (one disk holds 20 1-hour shows). A few of them have problems but I believe those are bad DVDs. Although the picture is not as sharp as one from Sony that is at about same price, I am satisfied with the product for the value.",
        "I've had the DVD player for several months and it works great. It plays all DVDs, including DVD+R and DVD-R. I especially enjoy being able to watch AVI files on it. This Philips replaces my old Sony which was having issues playing all DVDs. Like everyone else, I really like being able to play any DVD and so many formats.",
        "I have used the unit for 2 weeks. I love the picture (component connection) and I love the sound (optical connection). I was very frustrated because REWIND AND FAST FORWARD functions are NOT OBVIOUS ON THE REMOTE AND NOT PRESENT ON THE MACHINE. I was getting ready to throw it away when I reread page 21 of the manual and realized the non standard up and down arrows are used to rewind and fast forward.",
        "This DVD+DIVX+XVID player is still being used for every PC movie I make. I watch photos, listen to my self-made DVD+MP3 (you get around 50 hours of music on each) ... It plays even recent-encodings of DIVX. I have always recommended only one DVD player to EVERYONE ... and this is the one!",
        "My daughter broke the remote on her old DVD player and I went online to order a new one. When I looked on Amazon, I found that I could buy her a whole new DVD player with remote for about what a new remote control would cost. We are very pleased with this DVD player. Slim and easy to use.",
        "My mother's DVD player broke and considering she uses it once in a blue moon, I decided to purchase this one. The picture quality is good enough for someone who has no HDTV and the sound quality is equally good. The unit has component, S-Video, and typical AV connections to fit most TV models. A great value for the price.",
        "I bought this player in November 2005 and it stopped working a few days ago. I called Philips customer service and they informed me that it is beyond the warranty period and there's nothing I can do. I expected a $60 DVD player to last more than a year. My next one won't be made by Philips.",
        "I got this dvd player 2 weeks ago and I like it. It played all movies I had on my PC. Good: - small and nicely designed - plays a lot of formats - a lot of outputs (optical/digital/composite/s-video/...) - read a lot of DVD formats including DVD-R/RW - low price Bad: - doesn't show remaining time for .avi - doesn't allow to jump to the particular time for .avi - missing network card to play movies from PC. Would be nice to have it for this price. :) I would recommend it for everybody.",
        "I bought this in 2005, and it is still one of the most feature rich player today - a good buy even at the originaly price! I just wish this had H.264 support and better anamorphic conversion, if you try to play anamorphic AVIs, you will get it letterboxed - still not a big show stopper.",
        "i was concerned about buying a second-rate brand like Philips, but the price and features were right. My fears proved well founded: this unit failed after 2 weeks of use. It will freeze up and then will not respond to remote control or input on the front panel. In order to open the drawer the unit must be UNPLUGGED!!(and re-pluged, of course). Philips quality is sub-par in the future I will only BUY A JAPANESE BRAND.",
        "As with many of the Philips players it can be made region free, essential if you've discs from multiple countries you don't want to / shouldn't have to repurchase.",
        "Although I liked the DVD player while it was alive, it broke after only 9 months. When I called Philips, they said the \"warranty\" had expired, and it would cost me $15 to get phone support, not to mention the cost to get it fixed. It's totally unethical for a company to design a player that breaks after only 9 months and then refuses to fix it. Buyers of Philips' products beware.",
        "Wow, what can I say? This sucker plays just about anything you throw at it. Not only that, it is not picky at all. It plays DVD, dvd-r, CD-R, cd-rw, MP3, JPEG, MPEG4, etc..... The price is right. It is slim. Now the con: The remote is poorly layout. Picture and sound quality is good, but not great. Switching from s-video to component or vise versa is via menu, a pain in the a$$. The final word: For the $70 I paid, it kicks a$$.",
        "This player delivers on all of its promises, playing every format i have thrown at it, including PAL dvd's , which were a pain for us earlier. The player is also very light and doesnt take much space, and has all the outputs i could care for. The only issues i have with this player: - very limited status display on the player, makes it difficult to know what is it doing. - the remote control button layout can be better, i find it somewhat confusing.",
        "After 10 years this unit is still going strong. I use it to play video through a projector that projects a 106\" diagonal screen size and it looks good. Plays quite a few different formats and have had no problems with it.",
        "I just purchased this in order to work with PAL region dvds. It is less than 2 weeks old and has been used maybe 6 times and has stopped working. Every time I put in a dvd it sends back the message 'no disc'. I see from the reviews I am not the only person this has happened to. I feel like I just threw away $60.00. I strongly recommend spending a little extra money for better quality.",
        "We were looking for a multi region DVD player at a reasonable price. Although it does not state this is multi regional, just google it and you will find websites that give you the code to make it region free. It is a great player. Looks good, works well, everything you could wish for in a DVD player plus ou can play any region. Great value for money",
        "We have had this for about four months. In those four months we have used it many times. From all the DVD's we have watched, only one had a problem playing in this DVD player, and I dont think it was the palyer's fault. The DVD was not in very good condition. It is a major improvement to the one in our TV, and all the others we had. It is sleek and looks really nice. Sometimes we can hear a whirr, but that is no biggy. It is very nice.",
        "Amazon lists two (new) DVP642 models at slightly different prices. THIS one is NOT region-free, nor can its settings be reset by a code keyed from the remote, even though the label on the back says \"DVP642/37\" - exactly the same as the model for $64.99. Amazon should make this clear. Buy the OTHER one.",
        "I can't get it to work on all discs. Don't know why...",
        "At the time of buying this, i had a lot of xvid movies and i needed a way to play them, %99 of them played fine from CD/DVD on this player.",
        "PC's and xbox connectivity to windows media make this thing useless and philips reliability is abismal. Every product I own from them has failed or been a letdown."
    ]
}