{
    "entity": "DVD Players",
    "text": [
        "I bought this because I have several used DVD's that my cheap player from walmart couldn't read. The discs looked fine not worth buying new ones and I attempted disc repair devices. Only thing I am disappointed is it doesn't disc repeat on on DVD's.",
        "This replaced an aged Sony DVD player which lacked DVD-R or MP-3 playback. Got this at an attractive price and even got free shipping. Performs quite well although navigating the on screen is a tad less intuitive than on the older model. It also takes a bit loinger to detect the disc type, perhaps essential to good playback. No 5.1 analog connections as I had before, just optical so until I can get the correct optical cable (didn't need this before) I cannot take advantage of the built-in DTS capabilities. Nevertheless, I can recommend this wholeheartedly! If you burn any of your own discs, this will keep you happy!",
        "the Sony DVP-575P is a great player.I bought my 1st.one on 9/4/04 and it still plays great today.It's a real workhorse,never had a problem with it.Now,i've bought a 2nd. one. I like the fact that it doesn't have HDMI output so as to avoid handshake issues which happen all to often on many other players.",
        "I like the product but it didn’t come with a remote so now I have to find one that it pairs with.",
        "If I had known that a remote did not come with this dvd player I would have never bought it.",
        "The player worked well for two weeks and then discs began to stall and skip. Repeated cleaning of the player and discs did not work. The picture quality on the Sony is below average when compared with the replacement. There were high levels of pixelation on my 27 inch TV even with RCA cables. For this price range, I recommend the Philips DVP642 which I bought to replace the Sony. I love my Sony TV and VCR, but I would recommend against their DVD players until they get their manufacturing processes in order.",
        "Bought this brand new from Amazon for around $79 in September 2004. Watched many movies with no problems. Then January 2006, just stopped playing DVD's. VCR's seemed to last forever, these DVD players seem to last a year or so. I've been through 2 Toshiba's, a Panasonic and now a Sony. There's gotta be a DVD player that lasts more than 2 years somewhere.",
        "It makes sound resembling that of a 'disc rotation' as the movie is played. Response is slow; not at all a good dvd player to have. Do not get fooled by the cheap price,",
        "I had the exact same problem as Dan Romig (see below), and at about the same time. Bought it in July, everything fine till New Years, now it \"Cannot Play Disc,\" no matter which disc I put in. On to another brand!",
        "I bought this back in 2004, it's now 2015 and it has stopped playing all discs without any warning. This has been a wonderful player for me, I'm very sad that I have to buy a replacement. Cosmetically, I love that it's silver - I also have the Sony home theater system that is also silver and works flawlessly with the DVD player. My fear is that I will also need to get a new surround sound :( thanks, Sony for 11 years of stellar performance",
        "I have bought a lot of Sony stuff over the years. Stereo equipment, phones, computer equipment, everything. It was always high quality and very reliable. I was definitly a die-hard \"sony only\" person. Lately, it seems like they've been cutting corners and this DVD player falls into that category. It seems to play DVDs fine (at least for now), but regular CD playback is static-ridden. I tested the same setup using a 10-year old sony CD player and it played beautifully. Returned the unit and got a new one-- same problem. Sony just doesnt' have the magic anymore!",
        "I used this solely as a cd player because it is very thin and takes up little space on top of the receiver. I didn't love it while it worked, it took too long to turn on and to eject a cd, sort of slow moving. But the sound was fine and really for the price it was ok. But after 3 1/2 years it just one day stopped turning on. I had to break the cover to get the cd out because it only ejects when it has electricity. So I will look for something new, not Sony, to see if something else holds up better.",
        "I used to own this model of Sony DVD player. It played DVD's and CD's well for about two to three years and gave out. I replaced it with another Sony DVD player which lasted a little under two years. I like Sony products, but I was disappointed to see it last such a short amount of time. I also have a Panasonic DVD player which has outlasted both Sony DVD players. Just make sure you fill out the warranty in case anything goes wrong. It worked really well when it worked. So Good Luck!",
        "I use component video on this DVD player and my matching 24\" Sony WEGA. The quality is superb and looks better than the movies in the theaters in the 80s and 90s. I haven't experienced the DVD+RW problems or the 16:9 problems that others have had on this model--the latter perhaps beacause I have a matching TV. For the money this is a great value. It's also very short and doesn't take up a whole lot of room--fits nicely underneath a VCR.",
        "Probably the best low priced player on the market now. It plays all burned DVD's flawlessly. It also played all my mp3 and jpg CD-R's I made years ago. Great sound quality. If you own one of the older Sony players from the late 90's you will notice a dramatic increase in picture quality. ***UPDATE 2/9/05*** Looks like this player went to crap after 6 months! Movies keep stuttering and pausing during playback. The picture was great but it looks like the design and engineering of the electronics are crap. I change my rating to 1 star.",
        "I received this dvd player as a gift in 2007 for my 17th birthday and I have loved it since then. It has great picture quality and sound quality. I babied the hell out of this thing and I've never had a problem with it until now. Recently I turned it on to watch a movie and within 2 minutes of being on, it shut itself off. I repeated turning it on and it continued to turn off, but I cant really complain because I've had it for SEVEN years. I wasn't planning on keeping this dvd player for very long but I ended loving it.",
        "This player does everthing a basic DVD player needs to do with respect to playing movies. Great. However, the lack of an optical out is a bummer when hooking up the system to a nice receiver. If I burn a party mix on MP3 and want to play it, the player has no options for random or shuffle (it does on regualar CDs, but not MP3). It seems like a very simple feature to add. Nonetheless, it is a quality DVD player, I'll just have to purchase something else to play my music.",
        "I bought a Sony DVP-NS575P today to replace my old Sony DVD player. It is an entry-level progressive scan DVD player and I would otherwise recommend it as a nice, easy-to-use unit except for the quality of the picture. Perhaps I just got a bad one, but the picture simply doesn't have enough contrast. Everything looks dim no matter how I adjust my television. The picture also shows lots of digital artifacts (flickering, etc.) that I find annoying. The old player and the current VCR don't have these problems, so I know it isn't my TV. Needless to say, I cannot recommend this DVD player and I will be returning mine.",
        "first the jvc vcr, next the daewoo tv, now it's the sony dvd. my luck is simply amazing. i actually got this one on accident. i told my mom to buy me the cyberhome compact dvd player, but she got me this. don't really know why since it costs almost twice the price. it works great. the \"traditional\" sony remote is very workwell. the power button on the front is hard to press, but i don't use the buttons on the face of anything. with my luck as good as this, what's next?",
        "This player is complete trash. It lasted only three years before its main chip begins overheating and shutting down the player. Sony wants me to buy a new one???? Rubbish. I paid almost eighty USD us dollars at Best Buy for this trash and they expect me to pay them more? Whatever happend to good craftsmanship? Are they not have no pride in their products? Sony has lost me as a customer. I will not pay Sony anything anymore. Sony, you owe me.",
        "This player DOES NOT PLAY everything you throw at it as some have claimed. For example, it's very picky about media files, takes a long time to read or doesn't play them at all. There is no support for firmware updates either and only accepts Region 1. Despite the clean picture, it's going back to the store in trade for the Philips DVP-642 I picked up also. I hate limitations, and I got to say that the Philips DOES PLAY everything you throw at it. Sony is a quality product, but they got to get on the ball.",
        "I have owned this DVD player for 4 years and most of the DVDs I played on this device worked great. No skipping or other annoyance. However, after 4 years, the device is starting to skip a little during movies, and most recently could not play 2 minutes worth of video without stopping the video/audio. While the video/audio is paused, it sounds like the device is trying to read the DVD. I played the same DVD on my computer, and there were no problems at all. So, time for a new device. This time it will not be a Sony.",
        "We've had this one for about a year now, I dont use it much but it hasnt givent me any problems. I was very surprised that it also runs data discs. But it's just a basic dvd player no bells and whistles, nothing special my favorite thing about it that is silver color matches with my vcr cable box and tv. It's a good machine.",
        "Bought this DVD player almost two years ago. Have never had any problems with it. We use it to play DVD's that we rent and are very satisfied with the picture quality and performance.",
        "I love Sony products; however this DVD player was a big disappointment. Broke after 6 months completely! It comes with 3 months warranty, so unless you are planning to replace your DVD player after 3 months, buy another brand!",
        "Fact is that this a very good dvd player for its reliability and money. It will play any dvd I throw at it; dvd-r/rw and dvd+r/rw as well of a bunch of my cdr's. I burn every dvd I rent from netflix and I still have not ran into any problems with this dvd player,and best of all its a SONY...",
        "I have this model 1 week ago and all I can say about this player is Awesome!!. I used to have a Panasonic RV32, I can't complain, it was an excellent dvd player, but technologies are always getting better things, so, now I can watch my pictures on tv besides the mp3 music. I compare the new Panasonic S35 with the Sony one, and Sony sounds very very clear, even if you don't have an amplifier or DTS or Dolby system, only using your own TV you can create a sorround enviroment. Good purchase.",
        "The good thing about this player is good sound quality,good clean picture but the bad thing is about every 4 hours the picture fades from light to dark for about 5 min.In order to fix this problem,just turn your tv and your player off for about 30 sec.Then u could get back to your movie,cd,etc.Sony is normaly a high-quality brand except for this player.i hope this review helps!",
        "This is my second Sony DVD player. I bought the first one two years ago, and it broke within two years. I bought the second one less than two months ago, and now this one is broken, exhibiting exactly the same malady. This is clearly a defective product. What's worse is that Sony is notorious for terrible customer service, so I'm probably out another $100. I can surely say that this will be the last piece of Sony equipment I ever waste my money on. If you want a quality DVD player, you should probably look elsewhere.",
        "This is a nice looking unit and I had a good experience with it for 15 months. A few days ago it died -- or rather everything's working except the DVD playbook. The same symptoms as Anthony L. Ellison and Don Romig report, see earlier reviews.",
        "The picture and sound on the DVD Player are top notch, you can't argue that, but the durability is horrible. Mine lasted only 6 months and now I get a buzzing noise from the audio. My (...) magnavox has lasted almost two years.",
        "This product is \"cheap\" and you get what you pay for in this case. Sony has made the product \"cheap\" enough to make having warranty service more expensive than buying another unit. Be aware that if you have problems you will probably be forced into buying a new unit. I will say that Sony customer support was great up until they gave me the bad news. Most support you would have to just assume your only option is to buy another unit!",
        "This unit worked for about 1 hour. Then the drive failed. It doesn't even spin up. It's the second Sony failure for me (the first was their slv-350 dvd/vcr combo, which failed within one week of purchase) I've previously owned two other Sony dvd players which worked well and a toshiba portable which also works fine. But if my recent experience is any indication, Sony had better start making some good movies, because their consumer electronics division is going right down the toilet.",
        "This product had great picture, almost no skips- but broke for no reason whatsoever after only six months of use. Definitely would not recommend and will not be getting another, despite the good qualities. Not dependable enough.",
        "Just like the majority of the reviews, mine died after a year of very little use. I doubt that it read 60 DVD's. It played everything I threw at it until it died. This player is ripe for a class action suit. This is worse than Sony's old \"Error 13\" problem. This is the last Sony product I will ever buy. The quality goes out before the name goes on. Welcome to the world of Communist China's electronics.",
        "Well we have had two of these same models in 2 years. Each of them quit working within a year. So we are looking for a different brand now. Good luck with this one. Worked well for a short time.",
        "I just got this DVD player a couple days ago after my older Sony DVD player died. So far the only issue I have is that this DVD player treats the discrete code for \"turn on\" as a power toggle, which interferes with my universal remote macros. Otherwise things are working great and the price was right.",
        "it's cheap. and support a progressive scan.but can't play super audio format... if you pay more (not much).",
        "do a google search on sony ch:13 and you'll find 54000+ hits on complaints about their players. Their customer servise denies the problem too. Buyer Beware!!!"
    ]
}