{
    "entity": "DVD Players",
    "text": [
        "Picture quality is a bit fuzzy. It’s definitely NOT up to today’s technological standards, however it does hold 400 of our DVDs! A plus when it comes to having to find and load a DVD. Convenience definitely outweighs quality here by far! PLEASE NOTE: If you appreciated this review please give it a “thumbs up/like” your helping me to continue to give honest/unbiased insight into products I’ve used and you may have questions about. Interested in a product but don't know enough about it and would like it reviewed? Please let me know and I'll see what I can do... Thank you 🙏",
        "Did not receive remote or AV cables or instructions for hooking up system help",
        "The unit had a door which stuck. I treated it with a tiny dose of silicon spray and it works fine now. The box the unit came in was rather battered but the unit appears to be fine so far. I have wanted one of these for some time so I am happy it works well. No complaints. GPS",
        "Unit was faulty. It did not work properly. The discs would stop and freeze up. Also the remote provided was for a different unit. It did not preform all the functions. I have owned several of these product. Iknow how it is suppose to work.",
        "Seems to work rather well. I was just looking for one place to watch/listen to my DVDs & CDs. Was hoping for a better/easier way to label discs. Quick action to get to discs as well",
        "We are pleased with how quickly this shipped. The product was exactly as described and we are happy.",
        "Looks the same, has similar connections (no HDMI.) Sorting is not as flexible--no alphabetical; no artist sorting. Looks and sounds the same.",
        "It works as expected. The setup is a little cumbersome at first because you may have to manually type in the DVD information, but after that, it works pretty darn good! Takes up much less space than a bookshelf. It's about the size of a stereo receiver.",
        "This is one fine machine that will play every disc i have any more! I had two of them in the past and, enjoy this one just as much! Thanks! Nancy",
        "I liked this player so much I bought another one. This player plays DVDs that were unplayable on my other players (Panasonic, Sony, RCA). I have never tried the disc explorer because other reviewers complain about it and I lose power occasionally. I use a spreadsheet as my DVD guide so I can sort by Title and have a great custom \"TV Guide\" including episode names on the TV show DVDs. I bought my first CX985V 6 months ago and I have had no problems so far.",
        "This is a great find since no one seems to make Players of this size any more. The product came in great condition; as described; and on time--in fact early. We were thrilled to find one at Buy4Less on line. There service is excellent.",
        "This unit has been around long enough to where this review shouldn't be actually needed. But just in case there are others like me that look for good deals on \"last years\" top electronics I am leaving this review. After using it and getting used to its features one can leave a better review. I like the features above my other sony 200 disk player. it is fast, and the menu's are easier to navigate. If you're wanting one of these, it's worth buying one. I rate it an absolute 100.",
        "Product arrived as per schedule. Although the product worked perfectly it suddenly stopped working and i still havent been able to fine the dvd it was playing.",
        "400 DVD Juke box, no putting in the CD, just turn on, select 1 of 400 of your personal favorites, enjoy.",
        "Great price fast shipping. I was very pleased when we got this set up. The only problem is we live in a dusty place and the discs don't stay clean. The player won't play that particular disc if it's dirty. But I just take it out and clean it. End of problem. If you have a large DVD collection. I would recommend this item",
        "It was just what I wanted. It works great, and it is easy to set it up ,and is easy use.",
        "For ot's time it was very nice, a bit outdated but works good. Everything it's surposed to be, so it was a good purchase.",
        "I LIKED THE OLDER MODEL BETTER. IT HAD THE ABILITY TOMAGNIFY THE PICTURES 3 TIMES FOR A MUCH BETTER VIEW.",
        "Didn't come with a remote but had an extra one but found out the eye remote on the machine did not work and that's the second one I purchased that the remote on the actual machine was messed up, which makes it virtually useless or harder to use when that doesn't work. I am in the process of seeing if it can be repaired",
        "Remote failed. Disk changer is finicky. All in all, you get what you pay for.",
        "Much thanks. The DVD player was as advertised. It was in very good shape externally and everthing has worked so far!",
        "I now own two units, this is more fun than a real hobby",
        "This CD/DVD player was a gift in 2004. It just recently, 13 years later, broke down. I was so distraught, not knowing what to do, since it had been broken for almost a year. One day I received divine inspiration. I sat down and opened up the machine to find that two stretched rubber bands was the cause of the problem. After replacing them and making sure the machine worked I put the back on and proceeded to use my CD/DVD player. It has made me so very happy, once again, to have my machine working and playing all of my favorite songs. A great buy!",
        "The biggest issue with this unit is that you must enter the DVD titles manually using the remote or by attaching a keyboard. After entering 400 DVD titles with your thumb the unit will forget them if it is unplugged or there is a power failure. So you must also buy a Uninteruptable power supply. I have had mine since 2004. Still works fine after 3 cross country moves. Mechanically great.",
        "BUYER BEWARE! I HAVE HAD TWO OF THESE OVER THE PAST TWO YEARS. BOTH WORKED FINE FOR 10 MONTHS AND THEN WENT INTO AN UNCONTROLLED MODE OF CHANGING FROM ONE DISC TO THE NEXT CONTINUOUSLY. THIS CAN HAPPEN WHEN YOU ARE NOT THERE TO TURN OFF THE UNIT RESULTING IN YOUR ENTIRE DVD COLLECTION BEING DESTROYED. THIS IS NOT COVERED BY YOUR HOMEOWNERS POLICY NOR SONY AS I CHECKED INTO THIS. THANKFULLY A MEMBER OF MY FAMILY WAS THERE BOTH TIMES TO UNPLUG THE UNIT BEFORE THE DVD'S WERE SCRATCHED BEYOND REPAIR. DO NOT BUY THIS UNIT!!!",
        "For all the good things one can say about the Sony DVP-CX985V, it does periodically eat up CDs. If you let the CDs play automatically, rather than selecting one and then selecting another, the player seems to get confused and tries to load two CDs at one-time, thereby jamming up the player and destroying your CDs.",
        "We bought the unit new from the Sony Store 8 years ago and when I went to program my new slingbox, the unit does not turn on anymore... DOA... Back in the day 8 years ago was top of the line, but being DOA after 8 years of moderate use (only played about 100 movies through the unit), the unit is useless.. However, I am now going to saving up to buy the replacement 400 Blue Ray unit....",
        "It's true. It's ALL true. Then menu is too slow like veryone says, but I decided to live with it do to the amount of discs it holds. But the unacceptable part is that this player has a defect that destroys discs! I have over 300 DVDs in mine and I've lost at least 1/3 of them to deep scratchs that occur INSIDE the player during use. When I say deep, I mean they came out with curled plastic hanging off the end of the grooved that was cut by the Sony demon. My advice is suffer with a changer that holds fewer discs. This one will only destroy your property!",
        "We are on our second one we liked the first one so much. Have used one for years and years. Will buy another when this one died. We use a printed list of our DVD’s",
        "I have purchased the earlier model which holds 300 discs from Amazon. I had picked this model as it can play both sides of the DVD. I burn my own DVDs and buy double sided DVDs. This player plays any type of media DVD,VCD,CD,MP3. Picture is good and this can be easliy upgraded to All Region player by buying a kit from internet. Disc selection is slow and I have made an Excel file for the quick review. THis way I do not have to go to the menu to look a t the disc. Overall not a bad player for the money. This upgraded model should have similar performance.",
        "I CANNOT BELIEVE NOBODY IS WRITING TO COMFIRM THAT THIS PLAYER WILL LEAVE GOUGES IN SOME OF YOUR DVD DISCS MAKING THEM UNPLAYABLE AND UNABLE TO COPY. I'VE OWNED THIS PLAYER FOR 2 YEARS AN ONLY RECENTLY SAW A REVIEW WARNING THIS MIGHT HAPPEN AND IT HAS. THE PLAYER WILL SAY DISC IS DIRTY AND AFTER CLEANING THE PLAYER STILL SAYS DISC DIRTY THEN ON INSPECTION YOU'LL SEE THESE HALF MOON SCRATCHES AROUND THE EDGE. PLEASE DO NOT PUT YOUR HOME MOVIES IN WITHOUT A BACK-UP COPY STORED!!!",
        "I really have no idea why some people think this unit is difficult to use. I have not had any problems whatsoever with operating it and feel the menus are quite easy to follow and navigate. As far as the disc skipping and gauges.....haven't encountered a problem there either. My suggestion would be to purchase a CD cleaner/repair kit and use it on DVD's prior to loading them. The picture quality is very good and the sound is crisp. I am using the optical digital output which IMO makes a huge difference. For the price of this player and the ability to catalogue 400 DVD's, I say go for it.",
        "I just pulled this player from my system. I finally got fed up with the semi-circular damage caused by the transport to many of my DVD's. I seems that the player allows the spinning disc loaded in the player to grind against the disc in the adjacent slot to the right in some cases. Not sure what the variables are but the damage can vary from light scratches to VERY deep gouges completely destroying some DVD's. I may experiment with the screw adjuustment mentioned in another review on this forum, but until I can trust the device I won't be using it or any others of the same model in my system again.",
        "The Sony DVP-CX985V disk player is pretty darn good for the price. There are a couple of things that bug me. 1st is the user menu. It needs to be more user intuitive. 2nd is the changing speed, if it was slightly faster and quieter it would be nicer. 3rd and most importantly, is that I wished it can upscale DVD video to 1080i component video output like the Zenith DVB318 DVD player. This feature alone would make this DVD player one of the most awesome DVD jukebox ever built. Can you hear me Sony?",
        "I got caught up in the television series box sets, to the point of needing one of these. I need another one now. Although a bit slow and time consuming to finish typing in the titles that the dvd player didn't recognize, still a good deal. And a great deal for the amount of dvds it holds. Enough that I now turned of my satellite dish subscription. The tiny buttons on the remote seem neccessary for the amount of things it needs to do. The folder button could be more comfortably located. Would love to find a 1000 disc dvd player now.. :D",
        "My older Sony equipments still work after 14 years. This one had been replaced in its first month, then a bit over a year later the same issue occurred. Anyone have instruction to replace the carousel and disk loader motors?",
        "I have been using this player for the last 6 months. I agree that the remote lag is noticable but eventually you get used to it. The pay off is accesing your entire collection without leaving your seat. The picture is incredible and the sound is the same. If you are in a hurry don't buy this unit. If you wan't to keep your DVD's in one place and veiw on demand then this is for you.",
        "I have had this for a while and can report is has given me no problems, and has worked great. It is nice to have all my movies in one place rather than all over the house I love this machine",
        "bought one, filled it, bought another... the remote takes some getting use to but now that I know where the buttons are that I need, it's fine... The disk explorer is useless. I use a spreadsheet, and just put them in by the number.",
        "Excellent quality picture and sound..but as echoed in other reviews...do a list (paper)...loaded about 240 dvd's recognized 31..one of which, the store bought movie(not a copy) \"Glory\" showed up as \"Full Tilt Boogie\" and because no overwrite capabilities we forever be know as such...no offence to any civil war vets out there...",
        "Just bought my second Sony 400 disc player because the first one is nearing capacity. Works great no problems. Other reviewers have not liked the disc explorer. It works very well for me. Plug in a computer keyboard and enter titles and a still picture from the movie, use the up and down buttons on the remote to scroll quickly through index. I like it.",
        "I've had this player since August and have had nothing but pleasure from it. It comes close to being as essential as my Tivo for me, and it wasn't even my idea to get it -- it was my husband who wanted this gadget. One caveat -- I almost never use the Sony menu system. We have a Harmony 688 remote so we use the Media button there to store and select our titles. Love it!",
        "perfect for holding and repeated viewing of various dvds.. no more swapping in and out... what a pain it is! great features... i love the search feature... fast forward and then release the button to continue playing....",
        "I bought two of these and both died withing four years. I would rate this less than 1-start, although, i have no choice."
    ]
}