{
    "entity": "Adjustable Wrenches",
    "text": [
        "Great wrench for the price. Well build, jaws slides easily when being adjusted but do not slide by themselves when you use the wrench. Will not tend to open up while being used leading to some striping on your pipes or faucets. Overall a great tool to have in your toolbox for minor plumbing repairs, won't compare to a high end stainless steel one or anything, but for $10 you will not regret this purchase.",
        "The tread that bites the metal to unlock got easily gave in",
        "I've really come around to Irwin hand tools in the past year. I'm a Maintenance Tech at a health care facility. I carry a Bucket Buddy with a group of select tools. The vast majority of them are now Irwin. This adjustable wrench has a great feel in your hand, doesn't bind up when adjusted tightly, smooth action while adjusting to proper size. I have NOT had it round off a bolt while using it but I'm generally not torquing on it a great deal. If a bolt is frozen I'd go grab a wrench set. All in all it's a great addition to my \"bucket!\"",
        "I bought this to be a trailside do-all tool that is capable of getting a 27mm axle nut off. It performs perfectly, but will not wind up in my carry pack as it is too darn heavy. Not a ding of the tool...and in fact, the 10.4 ounce estimate is wrong. Typically Amazon posts weights of the whole package, but the wrench alone weighs 13 ounces - it is meaty. I am not bummed at all, however, as it is the best medium sized cresent I have ever had. Very accurate dial and holds its position well.",
        "The adjusting screw and jaw alignment is very sloppy and will jam the adjusting screw easily. It's sloppier than the old worn one I was replacing it with. Not sure if this one wrench is indicative of the entire product line or I got a poorly assembled one, but at this price, it still isn't worth it. I will be putting it in the glove compartment of my vehicle and use it as an emergency tool...",
        "I've never had a bad experience with Irwin tools. This crescent is sturdy, precise, just the right size for my purposes, and has a nice comfortable grip. Highly recommended!",
        "Worked perfectly for what I needed it for. Unfortunately, I hung the wrench using the small hole at the bottom. This worked fine for a few days, but if given enough time/force, the wrench will slip out. All I have left now is the plastic grip and a hole.",
        "This is the best Crescent style wrench I have ever used. Even though it is adjustable, the grip is tight and will not wear sides of your bolts. Wish I had one these years ago. More expensive than most adjustables but will save you tons of money in not destroying your nuts and bolts with a loose grip. Very much recommended.",
        "This is by far the most deluxe wrench I've ever had. Heavy, smooth adjustment, comfortable grip. I was looking specifically for about this size, to be able to get the dispenser pump off a pre-filled commercial container of antibacterial soap.",
        "This is a substantial wrench made of smoothly finished heavy steel. The movement is smooth and the jaws have a measurement scale. The jaws are tight with no undesirable play. The handle is larger than most crescent wrenches which allows you to get a good grip. Will buy another for the car tool box.",
        "High Quality adjustable wrench. I have purchased the 12 inch, 10 inch, 8 inch and the 6 inch and they are all great. The jaw slides smoothly and effortlessly when adjusting it and once you have it to your desired size it keeps a good fit with little wobble. The markings along the jaw make it easy to have it set before you get started (Metric and English). Grips feel good and the wrench is sturdy. Another great addition to my collection of Irwin hand tools.",
        "So I needed a good wrench to help with installing a new shower head and this did the trick. It's sturdy, feels good in the hands and functions like how it is supposed to.",
        "I've never used a wrench before, and I only needed it to remove a showerhead, but it did the job i needed. I dont know anything about wrenches, but i liked using this one.",
        "I am not very good in fixing screws and nuts. Therefore I wanted something which is easy to use. But this did not serve my purpose and I was not able to adjust or fix the nuts.",
        "As with all Irwin VISE-GRIP tools, this is an exceptionally useful tool for around the house or working on a car. Rugged and dependable.",
        "Well built adjustable wrench, seems as though it will last a long time. Very happy with the quality at this price point.",
        "I like. Came studier than I expected. I think this will last the test of the time. Good grip and feels great to hold. Would recommend.",
        "Doesn’t have the ridges that help a wrench grab into a smoother surface. My fault for not researching it better",
        "should not be called a \" vice grip \" it is absolutely NOT a clamp device,, only a good cresent wrench",
        "Simple, effective, well made wrench. I use this for a kegerator tool to attach and detach the CO2 tank, and for tightening the tap handles. Works very well, and easy to use. Would recommend to anyone with simple to medium tasks. I haven't had the \"time test\", to determine if it's a long term wrench. Meaning, I don't know how strong the metal is and could see it wearing consistently, as I paid very little for it. However, I'm leaning more towards the Irwin name on this one and anticipate longevity.",
        "I love this wrench. Using it to build my new bike and torque all the nuts. The grip is tactile and the wrench itself is very sturdy. Definitely buying this brand in the future.",
        "Solid wrench with reasonably-tight tolerances. The handle is comfortable, but is a bit thick to slide into my tool organizer. Good wrench for the price.",
        "Item came as advertised but was dirty from lack of storage protection or shipment protection being a tool it's not that big of a deal but hate receiving a brand new item and it looking like it's used",
        "Opens to 1-1/8 inches. Basically, no play in jaws (compared to other adjustable wrenches I've owned). Seems high quality and precision made. Opening scale markings are SAE on one side, Metric on other (not that I've ever needed them). I carry this in my small portable toolkit instead of large assortment of fixed SAE/Metric wrenches. I copied the next sentence from same wrench in a combo pack. Obviously, it applies here as well (so Amazon should update this tool's listing info) ... Full Lifetime Guarantee - Each IRWIN hand tool is warranted to be free from defects in material and workmanship for the life of the tool under normal wear and tear, except for damage caused by misuse or alteration.",
        "Nice quality, very handy size, wide jaw openibg for an 8 inch adjustable wrench. Comfortable grip. Irwin tools are well made and designed. Bought this as a convenient, all purpose wrench for an \"inside the house\" tool kit for smaller projects/repairs. Works perfectly for that purpose.",
        "This is the perfect wrench for new DIYs. It's rubberized grip was gentle on hands but sturdy on job. Love it!",
        "Great C-Wrench. I have bought 2 already due to losing one at a job",
        "The only wrench you need because its adjustable. I prefer one very nice adjustable to a dozen cheapo fixed ones. The quality whas the level is expected.",
        "Really good C Wrench for anyone who is a stagehand and works in lighting.",
        "I work in the ac industry I use this about 1000 times a day no rust rubber grip for sturdiness",
        "Great, all-purpose wrench for household use. 8\" better than the smaller 6\"; fits in my large hand.",
        "Delivered on time. It is a great quality tool. I like that it has both measurements on the head. (In. Cm.) Comfortable handle and metal is not cheap.",
        "This wrench is comfortable to use and I like the measurement markings on the side. It makes getting the corresponding socket fairly easy.",
        "Don't have a whole bunch of tools, but know a good one when it's handled, and this one is well made. Good weight and precise adjustment with no wobble or jiggle.",
        "This is by far excellent high quality and beautiful looking hand Wrench For My Stagehand job.",
        "The wrench feels well made and is comfortable to work with. My only concern is a softer material that has already distorted around the jaws.",
        "I like this product very much. Right size for what I need it for and very handy.",
        "Item appeared used. had a lot of dirt and grime all over it",
        "A little thicker than I had hoped, but performs well. Very solid and well made.",
        "Finally a wrench that retains its position when I use it!!!! Great wrench, recommended!",
        "I love Irwin's quality. This is the nicest adjustable wrench I personally have ever used.",
        "You definitely get what you paid for. Poor quality, & No grip what so ever.",
        "cheaper tools, but it works well. but it made in china, so it still is a junk should made in taiwan or somewhere"
    ]
}