{
    "entity": "Adjustable Wrenches",
    "text": [
        "This is not a very good crescent-style wrench. The fit and finish is such that the lower jaw is wobbly and will never quite hold a precise adjustment. It's just made to sloppy tolerances, apparently. When I compare it to my more expensive, name-brand adjustable wrenches, the difference is obvious. More expensive wrenches will have a solid, smooth movement of the adjustable parts, resulting in tight, consistent jaw openings. That isn't how this wrench works, unfortunately. That isn't to say this is not a useful tool. I couldn't find a 4\" adjustable wrench anywhere else for anywhere close to the price.",
        "I've come to trust Tekton in recent years for good quality tools at low prices. I don't always want to invest big bucks in a tool I might only use a few times, but I really hate spending money on a tool that is so poorly made that it doesn't work well! Tekton has become my goto brand in those cases. This crescent wrench is a great example. The spiral adjustment mechanism turns easily but is not loose or sloppy. The tool is nicely finished with accurate inch and metric opening size rulers etched on the jaw. It worked great for my plumbing task, unlike the more expensive noname wrench I first bought for the job.",
        "Very good quality. Looks good (nice finish, parts fit well, adjuster works smoothly). Feels good (lots of heft, feels solid). Works good. This is the 15in version. I also purchased a 12in Crescent brand wrench at the same time. The Tekton looks and feels better. I bought the 12in for the name, and the 15in for the price, expecting that the 15in wouldn't get as much use as the 12. I guess I should have bought two Tektons instead, I keep reaching for the Tekton 15in even when the 12in is big enough.",
        "Adjustable portion of head very loose, when closed will move off to one side and misalign with fixed part of head. Looks like quality, but quality control let this glitch out the door. Instead of replacement, my request was refund. At 70 i have more money than time so will buy what i can touch/see first. Amazon refunded my money. The time spent trying to pick a quality product is forever lost.",
        "I'd give it a 0 if possible. Feel apart after 6 months barely even used it. The pin that holds in the adjustment knob fell out and I'd stick it back in to adjust but after I used it it'll slip back our again! That's what I get for being cheap. Stick to channeloc's since this was my second one I thought I'd give it a chance but as you can see it was 2 losses for me. Finally lost the pins and surrendered with this review. Don't like leaving bad reviews but 5 star rating should be quality not junk. Reviews are so misleading.",
        "I bought a pair of these (8 inch) for assembling/disassembling components of an airless paint sprayer. We're not talking spacecraft-level tolerances here so these wrenches work fine for that purpose. I'm not a diesel mechanic either so I'm not using pipe extensions to force stuck bolts with these, which I doubt would last long if treated that way. But for light/medium duty everyday use these are fine, as long as you realize that's what they're intended for.",
        "A good condition and very inexpensive adjustable wrench to add to the toolbox! I actually bought this to keep in my girlfriend’s car (in lieu of a whole socket set to save money) and it’s perfect for what we need. Some reviewers have mentioned that the jaws are loose, and I suppose a little, if you’re shaking it around a lot. But when used for its intended purpose I find the locking mechanism works great. We just switched out her car battery with this tool and nothing else!",
        "This is Seriously the best budget adjustable wrench on the market Hands-Down. I use this wrench everyday as a mechanic that works on suspension components that are stuck with years of rust i have put pipes and cheater bars on this wrench all the time and hit it with my 2.5lb sledgehammer and it has always gotten the job done. I've seen Snap-On and other name brands round fasteners and snap off with the kind of abuse only to lend them this wrench and see them succeed. Highly recommend to anyone looking for a good quality crescent wrench. 10/10 I had to buy another one because it was just that tough.",
        "In retrospect I don’t know what I expect for a 4 inch wrench but opening the box was a big laugh. I imagine sit would be a bit bulkier, it looks as if it was an ordinary wrench that was scaled down in Adobe photoshop. Don’t take this the wrong way, the wrench works, the handle could be a inch longer but as is, it gets the job done. Would buy again, but only for small craft jobs.",
        "I wanted something like this on my keychain because life throws you situations in need of one of these sometimes! So this guy does the trick. Durability ehh is okay for what you gotta do I guess. The Jaws seem like they could come loose at some point but, hey it's not like I spent a million dollars on it!",
        "This is incredibly useful when working on stupid GM cars that have both metric and SAE bolts scattered throughout. It makes it really easy to find the right size socket the first time or for less annoying bolts you can just use this. This is actually 3 tools in 1 because it's got enough gravity in it to make a decent hammer, it's a very solid wrench, and it has metric and SAE measurements for finding the right socket.",
        "Tiny 4\" wrench that fits in your pocket. A great every day carry. It has a minor amount of play in the adjustment wheel, but if you're buying Tekton you probably want mid range quality. The metal has not rusted yet. The jaws haven't rounded off. Overall a good purchase. Buy spares because it's easy to lose.",
        "I like this wrench I bought it for work so I wouldn't mess up my nice crescent wrench, but the handle is thinner than the handle on my crescent wrench so if I'm really tightening or loosening something tight it can be a little painful where my crescent wrench is wider and far more comfortable in my hand. Otherwise it's a decent wrench for the money..",
        "The Tekton is a great wrench that has worked out well. When you start getting up in size like this 15 inch wrench, I need a tool that isn't going to fail on me especially when you start putting a lot of force on it. Fit and finish are nice and the jaws operate smoothly.",
        "I bought this to help me change my tie rods. I Used this to hold one side while twisting the nut off with a bigger size wrench. Seemed to do the job for me. I own many Tekton products and haven't regretted purchasing one yet. They back up their product and are way less expensive than other brand names. The only flaw I saw was the handle curved a bit on the flat side, hence the 4 stars.",
        "I have had at least one of these adjustable wrenches for many years and I had dropped it outside this summer and it got all rusted. These are a great tool when you are dealing with either SAE or metric and a larger wrench does not fit the space allowed. I keep on in my pocket just incase",
        "Could’ve been a great product but spindle the Titans jaw did not hold up after a few uses they goodness it was bought on Amazon easy return I’m sure this is a case by case basis may try to purchase another set",
        "i love Tekton tools but this adj. wrench is only 3.5/5 stars. the lower jaw is a little loose and wobbly and has a lot of play in it still works good but I wasn't expecting the bottom to be like that.",
        "One star off for being made in China, but let’s be honest it’s hard to find made in USA tools anywhere anymore. This is a very sturdy well built wrench with very little slop and the price was great. This is a lot better than most of the Chinese junk out there.",
        "Absolute Trash!! I only purchased this to remove a shower head. This trashy wrench would not grip it at all. Waste of money and time. I have to go to the big orange box store to make sure the next wrench purchase is heavy duty. UGH!!!",
        "It does it’s job, but it’s really annoying how the adjuster keeps unscrewing as you’re using it. I have to keep re-tightening and holding the adjuster/threader as I’m using it to try to keep it from getting loose.",
        "Bought the 8 inch wrench. Was so disappointed. There is excessive free play both up and down and sideways and adjusting barrel also has lots of play. Tekton needs to make them in USA or least in Taiwan. Have better workmanship in the factory. Socket sets are great, wrench really bad like dime store wrenches.",
        "I have a small wrench, but needed one that was larger. This one is great. I love the markings in inches and in mm on the opposite side. It's sturdy and feels like it will last a very long time!",
        "This thing is very small and fits in very tight spaces. It looks like it belongs to a toy tool set but it's a high quality tool. I have used this wrench in spots that would otherwise be impossible to reach. I just used it to assemble a steel storage shelving unit that without this tiny wrench it would not be possible to tighten the nuts with any other tool.",
        "The knurl catches in three spots, requiring a great amount of force to drive the claw. The finish feels bad in the hand, and the overall look and feel is of a cheaply made tool. Returning for refund.",
        "Gearing is sloppy so it works but not very well. Lots of fiddling with it. Seriously - it's a hunk of junk. Not worth the time, effort or money to return. It does look pretty but too big for a key chain.",
        "This is a very handy adjustable wrench. It is about as big as your index finger. The jaw works smoothly without grabbing and catching. I can adjust this using my arthritic thumb with no problems. You can tighten up to a Â1⁄2\" or 13mm nut. There is not a lot of handle on this so do not expect to torque the nut much. I find this very handy for those places where a full sized wrench or adjustable wrench will not easily fit.",
        "For bike rides, this is a great size. When I got it, I thought it would be too small to work on my bike's axle nuts, but it fits them, and I was able to loosen them. Not a bad little tool, jaws are square and tight without binding, nice finish. I have nicer tools, but I also have worse ones. I would say this of similar quality as Home Depot or Sears Craftsman tools. I've heard of people sawing the handle short on bigger wrenches in order to save weight, but having a nice tiny wrench like this kind of makes that unnecessary. I trust this more than my \"dogbone\" wrench, which is lighter, but \"bendy.\"",
        "This is a wrench. It is made of good steel and seems to work well. It is not a really solid tool meaning it has very little heft. As an extra I think its great but as a primary wrench Im not sure it would hold up to rough use.",
        "I needed a larger wrench for a home improvement project. It arrived just in time and earlier than the original projection. I'm glad to have this in my toolkit.",
        "This was a Christmas gift for my wife who needed a wrench this size. She was happy to receive it, but I noticed that the fit of the jaws was not as tight as the one I own made by another manufacturer. It does the job for what she's using it for though so all is well, but I deduct one star for this issue.",
        "Do not buy. Poorly made and practically useless. Look at my video at how flimsy it is and how much it adjusts once it’s supposed to be locked in place",
        "I HAVE A USB tv stick for my windows 7 multi media box. and it gets HOT but i clamped this on as a heat sink. and now it's much cooler. who knew that this would be worth 10x it's cost for an unexpected purpose. that aside it works great as a wrench too.. nice quality.. tighten it down it stays tight.",
        "Haven't used it much yet but it looks pretty solid. The gear to adjust the jaw works well. Tool weight is right for the size. This model looks a lot better than the Kobalt wrench at Lowes.",
        "The adjustment wheel is loosey goosey. With that I don't have high hopes for much longevity with this. Suggest buying something a little more main stream.",
        "My favorite wrench. It is big, heavy, and reliable. It arrived scratched up, not sure if demo unit, or what, but that is fine, aesthetics don't affect what I can do with it. I purchased this to remove a nova chuck adapter that had become stuck in my lathe.",
        "Don't waste your time and money. I was not impressed with the quality despite glowing reviews on a tool forum. The fit and finish on these wrenches is not good. Harbor Freight wrenches are better!",
        "Super super small. Doesn’t really lock on a size once you adjust it so you have to keep holding it in place. Good for little things, not for a big project where you’d have to use it a lot.",
        "This is another basic tool I bought for my grandson's beginning tool collection. Have to have it! This one is very good.",
        "It's not the most accurate but still better than what I'm currently using. For the price and my level of use, it gets the job done.",
        "I have no complaints about the Quality of the product.The Quality is great,and I received it in a timely fashion,right when I needed it.I definitely would recommend,this product to anyone.I am almost pretty sure any other tools coming from this seller would be a good buy as far as Quality,Pricing ,and Fast Delivery.The tool was very easy to use and very sturdy.I would say that for the price it was well worth it and then some!",
        "Perfect wrench for a small motorcycle toolset. I've had good luck with Tekton's tools and this is no exception so far. The action on the adjustment gear is pretty exact and it locks pretty snug. For the price, it cannot be beat.",
        "This is a very nice Crescent wrench that is obviously here for the long term. I need this XL Crescent to access a table saw blade bolt and it does the job nicely. Recommend!",
        "I love this little wrench! It has a good heft to it and doesn't feel cheap. No more guessing if I've got it opened enough, as they've included size measurments on the tool itself! The only con is the adjustable clamp wobbles a little bit, but that in no way has impeded its usefulness!",
        "it would stick when trying to adjust it, the coating was chipped, I just gave it away to a coworker",
        "My girlfriend has no tools at her house, and I use most of mine so often at home that I need to keep them here, including a family of various sized adjustable wrenches. So I'm on a program of outfitting a complete tool box to leave at her house on a budget. This is a nicely made, inexpensive little adjustable wrench. It is on the small side (which I knew when I bought it). If I had it to do over again I would get an 8 or 10 inch, as I only have the one in this auxiliary tool box.",
        "Moving parts are loose.....not the quality I'm used to from Tekton......no more Tekton tools.....I have quite a few good ones, but no more after these.....",
        "Sturdy, well made wrench. Happy with the purchase even though it ended up being a little small for the task I needed it for.",
        "Was in pieces when received and I was out of town so I didn’t get in returned within 30 days.",
        "good quality - not precision machined, but I've never seen an adjustable wrench that was. Works fine, no sloppy forging, plating looks good. Probably last 200 years if not abused or left out in the yard! My brother used to do that to my dad's tools. Of course, we both got blamed. :-S",
        "Thie tool is 4 in long and it is easy to adjust. It is smooth when opening and closing. I have used it in my small projects. I have not had any issues. I plan to purchase another set to utilize as a keychain as it is very portable and functional.",
        "It's big and so far has been good. I purchased for one specific task so I've only used it a little. Having one on hand is essential for DIYers, imo.",
        "Basic adjustable wrench. It’s not a name brand, but it will do what I need it too.",
        "Its a wrench for goodness sake how bad could it be we got it to put in our bike bag.",
        "You only get what you pay for. There is a lot of slop in the adjusting mechanism. I have bought other Tekton tools which were of very good quality. This one is not. Would not recommend it. Will be giving it to my grandson next time i see him for a tool.",
        "Wrench looked well made when I received it. However when I used it for the first time, I found that if you have a stubborn nut to turn, the jaws aren't stable enough to keep the wrench from slipping (and in my case, smashing my thumbnail). Would only recommend this wrench for light duty work.",
        "I bought this an after thought, just an extra for around inside. Turns out, it was key in resolving a nagging issue. Good job!",
        "The 4 inch is tiny! Exactly what I was looking for. Nice pocket sized crescent I can carry in my pocket at work. The adjustment is smooth and overall I love it. I’ve ordered 5",
        "Seems like it will work fine but there is a lot of slop in the gear which is annoying.",
        "I have had good success with Tekton which is why I keep coming back to them.",
        "Lost my last one so since I use it rarely bought 2 for less than the price of one at Home Depot. Now I have two to loose before buying again.",
        "Good product but the adjuster is a little loose so when the wrench is shut all the way some times it locks a little and it's hard to open. Also it will rattle loose. I carry this with my leatherman and it's very handy.",
        "Works beautifully. The measurements etched onto it are very helpful.",
        "Solid wrench. Helped me to fix my leaking shutoff valve, it was so much easier than using a plier",
        "From the scratches and oil stain on the wrench and the dirty plastic bag it came with, it looks like someone used it for quite some time. very disappointed.",
        "Are use this adjustable wrench and very tight spaces works perfect",
        "This will do the job, but it gets 3 stars from me because even if you tighten it, sometimes in the course of using it, it comes loose again. If it weren't for that, it would be perfect.",
        "Great little pocket wrenches. Me and both my boys have them. I use mine quite often.",
        "This was really my fault for not checking the description thoroughly but just to be clear: this is a 4” handle; NOT a 4” wrench. When I opened the package and saw how tiny it was, I just laughed.",
        "Seems sturdy, and feels like your typical wrench. That's exactly what I wanted, so it's perfect for me.",
        "I needed a small wrench to carry on my bike. I have old Craftsmen (US made) and Harbor Freight (China made) adjustable wrenches, and I would rate the Tekton between the two. It good enough for occasional use.",
        "Needed small portable wrench to keep with me for those times when a wrench is required, but going to tool box is inconvenient. This little wrench is really portable (fits in top pocket of workshirt) and is capable of handling 1/2\" nuts & bolts.",
        "It was made worse that Harbor Freight. I sent it back",
        "Great little tool to have around the house. I use it to adjust table feet, work in tight areas, add and remove Dremel accessories, adjust settings on larger tools. There's a lot of uses for this little guy. Very happy with my purchase. :) This should be in every tool box.",
        "Good tool for the money and perfect for the workplace.",
        "It gets loose easily so you get what you pay for",
        "I ordered a 12\" adjustable wrench to do some work on my truck at the barracks, when I opened the package there was a 4\" adjustable wrench with a 12\" label zip tied to the end. I will be returning, as I obviously needed to run up to the parts store and buy an actual size that worked to complete the task in my free time over the weekend.",
        "I used it to tighten a bolt. It worked fine.",
        "Exactly what I was looking for, perfect for making shadow puppets. Adjustable mouth for different voices. Long neck for giraffe character. The metal is completely opaque, that’s how you know it’s high quality. The key to creating a good shadow.. very nice. Also, can be used as some sort of adjustable wrench, so win win.",
        "Solid and durable - a wonderful addition to my tool box for home repairs.",
        "it does okay but does not stay in place once you have adjusted the levels",
        "I use it almost daily and by far one of the best adjustables I've had. Love the quality, the feel, and the fact it doesn't drift when using it. I highly recommend!",
        "It's just like the cheap ones we've been seeing for 50 years. The adjusting nut has skinny threads that engage the jaw loosely, and the nut moves around and won't keep its adjustment.",
        "Nice, a little thin on the handle but definitely a quality tool.",
        "This wrench is handy and I use it on my vehicle",
        "I needed two of these to tighten the bolts/washers on my TDS power squat rack. They have a lifetime warranty. That's all!",
        "I kept losing more expensive ones at work so I decided to get this one. It's better than I expected, fairly sturdy, loosens easily though.",
        "This little wrench is the perfect size to fit in your front shirt pocket! I bought it for my husband to use at work because he was tired of having to run to the tool box to grab a wrench whenever he needed to adjust something. He loves this wrench. It's not too heavy so it doesn't bother him when it's in his pocket and it's not too small, a man with large hands can use it easily. It's seriously one of the most useful tools he has!",
        "Came exactly as described and all of it is of great quality",
        "the product functions, it is just made of cheap quality, and might not last.",
        "I love this. I gave one to my dad. Beats digging out the socket set when you just need to fix a loose nut.",
        "Just the think I needed for a toolkit of small portable tools for working on laptops and desktops. Not too big, not too small. JUST RIGHT.",
        "Haven't used it much, but seems like a great little wrench. Excellent for tight spaces. I bought it for a small tool kit for my bag to compliment the Leatherman Surge I carry daily. For its intended purpose, I don't think this little guy could be beat.",
        "Very cheaply made, they are just painted silver and the paint wore off on one side from being in my tool bag. I will be returning when my craftsman come in",
        "Cheaply made. Jaw has considerable slop/play, so won't hold the setting. I'd return it but too much trouble for a $6 item. Would not buy again.",
        "Li'l devil. Small to hold but so damn powerful. I repaired my bicycle with this. It would be good if the handle is made larger.",
        "As a small, inexpensive adjustable wrench, it's fine -- nothing great, nothing terrible. It did get marked down for finishing. Both the moving and fixed jaws had significant burrs on every edge of their faces. Easy but annoying to file off; shouldn't have had to.",
        "Solid, well made, will last years and a bargain. Look no further.",
        "This is a horrible tool. Invest more money, buy an original BAHCO and skip this one. The jaws are getting loose after each (!) turn, making it so uncomfortable to work with that I always leave it and take a correct size spanner. Fit and finish maybe ok, but re-tightening those jaws again and again is making this tool useless. Cheap priced will be more expensive...",
        "It does what I ask it to. A utility keychain"
    ]
}