{
    "entity": "Over-the-Range Microwave Ovens",
    "text": [
        "This cabinet depth microwave is a great choice for tight spaces. Most of the countertop microwaves we looked at were too deep (19\" or more) to fit our alcove (15 1/8\" deep). This model sticks out about a half inch but is barely noticeable. Works great, is easy to use, and has a modern stainless steel look. We're very happy we got this.",
        "I put this exact microwave in my house 29 years ago and it is so great that when I need to replace it I can still buy it to fit my cabinets. This is the 4th one so they last about 10 years each and we use it a lot. It is beautiful and the most powerful microwave available to use as a built in.",
        "Considering that this is the only over-cabinet built-in microwave that we could find, it is so special that we bought a second one of them to keep in storage to be taken out of the box if and when our first one of these -- installed last fall -- ever breaks. One small reservation is that the lights both in the microwave and below it are too weak in brightness. But we're overlooking that because it works for our spot. It does look nice too -- has that built-in look rather than just sitting on a shelf.",
        "Very nice, powerful microwave. We bought a house that had a 24\" under cabinet microwave, that died. So rather than remove the range hood and adjust the cabinet height, I elected to replace the broken unit with the Sharp under counter unit. Straight forward mounting bracket, plenty of cord length, pretty good power, and decent button options. Sensor reheat works well on multiple things, and defrost options are good too. I felt the unit was the most reasonably priced for the few 24\" units out there. Fast free shipping was great too!",
        "When my wife fried our Kitchenaid microwave it was made worse because they quit making them. Along comes the Sharp brand to pick up the manufacture of the same style and size. I even used the same wall mounting bracket",
        "Fit perfectly and created a sleek look to our kitchen remodel. No more microwave taking up counter space. Although we only have had in place for several weeks and haven't put it through the paces, it seems to work really well for frozen dinners, popcorn and defrosting. The LED light under the counter is a bonus. We use it for night light.",
        "This is the third unit I have been through in 12+ years. The dimensions of the device are unique, ad that is why I keep trying to replace the original sized unit. It works well - I guess we just wear 'em out fast.",
        "Replaced this new Sharpe microwave with an identical one 10 years old. Once installed noticed the glass window had a spotted fog-like appearance. Looks like a double pained window where the seal has broken. The install was arduous and the oven works so will not be returning it. But when you buy a new product it should be undamaged.",
        "While I have has this model once before (it performed well). My 2nd purchase the microwave has lasted all of 3 weeks. It was a present for my parents and it's a difficult hassle coordinating repairs for this item. Thankfully I purchased insurance, but it's not covered under their warranty because it's a manufactured issue/defect. This better not be a long drawn out process. I just like when things work.",
        "This microwave replaced one exactly like it in our kitchen. Our original Sharp R-1214 was purchased as a reconditioned microwave from an outlet discount store 6 years ago for only $89, so it lasted beyond our expectations. It was such a good microwave fitting so well in our small kitchen that we replaced it with the exact same model. We hope this one lives up to the last. So far so good!",
        "I got what I ordered, but thought it would be an over-the- range, but did not have a charcoal vent fan. Product was advertised as over the counter. I believe the manufacturer has added a vent van and charcoal filter, that Amazon did not have. I am satisfied as I did get what I ordered, but would rather have one with the vent fan and charcoal filter.",
        "Bought to replace old Kitchenaide model KOMS155MSS-0 . Exact same size, fits perfectly. Local appliance store told me Sharp is the only company that makes this size. Only complaint.....no dinner plate reheat mode. We miss that.",
        "This microwave is a disappointment as the digital read-out screen has failed. It was expensive and in all our years of using microwaves we have never had this happen. There apparently is no fix. It works but you cannot see the digital numbers.",
        "You won't find any other microwave like this, it seems. It offers built-in features but in a non-enclosed, hanging type of installation. The price is also right. Two halogen lights on the bottom illuminate the counter. Programming of the buttons seems good, though I have not got into the full breadth of that yet. Easy to clean. Door opens well. Only reason I gave it a four and not five is that Sharp discontinued making it. Dumb! Definitely worth buying if it fits your design.",
        "This was a replacement for the exact same model which I had installed 8 years ago. The original gave me several problems and it was no longer economical to have it repaired and the Sharp R-1214 was the only over counter unit that fit my custom space. The new unit works fine but I have other more conventional units that perform better. For its unique purpose this unit does the job. A plus was the original mounting bracket still fits so it was easy to replace.",
        "Remolded kitchen had microwave installed over the counter. Nice looking and works great.",
        "Love my new microwave. This is one of the few that is meant to go under counter and not over a stove. The lighting underneath is a nice bonus.",
        "Wish it had an overhead vent otherwise, satisfide meausurments were not right, 23 7\\8 W, 13 7\\8 T, 15 1\\2 deep",
        "Product works as advertised...however, the microwave had arrived with significant scratches on the top and was filthy on the outside. The only reason I kept it is because it is an over the counter model and the top cannot be seen.",
        "Before ordering new cabinets, my cabinet guy suggested this microwave. I followed his suggestion and am glad I did, it looks and runs great.",
        "I checked out several microwaves before purchasing this one and I am very pleased with my choice. It fits in my cabinet perfectly, is quiet and heats great. Great choice.",
        "Had this and ordered another when moving, Frees up my limited counter space.",
        "Glad you had this available for the price. Best Buy not so much.",
        "We needed a replacement in kind MWO for a specific kitchen cabinet opening, and were able to obtain the same model as a replacement, helping to avoid damage and extra costs to rebuild the cabinet cavity opening. So glad the unit was available from Amazon!",
        "Sharp Customer Service not helpful. Had this microwave for 5 years, out of warranty now. Spent $400 for it, and now it has a burn mark on the waveguide cover for no apparent reason and will not work at all. Sharp is sticking by its one year warranty and when asked, did not give me an explanation as to why this happened. Why then, should I buy another one to replace it? Won' buy a Sharp microwave again. I have a Toshiba in another home and it has lasted literally 35 years without a problem.",
        "The package is broken and the product is damaged in corner and I notice after I fixed the panel. This is really pain",
        "This was advertised as an \"over the counter\"microwave. However, it is very heavy and does not mount to the bottom of the cabinet as shown in the pictures. It must be mounted to the wall. Not usable in my kitchen.",
        "We have used it daily for quite a few years and itnhas never failed us. Programing is simple and intuitive.",
        "We had redone our kitchen in 2005 with this microwave. It stopped working and we liked it so much that we wanted the exact replacement. This item shipped promptly and was as described. Fit into the existing space and works great.",
        "We love this product! It fit exactly like we wanted it to and looks beautiful in our kitchen.",
        "fits in place of the one removed and works great",
        "Sleek, well built. Great power. Reliable. Exactly what I wanted.",
        "It is exactly the same make and model that I replaced so I do like it and am very familiar with it. However the glass door is cloudy/dirty and appears to have finger prints inside of the double paned glass. We were concerned about this-----that it might not be properly sealed. So I would say that the quality control people or whoever inspected the finished product did not do a good job. This microwave should have had the door glass replaced before it was sold.",
        "Just put it up only used it once so far so good",
        "Fits perfectly in our upper cabinets. Much nicer looking than GE space saver.",
        "Bought this to replace one I bought at an airport retail store over a decade ago. This one appears to be identical and I anticipate getting the same long service from it albeit, after paying almost twice as much this time.",
        "Great product. Had one just like it for 15 years. Buttons started to fade.",
        "we are in the process of remodeling our kitchen. We have not had the opportunity to install the microwave. Although I'm looking at it it looks like high quality.",
        "Sent back. We needed over-the-range. My fault. Don't realy hate it, but didn't have another option.",
        "We've been using this microwave for about 3 months now. Works great- love it. If you're getting under cabinet lights, you'll have to work around this as it has it's own light and may not necessarily match the others, but it's not too bad. Our contractor had to make a custom casing, as you can see in the pic but I think any casing would work to your liking.",
        "Have had this microwave since July 2006. It gets used everyday! Works great. Been 100% reliable. No issues. No problems!. Still using it.",
        "We bought this microwave in October 2014 and it was installed in November of 2014. It's been used 18 months and it's sparking. I've checked the Sharp website and there are no authorized repair people in our area. I've moved a few times in my life and have had a few different microwaves, but I've NEVER had a microwave stop working or spark for no reason. Beyond frustrating. We can't really afford $300+ for a new microwave every 1 1/2 years.",
        "Heats food evenly. Controls are logical and responsive. Signal tones are not obnoxious and don't repeat ad infinitum. All that, and it was the only microwave I could find that is designed to fit in a 24 inch cabinet width. Other microwaves that I investigated had \"trim kits\" for building them into cabinetry but they all required 25+ inches of width.",
        "So day, this is a great little microwave. My only 2 complaints are 1-you cannot see the timer and cook in it at the same time. The timer will stop if you do this (our old microwave was able to run the timer and cook at the same time), and 2-it's a little pricey for a microwave. We re did our kitchen and our cabinet guy did his plans based on this specific microwave's dimensions, so we had to go with this one. Honestly, those are my only 2 complaints, so overall, it's a great microwave.",
        "Several things were wrong with the item when it arrived so I returned it. To me, refurbished means that everything should work, but the door didn't open properly, the end time bell didn't work and the plastic frame that the glass tray sits on was broken.",
        "When was the last time that you were pleased with an appliance or technology hardware that you were very happy with and were able to replace ten years later with the same device. For those who have cabinet installed microwave requirements but limited depth requirements, this is a great and very good looking unit at a reasonable price. If you want white and cabinet installed, this is a great microwave.",
        "I remodeled my kitchen 10 years ago and my microwave died. I wanted to replace it with the same one because it was customized fitted. I found it here slightly used and decided to buy it vs a new one (to my surprise still existed). I am very thrilled it works and of course fits!",
        "Excellent product, it's hard to find over counter microwaves. This is a very good choice for that purpose. I would recommend it.",
        "As advertised, arrived quickly, and heats up food. Fit the spot we needed it to like a glove - though be aware that the cord comes out of the top of the unit which took some finagling.",
        "Replace an identical Sharp Microwave that was black. It was 15 years old. Verrrrry hard to put up. It took three of us to figure out the instructions. But, once in, it works great.",
        "This microwave is just what we needed! It works great! It arrived with zero damage, and on time.",
        "STOPPED WORKING AFTER LESS THAN 2 YEARS. 1 YEAR WARRANTY ONLY. JUNK FOR THE HIGH PRICE I PAID.",
        "I’ve had the predecessor of this model (R-1214) in daily use for over 15 years without a single issue. Yesterday the display went out so I’m buying this unit without hesitation to replace it. Sharp has great build quality.",
        "Installed very easily with a clean fit and finish. Microwave comes with a built in counter top light. That is a very nice feature. Well worth the money.",
        "nice unit, did make mistake and ordered a under counter unit, when I should have ordered a over the range, my mistake. My wife said to go ahead and install it, working great.",
        "Replacement for a 10 year old of the same make and model. Fits on the same brackets in a tight spot. Works well.",
        "The unit I received was just like the one I needed. The problem is I had to reorder this unit to fit the space I had. The first unit died after only 4 years of use. this is the first microwave that did not last long.",
        "It is a very good product, the second one we have owned. Wouldn't buy any other brand.",
        "Good product, but didn't know it didn't come with trim kit and one isn't available for it.",
        "I love it! It was an interesting challenge to install it!! and the learning curve to run it was also a bit of a challenge but after that.... it's terrific and I highly recommend this brand of microwave and this style if you're looking to clear counterspace as I was.",
        "I needed a smaller-than-usual microwave to build into my only upper cabinet when remodeling my kitchen in 2008; this model fit my needs perfectly. It has a very intuitive control panel with lots of options, a tempered glass turntable (I like that a lot!), and sleek design that actually looks great in my traditional cottage bungalow. I just purchased this model again because the control panel on the first one stopped working after only 8 years. I was disappointed because my prior microwave had lasted 16 years. Nonetheless, I bought this item again as a replacement and it works great!",
        "Works great and no blemishes where they can be seen once installed. Nice savings, but not a new appliance warranty either. Working out well for me though.",
        "This is a smaller (24\" wide) OTR that was needed for a small space. With the Sharp brand, this proved to be an excellent product.",
        "I am pleased with this unit. I had to order because few companies make 24\" wide units. Very powerful unit. Only needs about half the time to do same job as another microwave I have. Only complaint is that buttons are hard to read.",
        "Love the easy access buttons along the bottom! Perfect if you don't want/need an above the stove and don't want the expense of a built-in. Works great, looks great!",
        "This oven looks great in my new kitchen. That is the best thing that i can say about this oven. It heats like a 900 watt oven. everything takes longer to reheat or to cook.",
        "We have only had this microwave installed for a few days, but so far we think it is great! It is a wonderful space saver, fits perfectly under our cabinets, looks super and performs as expected.",
        "It was hard to find an over the counter microwave- so I am very happy that it really works well.. has lots of bells and whistles but is still easy to run. Arrived in 2 days in perfect condition.",
        "I was so happy to find this microwave because it was exactly like the last one I had. We had the other one for so long I was sure that we would not be able to find it. Its hard to find an Under the counter one.",
        "I was not so whipped up with this unit like I thought I would be. The unit feels flimsy and does not have that feeling of being solidly built. You have to use it to see what I mean. I expected the unit to be built like a tank, coming from Sharp. It does work ok and it looks ok. The service from Amazon was first class.",
        "Replaced an identical Sharp R1214 we've been using for about 8 years (recently failed). Only took a few minutes to install in place of the old one. Very happy with Sharp R1214. We're retired. We use it many, many times per day for just about everything. The pre-programmed cook settings (e.g. potatoes, chicken breast, etc.) virtually always work perfectly. If this one goes, we'll buy another.",
        "Returned it, the measurements were slightly off. If it looks like a close fit, I would not order this unless you have an inch to spare.",
        "Ordered this premium-priced microwave, and perhaps I had too high an expectation. I was disappointed to find the product to be cheaply made -- mine had \"wrinkles\" on two of the sides -- and not worth the 3x price increase. It may function perfectly well as a microwave, as it's basically a simple, cheap, unit which has been put into a different case. If you get one that isn't flawed, then I suspect it'll look very smart when installed. Sharp seem to be the only company to do over-the-counter microwaves, so your choice is limited if you must have this style. I've gone for a more common counter model, and will spend the extra money on a shelf for it.",
        "The only thing I would've liked would've been an exhaust fan. Installation was flawless."
    ]
}