{
    "entity": "Over-the-Range Microwave Ovens",
    "text": [
        "I love this appliance. We are full-time RVers. We purchased our 2004 motorhome in 2013. I had never used a convection oven before, but quickly learned to like this combination oven. When it needed replacing a month ago, we researched other \"RV- friendly\" micro/convec combo ovens. It didn't take long to realize that we wanted the exact same type that had been original in the motorhome. It microwaves wonderfully and bakes beautifully.",
        "I bought this to replace the same model Sharp microwave/convection oven I had for 12 years. I was elated to find that this model was still being produced. It's reliable and easy to use. We also had this same model in our RV, so the convection part was used a lot and works great for baking. I paid someone $100 to remove the non-working one and replace it with the same model. Hoping this new one lasts 12 years, also.",
        "This is an amazing unit. This is my 4th one to on. It seems to be standard equipment in upper end motorhomes. I recently purchased another couch and wanted to upgrade to stainless steel look. This unit works better than my Samsung in my house. I paid twice as much for it. I don’t understood the other reviews that rate it lower. None of the units I have owned ever failed. I use a coach more than half a year for my business travel. All my cooking is done with it. Looking back at past 20 years of service the cost of ownership is 8 cents a day. I have zero complaints.",
        "We replaced our convection oven with this Sharp model and couldn’t be happier! It’s sleek sharp look fits great into our modern RV and once you have a convection oven in a RV, you can’t ever go back to just a microwave. We spent a little more for this unit but with the quality and warranty you just can’t lose. We’ve had other Sharp appliances and it’s products just lasts not like the brands who’s appliances are like buying disposable products that you have to replace every other year. After using this in our RV I had to have one in our home too! I highly recommend & give this oven 10 stars!!! Thank you!",
        "We love the microwave. It replaced a 20 year old version of the same model. Beware of very poor packaging. Odds are VERY HIGH it will arrive with DAMAGE. Be prepared to accept it that way or to start the return process. It would be nice if the seller at least would replace the broken tempered glass over the light on the bottom of the microwave that arrived broken. Don't suppose that is very likely. Not much that can be done about the two dents in the case but at least one is covered by a cabinet and the one on the bottom is not real visible.",
        "So far I love this appliance. It far exceeds my expectations: easy to use and very versatile. We purchased this exact replacement for one that was broken in an RV we purchased. My hope is that it continues to function as well as is does now! I'll update as time passes.",
        "The grill above the door was broken upon receipt. The bottom of box was torn mostly off and was in bad condition. I was able to glue the grill to usable condition. The side shell had a large dent in it and we were able to loosen shell and push dent out. Large cost for such a damaged product 4-8-20 Now turntable keeps shutting off Push turntable button and it restarts for several seconds and then shuts off again NOT HAPPY",
        "Very good so far. It's our 1st convection microwave, so we are still learning to use it. The only complaint so far is that we wish it was brighter inside while cooking is going on. There is only one light and it is located near the front, so it's difficult to see the food at the rear of the unit.",
        "This was purchased as a replacement for the unit that failed in our Motor Home on the first trip we made. It took two men to remove it and to install the new one. It is heavy and that makes for an awkward installation. I have to look up in the accompanying manual each and every thing I want to do beyond simply reheating. Use is not intuitive. Hoping I will get comfortable using it and feel sure that I will.",
        "Not only did our microwave come with a dent in it but now after only a few months it is a challenge to get the door to open. We have to push the button several times and then put our hands under the edge of the door for it to open. Frustrating since we had our electrician professionally install. this.",
        "Opens with clearance on left side so if you have a wall on the left hinge side there is still clearance to open without hitting wall",
        "It arrived about a week before they said! Yay...and was double box packed. NO DAMAGE!! Double yay! This is the replacement for our 2002 Sharp, same model, but in Stainless Steel. We installed it ourselves (two person job) and it looks great in our 2004 Monaco Executive! Really brightens our kitchen up.",
        "This microwave does everything I need and more. I still have to try convection. Today I prepared scrambled eggs in it and they were perfect. I love that he fan comes on automatically when the stove produces heat.",
        "Back mounting plate did not fit , had to bend out scratched cabinet and then the mounting screw on one side would not engage. They probably knew this seeing directions said back panel needs to be removed first but was separate in the box.",
        "a bit of a challenge getting it installed and a learning curve getting to know how to use the convection oven and using the combo feature but now we are loving it! A good deal for us.",
        "Well all my research says it’s a great microwave, even the appliance stores that don’t carry them say they are great. I am sure this would be the case if one arrived I undamaged. I have order two, both came with pretty bad damage. Still trying. I will update my review when in fact I get a decent one to install. RB",
        "This was an exact replacement for the 10 year old oven installed in my motor home. It works well and has lots of features being used both as a convection oven and a microwave.",
        "Our old microwave was underpowered and falling apart, so we decided to replace it with this combo oven. Really like the overall size of this oven as the compartment is large enough for cookie sheets, but it was shorter than other over-the-range microwaves, which allows for more room between the microwave and the range. So far, the microwave cooking has been a welcome improvement and the functions are easy to use (some auto functions, but easy manual operations as well). We are still learning about the convection oven, but it has been really nice not to have to use the full oven and heat the entire kitchen when we are crisping items like egg rolls or crispy chicken snacks.",
        "I liked that after 13 years, I could find a microwave that was built to fit the space in our motorhome with the same vent spaces. Therefore, it required no remodeling. It took 3 men to put it in and it was not an easy task, but finally it was finished. We knew how to operate the microwave/convection so there was no learning curve for the operation of the oven.",
        "Perfect replacement for our existing Sharp that was mounted in our coach. I was apprehensive about taking this on myself, but it didnt take much to change it out all.",
        "A power surge took out our convection oven and I wanted to find the exact model so I would be assured it would fit perfectly into the current spot in our RV. Found it on Amazon Appliances for the best price and so far has been working perfectly.",
        "The top plastic vent cover along the top front came broken in the box and had already been attempted to be glued, but was broken when we opened the box. Since this i an old product and no others are available, i will fix it myself and make it work, but it was attempted to be fixed and that is deceptive",
        "Love this product! I had the same one for 14 years and it was great. Sad that it died but glad they had a replacement. I would recommend this product for anyone. Easy to use and I love the convection part as I bake a lot and it works wonderfully......",
        "The Sharp replacement microwave fit into the same spot in my RV as the original microwave.",
        "We bought this microwave for our kitchen remodel partly because we also have this same unit in our motorhome. The combination of an outside hood vent, range light, convection oven, and microwave made it a bargain as well. The shipping was perfect. It was packed in 2 boxes, first the manufacture's styro lined box, then that box was bubble wrapped and boxed in a separate larger box. The stainless steel matches our other appliances and looks great! Thanks Sharp, Thanks Amazon",
        "Sharp says, a charcoal filter is needed if you don’t vent outside. Why in the heck don’t they include one with the oven then? Dumb!",
        "You will be surprised at the amount and size of food this oven will accomodate. It cooks everything from meatloaf to pound cake evenly and locking in juices. I bought this because my other Sharp over the range microwave gave up after eleven years of constant use. I was used to the Sharp features which made it the logical choice. At the same time, I wanted to replace my conventional oven (also 11 yrs. old) because it never baked evenly. With the Sharp micro/convection combo, I no longer have to replace my conventional range oven - I'll use it for storage.",
        "I like the oven, it's easy to use, love the way it cooks. But after installation we found that the fan blades were bent and so was the fan shaft. Sharp ordered replacement parts but they were on backorder. After a one month wait we will have a working oven hopefully this week.",
        "Fits perfectly in previous Sharp model space. Heating seems the same as the previous model although this one states 850 watts and the old one said 1100 watts. Exhaust does not work as well as the other model. Fan seems to work same on low and high speed, no difference in sound or intensity of fan sound. One would think the low would seem quieter. Now just 6 years old and it has DIED!!!",
        "My wife said she wouldn't use it Well 3 days later guess what. Very nice I use convention all the time. I'm the master in cooking and this is the guy",
        "The microwave function works fine however when using the convection mode, there is a loud rattle coming from the fan. I contacted the seller ( CyberSavings) 3 times with no response. I'm very disappointed with this seller and buyers should proceed with caution with them.",
        "I have had two of these ovens, one eventually broke when it was ten years. As I had like it so much we replaced it with the same model. In the new one, when cooking certain foods, between the glass steams up with condensation and the inside runs with water. I contacted Sharp and they tell me that is completely normal, even though 24 hrs later it is still fogged up. As this didn't happen on my previous ones I am unhappy with this.",
        "Love this oven as it fits in my RV. It seems to be exactly like the one I was replaced. The 1st one lasted 9 years while he I think is good for an appliance these days.",
        "Love it. My RV unit died after 17 years and this one is an upgrade and fits perfectly.",
        "Direct replacement in my RV for the original that lasted over 15 years. I hope I get that same life out of this one. All of the previous reviews were spot on, in the fact that the new one is very hard to get the two mounting bolts to start (took about 40 minutes) and the new models fan and motor are far louder than the old one was. But the unit works great in all categories.",
        "Item had been opened and then reboxed using the old packing, resulting in the styrofoam being degraded and broken up. My fan still spits out a styrofoam “bb” once in a while. Item is of good quality, but I do not advise using this seller.",
        "This review is more about the condition of the microwave Convection oven. It was bent in 3 places. It seems to work ok. So disappointed in the condition. I really need it because we are on a road trip in our RV. Rhonda",
        "This arrived packaged very well and on time. We have used both the oven & microwave in our RV and love it!",
        "This was purchased to replace an older oven of the same brand and size in our motorhome, but it was more difficult to install than expected, even though the dimensions were exactly the same. Evidently the original was not installed following the directions and using the template provided. This was not the fault of the oven manufacturer, but of the motorhome manufacturer. The oven works great and looks much nicer than the old one. The operation manual was much more helpful than the previous one, and the cookbook that came with it had some good recipes. Money well spent!",
        "This sharp conv/micro replaced the same in my motorhome. It’s great, fit in the same spot and works beautifully. The seller got it here very quickly. Totally satisfied.",
        "We used this microwave as a replacement for a microwave that had been installed incorrectly in our RV ,which did not fit. this Sharp fit perfectly, and a door which opened correctly. we are extremely pleased with this Sharp.",
        "This was such a great deal and perfectly fits our living quarters horse trailer! I am very happy! Shipping was stated to be approximately 7-10 days. We received it in 1.5 days! Wow!",
        "Had this for two years and had no issues with it, works very good.",
        "Just what I expected. An update of my previous oven.",
        "The first 2 were damage but the 3rd one was a charm.... Thank you",
        "It was easy to install and has operated smoothly and as expected, both microwave and convection settings.",
        "We renovated our guest house making a nice efficiency apartment. No stove top or oven making this Sharp Convection Oven the perfect way to cook and bake. We had this exact one in our motorhome and love it so had to buy another when the opportunity arose! This one runs even more quiet than the other one. Does a great job of baking and microwaving anything we need!",
        "Baking cinnamon yeast rolls as we speak in our RV.",
        "My wife wanted this item after conducting a great deal of internet research on it. I had been used to using a 10 year old microwave and did not think I would be that impressed with this new model. I was wrong. This is one of the best appliances that I've ever purchased.",
        "Easy to install and easy to use. Takes a friend to help install it, because it's a little heavy and bulky for one to handle by himself, but it installed really easy.",
        "bought this in Jan installed in motorhome does not work anymore They just fixed it only worked 5 more days broke again",
        "Box instructions “cut box on line”. A. Box damaged B. microwave damaged C. Return instructions-Box item I don’t have a box, not easy to carry (heavy)",
        "So far so good. Holding up well in our RV as it goes down the highway.",
        "I replaced my last one which lasted about 15 years",
        "I researched many microwaves for our needs, and this is the perfect unit. It is my second one, as the first I had special ordered to be delivered to a big box store, it arrived damaged. This one arrived fine, well packaged for the trip. It cooks evenly in the convection mode and as a microwave it is fabulous. It arrived when promised. I would definitely buy from this seller again.",
        "I have a 2004 Winnebago motorhome This unit fit perfectly where old one was very satisfied with oven",
        "Actually 4,5 but I did not know how to put in a half. The old one had slowed down after 8 years on speed/power as it could not be cometely cleaned. Wow what a difference with the new one'.",
        "this was a replacement microwave convection in my RV. Since the exactly like the one I had I really loved it. just need to remember to use the owner's manual when using old recipes that you want to use.",
        "Perfect fit, replaced my old model in my R/V with this one had no trouble with it at all.",
        "We had this same unit in our motor home. Loved it there, love it in our park model!",
        "We ordered the Sharp convection microwave on May 6th. We received a damaged article and we were told by the Company \" Unbeatable Sale\" that \"Once it is on its way back we will resend another one\". They did NOT. After the damaged one was received and inspected by them , they send another one.We received the second one on June 2nd.... almost a month after our 1st order.Dana Gilardi , the Customer Service Representative, sent e-mails to call them . We did , left messages with our phone # and the calls were never returned. We are happy with the microwave but very dissappointed with the Company \"Unbeatable Sale\" .",
        "Although the add listed the unit as \"used\" it was in fact brand new and I am thrilled to my socks!!!!! It is installed in our Motorhome and works like a charm! Thank you,thank you,Thank you!",
        "We purchased this microwave in 2005 but never got around to writing a review. It is now fourteen years old and we haven't had a single problem with it. User interface is good, microwave and convection features are just right.",
        "Works OK. But this is my third r-1871. It doesn't sound like the others. Takes longer for magnetron and turntable to kick in. The other two only lasted about six years. The jury must remain out on this one, at least until the one year warranty expires. No problems with the seller. Strangely, all three ovens were manufactured in different countries.",
        "The microwave/convection oven broke in my RV and this is the replacement. I had it installed by a professional RV repair tech and it went in easily. You do need to correctly measure the opening! I reviewed the instructions slightly, but the use of this product is pretty intuitive if you have used a convection oven before. I absolutely love the built in turntable, which I didn't have in my old oven. The two included racks makes it possible to cook two things at the same time at different heights. I really enjoy using this microwave/convection oven. Highly recommend.",
        "It dose not work...and I don't know how to send it back!!",
        "Had a prior Sharp like this but this one is a lot nicer.",
        "This microwave replaced one that was 17 yrs. old. Used all the old mounting hardware, installation was easy. Happy camper again.",
        "Never able to use it. Ordered one, it arrived damaged. Returned it and ordered another and it was in worse shape than the first. It was obvious that BOTH were previously opened. I wonder if they were returns from other customers. The factory packaging is awful and really insufficient. It is little wonder it was tore apart in shipping. Amazon return was just fine...I just hated to use it and now I still don't have a microwave.",
        "The Sharp Microwave we just purchased is identical to the one that served us in our motorhome for over 12 years. We were pleased with the original unit and anticipate that we will be happy with the new microwave. Despite traveling over 160,000 miles over some very bumpy roads, the unit held up well.",
        "came in a box that looked very old, during installation one off the gromets pulled out that pulls the front top to the cabinet, kind of noisy operation.",
        "We had the same microwave before, after 12 years the door was giving us trouble. You can guess our surprise when we found the same microwave still being made. I would recommend this microwave although a bit pricie",
        "This replaced a '95 Sharp Carousel which was a great machine; this new one is noisy, vibrates and doesn't cook bacon, potatoes, etc. as efficently. The convection feature is a plus but we don't use it much because it is very messy and takes a lot of energy in the pre-heating process.",
        "We gave this to my daughter for her birthday. Her husband installed it over their range. She loves the convenience of both another oven and the option of a microwave. the convection is large enough for a big baked chicken.",
        "I've only had it for four years and it's already given out....I don't use it very much, except to heat things....very disappointing",
        "What Sharp Corporation designer ever thought of incorporating two screws, each about a foot long, to be inserted, blind, from front to back in order to pin this unit to the wall? Our installer finally had to give up on the use of these two impractical items. Other design problems are: 1. The control panel is not backlit and so cannot be used easily in a dimly lit room. 2. The internal light does not adequately illuminate the food.",
        "This replaced a 12 year old identical model that finally quit. While I considered a more recent model, the convenience of installing a microwave with the exact same dimensions and mounting hardware is hard to beat. There are a lot of buttons that I will probably never use.",
        "Item arrived damaged. At that point return of item became a issue.",
        "perfect size for our space. a little noisy when on microwave.",
        "Box was not crushed but top venting cover was dented and cracked. I used the old one from the same model that needed to be replaced as to avoid all of the return BS.",
        "After owning a previous Sharp microwave/convection oven I bought this one. Installed 5 years ago and still just as pleased as the day it was installed. Excellent even microwave and oven performance. Highly recommend this product.",
        "Replaced the original Sharp in our RV after 17 years of use with exactly the same make and model. It fit perfectly and looks great. The look and operation of the oven is very close to the original. Look forward to many years of use from this one.",
        "All the microwaves I looked at had the door hinge right at the corner of the cabinet. Because of this 31\" was needed to open the door. I have a wall on one side of the unit. I needed one where the door would open inside the 30\" footprint like my older Sharp did. To my suprise they still make them. This stainless convection oven is great and the price was right. I absolutely love how it works and looks. Thanks Amazon and AJ Madison. PS Installation was a snap.",
        "The 3rd one in almost 15 yrs. A good reliable model.",
        "We really like this microwave but more we like how easy it was to get it from Amazon. It really has a good convection oven, although is somewhat noisy with the fan. It was very easy to install and came with very clear instructions. Amazon delivered it quickly and it was the best price as anywhere.",
        "Great help in the installation, smaller oven size than ge or sears. Display could have larger numbers. No handle to open door.",
        "Perfect fit. I went to several appliance stores locally telling me I couldn't get one to fit. Love the look and bot microwave and convection wok great.",
        "Great price, shipped in good speedy time, a very small dent that we decided we were not going to complain or worry about! Oven was mounted, and neither of us felt it was worth taking out and starting over!!! Works great, convection or micro- wave!!",
        "I couldn't enjoy our travels in our RV if I didn't have my Sharp convection/microwave oven. I just love it !",
        "Was delivered within a few days. Appears to be a good product.",
        "Would have received 5 star rating if interior was easier to clean.",
        "It was a replacement for the microwave that was in the motorhome."
    ]
}