{
    "entity": "Step Ladders",
    "text": [
        "I didn't get what I thought I was getting, but it is probably a newer model than the one I was anticipating. The model says it's the same, but oh well. I like it enough to keep it. It's a lot harder to use than the one I use every day at work. It's hard to open and hard to close in my opinion. It's heavier than I expected, but I definitely feel secure when I use it. So that is definitely a plus. I would recommend it. It folds nicely and you can stand it up behind a door with ease.",
        "So I went from a cheaper 2 step stool to this one. The quality of the Werner was striking compared to the old one I had. That being said the extra step and the higher quality materials added significant weight in my opinion. If you don't need that third step it is something to consider. I could not deduct any stars for a well built step ladder that does exactly what is supposed to do.",
        "The latter is an ideal height for most choruses around the house. It feels stable when I used it. My husband uses it too. When you are ready to collapse it, I recommend stepping on the back ground bar and pulling up on the top step; once I consistently did that, I had no issues closing it. I am okay with a little extra effort to close it, if it means it's more tightly secured when I'm using it. I have had it for several months and experienced no issues and have no compliments.",
        "This replaces the same product we'd had for many, many years and loved. The only comparable downside is that the release latch to fold it up is now very cumbersome. The previous one's latch stayed open on its own, making folding a breeze. This latch flops around, requiring two hands to close and care not to pinch a finger.",
        "Great Ladder......stable and foldable. I need a ladder to wash the roof of my suv. I was afraid that using a regular step ladder would slip and dent the doors or side of my suv. This ladder is stable and the steps are large enough so that you are not standing on ladder rungs. The 3 steps allow you to reach normal heights without the risk of falling.",
        "The first Werner StepRight I owned is the 2-step kind, but then I am a short person and got this 3-step. The parts are very sturdy and the base is secure. I love it just the way i love my shorter one. It is worth buying. I have seen some of the step ladders like this but they all seem to be so flimsy. This one is well built and solid. It's perfect for home use and even for a store. The store I used to work also use this exact brand and it has never failed us.",
        "We borrowed an older model of this stool and liked it so much that we purchased this one. The latch on the old stool was very easy to operate, but the latch on the new one is different and difficult to set; this is the reason for four stars instead of five stars.",
        "We've had one of these for many years, and decided to order a new one. Very versatile... and sturdy. We use two of these step stools when continually working overhead (like putting up Christmas lights along the eve of the house) and step from one to the other and move the empty one to the next location. Very Useful!",
        "For starters, I really like the depth of the steps which are much more comfortable (and stable) to stand on than other step stools whose steps are narrow. Also, the textured step surface is nice, and the unit folds up nicely for storage. The only reason I didn't give it 5 stars is that this is my 2nd step stool, the first one lasted about 8 years before I put it on an uneven surface and one of the legs broke. Still, decided to replace with same ladder given how good the first one was and the fact that I haven't seen a better design out there.",
        "I read the negative report of trying to collapse the stool prior to buying it. I still thought I could manage it. This was unbelievably difficult! I had to lay it down and stomp on it to get it to release. A woman shouldn't expext to collapse it in a ladylike fashion...it's not going to happen! It did feel secure when you are on it.",
        "Just wanted a step stool tall enough for a couple of chores that don't require my taller 6-step ladder. It means I don't procrastinate if I can just pluck the smaller one rather than wrestle with bigger one if it's not a tall job!",
        "I'll make this review short and sweet. This product came within 2 days (using amazon prime) and was well-packaged. The product arrived as described and works as advertised. Folds up pretty small so I can store it in my closet. Easy to use, seems safe and sturdy (I weigh 200 lbs for reference). My only issue is the price. Since buying this, I've seen cheaper step stools at Lowe's that seem to be about the same quality. But this is a good, solid product nonetheless. I took off 1 star because the value is not great ('QUALITY' is great! But that's not the same as 'value').",
        "This a great for those times when you need more than a two-step stool, but not a step ladder. This is sturdy & easy to store. This is great for hanging curtains putting away things up high. I also make sure I have one in the basement so I'm not dragging the one up & down the stairs. Everyone knows that if something is on one floor, it's always needed on the other floor. For the price, it was easy to buy one for each. I've also purchased one similar at a local store, however they no longer carry it.",
        "Pros: solid, light, holds 250 lbs safely, has metal lock to prevent accidental collapse, folds flat for storage in just over 1 inch of width, safety feet for non slip hold. Excellent price/performance ratio buying it online vs local retailer. Cons: none Other thoughts: I got this for my mom, she is over 70 and it makes her feel safe using it compared to any other step stool.",
        "I have an older version of this stool and I LOVE it...so I decided to give this same stool to my 6 daughters for Christmas and they were delighted! This stool is so sturdy and doesn't wobble when you stand on it. It snaps into place and can't collapse and pinch fingers until YOU decide to collapse it. It does require a short strong pull to fold it up, but any healthy person should be able to do it. But this keeps a child from being able to close it prematurely.",
        "This is the best step stool It's sturdy, gives just the right height option. We liked ours so much we sent one to our children in NC. Highly recommend this item. Thank you.",
        "Love this ladder Everyone should have one Sturdy and safe",
        "Unit was as described. Easy to use. Folds nicely for ease of starage.",
        "This ladder is much sturdier in person than it looks. I'm quite pleased with the build quality and stability of the ladder. It makes stepping onto the third step more comfortable. The steps lock into place so the ladder won't collapse very easily and the steps are thick and nice and wide. Great ladder for around the house use and occasional house work. Folds very flat for the size and build. If I had to nitpick, I'd say that the utility of the small latch on the top step is a bit hard to figure out (although you don't need to know about it to use the ladder).",
        "I understand the fact of making this stand not so easy to unlock. You wouldn't want to accidentally unlock it while on the top step. Even though I don't know how in the world that could happen. This stand is light enough for my 8 year to move it around, but again he has a hard time locking it down when unfolded. Big steps are nice. The top handle/rail is nice to have where you need to reach out a little bit. Compared to the Little Giant Three stepper, this is just as good, and cheaper.",
        "This is such a time saver, I used to have a stationary plastic step stool, always in the way, not easily stored and I live in an apartment. When I saw this, had to have it. It is perfect, Folds for easy storage, opens and locks down easily. I use it all the time, to change lightbulbs, trim my climbing roses, putting up photos on the wall, etc. It is a great buy!",
        "Very sturdy and safe. However opening and closing the ladder is difficult. Sometimes I use a chair instead to save time and energy. Also, the two bottom steps are an inch narrower. Careful stepping down. To close the ladder I stand behind the ladder to the left, with right foot firmly on the bottom pole, hold the top bar with left hand and crab the bottom back of the top step with right hand and pull hard. I grab anything to cushion by right hand to avoid scrapping it on the plastic step.",
        "Had for about 2 years for indoor use. Still looks like new. Easy to operate. The wide steps make it very safe to use. It is also very steady and the rubber feet keep it from slipping on tile and hardwood. Lightweight and folds up to easily store between washer and wall. Perfect for household use on flat surfaces.",
        "So glad I decided to purchase this stool. It comes in very handy for me in the kitchen on a regular basis. It is sturdy too, you can't beat a Werner. Can reach things with this stool that I was unable to reach with my basic 2 step stool. Doesn't take up much room at all, which was important to me too . Very good buy in my opinion.",
        "As described, super fast shipping. Would highly recommend. Nothing else much to say, it's a werner. Werners are great quality, I have a couple of their ladders. My wife needed a step stool and this one fit the bill. It is very heavy duty,it was a good price and it got to me ASAP. The wife loves it !!!",
        "I have a house with 10' ceilings. A two step ladder is next to useless with ceiling that high. Still can't replace recessed ceiling lights with this unit but can do most everything else. Opens and closes easily. I have had it for a year, left it outside in the rain twice by accident. No rust, no problems.",
        "I have been searching my local stores for a Step Stool and did not find one that pleased me; they all were too flimsy and over priced. When I opened my latest Amazon purchase I was ASTOUNDED, to say the least. My new Werner #223A far exceeds my expectations. It is well made, sturdy, and easy to use, and, stores well. I use it in my Stained Glass Studio and intend to purchase another for the house. As usual, Amazon provides for us out-here with high-quality affordable products. Thank you Amazon! Just received my second step stool for the house. .I love them both! Again, thank you Amazon",
        "My apartment has a lot of high up cabinets. I'm 5'11\" and I still have a hard time reaching the upper levels. Also, I often need to reach up high, like when I was installing a curtain rod by my windows or hanging a frame up high. This step ladder works great, and folds up a lot smaller than a typical ladder. It's also extremely stable. I have no fear whatsoever when standing on this it is so rock solid. Worth every penny.",
        "This step stool folds flat and is thus very easy to store. It takes a bit of pressure to open but it locks into the open position. It is very sturdy and does not move at all when you are on it. It does leave your hands free for doing whatever chore you are using it for (hanging curtains, changing light bulbs, etc.) The steps are non-skid and it does have a useful handle for holding onto while climbing or descending the steps.",
        "Excellent product. Well manufactured, sturdy, and perfect design. Easy open and close for storage.",
        "I like this ladder a lot. I recently had a knee injury, and have just got off crutches, and so I need a steady solid-feeling step ladder! I felt safe on this one, it has a nice weight, a locking mechanism, and nice slip-proof steps. It is a little heavy to carry, that is the only thing I don't like about it. I would recommend it! A good deal, and it's very nicely made, and feels like good quality. I like the rubber grip on the top, too.",
        "I really like the sturdiness and solid construction of this step ladder. Only negative for me is that even after approximately 50 uses, it is still really hard to fold up after use. Not sure if even WD-40 would help as it seems to be a design flaw.",
        "This is a great stepladder. Stable yet tall enough for the high spots in our kitchen. I'm secure using it (6') and my wife (5'4\") loves it. It's light and easy to move around.",
        "Lightweight, unfolds securely, easily stored stool for reaching the top shelf safely. It is not sturdy enough for anyone over the 225 pounds however. I like the rubber grab bar at the top to hold while climbing up the stairs.",
        "I am using this ladder for the loft bed I purchased and I am SO happy. These steps make a great alternative to the dinky little ladder and the heighth is perfect. See my reviews for the loft bed..I bought two so it's the one without the storage steps (storage step loft is the one I liked better).",
        "Purchased this stool because I just bought a house and knew I'd need something for painting, hanging curtain fixtures, reaching tall shelves, and the countless other things you need to do around the house. Well, this things is a workhorse. EXTREMELY sturdy. I feel completely safe even if I have to use the top step. Just make sure the lock is set and you're good to go. Highest recommendation.",
        "Wouldn't take anything for this stool. Very stable and I feel very secure when I am on it. Love the locking device so that I know for sure that I am safe. Ordered for me but noticed my husband is using it instead of his ladder. I would very much recommend this to my friends.",
        "This is one great step ladder. I had the earlier model, which looks and is built the same. This one had a few upgrades though where it locks in place and also has a safety lock. I don't need the lock, but it adds assurance things will be ok when you're on the top step.",
        "This step stool is very sturdy. I have 9 ft ceilings and need it to reach the top shelf of my kitchen cabinets. As I am a senior citizen, the wider steps are better for me.",
        "Purchased to have around the house to change ceiling light bulbs and reach to top of cabinets. Solid product. Opens and closes easily. Locks open. Looks, and even better, feels safe. Step covers and feet are anti-slip. Remarkable product for the price. Note - this is not light duty and weighs 13 pounds; perhaps not easy for a smaller person to carry around.",
        "Looks great, but it seemed to have been Cosco, not Werner.",
        "My new condo has very high kitchen cabinets. I'm 5'7\" but can only reach the lowest shelves without a stepstool and my old two-step was not enough. This one is perfect with wide steps and also has a very low profile and slides in next to the refrigerator. There were reviews about having difficulty closing it, but I've had no problem. A reviewer had suggested all you need do is give it a firm push with you leg, and this works every time for me. I also appreciate the higher weight capacity.",
        "I think this is a great stool. It's good looking, lightweight, comfortable, and much better than the older one I was using. It also has a locking mechanism. I really like that it is rated for 225lbs instead of the more common 200lbs. My only wish is that it was rated for 250lbs for when I am holding something and standing on the stool. Highly recommended.",
        "Sturdy. Top safety latch is rather stiff though. I suspect it will loosen up a little with time.",
        "Love this step ladder. I am 210 pounds and it feels sturdy and large enough for my big feet. Needs a bit of a push to close, but after one or two tries it is easy. Keep your fingers clear when closing so you don't get nipped as in other reviews. The closure could be improved, but it's not so bad. Will never close accidentally!",
        "1. very strong construction 2. large platforms feel non-slip 3. locks in open position and easily folds for storage 4. perfect height for reaching top of cabinets, hanging items on wall 5. I feel secure even when standing on top step. 6 rated for 225 lbs. which I am over and so far it is holding up well...but who knows I may be pressing my luck! 7. very good value, don't hesitate to buy if you need a step ladder/stool",
        "Sturdy and very functional. Need to be careful to keep figure out of top step and latching rail ... it really hurts when you don't. This step stool is exactly what we need in the office and our back wood shop. And it hold up just fine for a 230 lb overweight guy.",
        "Steps are wider for steady footings. Folding back requires hard pull up. Been using a lot in the kitchen since my cabinets are almost 9feet high. The height gives versatile various jobs ease of reaching, f.i. my husband can reach the 9feet high ceiling vent to change the filter. I am glad that I chose this step!",
        "Very sturdy and safe step ladder. Locks into place and has not skid steps and feet. A little stiff to close but will probably loosen up.",
        "Easy to fold and move around as well as store. Solid construction and very durable. Locks in place so you feel safe even on the top step. It's never so much as wobbled while I've been on it, and let's me reach the back corner of that shelf on top of my closet (I'm 5 feet even, so that's no mean feat!).",
        "Very sturdy step stool. Had one in my office for years so specifically ordered the same brand because of how good it is. Will hardly ever use the third step but I like it because it means the handle is further up even if you only go up to the second step.",
        "Very pleased with this purchase. It is very sturdy, has wide steps, and isn't too heavy.",
        "Fabulous! Closes up to virtually nothing, and leans straight up sturdily against the front of the washer so the closet doors still close. Great product.",
        "This is a very sturdy step stool but is difficult to set up and very heavy at, I believe 18 lbs, according to the UPS label. I would not buy another one unless you are more muscular than I am.",
        "Sturdy for reaching those high places when you have 9' ceilings.",
        "I've never had a step stool that I felt 100% safe standing on the top step. It's rated at 225 lbs. but I am sure it would hold a lot more than that. I recommended this baby to anyone looking for a top-of-line step stool without paying an arm and a leg.",
        "I’ve had one of these step stools for years and love it! So got one for all my kids. Locking mechanism is different but It setup and folded up just fine.",
        "The weight of this ladder makes it easy to carry. When folded the ladder stores easily. It is very sturdy while standing on it and the steps are large enough to allow confidence while working. I would without doubt purchase this ladder again and recommend it to anyone needing a ladder for around the house chores.",
        "Pros: Sturdy and folds up completely flat, so it's easy to store. I have not had any problems with it sliding around. Cons: Quite hard to open to locking position, and then even harder to unlock again. I almost always bang myself up a little when unlocking it.",
        "This step stool works well and was shipped quickly. Like other reviewers it is hard to close, but I'm hoping with time that it will loosen up and that it will become easier. we just had new cabinets installed and I needed a taller stool to get to the top shelf in the pantry cabinet, this gets the job done.",
        "Not as sturdy as you thing on the carpet and is heavy",
        "I am so happy I chose this stool. Its the perfect height, lightweight, and easy to store away. Folds up very slim, and the third step makes reaching things so easy. The price was reasonable and as usual Amazon got it to me quickly. I'm always a happy shopper with Amazon!!!!",
        "Large steps, big, solid struts, great grippers at the base and the top bar just right for steadying yourself. Just be prepared that this is heavy and takes strength to open and close. And as for the 225 weight limit, that's really not enough. A step ladder like this should be built to hold 300 lbs for sure.",
        "It's great. My apartment has 9-foot ceilings (Boo!) with windows that end just 6 inches below the ceilings. The step-stool makes it easier for me to hang my curtains after taking them down to wash. The only down side is that I'm a bit afraid of heights. I also wish that the top grip was taller.",
        "Awesome, strong, compact, wonderful, wonderful, WONDERFUL! Just what the doctor ordered! I am 5 foot 2 inches and have difficulty reaching the top shelves in my linen closet, clothes closet and kitchen cabinets. Excellant quality, folds easily and can hide it in my laundry room. I LOVE IT! This is my 2nd one...I keep one downstairs and one upstairs. Great price, great value, great packaging! 5 stars!",
        "Excellent quality, I am a heavy person and needed higher weight than most ladders rating. I think price is competitive on Amazon as compared with brick and mortar stores, and it was easy to buy.",
        "Perfect size. Slightly larger than most step stools, so works much better at reaching high places in my house. Easy storage because it folds down quite nicely.",
        "I needed to get a step stool for around the house and this Werner fit the bill. It is a very sturdy unit and very well built. The one issue I have is the locking mechanism. It can be tricky to unlock the steps but otherwise a great purchase.",
        "This is the perfect ladder. It's durable, sterdy and VERY safe for all ages.Highly recommended! !!!!",
        "I am glad I choose this ladder, it works well for all projects around the house and kitchen. I am able to hang it behind a door when it opens with plenty of clearance behind the door.",
        "This is the best folding ladder that I have owned. It is made very well and very simple to use. Open and closing is a breeze.",
        "Great step stool! This stool folds up neatly (between our washer and dryer) and is easy to open and close. It's very sturdy and I feel comfortable even on the top step.",
        "This step stool is the most rigid that I have ever used. Tried one of these at work and came home and tossed two older stools and ordered two of these. It does not wobble. The top step latches the entire assembly into one rigid part. The handle on top lets you hold onto something when using the stool. I Got a great buy on Amazon. At our local hardware store one of these cost 3 times as much as what I paid on Amazon.",
        "Solidly built, very tall, supports a lot of weight. Closing it takes some practice, but once you get the hang of it, it's not all that hard. If you're banging the crap out of it, you probably aren't closing it properly.",
        "This is a great step ladder, sturdy, safe and easy to fold. The price is just perfect so you can't go wrong with it. I bought it for my office and I expected it to be a little less heavy (like the one similar to this one I have at home), but I'm very happy with it.",
        "I had had the chance to use this ladder to clean my roll up awning. I was impressed with the stability of it and the quality was above average. Even standing on the top step occasionally, I felt very safe at all times. It might be a little heavy for some, but this contributes to the stability of it. It closes somewhat a little harder than I like, but I sure it will loosen a bit with use. The sturdy handle is a great asset as well. A great buy for the price.",
        "I looked at several different ladders which is hard to do on-line when you can't try it out. I am very pleased with the ladder. Very sturdy. Very thin for storage. We use it for our cleaning business so it is used every night.",
        "I recently moved into a new efficiency apartment which I am in the process of redecorating. Because of it's size, I could not use a full size ladder and this step stool fits the bill perfectly. Really sturdy, easy to use and compact to save space when stored in the closet.",
        "Hard to wax eloquent over a step stool but this is a good one for storing in closet and having handy. It is lightweight, but sturdy.",
        "I keep mine behind the coats in the closet. Its always there when I need it. I feel steady and safe when using it. Sturdy, will use it for a lifetime.",
        "Excellent product. I feel very secure standing on this stepstool. It locks so there is no chance of it collapsing while standing on it. The steps are wider and the safety bar helps me keep my balance. I definitely recommend this product.",
        "I ordered this step stool to replace an old wooden short ladder due to the wobbling and no handholds. This product fits the bill perfectly and is a lot safer than the old one. A little heavier, but a lot safer.",
        "A little tough to snap into place, hard to pull out of the locked position. Otherwise the perfect height, love the handle, good feel, feels of good quality, and holds my 218 lb self.",
        "Love it. Love the nice wide steps and security feel. Perfect for anyone. Wish I would have had this prior. Works well for cleaning ceiling fans or anything you need to do out of reach. Perfect!!!",
        "Love it. My mom came over and was using it to paint. She loved it so much, I bought her one as a thank you for helping me. Good quality and sturdy. Locks in place so you're safe using it. Highly recommend.",
        "Good stable three step stool. I prefer the latch that is on the older model. This latch is more cumbersome to operate.",
        "we recently installed cabinets in our laundry room that go all the way up to a 9 ft ceiling so we needed a step ladder to use them. We love this step ladder it feels very solid. I am comfortable standing on top step and reaching those top shelves",
        "This is a very sturdy step stool and very easy to move around the house. It allows an easy reach at multiple levels because of the three steps. The only problem with the latest version and the one just purchased is it is very hard to close the stool. The old version had a button to push on the top step. Now, it is hold and pull - that is difficult if your shoulder has been injured and is sensitive. Other than that, it's a great product and I would recommend it.",
        "Folding this ladder can be such a hassle sometimes! Having said that, the rest is wonderful! There isn't much to say but the fact it supports the weight stated and it really works!",
        "I have had this for years now, and it has served me well. It was well worth the original investment.",
        "You need to carefully consider safety if you choose this step stool. While the construction is reasonably sturdy the rise-run design for the first two steps is a significant concern. In real world use one backs down the steps often holding some object and safe design would call out a step run (width of the step) to be about 10'' with a similar 10 inch rise. In this product the first two steps are about 8 inches wide with about a 10 inch rise. The top step/platform is 9.5 inches wide. Having this smaller than optimum step width for the first two steps results in an increased possibility of missing one, particularly when descending and falling as a result.",
        "I bought this for my elderly father who likes to stand on folding chairs to hang or reach anything...This is light weight and easy to store and move around. Cheaper than lifealert.",
        "I am so happy to have found such a well made step stool! Since I am short and fairly old I wanted something stable, easy to open and close and well made. This offers all of those features,plus looks nice. It is easy to open and close and move about. It is also higher than most step ladders which allows me to reach things easier. The price is reasonable and shipped on time. I highly recommend this product. I love mine and feel sure you would be well satisfied if you purchased one too. Enjoy!",
        "Was much bigger than I thought or needed but nice and sturdy. Tall so can use it for many things. Easy to open and close as my 9 yr old did it himself. Very happy with this",
        "This a good study stepladder which is suitable for mechanic use.",
        "This Werner product is is very light, compact and for ease of use it is very simple, the product does need better \"how to use\" steps. It should also be noted that it takes a little more effort to close the steps.",
        "This ladder is a little heavy but stable and secure to use.",
        "The reason I've ordered this item is because we have an older version at work and I really like it. Although I do like the stool, this new version is harder to open, I was disappointed. The problem I have really is with shipping. Little or no care was given to packaging. Legs were sticking out of box and a rubber piece was slightly damaged.... very unprofessional.",
        "Got this for my wife, who didn't trust the shaky old kitchen ladder we had. I feel steady even standing on the top stop. Use it all the time to change ceiling bulbs, It's pretty thin folded up and hangs on the wall out of the way.",
        "Great short stepstool. It has a self latching mechanism and easy to handle while being sturdy. It suports heavier or older persons with wide steps with good treads."
    ]
}