{
    "entity": "Step Ladders",
    "text": [
        "I ordered this ladder about 4 months ago so this is a late review. I had purchase my first house at that time and complaining about a \"beat up but sold to me as new\" product was the last thing on my mind. While the product i received worked ok, i was expecting to receive a \"new\" product which is what i paid for. The difficulty of returning something this big is surely what they are taking advantage of. Your QC people needs to be fired. Im now in need of a step ladder. I dont even know if i should go with this company again.",
        "Pay attention to the negative reviews, don't ignore them as I did. The ladder I received appeared to be used. It had scratches and scuffs, and it was a bit dirty. I was going to just ask for a partial refund and keep it until I discovered the ladder was wobbly, which is a deal-breaker. Don't buy ladders on Amazon, it's silly. Go to a store where you can try them out.",
        "ladder is dirty and in poor status'a lot of scratch. box is in fine status.",
        "The box looked OK. Upon opening it was clear that the ladder was damaged. Exterior and interior parts were scratched. Not sure how so many sections had scratches when the box itself was intact. Sent it back.",
        "This is not a new ladder as advertised. One leg is a least 1/2 inch shorter than the other legs. It wasn't even in a box, just left on the front steps.",
        "This is a great ladder. Its the best I have had. I only gave it a 1 because it is being sold as new but arrived in an open box and the top tray was scuffed up. It is too good to return though.",
        "what I paid for was a brand new ladder that looked sturdy for under $120 what I received was a clearly used, beat up, wobbly ladder. I read the bad reviews, saw some were older and decided to go with it anyway and give it a chance. I could have skipped the wait, gone to my local walmart, got a cheap-o one and came out better.",
        "I've never owned a Louisville Ladder, but the reviews were solid and I couldn't beat the price on this 6-foot ladder ($85). I had some mild doubts about the quality before it arrived, but I was pleasantly surprised to discover that this thing is very solid and built to last for a long, long time. It's a little heavy to carry around, but not so much that it makes it tough to move. Highly recommended.",
        "This ladder lives up to all the descriptions in the ad and stability for someone like me over 70 is important. Safely hang or take down Christmas lights along with other tasks like painting and hanging fixtures provides much more stability than regular ladders. The top section for holding tools and hammer is well thought out and provides added value. I recommend this ladder to anyone but especially all of you DIY'ers over 50!",
        "I weigh roughly 270 lbs and the ladder didn't seem to have trouble holding my weight. I bought the ladder to change the air filter for my a/c unit in the ceiling. I can't vouch for it's use in other areas but I imagine it wont be a problem.",
        "This was actually a better price than any of the local hardware stores for a ladder, I just needed a ladder to be able to get into my attic once or twice a year I'm not someone who uses a ladder everyday or even every month but this is perfectly adequate for my usage seems very sturdy",
        "I bought one for me and one more for my neighbor. I had borrowed their step ladder to take my shutters to paint them. I’m only 5’4” and 125# But that expanding metal cross bar rivets had rusted out--didn’t notice it. So I bought GOOD ladders for both my neighbor after all I had broken it and one for me! Works great...KEEPING this one in back tool room---no rusting through from wet weather although I doubt if it would. Snaps in tightly--great!",
        "This seems like a good ladder. Unfortunately it is defective and I have requested a refund and a FEDEX pick-up for the return. The ladder is unstable and unsafe because one front leg is longer than the other. The right leg is 72-3/4\" long while the left leg is 72-1/2\" long. Therefore the ladder is VERY wobbly. The feet are riveted to the ladder and are not adjustable, so this manufacturing defect is unrepairable. I would normally have requested a replacement, but Louisville's quality control is so poor that I'll have to buy a ladder in a \"brick and mortar\" store so that I can inspect the actual ladder",
        "I never knew that having a 10 foot ladder could be life changing - well - it is. I no longer have to ask anyone for help doing anything that's high up. I couldn't believe that a ladder this tall could be so lightweight. Definitely a great purchase",
        "Received as \"new\". I work construction and have ladders on my job site that have fewer scratches then this new ladder. Box was completely intact but the ladder inside looked like someone hit it with a grinder",
        "I'm a short guy, have high ceilings , and hate calling the building super every time I need to change a bulb or smoke alarm battery. Even the tallest of compact step-ladders are just a bit too low, and this ladder solved my problem -- just high enough, not too heavy, more than sturdy enough for my needs. In the unlikely event I ever paint walls or a ceiling, I'm sure it would be great for that too. I keep it in basement storage, but I think it could fit in a typical closet without being too in the way.",
        "A ladder delivered to your door? That says it all. I wouldn’t have been able to buy one and transport it home otherwise.",
        "Damaged and bent upon arrival. Stay awag from this item.",
        "This ladder is in used condition, it has scratches and paint on the frame and the steps",
        "This ladder did not disappoint. The only thing I'd ding it for, but I don't feel it is necessary to is that you can only climb up one side of it. So, if you're hanging a ceiling fan, two people can't be on the ladder at the same time working on something high-up near the ceiling. However, with that downside stated, everything else about this ladder is great! A magnetic areas on the top for nails, screws, bolts, etc. A holder for your drill, screwdriver, and other tools so you don't have to keep balancing them on the top of the ladder or keep getting down every 2 minutes to get a new tool. Overall, great product!",
        "I received this item with some minor scuffs and dings to the legs of the ladder. I expected to get a ladder in brand new condition since that is what I paid for. Very disappointing. Overall the ladder seems sturdy and well made and should work just fine.",
        "I ignored all these bad reviews and decided to take a chance. Ladder arrived and it’s very used and beat up. Probably had been used at construction site for a few years. Product description should state that you selling a used product. Ladder itself seems pretty good quality, I will return this one and probably will get the same but new.",
        "The only reason for not including 5 stars is that most ladders today require you to purchase paint tray seperately - this is more about the industry than actual product. Highly recommended purchase. The strong magnets on top as well as additional storage for hand tools is outstanding. Sturdy ladder- what else can you say!",
        "I love this ladder. It is very sturdy, has holes for screwdrivers, indent to stabalize a 1 gal bucket, indention for screws n stuff n a magnitized plate to secure puddy knife ir 5 in 1. The hinges need a little oil but thats it.",
        "Louisville makes the best ladders on the market in my opinion. I am a very large guy and want stability beneath me when climbing a ladder. This ladder from Louisville provides that stability. Could not find in stock at local stores and the price was better on Amazon anyway. I would definitely purchase this ladder again.",
        "THEY SHOULD PUT THEM IN CARDBOARD BOX OR BUBBLE WRAP, THE LAST TWO I RECIEVED HAD HUGE GOUGES IN THEM.(How would you like to get a new item, scratched and looks used!",
        "No \"paint can holder.\" I didn't notice until it arrived. No problem as that's not why I bought it, just a 'future' customer warning.",
        "So much better than that cheap aluminum ladder I have used all my life. Nice tray at top. Feels solid. Heavier than the cheap aluminum ladders but worth it and good exercise carrying it around.",
        "Ladder arrived fast in a box, in new condition, nice sturdy ladder. It replaced my 100 year old wooden ladder, I feel safe and secure now. It does not come with a fold down paint tray, I purchased one for it.' My biggest gripe is that they stuck the UPC/Bar code sticker right on the Louisville name ! :-) Duh, why do they do that?",
        "Bought this to replace rickety old wood and aluminum ladders. It's not too heavy and is super sturdy. I'm happy we're safer doing all our projects!",
        "I tried three different companies and more expensive than this one But this one rocks , i will recommend it specially to people who like to work at home and do stuff using the stairs like me , its great",
        "My husband bought this ladder for himself...... I found it and use it all the time light weight easy to move around The neighbor ladies I see got their own",
        "After several months of use, ladder are breaking down onn one of the legs.",
        "Do not buy this. You will get a used and badly damaged ladder. When I received this ladder it contained several scuffs and scratches as well as torn parts. The bottom rung is so badly torn that you could easily slice your foot in half if you step on it. The ladder looks like it went through hell. Save yourself the trouble and go with a different option!",
        "This is my second Louisville ladder. I loved the shorter one so much when I needed a taller one I went with the same and don’t regret it. Arrive on time and no issues.",
        "This product had scrapes, six different stickers stuck all over it and black markings on the top step. I will keep it since it works, but it should come brand new as promised. Also, it was delivered without any kind of wrapping.",
        "The ladder arrived unpackaged with scrapes, scratches, and dents all over it. I dont know if this ladder is previously owned or if it was just banging around in a shipping container for the last 10 years, but it is FAR from \"new\".",
        "This is a standard ladder which works fine but I thought I ordered a NEW one... and the one I got was clearly used.",
        "Great heavy duty ladder I am a large guy and I feel stable and safe on it no problems doing work on it and the tray on the top is a nice bonus",
        "I never needed a ladder before but now that I do I'm glad I bought this. Very sturdy and looks just like the photo.",
        "Doesn’t ship in a box but this is a great ladder according to my husband. He’s a big guy and it holds him fine (6’4 and 260 lb)",
        "Well, I suppose overall I was a little disappointed. I purchased it to replace an 8' fiberglass ladder, and It's heavier than I expected...almost as heavy as the 8'.",
        "Like this. Well made and sturdy. A perfect ladder for home chores and repairs. Thanx",
        "For some one who is afraid of highs, more of unstable and falling to the pavement, i absolutely love this.",
        "I love this ladder. I believe it to be the best quality and best design of any ladder. I have used many ladders in construction and I am always very happy when I am able to use one of these nice Louisvilles. I bought this 6 footer for my home and could not be happier. It is a very sturdy and stable ladder. It has nice grip on the feet, and the top has many useful places to put tools, parts, & paint. I also like the magnetic strip on top to hold screws, ect.",
        "The first ladder came and was uneven. The left leg was not as long as the right leg and it would wobble significantly. They replaced it with a second ladder without any hassle. The second ladder was also uneven and would wobble, although slightly less so. I gave up after the second ladder.",
        "Item received in damages box and definitely used. Scratch and marks noted",
        "The ladder came right on time no problem with it no dents nice and clean.",
        "Shipped quickly and great product. We have multiple of these ladders in our home.",
        "This is the best latter have used by far. It's extremely sturdy and light. I've purchased a few and will continue to do so",
        "I'm 6'5\" and 338 lbs and never felt like I was talking to my impending room. That says a lot about the quality of this ladder.",
        "Perfect. Well made, sturdy, and very easy to move for 70 yr old woman 4'11\"",
        "Awsome never really knew I needed one until I got one",
        "Very lightweight and easy to move around and store on hooks in the garage. I'm a larger person and have no issues using this ladder.",
        "This ladder arrived by UPS with a lable attached to the side. It arrived in good shape, no nicks or scrapes and nothing broken. In use there is nothing flimsy about its construction. it is a sturdy platform for working above my head and that's what I wanted. The platform at the top has holes, magnets and little trays to hold various items and these work well. The set arrived on time as we have come to expect with Amazon Prime.",
        "I received it all banged up and wobbly. I’m sure it’s used.",
        "I am a woman in her 60's and I am fit. I can move this ladder around the yard easily.",
        "Love this ladder however by not covering it with plastic to ship it got a lot of unnecessary scratches.",
        "I already had one larger one, so I knew how sturdy and felt strong underneath you. I do like where you can hang things",
        "Reasonable quality and features for the price. Would have been higher rating if it came with standard drop plaform.",
        "This latter is awesome. First off all, getting a ladder delivered is wonderful. Secondly, it's a well built ladder. It feels very sturdy yet is easy to maneuver. Has a lot of neat features like a place for your drill, screws, screw driver, etc. There is a magnetic part on top that also helps guard against metal objects falling.",
        "This is a very sturdy, well-made ladder. It has lots of tool slots and a magnet area for screws and nails on the top. I would have given it five stars, but I ordered the pail shelf direct from the manufacturer ($18.00 plus shipping ) and I found the instructions to be a little confusing and the pre-drilled holes in the ladder were a little off, making it necessary to get out the power drill.",
        "i like the light wieght of aluminum ladders - but they just dont last. This is solid, ladder with great cushioned feet. Its not too heavy and I am sure it will be last ladder i need to buy ---for a long long time. Only complaint - if you like the old fahioned fold down tray this doesnt have it...so for painting you have to hold onto your own paint can.",
        "I love this ladder. I am a woman who does a lot of home projects and those heavy bulky ladders are very difficult to pull in and out of the shed all of the time. This was a perfect solution and is over a year old and other than the paint drops I've gotten in it, it still looks brand new. Definitely recommend this ladder.",
        "Well built ladder, light but durable and easy to handle. Great for around the house projects.",
        "This is a nice, tall, sturdy ladder. It's light enough that I (a tiny lady with wrist and hand problems) can easily carry it around and set it up, but stable enough that I feel safe using my electric hedge trimmer while I'm standing on its higher rungs. Plus I love that they delivered it so I didn't have to wrangle a ladder in my little car and haul it home from the store.",
        "I like the size however I was sent a used ladder I complained. they picked it up and resent it to me.Same scratches and USED. Disappointed to say the least",
        "Good sturdy ladder. Bought to replace our previous one that's feel had broken.",
        "I am very disappointed. I ordered Brand new ladder and paid for the brand new product and i received the used and the dent on the ladder. Very very disappointed.",
        "This is a great ladder. It’s sturdy and has great tool storage on the top.",
        "Just what I was expecting and having it delivered solved a problem of not having a way to get it home from a box store.",
        "Arrived looking a little beaten up. But it's a ladder, so we don't care that much. It's sturdy and has been perfect for all of our jobs.",
        "Great Ladder to replace my old rickety wooden 5' step ladder. Seems to be nice and sturdy and love the top of it with places for tools etc.",
        "Used it to install a garage door opener. The opener was a pain in the ass to install by myself, but the ladder helped hold all the tools. The magnet is very strong, held all my screws.",
        "Bought this as a gift for my Son who is proud new home owner. He loves it. Very solid product.",
        "Very well made ladder and a great value. The pads on the ladder legs are substantial, as are the locking braces. Much higher quality than a same - priced competing model by another brand.",
        "Very sturdy ladder, worked just the way I wanted it too!",
        "Great ladder, Louisville ladders are always the first ladders grabbed at the job site. Sturdy, stable, very handy magnet and tool holder on ladder top (including one for your cordless drill). Would be nice is there was a shelf to hold paint, etc. but understand that is available as an option. Shipping was very fast.",
        "I received a used ladder, there were multiple scratches and the legs are uneven. Its a disgrace!",
        "Very sturdy and well built. Very hard to open and close.",
        "Great ladder, very sturdy and does its job.. Pros - feels sturdy Has a magnet on top of ladder to hold loose nails Folds and stores easily Cons - none",
        "had to wash it to get the mud off it. that ladder got one heck of a ride in the delivery truck. so, it's here, it works and time to move on.",
        "Great ladder, constructed well, very pleased!!! Finally replacing that rickety old aluminum dangerous one!",
        "This ladder is a very dependable and sturdy ladder. It is safe and easy to use.",
        "Thankful I did not have to dispose of a box for this. Arrived in great shape. I am able to manage the ladder by myself (I am 64 years old). Very stable and easy to use",
        "You can spend less but this ladder is very well made & doesn't rack when you stand on it. It has wider feet so more stable than less well built ladders.I was not familiar with the brand but would look for it if I need another ladder.",
        "Heavy duty says it all, with supports for tools and paint.",
        "I need a bigger one but this is great for what it is. Worth 100$?? Idk but pretty close.",
        "The ladder feet are not square so it's a little wobbly. Overall the ladder feels fine, but the 4 legs do not touch the ground evenly. Other than that it does what it's supposed to do.",
        "as a plumber I know a good quality ladder, i have used many ladders yet a quality ladder is always the best with a weight rating of 300 lbs. no one could ask for better quality, I will be ordering an 8 ft Louisville next.",
        "Good durable ladder that is fairly light for it's size. Nice magnets and slots at the top to keep your tools in place. Wide base keeps you steady.",
        "Very sold and sturdy ladder. I love how there's a spot on top that is magnetic as well as grooves and places to put my tools, nails, screws, etc. Used for this for the past several months on lots of home projects. Money well spent.",
        "Very sturdy, wish it came with the paint shelf, I had to buy that separately and assemble. But very happy with the end result.",
        "Very sturdy, pretty lightweight, and looks good. The only problem is that it is a little hard to open as the joints seem a little stiff. I would recommend this if you are looking to buy a ladder.",
        "Perfect ladder for homes with 9 foot ceilings. It seems sturdy enough to hold way more than its already high weight rating. Strong recommendation for this company and this product.",
        "Very sturdy ladder. I weight 260 and had no issues.",
        "We bought this ladder to keep in our office for when servicemen come. It has been so helpful. It is so worth the money, it doesn't take up much storage space and is very sturdy. Couldn't ask for better.",
        "Scuffs around the ladder as if it has been used. Nothing wrong with it though.",
        "This is a sturdy ladder at a fair price. The fiberglass construction makes it easy to move and carry, and it is very stable. Good size for working safely in rooms with high ceilings.",
        "Others have written, \"why didn't I get this a long time ago?\" Same here. Just as described. Solid, yet not heavy. And 6-feet is just right for multiple things that a stool won't let you reach."
    ]
}