{
    "entity": "Manual",
    "text": [
        "Without question, this is the WORST can opener I have ever owned. It has gone from inferior to defective to useless. On receipt, it would open a can if the can was positioned *just so*. In the two months and perhaps ten cans opened since it's utility has deteriorated to the point where it will not open anything. I am not sure the trouble lies with the angle of the cutter or the dullness of the cutter itself. Regardless, RUN AWAY from this utensil.",
        "I forgot that I had purchased this but during a move I discovered it lost in the kitchen. I was very happy that I found it because I needed a new can opener. What a joke. It never hooked onto the can correctly and I guess unless the can you are opening is absolutely perfectly round without any dents or what ever, this doesn't hook on and you are left to open with a knife or the ever popular dollar store opener-which by the way worked much better than this. Save your money.",
        "Can opener worked ok when we first got it, although the magnet never worked. After 2 months the can opener does do not work at at all. Very poor description, and product representation. Please do not consider this product. I am an Amazon Prime member and can’t believe they do not stand behind this product for more than 60 days. Awful product. Worked ok for a week, then magnet stopped working. After two months it will not open a can. Poor product description, cannot believe Amazon prime does not stand behind their products for more than 60 days. Do not purchase!",
        "I really like this little can opener. I bought it when I couldn't find my cabinet mounted \"Swing-A-Way\" after moving. I needed something that I could hold easily and without pain. (Arthritic joint pain) It clamps well with a minimum of effort and the handle turns easily for a handheld can opener. The lock is a nice feature as is the magnet to grab the lid. It's a little bit underpowered since lids are sometimes tricky to extract, but it works most of the time. I would definitely repurchase",
        "Best can opener I've ever used. It locks onto any can easily and cuts smooth and quick. I never struggle. I use the little magnet to lift the can cover into the trash to I don't cut myself, very nifty. I had one before this for four years and it worked perfect the whole time. A house guest broke it when they didn't realize they had to push the button to open the device (thus breaking it's ability to lock on, but they had to pull extremely hard to break it and most people would realize they were using it wrong). Needless to say, I bought the same opener without hesitation again.",
        "If I have to take lessons to use a can opener, that makes it &*^% in my book. I bought this because I fell for the hype. I mean, how do you mess up a freaking can opener? Unfortunately I did not test it before packing it in the RV kitchen drawer. When you are camping the first time you use a can opener, you REALLY hope it works. It took about 10 attempts and much frustration before I finally got the can open. It kept popping off the can every half inch or so. Pitched it in the trash when I got home.",
        "This is the best can operated I’ve ever used. I’ve owned mine for over two years and have never had an issue with opening cans of all sizes. It latches and turns smooth and easy. Open to full extension by holding down colored thumb lock button for easy cleaning. Only when a can is dented is there a problem with a complete turn on the can, even then a little adjustment is all you need to completely remove the lid. I highly recommend the Zyliss Lock N’ LIft Can Opener.",
        "So this started out good (or at least OK), but it went downhill pretty quick. It is really hard to get it to even puncture the lid now and after it grabs a hold it will just spin the handle. I also had the problem another reviewer did where it cut into the side of the can. When I looked on the counter I even noticed small metal shavings from the side of the can. I'm not sure what the problem is, but it feels like the plastic body is not rigid enough as I can feel it flex when initially attaching it to the can. I'm now shopping for a new one and this is NOT on the list.",
        "Don’t believe the hype. I bought this for our camping box based on the strong reviews. After the can is open, the top is lifted off, and you are left with a razor-sharp can edge. Compared to a normal can opener, which leaves the original smooth can lip in place. Why on earth would sharp edges ever be considered a good thing? Why was this opener even invented? It makes no sense at all! After a week meticulously navigating my hands away from sharp can tops and having the discarded cans shred garbage bags, I can say, this product is all about the marketing - it makes no sense in use.",
        "did not come as the some item showed in picture - the lock is a flimsy piece of cheap plastic. update after opening a few cans: the cutter is sharp enough to cut open metal cans without too much efforts. i hate the lock design as the lock does not align with the slot well when you trying to open a can and I can tell it will break very soon. also the magnet is so weak to even pick up a small can lid such as tomato paste very awkward to use.",
        "I had an old fashioned metal can opener from the 70s that always worked. When we lost it we replaced it with this one. The ZYLISS is a piece of junk, it won’t grip some cans the right way (or right depth) so the lever just spins without cutting. It locks at a certain point so you can’t apply more pressure to make it cut. Plus this thing is bulky to store in the drawer. Avoid this one.",
        "Not even a yr later and it will barely open a can",
        "These are sold at the finest grocery markets in LA. Zyliss is the very best in many things. I have had it for about 2 months. It's very sturdy and very nice feeling to hold it in your hand and it holds the can perfectly and works great. Zyliss is Swiss designed and manufactured in China. I saw reviews saying negative comments and all I can say is Zyliss is a first class product and one of the best products in my kitchen.",
        "Works like a Charm! I've had multitudes of can openers over the years. In my older years, I don't always have great hand strength, but I don't need it with this opener. It works perfectly. It locks into position on the can easily, and I particularly like that you have to click the red button to release it - and the lid does not drop inside the can - - -the magnet holds it so you can remove it and throw it away. I highly recommend. It's a great value and works very well.",
        "I’ve Owned this product now over a year - and it sucks! It has started to not cut, jump off the can you are trying to open, and the worst part won’t cut the lid completely through and through. Do not waste your money. Going back to an electric one.",
        "This is the third opener I have had to buy in order to get one that worked. The others I bought were always highly rated and not at all cheap, as openers go. This was the first time I had seen a Zyliss one available The others were exceptionally clunky and rough to use, left a lid that was a deadly weapon and, sometimes, could not be made to get all the way around the can. This one, made by a company well known for its openers, is a dream to use--smooth and easy to manage, with a little lock that prevents the blade from slipping off the can. At last!",
        "The blade is not adequate to cut all around the lid in one pass. It often stops cutting and I have to take it off and try to reattach it several times. I don't know why it has a high rating. Sometimes there are areas on the lid it just won't cut through. It is even harder to open a #10 can with it.",
        "So I’ve waited over 6 months to write this review to see how it’s stood up. I LOVE this can opener. All the other ones, even expensive name brand ones always started to turn hard or break. This one still works just as amazing as the very first use. And I use it a lot! I love the magnet feature to lift the lid off once you cut it. Also, the handle is extremely easy to use which is great for my poor little arthritic hands and it’s also very comfortable with the rubbery grip. I’m so glad I actually found an amazing quality kitchen product that is standing up amazing and has SO much life left in it!",
        "My husband, who loves \"As Seen on TV\" (!!!!!!!!!) bought me one of those battery powered can openers that you place on top of the can, push a button, and it travels around the top of the can and opens it magically. Well, it never worked for me! (maybe once or twice?). I decided to go back to this old-fashioned kind and I'm thrilled. It opens the can every time with little effort from me. The plastic release button seems like it may give out one day before the rest of it does, but I've been using this for several months now and it's holding up well. So far, so good!",
        "This is a great can opener! It's very lightweight and easy to turn. The lock feature is great, and it opens cans very well. I also like the magnet feature for pulling the lid off. I used to use the Good Grips can opener, which worked very well for a long time. But recently it started to get stiff and difficult to turn. So I decided to replace it with the Zyliss model, which got good reviews and is a little more compact, so it easily fits in the drawer. Great value for the price!",
        "I love everything about this can opener. I have some neuropathy in my hands following chemotherapy and was having problems with our old can openers. I’ve bought enough plastic handled openers that fall apart in months, so I was a bit cautious. This is easy to unlock, use and clean. You can pop this baby right in the dishwasher.",
        "The first few times I used this is was great. However, that’s about where my satisfaction with this can opener stopped. Now if you’re lucky after 3 or 4 tries you’ll finally get it to lock into the can and open it. By then the rim of the can is bent and it’s tearing the label as it cuts.",
        "The first one did not work and it was replaced free of charge. The replacement worked for about 10 uses, and it felt great and smooth to use, but then stopped functioning. It would open parts of the can, and as I rotated the lever, other parts were clearly dented, but the circular blade would not cut through completely. I would have to go over and over and over and over again to open the can. It’s a shame.",
        "At first, I was very happy with how well this can opener worked. But the thing is, this gadget has just ONE job: open cans. If it can't do that job for more than a couple of months than it is just a complete waste of energy, money, and drawer space. I'd like to finish this review by giving a recommendation for a can opener that DOES last, but as of yet I have not found it. However, after fighting with this can opener to actually cut the lid but instead cutting my hand, I firmly resolved to write a negative review to save others from the same can opener misery.",
        "Really like this can opener. My wife refused to give up the her 1920s metal can opener until it broke into 4 different pieces (accidentally) while I was using it. Got this home and wow we love it. Its a bit bulkier, so its easy to hold on to, and it goes onto the can lid very easy. The gears turn super smooth, so very little effort needed to use, and the magnet on the top is great to take the lids out with the hazard of being cut. All in all, its a great opener and definitely recommend!",
        "This opener has never locked onto a can properly and once I get it hooked up and work my way around the can, it leaves a nasty, dangerous, tiny burr on the edge of the can. I have cut myself a few times on the burr and a few times the burr has even fallen off into the can. Can't imagine the damage eating a tiny, sharp, metal shard could do. I cannot recommend this opener.",
        "I probably should have looked at the pictures more carefully before buying this based on all the good reviews. I thought the magnet attached as one opens the can so that the opening and lid removal are all done at once. I tried several times to lift the lid with the magnet, but it never worked. Since it also misses spots on the lid, I'm returning it. Even if the magnet did work, getting it into position is more trouble than it's worth.",
        "Durable! is the word I would use to describe it. Easy enough to use, holds easy in the hand and makes use of the Locking mechanism when it's latched onto the can. My only complaint would be that the unlock button you see on top is klunky and requires some effort to use and unlatch. It will auto-lock shut even without a can. Not exactly a problem, just annoying you have to use that latch locking-mechanism 3 times per can opening. 1 to open it, another to Re-open it knowing it shut on you the first time because you weren't paying attention, a 3rd time after you've used the can opener and need to detach it.",
        "I used to think this was a good can opener. Not any more. Today, when I needed it, it failed. Just two years old too. The cutting head would just spin and spin and not penetrate into the top of the can, and when it finally did penetrate, it would not keep cutting. Took me 10 minutes to take the top off of three 28oz tomato cans. Headed for the trash.",
        "Every time I grip the handles to close it on a can, they feel like they're going to break. Over half the time it won't completely open the can unless I'm gripping the handles super tight, and angling it just perfectly. The magnetic portion at the front is not helpful whatsoever. Sharp design, but that's about it. I would not recommend this product to anyone.",
        "Wish I could give it ZERO stars. Worst can opener ever. It doesn't grip the can and EVERY time the can falls out of the grip into the sink. I am throwing this away. Don't waster your money.",
        "Just threw mine away never opened cans properly. It would not grab and hold the rim of the can long enough to open the lid, turning the handle it would slip and pop off the rim Almost all the cans I tried this opener could not continuously continue to open the can I ended up with 3 or 4 pierced slots and prying the lid open by hand with dangerous sharp edges.",
        "We have been through a lot of lousy can openers, so it is nice to finally find one that works. First off, it is ergonomically designed to comfortably fit in your hand. Next, clamping it onto the side of the can locks the can opener closed so it stays connected throughout the entire process. The crank is large so it turns easily, powering its way around the can. And when the lid has been removed, the magnet allows you to pull it up and away from the can easily.",
        "Wow, this thing is a piece of crap. I tried using it on a can from the top, and it got a few turns before it stopped entirely; then the knob kept coming off. Figured maybe it's from the side, nope. That didn't work either. It feels flimsy, it doesn't lock worth anything, but most importantly, it doesn't open cans!",
        "Easy to use, doesn't require a great deal of grip strength and a smooth cut every time I've used it. I was sick and tired of fighting with my OXO/Good Grips type can openers, which failed to create a clean cut and left jagged edges and/or an uncut lid. I've got a 4 pet household so I am opening cans on a daily basis. This is an excellent product at a competitive price.",
        "I had one of these openers before I lost it in a move. Loved it. I just reordered one and it is horrible. I honestly doubt that the quality has gone down or I received a knockoff. I’ve tried opening three cans with this new one and it just doesn’t work. I had to resort to prying the kids off through the slits it did create with a knife. Maybe mine is misaligned? No clue. I buy a lot of stuff from Amazon. Some things are better than others. This is not the replacement for my lost can opener I expected.",
        "Just when you think you’ve seen the total evolution of the can opener, then this lil beauty comes along. With all of the technology in the world they could never make a can opener worth a darn bit this thing is awesome! For those of us who don’t have the hand strength we once did this opener actually click locks into place so you don’t have to squeeze to hold onto the can. And afterwards you just click the release and done deal. It also has a magnetic lid remover which a novel idea but not quite what I expected. That part didn’t do much for me but the opener itself is a good product. I WOULD RECOMMEND.",
        "this was a very disappointing purchase... i am left handed and thought maybe i am having the same issues with this model as i did with my hand cranked old can opener so, i decided to have my husband try and unfortunately he had the same issues with this opener as with the old one we have... guide crank catches and then does not......went back to attempting to use the old one... am returning",
        "Not happy. Really love this type can opener...very bummed it quit working after first couple uses",
        "This is one of the worst can openers I've ever owned. I threw it in the trash after a short time. Why it has good reviews is beyond me. I wasted my money after reading all the glowing reviews.",
        "Best manual can opener I have ever used, hands down! This is one well engineered can opener, far superior to much more expensive manual openers. Its does not miss cut the lid, ever. A very positive locked down click will let you know you have engaged the can properly and you are ready to open a can. Sounds simple, but it is very surprising how many can openers I have bought over the years that just can't seem to open a can. Not a single problem with this one. This is the King of can openers!",
        "This can opener worked well for a month. It has now been 45 days. The can opened does grab the can so the lid doesn't open. I would not recommend it.",
        "I used to use the cheap can openers and just expected to replace them once a year or so... Recently a different cheap brand opener broke when I was cooking for an important event which was really frustrating so I decided to try and buy some more expensive ones. They feel solid and like they will last. If they break on me though I will update the review.",
        "This product is well built but it does not work well and is not functional like you would think. When you are working on opening a can the lock mechanism locks into place and you have to pull it open again to keep opening your can you probably will do this about 6 times in your venture to open any can. Next this can opener won't always cut it just runs along the edge and you have to really work at it to even get the initial cut! Over all I don't understand why its Amazons choice is doesn't work well at all!",
        "My husband bought my this can opener because I think he was tired of hearing me complain about my old worthless can opener! This is so nice and smooth, I like the locking feature while you're opening it. It always leaves a slight piece un cut at the very end which doesn't allow me to use the magnetic piece of crab the lid off, but honestly I don't care about that feature, I'm just happy to have a working can opener that cuts smoothly and doesn't leave my frustrated!",
        "i feel like my life changed when i got this. one of those small things that just makes life easier. my previous can openers were always so crappy because they didn't oepn well, they couldn't stay in the lid to open it proerly, were hard to turn, etc. i love that thd handles lock into each other and that there is a magnet! i used to keep a single small magnet on my fridge for the sole purpose of grabbing the lid, but we got rid of it (didn't want our baby to swallow it) and i don't miss it.",
        "I ordered a second ZYLISS for camping. My first one is still going strong after 36 months heavy use! The best opener I've ever owned, the blades have stayed sharp opening 2-3 cans per day. Is it perfect? No. I've found if the rim of a can is bent, or handles aren't locked together, (red catch) it may not cut evenly. After I got used to this, tho, it was no-problem and a breeze to use, and I've recommended it to friends ever since... I like it enough to buy a second one after 3 years, and recommend the Zyliss Can Opener to my friends.",
        "Terrible unreliable very poor design & craftsmanship can opener. Dont buy, works 50% of the time and even then i have to go over & over the can to open it because the red \"locking mechanism fails\" cant wait to return thank goodness for the 5 year warranty.",
        "The Zyliss can opener I purchased worked badly upon receipt. It had to be re-positioned repeatedly to \"catch\" onto a can. After no more than a dozen (annoying) uses, it could not be positioned onto \"any\" can at all. Of course, this makes it totally unusable. I have no doubt you can buy a better can opener at a dollar store.",
        "Believe the other one star reviews. This is the crappiest can opener I've ever owned. It won't latch on to the can. It slips off. If it does latch, the gears don't line up for you to turn it. Just all around a very bad purchase. I returned it after attempting to open three cans and it mangled all three. Oh and the handle popped off... Save your time and money. Pick a different can opener.",
        "I was influenced by the reviews but found this to be an annoying device that belongs in the garbage. And will be in mine tomorrow.",
        "I owned this very canopener for several years and simply loved it. It was a solid, well functioning kitchen item. Unfortunately, I dropped it and pieces fell out that could not be put back in. In spite of many one star reviews, but simply based on my own experience, I ordered a replacement. The plastic is lighter, does not feel solid. The locking mechanism is very flimsy. But most disappointing is the fact that it won’t open a can. A truly pitiful piece of equipment. Please look elsewhere. I’m not sure why companies take something very nice and turn it into crap. So very disappointing.",
        "SAVE YOUR MONEY! I used this to open cans. It worked for about three weeks and now it does not work at all. It does not even clip on to my cans anymore! $16.00 WASTED! GARBAGE and Can not return Date up to return was Sept 7, 2018! So disappointing to read people’s reviews, that gives merchandise five stars and can opener does not work past three weeks! Maybe the buyers of these can openers wrote their reviews first week of getting in the mail! Either way save your MONEY!",
        "I don't often take the time to write reviews, but when I came to Amazon to purchase a replacement can opener because this one is useless and saw that this one is still the best seller, I had to. Getting the opener to attach to a can is damn near impossible. Sure, it works great once attached, but who cares about that if it is so much trouble to get it attached to the can? My arthritic mother had absolutely no chance using this thing. One of my worst Amazon-review guided purchases to date, and I purchase a LOT from Amazon.",
        "I have gone through several regular can openers in the past few years that ALWAYS end up breaking within a year so I decided to spend a little more money and try this one. It works great! It has a slim design that locks into place while closed for storage and also locks on the can itself so no accidental slipping. Easy to turn the crank and makes a smooth transition around the can while cutting. Only time will tell how it holds up! I will update this review once I’ve had it for awhile!",
        "This can opener is horrible. I usually love this brand, but I hate this can opener because it is extremely difficult to use. If the angle on the can isn’t perfect, then it doesn’t work. I frequently have to get my husband to use it for me. You should know that I may not be super strong, but I am an average sized female; I lift weights twice a week and still find this can opener a workout in and of itself. Save yourself from misery and buy another can opener.",
        "They click in place to hold on to the lip. You can run these through a dishwasher to clean them. Nothing worse that various food products building up on the blade & gear area and you transfering that bacteria to your new food. There is a magnet on the facing edge to aid in lifting the cut open lids up. The grabbing when on my last one lasted about 5 years and I use it a lot.",
        "Worst can opener ever had and the worst Zyliss product ever used -- doesn't cut consistently which means you need to go around many times to re-cut sometime it splashes tomato sauce all over the place and also magnet doesn't work at all to lift the top. It's a complete piece of junk. Very disappointed in Zyliss.",
        "worked 2 times on regular cans but broke down on a big jar and magnet does not lift the top. Also not able to return even as a prime member. Amazon customer service returned my money but I had to call in for them to fulfill my request for money back. thank you",
        "Buyers of this can opener had written some nice reviews, but I must admit I remained skeptical as I couldn't image that a manual can opener could be that good. Well I stand corrected - this can opener not only has a really sleek modern look but is a delight to use. My wife doesn't have a lot of strength in her hands and has commented how smooth the opener works - we can't say that for previous ones we've owned. UPDATE. We just bought a second one for are other home. That’s how much we live this opener!",
        "We have had such horrible luck with mechanical can openers. How bad you ask? We gave up and used a p38 for more than 6 years. Needless to say, that dude was shot and we were hunting more p38s. While browsing through the p38s on Amazon I saw this and decided to give it a try. So far so good, but, if this device breaks within the first year we will never buy another mechanical again, and will happily buy the wrist wrecking 20 pack of p38s for the same price. Only time will tell but I get the feeling this guy will last 3-5 years. Will update if anything changes.",
        "This worked great, at first and then slowly stopped working. I should have known a plastic can opener with mostly plastic parts would break down. Ours lasted less than a year. It stops working when you need it most. I so wanted a new and revolutionary can opener. I got China crap.",
        "Agree with other 1 star reviews. I'm not sure if they changed QA or what, but got this based on all the great reviews and 90% of the time it won't even puncture the lid or strips right off. We barely used it and it is going in the trash. Stick to name brands.",
        "The materials appear and feel quite cheap, and the item just wont stay on the can. It punctures the lid, and then half a spin of the knob, and it comes off. I was hoping it was the can I was trying to open that was the problem, but I have tried it on about 10 cans now and it's extremely frustrating. Since it doesn't open the can, the lid lifter never has a chance to lift the lid, and I'm afraid in my frustration it would be easy to get hurt trying to dislodge the lid. I so want a good can opener, I don't know why a simple thing has become so difficult to find.",
        "It leaves a nub of metal on the inside of the can, instead of a totally smooth cut. As I was trying to spoon material from the bottom of a can, the nub on that can sliced a 1 inch or so gouge on my finger, also the alleged magnet to lift the lit is just a tiny but f a magnet which never, ever lifts the kut.",
        "I have had this brand in the past and it was great! So I ordered two can openers. This can opener would NOT open the can right out of the box. I would have to try five or six times to open one can. When it would go to puncture the can the bottom gear drive would pop off to the side of the can. Sending this product back.",
        "Don't waist your time and money with other manual can openers. I have been resisting my wife's pressure to buy an electric can opener for over 2 decades. During this time, we have had many can openers that all had the same issue. Their design, regardless of the brand and the price tag, was very similar based on the same principle and because of this the issue was the same. The two arms will end up bypassing just slightly but enough to mess up the needed contact between the driving gear and the blade. This can opener is designed to always keep those two critical components in the needed relationship. No more frustration for any in the house.",
        "Mine doesn't work. I've tried four different times, 15 each. It appears the angle is wrong. My disability prevents me from returning it. Amazon should just send me a return label. They won't. It is a pretty color. Paper weight? I wish I knew how others get this to work. I just tried again. Just doesn't work.",
        "I like that it easily snaps into place and locks until ready to release. The magnet doesn't work very well for lifting the lid, possibly because there is usually a small bit left attached to the can after opening most lids. It's not strong enough to overcome this. I don't miss the magnet, because I don't generally use that feature, but that's why I rated it 4 stars. I did have trouble opening the first can I tried, but discovered it was a few dents around the edge that hampered its function. It's smooth as silk on cans without damage. I have arthritis and find that I need expend very little energy with this, so I really like that.",
        "Can't get it to open the can. It just stops, so you have to keep taking it off and starting over in another spot. When you finally do get the can open, the lid falls inside the can. Wast of time and money!",
        "I tried to open a can of chicken, and no matter how hard I pulled the handles together, the cutter wouldn't pierce the can. When I jammed it onto the counter, it finally broke through, but then the gear wouldn't catch, slipping as I turned the handle. This was a complete disappointment.",
        "I have had this can opener for a while now and tried to make it work but I just can't take it anymore so I'm looking for a replacement. This one DOES NOT stay clamped onto the can you are opening. You can clamp the handles completely together and the cutting wheel will still slide off the can. You'll have to re-clamp the opener on the can many, many times for it to open the can. Sometimes I need to use an alternate can opener to finish the job because this one just doesn't work. It's also rather expensive; buy a simple opener for 1/4 the cost and be much happier. This opener is over-rated!!!!",
        "It will not clip and hold tight on cans... Switched back to my manual can opener... It works much better!",
        "This can opener works very smoothly and easily, with very little effort. I bought one for my trailer last month and loved it so much I bought another for the house. The only thing that doesn't work well is the magnet to remove the cover. It isnt' strong enough and its not intuitive as to how to release it, but I didn't buy it because of the magnet, so it doesn't worry me that it doesn't work well.",
        "It seems like such a simple thing... a can opener. I've owned many in my life and I actually just recently bought a solid stainless steel \"chef quality\" version that would survive a nuclear blast, but it was awkward and uncomfortable to use. This can opener nails the mysterious and much sought after balance of form and functionality. It doesn't just get the job done. It's solid, smooth, comfortable and exact. The very first time I used it I was shaking my head in dismay; these people put some thought into a device that's been around a LONG time and they did it right from beginning to end. Kudos!",
        "I hate this can opener. It requires great force to close on a can and has pinched my fingers severly several times in the attempt. I chose this model because of the advertised magnetic lid lifter. What a joke. To pick up a lid with the magnet, you have to completely detach said lid, let it drop into whatever you are opening, turn the opener around awkwardly (making sure the knob is turned the right way), then hope the lid is magnetic enough to lift. Just buy a simple opener...wish I did.",
        "This can opener works very well. The locking is great and it is really easy to operate. Now, to the reason for 4 stars. They charge a premium for the magnet feature which allows you to \"lift and dispose of the lid hands-free\". That does not work very well. The magnet angle is awkward and more often than not, the lid does not stick to it. So that is more of a sales gimmick than anything else. Having said this, the core functionality of locking the cutter to the lid, and opening the can works very well. Just for that, I would recommend buying it.",
        "In October 2018, I ordered this Zyliss can opener based upon so many positive reviews. This can opener was a disappointment. It took me multiple times to get the can attached to even start using it. Ease of use is very important to me because I am 60 years old, and my hands hurt from time to time, so I wanted a can opener that works well for older folks. That said, after many times of trying repeatedly to get the can attached, once the can is attached, it works well, but I cannot honestly give this item a good review based on my personal experience. I definitely will not order a Zyliss product again.",
        "ugh ...ive cut myself once already on a can lid..it does have this magnet thats supposed 2 pick up the lid....this idea rarely works...the lid falls in the can...honestly i thought i was purchasing a can opener that cuts the whole top of the can off .with smooth...this can opener leaves edges on the lid which is how i cut my finger...I WOULD NOT RECOMMEND.",
        "Absolutely worthless. Never opened a single cab with it. First issue...it would not grab and bite into the can lid at all. Would literally ride off of the cab every time. Even when squeezing it extra tight it would come right off. Then in turn the part you turn was cheaply placed onto the opener and within 5 minutes of failing to open a can the twist part stripped pretty much rendering it useless. Not well built at all.",
        "We have many zyliss products in our kitchen. When we bought this opener, we thought it would perform like all zyliss products which is exceptionally well. It was a bit challenging getting to grip some cans but we lived with it until it no longer worked at all. It was still within the warranty period and we emailed them pictures, copies of the receipt and wrote a description of the problem A month later, they responded with requests for more pictures. Really? For a $16 opener? We're done. We also like Kitchen Aid products which coincidentally I ordered today.",
        "This can opener didn't work well out of the box, and is currently broken completely and will not open a single can. This is after 2 months of light use. It's very flimsy and the magnet is very weak, I would not waste your money on this.",
        "As many reviewers noted * The opener has to be twisted into the can to even make the first puncture - closing the jaws alone does not cut the can * Any slightly heavy can cannot be cut at all as the opener blade slides off of the can top and stops cutting I too do not understand where a set of 5 star review came from for this product.",
        "We're having to buy those giant (no. 10?) sized cans of green beans during this pandemic and our countertop can opener does not do it. I ordered this handheld and it works great. It's handy, light and sharp. It takes some getting used to with the handle lock but actually, that is a good feature, easing clamping pressure with your hand. It's also smart to have a backup just in case, you know? With a gas stove, we can still open cans and cook even during a power outage. This is a neat, convenient tool for the kitchen that doesn't break the bank!",
        "It's nice looking and that was about the extent of its usefulness for me. After just a couple of months its blade would mangle cans edges rather than cutting them. It was difficult to get the thing to lock onto the can's edge, and then it would just chew at the metal. The crank was hard to turn. On the few occasions that it actually did open a can, the magnet feature was not easy to engage for grabbing the lid. It was the most expensive can opener I've ever purchased and the worst performer. I finally just threw it out.",
        "I hate this can opener. Hate. It. Bought it on a recommendation from a food blogger, and it is absolute junk. How on earth does it have so many positive reviews?? In the middle of turning the handle, it just stops cutting. It doesn’t slide off, it simply stops cutting into the can. So I have to stop, open it, clamp it back down, and then try to start turning it again. Repeat this process about a 6+ times (not joking!) and FINALLY the blasted can is open. So frustrating, especially when you’re in a hurry. Don’t waste your money.",
        "I have tried over and over to get this thing to work - it will not pierce the can and if it does finally do so, it will not rotate! It's just awful - I have returned it, even though it cost as much to return. It stinks. I bought this because it is made by Zyliss, I usually really like their products, this was a disappointment.",
        "This thing is AMAZEBALLS!!! For many years we've been through several can openers, one night when insomnia hit I went to Amazon and started searching and reading reviews. This bit of perfection was on deal and appeared to be a good choice. Boy was I wrong, it was an excellent choice!!!! I have NEVER used a can opener so smooth, easy to operate..... On opening the first can I stopped halfway through for my hubs to try it, I couldn't keep the glory all to myself!!! I highly recommend this can opener!!!! BUY IT!!!!",
        "This Is absolutely the worse can opener ever. I did not believe my boyfriend when he said it doesn't work. I thought he was just complaining. It does not work. It's going straight to the trash. I give it 0 stars because it's useless. It does not latch on to cut the turn handle falls off. I tried to stab a can with a knife then use this. However it didn't work. I am going to Ross to find something cheaper and that actually works. The only reason there is a hole in the can is from stabbing it with a knife. The mechanism does not latch. Cheap Chinese garbage",
        "This reworked version did not work to open even the first can. It was a gift to my brother after bragging about my own, which was the previous version, and was terribly embarrassing for me as I stood there watching him try to open a can.",
        "I loved this can opener at first. But gradually, I experienced more and more issues with it. It started having problems cutting an entire lid loose. It would \"jump the track\" after cutting one inch of can. I would try to start it again....repeatedly....ending up with a real mess. I prefer manual can openers, and have used them all my life; however, this is the worst can opener I have had in terms of reliability. Happily, I still have my old, reliable Dollar Store can opener. It was definitely a better buy!",
        "A can openers job is pretty simple - open cans. The first two cans of Green Giant corn I tried to open with this thing were a bust. Handle flexes and could barely push the blade through the lid break and then once I got that, I could crank the handle and it wouldn’t advance itself around the can. Obviously disappointed in this purchase..",
        "Having arthritis I have tried numerous can opener, even electric ones. This one is so easy to use and the lock feature is a life saver on my bad days. I thought I would never spend more than a few dollars on a manual can opener and I'm glad I took the plunge. I will never buy a different can opener again! I've had this can opener now for a year. Still works like the first day I got it. Buying one for my mom who has osteoporosis, hopefully it'll help her like it has helped me.",
        "I e been in need of a new can opener for a long time and i finally scored this little beauty. It is so easy to operate and and slices right through the cans' lids. It has yet to pop off the can while turning which tells me it is working perfectly this far. Aesthically it is a good looking kitchen tool as well.",
        "Although the opener feels very good in your hand it does not function as it should. First can I tried to open I had to apply a lot of extra pressure for the opener to puncture the can. Then the teeth would not grip the can to rotate it while it cut, I had to rotate the opener opposite of what one would normally rotate to get any grip and constantly apply extra pressure. One would think that once the opener \"locked\" it would alleviate the need to squeeze the handle but it does not, and that was one of the main reasons I purchased this. Sent it back.",
        "I've only had this for a few months so I'm hoping I can still rave about it in a year or longer but I love this can opener. Truthfully, I thought the locking feature seemed stupid and useless but then I used it and it's amazing. It allows you to apply very little squeezing pressure to get the job done. I went through SO many can openers and they would all break within months. I'm pretty convinced now that it's because I was squeezing them to death and warping the gears. This one is just snap, lock and hold it while you turn the handle.",
        "I've been searching high and low for a can opener that will do what it's meant to - open cans - without being electric, or falling apart in a week. I've had this now almost a month, and it just works. I love the locking feature because I have problems with my hands and sometimes gripping tight enough to keep an opener locked on isn't happening, but mostly I'm just in awe of how easily it opens a can. The thing works - if that's what you're looking for, it's 100% worth it!",
        "While this can opener worked great at first it failed after 5 months of use. I will try to see what the manufacturer will do on warranty but it isn't of much use to get a product that just won't last. I say it failed because it just wouldn't lock on to cans anymore and would slip off and not cut.",
        "This is my second Zyliss can opener. The first one we had for many years until we pretty much wore it out. So, of course, we bought a new one of the same brand. This one, however, has failed within the first few months of use, and it seems that it is no longer under warranty for return. So what is one to do? You have it less than 6 months and you are stuck with a shoddy product. Of course, we didn't pay a fortune for it, but there should be AT LEAST a 1-year warranty! I have always been keen on Zyliss products, but I think I shall shop another brand from now on.",
        "Innovative, ergonomic design. I regret not inventing this. Only recently was I hacking away at an old can opener that wasn't working very well & I got the idea that if the top part was angled it might work better. Low & behold I found this online.. & it works way better than any hand crank can opener I've ever used. plus it has this built in lock that holds it on the can while you turn it. Genius! Love it! Will buy more for gifts, the camper, etc."
    ]
}