{
    "entity": "Manual",
    "text": [
        "Bought for my wife. We used it for the first time tonight to open a large can of red enchilada sauce. Went around once and lid did not come off. Went around again and were able to force lid off with prying mechanism. Unfortunately, we saw that there were SMALL SLIVERS OF METAL all around the edges. I can only assume that some of the slivers also fell into the contents of the can. I see other users complained about metal slivers. I should have read previous reviews but I have ALWAYS been very happy with OXO products - NOT THIS ONE!!!!! They should remove this model from the market before the shards tear up someone's insides!!!!!!",
        "I'm really furious. I usually love anything by OXO. But THIS is a piece of garbage as far as I'm concerned. I've bought two of them-- the last in September of last year-4.5 months ago. And neither of them has lasted at all. Just now I needed to quickly open a can of black beans for a slow cooker recipe I'm making. And it didn't work. I'm had to use an old key can opener and that of course leaves sharp spikes all around the can. Oxo get your act together. You should be able to do better than this.",
        "Disappointed with how long this lasted. It has been under a year and this has started having problems opening cans. We are not running a restaurant here....we open about 2-5 cans per week for different items. That means that with less than 150 cans opened...this has become less effeicient at opening cans. This poses a big problem for my kids because it sorta works which means they are using their muscles to open teh cans. I wish I could find an identical one to my old style (considered dangerous now) can opener. It lasted through college and an additional 10 years. I do not recommend this product.",
        "Did I just get a bad one? I bought this based on reviews and it is the worst! Things I hate: you have to cut around the can multiple times to have any hope of getting the can open, it does not remove lids that are put on with glue without force, I spill stuff trying to get the can open, it's slow and sticky to turn, it is huge and does not fit elegantly in the drawer. Seriously disappointed by this waste of money and my time.",
        "This can opener failed on the second can I tried it on, and caused me to struggle with getting the can open using other means, such as using a butter knife and prying edges, while trying to use the can opener. The sharp edges on the can cut me, and left metal splinters in my skin. I bought this as a replacement for my gold ol' trusty and cheap smooth edge can opener, thinking this would be better. I WAS WRONG! Buy the cheap one - buy the GoodCook 11834, It's the best. Lasted for nearly 5 years before we needed a new one.",
        "Like: Typically works for three or more years. Can opening is cleaner without metal shavings falling in. Easy to operate, once you figure it out Dislike: Last one purchased, became dull and malfunctioned after 6 months. Price is almost double of other very effective can openers. I rated three stars (3) stars...hoping short working life-span was a one-off defective product, but that wasn't returnable and I was out $21. plus dollars and had to replace it. Tried different brand this time...very happy with new one.",
        "I like to remove the tops of sardine and mackerel cans to get at the contents more easily and avoid the sharp edged pull off lid but the shape and bulk of this opener will not allow those rectangular shaped cans to rotate around and thus will not work on those shapes! Otherwise I'd have given it 5 stars since it works great on round cans. Update: After just under a year it is beginning to leave round can lids only partially opened. Taking off one star and wouldn't give it 5 stars now if it did open rectangular cans!",
        "After the manufacturers video on how to use it, it works great. Yes, you might encounter a few small slivers of metal, but just pull them off before you take off the lid. Nothing is going in your food. My electric one that did the smooth edge also left slivers on occasion, but this is a matter of can quality, not a problem with the can opener. Over the years the quality of the manufacturing process for cans has plummeted, so don't blame the can opener. If you have issues with arthritis, or carpal tunnel, this is the product for you.",
        "I have purchased 3 of these in succession during the past 12 years. My third one just bit the dust, as the others did. I loved using this can opener, and that’s why I have continued to replace it, but I’m frustrated that it doesn’t last longer and am now searching for a different brand. When it starts to wear out, it will skip cutting parts of the can, and you’ll have to go over those sections again, until eventually it won’t cut much of the can at all, and going around again won’t cut it either.",
        "I had another one of this type of can opener from another company. I loved it. It was really nice to be able to open the cans safely, and not have any sharp edges in the recycling bags. I figured this OXO one would be an upgrade, but it usually wont open the cans - it just gets kind of close to opening it. I have had numerous spills and minor explosions of food in the few months I have had this because the can has to be forcibly opened (squeezed/pried at) to access the contents. Appears that the item is not eligible for return, so I am probably going to throw it away.",
        "This is a great can opener. Takes a few minutes to get used to but only a few minutes. I love the way this opener works. It gives your a clean cut every time, and even catches the lid every time eliminating the need to have to try and grab the lid with your own fingers. The added bonus is that with the way the can opener cuts the can open, you can press the lid back on the can to seal it if you so chose. Great buy!",
        "I like this can opener. It works great on small cans but when compared to the Kuhn Rikon version it came in second. It did beat the Kuhn on standard cans as the side crank was easier but it just couldn't handle the thickness of the commercial size cans. While it did work, it put alot more stress on my wrist than the top crank Kuhn for those large cans. Also the lid lifter was a bit better on the Kuhn. If you only want one manual can opener, I recommend the Kuhn. If you do not plan to open any commercial size cans than I would probably choose this one.",
        "Let me start by saying it’s my favorite can opener. This is my second “OXO Good Grips Smooth Edge” can opener, the first one broke after 15 years. So I bought the same again. Keep this in mind: It cuts the side of can, therefore unlike typical can openers, even after a full rotation it may look as if the can is still sealed. BUT it’s not. After a full rotation just remove the top cap. It cuts in such a way that top of the can becomes a cap. Brilliant design. Quality is also good (as you may expect from any OXO product ). Therefore I recommend it.",
        ".....I just can't get this work on the 1st try ---- I have to attempt to use on can 3 or 4 times to get it to open the can.... I wanted a good quality long lasting can opener ... and read the GREAT reviews... and... it just does not seem to be working for me... I have viewed the video on how to open the can and numerous times.... I had 3 cans to open for dinner and took me about 10 minutes to finally open them....well I have written email to OXO... and will be waiting to hear from them......",
        "Payed a lot for this. I buy as much oxo as possible. Unless you are NOT right handed or NOT left handed you might be able to use this with ease IF you have a special machine to make it work. I cook every night. The frustration using this opener, I own 3 openers has had me literally stopped in my tracks over the complications of use. I save it in case of an earthquake when life or death might be at risk if food cans have to be opened at any cost. Another example of how companies use Amazon to dump products that most people would not pay a nickel for.",
        "I got this since I like the fact it cuts the tops open on cans but makes it smooth- so there's no rough edges to cut yourself with. But it's pretty difficult to get it to cut the can without having to really work at it. Making sure it digs in enough to start the cut and stays on the top enough to finish the cut, takes some working at it or you have to go around the can twice. After a while I got used to it but the hubs said he'd rather have a normal opener that works and cuts everytime.",
        "I bought this can opener on February 5, 2020. It worked reasonably well, but I always had trouble pulling the lids off. Now, on April 7, 2020, it won't work at all. The blade is completely dull. I paid too much to open approximately ten cans. My husband is now using our camping can opener which is old and cheap. Why does it work when the OXO model won't?",
        "Bought this item with high hopes (bought two in one order) that it’s as good as my old leifheit safety tin opener. Even with very high reviews, I was surprise to find this simple tool to be big and cumbersome to operate. It functions very similarly to the leifheit opener but I had trouble making a clean cut even after a few rounds. The sharp edge just doesn’t seem to bit into the can. I am disappointed with this purchase and am going back to the leifheit safety tin opener.",
        "We use a lot of OXO products, and this one is pretty good. The way it cuts the lids off cleanly without leaving a sharp edge is great. The only thing is that this requires a LOT of turns of the handle to get around a soup-size can; also not much feedback feel if the cut is happening or not. An electric one with this design would be perfect!",
        "I am very disappointed with this can opener. I was looking at the reviews and have general trust in oxo product. It started great, and just when I am about to toss my old can opener, I encounter an issue where if the can is a little deeper than other can, this opener is useless. And it happens that the pack of tuna that I have bought, all too deep, so that the horizontal way of slicing the top off doesn’t work. And after that, it’s the tomato paste and other can goods that’s not working. What good is a can opener if it can’t open most cans in my pantry? I will be looking for a different one shortly.",
        "No idea if my particular item is defective or what, but it just cant grip the cans, even ordinary cans like soup!! Love the idea of stray animals not getting cut, but if I cant get into the can, it's a fail.",
        "I was looking for a can opener that didn’t touch the food, because rusted can openers gross me out and this was one of a handful that I found to have that requirement. I mentioned it to my mom because she has one of those old school can openers that leave sharp edges and told her I’d just buy her one like mine so that she doesn’t cut herself. But to my surprise they’re no longer available here :( only from 3rd party vendors for nearly $30. I find that ridiculous so I will go out one search for something comparable.",
        "I fastened the opener to the top of the can and turned the handle but the can did not turn. I finally noticed that the gear was not turning when the handle was turned. It turns out that the plastic insert inside the handle was stripped and slipping around the steel shaft attached to the gear. This opener did not open one can.",
        "There is a reason they have what they call “Lid pliers” on them. It is because the opener does not do enough of a separation of the lid from the can, so you have to grab the edge of the lid and twist, pull, and coerce the lid off the can. What a joke, I just do not want to deal with a return, but just might. If you want an opener that works well, Good Cook Safe Cut Manual Opener is the one. The lid simply lifts off with no effort, no pliers needed!",
        "I don't use many canned goods, but appreciate not dealing with cuts from can lids. Although I initially thought this was a great can opener, after owning for a little over 6 months it now selectively opens cans. I am unable to get it past the normal ridge on the can lid, just keeps moving around the can without cutting anything. Will purchase another brand and give it a try, not worth trying this one again.",
        "My old \"safety\" opener gave up after 10 years so this was to be the upgraded replacement. I like that the cutting wheel is exposed so you can easily tell if it's having an issue (one on the other old cutter seized up). The rubber grip is a bit tacky so it's easy to hold onto. There's a little \"lid lifter\" built in that's kind of a gimmick. I tried it and it works but it's kind of fiddly.",
        "This can opener works...eventually. There's no logic to it, so every time anyone wants to use it, they have to get out the instructions, which are just pictures, and fool with it until it finally takes hold. I have small hands, so it might be easier to hold for people whose hands are of average size or larger. When it's finally attached properly and cuts all the way around the can, it cuts in such a way that the lid doesn't want to come off, and has to be pried off with a dull knife or some such thing. I don't know what is ergonomic about a can opener, so I did not respond to that.",
        "I've used this several times since getting it and I like that the business end doesn't come in contact with the food. People may think their regular can opener is broken when what usually fixes it is giving it a very thorough cleaning, usually with a wire brush. Since the business end if this can opener doesn't touch the food I'm hoping I won't have issues with it. And of course not having sharp edges on the lid is a major plus which is why most people would buy this item.",
        "My husband destroyed two cans of tuna trying to open them using this. He's an intelligent guy - fixes all kinds of things around the house. I couldn't get it to work either. Yes, we both followed the directions, Trying to return - disappointed that Amazon is referring us out to OXO rather than allowing the usual simple return. Especially since is clearly states returns on ordering page.",
        "This was much harder to use than I could've imagined, particularly coming from Oxo. I've had great success with many of their products, but this one was not a winner. I specifically bought it because I have hand troubles, and it was not easy to turn the handle, and it was tricky getting it to latch onto the can in the first place. I could've come to grips with that, but, struggling with turning the handle was a big issue for someone with hand nerve damage. Sad.",
        "I needed a replacement can opener after my pampered chef smooth-edge can opener bit the dust after almost ten years of use. I'm pleased with the oxo products we have (kitchen utensils, Apple cutter, salt and pepper grinders), and feel like they are made well. This can opener is no exception. It works great! I'm rather accident prone, so I definitely wanted something that reduced the risk of cutting myself on the can lid. This can opener not only creates a smooth edge, but it can also pinch the lid to pick it up so you don't have to touch it at all. Another Oxo product win!",
        "so far no major complaints..It is a little awkward getting use to. I have found I can not use the detached lid to press into the can to drain the liquid out of something like Tuna. that's my only gripe. It does the job. the edge are not jagged like a normal can opener that is a plus. Had it for about a month so far.....So far so good",
        "This can opener works a little differently than most can openers that you're probably used to, in that it cuts around the outside of the top rather than inside, and as such, the placement and cutting method is a little different than conventional can openers. Once you get over the learning curve, this thing is beautiful. Quick, easy, and no sharp edges. I'm a fan.",
        "OMG I cannot believe how well this thing works! I had a decent can opener that cost more than $10 from the grocery store, but it began rusting and not rotating so matter how much I oiled and cleaned it. I'm actually glad that happened because it gave me an excuse to buy this. It is AMAZING. I actually thought it was broken the first time I used it because I didn't feel the pull or resistance I'd normally feel using my old can opener. It actually removes the entire top of the can rather than puncturing into the metal. It's genius. I'm being \"that person\" and recommending this to everyone I know.",
        "The Oxo can opener is the easiest can opener to use, that actually works flawlessly! Makes opening canned goods a quick, clean and simple process that has lasted like a champ through daily use and easy cleaning! Even better than automatic can openers if you ask me. Easier to clean for sure, easier to get the can attached and without all the sharp edges! A+ purchase with simple on time delivery.",
        "Oxo goodgrips is a very dependable manufacturer. Having said that, I was unable to use this can opener even one time. To be fair, I have arthritis in both hands but even so, the ergonomic style seemed like a good fit. I gave it to a friend so I will see what she has to say. At this time, I cannot recommend this can opener to anyone who has arthritis in their hands.",
        "I never thought I would find myself so enthusiastic about a kitchen gadget, but I love this can opener! It's so much easier to use than every other can opener I've ever tried in my life. I love that it doesn't create sharp and jagged edges like can openers that cut around the top of the can, and its handle is so much easier to use than other designs because it's the right size for my palm and coated with anti-slip material. It also must have some serious blades hidden inside it because boy does it cut easily through metal cans. It's so worth the price!",
        "I've been looking for a great manual can opener b/c I'm tired of extra appliances, and an electric one will be no use to me during a power outage or hurricane situation. The OXO Good Grips Smooth Edge Can Opener is the best manual can opener I've ever used. It glides so easily and leaves no sharp edges whatsoever. I know it's kind of pricey for a manual can opener, BUT you really do get what you pay for.",
        "It works as advertised. The can lid cut is clean and the lid will never drop into the can ... unless you dunk it yourself :-) It is a bit difficult to remove the lid after opening the can. It has a mini-pliers like device at the end. However, I found that holding the can firmly and lifting the can opener handle will remove the lid easily. If you like to drain liquid such as canned tuna before using, you will remove the lid first. I recommend this opener..",
        "Judging from the many good reviews, I went ahead and bought this in 2013, even though there were numerous other reviews that said it worked great at first but quit working after a while. Unfortunately, this was my experience, too. It worked well for maybe a year, and then just wouldn't work without trying over and over again to get it to cut. Now it barely cuts at all even after multiple attempts and I end up having to wrench and pry the lid off with something else. At over $20 a pop, this product should last much longer than a few months to a year. I haven't purchased any other OXO products since.",
        "Works like a charm! Takes a little getting used to when lifting the tops off the can with that tiny pincher area but otherwise it is so smooth and seamless you aren't really sure it's working until you pop the top of that can you're working on. No effort whatsoever to turn the large handle - very ergonomic. I was a little hesitant to buy based on some of the more negative reviews regarding durability but this is the best can opener I've ever used and I see no evidence of any reliability issues which is why I waited to post a review. This thing works as advertised and it's worth every penny. Highly recommended!",
        "Bought this after seeing a long shard of metal fall into the can of tomato sauce. I heard that can happen with old fashioned can openers, electric or manual. I saw a half inch long metal shard laying on my tomato sauce surface... wonder how often I had eaten metal shards in the past? Old style can openers should be thrown out, recalled, manufacturers sued for death by ingestion. Believe me, I saw it, long sharp piece of the rim of the can, spiraled like a screw. If that gets in your throat you are looking at an emergency room visit to get it out surgically.",
        "Tried for a year to make it work, after much frustration, cut fingers, and questions from guests about its usage I'm done. It never opens the full circumference on the first try. The \"pliers\" don't lift the lid off, so you have to hunt for the gap and try to pry it open with a fingernail. And that's only if it cut successfully all the way around. Always have to open cans for guests who can't get it to work .",
        "This a nice can opener. But, I mostly open tuna cans. This type of can opener, however, is not ideal for anything you want to drain. The lid can’t be pushed down the way it can be when using a more traditional can opener. However, I love craft beers. Unfortunately, cans are becoming popular, again. Some beers have a sediment that gets trapped by the can. I’m going to try using this to cut the top off, and get every bit of that delicious sediment!",
        "I'm late to writing this review but since I'm about to purchase this item again, thought I'd review the one I'm replacing. I was given one many years ago and it lasted @10 years. I liked it so much (the feel and no sharp edges) that I bought another one from Amazon in 2009. It lasted @9 years. I find it's easy to use (may take some practice if you're not familiar) and it's easy on the hands (knob turns easily). I've tried other can openers (including other OXO) and keep coming back to this one.",
        "This is way too big and clunky, and takes too much room in the small top drawer so I keep it in a cabinet. Also visibility isn't good when trying to position it on the can, and I find myself tilting my head and crouching to counter level. Would not recommend or buy again. There are other smooth edge can side-cut openers. My wife doesn't like it either. Will probably get something more convenient and keep this as backup.",
        "Good product. It cuts the lid clean with a smooth edge as advertised. Big plastic turn knob is comfortable and easy to turnI'm still getting the hang of how to attach it to the can to start cutting. I got this at a discount from Amazon Warehouse deals as, Used-Like New. It was Not like new. The handle has large scratches and the turn knob was sticky. I was able to clean the knob, but the scratches remain. It should have been priced as Used- very good.",
        "Took a chance due to some of the positive reviews, but it is basically garbage and very cheap. After a couple months of use I found it impossible to use.",
        "This is the second edge style can opener I have owned, and this one performs way better than the first one did. I have yet to have the top of a can not come off when I have completed a full circle of the can. I opened about 100 cans before I wrote this review so that I would have a good sample size for this review. The can opener still operates as easily as it did with the first can I opened.",
        "I was shown this can opener a couple months ago by someone who had it and I knew right away I wanted one. You can barely tell that it’s actually opening the can but you just use the little grabber and it’s done. It can still hurt you if your trying but your definitely not gonna accidentally cut yourself like regular openers.",
        "I used to have a Chefmate smooth edge can opener, but it finally gave up the ghost so I went looking for a replacement. It's possible I like the Oxo can opener even better than the other one that I had for ten years! The grip is big and easy to turn, and the edges come out smooth which means no risk of cutting myself. Time will tell if this lasts as long as the other one I had, but so far I am happy.",
        "Hasn’t been a year and the can opener doesn’t work. I wanted a clean edge opener but the traditional is faster and lasts longer (my last one I replaced after 10 years to get a clean edge not because it broke). This one now just perforates the edge but doesn’t cut it anymore.",
        "This is the second one I have. I have the first one at home and bought this second one for our cottage. I like it because when the lid is cut off there are no sharp edges. It has the little beak to grasp and pull off the lid when it's done cutting so you don't have to touch it.",
        "I went through NUMEROUS off-brand, and a few other name brand, can openers and they all sucked. This one is AMAZING! It opens every can with ease, and leave a smooth clean open top. The only down side was that it was not machine washable, but it never touches the food so it really never gets dirty.",
        "This can opener is pretty amazing. After you get the hang of how to put it on, because you feel like you are doing it wrong, it is great. So smooth that you think it isn't even working and the little grabbers are an added bonus. I have carpal tunnel and needed something that didn't bother my wrist and this turned out to be great!",
        "I’ve been eyeing this thing for over a decade, waiting for my old can opener to kick the bucket. Well, the bucket was kicked and for the last 4 months, I’ve been in can-opened bliss wondering WHY I didn’t buy this years ago?? Here’s the thing, I have small children. No one is going to cut themselves anymore on a sharp can while helping me make dinner. #winning. Also, if I don’t use everything in the can, this opener cuts the top so it can be used as a lid. 😎",
        "Happy accident! I ordered this opener after watching video for recycling can lids into a craft project. Easy to place on cans, big handle makes it so easy to turn & the pincher on the side always easy to grip the can lid & lifts right off. I’ve had it over 1 1/2 yrs opened many dog food cans & still sharp! I will buy this again!",
        "This product creates tiny metal splinters that lodge I to your fingers when you touch the lid or the can. This is super dangerous.",
        "Don't waste your money..When I compared the 2 side by side the Oxo does not even appear to have a blade... I compared it to the KitchenAid I had to buy to replace this junk which never worked.. Do Not waste your money on this.. NOT recommended.. Buy anything else but NOT this..",
        "Good can opener, I have had it for a few months now and it still opens well. The only reason why I am giving it 4 stars instead of 5 is it can be a little challenging to get the can opener to stick on the cans to open, it is also sometimes hard to know if the can is open which can cause you to try to lift the lids and that equals spillage. Otherwise it is a good hand held opener. It doesn't take up a lot of space in the drawer and so far has not let me down. Worth buying.",
        "This is a great hand held can opener. It's the second one we've owned, the first lasting over 15 years. It is easy to use and works on any size can, unlike many electric can openers. It also has a comfortable grip and does not hurt your hand during use. I highly recommend it.",
        "So far, so good. I particularly like the lack of sharp edges on the opened can (our dogs are pre-recycling can washers), the cutting wheel not intruding into the can's contents (I'm not just being germophobic here; open a can of tuna with a conventional opener and you'll have to either wash it or put it away stinking) and best of all, it doesn't have anything to catch on a paper can label and bunch it under and thereby force the opener off the can. This is the Better Mousetrap of can openers!",
        "I like opening cans with this can opener. I don't have to worry about cutting myself because there are no sharp edges. I saw my friend had one and when I saw her use it, it's a no-brainer, I had to have one. After you buy one, you won't go back to the old way of opening cans.",
        "Very disappointing. Normally there products are great but this is not as good on some cans as my old Walmart opener. I use a side cutting opener on the cat food cans because I rarely us the whole can so I like to use the can lid when I put it in the fridge. It will not open those cans. Would not open a can of salmon. Can't open a lot of different cans the walmart can opener can open.",
        "Love this can opener. This is my second one, lost the first one in my divorce. Best can opener I've ever owned. Easy to use, and love that there are no sharp edges...not that it's a huge issue, but this can opener is easier to use than one that does leave sharp edges...so it's a plus.",
        "The can opener is easy to handle. Goes flawless but the micro-metal-parts from opening that sit on the top are pretty annoying. Have to clean the \"lid\" every time before pouring the can out. I do not want those in my food. Getting the perfect can-opener is a difficult task. Haven't found it yet. This one is not it though.",
        "When I used the can opener for the first time, I thought, \"aw shucks, this doesn't work!\", mainly because it was so easy to turn. After going around about 3-4 times, I figured out I must have finished opening the can. Then, I couldn't get the lid off. After a couple of tries, I realized I was trying too hard - it slips right off. So, so far so good. I hope it lasts, as I have a problem with can openers rusting out and becoming useless pretty soon.",
        "I was pleased with my previous model for about 10 years, until it seemed to get dull. I replaced it with this one, which is improved by having a scissor-action release from the can, as well as a much more ergonomic handle position. The only thing that I like less about this model is that the little \"beak\" for removing the lid is smaller and harder to position. I definitely recommend this product.",
        "I love this can opener. The blade doesn't go down in the can, so it doesn't get all gunky. It doesn't leave a sharp edge. I bought one just like it 8 years ago. I replaced that one with this new one because after that long the blade was dull and I had to go around the can twice to get it open.",
        "Over all this works great. The catch for pulling the lid off is a bit hit or miss though. It's not easy to see it when placing. It takes a bit of practice placing the opener on the can as well but it gets easier with time. I'm really hoping the lil lid clip does as well.",
        "It took a while to figure out how to use this thing but now I just want to open cans and show people what it does. No sharp edges! The can is practically re-seal able (if you keep it upright) and there is absolutely no mess. This is a great product that ought to be mandatory in any home with young children.",
        "Thus takes a little practice but once you get used to it you will never go back to any other can opener. It works great with no strain on your wrist. Cuts clean edges, nothing sharp and it even allows the lid to go back on the can.",
        "This product works great at removing the top of the can and is not electric. This product works well and does the job I purchased it to do. It was shipped quickly and replaced and old electric can opener I was frustrated with. I am very happy with this product.",
        "I repurchased this opener after loaning my decades old one to a neighbor and never getting it back. I tried a slimmer version in the interim that had high reviews and instantly missed this opener. Nothing beats the sturdiness, smoothness and ease of use of this opener and best of all it literally lasts you 10+ years!",
        "I bought this hoping it would solve a problem I'm having opening tuna cans for the cats. This new opener works great on steel cans but failed to open the aluminum tuna cans. I tried opening 6 different tuna cans and although the thing goes around the can it failed to cut/break the seal between the can and lid.",
        "this can opener does not open all cans, not sure if i have a defective opener. but when it does work the lids do not have sharp edges as advertised",
        "I have been trying to turn this product because it didn’t work well for me, plus I cut my hand badly trying to use it. The manufacter will not allow me to get an Amazon return lable. This adds greatly to my irritation. I don't want to pay for something that will not work and cuts me.",
        "I love this opener once I got use to it. Bought it when I cut my finger on a lid. I've owned mine for a long time. Bought this for my daughter when she ended up with 10 stitches trying to remove a lid when her opener left attached sections (must be a family thing). She loves it. No sharp edges. I'll never own any other kind.",
        "This is the best hand-held can opener I have ever used. Large. Comfortable to hold. Pleasing to look at. Makes opening cans a pleasure, instead of torture. Lids come off without sharp edges. And there are these cuted little teeth that are on the side to lift off the lid. And the metal parts are stainless steel. The OXO Good-Grips can opener will last a lifetime. This is my second purchase. The second I bought for a birthday. I will soon be buying a third for a birthday present.",
        "This is the best can opener ever! It clamps on to the can well, and leaves no sharp edges. It also has a little side piece for removing the can lid. The only thing I would change is it's a little hard to twist the knob. And it would be really cool if it was magnetic so you didn't have to do 2 steps",
        "It is surprising the ways it opens the can, you get the complete lid separated from the can. Now, if I only can remember which way to position it to work...it would be my daily solution to difficult can opening!",
        "Performs as advertised! Unusual way to open a can but leaves a nice safe edge on the can. I was a little confused at first and thought the can wasn't open, but when I removed the opener, the lid came off easily. It wasn't difficult to use, but my old hands are clumsy so will use it as a spare.",
        "GREAT can-opener. Once you figure out the trick to getting it locked in, you are home free. It's a beautiful thing, no hazards here, and you can re-use cans that are open (until they are empty, such as I do with dog food) until you are ready to discard. Then they can go safely into the recycle bin and you won't have to worry about even the sea turtles or any other creatures getting cut from opened can lids.",
        "I have rheumatoid arthritis which has led to a weak grip. This is the easiest, most comfortable can opener I've found. The smooth edge is also great so I don't have to worry about cutting myself when rinsing the cans and throwing them in recycling.",
        "It's so quiet and runs smooth as you turn it. The only issue I have with it is that some cans don't seem to work with it. It's really annoying when that happens because then it shreds off thin pieces of metal that you have to make sure don't get in your food.",
        "OXO. They make the best in kitchen tools. This is by far the best manual can opener made. Large grip and handle for ease of use. Opens cans easily, leaving a smooth folded over edge that not only will not cut you, but allows the top to be reused to close the can for storage. There is also an attachment that helps remove the lid once the can has been opened.",
        "Super cool hand held can opener. It cuts the lid off without you having to touch the lid. It peels the lid off in such a way that you can't cut your hand. I love this and would highly recommend to others.",
        "A friend recommended I get this for our wedding registry, and I am so glad I did. This is the best can opener I’ve had. So easy to turn and it really does leave a smooth edge so you can’t cut yourself on the sharp lid.",
        "Great design, great price point and works every time. Best part is that you can recover the can using the top because of the way this opens the can. Ergonomic and does not cause cramping or fatigue. My older broken traditional metal opener caused hand cramps.I highly recommended, OXO does it again.",
        "Takes some getting use to compared to the older openers.",
        "This opener works nicely, but I didn't know how to use it at first. The instructions weren't great, but I found a good YouTube video that explained it. It doesn't lock on like most openers, but if you are using it correctly then it leaves indentations on the inner side of the top rim, you then need to use the pliers type feature on the device to take off the lid. The can contents seem to come out a bit easier, so that is another nice thing about it.",
        "Awesome, awesome, awesome can opener! So much easier then any other can opener I have ever had (except electric). It easily attaches to the can, the knob is easy to grip and doesn't hurt my hand to turn and doesn't slip. The lid of the can come off clean without all the rough edges that can cut you. The little \"teeth\" on the side grab the lid and life it off so you don't have to try and pry it loose of the can. Just love this can opener. I would really recommend it to anyone with the exception of the elderly who may have arthritis and any non-electric can opener would be an issue for them.",
        "This is the second Good Grips can opener. the old one was several years old and the dies just wore out. This is a great product that opens cans as easily as any other but from the side, with no sharp edges.",
        "A bit pricey, but that's expected of the OXO brand. I liked the look of it, and the feature of a sharp-free cut is what attracted me to buying this. It works smoothly and easy, and the feature of the claw-clip thing to pull off the top of the can after you've cut the can open works well. It's great for people who have hands that ache, too. Takes very little effort to open a can.",
        "I have purchased 3 hand held can openers that claim to have the smooth edge. This one is by far the best. The other two broke with in a year or became too hard to use. The handle is comfortable and easy to use.",
        "This is working fine for me. Was a little disappointed it doesn't have a bottle cap remover like my last can opener but product was not misrepresented. Cutter is sharp-I've been using it over a month now and no problems.",
        "This is the can opener I was looking for! There are two types of can openers: One uses a cutting wheel to open the can from the top. The other opens the can from the side, just below the edge of the lid. This second kind results in a lid you can put back on the can, and there are no sharp edges. (You do have to remove the top with the pincers on the side of the opener. But that's what I wanted to replace the one I broke.) The other opener I purchased, billed as a \"no sharp edges\" model, opened the can from the top, and the lid had sharp edges. I returned it for this one.",
        "We had to watch several YouTube videos before we got the hang of this can opener. We didn’t think we were doing it right, but we were. Love the fact that there are no sharp edges and the opener stays clean.",
        "When our old opener gave up the ghost, I thought it would be a snap to pick up another good one -WRONG! After buying three other openers which did not work for beans, I tried this one and found a winner. It never fails to complete a cut no matter the condition of the can and there are no sharp edges. Also liked the little gripper on the side which enables you to pick up the detached lid. Try it - you'll like it.",
        "Almost didn't buy this -- imagine! Who knew opening a can has been so easy all this time! I've had all the usual openers that either give you a lid with razor edges or a can with them. And what a mess when they make a cut in the garbage bag. Even with my arthritis it's easy and painless to open and it stays clean."
    ]
}