{
    "entity": "Handheld Vacuums",
    "text": [
        "I purchased this with hope that I could clean around the area when the brush would not fit. This did not work. The vacuum is very noisy, does not pick up dirt (or in my case cat litter) very well at all, the suction is worthless. I highly suggest that no one purchase one of these vacuums. In my case I threw the box away before testing the vacuum, as the Royal model worked very well and I expected the same from this model. I'll ask Amazon if they will accept a return with no box. I will fully understand if they say no.",
        "We had the old version of this vacuum (without the hose) for well over 10 years and LOVED it. Perfect for vacuuming pet hair from furniture and stairs, and inside cars. The brush roller recently failed, and when I tried to find a replacement, I discovered that the vacuum is so old, they don't even make spare parts for it anymore. So, we replaced it with this model. We've had it less than one month and the brush roller has stopped turning. I confirmed that the belt is installed correctly. Luckily Amazon will still let me return it for a refund.",
        "I mainly bought this to clean the carpeted stairs. Dose a good job. VERY loud. 20 foot cord so you only have to plug it in once. This newer version uses “Dirt Devil Type G” paper bags inside the cloth bag for better dust control over the older version. The hose and crevice tool is new also, the tool is stored inside the hose and you rotate the head cover to transfer suction to hose.",
        "Didn't suck....really the side hose is worthless. Bought it for use on carpeted stairs, returned it.",
        "I love this vacuum. I bought it because I used to have one almost exactly like it, same brand, and it was perfect for vacuuming my horses when they began shedding in the spring. I know it sounds funny but it does a very good job of getting the shedding hair off the horse, and once used to it, the horse doesn't seem to mind the noise. My horse loves it. I can use it on him without a halter and not being tied. Of course you do have to empty the bag after a couple of groomings if you have a really hairy horse like mine.",
        "Decent suction but this doesn’t matter when the noise that comes from it is so loud that your ears ring for days. I bought this to replace my old one which was amazing. The second time I use this it was on my basement stairs. It was so loud I had to take breaks and I kid you not my ears hurt for two days afterwards. Realized this after the 30 day return point. Looks like I’m going to have to wear ear protection in order to vacuum my stairs. Seriously disappointed in the quality of this product dirt devil. This just altered my opinion of your company.",
        "I had forgotten about the poor quality this had become until using this model. I had an original of this model, when it broke down I discovered when I went to replace it they had changed the design. The hose was now permanently connected and always getting in the way and the motor was so loud it required hearing protection to use. It doesn't vacuum debris very well and takes repeated passes with a new bag. Message to Dirt Devil: you ruined this model I will never purchase this again.",
        "I have a positive and negative review for this item. It has great suction and picks dirt up quick and easy. Con's, it's loud but that's okay as long as it picks up the dirt. Biggest con, after only a few uses i can not get the shield down so that i can use the attachment. I have tried everything but it won't budge and i don't want to force it and break the shield.",
        "I had this model 10 years ago, and it was amazing back then. The price has doubled and the quality of the materials used and thus the vacuum's ability to do it's job is poor. Never mind how insanely loud it is for the poor suction, but even storing the cord with the attached clip is a struggle. The plastic piece that holds the bag to the vacuum is cheap as well, and doesn't secure easily. Don't waste the time/money/struggle on this updated version of a previously great product.",
        "I had one of these years ago and don't know where it ended up but I loved it because it had such a nice long cord on it and it was super for vacuuming out my car also detailing around your carpeting up against the wall and I honestly think that they've been proved on the style of it I actually like the one that nowadays versus the older one all you have to do to use the hose attachment is to flip the front part down and that's pretty handy I definitely recommend this I just can't say enough good things about it it has a lot of power",
        "I have been using this vacuum for at least 7 months since I bought it sometime in 2017. I bought it because I only need a vacuum for mattresses and upholstered furniture. I had given my upright to my grandmother and had hoped to use this smaller one so I could store it more easily. It is mediocre at best. To get it to pick up much you need to change the bags every time you use it. It is not good for pet hair at all.",
        "This vacuum is really loud. So loud, that I only ever use it on the low setting, because the high setting is too loud. Also, while the brush spins very rapidly, there isn't much suction. The side suction hose has barely any suction. Also, when changing to the hose, the mechanism which flips a plate in front of the main vacuum opening, is hard to use, and could even be dangerous if people weren't careful to shut the vacuum off before switch to hose suction. I would not by this item again.",
        "We had these when I was a kid... I always remember them being so great back then. I don’t know if their quality has changed or if my expectations are just higher now... but this is not how I remembered it. Suction power is garbage. Switching over from vac to hose feels flimsy and cheep. Just not happy. Spend the extra money and buy something newer and better",
        "This is the powerful little Dirt Devil I had 20 years ago! I was so glad to find this, and for such a great price! I bought a Black & Decker bagless one (yellow) that had a 4 1⁄2 star rating and only used it a few times before the on/off switch wouldn't move anymore, plus the dirt compartment was difficult to change. This little Dirt Devil is lighter and more powerful. My only complaint would be the cord holder is pretty useless and doesn't hold the cord, and I wish they included at least 1 replacement bag because I know I won't be able to find these in stores.",
        "I purchased this hand vacuum because I wanted to be able to vacuum my staircase more often and my large vacuum had fallen on me several times while doing so. This little guy is great for regular vacuuming of stairs, floorboards, etc. I wouldn't recommend it for deep cleaning, but once a week seems to rid my staircase of pet hair and dirt. The attachment is very handy and I use an extension to vacuum floorboards without breaking my back. My only complaint is that it is LOUD.",
        "This vacuum is perfect for small hard to reach jobs like: stairs, cars, outdoor rugs and closet floors. The suction is powerful enough to pick up pesky threads, lint and rocks. The only con is that it is really loud, which is magnified when you are inside a car.",
        "Great vac. No filter to get clogged, so it doesn't lose suction. You do need to empty the bag and give it a few smacks to rid of dust. I use our air compressor. This vac has excellent suction, long cord, bag holds a lot and has a built in attachment for getting into tight areas. You won't be disappointed.",
        "I love the power of this. I have cats and it gets up the cat haur really well. I use it on their cat tree and on my furniture, under the cushions. Its also great in my car. Its has a lot more suction then a rechargeable one.",
        "Does just ok. Bought bagless Dirt Devil which does much better with no bags to replace and no noise. Wear hearing protection .",
        "This product is great as a hand held but has no suction when using it with the hose part. Returned for refund.",
        "Great little vacuum, a little loud I guess because the belt is driving the large pick up area even when closed! Seemed like the older models let you disconnect the belt if you were only using the wand small pick up hose!",
        "I had always used this brand and when my very first one broke (had the first one 10+ years), I had to purchase another one. This works as great. Power cord may be a bit short so you might have to buy extensions but overall product is good. Can get quite heavy while carrying.",
        "This model works well but is much nosier than a full sized Dyson. I got the corded so the battery would not run out but the cordless and bagless might have been the better option. Works well except for the noise level.",
        "This worked great... and then one day just stopped. Now it will not turn on. Doesn't smell burned up. Doesn't seem to have been injured in any way. Just does not turn on. And of course, the 30 day warranty is over.",
        "Really disappointed because I wanted a vacuum with a hose and crevice tool with mighty suction. This has virtually no suction through the hose. The brush roller suction is good, but forget the hose. Such a disappointment. I do like that it's a bagged vacuum because canisters just seem to let the dust spread around. My search continues for a small vac with good suction hose. Ugh.",
        "I needed something small and with a hose for cleaning dust from my desktop pcs....this thing has very poor suction and promptly returned it. I found 12v automotive vacuums with more power than this thing.",
        "Cheap was item. But it ran like a jet engine. So loud I felt like I I should be wearing ear plugs. Suction was OK but for tight low pile carpets it would just throw any small rocks (cat litter) because the brushes where going so fast. Has 2 modes. Loud and really load but only worked for a fees uses before just quitting. Not sure if the electric motor overheated. But it stopped working before I could even fill up the bag it came with. Glad I never ordered more bags for it yet. Definitely not how they used to make dirt devils",
        "Pretty powerful for such a small product. The cord is a good length. I can vacuum my stairs without an extension cord. The crevice tool is the main reason I chose this one and it works well. Some reviewers say it is too loud. It definitely is loud, but I don't see that as a big issue.",
        "I purchased this to use on my 13 basement stair treads. Used 5 times without any problems--worked great. The 6th time it caught fire. And of course the return was up Jan 31. Do not purchase this.",
        "The external hose doesn't work and the suction is mediocre for the size. To enable the hose you're supposed to rotate a cover over top of the brush. After doing that the hose doesn't perform.",
        "Great haldheld vacuum. I use mostly for cleaning under couch cushions and on the stairs. The hose feature is nice for getting into small cracks and crevices. This unit does take bags when it is full of dirt...not sure where to get these yet because mine has not became full yet. A haldheld vacuum that plugged in was a must for me because you cannot rely on the battery operated vacuums.",
        "I have always been a fan of Dirt Devil. I had one of the hand held ones years ago and decided to order another one. It is a very handy vacuum and I love how easy it is to handle. I was however disappointed that I havent been able to find any attatchments such as an extension pole that fits it. I really love the quality of it!",
        "WOW this is a mighty might.....a bit noisy but it is great on stairs and tight spots.",
        "needed something to replace my old dirt devil vacuum for the stairs. This one was a great replacement. did the job. Lighter than other competitors which is great for the staircase in my home.",
        "This is the worst vacuum cleaner I've ever tried in my life. It is louder than a jet airplane, and it vibrates in your hand more than a dentist's drill does in your teeth. I turned it on for 30 seconds, and packed it right back up to return.",
        "Love this little guy - it is my 2nd Dirt Devil and they are everything I need in a hand=held vacuum. It might be a little loud... but it picks up almost everything.",
        "This was exactly what I was looking for. I use it in my RV. Small & easy to store & strong suction power makes clean up easy. I wish there was an attachment set for it but Dirt Devil does not make one any more. Great buy!",
        "Of course it's noisy, it's got a powerful motor. And when I say it sucks, in this case that's a very good thing",
        "I had another one of these Bagged Handheld Vaccuums that I bought at Target! I loved the previous one; real good at picking up dog hair and other dirt! The only difference with my first one bought at Target and this one is that this one has a hose on it! Good for digging into narrow spaces. Had my first Dirt Devil for almost 20 years! So, it does last with proper maintenance. Good deal, Amazon.com!",
        "I absolutely must use earplugs every time I use this vacuum, and that's terribly inconvenient. While the cord is long, the attachments don't do much. The suction is okay. I'd rather use my full-size CarpetPro vacuum with a longer cord and better attachments to do the same work and be able to hold a conversation at the same time.",
        "I've had Dirt Devils in the past but this one is much improved. It has lots of power and does a great job picking up debris. The long cord is really helpful. The hose doesn't give quit the same power as the Dirt Devil beater, but it's a useful item. I would buy this item again.",
        "There is little suction with the hose and hard to change over from hose to rollers. Disappointed in how it cleans the stairs, no instructions on how to use the hose.",
        "Works as anticipated. Only drawback so far is the silly strap that's supposed to keep the cord stowed properly. I've broken nai8ls trying to get the loop fastened securely.",
        "I love these little vacuums with beater brushes for cleaning upholstry and carpeted stairs of dust and animal fur. I also loved that the product was delivered with minimal extra packaging and that the manufacturer used cardboard instead of styrafoam to protect the product in the box",
        "It's my second Dirt Devil. They last and last for years. My first one didn't have the hose and nozzle assembly. I prefer not having the hose attachment but I don't think it's still available. The machine is noisy so I wear ear plugs.",
        "This vacuum met all my expectations and more. I purchased this to replace my old that I had for about 20 years. One day the belt broke. I decided it was time for a new one. I didn't think that this one would out perform the old one but it did. I use the little Dirt Devil on my stairs and it works wonders. My sister replaced her old Dirt Devil as well. You can not purchase this vacuum in stores.",
        "The Dirt Devil Ultra Power Handheld Vacuum does an excellent cleaning job. It is light to carry, and a variety of attachments are available. I owned one exactly like it before, and when it finally died after years of use, I decided to get another just like it. Part of the decision was made, based on the fact that I already owned the attachments, but clearly if I hadn't liked this vacuum, I wouldn't have bought another just like it.",
        "Noisy unit made of cheap plastic. No resemblance to a similar model I bought in 1994. The suction is worse than a cordless unit.",
        "I was using a stand up vacuum on the stairs prior to ordering the handheld. I have two flights of stairs and it took several hours to get through them all with moving the vacuum, positioning my body just so, so it wouldn't tumble down the stairs, straining my back. The dirt devil got through each flight in about 30 minutes each. Having the extension tool is great for the crevices but I don't feel much suction with it so not quite sure how well it picks things up. My back and my afternoon are much happier. Picks up cat hair nicely too. Definitely recommend!",
        "I brought this for small jobs around the house . This is too heavy to hold and work with it. Found this out too late to send back.",
        "I have two old ones just like this and they died. I love the new version .. So much lighter but a bigger more powerful motor makes it better to use. It does a better job than my older models and is light to handle on the stairs. I am going to get another for the garage and workshop.",
        "I LOVE THIS LITTLE VACUUM. IT PICKS UP EVERYTHING. I KEEP IT IN MY LAUNDRY ROOM.",
        "Overall very good hand vacuum. The suction doesn't seem the equal the noise of the motor but I'm sure its trying. Runs perfectly on the 500w inverter mounted in my van.",
        "THIS IS THE 2ND ON I HAVE BOUGHT. THE ORIGINAL ONE LASTED FOR YEARS. IF YOU HAVE STAIRS THIS IS THE THING FOR YOU.",
        "Noisy as a jet plane but works to suck up the cold ashes from my wood stove just fine. I like the easy brush/hose design. Very simple to switch modes.",
        "This unit replaces one that lasted about 20 years. Good little sucker!",
        "Used Dirt Devil 4 times to vacuum stares works good better then the big vacuum, the Dirt Devil has a brush that fuff up carpet on the steps ,and suck up Durt and is small,not heavy like the big vacuum!",
        "Awful, Awful,Awful! So loud it will cause you to go deaf!!...Doesn't pick up a thing! Don't know why they changed from original old model which was fantastic,to this piece of c--p! Went in the trash!!",
        "What this vacuum may lack in suction power it makes up for with the brushes. They simply power through any dirt on car floor mats, etc. It is on the loud side, but I can deal with that. The cord is also nice an long.",
        "The Dirt Devil Ultimate Handbag has proved to be an excellent product over the 16 year lifespan of my 1st one: Tough, powerful, handy, almost bulletproof, but VERY loud. When my 1st finally expired, I replaced it with it with an identical unit: same model, same production run. So far, so good. babarkingseal11.",
        "Pros: Good suction and the hose attachment is convenient. Cons: bulky and louder than a hurricane! Scares my cat.",
        "now that I live in a split level home, I wanted a hand vac to vacuum the stairs. I am very happy with this! works great",
        "This is a good product and it does exactly what it says it will do... I will definitely buy this again",
        "I love this vacuum for our RV. It has good suction and is small enough to store. Don't waste your time buying a battery operated vacuum as the batteries die soon and the suction is weak.",
        "I bought this as a replacement for an old one that finally bit the dust. I was purchased for my mom who seems to like it.",
        "Excellent seller service! I will be back to get another item! Thanks A++++++",
        "Like the vacuum but disappointed that the tool which should attach to hose was missing.",
        "difficult to move front down to open hose. Can't easily remove bag. If brush roll gets hair clog it is necessary to take apart the front to get at it.I haven't used it and am checking to see ifI can still return it. After professional and check-up cleaning my old dirtdevil is working great and is easier to use",
        "I got this to remove dog hair from the seats in the truck and my couches. Also to clean up at work after I go into attics and drag insulation back out. For all this, the unit works well, mostly because of the rotating brush. Shop vacs just don't get up dog hair. Unit has plenty of power. I bought extra bags and extra belts just to be prepared after reading others reviews.",
        "Great little vac has a great beater bar to pick up dirt . I use it on my carpeted stairs.has more power than battery operated vacs",
        "no real suction so why is it called a vacuum",
        "I was hoping for it to be just a little quieter then our previous Dirt Devil. We needed one with the beater bar so this model was our first choice. We had the original for years but unfortunately dirt found its way into the motor. I priced a new motor but it was cheaper to buy a whole new unit.",
        "Love it - used to have one and have missed it terribly. This is great!! Makes doing the stairs sooooo easy!",
        "After using this item since January the motor has burned out.",
        "This is just what I needed to clean the stair steps. Best vacuum for getting the dog hair off carpet. I am embarrassed to say I worked for the competition and this by far performs so much better.",
        "This Dirt Devil Ultra Power handheld vacuum is replacing an old one that finally wore out. It is the greatest little helper to carry around for small jobs and to clean the stairways. It is quite noisy as others state but it sure is so powerful compared to different brands I have had before. Bags are a great price, I've never cared for vacuums without bags as the plastic cups can be quite messy. I highly recommend this vacuum if you don't mind the noise and the price is great.",
        "I bought this to replace a Dirt Devil handheld that I'd used for 20 years or so. I use it for cleaning stairs. One improvement in this model that I really like is the on-board crevice tool: It's great for cleaning the edges, and it's there when you need it. Altogether, I'd say they've perfected this indispensable vac.",
        "Bought this solely to vacuum stairs. It is super loud. So loud in fact I suggest ear plugs. It overheated and motor fried after 2 uses. Don't buy.",
        "This is my new one, gave my daughter my old one as she needed it for her steps. works really well and i like the new hose with attachment.",
        "I bought this vacuum to remove the dog hair from my steps...i was so tired of sweeping. And found out this works great. Very strong motor... good size ...I even use it vacuum out my vehicles.",
        "Got this for quick and easy cleaning of carpeted stairs without having to drag out full size vac and this seemed to be only one with a brush roll that would actually do the job right. Insanely loud, so much so I have only used once since receiving.",
        "This little vacuum is perfect for stairs and getting into the crevices but it is VERY VERY LOUD.",
        "I bought this as a gift and they loved it.",
        "Pros: Great on Stairs Long cord Suction Hose Cons: Very Loud Hose suction is poor Great vacuum if you only need it for stairs. Not recommended for a vehicle, since the hose is short and suction is not strong enough and it's too bulky to fit into smaller spaces.",
        "This vacuum is not that powerful and make so much noise. Noise of this vacuum might cause hearing problem. Functionality is ok better invest more money to get better vacuum.",
        "Works great and is lightweight. A little noisy to use but great for stairs!",
        "Does not pick hair up from a low-ply carpet and frequently gets clogged. A brush attachment for the hose would be very useful, but the vacuum repair guy confirmed they don't make them.",
        "Very powerful, picks up our golden retriever hair off our couches really nice. Really handy for quick spot clean ups and carpeted stairs.",
        "High power. Very versatile. I love that it will pick up almost anything for a little vacuum.",
        "Always loved this product and I was happy to find it again!",
        "Yes, I have 12 steps that have been hard to vacuum. This little bugger does the job. The motor is loud but it works doing a professional job and a very good price. I bought it on Amazon when the manufacturer no longer sells it on their mail order services. A very long cord too, and it is necessary.",
        "Works great very nice i recommend this product for stairs and quick clean up",
        "Good tool when you don't need a full vacuum cleaner. Good Buy",
        "I bought this to vacuum my stairs with. It is deafeningly loud. It does not have much power to its suction either. Today when I was finished vacuuming with the hose attachment I noticed dirt falling from the brush. All the dirt I vacuumed with the hose was coming back out of the brush area. The cover was completely closed and the bag was nearly new. Do not waste your money!",
        "It has served the purpose for which i bought it very well. It is just what I wanted.",
        "Bought this for cathair, and it works well. But it is SOOOOOO OOO LOOOUUUDDDD. Like REALLLLLYYYYY LOUD. Scares cats, but sucks the cat hair on furniture well. Not great on bare floors.",
        "I have always loved Dirt Devil since the 80s! It is compact and perfect for our ski boat on the lake. It it light and take very little room. Great value and quality.",
        "I had two older Dirt Devil Vacs and they were great/ Mine wore out so I ordered a new one. This vacuum is almost worthless. Does not compare in any way to my older ones. I will not by another Dirt Devil product.",
        "Though this would last like the original did but this one cheaply made. Mostly plastic.",
        "Worst suction power I've ever experienced. It was laughable actually."
    ]
}