{
    "entity": "Handheld Vacuums",
    "text": [
        "It worked great when I first bought it, but after just a few uses the belt drive clogged up with hairs. I managed to get the thing open enough to clear the drive and reinstall the belt but the brush is not as strong as original and must have stretched. It slips and the brush stops turning with just a small amount of pressure/resistance. It is very, very hard to self-replace the belt, and they tell you that you have to return the unit if the belt breaks. WHY CAN'T SOMEONE ACTUALLY MAKE A GOOD PET HAIR REMOVAL HAND VACUUM???!!! This is the second kind I have tried.",
        "I used to like this vacuum until it caught on FIRE! While vacuuming, smoke came out of the outlet, where only this vacuum was plugged in ( I was vacuuming it for about 3 min, no reason to get overheated). When I pulled the cord out of the outlet, one of the prongs fell off. I have included pictures of the faulty vacuum and the outlet. I tried to contact Eureka but their main email listed on their website it's not working. I then emailed their Parts Dept., they said they can't help with my issue. This vacuum is a fire hazard!",
        "Bought on 1 April 2017. I own another one that has worked for years. The beater brush on this new one quit working in January 2018. Warranty says it's good for 1 year. Called the service line; was told the warranty was effective \"by serial number,\" and mine was \"out of warranty,\" after owning it for only 9 months. Apparently the warranty is not good from the date of purchase, but from the date they put the serial number on it. Neat trick: make them, put them on the shelf for months, sell them when the warranty is no longer good. Word to the wise on this one.",
        "I am not happy with the performance of this vacuum. It plugs in, so I thought it would work better than a battery-powered model. However, it did not pick up dirt or hair in my car, and the shape of the unit made it very difficult to use on the cars floor. The beater bar stopped rotating after 1 year of use. I tried to replace the belt, which was very difficult. And the bar still does not rotate. I believe the motor may have gotten damaged when I tried to reassemble the thing. Now I cannot return it, and it is useless.",
        "My previous handheld vacuum died out as I was vacuuming the last step of our staircase. I ordered this and when it came in 2 days later I re-did the stairs and could not believe how much it picked up. Much more suction than my old model. Two nice features are the ability to do the riser of the step without being a contortionist and having the hose to do crevices in couch cushions. Very happy with this product.",
        "I only write reviews when I think a product is really good or really bad. The vac is in the very good category. I just bought another one after the one I had died. In buying the new one, I realized that I had purchased my first one in 2006. I’d say 13 years is a darn good lifespan! During most of that time I was a carpenter and used it to clean up my shop. I also had at least two dogs who shed so I used it constantly both in my house and truck. It has been a total workhorse. Suction is excellent and obviously so is longevity. I highly recommend this vac.",
        "I bought this unit about 8 months ago, for use on the stairs. Since then, I've used it maybe 5-6 times. Today, the motor for the brush drive belt died. The reason why I bought this unit. So now I can't use the unit for deep cleaning on my stairs, and the unit is now just a waste of shelf space. I do work in small appliances, so I disassembled the unit, cleaned everything. Either the circuit board to the drive shaft motor is fried, or something else.more internal. Either way, it's not the hair buildup jamming the unit anymore.",
        "If I had known this little vacuum existed before now I would have bought it long ago. I have a Jack Russell terroir who sheds like crazy and my large vacuum is awesome on floors, but not so good on stairs, mostly because this user hates having it to haul it up the stairs on only having the hose to vacuum the stairs. This lil guy is awesome! Very light weight, great suction, vacuumed up all the doggy hairs it found and I was able to vacuum my stairs in record time. This lil vacuum will probably also become my car vacuum, such light weight but strong suction.",
        "Beater Brush Drive Gear Fails after couple hours of use. I am an engineer and I can say a first year engineer would not miss this design flaw, this is engineering 101. So I disassembled to discover what failed. The plastic brush drive pulley is pressed on the motor drive shaft which is only a mm in diameter. Within a very short time of use the shaft just spins in the pulley. Don't waste you money shark hand vacs are much better quality.",
        "I've owned this thing for almost 8 years. It's still just as powerful as it was on day one. The yellow and black combo is beautiful as well. The visor is an issue though. The material it's made out of is kind of cheap so it breaks easily which is odd since everything else is made of heavy duty, quality material to the point where this vacuum has some heft to it. It has an extremely long cord as well which is awesome. As technology has changed though I'd pick up a cordless vacuum as the hassle of dealing with a cord is just not worth it anymore.",
        "I have used this I use this hand vac for approximately 4 or 5 years. I have used it on my furniture at least twice a week, mainly to remove cat hair (several cats in residence) . It picks up pet hair, my hair, dust and dander extremely well. Very happy with it. I gave it 4 stars because it is rather on the heavy side.",
        "I had used the same model for a long time. After years of flawless workhorse performance, I finally abused it too much, i guess (sucking up the fine sawdust from sanding a patch of wood floor choked it out) and it gave up the ghost. I expect this new one will also last several years, and more, since I have a better idea of what to avoid. Indispensable for vacuuming the stairs! And I much prefer a corded model, for extended usage.",
        "Eureka has always been a top company for vacs. I have several stick kinds, and this one for cat litter,for my car, and attaching to a smaller hose for sucking out my dryer vent lint. I also bought replacement filters on Amazon over the years. It is extremely powerful. Love to attach it to a spare longer plastic hose to suck up a summer bug haunting my vaulted ceiling on occasion, lol! Love it, and never had issues.",
        "I have been using the Eureka Model 71 B-4, everywhere, nice long cord allowed me to use it in the car and in the home, around the RV, it has the power to do the area rug in the RV even after a trip to the beach, so one day after a trip to the woods with all pine fronds, and sticker burrs I fired my eureka up like normal, pulled out the crevasse tool and the hose broke, I tried taping it till I got a new hose but you can't buy one, I have looked all over but was unable to find it or a substitute for the hose, I used some auto radiator hose.",
        "This is the second one I bought. It is easy to use and has good suction, so I gave it a second chance. The first one had the belt pulley on the motor start slipping on the shaft. It's press fit and made of plastic, so you can't fix it. And no spare parts available for this. The second one did the same thing, but this time the motor pulley ID melted on the shaft. I've had to clean hair out of the brush several times as the smallest amount will keep it from rotating. Hence the overheating of the pulley on the shaft. Won't buy it again. Design change: use a metal pulley secured to the motor shaft.",
        "I really like this vacuum. It is powerful. Cord length is appropriate. Picks up a lot of dust and dirt. Needs two improvements however. One, the cord doesn't stay on the cord wrap - unless you are able to attach the plug to one of the first wraps it will easily loosen and loop off. Two, hair works its way in to an inner bearing which causes the brush-roll not to spin. It is fixable but very annoying to have to take apart the vacuum, almost completely, every 2 or 3 uses to keep it running.",
        "I got one as a gift and the roller motor stopped working about a year later. I thought it was a fluke and since I liked the vacuum, I got another one and within 4 months the roller motor again stopped working. I only used this to vacuum one set of stairs about once a month so it's not due to overuse, I think it's just a bad design. The suction part is still fine, but without the rollers turning it just doesn't work well.",
        "At first I really liked this little vacuum cleaner, but after moderate use, the roller bar stopped working. For some reason, i bought a second one. This one, now less than 6 months later, has the same problem. I use it mostly for dog hair but clean it out on a regular basis. I doubt i'll buy a third one and will probably look into finding out if there really is a money back guarantee.",
        "This is a great little vacuum. It's cheap, and everyone should augment their normal full sized vacuum with this little wonder. I use this for spot cleaning on carpets, car cleaning, crevice cleaning, but the best application is for (carpeted) stairs. It is perfect for stairs, as it is light and easy to maneuver, cleaning the step and riser part of the stair, then changing to the crevice tool to vacuum the edges. It has a decent length power cord as well and stores compactly. There are options for vacuum with or without spinning brush, and there are two options for adjusting where the vacuum opening is - on the bottom or at the front (again, great for stairs).",
        "I purchased this from Amazon but it must've been under my husband's account ( that's why it's not verified). I loved this hand vac for two years. It was great on stairs. I had to cut hair out of the brush often but that's true with any vacuum cleaner. Then after two years the motor started smoking. This should have lasted longer than two years and the motor catching on fire was just scary. We did not use it that often and only used it for easy jobs like vacuuming the stairs. And of course, it was out of warranty.",
        "We have a Labrador retriever, so we are not strangers to pet hair everywhere. We also have a house full of kids... lots of mess on the stairs, even with our 'no shoes' rule. But this baby takes care of business! The long cord is really great, the suction power is perfect, and the weight is perfect. It's heavy enough that it feels substantial (which feels higher quality, to me), but not too heavy at all for my boys (ages 8-12) to use on those stair messes ;).",
        "This is fantastic vacuum. I bought this to clean and maintain abilliards table. Its a great way to clean the felt. However, the vacuum is so good and has such great suction that I now use it everywhere. This thing makes the Dustbuster type vacuum look like a toy. It is just a tiny bit larger but basically the same size. Strong suction, easy to empty and clean.",
        "Vacuum cleaned well while it worked. After two and a half months, just a few uses of cleaning stairs, the brush stopped turning. Thinking it was the drive belt, I opened it up only to find the belt was fine, but the drive cog would spin freely on a VERY small motor shaft. Apparently this is a press fit plastic cog/gear and the motor shaft is round - no flat side. No idea how the cog is expected to stay 'bonded' to the small (1/8\"?) diameter shaft. I would not recommend this product due to this design.",
        "Worked great when it was new but very quickly the brushes stopped spinning despite my cleaning any hair wrapped around the bar after every use. I live in a tiny New York apartment, it’s not like I’m cleaning flights of stairs or a massive area, I just wanted something that could keep the one rug in my home clean. It’s a bummer it wore out so quickly, I was really pleased with this vacuum when it was new.",
        "Strongly recommend avoiding this product and just paying the extra premium for other models with better reviews. Vacuum does not have significant suction power, isn't particularly easy to clean, and broke within 10 uses for me as it was not picking up debris anymore. Afterwards I disassembled, cleaned, and re-assembled vacuum but it still would not pick up any debris.",
        "I really loved my previous hand-vac but couldn't find a replacement when the time came. So I bought this one online. It is bigger than I wanted. The dirt catcher is slightly smaller. The hose isn't that flexible, so the attachment is usually facing the wrong way. Either that, or it just falls out of its stash-hole. But overall, it works well. And I plan to keep it and use it until I wear it out.",
        "Purchased in March of 2017. Was great while it lasted but now the brush won’t spin well and the brush motor is weak. Bristles stop spinning when they hit any type of resistance. This was used only for stairs and should have lasted a much longer time. I would not recommend to a friend as mine didn’t last.",
        "Bought this vacuum for stairs and it works extremely well. I have been very happy with it. I have had it since 2012 and still going strong.",
        "I love having this around. I vacuumed my couch recently and it did a great job. Been using this for 2+ years now and no complaints. As some other users have mentioned - please don't assume this can do the job of a large upright vacuum cleaner. It will get hot after continued use. If you clean out the receptacle and make sure to use it in short spurts this will work well for you!",
        "The hose has broken on both ends it splits between the wire embedded in the hose. It broke at the ends where it is connected to the plastic ends. ordering a replacement one for $17 plus shipping from a parts site not on amazon. We used it monthly to clean the car and I don't think the use was abusive or we pulled on the hose to far. I sucks killer and is easy to use so buying another hose don't think the tape will last much longer.",
        "I bought this in October 2015 because the reviews were great. But if you are arthritic the toggle takes a lot of pressure for switching into on/off. I mean a lot and I'm not arthritic. While it worked it deserved 4.5 stars but around year two the suction wasn't what it was and now at 2 1/2 years it just blows air. I had bought all the accessories and extra filters. I cleaned it before and after each use. I'm not sure why it stopped working. I'm not keen on purchasing another one, I expected it to last longer.",
        "I purchased this vacuum specifically for my stairs. It worked ok in the beginning but as time went by, the roller would stick or stop rolling all together. Now, it squeaks most of the time and the roller will not work at all. Less than a year old and I have to throw it away. Very disappointing.",
        "We have some carpeted stairs, which is why I bought this. It works just fine. The slide switch to activate the power roller is a little glitchy -- sticks -- but mostly tolerable. My only complaint is when I use the hose to get in corners and odd places, the exhaust vent seems to be blowing in precisely the wrong place, and it moves dust and dirt around. I have learned to deal with that, but it can be annoying.",
        "I'd return it but we've had it a bit before we used it and it's almost not worth the trouble. After the roller stopped working, I'd looked online and then (only too late) saw the many reporting similar failure. You can't fix it without breaking plastic and trying to take it apart in a way it's not meant to do.",
        "This is our second one because something sharp got caught in the first one and cut a hole in the expandable tube. Aside from sharp things cutting things, it’s a great little vacuum. We use it for quick clean-ups on the house and to clean up the cars. It’s worth the price.",
        "This thing worked quite well when I first ran it...for about 90 seconds. Then the hose clogged up. This happens sometimes, no big deal, right? Wrong. The hose cannot be removed from the body, and the clog is near the macaroni bend, so it cannot be unclogged. Turn it, pull it, twist it, doesn't matter--the hose ain't coming off. This is an unacceptable design flaw for a vacuum. It boggles the mind that this cleared R&D for approval.",
        "My diet devil died, so I decided to try a different maker. I read numerous reviews both good and bad and decided that I couldn't go wrong for $60.00. I also ordered 2 extra filters, so glad I did. I've only used the vac twice on carpeted stairs and the filter looks shot. The vac seems to pick up particles while, but it overheats too quickly. I could only do one flight of stairs before it overheated. Also you have to keep checking to make sure the hose is connected. But all in all, it works for the purpose that I bought it.",
        "Pros: - V. Good suction power; it even picked hairs - I think that got embedded deep inside the sofa cushion because I couldn't see them otherwise. - 20ft long power cord, so if you don't have an outlet by your car (no worries) - Light weight and the handle is so ergonomic - compact design, best is everything has its place and therefore you don't have to find separate places and then get lazy for using them Cons: - I gave is five stars even though I find it little difficult to pull the dust catching pipe; its now very flexible/stretchable but other than this its the best purchase I have made.",
        "I got this mostly to do the stairs in our house. The first one we got didn't last through the first use before the brush stopped turning. Amazon swapped it for a second with no fuss, which so far is still working well. Long term I see that it will be a problem to clean. There's no easy way to access the brush and clean out the inevitable cat hair it will start collecting. I'm afraid with time it will get clogged with hair and rendered unusable.",
        "Finally getting around to writing a review, mainly because when it broke a month after I bought it, it went in the closet and was forgotten. Would be given 5 stars if it has remained functioning properly, as it is very powerful and easy to clean, but the rotating brush broke during it's third use on my stairs, rending it essentially useless. Pretty disappointing for the price. I wish I had pushed for a refund when it was still an available option.",
        "Handy vacuum. Light weight, easy to pull out and use. Easier than pulling out my central vac hose for small and quick clean ups. Line voltage (electrical) instead of battery means it's more powerful and gets the job done. Bagless means it is convenient to empty the dust cup and no bags to buy or mess with. I suggest reverse vacuuming the dust filter with another vacuum (if you have one) to keep it from clogging. Note, if you want a light weight vacuum for whole-house floor cleaning, this is not the one (unless you like moving around on your knees).",
        "My only substantial gripe is that the hot air coming out the exhaust is quite intense and is directed straight towards the user. Otherwise, and notwithstanding, I'm quite pleased. I was very hesitant about getting a non-cordless, but now that I've had it for a month or so, I feel I made the right decision. Gone are worries about battery life, waning strength and charging. It's like a full vacuum in your hand (obviously smaller but just as powerful). And it's definitely light and nimble enough to not cause reluctance about whipping it out at any time (no pun intended:). Yes, it's slightly annoying to have to plug and unplug it periodically, but the benefits outweigh the drawbacks.",
        "I just got this vacuum a few min ago. I loved the price and the features advertised. However it doesn't work exactly as advertised. Though the suction is decent , the brush does not work on carpet . Another reviewer showed something on hardwood floors. I decided to show this on my carpet. The motor appears too weak to spin the brushes against the carpet. There is room for improvement on this product. I searched Amazon and did not find options for a hand held spinning brush vacuum. This one seems perfect but the spinning brush is a big disappointment because the motor just cant spin the brush against carpet.",
        "I own two of these, the first one broke about a year in. I just use it for stairs, and the brush stopped spinning. So I bought a replacement. Which the brush stopped spinning properly in the first 10 minutes of use. Like how can a company make a product that fails immediately. This is absolutely absurd and I am beyond infuriated with Eureka and their horrendous product. It has decent suction, and the hose is good for corners and along trim, but the brush head is soooo incredibly fragile that you are just buying a mediocre handheld shop vac at this point. DO NOT WASTE YOUR TIME!",
        "This was purchased for our motorhome and it did pick up more dirt and dog hair than I imagined. But it is one of the hardest to use portable vacs I've ever used. It's pretty large and heavy to start with, then it's very stubborn to push across the carpet. Even with the little roller on which usually helps it was very tiring to use. I can't image using it to vac a car. And the dust filter would be hard to clean if not for our exterior compressed air hose. But as I said it picked up amazingly well. Maybe I'll just have to turn this job over to my husband.",
        "Purchased this to do a set of carpeted stairs. The vacuum met my expectations. Easy to use on stairs. Suction is great. Easy to empty dust cup. Easy to store - cord wraps around vacuum and nozzle has a storage spot on vacuum too. All self-contained. Lightweight. Wish I had one of these sooner. Knew there had to be an easier way than lugging an upright vacuum on the stairs.",
        "Love everything about this vac except for the dust cup. All the dirt sticks to the dust cup making it hard to empty. I have to run a scrub brush over it to loosen the dirt. I bought it mainly for sweeping the stairs. It doesn't hurt my back and is much easier to use than my big vac. Works great! I've found I use it to clean many other things too. It's become my cleaning sidekick. I'd give it 5+ stars if it wasn't for the dirt trapping dust cup material.",
        "Purchased in April 2018. Seemed good at the time. Used about once per month over past 1-1/4 years....and now the brush no longer turns. After reading several reviews of the same issue, sounds like it's not worth trying to fix. I checked the belt and it appears to be fine. I think Eureka owes us all refunds.",
        "Brought the item and after two month of sporadic use, the brush stopped working. The suction is good but without the brush spinning it is not cleaning the carpeted stairs. It works with the hose. I do not recommend this item if you are going to have a working brush.",
        "It was ok for a while but after using it about a few years the hose ripped just at the base of the hose where it went into the opening when not in use .. I trye taping it with duck tape & that only lasted so long, I tried several times more to tape but it would not hold the rip no more. I wish it was made out of better material because if so it would of lasted a longer period of time..",
        "Bought this as a replacement for an identical model that I have had for years that was starting to fail. (Imagine a car with a billion miles and you get the idea). When it finally died, I puled this one out of the box and the beater did not work. It was well after the return period, which is my fault for not testing it fully as soon as I got it, so I am stuck with a dud. Shame, because I loved the first one!",
        "I just purchased my second of this same vacuum after dropping my old one and breaking the visor. I ordered a different handheld (cheaper DD one) and it isn’t anywhere near as good as this one. You can see in the picture what this guy picked up on just one pass on my stairs (which had been vacuumed 5 days before). Can’t recommend enough. I suggest rinsing out the filter every so often (dry fully before putting it back in!) so extend the life and function.",
        "This a handy little vac that is quite good. This is my second purchase. The first one was good but I had a CFC bulb that broke and vacuumed it up with the first one. Being very concerned about mercury residue I threw out the first one and purchased another one. Pros long cord sturdy good suction power easy to store easy to clean easy attachment storage at the back Nice feature to vacuum vertical part of stair Cons Hard to get to internal parts to clean out dust The cleaning brushes could be a bit sturdier and have more fibers Overall I highly recommend that vacuum",
        "I purchased this after much research only to have it work wonderfully, ONCE. The 2nd time the beater bar will not work, which does me no good as I need that to work for pet hair removal. Very disappointing.",
        "I bought this Eureka hand vac on June 19th, 2008. I use it at least once a week. It's still going. I bought a spare filter, but I'm still using the original one. My secret is that I vacuum using only the hose. The bottom brush roller works, but it's a roller. It's going to accumulate dirtballs and hair. There's no avoiding that. And I'm a neat freak, so going over every inch with the hose is fine by me. It guarantees that I pick up stuff that the rollers wouldn't. This is perfect for bedrooms or a studio apartment.",
        "The suction power is really sub-par. The pet brush is a joke and I have to use scissors regularly to cut out hair that has wound around the brush and gotten stuck, hampering the motor. I do not recommend. I've had it 9 months now and it just over-heated and stopped working even though the brush attachment is not jammed with hair or anything. In fact, I clean the brush out after each use because the suction is so poor to start with.",
        "Used this unit on carpeted stairs straight out of the box. The brush bar motor seemed very weak as you could stop the rotating brush with one finger. It started out strong and then just gave up. I thought maybe some hair got wrapped around the bar causing the problem (Not likely, but it was worth looking into). However, the unit is NOT serviceable! Aside from filter cleaning. Belt is not accessible.",
        "I have purchased a couple of these over the past 5 years , I have noticed the the quality and durability of the vacuum has dropped over the years, the hose keeps bursting after about one month of constant use , I am highly disappointed as I really like how power this little boy works , but it’s no good without a suction hose. On my third buy I thought it probably was just a manufacturing default with the hose , but then I bought it again and encountered the same problem . I hope y’all can replace the hose with the durable material y’all started manufacturing with because this is a great inconvenience.",
        "Piece of junk. I bought this for doing my stairs - it's junk. The brushes stop spinning as soon as the thing is put on the carpet and I'm not pressing hard nor do I have super think carpet. The suction isn't that great either. Moved it to our travel trailer thinking it would be better on the super short pile carpet. Nope. The brushes still don't actually do their job. So disappointed in this that I had to come back and write a review when I saw it come up in my search when looking for something to replace it.",
        "I wanted a hand vacuum for cleaning my car and small clean ups around the house. I opted for a plug-in version because they tend to be more powerful than battery operated models. This model is just what I wanted. It has powerful suction with a brush on and off mode. You can also use the hose to get into corners and tight spaces. I did not find it heavy and it is easy to clean. The only things that would make this vacuum even better is to have a longer hose and for it not to be so loud (I really think you need to wear ear plugs when using this to prevent damage and hearing loss).",
        "I cannot believe the good reviews this vacuum gets. I have used it twice and it is a terrible design. I purchased it because I wanted something powerful and small for my carpeted stairs. 1) The button to turn on the brush works 50% of the time, it either turns on the brush or turns off the vacuum completely 2) the brush is mostly for looks. When you vacuum the stairs the suction slows/stops the brush. It is simple not powerful enough to overcome the suction. 3) the filter is terrible. Hair and dirt get through it and clog up the vacuum, see pictures I either have a very faulty vacuum or it is just that bad.",
        "This light weight vacuum is useful for various areas of the house and car. I use it to vacuum up the carpeted stairs and in my car. This vacuum is not too heavy and makes it easy to move around the house and car. It also allows me to vacuum those hard to get to places.",
        "This vacuum is great for dog hair, carpets, and hard floors or surfaces. It is a little big and a little loud, but that's because it's very powerful! It has a brush that works very well with a rotating lid that allows you to open the brush for use on the backs of upholstery or carpeted stairs without having to hold it an awkward position. Works great in the car and for crumbs around the house! I only wish the hose was a bit longer, but then again it is a handheld not a full size vac...especially for the price. I paid $39.99. I also love the mini tool attachment kit for really tight spots! Both are well worth it!",
        "Thank god eureka has a good warranty. I’m on my third vacuum. I ONLY use this on one flight of stairs in a regular house. It will last maybe 4 months before the roller stops working. I love it when it works.",
        "I bought this vacuum 4 years ago, on the recommendation of a neighbor that had a dog and a cat. Hair everywhere. I had two cats that used to shed year round, everywhere. . My couches are quite plush with indentations and welts. This vacuum cleaned it in a few short minutes, and afterwards looked like no pet had ever sat (or better said napped) on the couch. My cats are waiting on the rainbow bridge, but I use the vacuum and it's as good as brand new. If you have pets, buy it. It will do wonders for you around the house.",
        "After years of being annoyed at short-lived rechargeable dustbusters, I finally broke down and went corded. I'll never go back. Pros: Far more power than any cordless. Easy to clean dust cup and filter Durable (I've used it a lot) Well-designed cord-wrap Excellent crevice hose and tool design Well-balanced Brush works well Cord is long Cons: A bit heavy, but how else would they make it this powerful? You do have to plug it in. After using it for more than a year, I changed my 4-stars to 5. I rarely do that. But it's held up that well. I bought a rental property, and it was invaluable for constant cleanups during fix-up.",
        "I bought couches with high-carpet material. With a cat and a 1 year old, that was a mistake. I'm talking crumb city and fur heaven. My regular vacuum, and even the vacuum attachement, were no match. My poor couches looked so dirty, my guests were uncomfortable sitting on them. Then i bought this vacuum and it completely changed everything! With one run through on 'high' setting, my couches looked brand new again!! I'm much less stressed, and proud of my apartment now. I highly reccomend this vacuum if you are in a situation like i was.",
        "I bought this for use on our boat since cordless versions just don't last long enough or have enough suction power (with the exception of Dyson, but even their cordless versions have a limited run time). There aren't a lot of options for handheld vacuums with cords. This works SO well and really has strong suction. It's not often that my husband gets excited about something like a vacuum cleaner, but he did about how well this worked! Plus, it's cute....it looks like a little Yellow Submarine. :-) Lastly -- it's a fantastic value because of its reasonable price.",
        "I can not rate this high enough with only a five star scale. I bought this to replace a Black and Decker Fustbuster. The battery no longer held a charge. I checked Sears, and they had one similar to the one I bought here on Amazon, but for double the price and high shipping too. So, I checked Amazon. Imagine my surprise when I saw this price. I also have a Bissell Powerforce stand up vacuum. This Eureka out leans both of what I had by 200%! I just did three of my four rooms and am absolutely amazed at what this Eureka. Picked up. I recommend this machine highly.",
        "This thing is simply amazing. I rent a single room, so having a full size vacuum cleaner isnt really the practical choice. This seems to be as strong as any normal vacuum yet it's handheld. It can do anything a regular vacuum can do, with the minor problem of bending over a little bit, but i just simply kneel every couple feet so it's not really an issue. Capacity is great and can easily handle several vacuuming sessions without emptying. The cord is nice and long so I dont need to change outlets at all.",
        "Been using this for 4+ YEARS!! Got tired of the first one, and its filter was probably done, so got the same one to replace it, because its perfect! - powerful - small and handy - easy to use - easy to clean (although, one should regularly clean the brushes of any tangled hairs, etc. - perhaps after every 4-5 uses - will make the product last much longer) - long enough cable - ok noise pollution, its not quite but manageable - long lasting, sturdy and durable guess one downside is that you cannot wash the filter.. but one can use some sort of bristles or brush to clean that periodically",
        "I had been looking for a CORDED handheld vacuum to replace one I've had forever that just broke. Corded always seems to have more power than a cordless/battery unit. I use this mainly to vacuum my 3 bathroom floors and bathroom throw rugs. It works great on picking up the hair on both the floor and throw rugs. I really like the attached hose feature to get under the radiators and use on stairs. I use my large upright mainly for carpeted stairs but this is great to get in the corners of stairs too. It is not heavy and not very loud. Very happy with the purchase.",
        "It is marvelous - I am a proud senior that hates going up and down stairs carrying things - and especially heavy vacuums - this is my solution for everything - does the stairs, bathrooms, the corners and all those hard to get to places better than a regular HEAVY Dyson or some other brand of vacuum - luv it luv it luv it.....also, easy to clean and stor es anywhere - does not fail me EVER. Did I mention - I luv it!!!!!!! Eureka does it again!!!!!",
        "It was affordable at the time. I used it a handful of times before I gave it away to a family member. I worked okay for smaller jobs but it just wasn't doing the job. I ended up replacing it.",
        "Great vacuum. This is actually my second one. My old one died (after a very long and fulfilled life!), so I bought a new one right away. I have 2 dogs who shed like crazy and a small house. This vacuum takes the pet hair off...well everything! and does not take up much space. I opted for this one with a cored because during tough pet hair vacuuming, there is nothing worse than the vacuum dying on you! It is super easy to clean all the way through, and hardly any clogging issues. Great product!",
        "This is great for a household with pets! I have carpeted stairs and this is nice because you can flip the front down to do the rises on your staircase as well. It has great power and suction and is very easy to clean and empty. It is also nice to be able to use the hose when you need something quickly. After using this for several months, one thing still bothers me. The handle is thick and bulky. It is not ergonomic whatsoever and sometimes with prolonged use, annoying in the hand. Eureka should rethink the shape and size of the handle.",
        "This vacuum is handy to have around. I use it to vacuum out my washing machine before I do my laundry (dogs hair). It works well, the cord is plenty long enough, but the hose is very short. I have to hold the machine while I vacuum. The item is a bit heavy for me so my arm tires quickly while using it. I thought it would be a good addition to my boat but it will not work for that purpose because of the weight and the very short hose.",
        "The front roller for cleaning rugs stopped working after the first week. The container at the front if difficult to use. The filter compartment is very small and difficult to clean. I bought this vacuum less than 6 months ago and now need to buy a new one because the filter compartment is completely stuck. Very disappointed. One thing I like is that it is small and easy for stairs.",
        "I have had this vac for a while now and have both positive and negative experiences. Its extremely powerful for a small vacuum. The brush however is not. If you attempt to use this on a rug, the vac sucks so hard that the brush will stop spinning. It works ok for stairs but it can't get into the corners. The exhaust seems to blow anything behind you up into the air because it's angled down. It does not work well for our cars for this reason. If your constantly turning it because of a confined space, you're simply blowing dust and dirt all over.",
        "Great vacuum for the price. I wanted one that had the power of a plug-in, that I cannot seem to get from the rechargeable \"dust buster\" type of hand held vacuums, and no filters to buy. This one ticks all the boxes: powerful suction. no loss in power since it is a plug-in and not battery driven; easy to clean filter and cup; rotating brushes, long cord and light weight. No other vacuum with all these features came close to the its low price. Similar plug-in hand-held vacuums were 2 to 3 times more expensive. This size and power is perfect for cleaning dog hair off furniture and doing stairs. Highly recommend it.",
        "Bought mine 6 years ago and have used it sparingly, but it does a great job every time and has very strong suction. There is no motorized brush so take that into consideration. However, I haven’t needed that feature but those with carpeted stairs may. Overall, a great buy, just a little loud.",
        "We tried two small vacuums with batteries on our small sailboat. Both worked OK (e.g. not very well) for a month or two, and then just lost power to the point of being useless. The batteries are no doubt the problem, but there was no easy way to replace them. In contrast, this Eureka has a cord and plugs in directly to either shore power or to our boat's small inverter (the truth is, we only clean up when we get back to the dock). The result is MUCH more power/vacuum and it just keeps working. The detachable hose is a bit short, but works fine and saves space. Very easy to clean the filter.",
        "I've only used this on my stairs and I love this thing! It is so easy to clean them now and I don't have to wait for it to charge since it plugs into the wall (and has a long cable.) I've been recommending it to everyone I know with carpeted stairs. Love that you can flip the tip so the rollers can clean the front of the stairs too.",
        "Powerful suction. Long cord. Just nosey. Very noisey. Relatively light but if u have carpel tunnel sundrome, it will tire the hand. Filters seem really cheap and simple and kinda pricey. Well scoop just about anything up that it can fit into its chamber.",
        "This vacuum seems to have decent suction. The hose is useful. The cord length is long enough to get by. The motor belt is difficult to get to, so if that fails, be prepared for a fight to get to all the necessary screws. Unfortunately, that is not what failed on our vacuum. It seems that the motor that runs the brush burnt out. We are in the process making a claim against the warranty. If you buy from amazon, be prepared to show your invoice. The vacuum is made by Electrolux - you will be working with them. We expect to get a replacement, but I also expect to need to replace that one in a few months.",
        "This worked for me I got just to use on the stairs. It worked fine though I have 2 cats and 2 dogs. it wasn't so good at getting all the hair. But it did get the dirt of the entry stairs. then I would have to brush the stairs to get the hair. after a lot of use the tube ripped and we had to tape it.",
        "The wife was looking for a vacuum that would pick up pet hair off the couch and not break down. looking around, I wanted some sort of rechargeable one because we have an older house and not that many outlets. I went with the corded version because it had better reviews and was cheaper vis a vis a rechargeable. On the first uses, it has been more than adequate. The cord is long enough that the worry about not being able to reach things is not a worry, and the suction is stronger than I would expect from a battery powered device. At this point, I can't speak to the product's durability.",
        "I have a three story house and this lightweight vacuum is extremely easy to carry and use when cleaning my stair carpet. The vacuum suction is great and the vacuum filter is extremely easy to clean after cleaning the stairs. I am a very satisfied customer.",
        "Brush stopped working after a couple of days. I just kept using the vacuum thinking it had a broken belt I could easily replace. Tried to take the bottom off tonight to look at the belt and ended up breaking a piece of plastic off of it because it doesn’t open easily. The belt was fine, it was the brush motor that wasn’t turning. But now it’s even more broken than before. It did have powerful suction, though.",
        "We bought this vacuum because the price was very good and it was rated 4-stars. We used it about once per week to vacuum our carpeted stairs. It lasted 33 months before it lost all of its suction. Based on our personal experience, this vacuum costs about 45 dollars, lasts 135 uses, which amounts to $0.33 per vacuum not including electricity + your time/labor.",
        "Loved it the first year, really worked wonders in getting pet hair out of the car upholstery. But about a year after purchase the roller has stopped working; it spins rather weakly and randomly. The suction was still great but without the brush it’s only marginally useful",
        "Hands down THE best hand held vacuum!! I searched high and low for the perfect thing to clean my staircase! The rug that covers my steps is low profile, tight knit. I had a lot of dig hair visible that I couldn't get up. I read all the reviews and settled on this one. It got up all the hair and apparently months (yes I'm ashamed to admit) of dirt as well. Being hand held it has a small reservoir that needed emptied frequently, that is to be expected. I definitely recommend it!!",
        "I'm overseas and live in a tent in the desert. This vacuum is exactly what I needed to keep my little living area clean. Without it life would be terrible here. Yes, it's somewhat noisy, but not compared to others that I've used that are similar in size. It performs just as well, if not better than any small vaccuum I've ever used. I don't think you'll need any more power than this, but keep it mind it's for small jobs. It's built pretty well, and I haven't had any problems with it for the last few months that I've used it. I'm very happy with this purchase.",
        "It's been almost 8 years and it works just as well as the day I purchased this. I was inquiring about changing the filter inside when I realized that I never left a review, The long power cord makes it so convenient. It is very powerful, durable, and useful. I use it for multiple uses throughout the house. Great for cleaning out the car too.",
        "Updated as of 11/2016: The roller has broken, but it still sucks. So it will be ok for picking up debris, but nothing else. I opened it up to get a better idea, and the motor for the roller has a plastic bit on the end. I'm guessing it just overheated over time and got bent as a result. Kind of sad that it is a plastic bit connected to a motor. Again, we can use it on hard surfaces, but we need something else to clean our stairs/carpets/car seats, etc..",
        "Purchased this sweeper late April 20018, for our boat, and only used lightly once a weekend. The motor that drives the brush is very weak and will stop rotating when in contact with carpet or cushion fabric. Brush quit entirely by September 2018. The whole idea of this sweeper was to remove pet hair from the cushions and without a brush it is worthless. Replaced it with a cordless Bissell and couldn't be happier!",
        "I am in love with a little vacuum. I checked Consumer Reports for a good stairway handheld vacuum. This was by far the lowest price of the recommended vacuums. My carpeted stairway has become the preferred sleeping spot for my 2 cats. This vacuum took care of it. Also, one of the features is a 'flip up' plastic roller cover that makes the rotating brush touch a vertical surface. It was so gratifying to see that vacuum go for the steps on the vertical. The cats sleep with their backs touching the vertical side of a step. No more fur.",
        "This thing has lasted from day of purchase up until a week ago when the cylinder for the brush finally died on us. Its out of warranty so I need to find a replacement cylinder and see if I can replace it at home.",
        "I'm so ecstatic about this vacuum because I finally found one with a suction strong enough for dog hair and for a cheap price! It is so powerful that all the dog hair in my car is virtually gone. My favorite chair that my dog shares with me is practically brand new! The only drawbacks are 1) too loud, 2) gets heavy after a long use, 3) the hose isn't long enough (you have to carry it with one hand and use the hose with the other and thats when it gets too heavy, 4) the cord doesn't retract. But these are sacrifices I can live with as long as it picks up dog hair.",
        "Ehhh. The vacuum itself is nice and works well, but I really regret not getting something cordless instead. My advice to you is to think about your needs before buying this. Are you buying it for QUICK clean ups? Or for your car maybe? If so, don't get this. Get something cordless. Are you buying this for in-depth cleaning of, say, a staircase? Get it. Basically, think really hard about whether you want something cordless or with a cord. That's what it comes down to. Personally, I think these small hand-held vacuums should all be cordless - I have a full size vacuum for true cleaning."
    ]
}