{
    "entity": "Sledgehammers",
    "text": [
        "I bought this to go with my new forge. You can literally see my elbow starting to blow out in the video I shot of my first use of this hammer. Six weeks later, I can pound metal again, but I still have to baby my right arm. My experiments with hammers have proven that hickory is the way to go, and the \"anti-vibe\" aspect of this Stanley means it isn't quite as bad as a normal all-metal hammer. All-metal hammers are pretty much evil for blacksmith work. Save your elbow, buy something with a hickory handle!",
        "Not too long. Handle does a really good job of taking all the vibration out of striking stone. Flip it over and I use it to slide the pieces of flagstone into place that I've trimmed to my liking with my grinder and diamond blade. Better than smashing your fingers. I was going to buy another wooden handled one and very glad I didn't. This hammer will probably out last me.",
        "Great hammer, I have used it a ton. The finish is gone off the face and is coming off of the head in other places, but it's been striking red hot iron over and over. I've been told that a blacksmith makes a new hammer as soon as his skills allow, but we will see because I like this one quite a bit. Plus the antivibe is supposed to help you to not destroy your elbow.",
        "I used this for a bathroom remodel and it worked great. Cracked and shattered tile with ease. well balanced and a great addition to your tool collection.",
        "overview: -Ideal for striking unhardened metals A quick review for the FatMax 2 lbs. AntiVibe Blacksmith Hammer: Overall I am pleased with the hammer. -AntiVibe technology minimizes vibration and shock at impact -Exclusive rim temper reduces incidences of chipping or spalling -Forged, 1-piece steel construction for strength and durability -Slip-resistant handle for a secure grip and comfort -Precision balanced Pros: Durable, Sturdy, Light Weight Cons: handle is a little thin. I would recommend to anyone who does light black smithing.",
        "This isn't a bad hammer, but the add is wrong. The add shows a TRUE Stanley Antivibe with the tuning fork in the handle. This is an ordinary Stanley with a fiberglass handle and a rubber collar. A totally different tool and a different level of user protection. Get your act together Amazon! Sell correct products!",
        "Love it. I do all kinds of masonry work. I can break any paver, old concrete, use it for chiseling old concrete as well. Works as a high end hammer. Update: I have been using this for over a year. It's my go to masonry hammer with a myriad of uses. I love it for gardening. Rips the heck out of crab grass right down to the 6\" roots. Can't say enough about this masonry hammer.",
        "I have stanley antivibe hammer. Excellent hammer. I assume this is just as good a masons hammer. Tool looks good. Haven't used yet. I wish the handle was 3-4\" longer so my knuckles are bit further away.",
        "Not to sure about the \"AntiVibe\" properties of this hammer but it is a good medium weight hand held sledge. I use it in the basement along with a solid steel hatchet to re-split logs that aren't quite small enough to fit in the wood stove.",
        "This is a great tool. I was skeptical when I ordered it. I mean how much can you really do to reduce the shock transmitted through a blacksmith's hammer!? The answer is ... quite a bit! There were no problems in tapping out some small pieces of metal. What really sold me on the difference came when I tried flattening some hardened steel rods. It was a very pleasant change. Give it a try!",
        "This is a great product. It has a comfortable grip which makes it easy to hold. The weight - 20lbs (?) reduces the number of swings at the nail. One or two strokes would put your nail flush or just below the material surface. The addition of the blade means that you don't have to search for a utility knife. Its a beautifully made tool. I'm glade I purchased one. It will be on all my roofing jobs.",
        "Solid brick hammer.. good feel, decent durability.. 18oz is a good weight for everyday mason. More skilled mason consider a 16oz",
        "My right hand loves the hammer/hatchet/pry-bar. So far, I've used it as a hammer and a pry-bar, following the example given by Jeff Thorman of Ottawa Design and Build Renovations over on YouTube, specifically his \"How to Remove Bathtub Tile Surround Easily\" video. It feels good in my hand and has already proven itself useful.",
        "Good hammer. Laid about 300ish sgft of natural Stone with this. Anti vibration handle helped reduce fatigue.",
        "This hammer is awesome. Nothing more to say. I have been doing masonry for about 15 years and have always used estwing hammers, but I decided to try this out. Great feel in your hands, great anti vibe system. A hammer will always dull. Whether it's the first strike of a stone or it's 100th strike. It's going to happen. And eventually you are going to need to sharpen. Top notch though. Will be buying many more for my crew!!",
        "All purpose tool to install drywall. Hammer for nails,small groove to remove bent or old nails, and a decent blade to cut spaces for outlets. I wish the blade was a little sharper, but otherwise I am satisfied. The blade end also has a small black cover that can be placed over the blade end which is a nice safety feature.",
        "I bought this for chipping rock and the edge is duller than I expected. Otherwise, nicely made.",
        "Exactly what I needed it works well and the antivibe technology works well",
        "It's a nice hammer. Just as pictured. It was a little bigger than I was expecting. Very good for chipping.",
        "I haven't used this hammer very much, but it appears to be excellent, the face is ground correctly & it appears to be very hard. I haven't put it to the test yet, but I can tell it's not going to dent easily. They appear to be excellent quality.",
        "Very nice paleo hammer. Great size, well balanced, comfortable to use.",
        "Nice looking tool... I am pretty sure my buddy will like this for Father's day gift... What a bargain...",
        "Bought these to take on a building trip to Brazil-we always leave the tools on site. The local masons will love them.",
        "East to control, doesn't vibrate much, handle is comfortable, and holds up really well shaping and drawing out all kinds of steel! Very satisfied",
        "Great for blacksmith work but has some quick fixes you'll need to do: It has a thick poly coating all over it to keep the rust off during shipping / storage but the moment you start working hot metal with it you'll get a face full of nasty fumes. The easiest remedy it to just grind the head down because... The face has some weird angles going on in the corners so you'll need to bust those down if you don't want to mar your work. Once you spend 5 minutes grinding off the grossness and smoothing out your edges, you've got a great hammer! My elbow also loves the anti-vibe.",
        "Use this everyday at work, great hatchet, multiple uses, highly recommended for drywall hangers.",
        "Great value on a great daily - general use hammer. Easier on my arm than same weight in wooden handle.",
        "Great hammer works great esspecially with the grip on the head",
        "Overall, I am pleased with this hammer, but I have to choke up on the hammer to be accurate. In my opinion, the handle should be a couple inches shorter for a 4 pound hammer. But, I don't think it could be broken. If you don;t mind choking up this is a good hammer. I mainly use it to drive metal forming stakes.",
        "I've never reviewed a hammer before. Just use them to pound things. (We all enjoy doing that!) I must say, though, that this Stanley FatMax AntiVibe Engineering hammer is a winner. It's very likely the highest quality hammer I've ever owned. (And I have owned/do own a bunch.) First class all the way and a great feel to it. Perfect weight for tough jobs.",
        "Took 2 of these hammers on my trip to Herkimer New York mining for quartz crystals. They held up very well but I think were a bit too light for cracking into these hard rocks. I am going to use them for some concrete work this month and I foresee it going very well with these hammers at my side!",
        "This Hammer looks like a beast. Feels great in the hand.",
        "HAMMER TIME! HULK SMASH! HARBINGER OF DOOOOOOOM! I like hammers, probably as much as Jeremy Clarkson, except I know when to use them and when not to use them. This one is heavy, comfortable in the hand, and I suppose it dampens \"vibes\", as advertised.",
        "I work in a welding shop ive used it several times banging on steel now and i can see markings and indents all over the head of hammer like its not as hard as it should be i used the wood handle craftsman hammers the past 8yrs it never happened with them",
        "Great hammer, The handle doesn't hurt your hand after beating on metal.",
        "Not much to say but yet another great Stanley product. Works well and was a great price online!",
        "Great value at $17. A little smaller than an Estwing, but didn't bother me.",
        "Now I can hammer in the morning and the evening.",
        "It may not have the class or style of a more traditional blacksmith’s hammer; but with the weight and anti-vibration handle I’ve successfully forge weld steel and created my first billets of “Damascus.”",
        "Haven't chipped a lot of rock with this, but it plows through red clay soil like a breeze. Also a good weight for cutting bricks with a chisel. Hard to estimate impact ratings, but after using it off and on for several weeks, it seems to cause less stress on my wrists. Glad I bought it.",
        "Great forging hammer. The comfortable handle takes the shock away",
        "Had to do some file work on the striking face.",
        "Just ordered it to have it and i want to find something to hit with it.",
        "I sold my new air roofing at a garage sale, never to do a roof again. Then I built a barn with 2 square roof, I bought this hammer for the job and it was great. I have weak wrists and avoid hammering, it was no problem with this hammer it worked great.",
        "This is A Great roofing Hammer By Stanley I use it all day long and my hand and wrist are not hurting me like it dose with other roofing hammers good over all tool can't go wrong and it's made by Stanley that SASE it all!!",
        "Love this hammer. I use it for auto work. Does the trick for hubs and rotors..... 💯",
        "Good weight, does what you need it to do! Anti-vibe is worth it!!! All my hammers are Stanley Anti-vibe.",
        "I researched brick hammers for an upcoming project and this was the best price for the item I could find online. Love my prime membership's two day shipping too.",
        "good hammer like the weight and materials. the hatchet get beat up pretty ez so prepare to grind it sharp after heavy use.",
        "Purchased this hammer for my husband. He has been a bricklayer for 15 yrs and says this is the best brick hammer he has used. Sturdy, strong and no vibrations.",
        "Oh hell ya! If you want a modern striking tool this is the way to go.",
        "I use it every day. I've had it for 2 years. Still holding up",
        "My 14 year old son is learning to blacksmith. This is good quality.",
        "Shipped fast. Works great for the reason I bought it. We Could purchase again.",
        "HEY LOOK ITS A STANLEY AWESOME TOOLS FROM THEM BOYS AND GIRLS THIS AINT NO LESS!",
        "This is the ideal hammer for the field geologist studying sedimentary geology. The chisel end is very nice for getting betwen sedimentary layers and prying open fractures in the rock. I would highly recommend.",
        "Good solid hammer the fit and finish is a little rough for what I would expect from Stanleyy, but they do work great!",
        "I just started blacksmith school and got this hammer to use in this endeavor. I found the hammer to be comfortable in my hand, not too heavy to swing for the two hour forging session, and seemingly well balanced. I know I will end up with a lot of hammers to do my smith work, but I plan on using this one for many years of smithing. Work hard and prosper, Badluck Bob.",
        "Awesome for hammering large metal tent stakes into the ground. Everybody that borrowed it said they loved it and it got nicknamed Thor's Hammer.",
        "Great hammer. People at work ask to barrow it all the time! Just worried I won't get it back one of these days!",
        "A solid piece of tool I abuse for digging through mud, soil, and rocks...no problem.",
        "Using for roofing. The other guys using eastwings liked this hammer better.",
        "Had to put in a bunch of flowerbeds using stone... the hammer is very effectives for chipping corners. I also use the hammer to break rocks. Very effective.",
        "This hammer is the same kind like you get from the MAC truck",
        "The hammer works great and not as heavy as I suspected",
        "It’s an exact replacement for the one I lost couldn’t live without it",
        "High quality Stanley hammer/chisel for rock hunting and masonry work. This is a good value/quality purchase for the money and should last a lifetime.",
        "Exactly what we needed so our team stops breaking the handles.",
        "last one last me 7 years or so. great axe",
        "I bought this along with a Stanley 16-334 2-3/4-Inch X 8-1/2-Inch FatMax Masons Chisel with Bi-Material Hand Guard to build a stone retaining wall. Together they saved my wrist- even striking a chisel into stone there wasn't any noticeable recoil. That alone makes the hammer worth it to me. Additionally the reverse end is great for cutting through roots if you have to dig a hole. The hammer is well balanced with a comfortable grip, but the lack of recoil is it's best selling point.",
        "Great hammer! You can really swing this thing. You also do not need to worry about breaking the handle.",
        "My son loves this hammer. Only thing: It's HEAVY! It was well packaged. I love the quality and workmanship of Stanley products.",
        "I love this hammer. A great little tool, and very strong.",
        "Need to beat the crap out of something? This is the tool for you.",
        "This Stanley AntiVibe brick hammer is a work of art, and it does the job well. It's a perfect combination of form and function.",
        "I originally bought this hammer for a structural geology field trip and it has so many scratches from chipping away at rocks but this hammer is powerful and reliable, and it's not too heavy or hard to wield, I would recommend it.",
        "good design, good quality, very good price. Significant improvement over my previous tools.",
        "Been eyeing these line of hammers for some time. Could always use a good hammer and the price on sale was good. When I got the hammer I was surprised on the lack of quality of the finish grinding on both faces. Not what I expect from Stanley or on previous hammers from Stanley some older than I am. Reworked the faces on the belt grinder. The Cross peen needed considerable grinding. When working metal it just doesn't hit or bounce as true as some of my other hammers. Considering the price not a bad entry hammer good for the tractor shed or shop, but not a favorite.",
        "The hammer does exactly what's claimed of it, vibration resistance, which in turn leads to longer work days / more productive work days.",
        "This is a great engineer's hammer. Pros: 1. All steel will last forever. 2. Nice rubber grip, and antivibe handle is very easy on the wrists. 3. Good weight for putting in stakes and hubs in stiff ground. Cons 1. Slightly heavier than a hammer with a fiber or wooden handle. 2. Every one on the job will want to \"borrow\" it. 3. Slightly pricey, but my wrists are worth it. It seems to take less strikes to put in stakes and hubs, and that tends to make my job go faster. That and the antivibe, to me makes this a must buy.",
        "The anti-vibration handle truly does mitigate impact. For this 50-something female that means I can work longer and accomplish more without undue fatigue or discomfort.",
        "Be careful reading these reviews. This is one of those that Amazon allows reviews for multiple items to be listed in the same place. I purchased the 3 pound engineering hammer quite a while back as a gift for my son when he got his Masters Degree in Mechanical Engineering. I know that this hammer is called an engineering hammer for other reasons but it served my purposes. It is frequently used around the home and farm. I have had multiple occasions to use it and the AntiVibe handle works very well compared to a Hickory handle.",
        "Great feeling hammer with a soft grip, good balance, and unique design to save your wrist and elbow from pain! It will not be used by me for bricklaying but rather to dig and chip at rock formations to hunt for crystals in the mountains of Arkansas or topaz and granite in the Hill Country of Texas. Price well below comparable hammers locally with plain wood handles. Just hated to see \"Made in China\" stamped on an American product.",
        "My son is getting into blacksmithing and he loves this!",
        "Nice quality hammer. I use it as a prospectors pick for rock hunting.",
        "Good well balanced hammer. I recommend stripping the finish off the head if you are using it for hot work.",
        "This is a good hammer heavier than most and comfortable too That's all I want to write but they make you write more",
        "This is the second of these hammers I have used and it is as good as they come for a reasonable price. I have been a mason for forty years and hammers are as individual as the people who use them. This one is good for almost any common application.The price is what attracted me, you will probably lose it long before you wear it out.",
        "Strong hammer, has a warning of the possibility of chipping but I doubt it. Flat front, shorter than expected.",
        "Working on a mason crew, this hammer has come in handy a lot. It has held up very well to beating rocks and concrete. I once hit something that must have been terribly solid, because I felt the tuning fork in the handle vibrate very fast almost like a cell phone vibrating. I believe that took a lot of any sting I might have felt if it weren't for that AntiVibe handle. Very well rounded hammer, looks good, performs well, and is worth the money. Good Investment.",
        "Comfortable in your hand, easy to strike with, doesn't kill your wrists.",
        "This hammer works great. It's easy to carry in backpack. The length is good, and is easy to use- has good swinging arc when cracking those really hard specimens.",
        "What can I say? The most primitive of tools reborn for the new millennium. Works like a charm. Tap, Tap or KaBoom! Vast improvement from the jaw bone in 2001 A Space Odyssey. Nicely finished, good value.",
        "I was quite impressed with the quality of this hammer for the money",
        "Doing bricks for 28 years this is a good hammer",
        "Awesome all good I love this hammer ten times better and the other the best hammer I ever had for drywall",
        "This item was exactly what I was looking for. Delivery came in on time and price is very reasonable.",
        "I recently obtained this hammer to replace one \"borrowed\" by one of my kids. It has a nice feel in the hand. The only reason I took away a star is the striking face is rotated 5 degrees or so from square. It was cast that way and got by quality control. I was surprised they sold it this way. It won't make any difference for my use, but it may for some folks.",
        "good hammer but I wish it were a little heavier good quality stanley tool",
        "Well made quality hammer. Description of 4# hammer was inaccurate as hammerhead was stamped 3#. Would have kept if hammerhead was 4 pounds."
    ]
}