{
    "entity": "SLR Camera Lenses",
    "text": [
        "I had chance compare this with Tamron and Sigma. This one is worth it's price! Just a friendly reminder: If you are using entry level camera, such as Sony A380 or under, this lens is too much. a $700+ lens such as Sigma or Tamron is fairly enough. If you are using high-end camera, especially a full-frame camera such as Sony A850 and up, this lens will show you the absolute advantage against all other lenses!",
        "Just bought it and I am very happy with this one, specially because you can take pictures or film with the new Sony video camera that let you change the lenses, even with very poor or low light. No more words need to be said.",
        "Phenomenal results I cosidered buying the zoom 70-200 with f2.8 or the 70-400 with f4-f5.6 Eventualy I bought the 70-200 with f2.8 wich is a piece of GREAT optics with unparalleled results AND the 2X convertor Most of the time I need the 70-200 and when I'm taking wildlife pictures I'm using the 2X - For me its a win-win",
        "This takes amazing pictures with the 2.8. Used this with the 2.0 TC on a tripod and it works great, money well spent.",
        "Fantastic lens for Sony Alpha a77M2. Need to practice with it, however you can get tack sharp images and great bokeh. Great for portraits!",
        "I bought this lense about a week ago. Got to do just a little experimental shooting with it, and quickly found that it intermittently caused a 2-4EV overexposure. When it worked correctly, it yield crystal clear, tack-sharp images. I arranged an exchange on Monday morning, and received its replacement via free overnight shipping on Tuesday afternoon! The replacement workds perfectly as expected. Amazing service. I paid the exact same price on Amazon as I would have buying direct from Sony, but there is no way Sony could (would) match that incredibly fast replacement. Kudos to Amazon",
        "Awsome lens, praying nothing ever happens to it. TACK TACK TACK SHARP images. when my Ziess (God of all lenses) 24-70 can't reach out there i slap this baby in place and i am in business. i get a lot of comments from photos with this lens. 2,000 bucks is nothing when you do this for a living. if your an ameture stick with the gungadins.",
        "I have it adapted to my Sony A7III. Able to eye auto focus all around the screen. Sharp wide open. No complaints. Update 03/07/19 Still working smoothly with my A7III. It's mated with the Sony A-Mount LA-EA3 adapter. I've added more photos to show. Most of these shots was between F/4-2.8. I've personally tried this lens and E-Mount 70-200GM F/2.8, the only difference is the GM is brighter rendering. AF is slightly faster but not that much in comparison.",
        "i'm a pro sony user for several years ( one of the few), i always work with that lens or the zeiss sony lens it's just amazing the quality you can get with it",
        "Between the build quality and the image quality this lens earns it's price tag. The SSM is amazing for it is both quiet and fast... I for one will never buy a lens without this feature from now on."
    ]
}