{
    "entity": "SLR Camera Lenses",
    "text": [
        "Oh well, can I give it 10 stars instead? This Lens has become my best and inseparable friend, since the day one, as far as taking portraits goes. It is a somewhat challenging lens, to take pictures.Due to its extreme shallow depth of field, one has to know exactly what he/she is doing under the risk of getting a blurry nose or part of the face. With that out of the way, I use to joke this lens is as fast as the Roadrunner and as sharp as a Ninja 's blade.On top of it, add the excellent price and voilá!!...you have the perfect lens.",
        "Game changer! I LOVE this lens! It's actually become my daily shooter for still and portrait. Since I have a Rebel and it's not a full frame camera, there's an adjustment phase when you first start shooting to fully understand the crop factor, etc. Once you get comfortable...the quality and composition of shots below 3.0 makes you fall in love with this lens...This 85 and a nifty fifty are a must for any avid novice looking to get more out of your shots.",
        "This is a fantastic lens it has a very exact and fast autofocus I would say the best in canons whole line up. It takes stellar pics with great bokeh. I wouldn't hesitate. I had this lens then sold it to get the 1.2 and regretted it the 1.2 is a beast produces nice soft pics with the best bokeh , but it wasn't for me after couple years I sold it . The 1.2 was very slow to focus and a lot of times at 1.2 I would come home to upload the pics and it missed focus. I'm buying this 1.8 again !",
        "What a great lens! It's more than i expected. Scary sharpness on my EOS 6D. Highly recommended!",
        "This lens was the next step up from my 50 mm 1.8. I am new into photography and want good lenses to learn with. This lens is perfect for my light and airy style. It is very sharp, shaper than my 50 mm (in my opinion) I can’t wait to continue using it! I recommend this lens to anyone trying to become more familiar with photography. It is great for portraits!",
        "Just received this afternoon. Took a few pics outdoors. VERY sharp. Can enlarge many, many times before seeing any loss of sharpness. Second test was after dark, comparing it to the standard 18-55mm zoom that comes in most kits. Shutter speed about 4 times faster under same lighting, as it should be since f1.8 is 3 1/2 stops bigger than the f5.6 of the zoom at full extension. The camera worked hard to auto-focus because it was so dark but it made a good comparison test. More tomorrow. Noticed it's REALLY heavy compared to the zoom. Yeah, big glass weighs more. That's why it's a superior lens. I'm pleased. Worth the price.",
        "This is one of the best non-L Canon lenses for portraits in my opinion. I get the same silky smooth bokeh as my 50mm 1.4 with greater sharpness and virtually no distortion. On a crop sensor you do need to move back a little farther than the 50mm but once you get your subject framed, well the pictures speak for themselves. I really wish the body was weather sealed like the L glass but I know that would only make it more expensive. All in all I love this lense.",
        "This is one the best values in a Canon lens...period! It’s one of the best portrait lenses out there and if you don’t believe me, go on some of the photo web sites (like Flickr) and see how often it’s used. I use it with an adapter on my EOS RP and while I wouldn’t put it up against the RF 85 1.2, I’d put it up against any EF L series lens and image quality is as good as any of them. For the money, it’s one of the best lenses out there, especially for portraits.",
        "This is a well done lenses which will fit for someone who is not a beginner. Probably, the best use would be on a Full Frame Camera because of the zoom. You will get sharp photos in low light locations.",
        "My go to lens for portrait work....sure you can spend tons more for the L glass version....I’ve found though I can get what I need in post to make the difference very minor in most cases. Most times L glass is a clear winner but this prime lens is a real workhorse that won’t disappoint....a little noisy, not fast enough? I’m usually playing music in studio...weddings I’ve never had a complaint and there is so much other noise....people quit reaching for reasons to hate...and go buy another lens and some filters for this one instead of its L glass brother...that’s very pricey. Enjoy what this does so well and create photography.",
        "Love the lens - I already own a 70-200 2.8 which does a good job but this 85mm is just way different. The focal length is awesome on people and models and the 1.8 aperture makes it bokalicious. Even if you have the 70-200 I would still recommend buying it. If you cant afford a 70-200 I would recommend this as alternative option for sure because you will see results fast. Even though this lens is awesome and is super sharp the only problem it has which can be fixed is the purple fringing when there is lots of contrast between dark and light. Other than that its a perfect lens.",
        "The BEST purchase I've ever made by far in my photography career! This lens makes even an amateur look professional! And I'm just that! I love photography and although I have an eye for it and have been taking pictures for several years, I'm by no means a professional....but even I can use this lens and make average pictures come out looking breathtaking! It's all in the lens! High quality. Heavy and heavy-duty! You won't be disappointed.",
        "I was a bit apprehensive in this purchase because of lack of a warranty, for me it was a lot of money , maybe not for everyone. I have been in photography with film for over fifteen years and finally got into digital . I use a Canon 5Ds . This lens has done nothin but give me chills in the way it reproduces color and transparency not to mention sharpness. This is just one photo that I was practicing with to get a feel of how it does. Well, you know. A picture is worth a thousand words.",
        "Where do I start? I purchased this because of the extensive good reviews and I needed a good portrait lens that would produce high quality images. This lens has very terrible chromatic aberration or “color fringing.” It also takes a long time to focus and I missed some really good shots due to this. My 50mm 1.8 that cost me $100 takes better photos than this. I am outside of my return window and now I am stuck with an almost unusable lens. Save your money and purchase something else.",
        "This has become one of my favorite lenses. The design may be old, but it still holds up to many of the current lenses of today. Focusing is fast and images are sharp. On a crop sensor it's field of view is still within the preferred portrait focal lengths, and when used outdoors it is easy to get the distance between you and your subject that you need. Indoors it's a little harder unless you are in a larger room. It's a useful focal length on both full frame and crop, but if you like head and shoulder portraits and shallow depth of field, I can't recommend this lens enough. It's such a good value for what it is.",
        "Excellent 85mm lens for amateur or semi-professional. Don't always shoot on full automatic and you will appreciate Canon's 85mm f/1.8 (portrait) lens even more.",
        "Truthfully , it just TOO close up . Bring a fixed lens , it was impossible to get portraits done . I like to be right up close and personal to my subjects . The frame was too tight . The bokeh was DELICIOUS however . Incredibly milky . It can definitely work for those not shooting close subjects",
        "Canon's EF 85mm lens is a almost everyday must have lens. I have used it it for shooting my granddaughters VB games. Works quite well under gym lights. I am a hobbyest and I don't know a lot about lenses but I was told by a friend to buy it. Glad I did. The lens is used on my Canon 80D.",
        "I absolutely love this lens. It was everything my camera bag never knew it was missing! Although I was a bit frustrated that I ordered one lens and was somehow charged for two, one charge on two different credit cards. So now I have two lenses... just not exactly sure how something like that happens?",
        "A very nice portrait lens. Its kind of like the poor mans 135 f2. It does best in good light. You can get your subject pretty sharp and have a nice soft background. In darker scenes it is not as friendly, focus may be not as sharp etc. All in all its a great lens for the money. I would recommend it for portraits and close ups, flowers, wildlife etc. I use this lens with a Canon m6 believe ir or not, and have gotten great results.",
        "After seeing the reviews I purchased this lens for my Canon 80D. I am pleased with the results. Autofocus & Image Stabilization are really good, especially for a lens that has been around for a while...and the image quality is outstanding. This lens...and it's 50mm peer from Canon...are the two best lenses...for the money, that I have purchased.",
        "I'm very happy with this lens and found it to be a great value. The IQ of this prime lens is pretty good when wide open and as you step down to f2.8 and beyond is very sharp. Color contrast and saturation meet or exceed all my expectations. Focus is fast and true (and quiet). If you're looking for a good prime portrait lens, especially on a budget, I think you will be quite pleased with the EF 85mm f1.8.",
        "Everyone knows this is a great portrait lens but this is also a great lens for quick action. I was seriously shocked by the focus speed. I was out on the street taking some shots of something across the street when I cyclist rolled through the frame at close range and came out in razor sharp focus in a split second. Simply amazing!",
        "This has to be my favorite portrait lens. My bridal portraits in natural light look stunning. Not one single issue with it. I used the F 1.2 version of the same lens (85mm) which costs x4 more. I simply do not se a difference in image and if there's one, it's so subtle, the price isn't worth it. I don't remember the last time I used my 50mm at f1.2 . The DOF is just too narrow. Great glass. A must have for every professional (or serious) photographer.",
        "This lens punches way above its weight. Autofocus is fast and accurate. It produces beautiful sharp images. I like using it for street photography as the subjects do not realize you are photographing them given that you can keep your distance, unlike a 35mm or even a 50mm lens.",
        "This lens is truly amazing for the money. I have more expensive lenses that do not get nearly as sharp an image as this. Portraits look great but it can also be great for other things as well. The narrow aperture can take some getting used to but once you go on a photo shoot only using the lens, you will learn to master it pretty quickly and be able to get your desired result. My only real complaint is occasionally it has some annoying chromatic aberration but otherwise this is an amazing deal for the price and comes highly recommended.",
        "I normally shoot with my 24-70 but had been wanting to give primes a shot...so far I’m LOVING the images and bokeh produced with this lens. I feel like the autofocus could be a bit faster, but that could also be my 6D in low light. This was definitely my best prime deal purchase so far!",
        "I was surprised at how sharp my photos are with a lens that is reasonably affordable. Great work, Canon! (pro photographer...so I am picky)",
        "Love this lens. This rapidly has become my go-to lens for low light captures of people in action. While it lacks image stabilization, the speed is sufficient to do some really nice depth of field effects. 85mm is perfect for clarity and generally a good telephoto for capturing people that aren't right next to you. I'm sure there are better lenses available, but I doubt you'll find a better portrait lens at this price point.",
        "You can't beat this lens, particularly at around $400. The images are so nice and the bokeh is smooth. I always wanted to hold out for the 85mm 1.2L, but after purchasing this lens there is no way paying 5x for the 1.2L is worth it. I've rented the 1.2L and it is amazing but unless you are always going to shoot at f1.2, then there is no need to spend that much for the L lens. I will use this lens as my portrait lens primarily, but may also use it for my daughters indoor volleyball games.",
        "The first few times I started using it the camera would throw an error but after 4 or 5 times cleaning the contacts and reattaching it the problem stopped and it is working well now. Quick focus and used for my first portrait session. On the crop sensor sometimes the focal length is a bit long (had to switch to 50mm 1.8 where I couldn't back up). Overall great addition to my collection of \"reasonably priced\" lenses.",
        "I just got it and am putting it through its paces, but so far I am liking the sharpness. It was my next fixed lens on my list that I wanted to buy, and I hope to get a lot of use from it. I will update with more experimentation. .",
        "This lens was causing an Error 01 on my 90D. I had to return this because after taking one picture it would want me to clean the contacts over and over. This was the only lens giving these error code. It takes great pictures, but my specific one was giving me way too many problems for what I paid for it.",
        "Excellent lens for the price. Well built I even accidentally dropped it from about 2 feet. It rolled off a chair. No damage whatsoever. Typical good Canon product. Good for any situation where you wish to blur the background.",
        "First fixed lens that I have purchased - as I tend toward zoom lenses. However, this is a great lens with a f1.8 aperture allowing for some great bokeh shots and is an excellent portrait shot. Considered a 50 mm f1.8 but decided to go with the 85 mm to allow some distance between me and the person I am taking a portrait of. So far love this lens and look forward to working with it to create some great photos.",
        "By far my most favorite glass I’ve ever purchased. I would have to say with my experiences it is easily the number 1 portrait lens. This lens is well put together and feels like it. Nothing cheap about it at all. I mean who doesn’t love canon products? Amazing quality, amazing photos, and amazing bokeh.",
        "- relatively cheap lens considering its image quality - buttery smooth background bokeh - love using this for portrait shots and outdoor group photos - quick focusing by the USM - wish it came with a hood",
        "85mm at f/1.8 is a must have for any type of photography. I mainly take landscape photos so most of my lenses are wide. 85mm comes in handy on vacations or just around the neighborhood when you want more of a dramatic shot without being too wide.",
        "After many weeks of researching and testing my friends Rokinon 85mm 1.4L manual. I feel in love with the Bokeh look. I didn’t like the fact is was manual, and I couldn’t afford the Canon Red strip one (1.2). I found this one and watched YouTube. Had nothing but great reviews. I’ve attached some images that were lightly edited. Pics are amazing. The auto Focus works well when needed",
        "This is an excellent inexpensive fast F/1.8 low light lens which provide very good Bokeh background, it is light weigh, fast, accurate focus, easy manual focus, one best thing I like is the front lens never move in/move out when focusing, it is small and easy to use and very high performance lens. This lens is made in Japan, good quality control.",
        "Create beautiful Bokeh! It is a little on the heavier side, but worth carrying around to get the perfect shot! Usually I prefer L-series lens, but they come with a hefty price. This lens here still creates beautiful photos and is affordable. Highly recommend this lens to anybody who is in the market for a prime lens.",
        "This lens is my go to for portraits hands down. It's super sharp especially after f4. The auto focus is fast,accurate and fairly silent. The bokeh this lens produces is smooth and very nice. It's the best budget portrait lens for Canon in my opinion.",
        "Fast wonderful lens. I needed something less expensive for my kit, as I had no prime lens for street or portrait photography (I traded what I had for a wide angle landscape lens) This is a sweet lens, and such a bargain!",
        "I use this lens for pretty much everything. Even in situations I shouldn't. I just can't reach for my other lenses. It is a lens every beginner photographer should have. It won't break your budget but you will love the pictures it takes!",
        "This lense is amazing, the autofocus is silent and fast, much quicker than the 50 f/1.8. This lense is much less expensive than I would expect.",
        "BUILD QUALITY: Let’s first talk about the build quality of this new lens. The 50 STM has had a massive upgrade in this area, and feels absolutely fantastic.",
        "I've used this lens for three portrait jobs in the last three weeks and I am ecstatic about the image quality. Not only are images sharp at f/2.8 or f/3.2, but the quality of the background at these f-stops is phenomenal. This and the Canon 50mm f/1.8 are my go-to lenses. If I only had to pick two lenses, these would be it.",
        "This is hands down my favorite portrait lens, sure it's not the L but it cost way less cash and is a great step up over the base lens. If your on the fence and have the money get the L it's the best of the best. But if you're on a budget and you still want a great lens for portraits you can't go wrong with this lens, the clarity is top shelf and the quality is great. I have tested both and found the L produces a slightly better photo but cost a whole lot more money.",
        "This lens takes beautiful pictures! I’m an amateur photographer. I am a seamstress and wanted to get great pictures of the clothes I sew to post online. This lens helped me accomplish that. The pictures are just beautiful. I can’t say it enough. The bokeh in the background adds a professional look and feel that I wasn’t able to capture with my other lenses. I didn’t want to pay a lot of money as I was learning so I’m sure there are more costly options but for the money I paid this is perfect!!",
        "This lens is perfect for taking portraits and is very fast f-1.8, so it works well in low light situations as well. (Much better than the zoom lenses with 3.5-5.6 apertures) The lens produces very sharp images and separates (blurs) background perfectly. We use this on a Canon T2i, Canon SL1 and with a Canon Mount adapter (EF-EOS-M) on an EOS-M, where the smaller camera sensor makes an image equivalent to a 136mm lens on a 35mm format or full sensor camera. This is my favorite lens for taking photos of the family. Highly recommend without reservation.",
        "Loving the lens! It is great for a low budget, takes lovely photos and doesn't feel like plastic and feels well put together. I've only used it for a few sessions but so far I'm loving it!",
        "This is an excellent, inexpensive, Canon lens providing clean, crisp edged photo results with great, inherent, bokeh. Especially considering it's light weight this lens is a definite asset, replacing by 70-200mm Canon lens for most projects.",
        "I love this lens I just wish I had FF camera, on my crop sensor is around 132mm and works lovely for closeup shots, the depth of field this lens gives is so creamy and I just love it. Good for small product photography on a crop-sensor. But is not all around lens on a crop-sensor you use it only in very specific situations I recommend this one more for Full Frame users or crop-sensor users who knows will move to FF in the future.",
        "Incredibly sharp lens, amazing bokeh, nothing much to add to the superlatives so many have already provided. I am using on a full-frame Canon 6D and the sliver of focus on facial portraits with blown out backgrounds is \"as advertised\" when wide-open at f/1.8. Very sharp images when closed down a bit to f/4-f/8. A recent group portrait of four people clearly shows all the details on a wristwatch watch-face, for example. And at the price range its in, the best prime lens I've used.",
        "What a stunning lens. I get the most beautiful portraits with this. The bokeh is incredible with this lens. Highly recommended.",
        "I LOVE this lens! I rented the Canon EF ‐ 85mm ‐ F/1.2 and was IN LOVE with it, but couldn't justify spending so much for the lens, I got this one instead after reading a lot of reviews (for months.) It is perfect!",
        "I am a landscape photographer and I do some portraits, however this lens has worked for both! I love the 1.8 depth and the 85 Prime allows me to move and get creative without relying on a zoom lens.",
        "Not in love with it but it’s not bad either. BE WARNED this is not meant for the USA. When I got mine and tried to register it on Canon’s website it said that it was not meant for sale in the US so they will not service it. I wish I had known this when purchasing. I would have never bought it. By the time I went to register with canon it was out of the return window.",
        "this lens is everything i thought it would be and more. currently i have the 17-55mm, which is usually my go to lens but after buying the 85mm, i dont think it has came off my camera body. I have a canon 70D and find that even with the crop sensor, it is perfect. i absolutely recommend this lens to anyone who likes extreme bokeh, high image quality, candids and portraits. The 85mm replaced the canon 50mm 1.8; which next to the 85mm, just sucks. It is worth the extra couple hundred to purchase the 85mm.",
        "I wish I had known about this lens sooner. The 85mm is now my go-to lens, and I recommend it to all of my friends and colleagues. If you're not sure about lens focal lengths, or don't know much about them, here's a link with examples of different focal lengths and their affect on the face:",
        "Build quality is excellent. The lens feels great when shooting. The F1.8 is super fast. This lens produces good background blur and bokeh. Shooting great primes like this one makes you realize how many compromises go into even great zoom lenses. This lens just gives the photos a distinct look, with crisp details and great bokeh. It might not get used constantly, but when it is needed for closeup family shots, sports, or action oriented photos, it is a great lens to have.",
        "I was so excited to get this lens, wasn’t able to shoot it but once before moving and after moving missed my return window. The AF is hit or miss, realistically more miss than hit. I’ll have to see if it’s something canon can fix.",
        "I purchased this to improve my portrait photography and I am very pleased with the results in my first shoot. The people were sharp and the bokeh the background was beautiful! Very pleased with this purchase!",
        "Awesome portrait lens! I have focused mostly on landscape photography, but wanted to try my hand at some portraits. This is the perfect beginner lens to get. It takes beautiful portraits even in low light conditions thanks to an aperture of 1.8, and gives a wonderful blur to the background. I would highly recommend this lens for anyone from amateurs to professionals.",
        "I am so happy I finally decided to purchase this lens. I love my 50mm but have been wanting to try this 85mm for a while now. I am using it on a 6D and am finding it is very easy to focus and with a few exceptions (my errors) my photos have been incredibly sharp. For the price you really can’t go wrong. I recently used it for some street photography and it was amazing. Next I’ll be trying it for family portraits.",
        "Many people are deciding between this lens and the 50mm 1.4 lens. If you like bokeh and portrait, I would highly recommend this lens. It is as sharp if not better than 50mm 1.4. But it definitely has better bokeh. Many people get zoom lens like me when they start shooting. Eventually, we will figure out 85mm f/1.8 prime lens is a mush-have because you will notice the huge difference in terms of both sharpness and bokeh.",
        "Great lens for macro and portrait work. Sharp foreground focus with an amazing and soft bokeh. I do a lot of nature photography, and in the spring am constantly taking pics of flowers. This lens is perfect for that kind of work. It produces a dreamy background that emphasizes whatever subject I am shooting. I also own the EF 50mm f/1.4, but of the two I prefer this lens.",
        "My favorite lens, next to my 50 mm canon lens. Much lighter and less cumbersome than carrying around a zoom, and probably clearer too. Most of the time, walking closer or further away compensates beautifully for not having a zoom lens.",
        "This lens has been a joy!, although it does not have Image Stabilizer it focuses great! I bought it new and directly from Amazon, and it works amazingly! For the price, it’s a GREAT buy!",
        "This is a high quality lens, especially for the price. If you do weddings or portraits, this one is an absolute must have!! Crystal clear, crisp photos every time!",
        "There are lots of rave reviews about this lens already, but just wanted to add that my 2 cents. EF 85mm f/1.8 USM is extremely sharp & value for your money, this is the best portrait lens on the market. If you've been waiting to get this lens, don't wait any longer. Just pull the trigger & get it. You will be glad you did. Highly recommended & deserves 5 stars in my book.",
        "My best non-L canon lens I own...and compares in sharpness to my Canon 70-200mm f/2.8L IS II. I was amazed at how sharp this lens is at 1.8 and is razor sharp at anything above 2.0. I was looking into the 85mm 1.2 but read how slow it focuses. I 2nd shoot at weddings and I shoot more journalistic style so I am capturing the action as it's happening so fast focus for me is critical. For $350, this lens is practically a steal! This lens focuses fast, has beautiful creamy bokeh and produces incredible sharp pictures everytime...unlike Canon 50mm 1.4. Don't wait...buy this lens!",
        "This lens does not have image stabilization, however with a f1.8 aperture you don’t need it most of the time. It’s sharp all the way to 1.8, it produces a great soft in the edges effect that’s beautiful for taking portraits.",
        "I’m actually really mad at myself for not getting this sooner. I love it and can’t wait to use it more. So far I’ve taken pictures of my dog 😂",
        "A wonderful lens. Light, compact, with a fast f-stop allowing shooting in low light that would be impossible with a 'kit' lens. Ideal as a portrait lens. Image quality on par with some of Canon's best 'L' lenses, but without the 'L' price. If you're on the fence, just get it. You won't be disappointed.",
        "My three kids play a lot of indoor sports in the winter. Primarily basketball and soccer. This camera lens with the large aperture allows very fast shots in poor lighting conditions, with ISO set around 800. I use the (Rebel) camera in full manual mode, set custom white balance and the autofocus of the lens does the rest. No more out of focus basketballs being dribbled, or elongated soccer balls being kicked. This lens is the best value for the $$ if you want professional looking pics of fast moving indoor action at a reasonably near distance.",
        "This lens is great! I haven't used it much yet but I know I am going to enjoy it! The lens is well built, very sturdy and has a metal mount. First thing I did was protect it with the UV filter :-) I'm in the process of upgrading my camera and a couple of lenses moving from entry level. Many people commented on how beautifully photos of their children/grandchildren turned out with this. The image quality is very sharp and I look forward to taking many photos with this lens. Great deal with the software being included, too!",
        "Really pleased with how sharp my images are when using this portrait lens. I keep this in my gear bag when I’m out shooting photos, and find myself using it more often than I expected.",
        "the lens is fantastic! now that I had to sent it to canon to be repaired. right out of the box the lens wad defective. this was a brand new product and I had to send it to canon for repair. lucky it was under the one year warranty, now that canon fixed it the lens is working fine now. it also took the seller almost two weeks to get the product to me. the day after I ordered this product my credit card was charged and it took almost two weeks to get this product. I am not happy with this seller. I will not order from them again.",
        "This lens is fantastic. It's not labeled as \"L\", but sure gives sharp pictures. The bokeh is great too. One word of caution I would give would be to know why you are buying the lens. I bought it for portraits, and it's great for that. If you want to take pictures indoors, you need to remember it's a long lens (more so if you don't have a full-frame body). Also, if you're not used to apertures this big, you need to be prepared for the shallow depth of field - it's easy to get pictures where an object is in focus, but an adjacent object isn't, even though it's just barely further back or in front.",
        "I purchased the lens not knowing exactly what I needed to do portraits photos. The lens is great and makes a great addition to the camera bag. I will end up getting either a 35mm or 50mm so I can get a little closer for some shots but this lens is great at what it does. Great clear photos with killer Bokeh.",
        "This lens is extremely sharp and has nice bokeh. The USM is extremely fast and quiet. The color saturation is beautiful. The 1.8 aperature is extremely helpful in low light. The lens construction is solid. This is a little tight on a crop body like the 7D. You can take gorgeous portraits of head and shoulders from a reasonable distance but for a full body shot you have to step back considerably. Its the equivalent of 135mm on a full frame camera. As long as you realize this upon puchase you will not be disappointed with this lens.",
        "Amazing lens. The DOF on this is amazing. I wish there was image stabilization but nonetheless one of the best lenses I've ever used",
        "I have been a pro photographer for over a decade, why did it take me so long to buy this lens? It's amazingly sharp and contrasty and great for portraits and candids.",
        "Love, love, love this lens. Since it doesn't have IS I probably won't use it for video (unless on a tripod), but this lens is exactly what I wanted for portraits. Really fast focus too.",
        "For this price what a great lens! You don't really need anything else if people are your subject.",
        "More often than not - my \"go to lens\" Sharp, handles indoors and outs doors well. I have to sya this is the most favorite lens in my bag",
        "I've yet to test it on its original purpose of shooting low light indoor action shots however it did a wonderful job as I experimented with outdoor night sports. It was sharp enough that I could crop/enlarge professional baseball at a surprising distance under the lights. It also performed well shooting some well lit indoor media events but so do all the other Canon lenses I use...Nifty 50, 18-55 and 70-200 f/2.8 Sigma. Might I add that Canon shocked me by delivering the $50 rebate within 2 weeks!",
        "I bought this lens after I received my first gig as a wedding photographer. This thing is tack-sharp, locks focus quickly and quietly, and the bokeh is incredible! Highly recommended.",
        "ok, so its not the 1.2 mega L series... HOWEVER, its worth double the price and offers really great bokah and is super for portraits. I have several L series zooms and the images i get FEEL sharper (maybe just because of the depth of field). PS.. use a tripod or servo focus because if you move around at 1.8, you WILL be out of focus. If you are thinking of this, just get it. If you find it changes your life, start saving for the L series.",
        "I am using this lens on an EOS 7d and have gotten good results. Using the lens mostly for portraits, I have enjoyed very clear images with excellent color. The bokeh is nice and makes for a good background effect when doing outdoor portraits. This lens performs very well and my opinion is the price/performance is excellent.",
        "One of my favorite lenses. You get such beautiful blurred backgrounds and a razor sharp subject.. Although I have lenses that are much more, ok , a lot more expensive, this is one that I use a lot.",
        "What can I say? I love this lens. It’s fast, it’s sharp, and it’s crushing that sweet Bokeh! The lens isn’t heavy at all, compared to others I’ve used. The build quality is great and feels good in the hands. This and my 50mm prime are best friends, they go everywhere! I can get some great client work done quickly in aperture priority or manual, it’s a work horse. I’m using it with my Canon 5D MK II",
        "Finally got it after months of having it on my wish list and I love it! No regrets what so ever",
        "This lens gave me crisp photos - works great. Used it for portraits.",
        "I read that this lens was just as good as the L series counterpart. I do have to say the sharpness is nice! What I do not like about the lens is the focus is touchy, it drops out quick, but you can feel it happening. I would recommend a high shutter speed if your hand holding this lens.",
        "One of my all time favorite lenses, especially for portrait work. Fast, sharp optics deliver consistent and predicable results. No lens distortion nor chromatic aberration. The 85mm f/1.8 lens is a good or better than many of my Canon L-series professional lenses. One of the most valuable lenses in my line up and THE greatest value for the money. Buy it! You won't be disappointed.",
        "This lens has exceeded all expectations! Before you give in to your obsession with L-Series lenses, don't look past these impeccable prime lenses. You get a huge bang for your buck and near-perfect optical quality. Beyond all other features I love about this lens, the bokeh is the winner. I have yet to use a lens with better bokeh at any price level!",
        "Best lens purchase I've ever made! Love this lens, the photo's I've captured with it and the quality of the materials.",
        "I love, love, love this lens. Beautiful lens. Beautiful shots. I have a 50mm 1.4. I'm going to sell it and move up to the 1.2, and with this lens, I will have my portrait lens needs wrapped up. Great lens. I absolutely love the shots I am getting with this lens, it focucses fast and the DOF is great. I am enjoying learning what I can capture with it. Was recommended by JD, Jasmine Star's husband, and he was so right. It is hard not to just stick to it -- but oh, by 50mm is hard to not feel like I am cheating on with this baby."
    ]
}