{
    "entity": "SLR Camera Lenses",
    "text": [
        "What is there to say about this lens that hasn't been said before. It is a fantastic macro lens if you are a canon shooter. It can hunt for focus a bit at close range on non-contrasty subjects, but is very sharp and a fun lens to shoot with.",
        "For macro this is incredible, with a couple of caveats... No IS so handheld is near impossible for macro, and you really need to manual focus for macro as the autofocus just isn't accurate or hunts a bit too much. When you're in focus on a tripod though, the bokeh is \"unfreakinbelievable\"! (new word).",
        "The Canon 180mm Macro is excellent. It performs well and is a solidly built lens and the results are amazing. It is everything that I have read and performs as advertised. The benefit of this Macro is you can be 1/2 a meter from the subject - which keeps you from frightening any critters you are photographing and gives distance between the lens and subject without shadowing. In addition the people I purchased this lens from were excellent and the condition of the lens was everything they said. I have been pleasantly surprise with the whole purchase experience.",
        "This is a great lens. I've used it to capture pollen in tiny wildflowers! I would, however, recommend also getting a macro flash of some sort - f32 really limits your light. If you don't have a flash you either need a still subject and a tripod, or full sunlight.",
        "Extreme good quality and super sharp photos. Only three stars because its extremely heavy and almost unusable for handheld due to no image stabilization",
        "I had the Canon 100mm F2.8, traded up to the F2.8L and returned as well then and got this 180mm instead. The 100mm on full frame still meant I had to be so close to the subject be it flowers which meant often I was casting a shadow, or I was scarying away a bug. It is super sharp, just the focusing is slow, however for macro I only use manual focus anyway. It is also amazing at close up portraits for eye lashes, sharp hair strands, dimples, bokeh is great too. Most of the time I am at F8 and more closed anyway so F3.5 is no loss due to DOF at this range.",
        "Tack sharp lens, love this thing and I just started using it this weekend.",
        "This is a great lens, perfect picture every time, have to stand a bit back to get a good shot though, wonderful clairity where focused and great blur in background, adds real depth to the pictures - this is the only macro lens you will ever need!!",
        "This lens is worth every penny especially with Amazon,s price. Takes awesome close ups better then my Canon 100mm macro lens. I will hang on to my 100mm for now because that lens also takes some great pohtos. The Canon 180mm gets you closer to your subject.",
        "I bought this as my first macro lens. I love it. I was using a 250mm with extension and a Canon 500D filter to get close. This makes everything faster and easier and I can shoot from a distance.",
        "This is an amazing lens... I was questioning buying it but I needed the macro to get up on peoples faces. Its not the quickest focus mechanism but damn are the shots clear!",
        "I love this lens! I can get fairly good close up photos with this lens but the auto-focus is a bit on the slow side, so I carefully help it along.",
        "I love it. Sharp. Have the Canon 7D and with the crop factor this is like a 300 mm Macro.",
        "Having a hard time focusing on subject, the lens goes back and forth like crazy. Manual autofocus recommended. Wish it had stabilizer. Amazing quality photo. I can't be more happy with it. Recommended if you love macro photography!",
        "Solid, well made, Really good quality. Takes very good quality pictures. Need a good camera to go in pair with it.",
        "Très bonne qualité, rapport prix/$$$ excellent, je recommande ce produit.....!!!",
        "Arrived on time and packaged well. The lense has had little testing so far but seems to be living up to its legendary status.",
        "This was a gift and I'm certain they are loving it!",
        "in line with expectations and offered , arrived at the date indicated , and in excellent condition , very happy with the product.",
        "I am very happy with this lens and the whole shopping experience I had purchasing it.",
        "My transaction was quick and informative. I'm now more prone to make purchases through Amazon if not any other site.",
        "Hot dang! So crazy the difference in quality! I’m a dentist and use it for dental patients. I have to get like 10 feet away to get their whole face in the picture but they look amazing!",
        "I purchased this lens from my local dealer and am blown away with the IQ it produces. I am using it both as a macro and also as an outdoor portrait lens. The sharpness, saturation, color accuracy and contrast are matched only by the best optics I've ever seen. For the money, this lens is a bargain. Take a look at what other top notch glass costs.",
        "The best macro lens. Its macro lens but I use it for portraits specially kids pix are super with this lens. I used the extention tube/adapter and took Red Moon puctures on a cloudy night from my balcony and they came out great. When I bought I was using only for flower photography then started using it for portraits, love it. The only problem is its heavy and slow focusing. When Itake portraits I go far away to cover the person. I don't take full length with this any way only head shots",
        "I have taken some amazing photos using this lens. Since it is 180mm you don't need to be as close to the subject, which helps greatly with bugs. The only downside to the len is that it is extremely heavy.",
        "Good and sharp ... look up ArtofJCW to see more shots with this lens",
        "Regarding the suggestion that one instead get a 70-200 and extension tubes... yes, that would be more versatile than the macro alone, but I have a 70-200 and extension tubes, and they can't compare to the 180 macro.",
        "It is great--exactly what I expected from the Canon L series. I used it on a recent trip to the Missouri River (Lewis & Clark) area and was extremely pleased."
    ]
}