{
    "entity": "SLR Camera Lenses",
    "text": [
        "This is a very nice lens for those moving beyond the kit version. Super low light performance across all focal ranges coupled with image stabilization makes this great for indoor photos with no need for flash. The focal range covers wide angle to mid-range telephoto to make it a perfect all in one lens for walk-around purposes. AF is super fast and tack sharp. The only drawbacks re the cost and weight. Right now Amazon is offering this fabulous lens for $330 off; weight you will need to deal with, but it is not a bit issue for me given the many positives.",
        "By far the best lens I have ever purchased. I recently returned from Zimbabwe and \"needed\" a lens for most shooting situations. I didn't want to carry a bunch of different lenses. I bought a Tamron 70-200mm for zoom and thought this would be a good choice for wide angle and portrait. The photos turned out amazing. super sharp in all lighting situations. Even on a night safari drive with just a spot light, I got excellent photos.. Well worth the cost",
        "If your APS-C Canon came with a 18-55mm kit lens, this is and astronomical upgrade. PROS: -constent f2.8 throughout zoom range -faster auto-focusing -sharper images -solid build quality -1mm wider addition to zoom range NEGATIVES: -about twice the size of kit lens -about four times heavier than kit lens",
        "This is my primary lens that I use on my Canon 7D. Great depth of field with the 2.8 & like the range of 17-55mm for my shots. This lens is what I use in place of the included kit lens when I purchased my 7D. I have owned this lens for over 10 years with no problems.",
        "I used this lens for walking around on vacation in North Carolina. I was super happy with the functionality of the lens. The speed of focus is satisfactory, the sharpness is good and it is light to carry. I took some long exposure shots with the lens and it performed very well for the money. I'm happy with my purchase and would recommend the lens. Shipping was great and fast.",
        "It is physically large and heavy, but has a solid and well-built feel to it while handling and shooting. Lightroom has no problem automatically correcting any distortion, colors and bokeh are beautiful, ghosting and flaring are non-issues (and are beautiful when created on purpose). The 2.8 zoom is a no-brainer for any shooter's bag, and this APS-C only lens takes pictures that are indistinguishable from a 24-70 on a full frame body.",
        "Nothing much to say. It's a great piece of glass that didn't get the \"L\" ring because it's EF-S, not because it's image quality lacks. Makes low-light photos easy with stabilization.",
        "I liked this lens a lot, but sold it when I got the EOS R. Great piece of glass when I had it, though. And since it’s wide angle, it’s recommended for landscapes, but I used it several times for portraits and it worked fine. Granted, it’s not a prime, but does the job and with very good build quality.",
        "I've been looking for the perfect lens for shooting video. I needed something with a low aperture, has a wide focal length and has enough zoom when I need it. Sure I could have gone with many other choices but the one thing I really wanted to consider was something that has IS on it. That was the main purpose why I chose this specific lens. The image quality is amazing. It has become my everyday lens for both photo and video. Would definitely recommend to those who are looking for an all in one everyday/vacation/portrait situation lens.",
        "Well made lens and no complaints thus far. I'm going on vacation soon and plan to shoot the heck out of this lens. Only made a few test shots to check function and image quality and liked the outcome. Sharp, nice colors, focus is quick and accurate. The plan is to team this lens with a Canon 10-18 and will have all bases (focal lengths) covered for the upcoming jaunt.",
        "I use this on a crop sensor camera so it gives me a focal length of 24-70 range which is perfect for shooting events walking around or just as your general lens for common use. I used this for a party I done and it work pretty well however the canon m50 does not work with low light so I had to crank up my iso but overall the images were sharp and clean. I imagine a on a more expensive camera it would really perform even better. You get 24-70 focal length at almost half the prices so it’s worth it.",
        "This lens is nothing short of amazing! The focal range you have on it is so great for whatever you want to shoot. The fact that this is an f/2.8 zoom lens and is only $500 (used) is amazing. Do not buy it if you do not have a crop sensored camera, or a modifier that will allow you to use it. I use it with the Canon SL2 (D200) and it is a great combination. I use this lens for 70-80% of my work since I am working on a budget. Definitely worth the money!",
        "Absolutely LOVE this lens! Its quite big and heavy, but it totally makes up for the variety of photos you can take with this lens! Im a blogger and have been looking for an all around, but affordable, lens for a while. I use this one only now, as I used to switch between 2-3 other lenses before. I use it for portraits, detail shots, landscape shots, food shots, well everything actually and I love the wide angle that It gives!",
        "Major step up for the kit lenses. The weight, clarity, sharpness, everything is amazing for the price. Does go on sale from time to time, pick up when you can!",
        "This lense is AMAZING. The difference in quality between this and the stock Canon lense(s) is night and day. Even lighting across the field. Little distortion. Great in low light. This sucker is BIG and HEAVY, so be ready.",
        "I read online reviews and knew this model was famous for getting dust inside the lens but - wow - after three months I had to take the thing apart and clean it. I guess it'll be an every-three-month kind of thing.",
        "For portrait photographers who don't zoom much. This is a complete waste of money. The kit lens of my canon 70d shoots just as well photos as this. It is extremely heavy and impossible to walk around for 5 mins let alone all day with. 2.8 vs 3.5 is not a noticeable difference.",
        "Fast heavy lens for Canon crop cameras. The only issue is the cable connector in the lens for zooming in and out quit communicating with the camera at the long end so had to use only the wide end when it broke. It was worthwhile to get it fixed though.",
        "I bought this lens for video use about four years ago not knowing much about glass, but now that I'm more experienced I'm so glad this is the one i went with. The speed, image quality, weight, canon just cant be beat and this is a must have for the kit",
        "No sharp pictures. Loud autofocus. Quality is mediocre. Would not recommend. Not worth the money.",
        "This is by far the best lens thats not a L series lens. The pictures are phenomenal with that blurred background everyone aims for in a portrait picture. I use this to take all kinds of pictures, from my kids to landscape to action. The versatile to use in most occasions. I'm a amateur photographer so didn't want to spend so much on a L lens. This one fits the bill. Wish it was a bit cheaper in price thats why i didn't give it 5 stars.",
        "Received the product well before advertised. I've only had it a couple of days but from everything I can tell product is as advertised and works fine. Would buy again from this seller.",
        "Sharpness is better then my kit lens which I expected. Little heavier but not bad.",
        "This lens is well worth the cost. For me, it is the ultimate walk around lens. I hate changing lenses when out and about and this covers 95% of what I want to shoot. You can get awesome portraits at 55mm / f2.8, great landscapes at 17 mm and everything in between. I would never think of using the kit lens again. The size and weight of this lens seemed daunting for about 10 minutes. Now it just feels right on my Rebel T3. The kit lens seems like a cheap piece of junk comparatively. I also have the 50/f1.8, but don't use it much since it's too restrictive and I rarely have the desire to go below f2.8.",
        "Perfect so far ! Bought a Hoya 77m HD protector to place in front of it. It may not be weather sealed, but to the best of my knowledge only L series lenses are. My old 18-135 has some dust speckles on the front element and it didn't seem to degrade the picture, so even though I read a lot of complaints on this lens not being weather sealed, I decided to go for it and so far I'm happy. I bought this to replace my 18-135 so I'll have a better lens for everyday use, and so far it seems perfect. It is heavier with much more glass but seems better built.",
        "Honestly I love this lens if it worked more than a couple of months. For the short time that it did work it was amazing for most of the pictures I like to do. One day it stopped giving me the quality pics that I've been getting and instead leaving me with a solid black image everytime. This was just after the window to return was closed so I now have a lovely paperweight.",
        "this lens is awesome. used it for a birthday party indoors. no flash needed for perfect pics.",
        "I love this lens. It’s on my Canon T3i all the time. Photo’s turn out sharp and clear with great color all the time. I’m very happy with this lens.",
        "Lens let’s a ton of light in while taking pictures one of the best pieces of equipment I have currently",
        "No complaints. Does what it was designed to do. Image quality is great....now only if my skill at taking photos was as good...",
        "A great high-quality lens. Best when using it manually, which is perfect for me. If you prefer using auto-settings and auto-focus, this isn't for you.",
        "Overall, a excellent zoom lens and the best lens I've ever owned!",
        "This is an awesome fast zoom lens for all around photography. The auto focus is quick and silent but the only downfall is that the image stabilizer is loud due to it being an older system.",
        "I can give a lot of technical and practical reasons why this is a great lens, but just take your first shot with it and that’ll sum everything up just fine.",
        "Works great but the price is really, really high for the added quality you get compared to the standard 18-55mm kit lens on a T5i.",
        "Love this lens. I've been using the stock lenses with my cameras for years because I wasn't able to afford a standard lens with better quality than the ones that came with the camera. This lens is very affordable and the results are stunning. I would recommend.",
        "I ordered this buying it used. I am not sure yet about what this lens has to offer. The glass seems to be in good condition, however, the manual focus is sloppy loose. Disappointed.",
        "Just came back from picture taking in Italy. Worked great indoors and out. I am happy I purchased this over the 17-40. Indoors f/2.8 and IS are great combinations. I also have the 18-55 IS lens and this suprised me on how well it worked. The first day I used this and it worked great outdoors. The second day I knew I would be shooting indoors so I used the 17-55 and it stayed on the camera for the rest of the trip. Very happy with this lens",
        "In good shape and works like a charm. Heavy as expected with all that quality glass and auto mechanisms built in.",
        "This is defiantly one of the best lenses in the Canon lineup. You wont' find any \"L\" lenses in this general focal length at f/2.8 and with IS. Image quality is just as good as the L line. It does have a dust issue, and if you shoot in dusty environments you will get dust inside the lens. It doesn't effect image quality at all though. Wish you could stick this on a full frame!",
        "I am by no means a professional photographer. I'm sure there are problems with it technically or there are specifications that could be better. As a walk around lens though, it can't be beat. I use this lens almost exclusively now. It takes sharp, wonderful pictures and it has not disappointed me yet. :)",
        "Terrific lens! Works really well in low light/indoors - which is why I wanted it. I use it on a 70D and a 7D mark ii and it works equally well with both camera bodies",
        "I am not an experienced enough photographer to really be useful here, but the lens I received seems to work perfectly and gives me that extra utility and quality that I hoped for when upgrading from the kit lense of my T3i. Very pleased and very excited to take this on an upcoming trip to Hong Kong, China, and Japan.",
        "I use this and the Canon 75 - 300 mm as my two lenses on trips. I just took 4,000 photographs in Alaska and the results are spectacular. The 17-55 mm was on most of the time and was a joy to use. It also was great for video, it is silent, smooth and very fast. The images are razor sharp.",
        "Great lense. Didn't know what to expect because it was used but overall happy with the results!!",
        "This is the lens I use for my portrait photography and it does a great job. The images are crisp and sharp. It works best when your subjects are in close range - i.e. 3-15ft however when people are standing farther away the lens loses it ability to capture detail.",
        "I have a number of Canon DSLR Cameras and wake pictures around town and volunteer to cover photography certain events, 90% of the time this lens works perfect. You really for not need to muck telephoto use, if you need a closer shot get closer. The lense hold up well.",
        "This is an awesome lens. After 50mm, f1.8 this is my favorite Canon lens. Wish Canon could reduce the price.",
        "One of the best EF-S lens. If you need to upgrade from kit lens and wanted to stay with the same focal range, this is the sharpest and fastest lens which is having most of the L quality.",
        "Not a professional photographer but appreciate quality and this lens is no exception to canon's reputation for great lenses. It's a little large for the focal length range but it's very versatile with the fixed maximum aperture of 2.8. This is my go to lens for any general shooting and it has never let me down.",
        "This is now my favorite lens. It is now on my XSi 95% of the time. Wide enough for most purposes, and has some zoom capability. Excellent in low light, good for portraits, and its not TOO heavy. Yes, it's much bigger lens than the kit lens, but the constant aperture, IS is a blessing. If only they made such a lens from 17-100, but thats just wishing for too much.",
        "This lens rocks. All the other reviews you've read are true. Even better since the price came down to $829.00. Auto focus is very accurate. Almost every picture is in focus and with great contrast. Little heavy if you shoot all day with it but picture quality makes it worth it.",
        "The best wide angle zoom for the EFS 1.6x crop mount. High quality, very versatile. It has virtually lived on my camera ever since I got it, only coming off when I need the length of the 70-200mm 2.8L (another amazing lens!). I am very satisfied and have not regretted paying the money for this lens.",
        "This lens pairs awesome with my Rebel T6 but unfortunately will only work with crop sensor cameras.",
        "Great Quality and price. Was looking for a new low light new all-around carry lens for my canon for a trip to Europe.",
        "i really like the condition of the lens...clean with no scratches...unable to detect any dust inside lens",
        "Amazing lens! I love it and it stays on my camera as my everyday walk around lens",
        "I have been taking photographs with Canons since high school. I love the wide angle for portraits. I just take pics for fun - this allows me to take flattering pics of my friends and family. i bought an after market brand that would not focus properly. This lense if perfect!",
        "Exactly what I wanted. The IS is great, the focus is great, the images are sharp , especially between f4 and 5.6. The zoom and focus rings are very smooth..",
        "I think this lens is fantastic! I usually am one to prefer wide angles and taking pictures of people. This lens is PERFECT for Travel and all around its very versatile and almost always comes to use. I've kept this lens on my camera constantly and it's never really disappointed. The lens is super sharp too so it's really a great deal! I would expect this lens to be sold for more then it gives.",
        "I got this with an XTi body. I was worried about size but quickly overcame that. I did add a battery grip (opteka). The whole camera is easy to hold if one hand is on the lens like it should be. The f/2.8 and IS was invaluable for a recent trip to Italy where flash was not allowed many places. This lens focuses quickly and silently and rarely hunts unless it's very low light. I like the 77mm filter size which is compatible with many other high quality Canon lenses. The hood should be included and forms a large package when used. I guess that's the price you pay. No dust yet either.",
        "Excellent for the price. I used it for real estate pictures.",
        "This makes the perfect all purpose lens! The F stop makes indoor photos a snap, the wide angle is just enough so you can grab that quick landscape shot without changing lenses. Its very sharp as well.",
        "After spending hours reading reviews on what next lens to buy, I purchased this one and am quite pleased. Since buying it in January it has been on the camera 95% of the time. It is a great lens to have on for parties or just around the house. I am very pleased with how wide it gets.",
        "This used lens was/is in excellent conditions and exceeded my expectations. I am a professional photographer and could be happier with it.",
        "I'm not a professional photographer but have really enjoyed this lens. Using it on a Canon 40D after replacing my packaged 28-135- which isn't a bad lens either but wanted the flexability of wide angle with the lower F stop. Haven't noticed the rounded edges that people have commented on.",
        "I had this lens for a short period of time and experimented with various subjects. My impressions: IS works very well. 2.8+IS+highISO = flash-free handheld photos in the dark. A little too bulky and heavy for my taste -- I have been spoiled by the versatile and light 50mm 1.4 :) Zoom range is very versatile. This may well be the ideal tourist lens as it covers the needs for indoors, architecture, landscapes, and portrait shots.",
        "A must have if you shoot events. Works just like the 24-70mm.",
        "I is a good lens but is way over priced and should have been weather sealed.",
        "I’ve been using the lens for about a week and I love it so far. Super fast and sharp! Images are clear! Great in low light situations!",
        "Super sharp and gorgeous color and contrast....L-glass quality....so much better than the 24-105 because it's lighter and a reasonable size for a 2.8 lens. Seems very well designed for the 1.6 crop cameras. Image stabilization is icing on the cake. Love it!",
        "This lens is very crisp and sharp, it is fast in low light. I debated for quite a while before making my purchase for fear of disappointed. I am so glad I made this purchase.",
        "Awesome in low light and takes much better pics that the standard lens that came with my Canon T7i.",
        "I purchased this lens as an upgrade to a 15 year-old lens, with a smaller aperture. It gives me more flexibility, particularly in low-light conditions. This is a great all-round lens. The zoom-range covers 75% of the photos that I take.",
        "If you are upgrading, then you will really like this lens. It creates well liked pictures. It does not require a flash too often, and holds up well. Not too heavy. Lots of compliments. Like it - a lot.",
        "I replaced a Tamron 24-135 lens with this one. I miss the zoom a bit, but this focuses so much faster and takes so much better pictures, that I don't miss it too much.",
        "Try it, you might like it. I am very please with the performance of this lens. It is quick enough to even catch my 4 year grandson in action (he won't sit still when he see me with my camera)and its great in low light situations.",
        "Extremely sharp lens at any length I've used it for. Not a lot of need for post processing. Very good for the price, I would say the quality of image is that of an L lens.",
        "Excellent lens, but for the price Canon can consider putting it as an L Lens.",
        "It's a favorite!- I have been using this lens as my regular walk about lens- It's big and heavy, but it's a really nice piece of glass",
        "Love this Canon EF-S 17-55mm f/2.8 IS USM Lens for Canon DSLR Cameras. It is fast, sharp, a just right for people, their faces, and shooting small groups.",
        "Terrific lens. Clear, fast, great value. Wish it was weather sealed like a real L series not just compared to that quality.",
        "Very good quality pictures and the lens is superfast...can catch most of kids action. But beware lens is pretty bulky- as big as my Sigma 17-200 lens and wont fit in a small/compact case",
        "I am a rank amateur at photography but this lens makes up for my shortcomings. I decided to get into photography since I am newly retired. I did a MASSIVE amount of research before deciding on this lens because I only wanted to spend my money once to get an excellent lens. The picture quality is EXCELLENT. The pictures look better than the subject does in real life. Indoor(low light) pictures(without a flash) are every bit as good as outdoor pictures. Canon should have made this an EF lens for those who will eventually upgrade to the full frame cameras. I have this lens attached to my Canon T2i(an excellent combination). The lens is large and HEAVY.",
        "Very happy with the lens and the service I received when purchasing. It is a great and amazing lens.",
        "Mostly taking photos for fun. It was a great lens to play around with.",
        "This review is for people like me who are looking to minimize the weight of the lens, while getting good image quality at the same time.. On the positive side, this lens takes sparkling pictures on my Rebel XS camera, excellent in every way. At 1.5 pounds, though, I found it to be too heavy for a carry-around lens for travel. I returned it and purchased the Canon 17-40mm lens, which is better for my needs.",
        "if you have a crop sensor camera with the kit lens and wanna take your photo skills to the next level, this is the lens for you! all my friends and family think so of all my pics!!",
        "So I keep reading debates over and over again discussing which lens is the \"best\" walk-around lens for a canon cropped camera, this lens (the 17-55mm f/2.8) or the 24-105mm f/4. To me the answer is simple. I own both. I use the 17-55mm as my \"indoor\" walk around lens, and the 24-105mm as my \"outdoor\" walk around lens. This speed of this lens makes a huge difference indoors if you don't want to use a flash, but the extra reach (plus the weather proofing) of the 24-105mm are ideal for outdoor use.",
        "I know it's expensive, $960 with rebate, but this lens is great for landscapes as well as candid photos of the grandchildren. With the f/2.8 aperture I can get early morning photos without the blur. Great sharpness!",
        "Had a 28-105, then 28-135 IS, now this lens is my walk-around lens. Love the quality and it is a solid build. IS is quite and effective. The lens is pretty bulky though, but then again, so is my camera. Some people don't like the fact that you're paying a premium for an EF-S lens. Well, I don't think that I'm \"renting\" my glass and therefore expect 90% value in the future. So that's not a huge factor for me.",
        "I wanted this for my daughters wedding. It is great for indoors and close areas. It is a must have.",
        "I recently purchased a Canon EOS 7D MK II and needed a lens that could somewhat match the capabilities of the camera. I had done some online research and this lens got high marks from a lot of reviewers. Now that I have had a chance to use it, I will add my five stars. This lens takes crystal clear photos in some low light situations, something I really wanted. And the \"S\" size sensor on the 7D provides a 27 - 88 mm 35mm equivalent. For me, that range covers 98% of my applications. Great piece of glass!",
        "Another lens added to my collection. This lens gives me the opportunity to take wider shots.",
        "Great lens with a razor sharp focus! Love the look of the videos I get with it! I use a canon 80d",
        "Super lens. Sharp focus. Works great on my Canon 7D.",
        "Awesome lens. I wanted something with a similar range as my crappy kit lens for indoor shots at family gatherings and such so I started looking for a 2.8 with a similar range. I love my 50mm 1.8 but it doesn't always give you the wide angle shots you need in tight quarters. Very quiet and fast focusing. It does struggle focusing in direct sunlight so I'd recommend a lens hood for sure. Overall, an excellent upgrade and fast enough for those low light conditions.",
        "Love this lens and is on my camera most of the time. I particularly like the constant bigger f number in this lens.",
        "This is a great lense. I use it about 90% of the time.",
        "I'm very serious about that title...if your finances allow, do not buy the kit 18-55 lens, kick those dollars into this lens and you'll be an EXTREMELY happy camper! Others may give detailed reviews and sing the praises of this lens in more colorful ways than you'll read here, just know that I had the kit lenses and now I have this one and am ecstatic about the upgrade! (Full disclosure...I tried to purchase this lens from a private seller here on Amazon and the lens turned out to be scratched and filled with dust.! This was a bad experience and I ended up having to buy a good copy of the lens elsewhere)"
    ]
}