{
    "entity": "SLR Camera Lenses",
    "text": [
        "I use a T3i crop sensor camera and wanted a 35mm equivalent mainly for video work. I use this lens about 50/50 for photo and video. This one since it functions like a 32mm I find it is a very versatile focal length. I find it to be great in low light, vivid color, and sharp at 2.8. There is barely perceptible barrel distortion on the crop sensor camera. Overall I love this lens and would suggest it for both photography and video for a crop sensor camera.",
        "You never see this lens reviewed on YouTube or anywhere else. It's amazing how at such low cost and weight that it can produce such good image. It's great for video as the resolution is enough for this kind of work. Very satisfied with this purchase!",
        "Very happy with this lens. I use it almost exclusively in manual mode (AF works well). Very sharp images, a ever so slight distortion is easily corrected in post. I do lots of mountain and landscape during my hikes and this lens is almost always on my Canon 6d",
        "This is a great lens for the price. We have taken many photos that have been enlarged and the definition has been excellent.",
        "A really solid lens. It's not light - all metal and glass - but I would rather have and use this than other cheap-feeling lenses. (I'm looking at you, Nifty-Fifty...) This is a perfect lens - size and weight - for my Panasonic GH4. With the Aputure DEC Lensregain, this lens is a wide 30mm with a 2.0 aperture.",
        "I can't tell if the image quality is worse then the old 24mm I had or if it is the change in editing software. But the images don't blow up as well as my older photos do! Otherwise works great!",
        "I primarily shoot with a 50mm and canon 5D camera. After trying several wide angle lenses, I opted for this lightweight wide angle zoom given the price point and ease I carrying it all day. I will mostly using this for landscapes and architecture photography. There is some distortion but that can easily be fixed with photo software in post production. Photos so far are sharp and the field of view works well for me. Focus is fast in comparison to my 50mm L f1.2 and definitely accurate. This lens is definitely worth a look.",
        "I purchased this lens after shopping and trying several ultra-wide lens options. I should have tried this one first to save me a lot of time and returns. The lens is well built, has great image quality and is just a well rounded ultra wide angle lens. I bought this to use on a Canon 6D to shoot landscapes and night scenes. Absolutely no regrets.",
        "takes wonderful pictures your ability to use it helps a lot , nicely built.",
        "I have bought the used one but looks like new condition. No scratch or dent on lense.",
        "I love this sense, able to get a full body shot from 10ft away",
        "Great lens for landscape photos. Only had it a few days, but very happy with the results. Much better than the wide angle zoom it replaced. Also works well indoors for family gatherings. Too wide for my Canon 580 flash, but my 6D has great low-light capability. No problems so far.",
        "This lens has become my primary lens. I brought it on vacation to Mexico and was able to capture awesome pictures. It's definitely worth the $$... It's not expensive like the l-series, but I can't complain for the $$ I paid for it... It also is nice for video capture... Love it!",
        "Really good lens. One of my favorites. Haven't really been bothered by vignetting. For someone with not too much money to spend, this is a good buy.",
        "i have to be close to my subject to get a good shoot. but the quality of the video and picture are super. great wide angle but remember you will have to be close to you subject to get the fully of it or them.",
        "Excellent, Shipping was great product was also very good quality fit like a charm. Thank you",
        "Wide angle is my favorite, both for photo and video. Any wider, and you'll get obvious warping in your picture.",
        "Just plain, an amazing lense with my full frame 5D",
        "This lens has some mixed reviews, but I think it is great lens if you take the time to learn about it. It has a curved focal plane that works great if you know about it.",
        "Heavy vignetting, soft in the corners, but it's a good little lens if you are looking for something on the wide end.",
        "I wanted a 20mm prime to use for night shooting, so I thought I'd give this one a try. I chose poorly. Returned it the same day. Still on the hunt for a good prime night long exposure performer. This lens was really soft around the edges (even on my 40D with a 1.6x FOVCF). Although I don't need a fast focusing lens for night use, this lens still focused slowly during its day use. It's grossly overpriced. Should be only $299 at most.",
        "Close up shots does not focus automatically. The only way it will work if I change it to manual. I am not sure if this is true for all this type of lenses.",
        "Preloved. Images are crisp and sharp. Good for budding photographers. Served me well for almost 2 years. Sold as changed gears to M4/3 for weight reduction. Package arrived as promised. Well packed.",
        "Always happy with Canon Lenses.. I am more a detailed photographer, I purchased this mainly for my husband. He enjoys taking more landscape photography. Overall, very happy!",
        "This lens is just what I wanted. I could not find it at any of the local shops, and the price I was being quoted to special order it was double what I paid for this lens. I am very pleased.",
        "nice wide angle. need to learn how to avoid shadow. 2.8 do not defocus so much as a 50mm. easy to take pictures in small places with a lot of people",
        "The 20mm works great for those tite spaces in parties or rooms. I like it!",
        "I was really excited for this lens and I couldn't wait to use it for a family function. I don't consider myself a professional photographer but i am constantly using my DSLR and taking pictures but I was very disappointed with this lens, I am sending it back immediately. The pictures were to soft at f/2.8, they started getting sharper at f/4.0. I'm using the money I get back to buy the Tokina 11-16mm f/2.8. But overall, i recommend you don't get this lens.",
        "received this lens within the same week of purchasing. in great condition and was also affordable. i almost returned it due to it being a mix up on the order (mistake on my part) but decided against it. thanks for the reliable service. would def buy from this person again!",
        "I like this lens. I purchased this as my Rebel did not come with a wide angle lens. The only con I can see is that you can't zoom in and out only focus at one distance (Only reason it is a 4 star rating). It would be nice to be able to zoom in closer and still get a wide angle shot. The pictures are very clear and amazing how much you can get in the picture.",
        "I picked this up for a trip and love it. It's a great focal length for the digital Rebels with the smaller sensors (works like a 32mm on my Canon t1i). It is a little prone to flaring, so I highly recommend getting the Canon brand bayonet-mount lens hood (or even an off-brand, if you live dangerously). I bought a generic hood that screws on to the filter threads and this does not work very well. I thought that I would end up reselling this when I upgrade to a 17-40 f/4L in the future, but I think I may keep it around for the extra stop anyway!",
        "I was a bit concerned at first with the fixed focal length, but it has proven to be very versatile. It takes very sharp pictures, even when fully opened in low light. I have not noticed any of the vignetting that other users have mentioned. Bottom line: great wide angle lens for the price. Useful for landscapes and tight space, low light situations.",
        "I shoot both film and digital images with this lens. This lens is on my camera 80% of the time. It is a very fast and solid lens. I have not found any zoom that can compete. I love it.",
        "I use this on my 40D, was not impressed with the previous reviews but needed a 20mm so went ahead and pushed the button. Picture quality was stunning at the amazingly low lights and the lens was super fast. excellent built quality. A great buy for an ultra wide angle.",
        "I hella enjoy using this lens, its always hooked on my Canon 40d. One of Canons cheap wide lens. Excellent made, perfect.",
        "I used it to shoot from an elevated angle. The result were disappointing.....I paid $[...] but I don't think it is even worth more than $[...] to tell you the truth. The colors are lifeless, \"burnt-out\". There are no details on the images. You can see the samples on my site: [...] Look for the huge house with the red roof. You will see what I am talking about. Normally, I use the 17-40 L on my elevated system. I thoguht the 20mm would be a good replacement even if it not as good as the 17 40. I think even the 18-55 Canon kit lens produces better images. Add a few hundred bucks and buy a decent lens."
    ]
}