{
    "entity": "SLR Camera Lenses",
    "text": [
        "Im a professional photographer that always wanted a travel lense that would perform in most light conditions. Im glad to say this is my dream lense, the only lense I carry around in my trips. It is a bit bulky and it sure catches some eyes but boy the pictures out of the lense with no post-processing are magical. I rarely have to tweak anything. It is pricey but trust me, it is worthed",
        "You would think that they would package your lens better after spending so much money on it. I haven't gotten to play with it so I will leave a review on how it functions at a later time. When I opened the box it was shipped in I saw that my lens was no longer inside of it's box. This lens is not in a Canon box, it comes with a tulip and a soft carrying case, but doesn't come with instructions or the warranty sheet which concerns me a little. I'm going to do more research because I'm not happy so far. I might return it just to be safe.",
        "This Lens is really unbelievable. I cant say enough about the quality of the photos.I'll attach some pics for them to speak for this glass.",
        "I have a few different Canon lens options for my camera, and all work great with clear focus, however, this lens never seems to give me the same sharp image as my other lens options. All my photos are out of focus with this lens and I cannot figure out what is wrong with this particular lens. Anyone have this issue?",
        "An amazing lens as everyone else has said. You cannot beat the wide angle and the optics on this are amazing. I took this on a trip along the California coast and I got some shots I never would have been able to get if it wasn't for this lens. Every photo came out perfect and extremely clear. This lens is perfect for landscapes and night photography, I wouldn't use it for any kind of portrait, although I did shoot some people at 35mm which came out alight. Overall, it's worth every penny.",
        "While there are Canon wide lenses that offer superior corner performance such as the TS-E lenses, this lens is nice as it offers a flexible focal length range of 16-35mm. This allows you to capture everything in the ultrawide-wide focal length. Thus you are not risk at missing a more close-up opportunity when trying to get in an ultrawide shot. Sharpness wise, it is a compromise most definitely, but it is worth this compromise for the extremely useful zoom range of this lens. Recommended, unless you need edge-to-edge sharpness - where I'd recommend a TS-E lens instead.",
        "This is my 5th Canon L Series lens. Since I have some pretty great lenses, my expectations are high. I purchased this for real estate photography because I needed something wide on a 5DMIII that could take sharp photos in low light. The 2.8 let's in a lot of light and this lens is as sharp as a tack. So far I am impressed indoors and outdoors.",
        "I used to love this lens and the more I have it the less I like it. It also showed up with a small crack on the lens which was not stated online. Better off getting a 24-70.",
        "Excellent lens, images have a superb quality typically associated with Canon \"L\" series. Someone really needs to pay attention to how it is being used, perspective on a subject, photo composition and the resulting images will not disappoint! Use it without considering those factors - and you might be disappointed. Also, this is a lens that I would recommend for a full frame sensor camera - I have great results using it with my EOS 5D Mark II and had just an OK result using it on my crop sensor Canon 60D due to the 1.6 factor that really killed the \"wide lens\" idea",
        "My new favorite lens (although I do say this quite often...). A lot of people say this lens is relatively soft compared to L lenses. By no means did I do any technical or meticulous testing, but just from eyeballing some crops from this lens, and my 24-70 L II (which I also love), I felt like the sharpness was even in the center. Corners were less sharp, but I'm not worried about that. I was considering the tokina 16-28 as well, but got this one instead and have no regrets (didn't try out the tokina at all however).",
        "I use this lens every time I shoot landscapes or close up photographs. It captures crisp, clear, colorful wide angle shots if one follows the rules of good composition and exposure. It does a great job in low light situations like early morning or early evening or timed exposures just before sunrise or just after sunset. I have used this lens for two months now and would not part with it. I carry it in my bag at all times.",
        "I waited two years testing out other Canon lenses before buying this. I use this mainly for landscapes but is also great for people pics. It's a Canon L lens so you know the build is great. It's sharp and even at 16 mm you get much less vignetting - if any. Canon 17-40 mm 4.0L vignettes a lot especially at 17 mm so I wouldn't recommend it. I bought this lens used so I was a little concerned but the seller described the product's condition exactly and did a great job packaging it. Thanks again seller!",
        "OMG, this is like, seks. I love this lens. The AF in these L series are so amazing fast! The f/2.8 is great for indoor group shots or scenery. MK2 version has no compression on the edges. If there are, it isnt noticable. The Filters are very expensive for this lens, but if you make the jump to pick up the lens, youd drop any penny on protecting the glass on this baby. I've owned this lens a little over 6 months, and it has treated me very well, never failed me, and i would truely recommend this lens to any photographer looking into Wide angle lens.",
        "From the moment I mounted this lens on my 5D it was true love. Build quality was as one would expect for an L-series lens. IQ that is stunning. Sharp as a tack on the 5D and now the 1DmkIII. It is very wide on FF, not so much on the 1.3x crop, but perhaps more useful now overall. This is certainly a lens that I will keep on permanent standby in my collection. That's high praise since the only other lens that I can say that about is the 135 f/2. Now there is a combination that I could live with in a 2 lens arrangement. Very highly recommended.",
        "I have been using this lens on my 5D sr and I am quite happy with the results. I love the wide angle shots with it and the color of the shots just pop! The f/2.8 comes in handy with the 5D sr under low light. Nice addition to my camera bag!",
        "I purchased this lens when I upgraded from my 40D crop body to the 5Dmk2. I decided to spend the extra over the 17-40 and get this lens, simply for the additional F-stop. The quality of this lens is just incredible. I was using the 17-55 lens before this, and I thought that was good. I put this puppy on my 40D to compare and was blown away by the quality. On the 5Dmk2, it just shines. I can't say enough about this lens. Built well, I have no issues with dust, and pictures always turn out stunning.",
        "I planned to buy a less expensive lens with less features. I saw this used high end item and decided to risk it for a bit more $. It arrived as described, with handling wear. It works great and i'm happy to have the better quality.",
        "Wow! This thing shoots wide! You can stand 5 feet from a large tractor and get the whole thing in there! And it doesn't look weird or bent like a fisheye. I love it! It's crisp and fast. I read some complaints about clarity in eyelashes when shooting portraits with it, but honestly this isn't my first choice for a portrait lens. For close ups of faces I prefer the 24-70, or a longer lens zoomed in. For wide angle shots this lens is amazing!",
        "I've had this lens for over a year and it is by far my favorite lens in my arsenal. Wide but still able to zoom a little. and the f/2.8 is incredible in low light.",
        "My husband had been dreaming about this lens, so I decided to get it for him for his birthday. He had recently upgraded to a Mark III and want this lens to do his landscape photography. He is in love with this lens. The lens is sharp! He loves the sun star that he gets from this lens. I know that we are going to have many more photos from this lens and they are going to be awesome. I would definitely recommend this lens to anyone!!",
        "I was looking for a wide angel lens after upgrading from a Canon 60D to a Mark 5D III . I do a lot of interior real estate photograply and landscape photos. I am more than pleased with my purchase as the photos are extrememly clear and crisp. Lens works great and so far no negative issues.",
        "This lens supplemented my Canon 100mm IS macro and 8-15mm fisheye. It has become my 'daily shooter' lens, and is my favorite all-around lens. The lens is exteremely sharp, and offers superb contrast. Until I started buying the L-series lenses, I had no idea now much better contrast a really superb lens such as this one could provide. Focus is fast. The lens is a big large and is heavy, but the results make it worthwhile. If you need the best possible optical quialities, and are shooting a Full Frame sensor camera such as the 5D MK II or III, you can't go wrong. If you're shooting a cropped sensor, the 17-40 will likely suffice. HIGHLY RECOMMENDED!",
        "Great lens and exactly as described with quick delivery. I'm looking forward to going out into the woods to take some nature photos with this awesome lens!",
        "If I had to chose just one lens to live with, this would be the one. I can say about this lens that I love it. It's great in low light, landscapes, even portraits (keeping your subject in the middle to avoid distorting proportions), and almost everything (except if you need an extreme large zoom lens). This lens is a must have!",
        "ARRIVED BROKEN. NOT FUNCTIONING. had to have a friend fix.",
        "I'm a realtor. This is a great lens for taking photos. Wide angle are captured without a fish eye curved effect.",
        "Fantastic zoom! Prefect for traveling and landscapes. Much better than the previous version (which I also own). It is my go to objective for my Mark III when I travel.",
        "I haven't had this lens very long, but I really enjoy using it. It is perfect for doing landscape shots with flowers in the immediate foreground and a beautiful mountain scene in the background. Everything is in focus, and really sharp. It is great for low light situations too.",
        "My primary reason for buying this lens was shooting at 16mm. I am happy that it delivers. I also like that it excepts filters so I can use graduated ND filters (Cokin X pro). Happy with quality, weather proofing and quality.",
        "Canon L series ultra wide. I don't think there's a gray area here. You either know you want it or do not want it. After rebates, the price is a great bargain.",
        "I now own 4 \"L\" lenses (see below). This 16-35mm f/2.8L is perhaps the most versatile for my needs. I often shoot interiors and landscapes at the wider ranges and the overall quality is excellent. The build quality of this lens is superb (as it should be). The lens is fast, quiet, focuses quickly, and I have no complaints. - When I'm shooting indoors where there are lots of people, this is the lens I use. Canon Digital EOS 40D Canon EF 50mm f/1.2L USM Canon EF 16-35mm f/2.8L II USM Canon EF 24-70mm f/2.8L USM Canon EF 70-200mm f/2.8L IS USM Canon EF 1.4X II Extender",
        "If you are at all serious about landscape photography, either natural or urban, this undoubtedly expensive lens is worth the cost. Clarity ad color are excellent edge-to-edge, and the F2.8 offers lots of depth-of-field flexibility and variable light capability.",
        "Super clear and sharp images without vignetting at the widest angle. The construction has a very sturdy and solid feel, unlike the EF-s lens or other brands. Also, super fast even in low light environment.",
        "I am a wedding photographer with a extensive resume of weddings. I own a good bit of L glass that Canon makes and use them on a pair of Canon 5D's & a C100 Cinema camera. 16-35 is a great sharp lens with a nice low light f/stop. I find myself never using my 17-40 LENS now. If you want that dramatic wide shot this is it. If you need to get a wider shot for your CROP sensor Cinema Camera, this is the solution. I rate this lens with 5 stars and is work every penny.",
        "My first lens ever. Worth every single penny. The Wide angle is awesome and have used for videos and photos. Overall, a great piece of glass.",
        "This second hand lens is dirty, zoom not functioning well. It was not worth the price at all",
        "I have had the 17-40 for a few years and finally decided to upgrade to the 16-35 II. There is a noticeable difference in the corner sharpness and color. The other lens was OK, but this one is better.",
        "No complaints. I am a fan of ultra wide angle photography and this one fits the bill. Sharp, good color, fast focus, great pictures.",
        "Super sharp. Great color and contrast as you would expect from Canon L lenses. I own the 24-105 and 100mm Macro L Lenses and this one may be my favorite of the three.",
        "Beautiful lens and worth every penny. I use it for capturing star trails and taking images of the ISS as it passes over and it does an amazing job.",
        "Like most people, I'm just a sometime photographer. So if you want endless technical details, suggest you skip this review and study the voluminous ones posted by the pros. I bought this lens a few years ago, prior to an Alaskan trip, and have used it all across the lower 48. This was my first \"professional\" lens. You will definitely see more image clarity with this than with a standard lens. Is it worth the cost difference? That depends on how important those \"once in a lifetime\" images are to you. I have many of those images hanging in my house, and when I look at them, the cost of the lens never crosses my mind.",
        "I am super duper SUPER happy with this seller. The lens is beyond perfection and I would think it was brand new unused if someone asked me. I would use this seller again and again!",
        "Great lens. Sharp night-time images and great for....really.. any other shots.",
        "I bought this for taking some wide angle shots...I don't use it as much as other lenses but it does take excellent photos.",
        "Great lens for interior work or landscape photos. Canon optical sharpness and rugged build quality in the L series lenses is excellent. Highly recommended.",
        "Great lens but not for the work I do... I had to return it.",
        "Fantastic lens. Big step up from the 17-40 f/4L. Sharp. Just wish it went to 40mm. Always in my camera bag.",
        "LOVE LOVE LOVE this lens. Not only is it amazing sharp. For wide angle 2.8 in darker night situations it does WONDERS for night photography or video. definitely recommend this lens for a person shooting Wide angles and scenic photography.",
        "Im using it with canon 60D for underwater photography and videography and its amazing. Its not too wide and not too narrow, so you can zooming in and out with clear pictures. Thank you so much",
        "After researching a lot, I don't think you can get a better combination of wide + aperture in a canon lens. There's the Nikon 14-24mm which is a better lens for me, but unfortunately canon doesn't make a similar one, and it would require an adaptor + loose the autofocus. I'm giving 5 stars because it's the best combination and I hope to help someone in their research, although this wasn't as fun to shoot as when I first opened the f1.2 50mm.",
        "I purchased this for a recent vacation. It was great to be able to take clear wide angle shots of all the various sights. The pictures get a bit fish-eyed and the edges of the shots can get blurry at the widest setting, but I think that is to be expected.",
        "This Lens is very sharp throughout its focal range. It is being used as a documentary lens for an Arriflex AMIRA camera package.",
        "I love this product. the professional build and weather proofing and sturdiness are unmatched in its category. great product and would recommend.",
        "I was originally looking to get a, for the focal length and glass speed. Taking into consideration that my 40D has a FOVCF of 1.6, I opted to get the EF 16-35mm f/2.8 -- the equivalent focal length is close enough to what I was looking for. I don't regret making that decision at all. This is an awesome lens.",
        "I can't add much to the other reviews, sough, I'll just say. Ladies and Gentlemen this is one great lens.",
        "Perfect addition for a well rounded set of lenses. The 16-35mm f/2.8 II USM lens starts at a very wide 16mm and zooms out to cover anything in the range that I would have a wide angle lens mounted for. In combination with the 24-105mm and the 7-200mm, I've got a full range of zoom covered. The 2.8 aperture is usually enough to capture great images in the low light of very early dawn or very late twilight without bumping the ISO too high.",
        "We see in panorama. This lens sees a 108 degree field of view with out distortion which is wonderful. The overall clarity of the lens is stunning.",
        "It is the best lens you can find that fits regular 100mm squared filters. I was a EF 17-40 f/4L users, but since this lens has been stolen (Never put anything inside your car when you leave!!!) I decided to get this lens, it slightly better than the 17-40 in image quality, but the sun-star is significantly better looking, it's sharp and great shaped. Yes, it's much more expensive than the 17-40 with not too much improvement, but you should already expected. If you can afford it, then buy it. If you have a tight budget but want a \"similar\" quality, then go with the 17-40.",
        "Frequently used lens for landscape photography. L series is well worth the money.",
        "GREAT lens, I can do a lot more with it!",
        "edges in wide angle are blurry but it's a great lens.",
        "I love this lens! It is heavy, but is seriously sturdy, and the glass is fantastic. It stays on my camera most of the time. Very fast autofocus and f 2.8 is great in low light for portraits, etc. one downside though is that it needs ultrathin filters and some of these like the B+W do not let you use the enclosed lens cap.",
        "Others have given very detailed and accurate reviews on the performance of this lens, and I will not repeat what they have said. I will say that this lens has met my high expectations for it, after having read the reviews. Great performance.",
        "I use this lens for interiors and landscapes. It has amazing image quality on my 6D and is very fast to focus. Great build quality",
        "Absolutely nothing to complain about. This is a very very sharp and true color lens. Amazingly fast autofocus as well. Insane boceh even for a wide lens.",
        "I borrowed the 17-40 f4 and wasn't that impressed with it. I then borrowed this lens - and was amazed with it. This is a great lens and worth the additional money. I use it on a 5D MkII and its very good. I recommend it.",
        "No visible vignetage or distortion, very bright, makes my confined spaces pictures a breeze. (I use it with an EFS most of the time)",
        "Love this lens! It is as I would expect of a Canon L series lens.",
        "100% satisfied. Now I got 16 through 70 range view.",
        "This lens is clear, and quick to focus. I love it. Great addition to my camera bag. I was looking for a wide angle lens, that wasn't fish eyed. This lens fits the bill.",
        "One of my favorite lenses, I use it all the time! A must for travel & portraits. I love it!",
        "I wasn't sure what to expect but the sharpness of photos and the quality of this lens is the best. Any limitations are mine and not the product! Great buy if you are in the market for an ultra-wide angle lens for landscape and all types of other photos",
        "This is one of the great lenses...a staple for many working pros...I've used this lens for many years ...I also have the 24-105mm and a full bag of other Canon L lenses...this lens is quite sharp for a zoom lens...focusing is smooth...great quality from Canon !!",
        "This lens was as good as advertised! Perfect Condition.. Shipped quickly. I've used it now a couple weeks and works great!",
        "Perfect!!! in every way! Thanks so much for the honesty, and speed in which i got my lens! BRAVO! :-)",
        "This lens gave me a whole new perspective to my photography game.",
        "I use it on the 7D, it is clear, I can see things through this lens (via the view finder) that the naked eye missed. Very bright, fast and useful range on the 7D. Expensive (well you already knew that)",
        "There is no noticable fall off on the edges as I had on my similar Sigma lens. This lens is more costly, heavier but worth the extra cost and weight. The price here was several hundred dollars less that at other vendors.",
        "I got this for my husband. He has been dying to have this baby. I finally pulled the trigger at Christmas time. It is heavy but he LOVES it. We can't wait to take it on vacation. Definitely a great buy.",
        "Absolutely an amazing \"magic\" lens. My photos are fantastic and the quality is unreal. If you're debating about this lens and can afford it, take the plunge. The 2.8 is extremely useful and has been a great addition to my setup. One note: the rebate from Canon that you mail in for returns to you a gift card, not a check. I was planning on paying the $200 rebate towards my credit card and was surprised when I got an AMEX gift card in the mail. Not a big deal-- I'll just buy more camera equipment, but did catch me off guard. Aloha!",
        "I've been dreaming about this lens since long time, and finally I got it. It is exactly as mentioned on the website and all unboxing videos on the web. All original and brand new. Love it! I'm using this lens on canon 7D, eventhough this works better on full frame camera but it is awesome with one problem, builtin flash shadow can be seen during night shots or whenever you use 16mm with flash. How to solve this? Easy, by using external flash.",
        "Price should be a little lower, however, its a great wide angle lens. At 16mm you occasionally see the bending effect around the edges depending on what you are shoot and how close, but it has also allowed me to get shots such as this.",
        "Super sharp, even wide open. Fast accurate auto focus, even in dim light. What's not to love about this lens.",
        "Replaced my old Canon 16-35 mm lens and is considerable improvement when it comes to less distortion, flare and vignetting. Only drawback is that it requires thin 88 mm filters that are expensive and when using one, is not possible to keep a filter cap in place since these filters have no front threat and use push-in cap types that do not stay in place.",
        "Great wide angle lens. A tad soft on the corners but razor sharp dead center. I considered the 24-70 for greater range but figured I a longer lenses for that end of the spectrum.",
        "This lens is awesome. I had used the previous version of this lens and wasn't really impressed, but I love this one.",
        "Excellent lens. Took it to Yellowstone amazing breathtaking pictures. Was floored by the quality of the images. I see the difference between an L lens and a non-L lens.",
        "If you own a Canon with a Full-Frame Sensor camera don't waste your money buying any other wide angle zoom. Save and go for the best... Yes, it's a little pricey and that's what I thought. I wasted my money on a \"compromise\", which did it's job... I finally decided to get what I really wanted and I'm glad I did. This lens takes such a crisp photo everytime. I wish I had bought this earlier. All those places I have visited... I have taken photos but they would have been better if I had this lens. It is easier to get the best equipment than to visit those places for a second time.",
        "Great Lens! I use this lens often to shoot weddings!",
        "Just what I was needing and love!!! Wish it would of come with a lens hood.",
        "Excellent quality !! The best lens that I have! Highly recommended !!",
        "I love this lens on our RED camera. Very sharp and very little distortion. All in all a great lens.",
        "This lens is the only one I carry in my camera bag when travelling overseas. It covers a broad enough spectrum of situations to be useful.",
        "I have seen various photos by some of my favorite photographers and I was never disappointed in them. In fact, it made me want the lens more. I am now the proud owner of that lens. I recommend this lens to anyone who loves photography. Thank you Amazon the price of the product.",
        "This lens is the bread and butter of my photography. A very solid lens where this replaced my 17-55 IS canon lens. I did not like my EFS 17-55 lens as it seemed cheaply constructed, zoom and focus rings had almost no resistance, and it sucked in dirt behind the front lens element. With the 16-35 lens I will have it for my entire life and it will always be there ready to serve its purpose.",
        "Very much satisfied with the lenses, you can trust Infinitus Store for your purchase. The lenses are bright and work perfectly on my 5D Mark III, giving me an excellent option for professional photgraphy.",
        "This is one of my favorite Canon lenses, I use it all the time!",
        "If you don't need to use filters get the Tokina 16-28. It's every bit as good, if not a little better, for a fraction of the price. The only thing you get with this lens over the Tokina is the ability to use filters.",
        "I love this lens! That's all I'm going to say about it.",
        "This lens really gives nice photos. If you can afford it, you will be happy with it."
    ]
}