{
    "entity": "SLR Camera Lenses",
    "text": [
        "I love this lens! I’ve used the Canon 50mm f/1.4 for a while now and ever since I bought this 28...I’ve been using the 28 a lot! Notes: - The 50 is much better/sharper in terms of image quality. (The 28 almost feels like you are shooting at an ISO higher than your setting) - The build quality is incredible...compared to the 50. My 50’s focus ring is rough and noisy and the AF is scratchy, BUT, this 28 is silent and extremely smooth. I love the feeling. This is a beautiful lens for the price.",
        "I've been using this lens for two years. I have 9 lenses (2 L's) and this is the one I use the most. I use it on both crop and full frame cameras, indoors and out. It's so good in low light I rarely take a flash with me. Images are true to life with no distortion and it's tack sharp at all apertures. I use a tripod with cable release most of the time when shooting landscapes but it doesn't do bad handheld, either. The night shot below is on tripod and the day shot is handheld. It's well worth the price.",
        "The shot here is lit by a single candle. It's 1/13th of a second at f 1.8 with ISO up at 3200. This was shot on an 8 year old Canon T2i. You could buy a new camera with a better sensor and better stabilization and probably pull this off with a modern kit lens, but then you're spending $1500+ on new gear. I'm going to move over to a Fuji XT3 soon but this lens has been great as it's near what a 50mm looks like on a full frame sensor.",
        "This is my new favorite lens! I did lots of research online to find a great lens to pair with my Canon Rebel T3. I'm an amateur photographer and so I wanted something that would increase the quality of my photos but that I didn't have to break the bank over. I plan to use this lens for pretty much everything and I am so happy I decided on this lens over others. If you have a crop sensor camera such as the canon rebel series then this lens is for you.",
        "Wonderful lens and works great for wide-shots! Also nice for when taking pictures in my small apartment and have little space to stand back but still want the small aperture!",
        "The lens is good, but at the end, I don't really use it. If you need a 28mm go ahead is a good buy, but if you're not sure then absolutely don't. Let me say it again is a good lens, but I don't see the use of it right now",
        "By far this is not my favorite lens. On a full frame, its very hard to focus when wide open. I have to use live view with MF and then use the cameras zoom function to focus. Tried it on a crop sensor and it was a little better. In low light and manually setting the color temp I do get nice photos but not great photos. I much prefer the 50mm f1.4 for indoor shots on both my ff and crop sensor. This summer I plan to use this lens for Milky Way/Galaxy photos but I have a less expensive Rokinon 14mm f2.8 which is much easier to manually focus. Will hope this works as well.",
        "The most useful lens in my lens selections. I have cropped camera detectors so this 28mm lens is an effective 44.8mm prime lens. The advantages of a \"prime\" lens. Again when used with my \"cropped\" cameras this high quality, well constructed, lens is better than the 80mm f/1.8 USM and provides for better images than my two telephoto lens. I wish it was even smaller than 28mm but this lacks the distortion inherent in the fish eye lens.",
        "I received the lens very quickly and it's like new! I am very pleased so far. I have not printed any photos from it yet but it does appear to work beautifully.",
        "I've had this lens for a while but I've been teetering between the 35mm and 24mm and I find myself going back to this one. I'm just curious of the f2.8 is any better? I guess I got a tact sharp version of this one because the reviews are mixed on this 28mm 1.8. Either way I couldn't be happier. This is an oldie but a goodie.",
        "I love this lens so much. On my APS-C camera, it functions as a close-to-Normal lens. The sharpness is excellent, even wide open. The low-light functionality is fantastic, and the weight of it is perfect for just walking around. The autofocus is nearly silent, fast and accurate. Really glad I purchased this lens.",
        "I upgraded from my Canon EF-s 18 - 200 mm kit lens on my Canon 60D. I was tempted to buy the nifty-fifty but I was concerned that it would be too tight since I mainly shoot indoors during family gatherings. This 28 mm lens does not disappoint and is the perfect length for my needs. I can't believe how fast it is and pictures look amazing. I have been able to get so many more shots that simply weren't possible before. I typically don't use it below 2.2 due to softness at the lower apertures. There is some chromatic abberation but I have found that this is easily fixed in the Lightroom 4 lens profile correction.",
        "Bought this lens to replace my broken 50mm. Love how compact this lens is, although it's not super light. It's ridiculously wide, which it was exactly what I was looking for and with the right filter I can shoot with the aperture wide-open too.",
        "The only problem was the box was beat up and the lenses was very dirty on both sides, there were no visible scratches but I got the feeling that the lens was used. No damage but if you spend $500. On a lens I would expect to get it in better condition.",
        "I wanted something that shot well in low light and would fit more into my 1.6 cropped frame than my 50mm 1.8 and this is exactly what it does. I've been using it for about 1 month now and have absolutely no complaints. I took my niece's 5 year pics with it and they turned out great. Just have to get used to standing closer to my subject to get good face shots like I was forced to take with the 50mm. Bokeh doesn't seem to be as strong but I haven't done a side by side comparison. Good strong build too.",
        "I don't know what it is about this lens but I love it! I'm still fairly new to photography but decided to make some changes from just my 50mm lens. I got this because I needed a little wider angle to do some lifestyle photography and I haven't looked back. Yes, when you are photographing people it can tend to distort them a little so you have to watch that but the perspective I can get with this is awesome, I just love it. It's a very sharp lens and awesome focus and beautiful bokeh. Can't say enough good things!",
        "It's not sharpe at 1.8. It I use it for wedding group shot / reception or whatever wide and doesn't need a blurry background. It's sharpe from 2.8!",
        "I was looking for a lens that gave me clean wide view and was faster than most telephotos. This one is it. I just used for the first time this Saturday on one of my wedding shoots and fell in love with it. It has minimum distortion at the fringe, crisp and lite. This lens stayed on my cam (canon 40D) 80% of the shoot. I would highly recommend this lens to anyone who wants to have some prime lenses in their case. The other I would suggest is a 50mm. This lens produces beautiful boca and is fast.",
        "This lens takes so much light from almost any room condition, I often find myself underexposing my indoor shots. For outdoors, it simply does the right thing everytime when using the Evaluative metering mode. The wideness of the shot allows for a variety of composition approaches, viable for architecture, landscape and family shots that look good without having to keep an enormous distance between the camera and the subjects (which happens when using a 50 mm lens, for example).",
        "Perfect for APS sized Canon sensors (70D and such), to get a normal to slightly wider than normal perspective. If you have the ability to crop your shot images, this is excellent, since you can shoot wide and fix rotation or cropping later. The 1.8 lets in a lot of light, and is a wonderful replacement to my 25 year old cheap canon NON USM 2.8 28mm. That old lens is worthless compared with this new version.",
        "Probably it's just my copy, as Canon's cameras are generally excellent. I have a 50mm 1.4, an excellent lens (some would say this 28mm is excellent over the 50mm, and they are probably right). This one I ordered with some high expectation. Pictures are not as clear as my 50mm, has a good focal length though, which is mainly why I ordered, also based on good reviews. Construction is very good, feels and looks solid. I returned it, with a plan to buy the 35mm L lens.",
        "If you have a full frame camera and you are on a budget, this is a must have lens. The performance is very similar to the 50mm f/1.4 EF but you get a much wider shot. Get in close for stylized distortion and shallow depth of field in a portrait or still life or stay at a reasonable distance and enjoy excellent performance for the price with a head to toe shot or landscape.",
        "I found this lens to be adequately sharp at 1.8. Maybe not as sharp as a higher quality lens wide open, but pretty decent. It is soooo much better than the 28mm 2.8 ...",
        "I just recently purchased this lens. It's fantastic for shooting indoors where you want to use available light. Very nice bokeh, not as good as my 50mm 1.4 but still very happy with it! Great lens for a very good price. If you can't afford one of the wide angle L lenses or you are using a crop sensor body and want a \"normal\" prime this is definitely a good buy! Highly recommend!",
        "Thats it, just one word to describe it if your a professional photographer or a filmaker with a dslr. AMAZING! I got my lens in one week. amazing picture quality.. for any review that said they suck well theyre wrong because either they got a faulty lens, their camera sucks or they just plain dont know how to use this lens. so i'll say it again AMAZING LENS!!!",
        "I was going back and forth between the 50mm 1.4 and the 28mm 1.8, I shoot with a 7D and I'm glad I chose the 28mm. I think its a better walk-around prime than the 50mm. I shoot portraits with an 85mm 1.8 and its perfect for that but for all around use, this is the lens to get. I would recommend to a friend. I",
        "I have t5i (700d), and used this lens for everyday snap shot. Convert to FF, it is close to 45 mm. The photo is a bit soft when using f=1.8, but clear images were obtained with f=2.0 or 2.2 (good blur) Overall, the lens showed good performance.",
        "Love this lens, this is my go-to lens especially when I'm photographing weddings. It has wonderful auto focus for when you're trying to be quick. The manual focus is awesome for when you've got some time on your hands. Does pretty good in lowlight. If you want to get an affordable wide lens I would definitely recommend this one.",
        "This lens is awesome. I use it for night photography and the results are much better than I expected. I am not a professional photographer but I know what I like. The vendor shipped it fast, and no problems with packaging.",
        "This purchase was a replacement because my previous lens (same exact model) was lost/stolen. It works great on my Canon APS-C sized sensor, with a 44mm equivalent. If I could afford the IS on the newer 28mm lens, I would have bought that. But, considering the price of this lens is half of what it used to be, this lens is now a great value. This fast lens, at f/1.8, beats the standard zoom lens (f/3.5-5.6) in low light any day. Big difference.",
        "Lens shipped much faster than expected - much appreciated. Slight wear and tear on exterior of lens (it’s a used lens so that is expected) but the overall quality is much higher than I thought it would be.",
        "50mm and 28mm are my favorite lenses. This is a must have prime! I have been using this lens mostly over the last 2 years in Chicago, Dallas, San Fransisco, and LA. It has been more than worth its cost. Great for someone beginning also.",
        "Prime lens at 28mm, 50mm, and 85mm are a must for every photographer. and this lens at f1.8 gives break bokeh. Your next step up us the L lens of 28mm or 35mm. But at this price, this lens gives great clarity and is awesome for closeups. It works well for handheld videos because you don't have to be far away from your subject.",
        "Great pictures in lowlight great for indoor shots. I bought this lens to get ready for the holidays my 50 mm is too tight for shot of the family together. I brought it with me to Thanks Giving to really try it out and I got some beatuful shots of the table and of the family hanging out in the living room. With my 50 mm though I love it was just too tight for certain shots.",
        "I am very happy with lens. Fast autofocus, very good in low light photography and very good image quality for the price. Used for street photography on an Canon 7D Mark Ii.",
        "I was looking for a 1.6 crop equivalent to a standard 50mm angle. This works perfectly for that purpose, but also exceeds my expectations for clarity & brightness. Highly recommended,",
        "The feature I love most about this lens is oddly its build quality. This lens is built like a tank and compares quite nicely with any L lens. The image quality is on par with most prime lenses in its category. Low light is quite good, and you'll little to no distortion. The only complaint I have about this lens is that at 1.8 it does get quite soft.",
        "Purchased this to fill the position of everyday wide angle lens. Eventually I'll want to get the 16-35mm L series, but for now this does the job quite nicely. Additionally with the amount I saved buying this instead of the L series, I also picked up a 85mm prime, a collapsible diffuser, a B+W Grad ND filter, and 2 B+W UV filters (because i'm paranoid) for the same price.",
        "I got this for a trip to Ireland assuming that I would encounter a lot of places where I could not use a flash indoors, like churches and museums. I was right. Its about as good as you can get in low light situations without spending a mint. Very happy with this purchase.",
        "way better quality then the canon 20mm. like night and day. i use this lens as my workhorse for under water shoots. its wide, but not too wide to the point that it distorts the subject.",
        "Love this lens! I do a little portrait photography on the side, and this lens is perfect for my purposes! It works well in many different light settings and the pictures come out great. I will very rarely have to color correct anything I took with this lens once my pictures are uploaded. Very good purchase for me!",
        "Excellent lens for indoor photos. I use it a lot for close ups. It's fast and clean. I own mostly \"L\" lenses, but this one really takes nice pictures for a prime lens. Very happy with this as I use it was my Canon 7D.",
        "A little heavy, but a nice lens. Well made, it is my everyday perfected",
        "This lens is so much fun to use. The depth-of-field is spectacular as well as the high aperture. It took a little getting used to as far as the focus is concerned when shoot portraits but after I did the portraits came out spectacular.",
        "I bought this lens primarily for close-quarter portraits and general photography. I like the weight it adds to the camera(I know less weight is typically good, but it make my camera feel like a solid tool). Great for candid photography, and I am now using it for photographing my infants monthly pictures.",
        "i use a canon T3i and i simply love this lens. The build quality is something i was worried about but it is a very sturdy feeling metal body. I would and have already recommended this lens to other canon fiends.",
        "you will be really happy with this lens. I currently am using this lens on my Canon T1i. This 28MM lens is a 44.8MM lens on a crop-body. This is Canons widest prime lens that is reasonably priced for the photo enthusiast, for whom it has been marketed. The lens is very sharp between f4.0 and f8.0! Below f4.0 the lens softens, as they all due. However, it softens much less so than other lenses I have tried. The results are very good from f2.0 up.",
        "Bought this lens for a Canon 60D and it is great for all around shooting as it acts like a 50mm on a cropped sensor. Produces crisp images and is great for portraits! Awesome lens!",
        "After reviewing on multiple sites, I was a little hesitant to purchase because they were saying it is not that wide. This is true, but I was using the 28mm to get close to a normal lens of 45-50mm which this goes great. I like the speed of the 1.8 aperature as well as the broken it produces. The USM focus is quit and quick and works well with my 50D and 60D. It is my favorite lens and shoot 90% of the time because of the background blur as well as being an ideal walk around lens. Trying to do less with zoom also I am using this with the Canon 85mm 1.8 so I have most situations covered.",
        "I have a Canon EOS Rebel XT, and I have a number of lenses for it, but I use my 28mm f/1.8 mostly for low light conditions! It works great in low light without flash, as long as there is no quick movement! I recently attended a banquet and went around the room and took candid shots of everyone, without flash, and they all turned out great. I took a group shot of everyone and had to stitch the two shots together, and even that worked fairly well. I recommend this lens highly, but you can expect a shallow depth of field in low light, so your focus has to be right on.",
        "This lens far exceeded my expectations! The images are super sharp with a gorgeous bokeh. Works great in low light conditions. I mostly use manual focus, but the automatic is fast and despite what some say... quiet. The lens has a heavier, solid feel. I was looking for a wide angle lens with a high aperture, and this is perfect! The color is amazing, even before white balance is set. I would definitely recommend... I can't believe this isn't an L lens!",
        "So far i really like the lens for my crop sensor 7D camera-- its perfect for the indoor shots --- Have not played with it too much but its a def winer so far",
        "i have had this lens for well over a year since i bought it from here. i still use it about 70% of the time along with my 85mm f1.8 and 135mm f2. its a great length for indoors and the 1.8 aperture helps with indoor shutter speeds. has a short minimum focus distance, lets you take close ups of food and small objects. few cons i can think of are the edge sharpness is a little soft and it tends to back focus sometimes.",
        "It is a great prime lens. The angle is not too wide and too narrow.",
        "I use this lens with my canon 6d and the images are very nice. Fast lens and images clear in low light",
        "I am so happy I picked this up. I have the 50 1.4 and that is an awesome lens too, but this one has a great focal length for crop bodies. I use in a water housing to shoot surf, really happy with every result.",
        "I am super pleased with this purchase. I orginally bought this to replace my wide angle zoom lens. Since I have received this item it has not left my camera body. I am happy with the images. It performs great in low light. I cannot say enough great things about how wonderful this item is for the price.",
        "Excellent lens for anyone wanting to take detailed pictures indoors without a flash.",
        "Love the lens. Used it with my rebel and the picture looks great especially when taking indoor picture. Never disappointed.",
        "Love it ... great lens for portraits on tighter budget.",
        "I use this lens for portraits on my 60D and 70D. It has not failed to produce quality images in all situations.",
        "Order came in a timely manner and my photographer son loves this new lense.",
        "Great travel lens; light, wide-angle, and sharp. Very good value lens.",
        "Beautiful indoor shots! Very nice clarity, very similar to the 50mm.",
        "A very good lens from canon, comparing to the price... the built quality is good, focus is great and u can easily shoot on f1.8",
        "This is a great lens. With its F/1.8 USM it is wonderful for indoor evening parties in low light. The pictures came out from this lens without flash looks very nice. No harsh and no shadow. The lens is very solidly built and will last for a long time to come.",
        "Awesome lens. Previously owned the 50mm 1.8 and I must say I use this lens more often now. Allows a nice distance for a good shot.",
        "Great price point, Fast lens, great image quality! It's my main lens now, and I rarely change it out! Great buy!",
        "So far I am in love with this lens! It does well up close and opens up all the way to F1.8! This will quickly become one of my favorites, especially for those interesting wedding and landscape shots!",
        "A life saver in small, cramped rooms or when shooting large groups. Excellent in low lighting. I still have some focus issues, but that's to be expected with prime lenses from what I've read.",
        "Don't have much to say. Very good lens, good quality. I've being using it for sky shooting at night, and it does the job.",
        "A little bit heavier than expected, but great lens! Love it! Sharp and very high end photos",
        "I love this thing, i use it on my markiii for beautiful wide angle shot, and it is just perfect on my 60d for a walk around! seriously! and the pictures are great, I am happy i got this !",
        "I like this lens a lot. I use it most f the time when I run around with my camera and for portraits of more than one person. Also if I shoot in a small space this lens gives me enough room to shoot the portrait where the 50mm would cut of things. I am very pleased with the buy and would recommend this product to anybody who wants to spend this kind of money.",
        "Excelent product. it's a good wide angle lens, fast, sharp, great for video",
        "This lens is great for an amateur photographer. You can take pictures in dim lighting without flash. I would highly recommend this lens.",
        "For a prime lens and night shots, this champ performs great.",
        "I bought this lens to do large amounts of people in groups such as sports teams or people sitting in stands. It's exactly what I wanted. I did research what I needed first. Then went for this lens",
        "I love prime lens, but I don't use a 28mm enough to justify the price of a Lseries in a similar mm but the depth of field and the sharpness of this lens and the photo quality of this lens is very close in comparison of some of my primes in the L series I am very VERY pleased with this lens for the price. HIGHLY recommend this lens",
        "This lens is almost a perfect 50mm equivalent for my 1.6x SLR. The large aperture is incredibly fast and allows great indoor shooting in low light. Beware that using a UV Haze Filter causes glare across the lens. It's almost unusable with the filter on.",
        "A great lens for the money. A definite need for a photographer on a budget looking to expand their gear.",
        "The 50mm prime is too focused in and narrow. I opted to try out the 35mm and found that to be better but still to narrow, so I bought this lens. The reviews scared me a little because people said that this lens doesnt focus as well as the 35mm and they noticed blur on the outer frame. Ive owned both lenses for a few months now and can attest that this camera shoots exactly the same if not better because of the F1.8 vs the F2.0 on the 35mm. Its a solid built lens and the wide angle is perfect for a non-full frame camera. I def enjoy this lens. Id recommend it to anyone.",
        "Great lens. I do a lot of videography and it works for great. It's a nice hybrid between my 10-20 wide angle and 50mm. Great for both A and B roll. From the few pictures I have taken, it is both clear and crisp. Highly recommend.",
        "My brother likes it because it is useful both inside and outside. Bright enough to take a photo of baby indoor and wide enough to take a landscape scenery.",
        "I was looking for a reasonable wide angle for my 40d. Thus lens is great and very quiet. The images it creates are beautiful and very colorful.",
        "Perfect for large groups with minimum distortion. I would recommend ... be careful when shooting close because distortion of noses is always a problem when using a wide angle",
        "Very good lens. Not the best one Canon offers but does exactly what I needed. I considered buying Canons 24mm 1.4 L for about a year but could not justify the price. I could buy three of these for the price of the 24mm. All i wanted was a good low light, fast, lens to take candid shots with out the crappy flash on the camera. The images are great. Actually converts to about a 44mm film lens on my DSLR. No regrets.",
        "This quickly has become my favorite lens. See ya later 50mm (although don't go too far, I still love you). This lens is great for it's size, what it captures, and how it handles low light situations! Thank you Canon for creating an affordable sister to the 50mm.",
        "Just an overall phenomenal lens. As a videographer, I assign my second shooter to this lens for gorgeous wides with shallow D.O.F. at a reasonable price. Just a beautiful piece of glass. Every photographer should have one in their quiver.",
        "This lens is amazing, I use it for almost all my shoots, walking outside, inside, everywhere. It's a high quality lens. I would buy it over and over again.",
        "I purchased this for real estate listing photos. Finally I am able to get the whole room in the shot.",
        "Love my new 28mm 1.8! Already got some amazing shots of New York and Sedona with it!",
        "Came in with no problem and had a few tests. Can't complain :)",
        "Great general purpose lens. I use it for indoor shots as well as outdoor, and is a good workhorse.",
        "Fast shipping and a very good lens. It's small, light and does a great job with wide angle shots. Worth the money.",
        "I tried this lens on a Canon 5D and while the images had great color and resolution, there were soft areas at the sides. I suspect this lens is much better on a camera that is not a full frame sensor.",
        "Just proves you don't have to spend upwards of 1000 to get some good quality gear. I'm using this for my steadicam so I don't need anything even close to a 1.8 so this lens works great for me.",
        "the look of it is grand, I will get out this weekend to use it, my expectations are high, so, if there is the slightest malf or irregularity with focus I will be sure to inform the listening/purchasing world the exact problem.",
        "great product ... but i returned because i changed my mind... i would have to be switching lens too much when using this one.",
        "I love this lens. I'm a professional photographer, and during photoshoots I never take it off my camera. the 28 on a full frame sensor is amazing. it works great, i love it."
    ]
}