{
    "entity": "SLR Camera Lenses",
    "text": [
        "This is truly a 'unicorn' lens as others have testified. I've used a bunch of dedicated portrait prime lenses, usually in the 85 to 100mm range, but this one is the best so far. Tack sharp, brilliant color, gorgeously round bokeh. Yes, it's a heavy monster -- definitely not a 'walk around' lens like my trusty 24-70mm -- but it's the 'big gun' you break out when doing somebody's headshot in a studio. I've attached a couple sample photos (including a self-portrait) done on my Alpha 7 II camera (attached via the EAL4 adapter to this lens).",
        "This is my go-to lens on my Sony a68. This Zeiss lens is super-sharp and with the built in camera stabilization I can use it handheld in surprisingly low light. I use it just about everywhere in every situation especially for portrait work. Also I like using it for astrophotography. BTW I recommend to get the Hoya 77mm HD3 UV Filter to protect the lens. I wish it would have have weather sealing.",
        "I'm in love with this lens. I use it for my sony a99 II and I'm an equine photographer so I need to have a long focal length. I have a 70-200mm too but I hate how heavy it is. This lens is PERFECT",
        "I've used this lens with a Sony A99 and the results are breathtaking. The lens remains tack sharp even at F1.8 while the background is creamy and beautifully diffused. The bokeh balls from background lights look just beautiful.",
        "I have been using this lens for a couple of months. It is the best lens that I have owned. I use it with my Sony a65. As an amateur I have been learning my craft and this lens has made a huge difference. There are plenty of reviews on the technical side, so I wanted to express the fact that this lens will up anyone's game and provide beautiful images.",
        "This lens is the pinnacle of technology and optical quality for portrait artists. Though a bit on the heavy side for use on mirrorless A7R but I have not taken this lens off my camera ever since i received it. Images are rendered beautifully and the bokeh at f/1.8 is amazing. The image center is very sharp when used wide open and creates incredible pictures.",
        "Very creamy bokeh, very sharp from f1.8, not a speed king when it comes to focus speed, but the image quality is top notch. Colors and microcontrast are typical Zeiss!",
        "Very sharp and quick autofocus! Well built, feel comfortable on hands.",
        "I bought this lens after renting it first. It is fast, colors are extremely accurate, and its tack sharp. It has become my favorite lens.",
        "It is all true, this lens performs with all the characteristics that you have already read about, now you have to see for yourself.",
        "This lens just arrived so I popped it onto my Sony A99II and snapped some sample pics which I'll upload as part of this review. First impressions: stunning images, somewhat heavy lens (which I do not mind as weight often comes with quality) that sports overall gorgeous lens aesthetics. Photos taken in compressed RAW, touched up lightly in Lightroom, and exported to JPG. UPDATE: 11/2017 Having used this lens alongside several other Sony and Sigma A-Mount lenses for the past nine months now, I can affirm that the Sony SAL-135F18Z continues to be a stunner which provides incredibly bright, clear images. This is my go-to lens for photos and video when visiting the local arboretum.",
        "Surpassed my expectation. I love everything about this lens. I love it so much, I bought the 24-70mm and planning on getting the entire Sony Carl Zeiss collection.",
        "Best lens i've ever owned in the past 6 years!!!",
        "Have been looking at this lense for a while and decided to purchase. We use it mostly for our children in dance competitions and pageants. It is a fantastic lense.",
        "Not much else I can say that others haven't, it's a fantastic lens. Not a negative point about it, but something to keep in mind is that 135mm isn't at all wide-angle. You really need to be prepared to move back physically to get the desired shot.",
        "You can't go wrong with this piece of glass. The bokeh is incredible. Every picture I take with this lens comes out perfect. It has a high price tag but you get what you pay for. This is the best glass in my collection. Only trouble is the weight. It takes the best pictures on a tripod. Very heavy lens.",
        "This is my favorite lens to shoot with on my FS7 cinema camera. Problem is that it looks so good I can't mix the footage with other \"less awesome\" lenses. Solution: I'm buying the rest of this Sony Zeiss A-Mount prime family.",
        "Sony's Zeiss Sonnar 135mm/1.8 lens is sharp and fast. It's simply a beautiful lens. When paired with the built-in sensor stabilization in the Sony a900 and a700 cameras it's perfect for hand-held low light photography. Not only is this lens faster than Canon and Nikon lenses in this focal length, it's sharper and built like a Swiss-watch. It joins the Sony 85mm f1.4 lens <a href=\"\">Sony SAL-85F14Z 85mm f1.4 Carl Zeiss Planar T Coated Telephoto Lens for Sony Alpha Digital SLR Camera</a>",
        "I am astonished by this lens, as well as its sibling the Sony 85mm f1.4 lens. Each lens is razor sharp at its widest aperture. An excellent discussion of this lens may be found at the Photozone web site.",
        "Hands down, my favorite lens! It is simply amazing, and I love the images on both the A99 and A77. This is my go-to lens for portraits, low-light settings, and action shots. Bokeh is outstanding. Also have the 85mm Zeiss, and the 135mm is by far superior. Brighter colors, crisper, sharper, than anything else I've seen for Sony. Generally regarded as the best lens that Sony makes, and I totally agree."
    ]
}