{
    "entity": "SLR Camera Lenses",
    "text": [
        "At 28mm its not as sharp as i would've expected it to be(a bit soft, but still great a shot)...you'll have to go low on the f stops to get a sharp image. At 50mm-80mm you'll get sharp shots at almost all f stops. Its girthy, so it looks good on the camera, but its all plastic built. Comes with a 1/2'' hood. I used this as my everyday everywhere lens. Not too worried about it getting damaged. For the price its a great all around lens. Of course there are better lens out there, but for the price this beats them out. I would recommend to others.",
        "I bought this to replace my 7yr old SMC 28-80 lens that just jammed up one day when I really needed it. The Tamron lens is good, autofocuses quite fast and feels well built. I have found that a 28-80 lens is the absolute best balance you can get for 90% of all your photos which is why it's on my camera almost all the time. Basically, this lens works, it's incredible value and the color reproduction doesn't have the tint that my old SMC lens had (which gave the same tint as using Kodak Royal Gold film). As a result of this purchase I'll probably buy another Tamron lens in the future when I want a telephoto lens.",
        "This is what it is, which is why I gave it 4 stars. It's not a professional lens, but it works perfect for everyday amateur use. Nice focal range 28-80 (equivalent 42-120). Reasonable for anything indoors or fairly close, works as a portrait lens and does well with landscapes and architecture. Great general usage lens and compact as well. The price is really remarkable. I have 8 lenses and this one gets the most use. I have it mounted to a Pentax K20D",
        "Mediocre is the best way to describe this lens...it does everything ok...but nothing great. It's soft at f/3.5 and also at f/18+...it's best used in the middle around f/11. For a cheap lens it's acceptable, but don't be fooled by 4 or 5 star ratings...you shouldn't expect the same result that you will get with a high end lens.",
        "I received this lens two years ago. I use this lens often. Works great with my Pentax D20. It was well worth the price. Product shipped promptly. Wouldn't hesitate to do business with vendor again.",
        "Got this lens fairly quickly. Takes great pictures and easy to us. Great for regular shots landscapes etc. Good quality all-around camera lens.",
        "It is really a bargain. The lens is ok, it lacks on a better wide angle end, poor zoom. The pictures it takes are not professional. But colors, sharpness are ok. Best match for short budgets, when you choose Pentax k-01 body.",
        "Fantastic lens at an incredible price! This is really an unbeatable combination. Very sharp lens with good color rendition; an excellent all around lens.",
        "I use this lens on a Pentax Digital and my old ME Super film camera. After purchasing this for the digital I noticed it had the f stop settings so I put it on the ME Super and it works fine in manual mode. The price was right so I got one for each camera.",
        "The lens is a general use lens. For the money you can't go wrong. The lens is pretty good for portraits and landscape. Works well for close ups as well.",
        "Good lens. Good price. It was shipped quickly. I use it as my \"walkabout\" lens",
        "A good walk around lens for outdoor shoots. AF is a little bit slow. A good buy for its price.",
        "This is a good all purpose lens for general use. I'd recommend for someone who just need a basic lens and doesn't have much money to spend."
    ]
}