{
    "entity": "SLR Camera Lenses",
    "text": [
        "My autofocus stopped working in less than a year. There was no way I could find to contact the seller for the warranty information, so I contacted Tamron. Here is there reply : \"Unfortunately, Amazon Export Sales LLC is not an authorized seller for Tamron in Canada and therefore you lens is not eligible for warranty or non-warranty repairs\". Get what you pay for I guess, but I expected it to last more than a few months.",
        "This has been a workhorse lens; especially like the telephoto macro function. Unfortunately, after 7 months it started getting an error saying the contacts were dirty. Canon T6i. The contacts were clean, all other lenses worked fine. It's on its way to warranty repairs, but you can't get better than 3 stars if you didn't put in the quality. Update: Props for Tamron warranty repair service. They turned it around in a week. Shipping to the depot was at my expense, though.",
        "This lens slid under my radar for a long time. How did I not know about this? I have two Canon lens (85mm and a 50mm) both manufactured by Canon. I needed something that I could focus from a greater length and this was it. I ordered a 70-200mm from Canon and it was just too heavy. I don't regret getting a Tamron instead of a Canon at all. The lens is solid and built just as well. I used it for the first time last week at a church fair outdoors. It was amazing. Picture quality was awesome. I never had to switch lens and it felt amazing!",
        "To be honest I am using this lens on a adapter for Sony mirrorless system, so my review may be less helpful. The camera works well, but it’s Autofocus is a bit off at 200mm and up. I recommend to do manual focus with peaking on. The value for a 70-300mm lens is amazing as the Sony native lenses are just too expensive. I am glad I went this route as it’s perfect what I need and the image quality is good.",
        "This lens looks good on paper but reality is quite different. It is noisy and slow, which I did not bother me, however when used for astrophotography it is almost useless. The focal ring is very loose and slips. There is a noticeable lens creep when pointed upward. Probably a great lens for everything NOT star related.",
        "I bought this from Amazon expecting an original Tamron product. The lens quit working and I contacted Tamron and turns out it is gray market. Be careful what you order, since it has been over a year Amazon will not help and I am stuck with a worthless lens.",
        "I do not like how slow this lens is, seems it should do a better job. It takes nice clear shots but it is not meant for fast moving sports. I am just not impressed with the quality of this lens. I do like the lightweight, less expensive part of the lens. Used with a Canon XTi",
        "As others have said the AF is not the greatest but for the price I figured I would still give it a go. I didn't use the AF at all. Manual works just fine and I got these pictures and a lot more.",
        "Great lens for the price. This lens really reaches out there. I was impressed with the clarity for such a low price. Other reviews were correct in stating the autofocus is problematic in less than bright light. A little practice with manual focus, however quickly overcomes this. I use it for low-light video surveillance investigative work and I am very pleased with it so far. Coupped with a Canon DSLR at 6400 ISO it gathers light just fine as long as you can hold it steady enough. Someday I'll be able to afford prime glass for my camera, but until then this does the job very well.",
        "Great lens provided you dont need repair. I love this lens however the macro/normal button froze and then something broke off inside. The zoom is now completely broken and they want me to pay for shipping to and from to get warranty work done. Pros: Great lens very responsive clear picture Cons: there is a lot of plastic on the inner workings that are prone to breaking The warranty process is very obtuse and cumbersome",
        "Does not have stablization but i still got great pics. Not as bright as i would like, but great for the price. Used on my Canon t6.",
        "Looking for an alternative to over priced O.M. glass? Take a close look at Tamron lenses. I was hesitant, did my homework, then took a shot. More than happy I did, you will be too. Define your needs, do the research, check the products available, then pick a lens right for you. These better Tamron lenses beat the kit lenses the camera people throw out there every time.",
        "It is a great lens. Other reviews said it was too heavy. To expect blur since you can't hand hold it steady. Hog wash. It would be nice to have a tripod or a mono pod. Just not necessary. I took some nice shots of sand sculptures on the beach. Very nice. I took a photo of the moon. Not too shabby. I now need to sell my, no longer needed, Canon 70 to 200 zoom lens. That should off set the cost a bit more. It may not be the fasted lens out there, but it's a great bargain!",
        "This is my second Tamron lens. The glass is descently fast and good quality. The lens body is light yet solidly built. The picture quality is really good, yes it gets a little soft at the extreme zoom but not terribly so. Focus is a little on the slow side so keep that in mind when needing switch ranges quickly (such as for sporting events). I highly recommend this lens for anyone needing the reach of the 300mm zoom and don't have a lot of money to spend. This is a steal at the price and you are getting a good quality lens. It comes with a lens hood, and a 6 year warrantly on the craftmanship.",
        "I shoot action shots for high school athletic events. Unbelievable clarity and gives me the ability to capture the expressions on the faces of the competitors in real time. Love this lens!",
        "Great lens for the money! As others have noted, it is good wide open, but really sharp stopped down to f/8. Also not very heavy--which is nice. Auto-focus works very well but isn't as fast as some lenses.",
        "This lens will not focus at any range beyond about 100mm. Try to focus...and it wont, either manually or autofocus. Built cheaply as well. Should have known better. First time I have ever bought a cheap lens. As they say...you get what you pay for. Well, this one I really did get what I paid for. I cannot recommend this to anyone. And yes...I have used Canon EOS cameras and lenses for 25 years or so. I had one of their first EOS-1 film cameras. And more since. So I do have plenty of experience with cameras and lenses of this type.",
        "The motor inside has failed. The motor is not communicating with the camera. Error 99.",
        "the warranty alone should attract your attention. 6 years versus 1 for the same Canon product. Lens is great at what it can do. Understand that, just like Canon's similar product, this is the Dodge Neon of lenses. It gets you from point A to B but dont expect the 100 disk cd changer with it. Its your basic 70-300 lens. Its not as fast as a similar $700 model , but it still does a beautiful job. Basic to semi-pro photographers should consider this beauty.",
        "Got the product as promised! Arrived days ealier than expected. The packaging was superb... Ive been using this lens for months now but never failed me... I'm just an amateur photographer, and using them almost everyday, giving me crisp pictures even from a long distance... I'm truly amazed by this product considering that it is also inexpensive. Believe me, you will get what you are asking for... I will buy another product from Tamron thru this seller again one of these days! Thanks!",
        "Now I'm an amateur photographer, so I don't know much about lenses and everything, but I can tell what a good picture looks like, and this, for us, has taken many great pictures. Even fully zoomed in, pictures come out wonderful. Compared to the price for the Canon lens, this is quite a bit cheaper, but not cheap at all. We were actually surprised how heavy this lens is, especially compared to the kit lens that came with the Canon Rebel XT we purchased. I'd highly recommend this for those wanting longer distance, but also wanting to save some money.",
        "Fit and finish seemed good. Slightly slow to focus on a Canon T5i, which made it less than useful for sports photography. Ended up returning due to soft images.",
        "I was having a great time with my new lens.... loved the macro feature, but it has stopped working correctly. I'm not in an area with convenient places to go for repair, I'm still looking. Not sure who to look to for returning if that's the option I have to take. I love the lens so I need to find a place to get it repaired.",
        "Save your money and buy a higher quality zoom lens like the 70-200 2.8. This lens produces terrible quality pictures.",
        "Works great. Autofocus works fine as well as the macro settings.",
        "Fantastic lens for what is designed for. I've used the lens for a very short periods, but so far photos are clear because of ease of focus, manually or auto focus. For a large lens the macro is great. Lens is lightweight for it's large physical size. Except for wide angle shooting, it's my primary lens.",
        "Bught this lens sold my camera with it, bught another camera the first thing i did was buy this lens a second time!",
        "These things would have been nice but even without I'm still fairly happy with this lens and you'll have a hard time beating the price. Likes: + Includes hood + 2:1 macro mode + 70-300mm is a lotta zoom + Makes your camera look pretty cool + $150 Dislikes: - No VR (Vibration Reduction) as advertised in description - No USM. The focus is sorta slow and loud. - Blue/purple fringe (when viewing @ 100%) - Not so sharp below f7.0 - Not constant aperture - Front rotates when focusing and zooming",
        "This is one of my most-liked buys recently. Nice, well constructed, non heavy and easy to use lens. I'm really hooked up to Tamron lenses. The macro function is awesome. It's true that being near the 300 mm, it turns a little soft, but I can tell you this, if you provide or find to your subject better light conditions you can get the right desired picture avoiding this \"softness\". There is not \"the perfect\" lens anywhere.Some say the AF is noisy, I like when it zooms like that, this way I know it is working properly. It doesn't bother me at all.",
        "This lens is worth the price, the IF is noisy but does not bother me. Its a bit bulkier than the sigma 70-300mm and heavier which i like. feels better in the hands, very solid. IQ i think is better than the sigma, although i love sigma lenses. the AF does hunt which can be a problem. macro 1:2 is great, tripod a must unless shooting at 1/250 or above. i am happy with this lens for what it cost. I recommend this lens and would buy from tamron again.",
        "Works well. Slight lag in autofocus, but not a major issue. Photo turned out great.",
        "The auto focus consistently takes a very long time and because there is no image stabilization, most photos shot are unusable because of shaking. The photos that come out of camera are generally very soft and there is a substantial amount of chromatic aberration.",
        "I paid $140 through amazon for this thing. To be frank I bought it thinking it might be only temporary while I can save enough $$$ for a \"real telezoom\". Well, I might say that I might not buy another one for a while!!!! For the price, this Tamron takes excellent pictures even at full telephoto. On a cloudy day I got consistent 1/500 or faster shutter speeds spotting planes at the airport. My photos came out crisp. I love this lens!!!!!",
        "The is a good intro to photography lense. It's probably the cheapest 70-300 you can find, and it does well enough. It comes with a lense cap, so i don't know why people are buying an extra lense cap. If you are planning on taking sports photography, then you might want to get a different lense, one with image stabilization. But if you are new to the digital photography realm, and you want to increase your arsenal of lenses, and you don't want to break the bank. Go with this one.",
        "I ordered this lens to pair with my wifes XSI and my T3I,I wanted something other then the kit lenses, that would provide the ability to reach out and shoot photos from a distance, I'm very pleased with it. The reaction time is acceptable, and it takes nice shots. I will definitely look at Tamron for more lenses in the future.",
        "Great lens for the price. Pros: Great pictures up to about 280, the included hood worked great and made the pictures look much better, fits great in my bag Cons: Was a little noisy on AF (not disturbing though), the lens is a little tight to turn to extend and you feel like you almost have to force it before it zoom's hopefully this will get better, the AF did not always work correctly at 300 but once it did it took good pictures. For the price you can't beat this lens!",
        "Love this lens. It’s cost effective as I was replacing the same size but cannon brand. I actually like this one better.",
        "This is my first lens outside of the standard kit lens so I’ll admit i don’t have much to compare it to. However I did a ton of research before making this purchase and couldn’t be happier with the quality given the price. Great purchase",
        "Love my macro lens. Close ups and distance. Love taking pictures at my grandson’s football games with this lens. No complaints at all.",
        "The lens takes great pictures, clear and sharp even zoomed all the way out. I take mostly nature shots and feel the lens is a little slow to auto-focus and very noisy. I never used the Macro setting so I cannot comment on that. I did end up returning it for a different lens.",
        "Absolutely love this lens. Gets me in so much closer than the lens that came with camera. Camera goes everywhere with me and this is my dominant lens.",
        "What a great lens for the money! For that matter, a great lens period! A lens like this for under $150 is an extremely good bargain! A tri-pod is a must since you will definitely have to have something to stabilize any movements. I am pleased with the lens and it also has a 6 year guarantee! Tamron continues to improve their product line! \\ Al Marth lsudad@dejazzd.com",
        "Overall it's okay, but If I could do it again I would go for the canon 70-200L for a few more bucks. The tamron has okay picture quality, but is very tough to operate in dim or dark shooting. Also the motor is very loud and the distortion can be bad, or rather hard to predict. While shooting outdoors under good lighting it's a fantastic value.",
        "Good lens for the money. It is not stabilized but in good light it works well. The Macro setting is great for close up with out having to get close up, as some pictures are missed because the subjects fly or run away. I got some great shots of some of our cats and our dog using it. With a tripod or resting on something solid the lens can get you some great shots. When you win the lottery you could then maybe spring for a white Canon stabilized, but to start off this lens works very good.",
        "I have been using this lens for about a month in preparation for a vacation in Australia. The lens worked very well in taking action shots of Surfing, and birds in flight, although image stabilization would make them a bit clearer. I have followed the recommendations about stopping the lens to F/8 and have not had any trouble with blurry images. Great lens for the Price.",
        "Nice sharp lens for the money. I brought one in England for a pentax and it cost 3 times as much as they do here in the US.",
        "I bought this lense 2 weeks ago and its a brilliant addition to my Canon 1100D as I now can take some long distance photo's and its also excellent value for money at less than half the price of a Canon lense and it has the same features only a different name.",
        "Got it for my dad for Xmas and he never leaves home without it. Says he feels super professional with it on his slr",
        "The Tamron AF70-300mm F/4-5.6 Di LD lens is a fantastic addition to any photography collection. Very well built lens with a very nice USA 6 year warranty. One of the best 70-300mm around for the price. A VERY good starting lens! Pros: Cheap Price, Macro, Good Quality , Nice Warrenty, Free Lens hood. Cons: Slow auto focus, can be a bit odd switching to macro.",
        "Bought this for my daughter who is 14 for her birthday and is really into photography. She loves this lens! I've seen some of the pictures that she's taken at soccer and baseball games and I have to say...I'm impressed. The pictures are sharp and from the bleachers she gets pretty close up. I can't offer lots of technical information but I like the results. My goal was to get her a good lens at an affordable price. If she outgrows it's capabilities as she gets more advanced I won't be too upset about it.",
        "Tamron Auto Focus 70-300mm f/4.0-5.6 Di LD... works great I would recommend it I would purchase this len again.",
        "I am a mom of 2 small boys and I own a Canon 60D. I own Canon lenses and I know that name brand can sometimes mean a better product. I only own this one lens by Tamron, so far, but believe me I intent to buy many more! The clarity on this lens is just like WOW and the Macro really delivers. I paid 129 bucks for this lens and I feel like I got more than I paid for!! I am so happy with this lens I am selling my canon 70-300 because I just dont need it anymore. thank you Tamron! I look forward to my next purchase!",
        "With a 70-300mm focus length range and the fast focus ability, I think this lens worths its price definitely. It is able to focus quickly, even for catching a flying aircraft. The image quality is okay for 70-270mm. The sharpness around 300mm decreases quickly. The color of this lens is okay, but may be not able to say 'good'. Overall, it worths its price, or even more. But you can't expect that it will give you nice pictures as good as those L lens will give you.",
        "Great buy. When my canon 200 mm telephoto had the dreaded error 99. It would cost $200 to fix it. This lens is a 300mm with macro capability for much less money. A no brainier.",
        "This lens broke inside my camera. But, customer service was good and understanding.",
        "Had issues the first time I got this product but Amazon returned it without issue.",
        "Works great for the price. Still learning how to use it.",
        "This has been a great lens for my Sony camera. I have enjoyed using it to learn more about my camera. It has very good quality! With such zoom, I have had to learn now to hold the camera steady, and often use a tripod, but I have enjoyed every moment of it!",
        "Love this lens! Plenty of zoom, macro shots are amazing, the DOF is great! I love this lens! The motors are a little noisy but its for photos, not video, so I don't mind it at all. Extremely happy with the quality of photos I have been taking and the price was great!",
        "Just like advertised. Can't beat the price I got it for. Well done.",
        "Amazing!! Does everything I want it and need it to do!! Don’t waste your money on name brand, when this is equally as good!",
        "Bought this as a Christmas present. Fit camera like a charm. Takes great pictures.",
        "I'm using this Tamron lens on my new Canon 5D MKIII, it works great and the price is amazing. I've been taking pictures of little lizards and birds flying over head with it and could not be happier. I've even used it with the Tamron 1.4x tele extender and the camera will still auto focus with that set up. The pictures are sharp, the mechanisms feel good in use and it feels like a Canon high quality product even though it's not. Did I mention the price? Amazing quality for such a tiny purchase price. This lens worked so well I've purchased some other Tamron products and have been quite satisfied.",
        "From other reviews I expected this lens to be a decent lens but was super surprised when I used this lens. The 1:2 Marco feature is great. Understandably it isnt true 1:1 macro but even so it preforms great. *See my picture of Buddha* It is a tad bit plasticy but on on Xti it feels good, and I always love the way Tamron lens look once on the camera. Nice thick lens hood comes in the box. Only down side is no VC (IS in Canon lens)so I am always shooting 1/200 sec and up when hand held which can be limiting, but what can you expect for 130.00? This lens is great and much more then I expected.",
        "Let's not forget that this is a low-cost lens. At the same time, it delivers a nice tele-zoom with macro capability (make sure you read the manual, or you will never get back OUT of macro mode!!!). It \"does what it says on the tin\", even though it is easy to note that the picture can be a little soft, there is quite marked CA, and the autofocus labors somewhat. Construction seems solid enough, and with the included hood I would say that this does give a good value (although I haven't had the chance to compare it with the similar offerings from Sigma and Canon).",
        "I had an older model 70-250 Tamron that worked quite well for me before ALL of my camera equipment was stolen. In first inspection of this lens, and figuring out how to operate the new Macro addition, I can't wait for my new camera to arrive tomorrow to test out ALL the possibilities of this lens! I'll keep you informed once I get the chance to shoot!",
        "Great Lens only thing I wish I would have purchased the VC model because I use this lens alot...but for the price you cant go wrong.",
        "I got this lens and an affordable alternative to the Canon zoom lens. I could not be happier with my purchase! This lens is a true workhorse and provides excellent quality and ease of use. Minimal learning is required and I would HIGHLY recommend this lens to any beginning to semi-pro photographer out there. I will be looking at additional Tamron lenses for camera.",
        "I have been useing this lense now for 2 years, and it has surpassed my wildest expectations. Great photos, And you won't find another with the MACRO capabilities for the cost anyplace. I highly recomend this lens.",
        "Could be a little sharper but great for the price. I am very happy considering the canon version of this would be much more expensive. Im only using it for the macro setting and for that the price is awesome!",
        "I am somewhat new to DSLR photography and wanted to purchase a lens to photograph my son surfing. The AF is a bit slow, but you quickly learn how have the focus ready for the shot. I am extremely please with the quality of the photos taken both on sunny and cloudy days. I took over 1300 pictures this summer on a windy/sandy beach and the lens performed better than expected. It is perfect for the price.",
        "sadly it locks up at times that you have to turn your camera off and take the lens off then put it back on multiple times. The pictures are great though!",
        "Nice lens. Haven't had a whole lot of time to play with it. So far so good",
        "For the price this is a good lens. For getting quality shots of wildlife it is not. The macro feature works well, however, distance photography with this lens and you can expect to photograph plenty of noise.",
        "I've owned this lens for roughly two months and although it's not a practical lens I would normally keep on my Rebel XTI as a carry-around lens, it's very sharp and performs extremely well in mid to long range shooting. I've never tried the Canon EF 75-300mm f/4-5.6 III USM, but the lower price and the macro function helped me make up my mind and buy this lens instead. AF is fast and comparable to the USM on my Canon lenses. So far I haven't regretted my decision.",
        "This lens works great. The photo's are fantastic. This lens is the best bang for the buck out there.I am not a pro photo person but have talken alot of photo's.",
        "this lens is very good , i got very sharp images during my recent trip to yellow stone national park. I enjoyed taking pictures !! I also liked the macro features of this lsns. But its not a low light lens , but this lens also does not have IS !!! so tripod with a remote is must if you have a low light condition. I would recommend this lens but if you are doing low light photography go for a bit more expensive lens with IS !!",
        "Great lens for the price!! The macro setting option is a plus!",
        "Great lens for the price, im just starting out and this lens does everything I thought it would do.",
        "For the money this is a nice lens. It takes good pictures. However, I was a little dissappointed in the movement of the lens. When rotating for focas or to zoom adjustments, the action is slow, tight, and deliberate. Also, I need to take some more pictures. Because what I am seeing in the lens finder does not seem to be as clear and focused on the final picture itself. It is nice to have the six year warranty. I am probably going to keep the lens, but I have to amit, I was hoping for something a bit better. Maybe I should have stuck with a Canon lens.",
        "the lens has been serving me well so far. It's not as sharp as my other Tamron 2.8 lens but still renders an image that I like.",
        "I purchased this for my Canon t2i and its working perfectly, quality is nice, it has a Stabilization sensor when you are zoomed in at 300mm , it does take a while to focus and it's nosy, but hey for the price it gets the job done, i recommend this for anybody who is beginner or if you just don't want to spend big bucks on a zoom lens.",
        "You can't beak the price and you can't beat the quality.",
        "Bought this lens for my Canon Digital Rebel XTi. Works very well and generally happy with it. It is NOT an IS lens so low light shots or tight zoom photography defininitely requires a tripod. Very good results in bright daylight but if you don't have a rock solid steady hand you might want to consider an IS lens.",
        "I'm brand new to the photography but I am hooked! After getting my XSi from my husband for Christmas the natural next step was to buy lens. It's hard to afford the lens's direct from Canon so after monitoring several forums I decided this was the next best step. The reviews on here finally sold me and I pulled the trigger.Boy am I glad I did! I use this lens all the time in my travel and it's especially come in handy at places like Zoos, Parks, and other outside venues. I would certainly recommend this lens to anyone. It makes my rookie photo skills look professional :)",
        "That macro addition is a huge bonus at this price. Good buy.",
        "Very good Superb quality lens for 300 focal length !",
        "This is a fairly cheap but usable lens. Autofocus is slow but price is explaining everything. For digital SLR I would recommend Tamron's AF 28-300 f/3.5-6.3 XR Di VC. Twice as expensive but a very nice lens. To date I snapped around 1K pictures and I am very satisfied with it. VC stands for vibration compensation and it truly works.",
        "As a macro lens this works well and is a lot of fun. Using this lens for anything other run macro photography it starts running into issues.",
        "Great lens for the price. I consider myself a relatively new photographer and this works great for me and takes beautiful photos.",
        "I love this lens. Even without a tripod my pictures have come out great. I really like the macro feature also. Great lens for the money.",
        "i'm new to photography and on a budget so i went ahead and bought this lens. sure, it's not a fast lens and you need lots of light, but i love it since i usually use it outside anyway. it'll do for now while i'm saving up for something better. i normally use this lens for taking photos of flowers and critters.",
        "I haven't tested it out yet, but for the price it was a steal. Only paid $70 for mines. Hopfefully, the product will meet my needs for it.",
        "This item is great for long range photos, a little difficult to manage at time, converting from auto to manual operation.",
        "I originally bought this lens for the purpose of shooting Florida's flora and fauna. Though a little soft, it gives me a useable image from the distance I need, and I've had some fun with the macro function on the side. Make no mistake, though; without image stabilization, this lens will be all but useless without a tripod, or at least a monopod. I wouldn't take this thing out with expectations of making it into National Geographic with my shots, but it's great for hobbyists and personal use. Can't be beat for the price range.",
        "for the price I paid, i am happy for the shots I took and its operation. my only complaint is that the aperture got stuck after 5 years of use. don't know if it's ITS TIME but I wished it lives on given my low usage.",
        "Great lens and it is really easy to use. I love the macro and zoom combo and highly recommend this product",
        "I have long needed a good closeup lens, and this is it. After getting used to it, it works great.",
        "This was just what she wanted. She loves to do Macro photography and the macro switch on this lens puts it a step above the others.",
        "This is a great lens for the money, highly recommend . Tanron, is a good product, and a great alternative to cannon."
    ]
}