{
    "entity": "SLR Camera Lenses",
    "text": [
        "I am a total novice at photography and have only had my (2nd hand) Nikon d70 DSLR since July, but recently learned enough to get my camera off of fully automatic settings and I now shoot in RAW format with manual settings. The transition from JPEG/automatic to RAW/manual already improved my photos, but this lens has been an incredible asset to the quality of my photos. In the week I've had this lens, it has become my \"standard\" lens - I only change it out when I absolutely need features provided by other lenses. SO worth the money. A must-have for any beginner/enthusiast.",
        "The lens says AF ( autofocus) but autofocus isn't supported on my d5600, which I didn't realize (using a small device, didn't see in the description that it won't autofocus on a nikon d5600). I'm a newer camera user so an expensive lesson as I now realize that I needed an AF-S in order for it to autofocus which is only about $30 more. I'm kicking myself because it was a (requested ) gift so I open it until it was too late to return it. I'll sell it at KEH and get the AF-S. Sigh.",
        "Superb lens. I had this same lens, that unfortunately fell off a cliff and I immediately bought the same lens that night. Don't spend the extra money for the 1.8G, this is insanely sharp with great bokeh. Great depth, and built like a tank. As a photographer this is my absolute go to lens. Only complaint is some minor sun flares when shooting around sunrise or sunset (See Photo Below.)",
        "I'm really new to photography and I am used to automatic mode. I purchased this lens with the understanding that I would have to operate it in manual. I downloaded a work sheet from click it up a notch that explains everything really easy and with diagrams as well. This has made the switch from automatic to manual easy. With that being said, I am in love, I don't want to put my camera down. Pictures turn out beautiful. Having to operate in manual isn't as bad as lots of people make it seem",
        "This lens takes incredibly sharp photographs. Just be aware that if you have a DX camera without a focusing motor in the body you will have to manually focus this lens. For that reason I have not used it much. It will come in handy when I get a body with a focusing motor. It's very light weight as it's made mostly out of plastic. If taken care of properly it should last a good many years. However I would be afraid to drop it as it feels like it would just crack if I did. Still worth the money if you are careful with it.",
        "It was a nice lens, however, I wish it came with directions with it. It took me forever to get my NIKON to shoot with it and things not turn blue. I do not have this issue with any of my other lenses. I can put any of them on with my normal settings and they work great. This one I had to play with for 25 min to figure out why everything was blue on the same settings as my other lens. Still have not figured out the issue. However, it does take beautiful photos.",
        "My first prime lens and I am already loving it. Its small and light - but the make is not great, feels cheap (which it is) near other Nikon lenses and is a bit noisy when focusing. Does not have an internal AF motor so unless your camera has a auto focus motor this will have to be used as a manual focus lens. Haven't got a chance to go outdoors for field test with this lens yet, but have already done more than 1000 clicks indoors. Images from this lens are great, wide aperture (widest I may use is 2.5 though) and fast focus.",
        "Great little nifty-fifty. Works very well on my D750. Fast and accurate focus, light weight, low profile. Not as sharp as I'd hoped (though not quite fair to compare anything to their 85mm f/1.8G as I've yet to see any other lens produce images as sharp). Great 'walking-around' lens, especially for capturing a 'documentary' field of view. For the cost, an excellent little lens and definitely one to have in the arsenal.",
        "I must say, I am extremely happy with this purchase. I had to wait for almost a week for amazon to finally send my camera to actually use it on, but everything actually turned out for the better. I debated for almost 3 weeks on choosing the 50mm or 35mm lens, and after reading hundreds of reviews, I decided to go with this gem and I'm happy I did. It's being used with a Nikon D7100 and after a little more use, I will upload a photo or two and add more to my review.",
        "Glad Nikon still cranks these out. I sold my old one circa 1998 and have been using a 24-70 and 80-200 2.8's for years. Although a50 1.8 isn't a replacement for either obviously I like using the 50 1.8 on my DX cameras for portrait/glamour as it is like weightless and excellent on. DX. It becomes a 75mm. Perfect for heads, 3/4's. Awesome bokeh and if you're shooting in tight quarters it is much more convenient. Sharp as a tack.",
        "This lens has a good price value and it can get you by until you have the funds to buy the more expensive 50mm. This lens performs better on a crop sensor than it does on a full frame. So it may look much better on the crop sensor cameras and the performance may be what your looking for. This lens on my full frame just does not offer good quality and clarity on the lower aperture settings. It performs decent in higher aperture settings. If you can afford the expensive 50mm then get it. If you can't this one can get you by just don't shoot on low aperture settings.",
        "Even though the description says it is, this lens is not compatible with Nikon D3400. The camera will tell you as soon as you install it. As I found out now with additional research, for this camera you need to buy the 1.8G lens.",
        "I have been using this lens for almost a year now, and it has been my go-to lens for so many occasions. I shoot both indoor and outdoor shots on my Nikon D750 and this lens does great in all settings. I even used this lens on my first DSLR, a Nikon D3100 and the clarity is great on the crop lens, too. My only criticism of the lens is that my more self-conscious clients think they look fatter with this lens when I use my full-frame Nikon body. This makes sense since 50mm on a crop lens will make you look smaller than 50mm on a full-frame. Just something to be aware of.",
        "Do not buy this for a full-frame. I bought this for my Nikon D750. All the reviews/questions said it worked great. It does NOT! My crop-sesnor (DX) lens worked better than this. Does NOT have good quality whatsoever. No picture was crisp or clear. The pictures I have provided show it compared to a 50mm 1.4 G I had rented. Oh my goodness, the 1.4 G produced the most beautiful pictures. I definitely recommend spending the extra $ for the 1.4! Do not buy this 1.8",
        "For the price, I don't think I could have done better. It is a little soft, but having that 1.8 aperture makes a beautiful shallow depth of field that is incredible for portraits and close-up work, although this is most definitely NOT a macro lens. I'm Satisfied with it. The jury's out on any kind of color shift. I love how light it is and the focus is fast and sure. I can't complain at all, really and would recommend this lens as a good addition to your camera bag.",
        "This is an awesome lens for up close macro pictures. I love using it for up close images of bugs, insects, flowers, anything that would be beautiful with a blurred background. Even pictures of the kids. It makes a beautiful blurred background effect. Great way to save money on family portraits!",
        "I use it with my Nikon D7200 and I love it. I've mainly been filming with it and it produces crisp images. When taking pictures, it creates really nice depth in portraits.",
        "This lense doesn't have auto focus. It will auto focus with some models but not my D5300. I didn't figure this out until 4 days after the return window closed. I should've bought the AF-S for my model. Also there is no white dot to line up and attach the lense making it tough to attach properly. You should also purchase a lense protector, this lense doesn't come with one.",
        "I haven't used this lens a whole lot but it is very high quality well built lens. The pictures I have taken so far are very warm and seem softer compared to my sigma 18-300 lens that seem to be much sharper. The AF works great. On a crop sensor camera, it acts like a 75 mm and that's too tight for general use. I will need to spend more time with it but so far, I like it.",
        "Do not think of buying this. I mean, buy this. As in, add it to your cart, now. I can wait. No, I can wait. Does is make you look like you have no clue because it's not 2 feet long? Well, being that it's a lens designed for quality and integrity, let's just say that the results will speak volumes. Using it on both my Nikon's...it's a really wonderful lens for specific use. I have taken my best pictures with it...even though it's one focus length. Blah...until you see what it can do. If you are creative, it's a great lens for that...being original. Anyone can snap a picture. But you're better than that. the f/1.8D -- is sublime.",
        "I LOVE this lens. Absolutely worth the money (which is barely any money, compared to other lenses), super fast, super clear images. I use it with my D50, it auto focuses like a dream. Great snug fit. If I had any sort of complaint, I suppose it would be that it's a bit noisy as it focuses, but that's not really even a huge concern. It's the second lens I've bought and I was debating between this and another one. I'm so glad I chose this one because it's absolutely amazing.",
        "This lens is undeniably amazing, especially if you consider the price. You could pay many times more for a more recent Nikkor 50mm and you will get lower results. This lens is sharp, light, compact, inexpensive. The only drawback I can think of is that it is noisy compared to newer models but I don't use it for video so it doesn't matter to me.",
        "I have only 3 lenses for now, but this one is definitely my favorite one. The f1.8 aperture works amazing for portraits or in low light. I'm using it in 90% of cases, for everything. It's much sharper than any kit lens. The auto focus is a bit slower but since it's not a lens for sport or wildlife photography I don't see that as a big disadvantage. Definitely recommend it!",
        "Lens perform well....Can't go wrong for this price. AF is abit slow since its done via camera motor. Also the bokeh is slightly less appealing when compared to the 50mm 1.8G. Lens is well built. Highly recommend this. Note this lens does not focus on entry level bodies.",
        "This is a great lens in terms of its optical quality, but very poorly made with loose tolerances. Here's the thing: it performs beautifully, but feels like what it is: a cheap lens made in China. Aperture ring is soft with none of the firm clicks I'm used to from even the consumer-grade Nikon glass, and the focus ring is even worse: sloppy and loose. It's a poorly made, unapologetically plastic lens but really does get the job done when it comes to optical performance. If you value performance over the feel of your gear, look no further. Honestly, I can't complain about its performance, but the build quality is alarmingly bad.",
        "POOR- Product Description was inaccurate! Product was supposed to work with a D3400. Face this lens as late Christmas gift and camera giving an error message that the lens is incapatible. Very disappointed.",
        "I absolutely love this lens. It takes far sharper photos than any of my other lenses... Even the one that retails for nearly $2000. The one drawback is that this lens seems to fit a little off on my camera. I sent the first one back because it would seem to come loose and then the EE error would show on my viewfinder. The second lens I got has the same problem, but infrequently. Kind of a bummer, and that's why it doesn't get the full 5 stars. But, for image quality, it has really exceeded my expectations. Money very well spent.",
        "Bought as a backup lens. I researched a bunch of lenses and this one kept coming out near the top but with a small price. I have been pleasantly supprised at the sharpness of this lens for the price. I now use it as a main lens on the new Nikon D850 and the images are great.",
        "This was one of the best lens purchases I've ever made. I've won contests using this lens. Probably the best kept secret of the Nikon Photography world. Awesome lens.",
        "Very Sharp Lens! Love it! too bad I have to return it. It actually really good lens, really sharp picture, the problem is... my Old Nikon D40 can't make the auto-focus works, it doesn't have in-body auto focus, see.. in the real world.. where my wife and kids and friends will eventually hold the camera and take my pictures, not just me taking their pictures, they don't know how to focus it manually. and that means all pictures where me in it could be useless blurry memories, so with my heart broken I have to return this lens,.. for the sake of me.",
        "This is my first prime lens. I was excited receiving it in 2 days using my prime shipping. as soon as I connected the prime lens I started receiving fe.e error on my D90. There is no issue with lens or the camera. Ensure that your lens is set to F22 with the aperture lock on. I am using the Aperture priority mode. and the pictures are coming out quite well. Currently just experimenting on the family but I am quite impressed with the bokeh effect. Must have for any budding photographer",
        "Nothing new to add but this is the least expensive Nikon lens I own and takes just as sharp photos as my most expensive lens at a fraction of the cost. Sounds reminisce of my Minolta 35mm when it focuses with my D7100 but no lie it focuses just as fast as a Nikon lens with a built in motor. A great portrait lens, a must buy for quality and price point. Do not like the fact I had to buy a hood and a lens bag that has been included with every other Nikon lens I have purchased but that additional cost was minimal. What do you expect at this price point.",
        "I would guess that most people considering this lens have already read authoritative reviews and know what this lens is and why they want it. If there is anyone who hasn't, I would think it would be much more worthwhile to check the professional reviewers to be sure this is what is wanted. But for what it's worth, on my Nikon D7100 this lens focuses fast, lets in lots of light and gives me what as best I can tell are excellent results. I don't use it often, but it's so small and so good I carry it along always.",
        "It's a great lens for the price. Plastic build but not at all bad for the price. I use Nikon D7000 and so I have an inbuilt motor so the AF also works well. To have the auto focus work you need a body that have an inbuilt motor. The pictures are quit sharp and clear. Light weight but as it uses the motor of the camera body is not as fast as you would experience with some lens that have AF motor in the lens itself. Plus using the motor of the camera body mean it's loud when it focuses. I still like this lens .. its cheap and fast prime lens",
        "I love this little lens! I like the manual aperture control on the lens its self. I have only used this camera on a Nikon D5100 so I don't know how good the autofocus is on it (The D5100 cant autofocus this lens because there's no autofocus on the camera body. But I don't ever use autofocus anyways. This lens is sharp and lets in a lot of light. Really big bokeh and its great for portraits or indoor photography. I would buy again, especially for the price. An amazing deal.",
        "I went without a 50mm standard prime lens for years and bought one of these earlier this year for a specific project. I got great results from this lens and have forced myself to use it on some other occassions as a \"Personal Challenge\". I appreciate the extra light in the viewfinder and the almost \"feather-weight\" build. This lens does help make my D200 much easier to carry as a \"Walk-around\" camera. Of course I do sometimes miss the flexibility of a zoom lens, but I don't miss the weight gain from a zoom. Using a prime lens does make you think about the shot! I love my 50mm f1.8!",
        "I bought this lens just about 2 years ago and it has never let me down. The pictures are sharp and the DOF cant be beat. I was thinking about getting the f/1.4 but a friend talked me into getting this one saying I wouldn't notice the difference for the price. I didn't listen to him and got the f/1.4 and this one and did a shot-for-shot comparison and he was right ( i hate it when he's right ) and for the money saved I returned the f/1.4. If your thinking of adding this lens to your collection you will not go wrong and you will use it more then you think.",
        "This won't be a 5000 word marketing review, just my own experience. My camera is the Nikon D610. I have to set the lens to f22 or else I get an error signal. Otherwise it works fine. Autofocus is fast and spot on. Exposures are perfect. I tried it in manual, shutter, and aperture modes. Photographers like the latest gear, so you'll notice this lens sells for less than the newer lenses. Don't let that deter you. If you want a sharp, autofocus lens that fits the older Nikon cameras as well as the newest Nikons, this is a good deal.",
        "I put this on my Nikon N90s body and it’s a match made in heaven. Not as smooth to autofocus as newer lens technology but at this price point and on a 35mm body, it’s great. It really shines when manual focusing",
        "This is a compact, light standard prime lens for use on virtually any Nikon made in the history of the company, from the famed FA of the 80's (where I currently have it mounted) to the most current DSLR. It allows autofocus, through the lens metering, or manual operation, whatever the situation or camera system demands. the second ring of aperture settings is for older Nikons where the f-setting was reflected back through the viewfinder. Crisp, sharp and very well priced, this is the lens to have.",
        "Don't have a focus motor on my camera but I can still use it at lower than f/22. D5xxx's have a lens indicator that if you modify it, push it down, you can too. Pic included. I can deal without the AF. Lens works fine. Images are slightly soft though. A fault of the glass I guess.",
        "I am not a pro, it just a hobby. It fits well with D50 and D700 I have. Yes, I need to upgrade my cameras. I have other Nikkor lens: 24-85mm, 85mm, 75-200mm and Sigma 70-300mm shared with old school film Nikon N90s. 50mm is the best !/$. This lens is the smallest. When I travel, I take the 50mm. When I am lazy, 50mm stays on my camera. Walk instead of zoom, I am not that lazy for better quality. 1.8F is enough for indoor scenes without flash at least with the D700 and cooperating kids.",
        "This is just what I wanted. The crispness of the pictures are simply amazing. It does not focus automatically on my D5100 but on my D7100 it is a winner. I had an amazing weekend shooting the best magazine shots ever this weekend. I have soooo much material to put fwd for a few magazine in the next few months. I got a jackpot with this lens. I love it. My work is now at an even higher level. BUY IT. Just know its great on the D7100 ...not good on the D5100 because you will have to manually focus each shot.",
        "After reading many reviews stating that every photographer should own this lens, I purchased the Nikkor 50 mm 1.8. It arrived a day before expected, and while it's taking me a little practice to get used to a prime lens I am delighted with the quality of the lens and the sharpness of the photos I've taken. I'm very happy with this purchase.",
        "This was a great lens though it didn't motor on its own with my Nikon D5500, as my camera doesn't have it's own internalotor and needs it to be built into the lens itself so I had to return it. But I would buy it for a full frame with internal motor drive.",
        "I love this lens. I'm a very amateur hobby photographer. This lens makes my pictures look like I have a decent understanding of photography. I do have the D3000 body so autofocus isn't an option but I haven't found that to be a problem at all. I've managed to get some great pics of my 1-year-old nephew who is constantly on the go! I do not in any way regret this purchase!!!",
        "This is a great quality lens as are all of Nikon's lenses. It takes great quality pictures in very low light. Focuses fast and accurately on my D-90. It's very low price in relation to it's high quality makes it a must have for anyone who needs doesn't have a good quality lens around the 50mm mark. I also highly recommend buying Nikon's 35 mm f/1.8 lens to complement this one... it's a great price/quality combo just like this one. I have found no dis-likes about either one of these lenses and guarantee you won't be disappointed with either of these two great lenses!",
        "I have a Nikon D5200 that I use this lens on. Yes, I was aware before I ordered it that I would have to manually focus it myself but I figured it was better than spending $100 more on the AF-S lens. I really like this lens. It's great for portraits and all-around photography that doesn't require zooming in and out. Since my camera is the DX format, it makes the lens more like a 75mm so expect things to look closer than you think. I've taken some great shots with it at museums, outdoors, nighttime, etc. I don't mind that I can't zoom, I just move closer or farther away. Like the bokeh that it produces at f/1.8.",
        "It’s quite stiff when I try to change the focus. But other than that it’s fine. Need a lot of practice to get clear focus of the photos/videos.",
        "What's not to say but good things about this lens? I have never owned a fixed lens, and needless to say, this won't be my last one now. I purchased this lens for product photography, but I will definitely be taking it out for adventures in the near future. It works perfectly, and since I have a D-90, the auto focus is definitely a benefit. Love this thing and would recommend to anyone.",
        "Its pictures are crystal clear and very sharp. I liked the somewhat retro look of the lens-dont miss the lack of VR;the lens is light and apertures fast, so why waste money on an unnecessary feature. Although the lens can be used on both DX and FX cameras, because of the crop factor in DX its most at home on FX models.",
        "Best lens I have ever purchased. I am new to photography. Using this lens as a prime gives me beautiful pictures. I am glad I read the reviews and I agree with a lot of them here. This lens is AMAZING!. The photos are very sharp. I am used to manual than auto, although I lose timing on moving subjects, doesn't matter I like the quality of the photos it gives. Best investment I ever made. Recommended.",
        "This is a fantastic lens for creating blurry backgrounds and getting exactly what you what due to the manual focus. Can't go wrong",
        "I ordered this without realizing that my camera required the upgraded AF-S lens to be able to use the auto focus feature. I however haven't had much issue with focusing the lens myself. The image quality is just as good as the more expensive AF-S f/1.8G or even the f/1.4. For hundreds of dollars less, I think it is worth it to just focus the lens myself.",
        "Well built much better then the dx G series i had for my crop sensor I can tell I will have this for years to come.Its sharp what else can you say besides buy it",
        "The nifty 50mm is a great tool to have in your bag. The f stop of 1.8 is really useful for night photography. Great lens at a great price!",
        "Great lens for low light situations and produces crisp images that are crystal clear. Just make sure your camera is compatible before buying. Is well worth the money. This lens really changes your photography since it does not allow you to zoom. Makes you move around to get the shot you want. Really changes this for an amateur photographer who gets the standard kit lens.",
        "We wanted a second 50mm AF lens, one that would allow manual aperture. the F1.8 was fast enough, and the price, very good. Always read the product sheet when you get a lens. We forgot, and it was OUR fault we didn't notice that we should have had a lens cap with the lens. We noticed this when it was too late to contact Nikon or Amazon. First time we have ever had anything missing with Nikon equipment or Amazon, for that matter. The lens is a 5 our attention to unpacking detail, should have been better. This is a good lens to add to the kit lens that probably came with your camera.",
        "Good for portraits, but oh man the coma is bad when I shot last night from my tracker... I thought my tracker was misaligned, but when I zoomed in, what I thought was blurring was coma all the way around.",
        "I bought this lens for close-up work and for the f/1.8 aperture in low light situations. I have used it some (not a lot yet), and I am very satisfied with its performance. It was recommended to me by my professional photographer brother-in-law, who also has one, uses it a lot and likes the way it performs. I have a Nikon D300 and a D40X. I am an enthusiast, not a pro. But I wanted a prime lens that would fit my cameras and this certainly rounds out my lens selection.",
        "This lens was an AWESOME value! The price just can't be beat and performance is great! Just know that the lens casing and stuff is made out of plastic. Some people prefer the more expensive version made out of metal parts. Also, when coupled with a filter and shooting scenes with bright light sources in the background (bulbs, spotlights, etc) there may be an internal reflection due to the filter and the depth of the lens casing. Kinda hard to explain, but yea... That said, the lens is a GREAT lens to start off with and is perfect for the budding photographer. And at this price, there's probably no better value for this aperture!",
        "I've used this lens for about a month, and have decided I like it quite a lot. It is NOT an auto-focus lens when used with the D40, so dust off your focusing skills. I have used it for two specific things for which it's better than the kit zoom lenses: short depth of field and low light. For the short DoF it has worked great. I am particularly pleased with the results for garden pics. The wide aperature has allowed me to get some indoor dancer/musician shots without a flash that would not have been possible with the F3.5 (at wide angle) kit lens. Overall, a great addition to the camera.",
        "I read raves about this lens and it was referred to me years ago, and I am just getting around to treating myself to it. So far, so good! I have not used this lens much. I need to practice more with the features, but for the photos that I have been successful taking, I adore. The depth perception is awesome! I have poor eyesight, so it is a bit tricky focusing and capturing the appropriate shot when I have to constantly adjust the lens based on my physical condition. Aside from me, this is a cool addition to my growing collection of enhancing tools.",
        "This lens makes the creamy and sparkly-est bokehs! Auto Focus works perfect with my Nikon D7200!",
        "I love this 50mm prime lens! It goes perfectly with my D850. The pictures the pair take are fantastic!",
        "This is a very nice lens, it's very sharp, and it's very comfortable on the Nikon d40. However, you can't autofocus with it on this camera, which makes it a major bummer. However, i gave it a five star review because it can work on my old film camera, which is a plus. Plain and simple, it's a sharp lens you can not go wrong with. I own the Canon version of this lens, and in comparison the Nikkor version is much better, in build at least. You get a metal mount, and a better focusing ring. It's not the best lens in the world, but for the price it's Great, and a must for portrait photographer on a budget.",
        "Normally I'm not even a fan of prime lenses, but how can I not be a fan of this one. Light weight, compact, inexpensive, sharp, fast focus. My camera bodies do not require the more expensive G and I can't justify spending something hundreds more for just a half a stop more speed.",
        "I have been wanting to purchase this lens for about a year now and finally bit the bullet- and I am so glad I did! This lens is a perfect addition to my lens collection and is wonderful for taking up close pictures and portraits! I love love love this lens. I definitely recommend this lens to anyone in search for a well priced quality lens!",
        "For $125 there is not a better lens out there for portrait photography. It is not the sharpest lens out there, don't get me wrong it is sharp but does have a soft sharpness. DOF is great, size is great, low light shots inside now possibly with no flash and low ISO. Bought it because of the positive reviews on Amazon and am very happy to have this lens in my collection now. I am a novice shooting with a D90 and have had amazing results so far with this lens. Fast lens with amazing low light capabilities. Would highly recommend this lens to anyone shooting a lot of indoor shots.",
        "I'm an amateur photographer at best but I can't get enough of this lens. I did a lot of research and for the money, this was the best portrait lens that would give me the bokeh and Dof I was looking for (I have a D90). So far so good. I haven't figured out everything with the lens, but for shooting my daughter and son and flowers (all I've really gotten to) it's fabulous. All the reviewers are right though, there really is no zoom and you are moving around a lot (in and out) to get the whole shot (or in closer as the case may be). But the results are well worth it.",
        "I am a portrait photographer . I am currently using the Nkion D90. And this is the only lens that I will be using for at least the next 6 months. This lens is super sharp and the depth of field is amazing!!! This lens is becoming second nature to me already. Perfect for my fine art portraiture work. Visit my website at [...]. 90% of the portrait work you see on there was taken with the 50mm. With the exclusion of the concert and landscape photography.",
        "The lens is amazing. It may not be auto-focusing, but that is not required for it to be a good lens. I have only used it very briefly so far, but have gotten some amazing photos with it. I usually do landscape and wildlife photography, but have been getting into doing studio/portrait photography recently and this lens fits that bill perfectly. With a tripod and gentle manual focusing, I have been able to take some pretty decent test photos so far. I cannot wait until I have my backdrop set up and am able to take some true portraits with it. I have no doubt they will turn out quite well.",
        "What are you waiting for? Why are you still reading reviews? This is \"dirt cheap\" as far as lenses go, yet is an AMAZING performer. The lengthy reviews that have already been posted cover the ins-and-outs of this lens very well, so most of what I could say would just be repeating them. I'll note, however, that I got this lens on a whim, thinking that I would only rarely want to use a prime. In no time at all, however, it became my favorite lens to shoot on. If I'm going to hand my camera to an inexperienced user, THIS is the lens I put on.",
        "This is my go-to lens. I love this for low lighting and portrature. I bought this used and splerged on a new one.",
        "This is a very fine lens, fast, lightweight and very sharp. Low light shots are great. Care must be taken, however, to ensure auto-focusing compatibility with some Nikon DSLR bodies. The lens does not have a focusing motor and it must rely on the camera body focusing motor so check with Nikon to be sure about that. Manual focus is possible with all Nikon bodies, however.",
        "I bought this camera with a Nikon 7100 for creating training videos at work. The lens is basic. The optics are great. AF and AE have no issues. I would not recommend this lens if you plan to use it where it could be exposed to contaminants. It is plastic. I use it indoors to video and photograph food. I expect to not have any issue, but do not plan to use this lens outside where wind can deliver all sorts of particles that will impede the inner workings. Highly recommended.",
        "I am an amateur family photographer who set out to find a lens that worked well in low light so that I didn't have to use flash indoors. I've found it! This lens arrived an hour ago and I am already using it well enough to take the grandkids photos on Thanksgiving without a flash. I own a Nikon D3000 so the auto focus does not work with my camera. However, there is a light that flickers then stays lit as you manually focus the lens in the viewfinder. I wear glasses so I was concerned about relying on my own eyes but once I read about the focus light I decided to give it a try. Works great!",
        "Haven't been using this lens very long, but so far it has lived up to the hype. Previous reviews were correct in the quality of this lens. Keep in mind you will have to get used to the focus (or lack of) by moving yourself rather than the lens. Photo quality is worth the $$ and time spent. If you are interested in taking better photos, or want to purchase as a gift, this is a great lens.",
        "I own an ecommerce business and shoot many products on site in our tabletop studio. I recently purchased and began using a Nikon D90 for our product shots, but was not completely happy with the kit lens. After posing questions for advice in the photography community on Amazon, I purchased this lens and I can honestly say \"wow!\" Many of my products are glass (often clear) and this can pose some unique challenges, but this lens is razor sharp and gives super color and detail. It is an amazing value and easy to use. I love it.",
        "we also have a \"travel lens\" 18-200mm with image stablization (\"VR\" equivalent) from Sigma bought about 6 yrs ago. I can say for taking portraits, the difference is like heaven and the earth. the lens is worth every single penny, buy it. Also found Amazon's price is the best. For other advertised \"cheaper prices\", found they were all from \"Grey Mkt\". Google search it to find the difference if you do not understand the pros and cons of \"grey mkt products\".",
        "Having spent most of the last decade using super zooms to cover wide to medium and medium to long, it was great to get back to basics. The relatively large 1.8 is excellent for low light and images created from my D7000 blown up to extremes on the monitor show no vignetting that I can see, no chromatic aberation, and excellent contrast from center to edge. For the D7000 DX format it is a medium long lens that is superb for portraits. This lens is a little gem.",
        "The very first lens I had on my 35mm camera(s) was a 50mm prime. Now I've come full circle with the Nikon 50mm 1.8D lens for my Nikon D7000 camera. I thought seriously about the 1.4D, but the price was more than I wanted to put out. I read many reviews, both by professional review sites and individuals. Bottom line for me was the great reviews and the fantastic price for a low light lens that provided very sharp images. I wasn't disappointed. The lens is light weight and does as reviewers previously reported. You can't go wrong with this lens and the price you pay for the value you receive is unbeatable!!",
        "I use the 50mm f/1.8 on my full frame sensor (FX) Nikon D3S. It will work perfectly well on a DX size sensor too. The autofocus is very fast and the lens performs extremely well. I thought about getting the 50mm f/1.4 lens but the significantly higher price wasn't worth it on my D3S with it's high ISO performance. Granted, the f/1.4 sucks up 60% more light at maximum aperture, but I usually use zooms and thought the f/1.8 would be fine for my needs. What everyone says is true. The lens is sharp even at maximum aperture.",
        "Great product fast delivery the only problem is that it did not come with a rear cover.",
        "Lens arrived very quickly, product looks like new , used it in low light conditions shooting night sky worked wonderfully.",
        "Was tricky to attach, which seemed weird, then camera said \"incompatible lens\" but the description said otherwise. Returning.",
        "Like many others on here, I use this lens on a DX-sized sensor. So, the crop factor is that of a 75mm. This is my first lens...and I am extremely happy with it. The broad headroom afforded by the f/1.8 aperture provides dramatic DOF effects. However, I rarely stop below f/3.5. The focus ring is plastic and feels a little cheap but it stays in focus. Aside from wanting a wider-angle lens in addition to this, I don't see any reason to replace/upgrade my Nikkor 50mm f/1.8D AF anytime soon. If lost/broken/stolen, I'd probably get it again (@ $125). [ Camera: Nikon D3100 ]",
        "I use this lens on a D90 and D200. It auto-focuses very fast and is a cheap way to get into natural light photography and learn about shallow depth-of-field. It even works as a macro if you reverse the lens. After months of use on both cameras, the 50mm 1.8D has produced great images with no complaints from me. If you are just starting out... My only suggestion would be to consider the 35mm 1.8G if this is your first lens on a D7000, D90, or other 1.5X crop camera. 5/5 -Mike",
        "Excellent value: good optics for low price. The lens is a bit soft at the edges when wide open. Usually this is not a big problem, as the DOF is very shallow wide open and it is rare to have a scene where subject and corners both need to be sharp and in focus at shallow DOF. Some complain that this lens is built in China. I don't have quality issue with my unit; and built is fine. And I welcome more lens to be manufactured in China if we can get these level of quality for low price.",
        "When you balance the function, quality and price of this lens it's hard to come down anywhere other than this being a great piece of glass. Keep in mind it's a 50mm so you need to be pretty close but for portraits, kids, pets or other similar subjects it's great. I've used it recently for some concerts in otherwise dark clubs and at 1.8 if is plenty fast enough. No real drawbacks.",
        "Im an amateur photographer but everyone in my family is amazed at how good the pictures look from this lens. Ive read countless reviews about the 1.4 and the 1.8 and decided that the distortion and fall off compared to the 1.4 does not justify the price difference. As a pro photographer i would get the 1.4 but for around the house and parties the 1.8 is great. Just set your aperture to 1.8 and put your flash on wireless and see what beautiful pictures you can get from this lens. I barely use my kit lens anymore........ Nikon D90",
        "This lens is my first prime lens and now I am hooked. It is my absolute go to lens when I am wanting to get great close ups with a nice bokeh. I have this on a Nikon D3000 so its the equivelent to a 75mm. Manual focus is not my friend and takes some getting used to but you can take as many pictures as you want....its digital after all. I love the options t gives me over my none-prime lenses and the creativity it allows in portraits. Its cheap enough to take the plunge so what are you waiting for, get one! :) You will love it!",
        "Exactly what I wanted. I do a lot of maternity, couple, and graduation portraits and this lens is a very good quality. Im not a beginner but I also don’t do this full time so it was the perfect lens to work with and takes amazing shots.",
        "I purchased this lens a couple of years ago. At first I was using it with my Nikon D60 camera. It was a little tricky as it doesn't auto focus with this particular camera. Last year I added a Nikon D90 as my primary camera, and to my surprise, the autofocus work really well. The amount of light your able to capture at F1.8 at such higher shutters speeds make it a great addition if you don't want to spend to much. I've notice it works best without a UV filter which seem to cause a reflection of light in the photos, but otherwise, no problems. I'm very pleased with the results.",
        "As my first fixed lens, I was very excited to try this out. I love it. I was a bit skeptical of it not being an autofocus lens, although I work completely manual, it is a handy feature. The depth of field on this lens is stunning. It is a great intro lens if you are looking to use these types of lenses. It doesn't feel too cheap, and the price is well worth it if you're going to buy this lens. I highly recommend it!",
        "Great for portraits. This particular model does not auto focus but it’s great for helping to better understand the settings you choose. Great product, great price.",
        "When I bought my Nikon D80, the lenses that came with it were the 18-55mm and 55-200mm, but until I bought this lens I hadn't realized I was missing out on so much better pictures! Basically I bought the lens because it was the cheapest one I could find, but only after reading all the reviews and tech specs. I like this lens a lot, and think that it should come standard with the nikon cameras. The only thing I don't like about it is sometimes the Automatic focus acts strangely, but I like using it on Manual anyways. Also recommend if you buy any lens that you keep a clear filter on it.",
        "This lens is by far my most used and favorite lens. The boken on it is just right. Not to much but not so little that the background is still in focus, plus's you can change that. I keep mine around f2.2 on my Nikon D7100 and never really have to change it often. It's proven to be durable after a few accidental drops and works perfectly even after then. I will always recommend a prime lens such as this to other photographers. I give this one 5 stars across the board!",
        "Look, this thing is the best deal in Nikon lenses. I shoot an N80 (film SLR) and so this gives me an actual 50mm view. Amazing. Super sharp, great bokeh, depth-of-field can get really really shallow if you want, this thing nearly takes pictures in the dark. Plus it's super-cheap, but feels really-well constructed. I haven't dropped it, nor do I plan to, but it has certainly banged against things and still works great. If you have a Nikon, you should have this lens, and maybe the 35mm too.",
        "This is a must have fixed lens for any serious photographer. The small issue it had was - it would not auto focus with my Nikon D3000, but then it is not a AF-S lens, only a AF lens, so was not supposed to do. Even then, I was able to get some lovely portraits in manual mode. Recently I got my Nikon D90 and this lens auto-focuses with the camera like a charm. Of course the Nikon D90 has its own motor. But the lens produces outstanding results, no questions about that. Will definitely recommend."
    ]
}