{
    "entity": "Finish Nailers",
    "text": [
        "This nail gun works better than my pneumatic gun that I wore out. It is expensive but it eliminates the compressor hose. It has more powers than then Bosch gun that I had. That went into the trash. But you have to use the 20 degree nails that they make. A trade off. It is heavy but works well. The safety switch is placed to remind you it is on. Expensive but good.",
        "6 years on and still works great. Being cordless is a huge benefit for my projects, but it also means you're carrying around the weight of the battery, and this thing is heavy! I pretty much can only operate this two-handed, which means I don't have a hand free to hold the thing I'm nailing. Since it only takes angled nails, the shortest nail length I've found is 1-1/4 which I had to order.",
        "I decided to treat myself and purchased the nail gun to use mainly on small projects, such as installing molding. It works great and the angled design makes getting into corners a snap. I also like the added features, such as the ability to adjust pressure and the choice between rapid fire and single burst. Before my purchase, I had once used my brother-in-law's air compressor nail gun kit, and my nail gun is so much easier to use. No hoses or wires and no air compressor noise. Of course, my Dewalt is heavier to hold due to the necessary battery that is attached to it. All in all, a great purchase for me.",
        "After borrowing my friend's nailer for literally years, I finally bought my own, only to find that the newer, angled version does not shoot nails less than 1.25\" in length. This rules it out for many applications.",
        "This was the best purchase made for my lake house renovation, it does finishing nails to 2 1/2\" nails, already shot over 2500 nails with no problems, GREAT product would buy again in a heartbeat",
        "The quality of this 16g nailer appears to be consistent with the many other Dewalt tools I own. The only two drawbacks I've noticed is the nailer is extremely heavy and it tends to jam more frequently than my Ryobi nailer.",
        "I did not use this tool but I lift it. It is very heavy, much heavier than pneumatic tool. As a home owner I prefer very light pneumatic tool than this heavy cordless tool. One star only because of weight .",
        "This is the second Dewalt 16 gauge nailer I have purchased. I am a installer and I use this on a regular basis and it's never giving me a problem. My last one gave up on me because I oiled it and it says right on the gun do not oil, it was my mistake but I will still continue to buy this nailer for as long as they continue to make them",
        "I bought this for my wife. No really I did and she loves it. It works great but only with the 18v XRP battery it comes with. Won't work with smaller 18v batteries or with my 20v adaptor. It is a little heavy but she has no problem handling it and it is lighter than hauling out the compressor and hoses for an hours worth of work. Great Product",
        "I'm a professional tile contractor, and I don't typically install baseboard or quarter round. Recently, as I was installing several rooms of laminate flooring, I needed to find a finish nailing solution. I love the convenience of the battery-powered operation of this tool (rather than the compressor/air hose/finish nailer combo) and I found that the battery had good life. The nails installed completely and cleanly and quickly. So far, I have no complaints about the tool and have paid it off on its very first job, so it's all profit from here on out (minus the cost of the nails, of course). I recommend this tool with no reservations.",
        "I bought this nailer to put up some tongue and groove cedar on my porch ceiling. It works really well! It's just as powerful as my other nail guns without having to drag out the long hose and air compressor. The only downside is it is much more bulky and heavy than a traditional nail gun, but it's well worth it for the convenience and quietness of this tool.",
        "I'd never used a nail gun before. Ordered this one because everyone says DeWalt is the best. It came quickly and was packaged nicely. The carrying case is great. The nailer is awesome! I wish I'd bought one years ago. It's simple to use and relatively light weight. I'm a petite woman and don't have any trouble wielding it. It's quick, quiet and a real time saver. I'm putting up my trim and baseboard in a fraction of the time with no hammer dings. I'm very happy!",
        "Works superbly well! Much handier than corded nailers, too. Only drawback is requirement to use either DeWalt or Paslode nails - can NOT use other less expensive nails.",
        "Much better than the Paslode. I should know I bought the Paslode first. The Paslode is loud, smelly, jams, and the nail depth is inaccurate even when adjusting for same. No problems with the Dwalt. Quiet, sure and much easier to use even though a bit heavier.",
        "Bought this when I decided to lay hardwood flooring in our kitchen and dining room. I started out with Senco nails top nailing when I couldn't get the side nailer in. The nailer would just crumpled the nails. I guess that is why it's called hardwood. Went back and bought Paslode. Still would bend one once in a while. It's big but still manageable. I still have my trim left to do so that is where I will use the Senco nails. It ought to be easy doing trim work. You have to set it to 6 when nailing hardwood floor.",
        "Owned this nailer since 2005. Let's see, I originally purchased it for new construction window installation / moulding, built a bar with it, the list goes on. Just this past week I have been using it to nail down 3/4 \" oak flooring. The nailer is a workhorse. I have had a few jams (extremely rare), each time I was easily able to release the stuck nail. So after 11 years of owning this Dewalt finish nailer I can say it is still a very dependable, well built tool that can put up with worksite abuse.",
        "This nailer is the ticket! I do a lot of handyman type work and this tool is the best option for in & out small jobs hands down. I have three compressors and the lightest one is too heavy and awkward plus you have the hoses to contend with. The case with the nailer plus 3 boxes of different lengths of nails inside is still lighter than my compressor and all I have to do is grab it and go.",
        "Nothing beats these nailers , long battery life , I've used mine to finish out two houses already without a glitch .",
        "I just moved into an 8 year old house with lots of \"projects\" that were never finished. This nailer kit has been a life saver and I absolutely love it. I love DeWALT products and I bought the 18 volt because I already had a drill, driver, and saw that takes the same battery. All my DeWALT products work really well, hold long battery charges, and have paid for themselves many times over. I'm stuck on DeWALT!",
        "This is my first battery powered nailer. I bought it because I already have other DeWalt 18v tools, and the batteries are interchangeable. It is big and heavy, but works extremely well. Once you practice on a couple of pieces of pine and a hardwood, you can easily figure out which setting to properly set your nails.I like the variable modes it offers in \"bump\" mode.",
        "A must for base, crown, casing, etc. Have not been able to run down a battery yet, but I'm not a production finish guy. Nails shoot straight every time. Accurate depth adjustment. Accepts DeWalt & Paslode brads. Nice trigger operated \"headlight\" feature for darker areas. Integrated belt hook another nice feature. Selectable one-at-a-time or sequential \"bump\" modes. Naturally heavier than traditional air-operated nailers, but alot lighter than carrying my pancake compressor & hose from room to room. Not for tight places, so hold on to your pin nailer.",
        "Hubs loves DeWalt tools! This one works well and is a great time saver on jobs. Keeps a charge and a great asset to his business",
        "If you're looking for a cordless nail gun, you will not be disappointed. I have used this on several occassions over the past few months and I have yet to use more than one battery in a single use. It lasts a long time and it hasn't yet jammed. It is perfect if you have no electricity available and it beats the whole compressor and hose set-up if you do have electricity. The only reason I gave it 4 stars instead of 5 is that it appears they have blown me off on the \"free tool\" deal that was going on when I bought it.",
        "I'm paralyzed in a wheelchair from the chest down so I have poor balance so I needed a gun that wouldn't hurt my wrists from the weight of the battery. This didn't. It was light enough, powerful and well balanced. I like the depth adjustment and it's well,placed safety switch. Highly recommend.",
        "Excellent nail gun. I have work with the old cordless passloads for years which are nice and light. But, went with the 18v over the 20v because i already had the batteries. But its just way too heavy. Felt like you were still carrying the compressor but without the hose. Returning and spending the extra money for the much lighter 20v",
        "This nail gun is very easy to use. It is my first nail gun and I expected it to be difficult to handle, but was wrong. Instructions are clear. It is easy to position and place the nail where you want it. There is no kick. I recommend it for finishing work. Because of my experience with this nail gun and the DeWalt reputation, I have decided to stick with DeWalt products when I purchase any other cordless tools. That way I can share batteries and keep one charging while using the other. Purchased through Amazon, free shipping to Hawaii, and got it sooner than expected.",
        "Why didn’t I get this sooner!! As a follow up - this tool is still an excellent addition and is very convenient but it does struggle to drive nails into hardwoods. So this gun doesn't replace my air tools as it was starting to look like it was. But it is great for most trim installations, etc.",
        "This works well and it's so nice not to be attached to a hose.",
        "This is the greatest thing since sliced bread. No more lugging around a compressor and hose. We have done two rooms of crown molding and the battery shows no sign of slowing down. It has a power setting that allows you to find the sweet spot for the wood you are working with. We had now issues driving 2.5in nails. The unit is big compared to an air version but never was an issue in corners. Heavy?? A little, but my wife had no problems nailing up our crown molding. I recommend this nailer to everyone.",
        "Nail gun does its purpose well. It is pretty heavy when using it all day. It has great power and sets the nail every time. I don't like that it comes with only one battery. Charges in around an hour. Gun fires proper even on the last nail but then stops without any warning signs. Over all it does what it's supposed too.",
        "LIKES: Cordless, cordless, cordless! No more hoses, heavy compressors or gas cartridges to mess with! No jams after 500 nails shot. Quick to fire/recycle time. Long battery life. Able to reach tight spots. Easy to use nail depth selection knob. Worklights surprisely helped me see a few times! --------------------------------------------- DISLIKE: Big, heavy and cumbersome! Overall, a great buy and addition to my tool collection. I'm very happy with the performance of this nailer and would buy again in a heart beat!",
        "The nail gun and nails I ordered work absolutely perfect. The rubber on end of nail gun will not stay on however. No big deal. Still love product.",
        "I am using it for trim installion. What a great product.",
        "arrived on time well packaged and undamaged. worked right out of the box. a little heavy but offset by the ease of placement of the nails would buy again",
        "Love it and last a very long time. I completed the entire house baseboard replacement without an issue and held a great charge.",
        "I do not know why I have been waiting so long to buy it. It works very well. This is very easy to use. No jam after around 500 nails. I borrowed a nailgun working with a gas cell from a friend for testing but this dewalt tool is way better. i love it.",
        "I've been wanting one of these for years, just tired of seeing up the compressor for a few finish nails. This thing drives a big nail through oak trim like crazy, the charge seems to last a good while too. Looked at all the competitors and this one won. Would recommend for the fellow professional and home owner",
        "The first nail jammed, and every subsequent nail jammed. And I was about a week outside of my return date. I should have headed the other reviews of how much this thing jammed. It is a worthless product. What a waste of money.",
        "This is my first nail gun. It does take a few minutes to \"get used to.\" It is rather powerful, and I learned to dial back the power to get more appropriate results. I've only finished one project (a door frame/molding) but I suspect I will be able to use this tool for life.",
        "This has become one of my favorite tools in the 6 months or so I have owned it. Yes it's a little heavy, but you get used to that. It does make a strange, unexpected sound when the safety is pressed against your workpiece as the flywheel is engaged. This too you get used to, just warn unsuspecting first time users. It drives the nails just as well as my Bostitch 16g air nailer, just not as light weight. Sure beats having to lug out the compressor and airhose on those smaller jobs or up on a scaffold.",
        "It's heavy but not unbearable. The ability of this gun to take the same 18v battery as my other cordless DeWalt tools is what really sold me on this. It has some great functions and performs like you would expect from this company. If it had a light it would be the best nail gun i have ever owned",
        "Just purchased this a week ago. I have been using the paslode trim gun for years. I am getting tired of all the misfires, cleanings, and the expense of fuel cells. The Dewalt has none of these cons. The depth adjustment on the Dewalt is much easier and more precise. You pop in battery, and shoot! I LOVE it!!!",
        "I was a bit concerned about the weight, but I really didn't keep it in hands all that long. You'd cut a piece of wood, then nail it in place (quick/easy), then repeat, so it wasn't like you were holding the tool in the air for 20 minutes... The nail gun loaded easily, the task light was very helpful and I can't beleive I didn't buy this tool earlier. The carrying case was a nice additon and since I already had the 18V battery from my Dewalt drill, there was no down time over the course of a full day's work.",
        "You can't go wrong with the Dewalt name and quality. The ony gripe is that it should come with lithium ion batterie(s) for longer battery life and lighter weight. Other manufacturers offer lithium batteries with their products in the same price range. Still a great too though.",
        "I bought this gun for a job installing oak trim. It worked great. It's easier to use this gun than to bring the air compressor. The nails are easy to purchase at your local hardware store or from Amazon. I would recommend this gun to everyone.",
        "Excellent - I just love working with this item. LOVE IT VERY MUCH, I AM SO HAPPY I BOUGHT IT.",
        "I had Home Depot install windows for me and the man who installed them was using this gun for some of the capping work he was doing. Said it was his favorate tool - period. I needed to do some trim work and purchase the same gun except I got 20 degree angle. It has worked very well. Lots of nails shot without any missfires and great battery life. Nail sizes from 1.25\" to 2.5\". No hoses. No compressors. No kidding. I love this tool & you will too.",
        "Used this to replace rotting gable and soffit and about 600 bf of 'board and batten' and the time/effort saved is worth twice the price. It's a little heavy at first but you get used to it.",
        "Bought this to replace all the interior doors, moldings, and baseboards in our fixer-upper. I can do everything myself, no smashed fingers, no dents in the woodwork. A must-have tool to do this work. I like the 20-degree angle, provides good access in most cases.",
        "Buy this nail gun to at some crown molding took my property At working like it supposed to work so I had Tobuy a different",
        "I had this item stolen from my vehicle. Prior to that I owned this tool for 2 years. It works extremely well. The battery life is very good and the tool performs well for a extended period on a battery charge. The tool does not jamb easily, but will when hitting another nail or something similar. It is easily removed and your able to quickly resume your work.",
        "Like this tool. The nails are more costy than the straight unit, but the slant is more versatile. Nice in tight areas to \"point and shoot\" where a conventional hammer-nail approach is always a major pain in the (...) experience. This thing will sink a nail out of sight in most anything.",
        "This has worked beautifully in its first few weeks of use. It got a lot of great ratings online. Glad I bought it!",
        "We use it to trim houses with. I was just expecting 2 battery’s the body of the gun is a bit larger than I was expecting",
        "I have 3 of these, all work great (4 yrs) and its a nice alternative to a blast of dust in the face every shot",
        "We install window coverings of all types, and I have always been curious about using a nail gun for plantation shutter install.Two of us just installed 21 shutters in 2.5 hours thanks in large part to the DeWalt angled nailer DC618K. I read the manual, charged the battery, bought some Paslode angled 2\" brads , 16 Ga. Fired a test nail, and started. No problems..love the belt hanger.It's not as heavy as I thought it would be, still was not tired after 2.5 hrs.Have used 3 times since with same results.Battery still hasnt been charged.Wish it would take shorter nails than 1 1/4\"....would love to be able to use 3/4\".",
        "The item came well packaged, no damage in shipping. The nailer is used and there are some wear smudges on it. They do not affect the action of the nailer. It is nice to not worry about the cords that other nailers require.",
        "Works as it should, not one misfire. Wish I had bought one years ago.",
        "very good tool. get lots of stuff done with it.",
        "Have used on chair rails, built birdhouse, raised flower box, and fixed/tightened up a few things around the house. Holds a super long charge and although can be a little heavy, but for the amount of time you save by not dragging a compressor and hose along the way.. I will take that weight every time.",
        "First nailer I have ever owned and I love it. Preferred 18 volt XRP because I already had three other 18v Dewalt tools. Saves on batteries.",
        "I bought this nailer to complete a project installing new baseboards in my house. I was very pleased with the results. It's not as heavy as I had expected (based upon other reviews) - it worked flawlessly. So much better than dealing with a compressor and hoses. I also considered the more expensive 34 degree nailer, but I'm glad I didn't spend the extra money... this one did everything I needed and the extra expense would not have been worth it. Highly recommended.",
        "I only used it twice and now it's not firing and I can't find out why. I checked everything and nothing is out of place but it's not working.",
        "I had a job to do that was very high up so I purchased this item. This cordless finish nailer is fantastic. It performed flawlessly every time. I would recommend this to anyone who does not want to drag a holes or compressor around.",
        "It's always great when a tool works correctly right out of the box. It's certainly much heavier than my compressor air tools but not so much to be hard to handle. What it adds in weight is more than offset by its convenience. Dewalt makes great tools. If only they would make them all in the USA.",
        "Works great!!! Perfect replacement for my old worn out cordless nailer. It will save me so much time.",
        "Love!! One of my favorite tools, easy to use and charge.",
        "I absolutely love this and I do not know how I lived without it. Excellent quality and price. I use it for everything. Received it quickly and was impressed with it's quality.",
        "It was a great gift for my husband for his birthday he loves it",
        "Still Shooting Nails after 1 year. I do not miss the air hoses. There is a safety on gun, be aware if gun will not shoot chances are battery is low or safety is on",
        "Greeat I think this is better than the 16g Senco seems to have a it more power",
        "Perfect, easy to use, light and precise. Excellent product & made our crown moulding project so much easier.",
        "First rate product. Can't believe I ever got by without it. No regrets pulling the trigger on this purchase.",
        "would not be with out it thanks again very fast shipping",
        "Worked like a champ with both 2\" and 2.5\" finishing nails.",
        "Easy to load and use. The only negative is it is heavy. I would highly recommend this tool.",
        "Not as good as my other Dewalt nailers but gets the job done.",
        "not sure why these dont come in 20v max BUT...still a good tool",
        "The best tool I have ever bought or owned and easy for me to use!! And, I do not need an air compressor!!",
        "I am a maintenance supervisor in Alaska. You don't want to spend a lot of time rigging a compressor and a hose to do some small jobs such as replacing window trim or blocking off a broken window. This tool allows me to do the job quickly and securely from a ladder or manlift in less time.",
        "Quality. Flawless. Nothing more to be said. I will buy the framing gun also.",
        "this gun is a no brainer. this is my 2nd one. it will pay for it self in no time",
        "This is my second Dewalt cordless nailer. I love not having to deal with moving a loud compressor in and out of job sites. And being free of an air hose really helps with mobility - especially when having to climb ladders.",
        "It is very heavy, but it does what I want it to do and that is to use it in remote areas.",
        "It takes awhile getting used to, a little heavy, a little bulky for tight situations. Otherwise meets expectations.",
        "I love this thing! My absolute most favorite tool! So nice to not have to carry around a hose and noisy compressor.",
        "Great Nailer. Not as heavy as I thought it would be. Only issue I have encountered is sometimes a misfire of a nail. Otherwise reliable and awesome design.",
        "With no need to buy compressed air, gas, hoses, etc., this is fantastic tool. All you need to do is charge it. I have nothing cautionary to say.",
        "I purchased this nail gun and suggested nails to try some DIY projects in my new home. I have to admit I was a little nervous about using it for the first time, but it's very easy to use.",
        "I love my new dewalt nail gun, very powerful. a bit heavy but it's genius. I dont have to deal with compressor nor air hose. good job dewalt.",
        "Works great. Used for 3 years now on large projects with no issues.",
        "An amazing tool to add to my set. It definitely makes building projects a whole lot easier with this cordless nailer. Very easy to use!",
        "This was to replace one that broke after years of use its my go to tool",
        "This thing works as advertised and the battery lasts quite awhile. It's nice that the battery is compatible with my other Dewalt kit too.",
        "I first tried the Black and Decker BDBN1202 (it was cheaper), the first one I received was DOA, the second one nailed inconsistently. I returned it and bought the DEWALT DC618K. All I can say this nailer blows away the Black and Decker, it may cost a little more but it is worth it. Save yourself the trouble buy the DEWALT first.",
        "My order was defective and never worked from the time I ordered it. I tried to have it fixed, but still no luck.",
        "This is the second nailer I've owned just like this one. It is the handiest especially when reinstalling trim etc.",
        "Used it for trimming out a couple of rooms. It worked fantastic no problems.East depth adjustment . Used 1.25 inch nails to 2.25 worked flawlessly. What a time saver also have nothing negative to say about it.",
        "Well worth the expense to fo trip or finish work to avoid having to us a compressor etc. Work well and set the nails just right.",
        "It is everything that was promised and more. The batteries last a long time and the rapid fire setting is awesome. It will shoot as fast as any air gun. It is heavy but seems to be well built. I have been using the paslode finish nailer for the last few years but this gun will easily replace that. No gas cartriges to buy makes it very attractive. The nails don't leave any plastic things that have to be removed before you putty and paint."
    ]
}