{
    "entity": "Finish Nailers",
    "text": [
        "Jammed on my third use. But here's the deal. I'd loaded two different size finishing nails. Oiled, but one sleeve crept up on the other. Maybe two different brands? Maybe two sizes were the issue? A warning to others that my gun, or maybe my operation of it, was temperamental. My last finishing nailer, a Bostitch, blew plastic parts out of the assembly when it broke. So I've repaired this one and will see how it does. I like the features of the gun: offset so I can see my work, a built in blower to clean-up after myself. But it seems to me I saw a review elsewhere that one needed to be careful about the brand of nails.",
        "I order this product as well as a Milwaukee M18. I have just about every Milwaukee M18 you can imagine. They are good. But I ended up returning the Milwaukee after comparing. This Hitachi is really amazing. It always drives the nails flush if not slighter deeper. Love this tool- Will worth the money!",
        "Have tried nearly every brand of nail gun available, but nothing seems to work well consistently like Hitachi. Don't trust or even like most of their electric tools, but their nail guns are the best you can buy, and I use mine daily.",
        "This purchase was to replace my PC finish nail gun. The repair parts for the PC gun was half the cost of this Hitachi finish nailer so it was a no brainer to just replace it. Hitachi nail guns are well built and reliable, my Hitachi framing gun is 25+ yrs. old and it still works. Hope this finish nailer will last as long. Like the dust blowing feature.",
        "Having worked for Lowes I had the urge to by tools for use around my home. Know what I did about to old I didn't just want to by a glorified Black And Decker but I wanted quality tools that were the best bang for the buck and hence I ended up with many Hitachi tools for use with may wood working projects and in short could not be happier with Hitachi quality! I bough this nailer for use in multiple planned projects and so far it worked as averted and not one bad thing to say!",
        "Good product comfortable grip and seems to be well built. I've used this gun a lot and as long as you oil it regularly I think it will last me for years to come. Take care of your tool and your tools will take care of you.",
        "I bought this to replace a Bostitch nail gun that seemed to continually jam. So far, I have been very pleased with the nail gun and it hasn't yet jammed. I'm not sure the air blast feature is all that useful, but it doesn't hurt having it.",
        "Bought 4 as these are simply the best finish guns and we use them daily installing wood flooring and trim. Only had a problem with 1 gun, will not fire at all, definitely a internal problem, but for the price not a problem and still a very good deal as these guns will last forever, only bought new do to new employees and not enough but we have 10 of these guns and use 9 of them daily and work perfectly. Will definitely buy more if or when these ever break down. Recommended for sure.",
        "Easy to use. Holds a range of nail sizes. Has enough power with 80 psi to drive 2.25\" nails thru 3/4\" quarter rounds and thru the metal door frame base! Excellent. It's Hitachi so I have hopes it will last a long time.",
        "Unit works fine, no jamming at all , very well balanced and has a good quality feeling when you use it. I have own also a 15 gauge finish nailer from Hitachi and it also performs as good as expected. I will be buying a 23 gauge pin nailer as soon as Amazon gives me a little discount on their price. Yes I would recommend both of these nailers to a friend. Amazon is a great vendor.",
        "Solid beautiful construction. Clean crisp nail shots, very happy. Only con I’d say is the manual psi call out seems about 20 psi too low to have any knob depth control.",
        "A reliable, accurate and precise nail gun. A joy to use. I found it on sale- wish I had bought two.",
        "Treated myself when I saw I had to baseboards and door trim. Nothing beats the convenience! No missfires, jams etc. It does suck that it shoots blanks, so keep an eye on that. I got trigger happy because this thing is awesome, and realized half a board wasn't fastened. Whoops!",
        "Easy to use, right out of the box! Bought this nailer for doing an assortment of finish molding work in my new house. Based on my first project, adding casement to a number of windows, this gun is perfect for my needs. It is lightweight, easy to load and drove 1.5\" finish nails very consistently. So far, so good. Highly recommended.",
        "This is the best investment to be made. Used it to install Chair molding and the install went easily. Much better than Hammer and nail.",
        "I like the gun very nice but no hooks that pisses me off because of that probably will not buy another 1",
        "Good delivery. I like the way the gun feels and and sounds. The feature are great. Magazine loading, wide span of nail length, I love the feature of the air blower and the ability to move the exhaust air direction. However, I doesn't countersink 2 1/2\" nails 100% of the time. I take off the little plastic tab at the safety tip. If the wood is soft you can't press too hard or you leave a trail.",
        "Wished I had gotten one sooner! This is well made, easy to adjust, and just works like it should.",
        "I'm a job lead for a for a general contractor. I bought this gun about a year ago and as a whole am pleased with it. I've shot probably 20,000 nails through it and really my only complaint is that I really have to make sure I hold it very tightly and flat against the board I'm nailing, otherwise it will leave nails proud a touch. This is with my compressor set at 110 psi regulated pressure.",
        "Works great and even has a cool blower built in. Sinks all the nails properly without leaving nail gun indentations",
        "Good tool, and reasonably priced. Saved my neck & shoulders, installing 3/4\" T&G ceiling throughout cottage. Drove 2\", 16ga nails slightly below surface throughout project, without a hitch. Modest, \"pancake\" compressor was very sufficient for running it.",
        "Works great. Drove nails through hickory flooring. I wish I bought this years ago, but I was too cheap.",
        "Lightweight pneumatic nail gun; perfect size and comfortable for what I need to use it for to re do some of the finish work around the house. Very pleased with this purchase for the price. I've owned several Hitachi tools over the years and have never had any problems with them.",
        "Great nailer. Love this gun. I do a fair amount of work at home and for family and friends and used this nailer on a number of occasions.",
        "The Hitachi nailer has worked beautifully. I have been using it to install tongue and groove wall boards as well as one inch planks. It consistently sinks the nail heads and so far i\"ve put up a couple hundred boars without a misfire . It is easy and comfortable to handle and has met my needs perfectly.",
        "I bought this gun last year early OCT. Use it for about ten days to complete my project. Thereafter I kept it in the store, yesterday (1st Feb 2018) I bring out to nail some plank and then I notice the tip of the gun rusted and some of the part around that area showing sign of getting rust. I have no other issue when using this gun, only at time I have difficulties to adjust the penetration depth. But this rusty part really disappointed me. Ps. I have made a thorough clean up before I store it.",
        "30 nails into it, the ribbon spring broke. A friend of mine has had this model for years and no problems. Ordering another. Will write a review with the new one as well",
        "Love this gun. Durable hasn’t Jammed at all. Very dependable and lite weight",
        "Purchased to install chair rail and crown molding in a nursery, performed flawlessly powered by 30 gallon compressor and DEWALT DCS16200 2-Inch by 16 Gauge Finish Nails",
        "I bought this a few years ago and have put it to good use. The dust clearing feature may be the most under-rated idea in a long. I love it. This sets the nails nicely and for the occasional jam, is easy to clear. Great quality gun that work like new.",
        "As usual Hitachi delivers the best air nailer. Light enough to work with all day and powerful enougj to shoot thru the hardest woods",
        "Pretty good value for the price. Could have a few more features, but a strong consideration if one plans to only use the tool for some minor home improvement / remodeling projects.",
        "New item as described in new box, and never open at a more than competitive price. Works like any other hitachi bought in any stores. Happy with time delivery also. Many thanks.",
        "X hubby liked it. He said it worked really well. We put down hardwood floors through out the house. Never a hiccup.",
        "Hitachi is always spot on with their nailers. Have their framing, roofing 15 gauge, 18 guage nailer. Quality is simply the best with great features. Highly recommended.",
        "Used on Brazilian Cherry and Koa (I.e., pretty hard) flooring and trim. No problem driving to desired countersink depth, which WAS a problem for my $35 16 Ga Harbor Freight Brad nailer.",
        "This nailer works well. I dropped a star because it is too large to fit in my smaller places.",
        "Used this to complete kitchen island trim and several other small projects around my house. Works great. Would highly recommend.",
        "Very nice. It has been working very well. My brother-in-law was impressed, and maybe a little jealous of the good deal I got.",
        "This nailer works flawlessly. I completed a large room with tongue and grove pine and fell in love with it. I would recommend it to anybody. I'm proud to own it.",
        "Great finish nailer. My first finish nailer and I love this thing! I dont write reviews untill I use a product for sometime to make sure it holds up. After two closet built-in projects and many other projects, this nailer has served me well! Would definitlt recommend if your in the market for a finish nailer.",
        "This thing runs like a clock. I put a few drops of tool oil before each use and I've yet to have a jam. Awesome gun!",
        "Very happy with the quality of this gun so far. I don't think I'll be disappointed as I have the Hitachi's framing gun and am happy with it's performance. Easy loading of nails, lightweight, rubber grip and molded plastic case. The air port for blowing dust away is handy for seeing your work. Used 2.5\", 16 gauge finish nails to set furrings strips instead of screws. It made for quick clean work. I will use the same when trimming. I am pleased with Hitachi tools. Along with nails guns, I own a 10\" compound saw and their 7 1/4\" circular saw. Both great products.",
        "I bought this to install hardi trim which required a 16 gauge nailer. It just barely puts the 2.5\" nails into the hardi siding product at the max 120psi and I have to hand finish about half of them with a small finish hammer. I haven't tried 2\" nails but I might have had better success with a slighter shorter nail. That being said, it still made the installation go much quicker than pre drilling and hand nailing even with hand finishing them a bit. If I have a chance to try out the shorter nails I'll update this review.",
        "On time. I have a brad nailer and needed something bigger. The nailer worked very good out the box.",
        "To me there is nothing to dislike easy to use great nail gun",
        "Good price compared to other places, reliable and very useful tool. I would recommend.",
        "Timely shipping as always using Amazon Prime. I have used this finish nailer extensively since I purchased it. One jam is all I have experienced, and the quick release latch that Hitachi has on this nailer makes clearing a breeze. I highly recommend this nailer.",
        "I do a lot of trim work and this serves my needs perfectly!",
        "Perfect depth adjustment. Targets the nail spot perfectly, a must when securing the tongue and groove on exterior siding.",
        "The package was delivered without damage and mostly recyclable. The tool is surprisingly light but the first test showed it could do the job. It drove 2 1/2\" brads into two 2x4's without much kick back and the heads were flush with the surface on the first try. I put up molding around couple of windows to see if it still did the same thing and it was fast and true. The instructions recommend using a couple drops of pneumatic tool oil every time the gun is used and that is the only extra cost.",
        "I wanted a power upgrade from my 18 gauge Bostitch since the smaller diameter nails often bent wildly in thicker wood products. This unit is easy to use and adjust. It really powers the nails into the wood and has performed very nicely during the limited use I have had so far for 1-1/2 and 2 inch nails. I have not had occasion to use the air blow feature, but it worked during test. I certainly would recommend this unit.",
        "this is an awesome tool. was very happy with it",
        "Like this finish nailer so much more than my old Bostich. It has the features of a bigger gun and works perfectly.",
        "I really like the 16 ga. Hitachi nailer. I bought it a few months ago and have been using it a lot when installing trim on two residential remodeling projects. One of my sub contractors has taken to using it a lot, too.",
        "This Hitachi 16 gauge is perfect, it sets the nail heads just right every time, light weight. It has a button at the top of the gun that when you depress it, you can blow off the work area. When I first read about it, I didn't think much about it, now I am constantly using that blow button. I have so far installed three rooms of crown, door, and floor molding \" no jam ups\".",
        "this is a quality Item so far it has surpassed my wants and needs and a five year warranty doesn't hurt either.",
        "Very light, well made, and the dusting feature is more useful than you might think",
        "Very pleased with its performance. As a \"do it yourselfer\" this was a pretty good buy.",
        "Been using the same Hitachi Finish Nailer for 7yrs with no problems. Hitachi = Reliability",
        "good quality and easy to use. great for window trim and baseboards. saves lots of time with no splits.",
        "Made very good and looks good and works very goodl",
        "This gun works well as a replacement for my old 16 gauge Hitachi gun, which is 10 years old and still works but jams too often .This version has a quick release so jams are easier to clear now hope it lasts as long.",
        "A very good tool. Reasonably priced. Works exactly as expected even if the styling is a little over the top.",
        "Great nail gun,been using pas lode im250,my new Hitachi needs no gas and no battery,what more can I say.",
        "Great gun the only thing that needs to be redesigned is the spring loaded nail tensioner.",
        "I've borrowed or rented a few of these nail guns over the years. This is the best I've found. Will purchase a Hitachi framing nail gun soon since I'm impressed with this one. Serious tool if you want the best.",
        "This tool rocks, lots of power to drive the 2 1/2 pins and light enough to use all day! Butt ugly colour though!!! LOL!",
        "What more could you ask for this is a top notch nail gun . Quality made ,light weight,no feed issues very reliable, easy to adjust comes with a nice case and does what is expected of it !",
        "This nail gun is bad to the bone . Love it.",
        "I have owned Stanley, Porter Cable and Senco finish nailers. This holds it's own against any of them and is very dependable. Recommended",
        "Used it to build a back yard shed. All the way no problems at all!!",
        "I purchased this to install the end boards on 3/4 inch hardwood floors. Nailed worked flawlessly on the thick floors. The built in dust feature was very useful as well. Comes in a very nice storage case for neatly packing away.",
        "I was so impressed how easy it was to use and how well it nailed!",
        "This has worked very well for me. I've only put 100s of nails through it, not 1000s so far. I will note that some nails don't have enough material in the \"T\" portion of the nail to engage the top of the loading mechanism, and thus don't work in this nail gun.",
        "I used to buy all Bostitch. Since purchasing my first Hitachi, I have switched all of my pneumatic tools to Hitachi.",
        "The product description on Amazon states that the Hitachi NT65M2S is \"oil free\". This is incorrect. The nail gun needs to be oiled according to the instruction manual. I also contacted Hitachi support and they confirmed that yes it has to be oiled. I have not used the nailer yet because I was waiting on clarification about the oil. I expect the tool to work well. So just follow the directions in the manual.",
        "Looked used , but I expected that . It works well , which is what I wanted , very pleased .",
        "First experience with an air nailer. I was not disappointed. I'll have to use it on more projects to really evalute it but so far great.",
        "This is the bomb, favorite nailer I've ever owned, they got it exactly right.",
        "Another great value from hitachi.used it over and over without a single problem Love It.",
        "I'm not happy about the depth it sets nails. Set at deepest setting and still getting shiners fairly regularly. As I use this gun for a living, I'm not too crazy about having to carry my nail set around all the time.",
        "Easy to use. It will not double fire that some other brands will do. No jams as of yet. Good purchase.",
        "good product, but it took almost 2 weeks for delivery time"
    ]
}