{
    "entity": "Torque Wrenches",
    "text": [
        "This thing sucked. You are supposed to store torque wrenches at their lowest torque setting, but the wrench at it's lowest setting is TOO LONG TO FIT THE CASE. Also - SO MUCH PLASTIC. They are riding the Snap-on affiliation but don't do it. Spend $20 more dollars and grab the SK Proto - USA made, all metal, certification certificate and a case that works.",
        "If you've ever looked at the $30-$40 Horrible Freight torque wrenches and thought, \"Yah, that will be good enough.\" then you should stop looking at this product. If you prefer the German torque spec system of \"gütentite\", look elsewhere. You are not the target audience. However, if you want to actually keep the wheels from falling off your car or avoid overtorquing the bolts connecting your transmission to your engine, this is what you want to buy.",
        "This is a high quality torque certified tool . Bi-directional. Ratchet but not for tightening. securing only. accuracy within +- 0.005%. Must remember to test up to load tolerance. then when done with application. It is crucial the torque setting is let back to zero. The adjustment tang is smooth and quiet. It locks easily and retains a setting. treat it like a baby. The tool will function flawlessly. I found the settings to compare accurately from the low range all the way to the peak settings. ypu will not go wrong here.",
        "I believe in buying the best tools you can afford. CDI fits that bill. This wrench looks nice. Its easy to use and easy to read. The comfort grip handle I thought would be cheap rubber slid over the handle, like what's on a bicycle hand grip. Its not. its a nylon,or plastic handle that feels good in ones hand. I'm positive you could find better...for hundreds of dollars more and seeing I use these for my Harleys and my cars its perfect and reasonable for me. If I'm ever called upon to work on the space station then I'll buy the more expensive ones.... just saying",
        "Pretty simple review; if you would prefer a high quality long lasting tool, particularly one that comes with a certificate of calibration, and you're willing to pay for it, this is your choice. It's less expensive than the \"Snap-on\" name for a nearly identical product. If you are instead willing to permit some discrepancy in the torque you apply to whatever it is you're fastening, and/or replace the wrench from time to time, then buy a cheaper option. I use mine on brake calipers, and expect it to last a very long time, so spending the little bit extra for that piece of mind was worth it.",
        "This is my third CDI torque wrench. The previous 2 I've own for a few years and hold in high regard. This unit doesn't disappoint. I needed a wrench to be accurate @ 72 in/lbs to adjust an automatic transmission band. I tried my best with what I had, but based on the transmissions behavior, it wasn't correct. Once adjust with this wrench, it shifts like a dream. The wrench isn't nearly as big as the image shows. I think the image is just a generic photo since there are many versions of this style of wrench.",
        "I know torque wrenches. I worked on nukes and had 12 various torque wrenches available for this purpose and all were calibrated monthly. This torque wrench is solid and performs nicely. Over time all torque wrenches need recalibration. Careful handling should keep this wrench performing within (+/-) 2-3 % for several years with moderate use.",
        "This is a great torque wrench for the money. Sure not the quality of a Snap-On, but far better than many of the big box store brands. The factory calibration showed the wrench was spot on in the middle of the torque range and only a about 2% off at each end of the range. I'm already looking to buy a second one in 3/8\" drive and low end torque range.",
        "Returned first one upon receiving it because it did not work, it was essentially a breaker-bar. No click. My fault for not testing the second one (I finished job I originally bought it for while processing the return) because I just went to use it for the very first time and exact same thing. Unfortunately I’ll now have to send to CDI directly since I didn’t test it when I received it and nearly 9mo passed. The seller was great, first exchange occurred very smoothly. Just very disappointed in the product.",
        "I like it. Much better quality then the typical China torque wrenches. If your used to using snap on tools then the direction selector will be opposite of what your used to. I've been using this tool for a few years now and it still works fine. I had to tape the direction lever as it would flip itself when I use it on say a valve cover or oil pan where there are lots of bolts.",
        "This is a quality tool. Comes packed in a molded case and includes a report on calibrations. Exterior indicates date of calibration. It has a solid feel to it and is easy to use. I bought this to replace my 25 year old Craftsman 3/8 drive wrench whose locking plastic collar had cracked. The locking collar on this wrench is metal.",
        "I shopped for a long time for a replacement torque wrench after my old Snap-on died. I have a newer Sears Craftsman one but I have never liked it or trusted it to be accurate. The quality of this torque wrench is what I would expert for professional use and results. I do not regret paying the higher price.",
        "Very nice! It's much better than my old wrench...it adjusts so much easier and quicker. It comes with data sheet to indicate the results of the accuracy test. Well worth the price if you use one regularly. If you only use one occasionally for minor issues (body bolts, lug nuts, etc.), then a cheaper one would do. If you're doing engine work, get good tools.",
        "It works great. finished my mechanical project and now its helping me with new ones. just found out tho, that i was under the mistaken assumption it has a lifetime warranty. it doesnt. just 12 months. i better start looking for an alternative ...",
        "Replaced 10 year old Craftsman wrench that eventually broke (the dials fell off). This one is in a different league, pleasure to handle and use.",
        "This is a beautiful little torque wrench, and I'm going to take good care of it. Don't forget to unload the wrench before storing it by lowering it to it's lowest setting! (Don't turn past the lowest setting, though.) It came in a molded case with calibration papers and an anti-rust pack (similar to those desiccant packs that come in shoes). I'm keeping all of those things in the case with it just like it came.",
        "Ordered this wrench to add to my collection of tools. It's the perfect wrench for bicycle repair. Wrench is only 11\" long. Very nice. Ignore other mentions of the clicking sound not being audible. One must understand this is an inch-lbs wrench, and such low torque doesn't create enough force for a loud click. The wrench gives in such a way when it reaches desired torque, one would have to have 0 mechanical skill not to know it's indication. Laser etched Nm, and In-lbs.",
        "This is a great wrench. It replaced my 50 year old wrench when the ratchet failed. This wrench has a longer handle which makes high torque settings easier to reach. It came with a calibration sheet showing the actual readings across a range of settings. It comes in a hefty plastic box which I feel many people will not use long.in the shop but if the wrench rides in a truck all day the box will be indispensable It is pricy but it gets the job done..",
        "I purchased this primarily for use of torquing automotive components to specification. The dual metric/SAE readings are nice and allows for torquing to both specifications depending on the component manufacture. The only thing annoying is the collar used is not easy to initially handle when setting torque, but gives me more confidence that the wrench will not have additional play during use. The other big plus is the storage case that is used, which makes transportation and storage easy!",
        "Picked this up to torque the wheel nut on my Ducati 1299 Panigale S and girlfriends Monster 1200 S. Requires 160lbft of torque and this torque wrench does it perfectly.",
        "I really did my research on click torque wrenches. I appreciate all of the feedback on all of the products as it helped me make my decision. I went with this CDI for it's reputation in the feedback section. It's a solid tool, easy to set and after 8 spark plugs, and 16 bolts and 5 lug nuts it has worked GREAT. This tool gave me a sense of confidence that everything was tightened per spec. It does cost a bit more than some of the other brands, but how much it peace of mind worth? I HIGHLY recommend this CDI torque wrench!",
        "I really liked the quality and feel of this unit. It works great to torque the bolts on my ktm and the nm as well as the inch lbs are both useful. They say that the beam wrenches are pretty accurate to but I don't always get to line up directly over the wrench to read it properly so this unit works much better for me.be sure and back the setting back to around zero each time your done with these clicker wrenches or they will be inaccurate in no time. I basically ruined two other models not realizing this, bottom line, your going to love this tool!",
        "This is a quality tool that works well in both directions which is needed when you torque up left hand threads on vehicle lug nuts. The length is good for the torque range it covers and the settings seem to be accurate.",
        "I had a beam-style wrench, but found it more & more difficult to put the torque to it and keep an eye square and true on the gauge at the same time. The final straw came when I had to torque the disc brake frame on my Chevy truck. I had to (re)jack it up higher so I could lay under the truck to see the gauge. With the ease of using this wrench, I no longer find myself muttering 'I keep my torque wrench in my arm' and almost look forward to the next time I need it.",
        "The tool works well, except the ratchet direction toggle is a little too loose, and is easily bumped into the middle position, meaning when you're using it in tight places, the ratchet will probably get knocked to the middle position (meaning no ratchet in either direction). I ended up putting tape over my ratchet lever and leaving it in the tighten position.",
        "Good tool, only wish the markings were easier to see. I find I must rotate the tool around to the light so I get a proper election from the light source to read the settings. Unlike many, this tools case is actually useful.",
        "CDI is a known brand to me, used for assembly opperations at my employment. I tested the wrench on our $100,000 test machine and the increment accuracy was dead on throughout the entire range of tool. Fantastic price for this quality of torque wrench, plus this model operates in both directions.",
        "When garage wants to over charge for work You can perform on your own You need this to make sure that you do nut over or under tighten fasteners. It has already paid for its self.",
        "Wow! I got this to replace a Craftsman torque wrench that was going. This is 10 times nicer than my old Craftsman. Design and fit and finish are great and it's obviously very solid and well made. AND made in USA!!! I used for the first time the day it arrived and it worked like a champ. I'd buy again in a second.",
        "This is one of the only hand tools I have bought that have been this expensive and now I can see why this is valued at such a price. This unit is very well built when compared to my other torque wrenches and feels very well balanced in hand as well. I would instantly upgrade my entire torque wrench arsenal to CDI/Snap On if my financials allowed it. I would recommend this wrench to others.",
        "Durable and lasted 5 years of daily use in an auto shop. Cant ask much more of a tool in this price point",
        "I don't have any other Torque wrench to compare this too in my tool arsenal, but this is a very well made wrench. It's easy to use and you can hear and feel when you have reached your desired setting. I used it on my 899 Panigale and it worked well to my knowledge.",
        "Needed a torque wrench for a certain job we do on a daily basis. Works great.",
        "well made and easy to use. This is for inch lbs and its great for lower torque specs. Other reviewers said they like the \"click\" sound...mine doesnt click but it goes to free play when the proper torque is reached so that you dont over torque and break a bolt..etc The pic makes the wrench look long...its not, apprx 11-12 inches",
        "This wrench is built by the same folks that build Snap On wrenches. Top Quality and performs exactly as expected. I am an aviation mechanic and second best is not good enough. You will not go wrong with this wrench.",
        "Really good quality. Comes in a nice case with a CDI label stating “A Snap On Company”. So far so good. Gives you a nice audible and “feelable” feedback. Torque measurements go up in increments of 20Ft Lbs.",
        "Perfect for getting work done on my engine head where my 1/2-drive torque wrench is just too large (such as for spec around 10ft-lb). I'm very happy with this, my second, CDI wrench.",
        "Worked well right out the box. Torqued my ARP balancer bolt to 235 ft/lbs without trouble. The length gives good leverage.",
        "This is a very high quality torque wrench. I needed a torque wrench in this size range for torquing smaller bolts and oil pan bolts on my car. I had used cheaper made in China wrenches in the past, and they were worthless. The wrench is expensive, but it is worth every penny when you consider that you are using a precision instrument for precise torque specifications. The wrench is easy to set and clicks cleanly. I also like that it comes in a nice plastic case with a calibration certification.",
        "I was looking for a good torque wrench and happened to stumble on this one. Good thing I did made in the USA all the specs on the certificate are with in a few pounds really nicely built. Works great as well. Highly recommended.",
        "Good quality torque wrench, although the reversing switch is pretty easy to move accidentally, as other reviewers have mentioned. I didn't have as much trouble reading the values as some reviewers, but you need good lighting to see them.",
        "As the title says Best torque wrench for the money!",
        "I was warned that cheaper Asian sourced torque wrenches can be inaccurate, and I prefer to save American jobs, so I looked at U.S. made products, and this is the only American made torque wrench I could find that was both fairly affordable and has a lifetime guarantee. I've only used it a few times so far, but it's worked flawlessly. When I get an inch pound model I'm going back to CDI.",
        "I did not trust my Harbor Freight one, so I got this. Seems very high quality.",
        "I needed a torque wrench for the work I was doing and will be doing on the truck. Snap-on is one of the top tool makers and CDI is a branch of Snap-on. This wrench torques in both directions. I could have went with a cheaper brand, but you get what you pay for, so I'm looking for this torque wrench to last years, with proper use and care.",
        "Less than a year and the mechanism locked itself, not before ruining a couple of jobs. I was trying to avoid it but going with Snap On now.",
        "I was in the market for a new torque wrench after my Craftsman which saw use maybe 3 or 4 times stopped clicking when the torque setting was reached. Started looking at the better brands such as Snap-on but they were out of my price range. Found this one and after looking around determined it's the same wrench as the Snap-on labeled one and built in the same place the same way - just the laser engraving for the brand is different. That's precisely the case, a friend has the same wrench branded as Snap-on and they are identical except mine saved me a fat stack of cash.",
        "Awesome quality product at a great price. Very happy with the torque wrench.",
        "Great product. Has held up well on my service truck. included cases work great at protecting the tool.",
        "Compared it to my MUCH more expensive torque wrench and it was dead on accurate. Quite a deal for the home mechanic/hobbyist. Comes with calibration card as well.",
        "I used this torque wrench to torque ARP studs on a 6.0 Powerstroke and it worked great. Plenty of leverage with the long handle. I still use it for torquing my wheels and it has lasted very well. Quality is top notch.",
        "Like how it works. The only draw back is it takes forever to turn it to 90lb, and back to zero when the job is done.",
        "Snap-on quality at a discounted price. I've used this wrench many times and have no complaints.",
        "Well built, accurate, very east to read scale with NM and In lbs. on separate sides for easy setting. Well built locking mechanism which I much prefer over screw type and nice comply handle. Perfect addition to my kit. Compact and sized perfect for it capacity. Would purchase another.",
        "I Use it professionally. Does just as good as the several hundred dollar torque wrenches.",
        "This is my third torque wrench from CDI. They work great and not insanely expensive. Much better than all of the digital junk out there.",
        "I bought this wrench to use when working on our dirt bikes. Many bolts on motorcycles have low torque values and thus need a more gentle touch than a 3/8-Inch torque wrench. The 20-150 range covered all but a couple of bolts (mostly plastic bodywork and axle bolts) on our dirt bikes. The construction is sturdy with a nice clickover head. The wrench features inch pounds and newton-meters which is perfect for motorcycles, since many torque values are displayed in newton-meters. The price may seem a bit high to some (its really about mid-range), but if you're worried enough to bother buying a torque wrench, why buy a cheapo one?",
        "FANSTASTIC, ULTRA ACCURATE, AWESOME QUALITY. Don't waste your time or money on a \"digital\" torque wrench, they are, ALL of them, just an expensive POS. This thing is a tough little beast as well",
        "Decent but delicate. My crew ended up breaking 3 of the 8 that I bought. To be fair, they are used to working with foot pounds instead of inch pounds. Supplier replaced all 3 broken wrenches at no cost. Very satisfied, just be careful with them.",
        "great quality nice feel ,accurate ,appears to equal quality to higher brand name wrenches at lower price",
        "Well made and works well. Easy to adjust the wrench to the desired torque setting. Comes in nice plastic storage case for added protection. Highly recommended.",
        "Excellent torque wrench. Comes in its own hard case and certified test certificate. Numbers in Lb-ft and N-m could be provided in higher contrast for easier reading (they are imprinted on the chrome barrel) but they are readable. Also, for dummies like me the instruction booklet should show how easy it is to remove the socket after use - there is a button on the back of the wrench head which unlocks the socket when pushed.",
        "Very good quality, you can tell it was built by Snap-On. It was also supplied with a spec card that shows how accurate the tool tested in terms of torque. I would definitely recommend it for anyone looking for a high quality torque wrench that does not want to spend a load of money on a Snap-On branded tool",
        "I got this for working on my Mountain bike, and it is extremely well crafted and seems accurate. I consider it a huge mistake to have gone without one of these torque wrenches for so long.",
        "Essentially the same tool you would by from a Snap On truck for a fraction of the cost. Quality is High. Calibration is certified.",
        "This torque wrench did fine, I assume, since I didn't test its results with another torque wrench. It's easy to use and good quality.",
        "Very strong, high quality tool. Mainly bought it to torque the nuts on my Kubota tractor. The length of the wrench really gives you nice leverage to make high torque pretty easy.",
        "Not cheap compared to other torque wrenches but you get what you pay for. Use this on my Harley Davidson road King. Used other cheaper ones and no comparisons.",
        "I haven't tested its calibration but it seems to be pretty accurate and the construction seems to be solid for its price range.",
        "Great tool for the price adjust nicely case included only down side torque wrench will not fit in case at lowest printed torque setting I store all my torque wrenches at the lowest setting of its range",
        "Great torque wrench , has worked so far and seems to be fairly accurate. The case that comes with it is durable and easy to use",
        "Works very well, professional quality. Be sure to note that always putting the torque selection back to the lowest level after use helps to maintain calibration.",
        "Awesome product! I can see where the left/right switch is loose yet it hasn't caused an issue yet.",
        "Now that I am a grown-up and can afford real tools, this is a welcome addition.",
        "This is a heavy duty unit. It feels good and solid and is easy to set once you read the instructions. I would definitely recommend this torque wrench to others.",
        "SnapOn quality for hundreds less than tool truck price. The handle lock is positive... won't slip under high pressure.",
        "I really like these Snap CDI Torque Wrenches Order an additional small in-lbs model as well once I saw the quality and certification certificate. Excellent value with comfy handled.",
        "I stripped some screws on a low priced torque wrench I recently purchased. You get what you pay for. Purchase the CDI, and no more stripped screws. This CDI torque wrench is fantastic. Very accurate. I would highly recommend CDI wrenches.",
        "I bought this torque wrench to torque the lug nuts on my 5th wheel, works great, way better than craftsman, nicely priced also",
        "Just what I needed for the job at hand. It was even better because it had markings for Newton meters as well.",
        "great torque wrench, MADE IN USA, i take care of this one",
        "A nice micrometer style torque wrench that's price competitive with models of similar quality. Very good accuracy and a very distinct indication when the set torque is reached. My only gripe is the looseness of the ratcheting directional selector, much looser than similar 1⁄4 ratchets. Its so loose that it is difficult to keep in locked without constantly holding onto it, a difficult proposition while working in a confined space.",
        "Works great. Have a little piece of mind ordering this over the other no name cheapie brands. Will be ordering another one with a lower range for engine bolts on my F4i.",
        "Same comments as 2503, professional quality. Remember to set to torque back to lowest value after use to retain calibration.",
        "Excellent quality. The longer handle really helps out on the upper end of the torque range.",
        "Packaged well, easy to set torque requirements on wrench. Did what was expected of wrench on my RV Trailer lug nuts. Very solid device that will confidently hold up for as long as I own the wrench.",
        "The 3/8 drive snapped off after a little over a month of normal use, now I have a $140 paper weight.",
        "My first review ... \"Fantastic torque wrench!! Wish the numbers were better defined/colored, but this thing is a beast ... So well made!\" I like it so much I bought another for one of my sons!",
        "Really good Torque wrench. Locks into torque specs so it won't adjust while you use it. Good craftsmanship and overall appearance..",
        "Nicest torque wrench I've owned ,hope it lasts most brake at the ratchet head.",
        "Seems durable, good piece...not sure if it is truly a \"snap-on\" derived product but it gets the job done and comes with a certificate of calibration.",
        "Surprisingly nice quality - very accurate, heavy duty, and easy to use. 160 ft-lbs felt like nothing!! Comes in a nice plastic box with a calibration certificate. Highly recommend!",
        "Very nice tool. High quality, easy to read markings and easy to set.",
        "This is an excellent torque wrench. I use this for changing spark plugs in my 2500 HD Chevy truck. Works great!!",
        "Just what I wanted. Better quality than the Sears Chinese version. Works on motorcycles and firearms. Looked around for awhile until I found this on Amazon, good price also.",
        "A quarter-inch drive torque wrench is must-have for working on aluminum engines; this wrench comes with a nice case too.",
        "This torque wrench did everything I asked of it. I needed something huge for the wheel bearing nut on my truck, and this tool was perfect.",
        "Next to the digital Snap On I use for special projects, this CDI is built just as good. I have total confidence in it working on my HD engines.",
        "does exactly what the husband needed. Very accurate. easy to adjust. and best of all, hasn't broken in the months we have had it like the other cheap ones he bought.",
        "A Snap-On by any other name is still a Snap-On. Excellent quality, works very well."
    ]
}