{
    "entity": "Torque Wrenches",
    "text": [
        "WAY OFF! This looks like a good wrench, but the actual torque is way over what you dial in. I am about to start on some motorcycle engine work and wanted to verify the accuracy of my torque wrenches, so I picked up one of these:  Glad I did because at a 75 ft-lb setting on this wrench, it is delivering well over 110 ft-lbs of torque when it clicks.",
        "Budget torque wrench! What else is there to say? Also, used as a breaker bar in an emergency one time; didn't lose its accuracy! Great to have on-hand at all times!",
        "DON'T BUY - WILL ruin your project. Purchased this wrench to affix a barrel to an upper receiver. Destroyed the barrel wrench, and the torque wrench never clicked. I figured it was user error. The barrel manufacturer sent a new wrench. On a tip, before attempting to try it again, I mounted a craftsman 1/2 in wrench in a vice, set the torque to 25lb, and the 1/2\" wrench broke before the torque wrench ever clicked. Due to the delay in getting the new barrel wrench, I'm one day past Amazon's return policy, so I'm now blessed with an over priced breaker bar.",
        "This item is junk. Unfortunately I apparently waited to long before using it to find out it was junk and cannot return it. Save yourself some money and by from another dealer.",
        "I bought it four years ago but only used it four or five times. I tried to use it to tighten the lugs on my snow tires to the recommended 80 ft-lbs of torque and something snapped inside. Useless now.",
        "Seller did great job on refund. Torque wrenc very bulky and hard to read or use.",
        "I have a regular 1/2\" drive torque wrench with a pointer for the ft.pounds. Works great but I wanted a Clicker instead. Found this 250 ft/lbs torque wrench cheaper thean the 150 ft/lbs so I though I would give it a shot. Well I find this wrench to be great, with easy adjustments and with the 25\" long handle it's great for torquing wheels on your car.. It even comes with a plastic case. It works great for me and I would buy another one even for a gift for a friend. I recommend it to all who use this kind of tool..",
        "Love the fact that this wrench has such a long arm on it - it makes it very easy to to get a smooth tightening motion with little effort. I do wish the gauge was a bit easier to read because with the whole unit being chrome and the numbers being small it is difficult to just glance at it and know where you're at. Inking in the numbers would probably help with this.",
        "very good product, I'm happy I bought it. I recently replaced the whole suspension front and rear on my 2001 Toyota Avalon and put this wrench through serious work. the long length of the wrench makes it a joy to use specially on bigger bolts and nuts, the clicking sound is loud and satisfying to the mechanic ears. the handle (good thickness) fits well in the hand :-) my only complaint is the locking dial that sometimes won't lock the measurement completely, letting it change as you push or pull. a little annoying but not that bad. I would recommend this wrench.",
        "this is a hefty torque wrench. the weight feels good. it is easy to adjust and lock in a new value. it works both clockwise and counter-clockwise via a little lever on the head. it came with a hand written calibration sheet showing how close each value is. mine was so close that i don't need to adjust the values. this is way better than the harbor freight wrench!",
        "it worked great for three uses on lug nuts and one ford F150 front axle nut, the lock nut fell out off the bottom and was never found again, then after the axle nut tightening, it started to skip teeth, and jammed up, now its no use as a breaker bar as it slips both ways.",
        "At the price I wasn't expecting much, but I have access to a torque measuring device for checking torque wrench cal and this wrench was within 5% of all torque values which isn't bad for the range. I do auto work and like to have everything torqued to spec so this was awesome for wheel nuts and lug nuts. I use a smaller one for most of the other stuff but it's a nice tool to have around for the bigger stuff.",
        "I bought this item based on other positive reviews. I wanted a sturdy 1/2 drive torque wrench. I was expecting a cheaper product for the price. This thing is huge and heavy. You wouldn't want to use it to build a motor but it's perfect for lug nuts and crank bolts. The quality was very good and I would expect it to last a long time. The case is very nice as well. Calibration was excellent. No complaints yet.",
        "I have bought many tools over the 40 years I have been messing with cars. I needed a big torque wrench to tighten the spindle nuts on the Cobra replica I built and picked this one for its capability and price. It is the first time I received a calibration sheet with a torque wrench, even the Craftsman tools I have bought never came with one. Good basis torque wrench with great features. Give me a mechanical wrench over an electronic one any day. Great quality!!",
        "I bought this to crank to spec the crank pulley on my subaru legacy. Works like a charm. The only concern i will pass on to future buyers is that you must make sure you lock in tightly when choosing a torque setting and you must also read the instructions on how to properly store this because the hardware inside is extremely sophisticated.",
        "Good: -Inexpensive -Long handle Bad: -Heavy -Not Dual Direction. It only clicks when tightening Clockwise. Tightening on Counter-Clockwise applications does not click. If you are going to work on right-hand threads only this tool will work just fine. The long handle provides enough leverage for high torque requirements. If you are going to work on left-hand threads then this tool will not help. It will only serve you as a breaker bar. Other than that it seems decent for the low price. I did not keep mine... returned it and looking for another wrench that can do both directions.",
        "spotty quality. i ordered one of these a few years ago and it has held up well during occasional use at work. i brought another one to keep at home and after the first use the end cap popped off and wont go back on.",
        "After searching amazon for a torque wrench I came to this one with great reviews. I received it promptly. As some have said mine did come in a red case & not the black one pictured. personally I don't care what color but should be noted. I used this to torque down the bolts when installing my car shocks last year. Works great as far as I know. Nice loud click once you reached the set torque. Pretty hefty feel although I would want to drop or toss it around as with any torque wrench to avoid messing with the calibration. Overall a affordable torque wrench that did what I needed it to do without bleeding me even dryer.",
        "Huge, and gives you lots of torque posibilities, if you have the room. Got this, to do a rear hub on a C4. 165# was no problem. Also, tightning my lug nuts, with a 4-way, always gives me back problems. This allows me to apply the correct torque, with no back strain. Checked the settings with another wrench, and they were spot on.",
        "It works well for me on my trailer weight distribution kit",
        "Our shop needed a 250 ft-lb torque wrench so I shopped around and found this one had some good reviews and was relatively cheap. After processing three of the bolts that needed 179 ft-lbs of torque, on the fourth one we determined the wrench had stopped working. We reset it a few times but could not get it to \"click\". We ended up over-torquing the bolt we were working on because of it. Amazon took it back and gave an immediate refund, so good for them. We ordered the Snap-on CDI wrench to replace this one.",
        "I've used this wrench for quite a while now on everything and anything that requires a lot of torque. Lug nuts are a breeze. Head studs are cake. The only con that I can think of is the size. This wrench is large, but it has to be for its rating. A couple of pros are that it comes with a blow-mold case, and it is a \"clicker\" wrench (which makes torque-ing stuff easy).",
        "this torque wrench is the perfect item as it is about 2 feet long and handles a huge amount of pressure. This made rusted bolts very easy to remove however if you have limited space you must be able to reach the bolts or socket in order to advance it one click in most cases the amount of leeway before I did actually provides tension on the bold or not is about 7 to 8 inches",
        "Cheap, just like the price. Broke after a few uses. Bought it to build two axles. Broke trying to torque to specs of 160 ft. lbs. finished the axle and returned it to Amazon for a replacement. New one arrived a few days later and was able to build the other axle. It's not Snap-on (And it doesn't cost $300) and I would compare it to Harbor Freight. Will get you out of a pinch. Not intended for everyday use.",
        "Still use this good quality been through a lot of weather holds up great",
        "Which is cool... My old torque wrench was 18\" and this thing is just massive. It came with a certificate of calibration that I can't really read, but my best guess is the 3 test torque values were within 1ft-lb of advertised. Seems like a good value, made in Taiwan of course.",
        "This wrench is huge and feels very sturdy. The case is also high quality. It even comes with a calibration sheet, which is a surprise at this price point. This will be a much more universal tool than the $20 lug wrench I was considering. I haven't tested its durability yet, but I am not disappointed with its initial quality",
        "Father-in-law has no complaints about this item. Appears to be of high quality and comes with \"certified calibration\".",
        "as expected, with inspection notes indicating that it's tuned correctly. I used a couple times so far and works well. I am happy it came with a proper case so one can store it safely and keep it clean...",
        "Worked well twice. Now it is seemingly skipping a gear at 100 ft/lbs. Poor ratcheting system. Very heavy duty feeling though.",
        "Très bonne qualité, rapport prix/$$$ excellent, je recommande ce produit.....!!!",
        "This is a nice heavy item with a smooth dial to set the torque. The good length makes it real easy to crank up 150 lbs. for those lug nuts even for us old guys! I don't know why I didn't get one sooner. It comes in a nice case too, can't be better.",
        "This thing broke first time I tried to use it. It was of course way too late to return it. I emailed Amazon and within 30 minutes they sent me e new one!",
        "I had never heard of this brand before and was skeptical at first but it is a good quality tool. I used it to rebuild an entire engine and it was very accurate and reliable. The protective case that it come with is also very nice. I would purchase tools in the future from this manufacturer if I needed too.",
        "I bought this because I needed a big torque wrench for one project, so I didn't want to spend a ton of money on it. So far I've been very pleased with this and have used it multiple times for torquing big nuts and bolts on my truck. I recommend it.",
        "The bolts on newer cars seem to require higher torque application than previously. Two of my new cars required a torque of 90 foot pounds,quite a bit higher than my older wrench could handle.This new tool is well made,solid construction with clear marking of torque values.",
        "I like it! Very sturdy wrench, steel, steel, steel, no plastic anywhere. Makes a definite sharp click when you arrive at the torque setting. Get ready for the size, it is quite large and heavy. Lots of leverage. Set screw to hold the torque setting is a nice touch.",
        "Mountain 1/2 drive torque wrench oh yeah....This mother is big and heavy....at my age I need all the leverage I can get....taking lug nuts off will be an ease with this baby....made well and easy to use....price was right .....highly recommend",
        "Used it torque down the crankshaft pulley bolt on my 2004 Toyota Tacoma Prerunner 3.4L V6 Truck. Worked great and heard a loud click. Will be using this to torque down lugnuts in the future.",
        "comes in good case, seems solid made . only torques right hand. I needed both so had to send it back. remember as long as your torques are equal on most stuff you are good to go. if you need dead nuts, buy a top of the line one.",
        "The handle was longer than I expected and that is a good thing when torquing higher values, works great on Lug Nuts and will prevent you from warping your rotors when using correct values for your vehicle. A good Torque Wrench used correctly is the difference between a Shade Tree Mechanic and a Tech. Which would you rather have working on your car? The wrench is of extremely good quality and comes in it's own case. If I had to do it all over again I would buy this again without any regrets.",
        "Very solid tool for the very, VERY reasonable price. I had another wrench for several years but only goes to 150 ft/lbs, many of the new auto torques on wheel bearings etc are 170+. This wrench worked great. Solid, easy to use, high quality, can't go wrong.",
        "Great wrench for a good price. Matco wanted $300 for one like it. Other A & P's in my show were amazed at the price. I will write later and tell you if it is durable. It is certified and that is the one piece of information I am required to have to be able to use it.",
        "Used this to replace the head bolts on a head gasket job as well as all the other bolts in the job including the valve cover bolts which are very small. This also helps in training yourself to memorize how much torque to use on the oil drain bolt.",
        "I received the Torque wrench over night, which I did not expect. Delivered by FedEx. I torqued the lugs on travel trailer. Love the two foot length. Setting the force took a minute to be correct on the torque but it worked beautifully. I am very happy. I do not need a torque wrench every day so the price was fair and the quality perfect for my needs.",
        "Bought it over a year ago, but just used it for the fourth time. It broke during the fourth time I used it; I did use it as it is meant to be used. Obvious piece of junk.",
        "As I am a shade tree mechanic with only rare need for a torque wrench, when I needed to replace my ancient beam-type wrench, I did not want to spend $200+ for a new one. This Mountain brand wrench (made in China) illustrates the case that, as with most tools, you tend to get what you pay for. This torque wrench looks fine (decent quality), is quite hefty, comes with a slip certifying it is within spec., and seems to work well. However, the scale is quite hard for me to read, especially in shade, and the steel and tooling appears less than first rate. Overall, a decent deal for the money you pay for this.",
        "Love this Torque wrench, this sucker is LONG, very easy to torque down tires and any other accessable car part. No need to be a ghetto-chanic and use a pipe to assist. Solid heavy construction, I expect this will last a long time.",
        "I have used the tool occasionly sinced purchased. It seems to be of good quality, not great, and performs well. I believe it to be a good tool at a fair price and would recommend it for home use but not as an everyday wrench in a shop or industrial enviroment.",
        "Use this on everything from head bolts to lug nuts. Has worked very well so far, and compares very closely to a far more expensive torque wrench that I used to test it against.",
        "Not SnapOn quality, but also not $200. Meets expectations at price. The torque readings seem to be accurate. Product fits in case nicely. 25\" long - likely not appropriate for smaller, lower torque jobs, such as brake caliper slide pins. Great for hub nuts and the like.",
        "Only used it once on lug nuts and was happy with performance. Not completely happy with the lock once you set the torque . Lock knob came loose but only turned a few pounds. Experienced same problems with other torque wrenches as well.",
        "I bought this for general work at home. Can't say for sure how accurate it though. Some day I will bring home my techangle from work and see how close it is to a snap on. I wouldn't do heads with it or something that needs accurate torque.",
        "What a piece of Junk. The adjustment mechanism fell apart on the 3rd time I used it. Don't buy this item, I now. Have to figure out if I can return it to the manufacturer.",
        "Unless you are a professional mechanic than no reason to pay more. Looks and feels like lot more expensive torque wrenches. I had to tear apart my engine due to a blown head gasket and it worked great for torquing the head bolts.",
        "I have used this torque wrench to tighten my lug nuts and crank pulley on my car and it hasn't disappointed so far. It's a heavy duty, high quality tool that can be used for big jobs.",
        "Great torque wrench... does the job well, easy to use, and gives me the peace of mind that I don't have to worry about my wheels flying off at an inconvenient moment... Not sure how much more I could ask for!",
        "So I spend $ 2000 on my custom rims. Are they under the right torque.? Am I at least close. I hope so but at least they are all tight to the same tightness and maybe it is calibrated right on..",
        "Hubby had been shopping for a torque wrench and was happy to order this one. It is a tool that is not used often at our home but when it's needed... he has it! Great quality for the price!",
        "I can't speak for long-term durability yet, but my first impression after using it is that this is a solid tool. I like the all-metal construction, and the provided case (red, not black, as others have mentioned) is quality as well. I used it to torque a crankshaft pulley bolt down to 217 ft-lbs and it did the job well. The click is clearly audible. Keep in mind that it is quite large, as you would expect for a tool rated to 250 ft-lbs. But, it definitely requires some clearance.",
        "this ratchet is unbeliveable i think only a elephant could brake it it works flawlessely at 150 ft/lbs no problem loud clicker it will last a very long time thanks amazon",
        "I needed a high torque limit wrench. The price was right. Product works as advertised. Seems to be great quality. Easy transaction. Great price and product was shipped very quickly. I would do it again.",
        "I received the wrench today and used it to torque the wheel hub bearing I installed on my 1997 Ford Explorer. I thought the wrench was of very good quality and a great buy for the money. I first torqued my lug nuts to 100ftlbs and then torqued the wheel hub bearing nut to 170ftlbs. If I never use this wrench again I saved money over having a mechanic do the job, but now that I own the tool I can tackle big jobs. Glad I made this purchase. Frank B. from CT",
        "This item works great and was as advertised on the website. Is a great product if you are looking for a torque wrench",
        "This product seems to be identical to one that I priced at a local hardware store for more than twice the price. Couldn't be happier with my purchase.",
        "Nice torque wrench, works without a problem. Using to torque wheels, bearings, front wheel hubs and other bolts/nuts on the car that require precise torque.",
        "No complaints, it's heavy-duty, nice build-quality, and does the job right with an audible 'CLICK!' Very nice for the price! A must have for any shade tree mechanic.",
        "The wrench works great. No problem at all using it. Shop quality and easy to use. recommend to anyone who needs heavy duty wrench",
        "Very well built and works great. Comes with a nice protective case. Looks to me like it's worth paying a bit more for due to high quality.",
        "Does the job but not the best torque wrench I have used. If within a few pounds is ok for you, I recommend this. If you really need something precision, I would pass.",
        "Bought this to properly install my tow hitch. Worked great, and I know I will be using it again in the near future....",
        "Use this for lug nuts with ease, as well as the large hub nut holding on the wheel bearing. I am very glad I purchased this.",
        "Very nice! It works perfectly. The instructions could be a bit clearer.",
        "Bought this to torque the nuts on our RV after getting the tires replaced. I have worked with torque wrenches before and this jewel really did well. The price was unbelievable low so my expectations were low. I was really wrong; it was a very good tool.",
        "So far so good! Been using it to torque my drag racing wheels! Very easy to use! Comes in a nice case which is great. Very heavy duty this should last along time!",
        "This appears to be reasonably accurate. I needed something to go up to 160 ft. Lb torque and this tool is cheap for the torque. Well worth it.",
        "Does what it is supposed to, and I hope it will last for my intermittent use. Makes me feel more secure when working on my car.",
        "easy to use and operate safty screw is very usefull handles well sound stable and easy to store in the tool box.",
        "This is the first time I own a torque wrench. I put it into use immediately by rotating tires on my car. So happy. Very easy to set torque and the long lever mak it easy to unlockthe lug nuts. Thanks for the deep discount on the price!",
        "My son needed some tools and he is very happy with this torque wrench. The price was good for the quality.",
        "Works as advertised. I checked it with my craftsman beam style torque wrench and seems right on the money. Good buy.",
        "I have 3 subaru's and i use this to torque the lug nuts. It works perfectly for that, and It's lasted me quite a while.",
        "Accurate. I use it when I rotate my tires on the vehicles. Tighten lug nuts to recommended torque specs. Good feel.",
        "A low cost torque wrench, great value. It is extremely heavy duty, and comes with a great heavy duty case. I am no professional mechanic, but this more than suits my needs. I have looked for repairs to do so I could use it. Great price for a great product.",
        "I used this to torque the front half shaft nuts on my Alero. It worked well. Good buy for the money.",
        "Great torque wrench for the price very pleased with it rebuilt many mirrors with it",
        "So far it seems to do the job. Nice case, well built torque wrench. I just wish is was shorter.",
        "Easy to use, nice case. Used it while working on the cars with my boys. Perfect for showing your kids how to do the job right!!",
        "If I ever get the call from NASA to repair the Hubble telescope, i'll be ready to torque the bolts to the correct torque specifications. Just remember to harness this tool to prevent a Kessler effect. With my torque wrench in hand I am confident to tackle any job in space. In space no one can hear you scream but you can hear the click of the wrench once you reach torque setting.",
        "The product is heavy and you can feel the quality. I cannot imagine the Snap-On is that much better in quality or effectiveness. This torque wrench has lots of leverage from the long arm. Highly recommended.",
        "Both my son and husband, who live in separate cities, wanted a torque wrench for Christmas last year. Since my son is more computer savvy he simply researched the best quality and price for this item on the internet and decided on this one. They have used this tool several times and are both very satisfied with it.",
        "I use this for torquing my car tires and it makes the job a lot easier. I've used it several times and I am pleased with it.",
        "Very good torque wrench and well made. Numbers are a little hard to read but other wise a very good wrench. Would recomend this wrench to any one wanting a good torque wrench.",
        "This seems to be a good quality wrench; it hasn't broken yet with just about weekly use. The thing that I don't like about it is the locking mechanism for the torque setting. It is a knurled nut on the end, which sometimes comes loose during use which will affect torque settings. That's the reason for the three-star rating, since obviously a precise setting is important when tightening crucial parts.",
        "Was my first torque wrench , replaced tie rod ends on jeep and tighten lug nuts to specs , works really great . Very happy for the price I paid for a great quality tool.",
        "excellent tool, very accurate, easy to use, pretty much the full package. the plastic case is a nice touch, you have to remember that a torque wrench is a precision tool, and should be treated with the same deference as calipers.",
        "This is an awsome torque wrench. I am getting a little older and when I torque down those 150# lug nuts it is a heck of a lot easiet with a 24\" wrench instead of a 18\". Thanks for the super deal and a great wrench!!!! Jim L. Backyard Mechanic",
        "Just need it for a few things I do around the garage. Seems very sturdy and has a good weight to it. Works well as far as I know. I haven't tested it against any other wrench but it feels about right for the jobs I have used it on. I like the case it comes with too. Only compaint I have is that its hard to read the dial when setting the wrench.",
        "I've used this a few times. It is well made and does what it is supposed to. Reasonable price for what you get.",
        "The Mountain 16250 1/2\" torque wrench was a pleasant surprise the quality of the product was excellent and it met all my expectations and more."
    ]
}