{
    "entity": "Pocket Knives & Folding Knives",
    "text": [
        "This is the best knife I've ever owned. Bought one for my son who is in the Army and he loved his. Then I bought one for a fishing buddy and he also loved the knife. I then purchased one for myself and I carry it all the time. The assisted opening is spot on. You cannot wiggle the open knife because the fit is so good. The textured grip is marvelous. Be careful, you could slice a finger because this thing is SO sharp. Built in the USA and they'll resharpen it for life if you ever need it.",
        "Had to use the glassbreaker for the first time the other day. A car had caught fire and I used the glassbreaker to bust out the front driver's window. Just a simple hammer fist with minimal pressure shatter the glass immediately. As for the rest of the knife, I've used for varied tasks over the last 2 years. It's a great knife, sturdy, well constructed and holds a sharp edge. I would trust my life with it, I have already and it has not failed me.",
        "KNIFES POINT ALMOST STICKS OUT WHEN CLOSED GETTING CAUGHT ON ITEMS IN PANTS POCKET CAUSING IT TO OPEN , HAD IT CLIPPED IN MY POCKET AND IT OPENED IN MY POCKET TWICE DUE TO SPRING ACTION ! ONCE FULLY OPENED WHILE STILL CLIPPED IN . COULD HAVE CUT MY FEMORAL ARTERY CAUSING ME TO BLEED TO DEATH ! I HAVE BEEN BUYING KERSHAW KNIVES MORE THEN TEN YEARS BUT ITS SEEMS COMPANY IS GOING DOWN HILL . DISAPPOINTING TO SAY THE LEAST .",
        "I am an avid kershaw buyer there are some markings that should be on the blade that are missing. I’m not going to post a picture since that would help correct the fakes that are out there. I’m not surprised since on the manufactures website they are far more expensive. The knife is fine and works, but if it is not legitimate then there is a risk of not getting the right steel. So it’s fine for tge money.",
        "Have had this knife and have been liking it. Bought this knife again last month, Suddently noticed the lock does not engage fully. The locking liner only partially rest against the blade (see pic). I checked the other one but different steel, it is fully engaged. My friends this knife is like my new one too, partially engaged. My old one S30V version is almost fully engaged but not completely. I replaced it right away (Amazon is always great), received a new one. The locking system is the same as pics show, only partially engaged. Kershaw really need to address this safety problem.",
        "It almost made it two months. First time a kershaw flat out failed. Most I have used it for was cutting food at work and camping. I took it out of my pocket and the blade fell on the ground.",
        "VERY hard excellent Steel on this Knife. That's why it costs so much. No frills just the quick open blade and Boy does it ever open quickly. The non slip coating is top notch and this thing sharpens amazingly. Cut myself a few times already. This thing has one purpose. Self defense. No BS. It will save your life if need be. I bought one for my Son as well and he loves it too.",
        "I searched first to be sure it was made in the USA. And it came with made in China on the handle of the knife. Was supposed to have a black blade and it came is a silver blade. Even though the box also said black blade. And the picture did not look anything as stated on here. We returned for a refund and I hope Amazon don’t think we switch the knife on them because the knife was so different then shown.",
        "Great knife! I am very happy with this purchase from Amazon. I did a lot of research before buying a knife. I also wanted to make sure I got the real deal... meaning there are “fakes” out there. Do your research on how to spot a fake. This one is the real deal.... I am very happy with the USA made quality. The spring assist is very fast to open, feels good in the hand and it’s a great everyday carry knife. Yes you can shave the hair off your arms very easy with this one.",
        "I purchased the S30v blur. It’s a great all around EDC knife and would recommend easily to someone else. The texture on the handle has the right amount of abrasiveness to allow a proper grip yet not rough enough to tear your hands up. Blade is marketed to be anti corrosive, we’ll see how she holds up to that claim as grit and grime accumulate. Advertised also to be sharpened prior to receiving and she held up to the testing of the cardboard. (not so much the hair on my hand) A little unimpressed with the packaging design. I’m not one for sparkles or whatever, but the unboxing was overall underwhelming.",
        "This knife is just beautiful. It was purchased for Father’s Day and given early. My husband couldn’t be happier with the choice. It has a mean and slick design. Wicked curves. I ordered the black serrated glass break. (I also ordered a sharpener separate). The knife did need some sharpening when it arrived but that’s totally fine as he is particular about his knives. But it opens cleanly and closes no issues. I did read a review or two about issues with no stampage indicating knock offs, no problems with that here. The knife was etched/stamped with the company info made in USA, and the blade name. So it is genuine.",
        "I've honestly carried this knife every single day for the past 7 years (August 2013). It definitely gets a lot of use, abuse and misuse. It may look a little rough around the edges but I assure you that it functions flawlessly without disappointment. If I must mention 1 neutral remark. If you're carrying change in the same pocket as your knife, especially pennies and dimes. It's possible for coins to get lodged between the blade and the body of knife which can make it harder than usual to open. The coins can also dull or scratch the blade. Not a big deal, just put your change in a different pocket.",
        "I remember when I was a kid, all boys seemed to have a pocketknife, and our grandfathers always had them. Seemed like a good time to get back to that. I'm pretty sure most of my contemporary friends would think me odd, but having a pocketknife is a good thing. And this Kershaw is definitely a good thing. Stable, sturdy, ergonomic, balanced, it feels good in my hand. The blade deploys quickly and smoothly, the locking device is easy and convenient. The ergonomics and aesthetics are excellent, and it's a Kershaw, so it's made in the USA. And at this price, I suggest you grab one. I may get another.",
        "Best knife I've ever owned. Carry and use this knife daily as a mechanic. have had the same one for 4 years. Does losean edge fairly quick with how much I use it but it sharpens easy and comes out with a nice edge. Feels great in the hand cut sufficiently and the lock feature has never given me an issue despite the fact that I have never heard assembled and cleaned or lubricated it. Spring assist works great, quick deploy and a nice solid feel",
        "I like the color of the handles. Nothing speedy about opening this knife, if you're not good with a thumb stud this knife won't be speedy opening, just put a flipper on the blade kershaw. I like my kershaw fatback open assist works great. Update: While I'm not much of a thumb flipper fan, this Kershaw blur with a little practice is pretty awesome. It has been my favorite EDC for a few months now. Kershaw seems to have perfected the open assist. One of the best fifty dollar knifes out their. Much more expensive knifes from my collection have been sitting. Would recommend.",
        "The tip is not removable and it can only point up and damage your hand when you reach for it, or if the tip points down it can rip your pocket even though it may not touch the bottom of your pocket. Had a previous blur without the glassbreader tip which was great. I took the knife apart to see if I could remove the tip from inside. No luck. Can't return because I opened. So I gotta a new paperweight.",
        "Last spring, while visiting MN, I bought this knife. Just last week, while cutting an apple, the blade broke in two. Kershaw states their products are \"high quality\". I live 2000 miles up the Amazon River in Iquitos, Peru, I am up here with a broken Kerchaw",
        "Best pocket knife I've ever owned. Comes sharp and holds an edge. I've owned this since 2014 (it's 2020 as of this review) and it had only needed sharpening twice. Durable, well made, and the grip material on the sides is great and lasts. I'm not a \"knife guy\" or a collector, but this is a great tool to always have on-hand. I have 3 or 4 other pocket knives that have all just sat in a drawer since I got this, this one goes in my pocket every day. My only regret is that I got the standard blade instead of the half-smooth, half-serrated one which would have had more utility.",
        "This is a very nice knife. Good thin profle decent assist opener. Knocking a star off for two reasons. One: the pocket clip is not deep carry. The knife sticks out of my pocket like an inch and a half. Kind of annoying. Two: The lockbar doesnt go under the blade as far as i think it should. I have a lot of other knives where it hits rigght in the middle and this one only hits on the side. It locks up so ill keep it but its still in my mind any time i use it.",
        "I really want to give it four stars but it's not the knife's fault. I wish it was a deep pocket carry rather than a half inch or so sticking out. Other than that its fantastic. Light weight, feels good in the hand. I love the opening mechanism, keeps a sleek look. Holds an edge well. Really if the pocket clip was lower this would be my perfect edc. I've really consided going to a machinist just to get new holes tapped that's how much I like it.",
        "Still the best knife I've ever owned. I ordered one to replace the one I lost years ago. Not sure what's up with the other reviews but I got exactly what I ordered, a made in America Kershaw knife. It came extremely sharp and in perfect new condition. I didnt realize Kershaw now does repairs and sharpening for free if you send it in.",
        "Bought this Olive Blur to replace an older version of same knife that I had lost. Disappointed with the new knife since that the black finish on the blade comes off way to easily within the first month of use. Never had this issue with the black coating of their blade on my older Blur that one the black finish never came off and I had it for quite some time. Also when closed the tip of the blade is way to close to the end of the knife. Too easy to cut the fingertips considering how wicked sharp the blade is. The rest of the knife is the same great quality I expect from Kershaw.",
        "Great knife. A little on the chunky side, it basically needs a pocket to itself. No wobble in the blade once deployed. Impossible to lose grip on this thing, but the grip will tear your hands up when trying to quickly reach into a pocket for something else. Really disappointed by the low-quality clip. It bent the wrong way after getting caught on the arm rest of a chair one day and it’s never been the same since. Overall, I’m happy with the knife, just not sure how great of an EDC it is.",
        "I'm not a knife person by any means, but needed a new pocket knife and stumbled upon this. The knife feels and works great. I love the spring-open feature and it's weight/balance in the hand. It's a little thick.. so much so that when I have it attached to a pocket with the clip I scrape my hand up on the sand-paper-like handle when reaching into my pocket for my keys or phone. I haven't found another place to stick it at this point that is comfortable and doesn't require me pulling it out to get my keys without hurting my hand. This is the only downside I've found.. I maybe simply need a smaller knife for EDC.",
        "This was actually a gift for a roommate. However, these are my first impressions: The blade comes perfectly sharp (shaves without issue). I did not notice any problems with the grind at all. The liner lock locks up nicely, and the Speedsafe assisted opening is some of the smoothest I've used. The knife is ergonomic and fits the hand well. The grip texture is amazing, and the glass breaker is a nice touch. The serrations aren't very aggressive, but get the job done. The blade steel sharpens up really well, and the 14C28N knives I own are some of the sharpest I own. All in all, a great knife.",
        "I like the knife. However it was not sharp at all when it came. I could cut butter but it could barely slice a piece of paper. The grind is also uneven so I'm pretty disappointed by the blade edge. I'm going to take some time to get a nicer edge with an Arkansas Stone. Not necessarily a deal breaker for me because finding a knife with this quality with an S30v blade at this price point is almost impossible but if you want a knife that's sharp out of the box and you're not good with sharpening then this isn't the knife for you. A Spyderco will come sharp out of the box, this is not.",
        "Haven’t had a chance to use it, so can’t speak to how well it keeps an edge, or overall frame durability. But it looks great, feels about as light as another similarly priced Kershaw Ken onion I have that has a glass strand polymer frame, and has a similar blade (which has held up well in the past decade). So I assume this one will hold up as well. Only complaint is the thumb studs. I prefer the more tradition little thumb stub nub, instead of the sheared one On these knives.",
        "The Kershaw blue is the best EDC knife a man can own. It's truly a one handed knife and the blade pops out so quickly with just a little pressure applied to the blade. The rubber grip inserts gives the knife a solid hold even when the knife is wet. The knife is well made and Kershaw has excellent customer service. I lost a screw out of the knife and they had me a new one immediately for free of charge (and that was after 3 years of ownership). Kershaw is all that I carry. I am now carrying a leak but will be buying another Blur soon as they are beefier. The leak is more of a gentleman's knife.",
        "Honestly probably the best Kershaw knife ever made. I have a lot of Kershaws and everything about this feels near perfect. Action is good and smooth, ergonomically it is very pleasing, blade shape and size are great offering versitile use. It's just a great knife for the price, one of those knives that is hard not to carry chosing over another knife just because of how well it fits making it feel just right always.",
        "I just recently started collecting pocket knives, mostly just buying cheap ones online that look “cool.” Eventually, I decided to invest in a REAL knife. I absolutely love this thing and carry it every day. Lightweight, durable, made in the U.S.A. and looks/performs better than all my other knives by a mile. Kershaw offers free sharpening and a limited lifetime warranty which gives me complete peace of mind. You do have to pay $7 for return shipping if you make a claim, however this knife MSRP’s for $119.99 on their website and I got mine for less than half that on Amazon. Very pleased!",
        "Nice profile slight recurve. Good steel. Sharp as heck out of the box. Blade deploys quickly using the thumb stud. The recurve makes it hard to sharpen correctly on a whetsone. The stupid thumb studs are angled which is fine but they form a pretty sharp edge which can cut/scratch your thumb or hand. Had to take a file to round off the sharp edges of both thumb studs to prevent injury to myself. Don't understand how this could be overlooked in the design process or why it hasn't been fixed since the knife is no longer a new product.",
        "My wife bought me this knife as a gift. What a great knife this is. I don’t know much about different knives, but it is high quality and very sharp. I do my research and read reviews before I buy anything. This was a gift so I didn’t have the opportunity to do that before buying a new knife. However, this is the knife I would have bought had I been buying it. You will like this knife too.",
        "A great every day carry! Comes very sharp out of the box - probably the sharpest knife I've ever purchased. It is easy to open and close one-handed. The thumb studs are long enough to get to easily, but not so long that they catch on my pocket. It is sturdy and well-built. There is no wobble at the hinge and the lock keeps the blade firmly in place. The textured grip on the handle is an excellent addition. Even with sweat or oil on my hands, I have no worries about dropping my knife, but it's not rough or abrasive. This has quickly become my trusted every day carry knife.",
        "Watch the video I give some good insight. But it's a great size for work maybe a little large for dress up, but just right for edc and heavy work. The blade steel is the right balance of price, edge retention, and toughness. I'm no Nick Shahbaz but I am a bit of a knife snob and in the mass production scale this is ons of my best buys. Buy it you won't be disappointed and you'll buy American.",
        "I purchased this gem quite a few years ago and I am very happy I did. It has a nice solid feel to it without being heavy. I have had this knife during four combat deployments to Iraq and Afghanistan. It's been on countless camping, hiking and fishing trips. My point is, I've beat the heck out of this thing and all it has shown is a few wear spots in the finish around the edges of the knife. I highly recommend this knife as it is a solid choice for any adventure life throws at you.",
        "Great pocketknife, opens, closes easily, takes apart easy for cleaning and pivot adjustment. This knife now comes with higher grade metal now and would recommend if over this one if you use your knife hard, don't know how to sharpen. I can sharpen this item to razor sharp. I have had this knife awhile. I own other Kershaw folders, they are all good value, value meaning they are value priceed, but be prepared to touch up the blade and to resharpen the blade frequently depending on usage. I have two of these, one recently being gifted after many years of useage.",
        "The blade of this knife is dulled and I returned it and I get charged for $16.00 restocking fee? What wrong with this. I need my full refund which I paid for. Suck... Update. I contacted A customer service and they were able to refund the restocking fee. Problem solve. Kershaw needs to check their blade prior to ship out to customers. Thanks Amazon solved this issue.",
        "So in short, while knife shopping I had a specific set of features pre determined for my everday use and this knife exceeds all. Its a nice light weight knife thats fits very well in the hands. The grip is comfortable, grippy, but not over intruding. Blade length is perfect for a pocket knife. The sping assistant is the smoothest and nicest even compared to knives way higher in price. The blade is super sharp right out of the box which is always very nice and the slight recurve is not to overdone but adds an impressive advantage while cutting. I use and carry this knife every day and will continue to for a very long time.",
        "This is most definitely the bossest ass knife. What is it? It's sharp AF, we can start there. You wanna slice some shiz? Do it. Do the thing. Slice away, my friend, this blade will maintain its fine, fine blade for approximately eternity. My only gripe is the stippling on the grip. What is it with tactical brands and using sandpaper texture. Do a woodgrain grip or something, Kershaw. Yeah I hope they see this Amazon review and heed my lovely advice.",
        "Overall a quality product. But it is far too difficult to open - at least for me. One handed opening is nearly impossible for my hands, and the design makes even two handed opening hard. The flat thin handle is also a bit unnatural and uncomfortable. In this brand and price range I expected a better knife design.",
        "Like most Ken Onion knives this is top quality. I like the smaller curved serration with more blade. Don’t like the shape of the thumb stubs. They are sharp angled and can be abrasive. Not sure what the thought was there but they are not comfortable to use. The glass breaker is very small and sharp pointed. I could see where it could wear a hole in your pocket if you don’t use the clip. Knife came super sharp. I’ll probably use it more as a utility glove box knife rather than an edc or simply put it in my collection. A nice design overall but he got a little carried away. Good designers sometimes do.",
        "Love this American-made Kershaw knife! Great design and blade finish. Very sharp edge and has retained that edge for a significant amount of usage at work. I also love the light weight, yet strong aluminum handle and the non-slip grip inserts. At work, I’m often climbing around or in an aerial lift, working at great heights with my hands full, so the fact that I can safely engage, open and close the blade one-handed is a huge advantage for me. Love it so much, I just might buy a second!",
        "I have a bunch of $20 - $30 knives, mostly from amazon. Gerber, CRKT, Kershaw, Tekut. Pricewise, this knife is a bit of a stretch for me, being a knife skinflint. I have read the rave reviews of this knife, Ken Onion inspired, etc. I'm giving it 5 stars because it is a nice knife, but to me it's pretty overpriced. I paid $70 and it seems like it should be about $40. The opening action is good, nice blade, well made but still too much money for this knife, IMO. I'll shut up now.",
        "This life is excellent. It is extremely sharp, it has a great locking mechanism as well as great responsiveness when wanting to flex the blade open. This is my second knife of the exact same knife because I enjoyed it so well and lost the other. Kershaw knives are the only knives that I like to purchase due to their excellent craftsmanship",
        "Just got mine . It may just sit on a mantle for a while. I'm hesitant to mar the darn thing. Pretty. - The first knife I've ever owned that I could shave with-\"and quite cleanly mind you\", straight out of the box. I thought that was a pretty classy touch. The lock mechanism is a little stiff when opening one handed. Maybe it'll pay off in durability.",
        "I've had it for a good month or so and love it! Look S30V steel sharpening properties up before you buy it if you intend to sharpen it yourself. S30V isn't the easiest (or the hardest) to sharpen so it will take at least a smidge of skill and some decent tools. Only issue: The thumb nub sticking out on the blade is somehow made just right to break nails when I go in my pocket for keys. Ouch. I've had lots of knives and never had that problem. As a machinist, I'm pretty used to being poked by sharp metal chips but that nub is just plain annoying. I'll probably have a look at my other knives",
        "I have unfortunately had to order many of these knives. Not because of the knife but due to airports, concerts, etc by me being stupid to having it on me. Never had I thought of getting something other than this. I'm traveling to Asia next week and will be packing this in my checked luggage. I was just rewatching one of my favorite shows called Person of Interest and Jim Caviezel had one to disarm a bomb. I thought that was pretty cool. I love this knife!",
        "This is the best knife I ever had. Nice ergonomic handle, easy to open and close with one hand. This is the more expensive version of the Blurr due to the higher quality blade material. I have the cheaper one too, which is the more popular. Surprisingly, the blade of the cheaper version is sharper than the blade of this one. I expect the blade of this more expensive knife to hold more because of the better steal.",
        "This is the knife I carry at work (environmental geologist), simply because I don't want to bang up my 940-1 Osborne. The blur is a very solid knife with a smooth assisted open mechanism. The assist is pretty stiff when new, but becomes very smooth after it breaks in. The blade shape is pretty nice, while the thickness and depth of the blade, coupled with the solid aluminum scales make for a pretty heavy duty edc knife. The price for this knife with the s30v steel is so good, there's no reason to buy it with any of the lesser steels.",
        "Was a great EDC knife for almost 2 years. I dropped it once and the blade broke. Drop was from standing height onto wooden floor. I would not trust this knife with my life and will not buy another Kershaw knife again. Look elsewhere.",
        "The knife arrived \"shaving sharp\", and has held its' edge very well. It deploys quickly and easily, and while the blade lock is very solid, the knife is easily closed. The blade is large enough to field dress a deer or clean and filet a fairly large fish, or any of a hundred other tasks that may be required. Undoubtedly the nicest pocket knife I have ever owned, and I've carried a pocket knife about every day of my 79 plus years, since 2nd or 3rd grade! That being said, I realize that knives,like guns, tools and cars are a very \"personal things\", and just because I think it's great, you might not agree.",
        "Full disclosure, I am Kershaw fan, but i wasn't paid to say that. lol I have carried a kershaw for the last 20+ years. I Like the spring assist for when I need to use it and only have one hand available. My last three knives have been the Blur, this blue one is my favorite so far. It also fits my price point for a knife that I am willing to use every time I need it. I looked at the $200 brands and I just didn't like them enough for that price.",
        "Initially had this same knife in OD Green (or whatever they call the green) and I loved it. Unfortunately I lost it in the field and decided to grab it again but in black. I've had Buck knives and Spyderco knives and this is definitely my favorite for EDC. I usually have partially serrated knives and for the field I think I will continue to do so, but for work the straight edge is all I need. No wiggle in the blade and absolutely no chance this will flip open in your pocket--great assisted opening.",
        "I wish I hadn't even gotten all the other knives I did before I got this. I would've stopped at this thing! Kershaw is the number one bang for buck brand there is, end of story, followed by Spyderco. I'm so happy with this thing, that recurve blade lends it to be a perfect cutter, more pocket knives need to have this shape! Do yourself a favor and get this, you'll not be disappointed. And do so in the S30V...",
        "This has turned into my everyday carry. Feels good in the hand, and not too big.ive read some complaints about the stocks being verry rough but i haven't had an issue with it, i like the rough texture especially when wearjng work gloves, no worries about the knife slipping oit of my hand. My only complaint is the glassbreaker stud. I carry my knife blade up in my pocket. Because the stud is on the same side as the pocket clip i have to be careful not to poke myself when reaching into my pocket.",
        "Pretty bummed out when I misplaced my Kershaw clash pocket knife and felt naked without it. Really wanted to purchase the same knife but felt like I should browse the other knives Kershaw has to offer. Must say the Kershaw Blur Black was the right call. Love the weight and length to the knife and the texture and rubber grip of the handle. Only thing I don't really like is the thumb stud to flick the back out. Its a bit rough and coarse to my liking but besides that great knife.",
        "Love everything about the knife EXCEPT two things. 1) The horrible thumb stud. Face is angled wrong for your actual thumb position for opening. It is too small. It is unnecessarily sharp. Not rough...sharp. Nearly ruins an otherwise superb knife. 2) Oh, the cheap sticky back rough tape, cheap and destroyed your pocket fabric. What a short cut. Great knife with two killer errors. I would not buy again.",
        "This is the best knife I have ever owned! As a former firefighter and avid camper, this is by far the best knife on the market at a reasonable price. It is slim and light weight, the grip is subtle but effective and the quick deployment makes it pop and ready for action. This is a great everyday carry knife, that you should not leave home without!",
        "14C28 Ultimate combination of hardness and corrosion resistance Sandvik 14C28N is the latest development in Sandvik's range of knife steels. Optimized chemistry provides a top grade knife steel with a unique combination of excellent edge performance, high hardness and good corrosion resistance. My only issue with this is the lanyard hole not being large enough",
        "This is my third Kershaw blur. I like the one with the flat front edge and serrated back. I remove the clip on mine and it is smooth and lightweight, but a strong and durable tool. Well I assume it's durable because I've lost two before ever wearing them out. I guess that's what the clip is for :)",
        "Just received this knife as my new EDC. Initial review is the knife is solid. The assisted opening works smoothly, the knife edge is sharp (going to perform a more detailed inspection tonight). The lock engages well, and is easily disengaged and closed one handed. I can understand how people believe the thumb stud is 'sharp, however I believe the thumb stud just has a very agressive grip surface allowing you to open the knife easily, The blue aluminum is darker than the picture in my opinion.",
        "Got this a couple months ago and has been great for what i need it to do..ive worked at a bicycle shop for 35 years and use to use a razor knife to open little plastic bags and cut zip ties but i got this and it has done the job just as good and i don't have to keep changing blades.plus i keep it on me so it comes in handy around the house to..im left handed so i took the pocket clip off because i leave it on the bench so opening it and closing it is not a problem..all in all its been a great knife and would by again",
        "it flips out real fast so best be careful. Solid & good looking blade. Nicely weighted & feels great in my hand. Easy to close. comes with directions which you would think is a no-brained, but it is in fact quite informational I have to add. Super happy & excited about this purchase.",
        "Awesome all-around edc knife. The S30V version is the only way to go. Excellent blade steel, especially for the price. Smooth and fast deployment. Outstanding grip and fits in the discreetly in the pocket with it’s low profile design. My only complaint is the stupid-looking and poor-functioning pocket clip with only two positions, both of which suck either way. You can tell that a lot of thought was put into the actual knife, but the pocket clip was a complete last-minute afterthought.",
        "I carry this knife every day everywhere I go, if I have pants on I have the blur in my pocket. The blur is sturdy and well made and can take allot of abuse. They are easy to open with one hand the spring assist helps it pop right open. The serration really helps for cutting net wrap and twine on bales. I slide mine right in my pocket and use the belt clip to hold it up near the top of my pocket so its easy to grab one handed. I did manage to break the tip on one when i while it using it like a screwdriver, otherwise they stand up really well to a farmers punishment.",
        "This replaced my blur that I gave to my brother for helping me out with a project. I wish I didn't give him that one and instead gave him this one. I still give this 5 stars though as the blade is still sharp and a month later is holding its edge perfectly. I really don't like the coating as it seems a little \"sticky\" and the tip I hope doesn't break as I pry a lot with my pocket knife. Well this one seems to hold up.",
        "Decent knife. Blade is impeccable. only drawbacks for me would be lack of a safety locking mechanism for when it is in my pocket, and the lack of a rear opening assist mechanism, such as the one that is on the kershaw leek. I incorrectly assumed it would have a button and safety lock mechanism, but I can make due without. Also, it is possible to open it with a downward centrifugal force by way of holding it in-front of you, then quickly jerking it down towards the ground, blade facing out.",
        "This knife safe my life. The new version lighter I can feel it and see Kershaw change it a bit. Well additions colors also Great future. The blades game its Awesome so anyone can choose what he like. I'm Kershaw True Fan and will keep use only Kershaw knifes for my self and my friends! It's Quality, Price and Appearances that bought me out!!!",
        "I carry this knife everyday at work and in my personal life and it holds up great. As you can tell I have used it quite a bit over the time I’ve owned it and it has never given me any issues. It stays sharp for a long time, the serrations are strong and I have never had an issue with it coming unlocked. This is a great pocket knife that should meet most people’s needs. The only problem I had was one serration broke off.",
        "My Kershaw Blur 1670S30V Plain Edge Ken Onion Design came a day early in good packaging. The blade edge shaved my arm hair out of the box. The “Speedsafe” assisted opening works amazing well, I have experience with a couple Benchmade automatic knives and this knife springs open just as quickly and locks every time. I look forward to getting a couple more for the glove box and work.",
        "1. It is an outstanding knife, made with outstanding materials; the Ken Onion opening system is REALLY good. 2. The S30V steel is some of the best you can buy and it excels at taking and keeping an edge. The blade is sizable and thick. 3. You can debate price vs performance with Sanvick vs S30V vs other steels. It's splitting hairs (Pun intentional). The price point between the knives is ~$10...seriously that's cost of a meal at McDonalds. 4. I\"m left-handed and changing the clip to the other-side makes opening it as easy as the right-handed. 5. For the price point of $70 it can't be beat. Period.",
        "Came a bit dull in the box but sharpened up nicely. The steel is very beautiful, very hard and holds an edge pretty well. Unfortunately the slight recurve makes it harder to sharpen than a regular knife. the assisted opening Works flawlessly. No chance of an opening it in your pocket. it opens quickly and easily when desired. I read some reports that the lock sometimes slipped. I stressed mine and checked it carefully it seems fine. All the reports I saw were factory reject knives though.",
        "Got this knife 2 months ago and it seemed to be amazing. Extremely sharp and easy to open. However, after using it today to cut back some roses, the entire blade broke off. It felt like it broke as easy as ceramic. Don't know much about steel, but this grade of \"steel\" seems a lot like ceramic. Disappointing as I really liked this knife. Seriously contemplating on a different knife brand now.",
        "Good all around knife. Had for about five months before tip broke off. I’m a contractor so out all my knives to the test. I buy Milwaukee tools and knives for my guys this knife was sharper but tip broke off after three months. I abuse knives but I was using to pull tile spacers on ceramic tile while I used my cheaper Milwaukee knife for same purpose and never broke but this one did. If you just need a knife for everyday things this is your go to for sure. I will buy another even though I know it will break just because of my abuse. 🤷‍♂️",
        "I've been carrying a Blur since 2003 and it's still an outstanding knife. Some people moan about the thumb studs on these being too big or too rough. They're the best I've ever used. You don't push them out at all, just push them straight forward and the blade snaps out. Bought this one just to update my gear a bit.",
        "A word of advise, go with the s30v steel, it holds a great edge. Ergonomics are great, the thumb studs are a bit different, I'm used to flippers, but not bad. I may reduce the edges a bit with a fine jewelrs file if it bugs me. All in all not a bad knife so far. I just bought a second one as a gift for a friend. The knife is great. Just get the 30sv steel and a dmt fine/ex fine and you'll be set.",
        "Bought this as a replacement, lost my original. Loved the design. Rather disappointed that the style has been updated to change out the grip. The previous version had a cast handle - the grippy part was cast metal. This new version has some kind of glued in rubber that will eventually fall out. I liked how the old handle design was also useful as a rough file - the new one, being rubber or plastic, is not useful as an abrasive. I wouldn’t have bought this version had I known Kershaw changed the design. I would have sought out an older model.",
        "Super sharp out of the box! Cut off some fish while smoking edit, dried it off with a paper towel and it took off a fine layer of skin probably as good as a scalpel could! Definitely made in the USA (saw other reviews that states otherwise, hopefully just a fluke for them). Sharpest knife I’ve ever owned. Don’t hesitate to buy at this price, well worth the money. Especially love the distressed blade.",
        "Awesome knife. Lightweight and sharp enough to shave with. (Please don't try shaving) time will tell about it's durability and the lock doesn't go to the middle of the blade as one would expect but it does lock it secure. It is shipped from the Kershaw facility in Oregon where it's made.",
        "Overpriced and speedsafe does not work! Never buying another Kershaw knife!! I'm going back to Chinese knives apparently USA can't make a knife!",
        "I am a knife guy. Was looking for something to carry everyday - but still was special. This knife does not disappoint. Action is smooth and sharp. Blade is sharp and has nice curves. Everything tight where it needs to be. Thumb post is perfect. Spring is perfect. Size and balance are perfect. At this price, 10 out of 10. At double the price, 10 out of 10. Very pleased. Very well made.",
        "Keyshawn Blur is the best value assisted open pocket knife! Not a whole lot else to say. Great spring action on the open. It is easy to close and has a slim profile, perfect for EDC. The scales have just the right grip needed without any possibility of wear and tear on your clothing. I own two of these myself, but bought this one for EDC for my daughter in college. UPDATE: I just purchased 3 more Kershaw Blur knives as gifts for family and friends. I’m really not into knives, but this is an excellent EDC knife for anyone. Perfect size, sharp blade with a great spring assist without any accidental deployments.",
        "Slick, smooth function - like a \"blur\". I have the tanto tip which is great for piercing and also works well for using the point to open tape on boxes with a single line drawn across the seam. Excellent quality. Kershaw's have also been my favorite for pocket folders, and this does not disappoint.",
        "I ordered the Blur Glassbreaker Folding Knife Partially SERRATED on discount during a flash deal for 44.99. I got it in the mail two days later but was so sad when I saw it was just the regular blade and it was not serrated. I don't want to risk returning it now and buying again because it went back up to like 68.00$. I kept the one I received and it is really sleek and nice. A high quality blade and it did come with a serial number printed on it.",
        "The best pocket knife I've used, I've been carrying a pocket every day for my entire life, and I've tried many styles and brands. This knife out preforms knifes 2 or even 3x the cost. Reliable lock high quality steel and unmatched open assist.",
        "Packaging was perfect, straight blade is sharp, tanto edge is perfect, serrated blade is very well made. Assisted Action to open the blade is very fast and needs very little pressure to open the blade completely to open and locked position (Review Video). Grip feels very nice on the hand and is very slim in the pockets (skinnier than 10 pennies). I purchased this knife to replace my Ka-Bar BK&T 13 because it was too small altogether. I think this Kershaw will be a perfect EDC knife.",
        "My 4th Blur from Kershaw. Excellent knife for the price. Sharp out of the box, holds an edge well and is fairly easy to sharpen if necessary. These are tough and hold up well to every day use. The opening is very easy and very fast. It locks up tightly with no wobble. I've bought 4 not because I've been able to break or wear one out but because I wanted it in several colors (this blue and the green are both awesome). Great knife, even when compared to some of my much more expensive folders.",
        "This is my 2nd Kershaw Blur (my 1st was donated to TSA.....) and it's by far my favorite \"daily carry\" knife. The action and spring are solid, the profile is thin and comfy in my pocket, and the finish looks great. Also the textured rubber inlays really help keep this knife solidly in your hand. I'll be buying my 3rd Kershaw Blur just as soon as I lose this one!",
        "I like this to carry because: Slim profile Clip stays tight and doesn't bend Clip is long and secure Comfortable grip Serrated section Durable metal Came sharp All black is bad ass And yea that's pretty much what's awesome about it. Would recommend and definitely would rebuy if mine broke for some odd reason. —- Update I bent the clip. Only a matter of time. Kershaw sent me a few extra clips for free.",
        "You should deploy the blade with ease by pushing ur thumb upward at the thumb nub on the blade, but this one I got for some reason doesn't. I guess is fixable by bending the spring plate in the blade but this is not my job and I don't want damage the thing so I returned it.",
        "If you are hesitating or indecisive on which knife to buy just save your time and buy this one. It is an amazing knife for the price and one of the best EDCs out there. Mine came literally razor sharp out of the box. I'm not kidding I shaved hair off my arm with it. Great knife NOTE- Please either do your research and learn basic stuff about carbon steels or take my word for it and get the S30V model of this knife. It does cost several dollars more but it is definitely worth the price.",
        "The Blur feels good in the hand and flies open with a good lock up. It is a very solid knife and very popular with knife enthusiast. Buy the SV30 blade and it will serve you well and maintain a razor edge for a long time. I love mine so far!",
        "This thing is scary sharp. I wont go into detail about the blur. This knife has been out there for some time now, but you won't get a better American made assisted opener out there for this price. This thing opens faster than some of my high end autos, and it is wicked sharp. some people don't like the skater grip tape texture on the handle but you will be glad it's there if you work outdoors in a cold wet winter. does wear out jean pockets faster though it's like sandpaper so be aware of that.",
        "Kershaw Knives are probably the best knives I've ever owned for the last 60 some-odd years. Yet they aren't made in the USA, a few of them are but still I don't feel so bad if I lose one, due to the cost being lower, than comparable knives. I still find people amazed on the spring loaded assist design they have on all their knives it's so great to be able to pull a knife out of your pocket and have it opened up and ready to work when you need it",
        "Can't get it to open one handed. Tried dozens of hand and thumb positions and now my thumb is bleeding. Dont waste your time. When I used two hands only opened half way. Getting a RMA.",
        "This knife came hair shaving sharp, its s30v steel it holds an edge very well. I did however get it even sharper with the Spyderco triangle sharpmaker (thats another review). It also opens very smooth and fast. The handle is nice and comfortable to hold. Its very grippy even when wet. The blade is slightly recurved, which makes it a bit more difficult to sharpen. If you want a high quality dependable, sharp knife this one is worth every penny.",
        "My husband was past due for a new pocket knife. He is a Diesel Mechanic and uses them often. He needed something sharp and durable. He loves this knife!! It is like a razor blade and even though he has not had it long you can immediately tell the quality and durability. This was definitely worth the buy!",
        "This is the 4th or 5th Blur I have purchased as a gift. Gave to my brother to replace a Blur with the tanto point he had carried every day for the better part of a decade. I personally find them heavy but most people do not mind the weight. The drop point is much more utilitarian thayln the tanto. Fit and finish are good. Steel is ok, you will have to resharpen with use. Woul not pay retail for one but when they are around $40 they are priced about right.",
        "Looking for a practical folding knife, I came across this beautiful specimen of a blade. The blade comes razor sharp and stays that way for a good amount of use. I use this knife as a tool, and the abuse I put my tools through, I bought 4 more expecting I might have to replace one when it breaks. I haven't used a new one yet, even gave one as a gift to someone just as hard on tools as me. I have pryed, cut, sliced, batoned, dropped and thrown this knife and the abuse shows on the surface but still operates as if it were newly broken in. I bought this knife in 2010. I use it every day.",
        "I love this knife. I carried one for well over a year, and abused the hell out of it through many factory and warehouse jobs. I used it in the rain, oil, and dirt. It maintains an edge like none other I've owned. I was devastated to discover my knife had been lost, so I immediately came back to buy another. I love Kershaw for making this knife, and was so pleased to find the brand new knife felt exactly like my old one. Which means after a year's worth of abuse it still functioned like new."
    ]
}