{
    "entity": "Pocket Knives & Folding Knives",
    "text": [
        "I searched for several pocket knives on Amazon before arriving at this purchase. Glad I did my research, especially in dimensions and Brand, because this knife is excellent! I looked for a smaller pocket knife, merely for the fact that existing items were going to accompany the very pocket this knife shared. Sleek design, very slim width, good grip: this little, efficient pocket knife was so nice I ended up buying four more for family members as gifts. Definitely recommend this knife for pockets, so far it's come in handy in all sorts of situations: clipping postal cord, slitting plastic packaging, resetting a ISP modem with its point, and more.",
        "I believe that the best knife is one that you always have with you. That is why I purchased this little guy. After wanting a meatier blade that the mini Swiss Army knife that I've carried on my key ring for years, I came across this Gerber (see attached picture for comparison). The knife is VERY light and thin, looks great, and handles all of the urban tasks that I need it to without being intimidating to others. If you were like me, and were looking for a lightweight, practical blade that won't raise eyebrows every time you pull it out of your pocket in the office - don't hesitate to get this knife. It is an excellent blade.",
        "A while back I gave the Gerber only 4 stars, but I just purchased 2 more because I just love the knife, but from time to misplace it and do not like to be without.one. The original knife still works very well and is still very sharp. If I put a lot of force on the blade sometimes the locking device will require a little prying to loosen. It is minor inconvenience but I no longer consider something to drop a star. I would rather have the lock be over secure that under secure.",
        "Comparing Gerber Paraframe Mini with Gerber STL 2.0 Both blades are nearly identical. The blade length (excluding the Ricasso, the unsharpened part) is 2.12\". When closed, both knifes have nearly the same profile size (the Paraframe being slightly larger). The STL is black and the Paraframe is unpainted stainless. Which knife is better comes down to how you want to carry it. The Paraframe is a little thicker but also has a belt clip, which effectively doubles the thickness and would be uncomfortable in a pocket. If you want to clip the knife, get the Paraframe. If you want to carry it in your pocket, get the STL, which is thin and smooth and not noticeable.",
        "This disappears into my pocket and is 1/3 the size of my key-ring flashlight! But the 2\" blade is nice. Compared to my Gerber LST Ultralight, the STL is physically smaller even though it's a few more grams. I don't notice the tiny difference in weight, but I do notice the STL's smaller size. Smaller and a MUCH better slicer than my old Buck MiniBuck. There's only two negative for the STL 2.0 1) Low-quality steel - not for anything heavy duty, but it is only a 2\" anyway. I'd love it in something like 440C. 2) The frame-lock is awkward to disengage and it's easiest to two-hand it",
        "The blade dulls more than I'd like, but it's so light, compact and feels good in the hand that I'm still satisfied. The point is terrific and can tear thru most things. I used to carry all kinds of blades for my job and this is the first one to feel like it's not there till put your hand in you pocket. Some pocket lint will get caught up in there, but a quick birthday candle wish blow will eliminate it!",
        "This little Gerber is utilitarian and not noticeable when in your pocket. Carry it daily, use it daily and have no complaints. It's a $13 knife that gets the job done. Hard to go wrong here, it's a value pick. You won't cry in your beer should you lose it. I have multiple knives and this one gets picked up and dropped in my pocket most often. It isn't fancy or prestigious, it just works and is so thin that you don't even know you're carrying it. Useful tool and a good value.",
        "Date of writing June 2020. This thing has come in handy so many times and it still surprises me even now how sharp and durable this keychain pocket knife is!! for being this small I can't believe how well it cuts, comparable to a regular-sized knife! I've cut from letters, tape, and thick cardboard so many times its just ridiculous that this knife is still doing great and more! HIGHLY RECOMMEND and definitely buying again if I lose mine because it won't break for sure!",
        "Smaller than I thought and very light. Construction seems to be on par with other Gerber products, however this particular knife can be hard to close. What I did was use a screwdriver as a pry bar to slightly bend the side of the knife out a bit and knife is much easier to use. When knife arrived the blade was acceptable sharp but I did put a keener edge on the blade...I like my knives to be sharp!. Overall good value for money.",
        "Love this little knife. A small, light, serviceable blade is one of the handiest things a man can carry, and this one is the slimmest, lightest one in my arsenal. A two-inch blade that locks securely when open, and wicked sharp right out of the box. Its not going to serve you well in hand-to-hand combat, unless you are tangling with an unruly zip tie or uncooperative Amazon box ;) But for small, everyday tasks this Gerber baby knife is ideal. For those who like to carry a blade everywhere they go, including to the office, it will not put an ominous bulge in your trousers. Your POCKET, I mean. Sheesh.",
        "This is a great little pocket knife until you try to close it. You can not do it with one hand and even using two hands it is not much easier. I can not recommend this knife. The locking bar is poorly placed and is an accident waiting to happen.",
        "It's strong, stays very sharp, takes an edge quickly from any sharpener, MOST OF ALL it's on my key ring and I use it every week several times. It's strong enough for cardboard boxes, it doesn't flex when you force it into harder materials, it's not noticable on your key ring so it's always there and easily accessible within a second or two. I've used it hundreds of times and the best knife is the one you easily carry, and use. So what if it's for packages, boxes, prying things open. Love this little useful knife.",
        "Replace an older smaller Gerber. Was larger than expected but thin all metal design a plus. Release mechanism seemed cheap to me compared to button releases I was used to but I came to love the longer blade, which is extreemly sharp, and narrower design compared to the composite smaller Gerber I had prior to this. The longer blade just works better for everything, an although longer than the prior, I still love it as my carry around blade attached to my keys. Thought I bought the wrong one at first, grew to love it as a better choice after getting used to it.",
        "Simple review: Strong, small, and light weight! Sharp right out of the box. Like another review, this knife can be put in your dress pants pocket and it's not noticeable. I added photo's above referencing quarters to show the size. Lock is strong and will not close on you.",
        "This is really small, so know that before purchasing. It's similar in size to pocket knives such as the smaller swiss army types. It fits perfect in your pocket (you won't know it's there), and on keychains. It's sturdy and well built, the hinge/blade is a little tight but not too tight, the blade is pretty sharp, overall very pleased! I'm going to be using it specifically for preparing kambo/sapo and applying the medicine to the burn points. I'll probably purchase a second one for my keychain as well.",
        "This little knife was an okay size for a pocket knife, and very lightweight, but not up to standard. It was sharp, but its folding mechanism never worked right. We had to pry the bar open every time we wanted to close it, and at that, it was challenging. We will never bring this on a camping trip again, or give the knife away. It is dangerous because it doesn't fold up easily or quickly.",
        "The good: It’s small and locks. It’s a knife, like advertised. The bad: The way it locks makes you close the knife on or at least toward the finger you use to unlock it. The tab to unlock it is in the slot the blade folds into. One day, if it hasn’t already happened, the design of this knife will cause someone to slice their finger or worse.",
        "The blade lock on mine barely caught the edge of the flat on the back side of the blade, because not enough material was removed in production. It locked for about a week, then no more. Would have been an easy fix if I could have gotten the blade off. Ended up throwing it in the trash. I guess you get what you pay for... If the blade lock would have worked, I would have given this knife 5 stars. It's very thin-- you hardly notice it in your pocket.",
        "If you are looking for a very small knife this might work. In the descriptionthey state \"Can be used in various military, hunting, survival, tactical, industrial and outdor situations\" to say this is a stretch would be a stretch is an understatement. The knife would be useful as a letter opener, for concealment if you were a magician..or...I don't know. The next size up is all that for 10 or 12 dollars more. Gerber 22-47162 FAST Draw is a very fine knife, I have owned several and they loosen up deployment wise, and are very fast. They do need tightening with an Allen Wrench after a month, but hold an edge well and are a bargain. This one...not so much.",
        "I only have very occasional use for a penknife, but when I do, it's hard to imagine anything better than this little gem. It's small, thin and very light, but I have yet to find a situation it can't handle. After recently losing it, I decided to order the slightly larger 2.5 version of the same knife. Even though it's the exact same high quality knife in a slightly larger size, I decided to keep it as a backup and ordered a new 2.0 to carry in my pocket. I love this little knife.",
        "Small. Lightweight. Sharp knife. Opens and closes smoothly. I like the simple locking mechanism. It is quite small though, just so you know. The finish looks good. I brought it on my trip to Costa Rica. My knife rusted a little in the humidity (but it's very humid here). I used a scrub pad to get the rust off and it left some marks in the finish as well. But the rust is gone and I've been more careful to keep it mostly dry and no more rust so far.",
        "Great knife. Very small. Fits in that small pocket that's inside the right pocket of most jeans. Sharp and attractive looking. MINOR ISSUE: When dropping the knife (2 times it has slipped out of my hands non-opened), the knife opened slightly. If I possibly would not have noticed, my dog could have cut herself or someone else. That is very minor. GREAT KNIFE. I was not paid to leave this review. I hardly leave reviews. Only for products I truly enjoy.",
        "This is a great little knife to carry in your pocket every day. It is of good quality and comes in handy in many situations. Stays sharp for a long time and I never noticed any corrosion. You don't even know it's in your pocket, which is the reason why I already lost two of them at the airport. Just before the security check I noticed that I still had it in my pocket and I had no choice but to dump it in the waste bin :-( At least they are affordable...",
        "I had one of these for years and lost it. I missed it a lot. I had to have one in my pocket so knew I was going to buy this same knife. This is a quality knife. Nice and thin to fit in the pocket without you knowing it's even there. I can't survive without a pocket knife. This one is the best little pocket knife around.",
        "Well build and sturdy for its size. But the lock release mechanize is a bit hard to use. If the cutout opposite the frame lock release was even 1mm larger I would give the knife 4 stars. For occasional use the frame lock on this is not an issue, but it could have been made better by making the cutout on the opposite side 1 mm bigger w/o effecting the over size of the knife.",
        "Impressively sharp after 2 weeks of daily use. Distinctively styled. Fits in any pocket for any occasion and is the lightest knife I have in my collection. Other than taking many days to get down one-hand opening, I'd give this a 5. Most people with larger hands would never open it single handedly. Keys and other objects in my pocket have slightly marred the surface but I'll mainly use this for \"dress\".",
        "This little guy is the best thing on my keychain. It may be small, but after a few sharpening sessions, it can basically cut through glass! Normal pocket knifes can be quite bulky in pockets, but this little guy fits right onto your keys. I have never had an issue with this product, and actually plan on buying a second.",
        "At first I thought it was too small. But after being on trail, I realized that I almost never have a need for a bigger knife. This knife is perfect for having an edge, cutting things around camp, and having a reliable thin edge to lever things or open my bear cannister with.",
        "I bought two of these knives, and both needed to be returned. Quality control is seriously lacking. One knife was literally coming apart at the spine, and the other knife was so tight that the blade was very difficult to open and close. This condition is bound to cause someone to be injured. Let me add that I'm a knife aficionado, owning nearly 300 folding knives, including many Gerber knives.",
        "Great small knife that is sturdy and easy to open and close locking blade prevents accidents. Easy to Carrt and quite sharp",
        "The best knife ive ever owned! it is small and convenient, doesn't bulge out of a pocket, easy to handle. Even though its small its TOUGH! ive gutted deer with it before! I hop they never discontinue this knife because its amamzing! Whenever someone else uses it they always comment on it and say they need to get one! LOVE it",
        "Good sharp blade. When closed, the blade does not protrude into the hole for the key ring. That’s important. Have bought two more since purchasing the first one.",
        "I love this knife. The slim design and low weight makes it easy to carry in my pocket every day. I use it mostly to open stock boxes but it's been used for quick bridle repair also. I just bought 2 more as backups after misplacing my current knife. 2 days of carrying a bigger, heavier knife convinced me I don't want to be without this one.",
        "It fits in the change pocket of my jeans so I never have to look for it. It takes a heck of an edge. The frame lock works very well. The finish does not handle oil and comes off if you wipe it down with an oiled cloth. It doesn't come all the way off, you might call it burnished, so it doesn't take away from its usefulness, but it cost this otherwise nice little knife a star.",
        "This was a replacement for my sons lost one! He loves it so much and hunted for another one in stores!",
        "It is a no frills, small lock-blade just perfect for backpacking, my intended use. I will cut salami and cheese, paracord or string, open packages, and if necessary, make tinder, and all for just an ounce or so. It came with a nice edge, and I was able to dress it a little and get it the way I like it, and it took the edge easily and seems to hold it well so far. I got the silver skeletal one too, since they were so inexpensive. I do like the clip that came on the silver one, that this one does not have.",
        "I have two of these (1 upstairs and 1 downstairs). They are remain sharp after years of use, and are easy to open and close. And, their size is just right for the little jobs I use them for. Lack of a clip-on makes them even nicer, IMO!",
        "The knife was smaller than I thought, but I don't blame the product for its short comings... The finish of the knife is scratched, and the screws looked worked. It came in a blisterpack, but looks like it was refurbished. Small knife, relatively sharp, not like chef sharp, but nice. I'd buy it if you want a small knife. I gave it 4 out of 5 because when I buy something NEW I want it NEW not refurbished. If this wasn't refurbished, they need to reevaluate how they assemble the knifes because it looks beat to hell. Other than the aesthetics, the knife is perfect and fully functional.",
        "I carry this knife all the time. It’s so slim and durable. I’ve used it for everything from opening boxes to filleting large fish. It’s also hand as a bottle opener in a pinch. It keeps an edge well and is very easy to sharpen. Wear on the handle looks good and adds character. I’ve only had to replace this knife once when one was tragically misplaced.",
        "Wonderful pocket knife. This won’t chop wood but it will pry open items cut rope, slice cheese and meat. Enjoy",
        "I keep this knife in my watch packet, and have used it innumerable times while remodeling my house to trim corners, cut into packaging and all around be a great little tool to help me with my \"almost\" construction skills. Blade has held a good edge through trimmer drywall, cutting some light cardboard, and pulling the occasional staple. The only complaint I could possibly have is the size of the knife and the size of the blade release. However, that is silly because it is just that size of knife. But if you have thick fingers, you may need to use your nails to close the knife up again.",
        "SUPER great quality. I also love how tiny it is. Works perfectly on my key chain!",
        "This is my fourth of these little gems. I like having at least a small blade on me at all times. This one fits the bill nicely when my pocket clip knife is too much. It's very thin, easy to forget it's in your pocket, which is probably why I keep loosing them. I have not broken or worn one out yet.",
        "This is a perfect pocket knife to carry when you don’t want a bulky heavy pocket knife. Slim design, light weight, perfect for those small jobs you run into during the day. It’s so small and light that you forget you’re carrying it. The unlocking mechanism works easily after you get used to it. I don’t leave home without it now.",
        "Small and light , very functional and sturdy . it is a little difficult to open and the action is not very smooth and unless you spend some time practicing i doubt you can open this with one hand and if you did it would be tricky without cutting yourself . Its worth the small price .",
        "I had a Gerber knife that looked identical to this that I loved. Bought this to replace the first one because I lost it, I would by this knife again and again. Edge is amazing, handle lock is nice and tight, and it is solid but light weight. Highly recommend for a general use knife.",
        "Got this for my 13 year old daughter as her first pocket knife. It’s the perfect size for her pocket, wallet, purse. She loves it and I feel safer with her having it. Love this brand. Have 5 in my family.",
        "I've had this knife for three years now. It is quite small, light, and easy to carry. It came very sharp and I have been able to keep it sharp through regular sharpening. At this point, I mainly carry it whilst out walking my dog due to it being so small and light.",
        "Just ordered my third, TSA took the first one, just got my second robbed at a security check at a concert. The good and bad about the size is that you always leave it on your keychain. Sure I usually remember to take it off when necessary but I forget about once every year or two. It's like a car lease I guess, new one every couple years. Great knife.",
        "i have lost 2 of them, and the other 2 tsa have taken or i've given away before the tsa could take it. i keep buying new ones cuz this knife is awesome. i'm sad it has cost me so much when i consider the number of times ive replaced it.",
        "I lost my original Gerber like this. It was the best pocket knife I ever owned and had it for nearly 12 years. This one is as close as Gerber gets to the one I lost. It is the same size, weight, and the same open and clos function. So far it is remaining sharp. I use this for my pocket tool and probably expect more from it than I should. My original never lost it's sharpness , never broke and I was heart broken when I lost it. Hopefully Gerber will not disappoint me and this knife will be as dependable.",
        "We have given my Dad a knife just like this as a gift a few years ago. He used it daily and absolutely loved it. Somehow he recently lost his and was desperate for a replacement. Luckily I was able to to a quick search and found this one identical to his. He was very happy to get a replacement. He like is because its slim so it fits comfortably in his pock. The blade is very sharp and keeps it edge; unlike inexpensive knives that go dull almost immediately. Great single blade knife to have handy for many uses.",
        "I bought this to have a discreet knife so I can cut open boxes where I volunteer. That same day I lent it to my friend when her plastic knife wasn't cutting her apple very well, and this little blade worked beautifully as a fruit knife. Today, I found myself wishing I had brought it with me to class during break. The perfect, practical knife for someone who never knew they needed a folding knife in their life.",
        "I had one of these before until I lost it. I loved that knife; it was small, light, maneuverable and SHARP! Craftsmanship was excellent and so was build quality. I loved it so much I had to get another.",
        "Hard to beat this little knife. Well, okay, the steel could be a grade or two higher in hardness, but I love it anyway. It's very slim and thus very easy to carry in your pocket at all times--even dress pants. Of course, with a 3\" locking blade it would be illegal in the United Kingdom, so I leave it at home when I visit my son. But otherwise it goes wherever I go. I've lost one, and immediately replaced it.",
        "It's not a bad knife for the price, but it has a couple of major flaws. The main problem is that the locking mechanism is so small and so stiff, closing this knife is kind of a pain. My other gripe is that, while it comes with a nice matte black finish, you can expect it to wear off within a few months if you keep this knife in a pocket with keys. I'd recommend something like this instead:; it's a lot easier to close, and while the faux brass finish will wear off, it still looks just as good afterward.",
        "This is a handy little knife. I like it a lot. I've owned a variety of Buck and Gerber knives. It was a super low price and typical Gerber quality. I'm surprised the black coating has not wore off considering I keep it on my keychain. It is slightly heavy for it's size compared to plastic handled knives but feels more sturdy. The only negative is to close it, you have to have a stout thumbnail and reach inside the opened part of the knife. Out of 5: Weight per size...3 Overall quality...5 Holding a sharp edge...5 closing ease...2 opening ease...5 price...5+ Bulkiness...5+",
        "My favorite pocket knife. Small, light, thin, and sharp. Comfortably fits in the coin pocket in my jeans. Locking blade is a must after too many Swiss Army knife casualties. The locking mechanism requires two hands to close or one fairly dexterous hand, since you have to pull out the locking tab rather than press it down to unlock it and fold the blade.",
        "This is a very handy little knife. It is amazingly sharp; you actually have to be a bit careful with it, at first, because it \"bites\" more quickly and carves a finer line that you might expect. It's too small for me to open one-handed, and closing the knife is a little more difficult than I'd like. It's not a knife that I would use for heavy work, but that's not its purpose. It is very useful for light duty, as a utility knife or even, given the keenness of the blade, an emergency medical knife for your backpack (this would be far, far less damaging than most \"camping knives\" I've seen).",
        "This is a nice little knife, and a good price. I had a problem at first figuring out how to close it once I had it opened.I even contacted Gerber to ask about it and got a helpful response It is not difficult to close once you have mastered the process. You have to hold the knife with the handle in your right hand, blade facing up. Then with your thumb pull toward you the side of the frame facing you.That allows the knife blade to unlock from its locked position and fold up into the handle. A little bit of a challenge, but I like the locking feature, and its a trade-off I guess.",
        "Very compact, surprisingly sharp. Great little knife to keep in your pocket.",
        "I've had this thing for about six months, now, and I'm happy to say that it will NOT take a razor edge. It cuts easily, but won't take a slice out of me if I get careless (I'm 80 years old). It's a good gift for grandma/grandpa/goofy old uncle, whatever.",
        "I usually carry a pocketknife. I have several and choose my knife based on the type of pants that I'm wearing. This is the thinnest, lightest knife that I own, and I carry this with dress slacks. It's barely noticeable in the pocket, and of course the frame lock mechanism works well.",
        "I've had this knife for a week, and I love it. It's the size and weight of a modern car key, but has a 2\" blade which feels generously large for something that fits comfortably in my pocket. It's sharp enough to make quick work of boxes that need to be broken down, and large enough that it works to cut steak at a bbq. This is exactly the knife I was looking for.",
        "Where I work at to cut boxes open you either have to use their \"people friendly\" box cutters which are terrible. Or they allow you to use your own blade as long as it's under 2 and a half inches. So I bought this to give it a shot and I'm very pleased with it. I've had it now for a few months and I still haven't had to sharpen it yet. So it holds it's edge well. I put a lot of use to this blade and it's help up to it. If this blade should break tomorrow, I'd say it worked well enough to justify it's price and I would buy another one.",
        "It can be done but between small grip and the cutout instead of a stud, I mean one can one-hand an Opinel too. No biggy though, it achieves its apparent main goal of high utility/size nicely.",
        "Awesome little knife, smaller than I expected but works out because it fits in my pocket (yes even women's pockets). It was having an issue where it was getting stuck open but the more I use it im hoping it will close better. Will probably buy another one to keep with my camping stuff. Only downside is it's easy to lose because it is so small!",
        "This is one of the smallest, lightest, slimmest folding knives I have ever seen. While I have bigger, more functional folders I wanted a very small, unobtrusive knife that would disappear in my pants pocket without leaving a trace. I carry it everywhere, even in dress pants. It makes a perfect gift for someone who should have a knife but doesn't want the weight and bulk of a typical clip on folder. Tip: Thread a short lanyard of bright 550 cord onto it so you can find it when dropped.",
        "It's super stiff and difficult to open and close. I initially just thought \"you get what you pay for\" but the closing is so stiff you risk injury every time you do it. I can't recommend this.",
        "Found it in a parking lot. Had been run over a few times. Had it for quite awhile on my keyring, Was still sharp when it fell apart...One word of advice. Keep an eye on the screws. Glad they still make this model.",
        "This is a great knife for something like a lunch box or for your pocket. It seems to hold on edge very well. The only downside of this thing is that the lock is extremely frustrating to squeeze to close the blade. I can barely fit a fingernail inside to press it the side.",
        "I bought two different Gerber pocket knives at the same time. Both are good. This one is what I carry in my pocket. It is slender, light, small enough to get lost amongst my keys when I reach into my pocket for it. But, it seems extremely strong, has a good blade which has held its edge very well in the time I have had it -- several months. I would not go back to the old design pocket knife with a fat body and, relatively speaking, too much weight. Overall, this is a very neat and useful device for the average person. Harold Holcombe",
        "This knife is a lot smaller than I though, even though I should have known because the measurements are on there. It is not easy to open, and pretty tough to close too... a bit of oil might help but, it could be challenging. That said, seems sharp, cuts things, works as intended. I usually expect better from gerber though.",
        "Handle is too tiny to grip it with any strength or dexterity. IT's much too small to open one handed, which is what you want with a keychain knife. The only manufacturer who had a good design was Snapon and for some reason they discontinued theirs.",
        "Here's what you need to know. First I will start off by saying \"Dude\". For a small pocket knife there is no other. I buy these like they are going out of style. The knife is thin, yet it's not flimsy like other knives that are this thin. I use them for everything. Altoids kits, wedding gifts, I even give them to females who don't like to carry big knives. It comes hair popping sharp. People that give bad reviews of this knife are not using it as it was intended.",
        "Great product and met expectations as described - needed something small and discreet to carry with me on a daily basis and it does the trick. About the size of the smallest Swiss Army knife I previously had. Great product and very sharp, would highly recommend if you're looking for a VERY small knife.",
        "Very sharp, small, well made. My teacher wife gave these to the high school graduate boys where she teaches. (Understand, it's a tiny high school in small town Texas... No Worries) I ordered one extra for myself, glad I did.",
        "Gerber knives are solid, but the picture and length was misleading. It is a significant amount smaller than other knives I purchased with the same dimensions listed. It will be a good pocket knife more likely be used as a small letter opener or opening packages. If your looking for a great knife check out Hoffman Richter, way solid and a step up from Gerber.",
        "My front teeth are porcelain due to a childhood accident and I love apples. I carry this everywhere. It's truly perfect and has passed the x-ray machine criteria at the Federal Building the one time I forgot I had it in my purse. It's strong, the right length, easy to clean and have used it in a pinch for art projects of field trips at my kid's school. I'm known as \"Macgyver Mom\", as my purse is only 6 inches long by 4 inches tall and half an inch wide (and this fits with my phone and wallet and lip shimmers)...",
        "This a very sweet utility pocket knife. Good steel that keeps an edge. Light weight. This will ride in any pocket without discomfort. It will \"hide\" in your loose change, just remember take it out before entering any stadium or airport....I \"lost\" one that way.",
        "This is a perfect small knife for daily light use. It's incredibly thin when folded, and just long enough for things like opening packages and sharpening a carpenters pencil. I have managed to open and close the knife one-handed, but it isn't easy and fast. Unlocking the blade requires pushing the inside of the handle right where the blade goes, so you have to be careful. I guess that's the price you pay for having such a thin knife. And the price is pretty low for such a good quality knife.",
        "I love this little knife. For many years I didn't carry a pocket knife, but after buying this on Amazon on a whim began carrying it around with me. It is so useful, sharp, easy to sharpen, thin and lightweight, but strong. My wife noticed that I was using it all the time to open the mail, boxes from Amazon, and general cutting duties, so I bought her one as well for her to carry in her purse. One of those impulse purchases that really turned out well.",
        "Very nice small pocket knife. It is very thin and pretty short so it does not clutter your pocket, but has a nice sharp edge and doesn't wobble when using it. It works really good for small jobs. Don't plan on skinning a hog with it, but to cut open a box or trim a wire, it is perfect. And yes as you have seen in other reviews the locking mechanism is unusual and fairly tight, but after a week of use, it loosens up and doesn't become an issue.",
        "Sorry, but these (I ordered 2) were very disappointing. I didn't expect much for the price but wanted to see what Gerber would sell in this price range. Both knives needed tweaking with a screwdriver just to release the frame-lock. Even after some additional tweaking they were still difficult to close - it seemed like there was metal-to-metal scraping when releasing the lock mechanism. I have about 15-20 pocket knives and these sit at the bottom. Hands down.",
        "It is a cute knife about as long as your finger. It is incredibly dull. It might be possible to stab something with it although it is so flimsy I would be concerned it would snap. You are going to have to work hard to slice something with it. No attempt has been made to sharpen it. A more accurate advertisement for it as delivered would be \"Fingernail Cleaner\". It's small size is good for cleaning your fingernails and it is so dull you don't have to be concerned about cutting yourself.",
        "This is a great little knife. It was pretty sharp out of the box, but I gave it a better edge and it's scary sharp now. This is pretty small and can get lost in your pocket, but I don't mind given that I was looking for something on the smaller side with a razor sharp edge. However, its small size and all black color makes it easy to mislace if you're nor careful. This could be solved, however, with a colorful lanyard or by giving it some brightly colored trim. Enjoy.",
        "This lives on my keyring for any small cutting task and does the job well. Holds an edge for a reasonable time. A classic EDC for years to come.",
        "Save your money and buy the Gerber Paraframe Mini for half as much. The STL 2.0 came dull out of the box and quickly returned to being dull after minimal use. Even after attempting to sharpen the blade it had trouble cutting a piece of printer paper",
        "This is a great knife! Great value, extra sharp, well made. It is perfect size.",
        "A little giant. Keeps a sharp edge and is backed by Gerber for replacement if ever an issue.",
        "This is a very sharp little knife right out of the box. It is very lite weight and can be carried in your back pocket and never know is is there. It it a Gerber knife but if made in china. An excellent pocket knife for small jobs aound the house, at work or at church. Bought one fir a friend and am going to buy another to have a spare.",
        "Nice little knife. Very sharp. I almost forget its in my pocket. Kind of hard to close blade but well worth the money.",
        "So the quality is fine. It's got a sleek design. Very thin and light. The action could be smoother, I wouldn't expect such a little knife to require two hands. My girlfriend likes it because she doesn't like to have much in her pockets. Can't see myself carrying this knife unless they thicken it just enough to put in that Gerber assisted open that I normally love.",
        "Too small and extremely difficult to close, I needed another knife to depress the liner lock to close this knife. Smaller than I thought",
        "I have ordered a total of four of these little gems. I carry one and the rest are given to friends as gifts. This knife is light weight, and very very sharp. Holds an edge. I probably use mine daily as many of my friends have said they do. You can't beat the price either!",
        "This is the third one of these that I have had over about 10 years and love them. The only reason I have three is that I will loose it and buy another one. As a guy that has carried a pocket knife my whole life, I really appreciate how thin and light this knife is. You can sit on it in your back pocket all day and not even know it is there. It also has a classic gerber blade that comes razor sharp and has an easy to maintain edge. Price is also right.",
        "...but only because it is so good. This knife holds an edge pretty good for its size and price. My favorite part about it, though, and the reason I'm back buying it for myself for the THIRD TIME, is because it is SO slim, I forget it's in my pocket. As such, this is the SECOND TIME I've been stopped by airport security to take it out of my pocket. Because it's so cheap, I just tell em to keep it and I'll get another one! I don't know what I'll do if they ever stop making this little knife. :-/",
        "This is my third one of these, only because I loose them. Very handy and small size makes it easy to carry.",
        "It looks good, sharp, and slim. easy to forget it is in my pocket",
        "Nice sharp little knife. Very easy to open, which is why I gave it 4 stars. I'd almost prefer it be a bit more challenging to open in case a child or me when drunk ever handles my keys."
    ]
}