{
    "entity": "Claw Hammers",
    "text": [
        "Amazing. Where this beats the heck out of the Irwin brand framer I have and the DeWalt is the claw. It has very good bite, so you can pull out nails that their heads came off with this hammer with ease if you know how. I bought another and will only use this brand from now on. I don't have time to mess with simple stuff.",
        "Any old school master carpenter respects his hammers. A new generation doesn't even know how to hammer, but uses nail guns. But my favorite-legendary status-hammer has been the Vaughn 19 oz. milled face with curved handle. Mine was recently stolen. This replacement feels like made in China low quality. It says made in USA. I doubt it. The head is quick cranked out of a machine. The edges are sharp, not hand polished like the old ones. The balance feels off. I miss my old hammer.",
        "I love this hammer. It swings great, feels good and balanced in my hand, and feels really solid. And for a price this good I don't even worry about the wood handle possibly breaking. Would buy again.",
        "There is no other hammer, period. Good grip, well balances and wood. My father pounded pole barn nails for years with these and I pounded pole nails for years with these and they are great. Now a days everyone should be using nail guns to make money but you still have to have a hammer so you might as well have the best swinging from your belt.",
        "Awesome hammer. I have a general carpenters hammer that I have used for over thirty years. Still use it but this framer makes light work of driving the heavy gauge nails.",
        "Great hammer. Nice wood handle. I did sharpen the claw some. Other than that have drove a couple hundred nails with it with no problems. Takes a little getting use to.",
        "Works well. Handle is long and the grip takes a little to get use to, but once you get used to it its great.",
        ". . . like this last year when I was framing in our enclosed porch it would have been a lot easier and I would probably have hammered a few extra nails just for the pleasure of using the Vaughan California Framer. As with myand, I find the balance just as perfect as one would expect of a hammer with the Vaughan name. The curved white hickory handle fits very comfortably in my hand and the 17 inch length gives me a nice extended reach for those places that are hard to get at. ~ The Boss",
        "My favorite hammer so far, good balance and strikes hard! Especially for a 19 oz.",
        "Best hammer on the market!!! Love the weight and feel of this hammer. Balanced with a great swing! Had a titanium one and I always go back to my 19 ounce. Guys swear by their sledgehammer (21+) and I drive with more force then those",
        "Didn’t last, one claw broke off. Sad, used these all the time, now I’ll have to find a new brand.",
        "My husband’s favorite hammer for work. And it’s cheaper here then at Home Depot.",
        "This hammer is very comfortable/cool looking - does the job period",
        "What a great hammer! I'm old so the 19 ounces helps. Love the handle reasonable balance.",
        "Use it everyday best hammer for the price. A lot cheaper ordering from Amazon love it",
        "Made it my own, scuffed up lacquer finish to give it a non-slip surface. Wrapped electrical tape around the neck to avoid damaging the wood handle. Great ergonomics of the handle, weight balance, and head shape. Brilliant hammer. Gonna build a storm with it :)",
        "Amazing hammer. Im using it every day for the last 4 years in house framing and untill now it survived very well. The hammers face is now smooth but still never slips when i hit a nail. The only down with this hammer is the thick handle. Totaly worth the money ill buy it again if it will ever break.",
        "The face of the hammer is pretty severe more like a meat tenderizer",
        "Would definitely buy again. Great weight for driving framing nails, loved the curved handle, nice fit/finish.",
        "Hammer works great I use everyday and it drives nails fine price is right. I bought a deluge before this one and there is no comparisoN.",
        "Best framing hammer you can buy! Awesome weight at 19oz. Magnet to hold a nail. Great axe handle design. BEST CLAW MADE, EVER! All for only $25",
        "my 4th one ... hate any other hammers i use .it never makes my elbow ache because of the weight .",
        "The product was firme.. Just as described... It arrived sooner then expected",
        "Great hammer. Good weight and the waffle is holding up well.",
        "Im a professional carpenter and this is the only hammer i use. Great balance.",
        "Great framing hammer at a great price. The long handle is great for getting lots of power. I prefer hammers with hickory handles. The hickory does a much better job of absorbing the shock. There isn't any rocket science in this hammer, but there does not need to be. I am not a fan of the ultra glossy slick finish that comes on the handle, but that can be taken care of with some sanding and tung oil.",
        "So,I really should be giving this a lower rating. And what happened to me is unacceptable by any means. After ordering the curved, ax handle California framer, i received the straight handle California framer. Now as unacceptable as this is, The reason for ordering the ax handle, is because I've used the straight handle before and love it. And Although next time i will order and leave a note asking to double check that i receive the curved handle, I am not regretful of this order and will put this hammer to good use!",
        "This is a good hammer, but the magnetic nail starter on the blue version is worth the extra money. The magnetic nail holder on the blue one allows you to start a nail as high over head as you can reach with the hammer - for those times that you can't use both hands to start the nail.",
        "Wood on head does wear after time but last holds up and this is the 2nd one I purchased I enjoy it that much",
        "I have used everything from 12 ounce to 24 ounce hammers and I like this one the best for framing. It is a good compromise between weight and momentum. I have yet to see mine \"bounce off\" of a nail. Also, as of today, Home Depot has them on sale for $9.99.",
        "I've had the 19 oz. California framer for nearly ten years now. I like the feel of it, I can sink a 16 Penny nail in one hit. What more can you ask for? As far as the hammer bouncing off of the nail, I've never had that experience. I disagree that it's a hammer for the ladies. I've built Many houses and used it for many different things with this hammer and haven't had a problem at all with it. In fact I like this hammer do much, I got a second, took the waffle off of it with a belt sander and use the other hammer as a trim hammer.",
        "The nicest swing. Hands down, I have a tibone that's stays in my tool chest because of this hammer."
    ]
}