{
    "entity": "Claw Hammers",
    "text": [
        "I bought this hammer after having multiple wood handled hammers become loose after a year of work, I had an old Estwing framing hammer, that had been through hell and back, so I thought I'd give it a try for the 16oz hammer, Wasn't sure that the quality would still be the same, but it was just as good if not better, this hammer with the rip claw can frame, trim, demo, whatever you need it to. Although It is solid steel, the shock reducing handle really does work. The balance is flawless, it swings like a dream, and is a tool I will pass down to my grandchildren one day, it's made like a tool should be, to last.",
        "Lasts forever. Your kids will fight over these when you're dead and gone. I had the lighter ones (16oz) and bumped up to these bad boys - the only difference is how far that nail goes. They don't feel any heavier at the end of the day and swing super easy. They are indestructible.",
        "Like the headline reads, Thor has nothing on this hammer! This hammer was imported straight from Asgard bruh. Only problem is no one else will be able to lift it but the person who purchased it from Amazon! All kidding aside, the hammer is quality and the grip is comfy. Tool does it's job for light to medium jobs.",
        "I ordered the 16 ounce hammer, but Amazon Warehouse Deals sent me a 20 ounce by mistake. I decided to keep that one, and I'm glad I did. The 20 ounce feels good, is well balanced, and seems to be easier to handle than the 16 ounce version of other hammer brands (I've used the same Stanley for 30+ years). I think I like the curved claw better than the straight claw, but that's just because I'm used to it. I use a wood block as a fulcrum for the straight claw, which is actually better on the wood.",
        "Picture and discription are 2 different things. This is a short handle hammer. The picture is not a 16 oz hammer its a larger one. What you think your buying based upon picture is incorrect. Very miss leading amazon.",
        "I used this hammer while rebuilding a split cedar fence. As mentioned, it is lighter weight than a roofing hammer (easier to carry around), but also longer. I had no problem attaching 2 inch boards with ten penny nails. Estwing is a great, high quality brand and the handle absorbs the shock of pounding on a nail so your arm does not get tired when using it. I'd recommend it for any repair work you may have planned.",
        "You will not find a better hammer than Estwing. The duriablity is unmatched. This 16 ounce has a great balance and swing for everyday use. (I also have the 22 ounce framing which is my favorite of their line-up.) I prefer the straight claw as I find it easier to pull nails in tight corners. The handle is the best in the industry; no question whatsoever. You will not get the hammer fatigue nearly as quickly using an Estwing",
        "I have been an Estwing user for many, many years so it was a no brainer to pick up another Estwing to handle all my home repairs. The handle is great and it has a generous head area. I chose the 16 oz straight rip claw to compliment the need of a claw in potential remodeling situations with the understanding that I would probably be dealing more with trim projects rather than rough framing and the need of a checkered head 24 oz framing hammer.",
        "I meant to purchase the tin knocker 18oz hammer from Estwing, but somehow ended up ordering the wrong one. But my husband doesn't want to return it lol, he likes it and says it's very nice! I will most likely order the sheet metal one now. My husband is a plumber and hvav tech so I'm sure he uses both for different jobs. He likes that the forked part is straighter than most hammers. Sorry I'm not sure what you call that part of the hammer lol",
        "I use this for helping a subcontractor build decks and other home building work. It is a perfect weight, reliable and sturdy, and feels good in your hands! What more do you need? If you need a hammer for everyday work, then this is the hammer you need! Plain and simple!",
        "The finish of the hammer is not clean. seems as they were pouring the iron they spilt parts of it in the interior of the claw. They should have grinded it and then sanded it for a smooth finish.",
        "The Estwing hammers are simple the best. All steel and tough I have found them to be better than any other all steel hammer. I still have my first one and it is a lifetime tool. You can get a cheap tool but this tool is great value given how long it will last. I have even seen these on garage sales and they get sold very quickly. I purchased this one to add to my shop for my son. He bent another manufacturers steel hammer pulling some 3 1/2 inch nails and honestly it wasn't much less in price than this one. This is one of those tools that still has the quality in the product.",
        "This is my 3rd Estwing hammer like this one. Somehow, the other 2 vanished. Funny thing, the cheap imitations of this sold by some \"tool\" stores never seem to walk away. I have a couple of those I can leave around a job site without fear. I suppose it's a credit to the fellow workmen's skill that they recognize quality tools and only pilfer the good ones.",
        "This won't wear out - ever - it's worth the price (which isn't that much). Please don't mess with Harbor Freight garbage. I have a pile of hammer heads broken off of cheap overseas handles. Get these - you won't ever regret it and you won't have to buy more hammers in the future.",
        "This hammer is great! I had a 20oz hammer previously, but I lost it. It was a tad too heavy. So I decided to try this 16oz hammer. This is a much better weight for general purpose use. I suppose if you were hammering a lot of the same thing (like a deck), then a heavier hammer would be better. But for a general use hammer, the 16oz model is better for me. This hammer is also very well balanced and feels like a high quality tool.",
        "This hammer is the best hammer I ever used! It is large but not obsenely heavy. it has a very comfortable grip, as well as little rattle when banging on varios objects. it is balanced very well. This hammer deserves nothing less than the highest of regards!",
        "If your only going to by one hammer for everything (framing, demo, trim etc.) this would be a great choice for around the house projects. If working in construction daily, I'd get the 20 oz or 22 oz depending on your size. Estwings are indestructible and the perfectly flat faces stay on the nail head much better than a Stanley or cheaper brands. Handles are great and never seem to wear out. Still have the first Estwing I ever bought and still works as new. If I'm strictly doing framing/driving nails, I grab my Stilettos. But without a doubt, an Estwing will do everything adequately and won't fail you.",
        "Not a construction worker. I only use a hammer a couple times a week, but this was a great upgrade from a hammer about half the size. Feels easier on the arm than other hammers I have used. So far it's been great for ripping apart pallets. We'll see how it holds up.",
        "You cant go wrong with estwing. I am a contractor and have been in the businees for 30 years. This is the only brand hammer I have ever used. No matter the weight of the hammer it is balanced from head to handle. It is the correct length so it swings and carries well. I lost my last one and became scared when I discovered my local Home Depot stopped carrying estwing. Thank goodness I found it here!",
        "If you need a good quality hammer that won't let you down and want durability then you can never go wrong with this one. Plus a lifetime warranty? WIN! WIN!",
        "No tool box should be without an Estwing hammer. Good balance, weight distribution, and vibration damping, plus it is virtually indestructible in normal usage and even with a certain amount of misuse. This is a lifetime hammer unless you lose it.",
        "I'd only own Estwing. It's like when a company is really good at something because it's what they are known for: Irwin makes Vise Grips, Milwaukee makes amazing cordless power tools, and Estwing makes hammers. I've only owned Estwing for over 25 years. I can't recommend it any better than that.",
        "The hammer has a very high build quality and is way less prone to bend nails than some others I've tried. The only thing that could remotely be considered a negative is the clear coat on the steel scratches easily, so the hammer starts to look \"used\" fairly quickly. Given that this is a tool for hitting things, I don't remotely consider that an issue, but it was something I noticed as a difference compared to other hammers I own.",
        "This hammer has 4 stickers on the different surfaces and I would not attempt to remove them. A hammer should have bare surfaces that will not show wear as you use it. These stickers will get banged up and show the paper and adhesive on all sides!",
        "Do I really need to review this hammer. Estwing Hammers are the best in the industry if not the world. Made in the Great USA...LOVE IT...I worked for more than 10 years in construction mainly as a framing carpenter and this is the hammer the Pros use because they are comfortable, well made and last forever...Buy it..",
        "This hammer is balanced, durable, everything you could want in a hammer! Bonus that it is made locally as well! I purchased it for some small renovation projects around the house but my husband keeps trying to steal it for his tool chest and he is a commercial construction guy. He says it's a 'great' hammer... guess I'll need to buy another for him.",
        "This is a general purpose hammer for the average home owner. It is not the top tier Estwing hammer, but still very good. At some point the price dictates the level of workmanship and quality, and this hammer serves that purpose extremely well.",
        "This is a real tool; one to last. I needed a nice finishing hammer for some indoor projects, and I've always remembered the Estwing my dad had in the shop hanging up. I do not regret this purchase. The balance is perfect, the rubber handle keeps fatigue away, and the smooth face doesn't mar my work if I slip a bit! The workmanship is still there, and this hammer will probably outlast me.",
        "Excellent build quality! Not a single burr on the metal, handle is sturdy with just the right shape. Have been using it as a DIYer around the house and it’s held up great. I’d imagine for a professional you’d have the same luck I am.",
        "Only reason I bought a second Estwing was that my first (which I had for 30+ years) was lost in a construction project (either lifted, or built into a wall). If this one lasts me 30 years ... one of my sons will be inheriting it. (not sexist, I only have 2 boys).",
        "It's hard to get excited over a hammer, but this one does look like a lifetime tool. Good balance and it's the right weight for general use. A 20 oz may be better if you do nothing but framing, but for me this fits the bill perfectly for siding and window installs.",
        "What can you say? It's a hammer! Good for smashing of fingers, dropping on your toes, hurling across the garage for uder destruction. Can't Touch This..",
        "Got this after assembling one too many Ikea products using whatever heaviest object was sitting around. Pros: good weight, well constructed, good grip. Cons: none so far.",
        "...it would be an Estwing. I have 4 now, and have gifted several to people who didn't know any better; struggling with their flimsy Stanley tool.",
        "I have purchase several of these hammers as they seem to grow legs and disappear. They are the best hammer. An absolute must for every household. Everything about this hammer is quality.",
        "I am just simple DYI but this is a legacy tool that I will pass on to my son. Excellent balance and fit. Comfortable handle. Claw can be used for many demolition projects. Perfect balance. Made in USA",
        "Estwing hammers are my favorite. I carry a 16oz straight claw, a 22oz straight claw, a rubber mallet, a nail puller, and a handy bar in my tool kit to work with me every day. They stand up to the abuse of a lot of rough work and always do what they are supposed to.",
        "Great hammer. I've been using it for 9 months as an electrician apprentice. I don't use it everyday or super often, but when your linemans pliers aren't enough you need a hammer. I may eventually size up to a 20 Oz or 24 Oz hammer at some point. 16oz is a good all around size though. I've used this hammer to hammer nails and also for things it wasn't designed for.",
        "The Estwing hammer is a great hammer and in my opinion is probably the best hammer out there, that is why I gave it 5 stars in all categories. But be careful this size is great for hanging pictures and light household duties. Get the 22oz+ for anything else.",
        "I've used my blue and silver hammer for years. Well balanced and strong. Weird to say, but it is a work of art that you can use. Purchased this for my grandson's toolbox. And as an added bonus... it's still Made in USA.",
        "appears ready for finish work. / after mild use scars appearing on head surface, simple small nail work damages smooth surface,",
        "Nothing special, it’s a hammer, but it’s inexpensive and extremely durable. I’ve been using this series of Estwing hammers in various sizes/weight for over a decade in heavy construction and fine carpentry alike, and have been surprised with how well they can handle abuse. I’ve never seen one have any issues and most of the workers prefer using these hammers over anything else. Well made American product. I will continue to buy Estwing hammers exclusively.",
        "Bought this to replace one that was \"borrowed\", these things are bulletproof. If you need a hammer, you can't go wrong with an Estwing...and no I don't work for them or receive any discounts. I've been using them for over 20 years and never had a problem with one.",
        "Made in the U.S.A. the most important thing to remember. Bought one for my son and grandson. It is a great hammer, good balance to weight. Estwing makes good tools and they will last when the china ones have bit the dust. Still using the my grandfather's and it is over 50 years old, will pass it on to my grandson.",
        "Had to buy this for my wife so i could get her to stop using my 28oz Eastwimg hammer",
        "My third Estwing tool. Like the others, I may lose it but I can't imagine a way to break it. Outstanding utility at fair prices.",
        "Got 8 year old first set of tools as a gift. My oldest brother said to get an Estwing hammer like his because it's a sold piece of metal with a rubber coating on the handle and cant really break off. Made in USA-love it.",
        "Built for life. Ordered this to replace the exact same hammer I bought 25 years ago. Looked for the old hammer for 2 weeks and thought I had lost it, day after the new hammer arrived I found the old hammer. Now I have hammers that will last 2 lifetimes. Everything about this product is awesome. Quality all the way",
        "I am a carpenter, who does a lot of different things besides framing on the job, and I work a lot of side jobs. The 20 oz estwing is always on my hammer loop, and will always stay on my hammer loop. It is essential to me, and I am confident it will last me a very, very long time.",
        "I'm very happy with this hammer. Light but not too light. Easy to use in tight places. Exactly what I was hoping I was going to receive. I don't use claw hammers much - not much call in automotive work - but the quality looks very high. My dad has an Estwing from when I was a kid and it still looks new. This one looks to be of the same quality so I expect it'll way outlast me. :)",
        "Waist of money.Dose not cost even half of the price.",
        "I don't like it. I lost one same manufacture Estwing hammer It was the best hammer i haven't have but this one not the same. The handle is little to big for me.",
        "Sturdy, sits well in the hand, good balance, good control. Very pleased with this hammer.",
        "Estwing makes the best hammers, hands down. I have this one in my toolbox, ready to travel if I am helping out a friend or going to my parent's house to repair something. Definitely want a heavier, 20oz - plus, hammer if you are roofing, or hammering studs. Still, little guy gets things done.",
        "The handle on the hammer looks as though a rat or something chewed it.",
        "Great for indoor general purpose use(smooth face so you wont worry about missing the nail as much with a milled) Stay away if you will be framing, get at least a 22oz estwing. You will not regret it.",
        "I really like this hammer. It just feels right in your hand. I look for things to hammer now ;)",
        "Great hammer, American made. A recurring gift to family and friends. Donate your Chinese made to good will and get a USA made Estwing!!",
        "This is a good little hammer. Pounds tent stakes well, and takes them back out as well.",
        "I already had one, but needed another for my tool bag. Perfect!",
        "What can I say, this hammer hammers in a very hammer-like manner. 2 thumbs up. Ow, I just hit my thumb with said hammer. 1 thumb up.",
        "Not much to say, you're either an Estwing fan, or you're not. I happen to be a fan. This one has a smooth face, so it's less likely to mess up your finish work",
        "Seems rock solid. Broke several wooden handle hammers. This thing will outlast me.",
        "This thing looks like it’s going to last forever. Great quality, heavy duty, nice balance, swings true.",
        "Just not the craftsmanship of old. Was happy to buy american made. But you could tell that whoever does the freehand grinding around nose of hammer really didnt care. Estwing was once best. Apparently not anymore.",
        "I am a huge fan of Estwing hammers and this one is my new favorite. It is high quality and solid steel, love it! I recommend getting one for household projects.",
        "Perfect light weight daily companion for your adventures in wood building. Great for all small to medium tasks. Perfect condition and professional handling by Amazon.",
        "My husband just bought me this hammer and I love it! It is well balanced and feels good in the hand. Crazy that some girl would be excited about a hammer but this one does the trick. And it's MADE IN THE USA!",
        "I have many Estwing hammers and the only problem I have with them is they are the ones that get borrowed and not returned or just taken. Anyway I keep replacing them with another Estwing. I guess that should say something.",
        "Best hammer made, and well balanced, Amazon has a really good price on this too!",
        "I have been using Estwing hammers for over 40 years...if it doesn’t say Estwing I won’t use it",
        "Nice hammer so far. Just the right weight and length. I am a 75 year old woman but think anyone would like this. It feels very solid.",
        "Love this hammer. Percect size for my tool bag. It's basically the same size of a commom house hammer. I didn't know Estwing made anything smaller than a 16oz. This is perfect for my needs.",
        "One of the best(if not the best) hammers you can buy!",
        "Well balanced, single piece construction. Feels good in your hand. Estwing is known for high quality, and I recommend",
        "This 16 ounce model is a real pleasure to use. (Framing hammers are a bit too long and a bit heavy for what I do.) A truly great-feeling tool for around my house and garage. Best of all it's MADE in the USA! This would make and excellent gift!",
        "Bought for my son’s tool set, I own a heavier one, good quality. If you can work with your hands and U-Tube, you can survive any economy",
        "Estwing Hammers are great. If you know how to properly use a hammer and take care of it it will last a life time.",
        "Probably the best one to be had at that price - made in America, feels well balanced, strong, comfortable. Good ergonomics, handle is super pleasant in the hand - glad I went with this one!",
        "When I came to realize that my girlfriend could out-nail her son-in-law I decided she deserved a better hammer. She liked it so much she bought herself a matching Estwing flat bar. I've been using Estwing Hammers since 1970 and will never own another brand.",
        "What is there really to say about Estwing? The ONLY reason I bought this one was to replace the 16oz Estwing that was \"lost or stolen\" by a friend I loaned it out to. Best hammers on the market and I have renovated many homes, always with my handy Estwing.",
        "It's an Estwing Hammer that is all you have to say to and was a good price",
        "Great hammer. Lost my other one somewhere so ordered another one since they work so well.",
        "Exactly as described. The shipper did a great job bubble wrapping the product. 5 stars",
        "Bought this hammer to replace one I've been using for years that finally gave in the ghost when the head flew off. This hammer gets the job done, has a good feel, and will last a very long time. Also, I don't have to worry about the head coming off this one as it is all solid. Highly recommend this hammer.",
        "Great hammer for everyday jobs, I preferred the heavier 20oz over the standard 16oz since I am not using it too often and not too many nails at a time, so I wasn't afraid of fatigue too much,",
        "Good tool purchased for daughter and son in law Christmas present.",
        "Sadly it appears Estwing has gone the way of many corporations... Taking material out of components to save on costs. I had an older 12oz Estwing and wanted a new one, the new one is toy by comparison, the older version has much more metal overall in the head and body. Returned, :-(",
        "If I had a hammer.... I'ld hammer in the morning....",
        "This was purchased on a recommendation of a friend. I use it as a replacement for a Plumb that I had purchased in 1975.",
        "Got my first 20oz Estwing in 1997 and have bought 5 or 6 more since. I've lost a couple and bought a few for employees. It's an all around great tool and fantastically suited for siding work and related tasks.",
        "I purchased this as a gift for my hard to shop for husband. The hammer is made of excellent quality! I don't know exactly what happened, but apparently all of the Hammers in our household have disappeared. I am very happy with this purchase and I would happily recommend it to a friend or family member.",
        "I have owned several of these hammers. They are fantastic. They do not break. I do not lose them. They always end up getting stolen, lol. That is how good they are.",
        "I bought this hammer on October 2011, and it is still looks brand new. I'm not a contractor, so I just have used it, for the regular household repairs. For me, it is a solid hammer that will last forever, and even that I paid some extra bucks, I think that in the long run, I will have my money back for the quality and durability of this hammer. 05/02/2018 Update: This hammer will last forever 5 stars",
        "It’s smaller than I thought. If you need a regular sized hammer I don’t think you coul find a more quality hammer.",
        "very nice i like this hammer and i like the grip as well",
        "These are my favorite. I have several in different sizes. Packaging was better than expected.",
        "Extremely happy with my order of the hammers would highly recommend to anyone",
        "You cannot go wrong with Estwing. Great quality hammer at a great price.",
        "It's very good at doing hammer things. It's Especially good as a thumb detector."
    ]
}