{
    "entity": "Claw Hammers",
    "text": [
        "My boyfriend says it's the best hammer he's ever had in his 20 years as a carpenter. I say for 200 dollars it should swing it's self and spoon him at night. Could say more but I am a lady... AND the carpenter of 20 years who uses it everyday won't ever purchase anything else, also he claims superior quality , buy it once and have it for life.",
        "If you swing your hammer all day long do yourself a favor & spend the money on this... with every penny. No more elbow pain. Just make sure you don't leave it laying around on the jobsite.",
        "best hammer I have ever owned light but same swing I have use my whole career. wish I had this years ago might have saved my elbow. the side nail puller is awesome. takes the jerk off my elbow.",
        "Went from a standard 19oz Vaughn framer to this hammer. World of difference. The first time I used it I understood why they are so expensive. I use it non stop every day. Been using it for 2 months now and no complaints. All around top quality tool.",
        "Took me a long time to buy this hammer. After just one day of building forms and the next day stripping forms I would have to say its worth every penny",
        "This was a gift to my husband for Christmas. It was something he would never have purchased for himself but now prizes. He has told me a many ways that makes it superior to an ordinary hammer; the weight balance, the nail holder, shock reduction. He is remodeling our kitchen with more pep in his work!",
        "My friend loves her hammer. She uses it at Habitat for Humanity.",
        "Strong, effective, lightweight, and just easy to use all day long. Absolutely love it and so do the guys I work with",
        "Great hammer, light weight but swings like a heavier hammer. I wish the rubber handle was more durable.",
        "I hit a metal stick into a wooden stick a few times and a house popped out.",
        "Used almost daily after 2 years! Helps a lot with my torn rotor cuff swinging a hammer, wish I bought one years ago!!!",
        "My dad and I had one for 4 years now and it has been great, only thing is you need a little loc tight on the bolt that holds the head on or it comes loose",
        "They're stilettos so they're a bit pricey for a hammer. But it definitely helps with my tennis elbow",
        "My husband is a master carpenter. This helps saves his wrists for sure! He really likes it!",
        "A korner from one of the hooks broke off on me the second day i used it.. i was very dissappointed",
        "I like this Stilleto the grip on it fits just perfect in my hand. It’s perfect for driving nails and pulling stubborn stuck nails that hit a knot.",
        "Works well as a backup to my desalt nail gun",
        "in the short amount of time I’ve been in the trade, I can’t see my self buying any other hammer in the future. Best feature to me is the side nail puller. Highly recommend it. You get what you pay for!",
        "Spend the money. Will save you from so many issues down the road if you use a hammer a lot. I should have bought it years ago. Don't make that mistake.",
        "I have been swinging a hammer professionally for over 36 years, this hammer hits like a 22oz and saves my elbow!",
        "This is saving my elbow. Can DEFINITELY notice how much more power this has compared to a steel hammer...considering how light it feels swinging this beast!",
        "What's not to like? My mini has lasted over 10 years of scaffolding and still going. Wanted the bigger one also.",
        "The handle has let the tool down, it has split and cracked and now is dangerous to use, i eintend on sending it back to get replacement or money back",
        "What a change from any hammer I've used. Doesn't feel like you're swinging anything but drives nails with ease. The side nail puller is absolutely perfect and can pull out a 16 in one motion",
        "It's the best hammer in the world for a reason, you just can't out do it if you tried.",
        "I love this hammer. It's loaded and balanced properly and I can swing it all day long without any fatigue! It is extremely light and it's extremely hard. It is an expensive hammer however it is well worth the price.",
        "This was a present for my Master Carpenter son in law. He was thrilled.",
        "Just wonder is there the L key for swapping the Miller face? It should be come with the hammer.",
        "I have titanium hips so why not a titanium hammer? Wish I had bought this years ago! Light and powerful. Expensive but worth it. Not nearly as much as my hips were though!",
        "Best tool I've ever owned. Spend the money, your elbow will thank you.",
        "Best hammer I've ever owned. It's light and little to no vibration. I like the fact that you can replace the heads. This will be a long lasting tool and my choice from now on.",
        "I wasn't entirely sure if I'd like it after using a fiberglass handled and a wood handled stiletto for a couple years. After breaking a couple wood handles from prying with the claw, I decided I'd give the Ti-bone a try. I'm glad I did! It is comfortable to swing all day like my other hammers, and I can hang from it and not worry about it breaking. I still reach for my fiberglass handled hammer for finish, but for framing and demo this hammers swinging from my belt",
        "As a framing contactor my hammer is a tool that I not only need but Is essential to my day in and day out tasks. This makes hand banging rafters even more pleasant. I use to have a stiletto musclehead and that was great but I was always worried about snapping the head but this I have no worries. The side pull nailer really comes in handy also, me and my crew call it the can opener. Its light and has really nice anti vibration properties. sinks 10 penny nails in 2 shots consistently. as a word of caution check the head to make sure it hasn't loosened up on you.",
        "This was a gift for my son for his work and he absolutely loves it",
        "A great tool, worth it's weight in gold. I became adjusted to this hammer in a matter of swings, as opposed to a matter of days for a cheap wood handled hammer. Quality is amazing and nothing less than expected for such a hammer. Don't let it leave your hip on the jobsite!",
        "Much cheaper online than any store. I swing a hammer all day at work driving nails. This thing reduces the vibrations you normally get and after one day of use you will never go back. I know it's a ridiculous about for a hammer but it is well worth it. It has a long handle that can get annoying in your belt loop. Be warned if you get the milled face it will a \"pining\" noise when driving nails. Used it to; Drive nails Chip concrete Snap ties Pull 16p nails with ease Anything you use a normal hammer for. It's a tool don't be afraid to use it like many others are",
        "All around the best hammer ive bought besides Martinez. Can swing it all day and not feel wore out.",
        "great hammer well worth the money for somebody who needs a hammer every day",
        "This hammer shames all others. I use it from framing to finish and absolutly everywhere in between. I have zero issues with it. The only complaint I have ever heard from anyone about these is that they are \"long\". They are as long as any framer Ive ever swung. This is a very hard hitting hammer. The 12 gauge of hammers, if you will. And it weighs less than a tiny 16oz. Update: I stopped using this for finish work. I bought the 10oz fiberglass titanium head finish hammer! The Ti-bone is definitely my new industry standard. I wish I could buy one for every carpenter still swinging an estwing.",
        "Great hammer this is my 2nd one the first one lasted me 15 years worth the price",
        "The hammer has worked flawlessly for me so far. I have really enjoyed using it.",
        "Very light yet very durable. Better then any other hammer that I have ever used.",
        "I bought this hammer as a gift for my son, He really likes it. It will make his job a lot easer.",
        "\"Best hammer ever\" according to my carpenter Husband. Worth the expense.",
        "Best hammer you can buy. I've bought one for each of my employees.",
        "If your getting old and your shoulders are not what they used to be. or if you like power with little weight. This is the hammer for you. By far the best Hammer I ever used. I bought my first one 6 years ago. It was recently stolen so I had to buy another. Interchangable head is priceless. This will be the last Hammer you ever buy.",
        "Great hammer for a descent price. it was as expected.",
        "If you're a carpenter and swing a hammer all day you should already have one of these. Best money can buy",
        "Great hammer, it IS worth the price. Drastically reduces fatigue",
        "I got this for my daughter who is a carpenter. She loves it, but the head broke after about 3 weeks of use. Amazon was terrific with replacement - didn't even need to return broken parts and a new one is on the way. My daughter even called the manufacturer, who indicated a failure was highly unusual. So, assuming the replacement has no problems, sounds like a great hammer.",
        "Best hammer out there, I've been framing 12 years these hammers are great!",
        "Great hammer. I wouldent want to do construction without it.",
        "Excellent. Item bought for a retirement gift for a co-worker. He had borrowed mine and really liked it so decided to get him one. He was thrilled to receive it. Works great!",
        "Best tool ever, I am glad i purchased it. Love my stiletto.",
        "I bought this for my husband because of all the framing he does. He was getting a tendonitis (tennis elbow) from all the repetition. He loves it. Says it drives great and with a lot of power behind it considering how light it is. His boss is going to buy one now after using my husbands for half the day. The other subcontractors have also been very impressed with it. The price is a little crazy for a hammer, but if this is a career for you- it's a great investment in your joints.",
        "I bought this hammer for my husband Chris and he told me he didn't know how he ever worked without it! It is definitely worth the money, very high quality.",
        "I've been a framer for 4 years now and My Wife got me one for last Christmas and I must say this is a beast of a hammer well worth the money. She says she has no regrets buying the hammer for me since I've felt a difference in the the shoulder and elbow.",
        "I'm an electrician and nailing up boxes or staples in tight places is nice to have a light and nimble hammer.",
        "I like this hammer so much... I don't even put it down anyone that I talk to I encourage them to get one",
        "Crazy expensive but this hammer has made my life oh so much better. I've used other extra-heavy extra-large waffle makers before but now Stella here never leaves my side. Who would've thought driving scores of 20-pennies through triple-studs could be easy?",
        "Good hammer unbreakable .. Nices and light I use it everyday",
        "This hammer and its previous reviews just speak for itself. It was delivered promptly, and is as described. Really high-quality titanium, you should go to the YouTube videos to see how it is made, pretty impressive.",
        "100% recommend to anyone. 2 years later and it's still beating things. handle got a little lose so I headed it up in hot water and wiretied it as it cooled. Seems to have fixed it.",
        "I can't believe I paid this much for a hammer!! Best hammer I've ever had! Just buy one. Every single person is shocked at how light weight it is. Best thing is ...no more \"tennis elbow\" GONE. I hit harder with not joint pain. Watch all the construction how to shows on t.v. All of the pros are swinging THIS hammer. Even Mike Holmes!",
        "Just what my brother-in-law wanted! After his employee broke his beyond repair. He made about two hundred dollars after I got him a replacement for under four hundred in South Korea.",
        "thought this would be an upgrade from my wood handled titanium stiletto.........I like the wood handled one more, still a great tool, gut I recommend the wooden handled stilettos",
        "I can whack nails most all day and no rotator cuff pain! Love the ping ping ping sound - like music to my ear!",
        "Best hammer I've ever bought and I've had alot. A little expensive but worth it, especially if your dealing with carpal tunnel like I am. Feels great, no more broken wood handles to replace, and thee option to replace the heads when they wear down makes this an awesome hammer! Would recommend to any one who uses a hammer everyday all day! Thanks",
        "Best hammer in the world. Nuf said. This is the best out there. Just go and buy one. Set for life",
        "Boss hammer I strip foundation s its rough work best hammer I've ever owned I've tried just about every hammer out there this one is best by far too expensive but u get what u pay for",
        "This is a great hammer for everyday carpenters. Its light weight but hard hitting and very minimal vibrations but buyers need to be aware that this hammer is a \"long\" handled hammer. I use this hammers for my daily tasks making wooden concrete forms this hammer is perfect. My previous hammer was also a stiletto but it was a 14oz hammer and it has straight handle. I got it many years ago and it was time to get this 15oz hammer. Very very happy with this product.",
        "I'm very pleased with this hammer. Very different from other wooden handled titanium hammers I have used, fells much more solid and with the special head pulling nails is a breeze and you can replace the face if it wears. A little costly but its a hammer you can use for the rest of your life!",
        "Terrific hammer but bad grip design. There is a rubber lip that gets pulled on every time taking out of holster. Why didn't they make it like estwing so there is a metal lip at the hammer grip to stop this. Almost perfect but for this price it could of been better",
        "Bought this for my 21yr old son that's still in the union schooling. Sure hope he likes the career he picked cuz this stuff is expensive.",
        "Best hammer I have ever owned hands down should have gotten one sooner stop questioning the price and just buy it you wont regret it.",
        "my husband is a union carpenter and he swears by this hammer .",
        "I bought it for my husband for his birthday and he uses it everyday for work...and LOVE it!",
        "I'm a framer, so I was lucky that my boss had this exact hammer. He was always raving on about how good it was, so when I drove a few nails with it I liked the feel of it as well and decided 2 buy 1. Once I got my own and got used 2 it I love it even more. Curved handle has a lovely feel, perfect weight, drives any nail with ease, no repetitive strain injury, but the side pullers is the wow factor, it is brilliant!! It's a lot of money for a hammer, but if you're gonna be using it day in day out, you'll be very happy with the investment!",
        "i bought this hammer about two months ago and since ive been using it my hand hasent gone numb and my elbow dont hurt anymore. will definitely recommend it to friends and coworkers",
        "all i can say is AWESOME works just like they say drives hard as a larger hammer the side nail puller is a must if you work with 16d duplex",
        "love it and crazy hammer and need to respect it when u work :P hmmmmmmmm that s it and bye",
        "Purchased this hammer as a Christmas gift and couldn't be happier with the seamless ordering method, delivery, timing and the product. Well built, an abundance of features and very light weight.",
        "Great hammer but didn't come with Stiletto sticker or maintenance kit including hex wrenches locktite.",
        "I build pole barns for a living, pounding in twenties while doing roof perlins is a breeze with my new stiletto. Hammering in 16's is also a breeze when doing everyday framing.",
        "I would have give it 5 star but the head of the hammer move to much and that is very annoying",
        "I think the subject line explains my rating choice. It was an appreciated gift for a dad with sore wrists from working too long in construction. Cheers.",
        "Right on time best tool in the bags nothing beats this",
        "It's a little big for an old man like me but I love it I'm just going to hang it on the wall I'll see it every time I go to the shop",
        "Great hammer for an everyday worker! I've been using it for several months every day building my home and this hammer is much easier on the hands, wrists and forearms for all day use. I can't say enough good things about the side nail puller! The functionality of this hammer is off the charts. My framers have unsuccessfully tried to \"borrow\" this hammer several times.",
        "This hammer is really well made quality wize but I did not like using it as I felt it had too long and too heavy of a handle which threw the weight balance off. I ended up buying Stiletto's 14-ounce wood handled framing hammer and really like that one. And the price was more reasonable.",
        "Needs to be a little heavier for removing studs, pretty good hammer overall. Like the nail puller on the side.",
        "lasted a year and broke in half bulding trusses with it only! very disappointed! no replacement for the cost!",
        "I had the opportunity to use one of these while working on the north slope in Alaska. Ever since then I have wanted to purchase one for myself and finally have. It is a steep price for a hammer but swing it for a day all day and you will not regret it!",
        "Nice hammer. Seems to be pretty durable and a little lighter than my old heavy framer. Really like the nail puller on the side. Personally don’t think it’s worth $200 though."
    ]
}