{
    "entity": "Claw Hammers",
    "text": [
        "One of the best tools I have purchased. Used it on a construction site and my masons don't use their hammers anymore. Comfortable and the length is just right if you want to reach a nail from close to far range. Most hammers would not provide such grip and confidence when you are working espeically with the broader surface area, you will not miss a hit.",
        "Good household hammer. I do like the anti vibration feature. It does make a difference. The hammer is not the heaviest, but we did not need that for our purposes. It has a nice balance and heft. If you have smaller hands you may want to go a bit smaller. We have used Stanley hand tools for years and find they are a good choice. We are not professionals and I cannot comment or recommend for those folks.",
        "Got this to replace an olderI've had for at least 10 years. The estwing worked perfectly around the house throughout it's life but the finish rusted over time. Any surface I left it on would be marked with rust. This Stanley is painted so it should keep everything looking good. I'm not out there hammering together houses just working around my own house here and there and so far it's worked as a hammer should.",
        "Tried out so many hammers even including Titanium hammers like Stiletto. This one feels really good (although the stiletto titanium ones felt really good too). The balance, the grip, everything about this is good, and the absence of strain on your hand and arm is awesome. Love this one.",
        "I can swing this all day. Gotta drive a 10ft grounding rod? Rip out some unistrut off of a concrete wall? Or simply assemble some frame work? Ive had many hammers in the past 17 years in construction and this thing kicks butt",
        "I'm in my Social Security years and I'm building my senior tool set with tools I know I will use the rest of my life. The Stanley FatMax 16 oz. 51-163 hammer is ideal for what I will need. It is the right weight for driving the size nails most homeowners will be using. The smooth faced, large head makes it easier for me to strike the nail. The hammer feels balanced in the hand with cushioned grip and slightly curved hatchet type handle design. Some reviews I saw mentioned that it has a nail starter magnet and groove. This model does not have that.",
        "I wanted a one piece steel 16oz. hammer. I like the balance of the one piece steel rather than fiberglass, or wood handles. I really had wanted the Rip Claw version, but it cost almost twice as much as the Curve Claw model. So I got the Curve Claw. Not that much of a difference for me anyway. I like the over size head, and it should work just fine pounding in some roofing nails, etc.",
        "Ordered one of these as a spare for the job site. My family installs hardwood flooring and the guys are always misplacing their hammers. They each have their own tools. I found them fighting over this inexpensive hammer, because they all like it so well. They said it fits well in your hand and has a nice weight for general purpose use. The first one was such a hit I ordered another!",
        "I like the hammer, it feels well made. Although i really can't figure out where to put my name on it. So I had to resort to putting some duct tape around it. (It won't scratch into it with anything i had, maybe with a dremel or something similar). I don't feel like the AntiVibe really does all that much though. It's the reason i bought it, but it feels just like any other hammer. The notch at the end of the hammer takes some getting used to, but it does feel nice.",
        "I got this to replace a hammer I got about 30 years ago. WOW what a difference! This one's got an awesome grip and handle. It's weight and balance is easier to manage. I like the end of the hammer that keeps me from losing my grip on the thing. It won't go flying away. Great hammer!",
        "feels nice in the hand, its not as anti-vibe as its marketing seems to state. But fit's much less vibration than my several year old hammer thats all busted up in the tool box.",
        "OK. So I shopped around my hometown for a decent hammer and found nothing. Then I checked Amazon and this hammer was not the first one to pop up- although it should have. This hammer is extremely well-made and solid. The grip is excellent. Not like your father's hammer. This is also, I might add, a work of art. Beautifully designed.",
        "Great hammer! It's heavier than most, but that's a good thing since it adds more strength when hitting the nail. There's good grip at the bottom and it's very comfortable to hold. I've seen other hammers at Lowes and Home Depot and cheaper prices, but I really like the quality of this hammer. If the price doesn't bother you, I'd recommend this.",
        "Personally, I’d like to have a longer handle on this hammer. I should have paid more attention to the specifications before buying but it’s still a nice household hammer.",
        "It's a hammer. Not much to say, except, it's a GOOD hammer. My vision is not very good, and I find that I can't miss the nail with this one! The larger head does the job, even if I'm off with my swing. It's got nice weight, good balance, and just feels right. The magnetic nail holder is a very nice feature. No more banged fingers if you decide to use this feature. Good nail pulling power, and an excellent framing hammer. Overall, I like it. I am ordering these for my sons as presents.",
        "Great tool nice balance decent grip and low impact on your hands.. problem is the one I received honestly looks as though it's been used there's chips missing or perhaps places where a machine grabbed it during manufacture even the claw is missing a few chips",
        "Nice hammer for the price. Have been using it for 9 months 5 days a week, so far the only con is the yellow plastic ring around the pommel of the hammer has started to crack an fall apart. Also i use it as a hammer so i beat the **** out of things with it.",
        "Great hammer. Perfect size for general projects and very light. Bought 1 more very soon after and unless I find a better or cheaper one, this will be the only hammer I use and recommend from now on.",
        "If you need a good hammer for projects outside the house, the 16 oz version will do you well. I used it for a 75' fence build, and it worked great, was comfortable to use, and I'd buy again in an instant. I was worried the 'grippyness' of the handle would give blisters, but it's totally comfortable. It's probably a little large for most indoor use, but right at home for anything outside.",
        "I don't know what needs to be said regarding a really nice hammer -- it does a great job performing its intended purpose.",
        "Didn’t hold up too well on the job. Was bouncing off framing nails, had a hard time driving them in. By lunch I had blisters from using it due to the grip. Holds up good for home projects.",
        "I love this hammer! I love the weight and balance! Feels great in my hand. I am a larger man so someone smaller or women may not like the weight of it. I love it. I have a couple other hammers but they are 16 oz. and one is a wooden handle.",
        "I had an older version of this that I needed to replace. This new version is just as good.",
        "These are fairly good hammers for general/demo work. The handle is comfortable and the they're balanced pretty well. The nail pullers are machined unevenly between the two sides (and most every example i've seen in person is about the same) but for the price its hard to argue. I had the 16oz version and currently have the 20oz version I use for stuff I don't want to break out my stiletto for.",
        "Sometimes I miss the \"feedback\" from a regular hammer. This one is good and probably safe to use.",
        "Husband likes this as the vibrations from his normal Hammer hurt his wrist. Less pain now",
        "Incredibly hammer. I have used this nonstop since I purchased. The magnetic feature to hold nails for framing is incredible. Fits well in the hand, has great anti-shock and is rock solid in construction.",
        "I really despise this hammer for almost every reason I can think of... finally Just gave it away",
        "If you don't already have a hammer, or just want something better, consider the Stanley Fat Max series. This one is a nice light 16 oz. version that anyone could use. It's got good balance, a nice grip, and the anti-vibe feature is really neat. No sore wrists after swinging it for awhile. The larger head makes it really easy to NOT MISS the nail head. The magnetic nail holder helps eliminate those banged-up sore fingers and thumbs. Highly recommended tool. It does what you expect it to do.",
        "Great mid-size hammer. Has good balance and does exactly what its intended for. I use it for all odd jobs around the house and have had quite a few compliments about the hammer as well. I couldn’t be happier with my purchase.",
        "Light but effective for basic construction purposes. Swings like a heavier weight.",
        "If you need a hammer that can take care of business, look no further. I saw this hammer at my local big box retailer for nearly 2x the price. This hammer is incredibly well made and very well balanced. It strikes with a ton of force. If you are a tradesman or diy'er about to embark on a hammering heavy project....spend the few extra bucks and buy this hammer. You will not be disappointed.",
        "This is a sturdy hammer and yet easy to handle.",
        "Nice hammer, it is light and a different feel due to the handle angle. But it is made good, I just have to get use to it.",
        "Awesome, feels great in the hand . Great design I can hammer all day and hand feels fine.",
        "This hammer feels nice in the hand.. I would recommend this for sure",
        "Not all hammers are created equally, it turns out. This sucker feels great in your hand, has a magnet at the top of the head that allows you to place nails hands-free, and even has a little lip at the bottom that helps you hang on to the thing when swinging it. I've used a lot of different hammers, and this one really does make a difference. The 20 oz variety is my favorite, but note that it might be too heavy for you. Lighter versions are available.",
        "Works well, no noticeable shock, great price. It even looks good. Replaced my $80 woody with it.",
        "When you hit a nail, it gets smaller and smaller with each and every strike! seriously, it's a hammer...but it's comfortable and does what it should.",
        "It’s a hammer, not a whole lot you can review on. The handle is very comfortable even after extensive use",
        "I love this hammer. It's really all you need around the house. And the straight claw makes short work of nails, and weeds, if you're so inclined. Doesn't hurt that it looks mean. The only hammer you really need for most things around the house.",
        "Very Pleased. Well balanced in my hand. Good gripping surface, even through perspiration. Best price for the hammer on Amazon.",
        "Works great, very durable and bangs nails in with ease. There is no ringing sound when hammering nails in, unlike other hammers I have seen and used. Handle is comfortable and hasn't slipped from my grip yet. I recommend this hammer to anyone involved in carpentry work, for it wont let you down.",
        "I don't think I have ever seen my husband so happy to hold a hammer! So five stars he can't wait to go to work and use it on company jobs.",
        "Does the job! I liked the way it matched my matte black tools. I would recommend this product.",
        "Well Made, Proper Weight, Ease of Tight Grip Handle, Stellar Design. This Hammer Aced It Completely.",
        "It’s a nice and useful hammer, perfect and ready for everything I need to do.",
        "Solid full tang hammer. Comfortable grip with effective shock reduction. Well balanced for most jobs and it looks bad ass which is a plus...",
        "It worked good but I can't find it now xD My brother probably stole it.",
        "I'm a trim carpenter 16 oz. Is plenty for detail work",
        "The head is tilted to the left right out of the box.",
        "I disagree 100% with the person who complained about the shape of the handle. out of all the hammers I've used (a lot) this hammer has the absolute most comfortable handle. it's like it was molded to my hand, and the more I used it the softer and more comfortable it gets. I've framed 8 hrs a day everyday for the past week with this hammer and drove hundreds of nails and I'm so in love with it.",
        "I definitely felt a reduction on vibration and it is very comfortable.",
        "I love the grip, weight, feel and length of this hammer. I'm using it as I frame houses currently, only complaint. It has a flat smooth hammer face, Id prefer it to have the waffle hammer face which is more forgiving on hammer hits that are off center and grip the nail better.",
        "Confirmed...this is a hammer and it does hammer things. Grip feels nice and does the job for hitting nails. Great success! Five stars to House StanleyFatmax.",
        "Works good for hitting things - especially nails (galvanized or finger)",
        "Heavier than I thought, but maybe that's a good thing.",
        "Solid hammer. I don't know that this would be great for a full time professional carpenter, but for a guy who needs to hang a picture frames few times a year it's more than sufficient. I like the feel of it. It seems very balanced & the price was right for me.",
        "Bought as a gift and he said it was too small of a hammer",
        "Good price, good swing. The only downside is the antivibe logo etched on the side is very sharp. When I pull the hammer from my belt loop it cut my fingers.",
        "I am a carpenter by trade, this is a well balanced tool",
        "From the perspective of feel this is a great hammer for its weight.",
        "I haven't used it much but, it seem to be a good hammer.",
        "DUE TO AGE AND A WORK TORN BODY, I'M ALWAYS LOOKING FOR TOLLS THAT HELP ME KEEP WORKING WITHOUT INFLICTING MORE DAMAGE, WHETHER THEY BE POWER ACTUATED, BATTERY TOOLS OR WHATEVER. THE FAT-MAX HAMMERS WITH THEIR ANTI-VIBE SYSTEM SEEM TO REDUCE THE WEAR AND TEAR ON MY ELBOW AND SHOULDER WHEN I HAVE TO HAND NAIL THINGS. I AM IN THE PLASTERING BUSINESS, AND DO MORE REPAIRS THAN NEW WORK THESE DAYS, SO I ENCOUNTER A LOT OF ODD SITUATIONS THAT ARE BODILY STRESSFUL IN FIXING. I HAVE SEVERAL OF THESE HAMMERS AND HAVE BEEN TENDING TO LIGHTER ONES LATELY, BUT THEY ALL HELP ELIMINATE STRESS ON MY JOINTS AND AGING (67) MUSCLES.",
        "I ordered this hammer for the \"Magnetic nail starter\" which is in the description, but not on this hammer... Still a nice hammer, I'll use it... but it doesn't have the magnetic nail starter like it says in the product description.",
        "Growing up if I wanted it I had to build it. Long story short, best hammer I have owned. (I've owned a lot)",
        "I didn't feel a thing with the AntiVibration technology! Totally game changing! Also great for poking the dead raccoon I found under my porch.",
        "My new favorite hammer. Lighter than others I have but feels great in your hand.",
        "Bought for husband, seems to provide ease on wrists and hands for long weekend projects.",
        "Looks good and works good. did not feel the AntiVibe working because I never need to slam it really hard yet.",
        "Very nice tool comfortable to hold and a good weight. I wanted a decent hammer that wasn't stupidly expensive and this fits the bill.",
        "I have this and the Stanley farmer. Such solid tools.",
        "Nice well crafted tool with great weight and balance. A+ overall",
        "Pros: The grip feels great in my hand Anti-vibe is noticeable in that my wrist doesn't hurt after using the hammer Good quality Cons: There are none that I have found yet",
        "GREAT LOOK, GREAT FEEL. ESPECIALLY THE BUTT OF THE HAMMER- FEEL LIKE YOU HAVE MUCH MORE CONTROL OVERA THE TOOL",
        "It's a nice solid hammer. The little magnet nail holder thingie is less than useful, but for actually smashing nails into things, it works quite well. I'd imagine you can use it to smash any number of other things, too!",
        "Excellent hammer with nice balance. Feels very sturdy in my hand when working",
        "Hit things with it. Pull nails with it. Brush your teeth with it. It makes me want to get a job that requires hammering.",
        "Seems and feels like a regular hammer, nothing special. It hits things when you swing it, this includes nails.",
        "It's a hammer, I smack stuff with it, what's not to love?",
        "The hammer other hammers worship. A benevolent deity; well balanced and easy on the wrist.",
        "Good feeling of balance in hand. Attractive curvy design. Comfortable grip. Delivers a good pounding.",
        "These hammers are the greatest. Really made for a day of hammering without tiring out the persons arm. The AntiVibe is worth it.",
        "well made replacement for the old one that I managed to destroy!",
        "good quality hammer. i would buy again to have an extra.",
        "Solid well made hammer. Don't use it often in my work but I am sure I can depend on it when I do need it.",
        "Good hammer so far. I don't use it on a regular bases so couldn't tell you how it would would standup to everyday use but seems like a good hammer.",
        "This is a badass hammer. Thats all I have to say",
        "Came to me as pictured and has a comfortable feel. Haven't had a chance to put it to good use to comment on the antivibe.",
        "Great hammer ! Well Balanced, great grip ! Like the larger head. Hard to find elsewhere .",
        "Great balance Extremely pleased,I own at least 7 hammers and this is by far one of the best",
        "Good quality hammer. No complaints. Great grip on the handle.",
        "I've moved further away from mechanical work to doing more carpentry work. So looking for different types of tools than I'm used to but not settling for cheap. Have been looking at and trying different hammers and I'm sold on the Stanley FatMax Xtreme AntiVibe Rip Claw Nailing Hammers. A good, balanced feel, comfortable grip and, being an uncoordinated left-handed klutz, I seem to get away with more off-center strikes compared to other hammers and I'll take any breaks I can get. The price at Amazon couldn't be beat anywhere, received quickly and without any problems. I would definitely recommend the hammer and Amazon to family and friends.",
        "came just as expected and described, thank you for a great product and great shipping time. I bought this as a gift for someone they loved it!",
        "I was looking for a general purpose 16oz that was good for a lot of uses, this seemed perfect, i love the larger than normal head, the nail set work great, the handle has a good feel. feels fairly balanced. The antivibe feature does work as intended, awesome around metal and any slips. Only downside i can see is that the thin forged handle is not something i would use for heavy side pulling, then again thats why i have a stanley wonder bar for. overall im satisfied with this hammer and may be looking into the larger framing versions. but if you need a good 16oz for most uses consider this one.",
        "the hammer looks like a 16 oz but the antivibration works and it looks very nice",
        "very very good ! for all you know only got this kind of hammer thanks",
        "Hammer is nice, it is not the same as the picture but rather one with bigger head. I didn't mind that. I had another one (bigger), so was looking for a smaller size one. This one does the trick. No issues yet.",
        "Decent hammer for the price. seems like it should hold up for a good amount of time, so not much to say.",
        "Good weight, durable, comfortable handle. Can’t ask for much more"
    ]
}