{
    "entity": "Electric Burr Grinders",
    "text": [
        "I bought this just over two years ago (there goes the warranty) for use as a spice grinder. It was used very sporadically, maybe a total of 20 times to grind several tablespoons of things like cumin seed. Long story short, it burned out. I'm talking, heat, burned electronics smell, smoke. I imagine it would have failed sooner, but I didn't use it enough. Terrible quality.",
        "This is an inferior version of a Krups grinder even though it says \"KRUPS\". This grinder did NOT grind the coffee grounds evenly and left big chunks of the beans (of all places) on the bottom of the grinder, even though I was only grinding for 2 cups of coffee and I did not overfill the grinder in any way. Also, the cord was extremely short and much shorter than my current Krups grinder. I have been using Krups grinders for more than 15 years and was hugely disappointed - I feel ripped off and have arranged to return the grinder. Will not buy this product online again.",
        "Update: I absolutely hate this grinder. It's messy and a pain to use. This isn't exactly what I thought it was going to be. I watched many videos on coffee grinders and this was my 2nd choice I ordered this instead of my 1st choice by mistake. Anyways, it's a bit messy and I don't like having to lift the whole thing up to dump out. It works and you just hold the button down till your beans are ground up. You have to play around with it to know how many seconds to hold down. It's small and compact and looks nice on the coffee cart.",
        "The grinder is nice and a good idea however it has a major problem with the design. The blade is threaded onto the drive shaft with plastic threads, so if it binds a couple times it just strips the threads and no longer grinds.",
        "He works so hard for such a little guy. I use my Krups grinder for grinding spices and coffee (I go through with a chopstick to loosen up the stragglers hanging on to the edge of the walls and also grind a piece of bread that cleans up the smells and excess grindings handing about.) That being said I find it great for people like me who just do single cups of coffee in a Kurig. It does blend a bit on the fine side, so sometimes you need to like the custom cups with a little paper to prevent sludge from happening. It's a great blender for the price and it's size, definitely!",
        "Generally a good grinder. However, the lid design allows liquids to get between the inner and outer lid, which seems potentially unhygienic. The picture shows the lid 4 days after its initial washing; note the condensation that formed between the layers of the lid. That's just water -- would hate to get food up in there. Strange design ...",
        "This is a perfect little grinder. I use it to grind seeds (flax and chia) which it does quickly and well. The one asterisk is that if someone else is sleeping within audible range, the grinding does make a sharp noise. Maybe they should make a deluxe model with a muffler :). I had one of these for something like 20 years, and it still worked fine (only discarded it because it'd been so long since I'd used it that it was too tedious to clean). I have no reason to believe this one won't last as long.",
        "This seemed to be running fine for grinding whole spices, but in two months the blade portion broke off. We did not use it that often. Would not recommend. Update: I noticed another reviewer noticed the same thing I did after looking at the blade assembly. The reviewer wrote \"...it has a major problem with the design. The blade is threaded onto the drive shaft with plastic threads, so if it binds a couple times it just strips the threads and no longer grinds.\" This is exactly what happened with mine.",
        "I have bought two of these from Amazon. I am not blaming Amazon for the quality but the first one last less than one year and the second one lasted about three months. I grind both coffee and flax seeds so maybe the seeds are eventually too much for it and it would last longer if only grinding coffee. In fairness to the company I must say that I have not tried to get warranty service on either one because I am located in the Philippines and shipping stuff around is just not worth it for me rather than buying another one or a different product.",
        "While quiet, this grinder leaves much to be desired, and much in the way of coffee beans left unground. Disappointed, as I really thought this electric grinder would be far superior to that of a manual one. Not worth the money.",
        "Silent is a bit of an overstatement but it is very quiet. Be sure to rotate the cannister insert until it clicks in to the top of the machine, otherwise it doesn’t stay on when you push the button to grind. Works very well to get a fine grind in just a few seconds. A little difficult to scoop out with the blade in the bottom but if dumping into a container or straight into the coffee filter it isn’t a problem. Handy cap comes with it so you can grind up extra and store the insert part in the freezer.",
        "DO NOT BUY THIS PRODUCT. Krups is usually pretty reliable, but this order was processed and sold by Amazon. I used this no more than five times and the blade stopped turning completely. There is no way to open it up to fix it without potentially breaking the casing. I tried to return the item so that I would not need to leave a negative review, but Amazon won't allow returns after a certain amount of time.",
        "Would not buy this coffee grinder again. It is not quiet as stated. I purchased this specific brand because it said the grinding blade and nut retaining mechanism was metal. My last grinder left plastic pieces in the coffee as the grinding blade and nut assembly was breaking down. Once done grinding the stainless bowl will get stuck and hard to remove from the base ( happens if tiny amount of grinds get into the plastic base housing). When you wash the top cap, water gets stuck between the plastic and you can not dry it.",
        "I have had this coffee grinder for over a month now. At first I loved it; it worked efficiently. The noise wasn’t quiet but it was lower than most grinders I’ve used, so it was acceptable. However, after just over a month of consistent use, the grinder has started getting extremely hot & smelling of smoke/burning while it grinds. This was very unsettling to me, and for my own safety I disposed of it. Not sure if I got a faulty grinder on accident or if they’re all this way. I’d suggest if you’re trying to purchase a grinder, I’d spend your money on one thats more dependable & doesn’t start making burning smell.",
        "I used to grind my beans at Costco until they removed machines during the pandemic. The thought of loud grinding early in the morning was not exciting. I can't even believe how quiet this grinder is and how well it works!",
        "Very disappointed with this product. I want to grind coffee so I can have it fresh, not store it in the grinder pot because it won’t grind less than three cups worth at a time. This thing is as large as a half gallon milk jug. The cord is very difficult to wrap up and then the plug has nowhere to go. You have to constantly unplug it, open it, shake it, stir it, whack it and while you do grounds are going everywhere. Last of all; IT’S NOT EVEN A GRINDER! IT’S A FREAKING CHOPPER! What a train wreck. Wasted my money on this one. I’ll have my YouTube friends do a product review on this rip off.",
        "I'm a newer pour-over coffee drinker, so I suppose take this with a grain of salt since this would be my first time grinding my own beans. I got this over a more expensive burr grinder thinking it'd be a decent introduction and because the reviews were pretty positive. I tried the same tricks that some various YouTubers and articles have mentioned to get a consistent grind, but it just doesn't work. No matter what, I get lots and lots of powder and quite a bit of large chunks of bean. Definitely wouldn't recommend this even for someone just getting into making their own coffee.",
        "This replaced an older model Krups coffee grinder that I had used for almost 18 years. This one is slightly larger, but definitely quieter. I also like the removable metal cup. (I had to decant the grounds into the plastic top of the older model to then be able to get the grounds to the coffeemaker.) The one drawback is that some of the coffee grounds end up around and underneath the metal cup. It isn’t much, and it hasn’t caused a problem, but neither have I settled upon the best manner of cleaning this part.",
        "Grinds coffee beans pretty well. A little loud, I cant grind beans too early in the morning without waking up the wife. For our drip coffee maker, it grinds the beans just right. To get a fine enough grind our espresso machine, it had to be run so long that it had a tendency to leave a layer on the bottom of the grinder that was too fine, really just a powder. I use it anyway, but I'm afraid its a fine enough powder that it may clog the espresso machine. In other words, the grind isn't perfectly consistent, but for the price this grinder does a good job.",
        "Seemed great at first, but one day went to use it, and without even any spice inside, apparently the motor seized up immediately upon pressing the button. The shaft wouldn't turn, and it made a foreboding hum sound. Returned for refund. Expected better than this from Krups, we're rather disappointed.",
        "Bought this as a gift for my partner who loves fresh ground coffee. It's a pretty quiet grinder, and gets the job done quickly so there's no need to leave it on for an extended period of time. It does not have an automated grind setting, so you have to keep an eye on your grounds if you want it particularly fine or coarse. The other downside is that it is pretty small and can only grind about a 32oz french press worth of coffee at a time. For heavier drinkers, or for people who want a \"set it and forget it grinder,\" I suggest looking elsewhere. But for us, it's great!",
        "This is a quality grinder. The construction is strong. The design is smart and user friendly. It is actually quieter than most grinders and truly doesn’t wake others. The grind is consistent and easy to adjust by adding or subtracting a few seconds. The removable cup is great for pouring grounds into your filter/machine. There is a lid included that allows you to seal in beans or grounds if you want to have it fresh for the next use. It is a bit messy and needs to be wiped out or grounds collect. Not hard to clean.",
        "The product arrived broken. The blade is terribly loose like it is missing a part. I have tried to disassemble the part and put back together but it still is loose. After looking it over I can tell it is actually missing a part (spacer?). I will reach out to the company to address this issue. If it is rectified I will update this review, if not then be warned.",
        "I have owned this exact same model of Krups coffee grinder for maybe the last 30 years or more. This is the third one i have owned. I use it to grind occasional coffee and spices. I don't do much of either. Back a few months ago when my almost-20-year-old Krups Grinder developed a shorted wire, I bought a new one. It failed after just minimal use but after the end of the warranty period. Very disappointing. Yes it is not that expensive to buy a new one. But, it is a coffee and spice grinder and it failed in six months grinding coffee and spices maybe once a week or less.",
        "Pleasant appearance, feels good in the hand, but didn't work for me. It lasted about 5 months and I only used it for coffee beans 3 times before it stopped working. Its gotta be the Chinese factory, I,ve had other Krups devices that worked as advertised. There is too small a grind compartment, there is no storage compartment, you must visually determine how fine or course to grind, which is ok. I got ripped off with this product.",
        "This thing was available decades ago, and it's still great as a coffee grinder. While it can't grind a lot at once, it's still an excellent and inexpensive device to grind whole beans, from coarse to powder. Fill with beans of your choice, put on cover, press button. That's it. Grind to coarse, fine, or powder; your choice. It doesn't get any simpler at this level. It's noisy, but covering it with a kitchen towel significantly reduces the noise. Fold the towel over double, and then quarter it, press button.",
        "Pros: Powerful. High-capacity (more than 12 coffee measures). Fast. Cons: Very noisy. Short power cord. Ground coffee cakes up in the bottom of the grinder. Does not come in white (anymore). I used one of these (in white) for many years -- decades, actually -- before the little button in the top broke off. The new one seems to have been manufactured to a somewhat lower standard. The blade no longer has such a strong vortex, which was useful in cleaning the ground coffee out of the little basin under the blades. It is also noisier, perhaps a function of a more powerful, faster-spinning blade. I gave the old one five stars. The new one only gets four.",
        "I used this grinder several times a week for 4 years. The motor is still going strong. The black outer casing cracked at the back before year 2 and it still functioned up until now. The lid has finally cracked and it’s become too hard to open and close it. For the price, I feel it’s done a great job. I’ve used it mainly for spices and occasionally coffee. I won’t be buying another one this time because I think it was a waste of resources that it only lasted 4 years. I’m going to upgrade and pay a little more for one that (I hope) will last a couple decades.",
        "Have owned for about a year. Gets the job done, but at what cost? It’s so loud!! high pitch noise when in use, making it more piercing than others (using the bodom grinder as comparison). Also, the ground coffee tends to stick to the bottom of the grinder requiring scraping out the bottom after a grind (I use my finger,hoping the blade doesn’t somehow start up!!! 😬) Otherwise, grinds the coffee just fine. Build quality is fine - plastic feels a little “hard” so when I tap it to loosen the grounds it again has a very sharp sound; no damage to the grinder from doing that daily tho.",
        "I bought this a little over a year ago, I've literally used it 4 times. I bought it to grind up dried fruits and beef jerky to make pemmican, and the first couple batches it worked awesome. Ground up the ingredients real fine in a matter of seconds. I pulled it out of storage (after making sure it was put away clean), went to run some jerky through it, and it died a horrible, mechanical death. Smoke came out of it and while the motor still turns the blades, even the lightest piece of anything makes it stop spinning.",
        "We bought this as a back-up grinder for an older Krups we thought was going to break. That one is still going strong (albeit making weird noises) while this newer one lasted no more than about 100 grinds of spices mostly until the blades detached from the axle. Complete waste of money and an insult to the environment. Built-in obsolescence taken much too far.",
        "I used it for the second time and the motor smells like it is burning .. Amazon customer representative said that He will refund it to my credit card and I would get an Email confirmation in two minutes. In six hours I still waiting for an Email or Amazon notification...... It is like nothing happened... But instead of confirmation In two minutes I got Email asking to help Amazon answering Yes or No to guestion if my problem was solved...... I would really like to know it!!! Bad product and bad customer service.",
        "Does a great job grinding coffee, and is one of the most affordable coffee grinders out there. However the design of it makes it a little difficult to clean the blades. I suspect this may be the case with most coffee grinders on the marker. Best to clean with a dry cloth after grinding coffee, do not use water as there is a chance it could affect the motor and the functionality of the device!",
        "Ive gotten Krups over the years, and still a great brand. The removable grind cup is super nice, easy to wash, so ya can use it for other things besides coffee beans. I like simple, I didnt need a fancy grinder, if your using this for a coarser coffee been, go with less than 5secs, not the recommended 10secs, its just a high quality grinder, that was made in China. would be nice if other companies noticed, you can get high quality things made in China, not just cheap crap because you want a fat wallet! Build higher quality products, they will sell them selves.....",
        "Definitely lives up to the low noise level hype. I've had 4 grinders in my lifetime and this one is quick to grind to fine,very low level noise, and consistent in results. My favorite is that it's easy to understand clean. Definitely would buy again 100%",
        "It grinds very nicely, but it isn't perfectly even in doing so. I use it for coffee beans and this grinder rocks. I've seen this or a similar thing while watching the Great British Baking Show and I was mildly amused, that's an understatement. Oils are easy to clean: just wipe the metal area inside with a paper towel and it's clean. For thorough cleaning I hand wash the cap or put it in the dishwasher if I need to use the machine, and I carefully wash the top by pouring water and hand wash it using sponge and diswashing liquid. It's easy not to hit water in the sensitive bottom part. Very good grinder.",
        "What a great coffee grinder! I had my first on for eight years until I stupidly tried to grind candied ginger in it (don't know what I was thinking). Just bought another one that I use with my French press. This grinder always works great, is small, and at around $12, very cheap. I grind for less time since I use a press-grind more for a regular coffee maker. When I clean out the leftover coffee near the blade, I always unplug it since that blade could probably take off a finger ha ha I also grind up cinammon sticks (I break them into smaller pieces first) so I can add the powder to my coffee. Highly recommend!",
        "It's a coffee grinder that grinds coffee, so I have no complaints. It is super easy to clean, I just take a paper towel and wipe it out once a week. It's loud, but I personally have never had a quiet coffee grinder so that does not bother me. It is super easy to use, you literally just put the beans in and grind until you get to the desired grind ( I like mine super fine for hot coffee, my boyfriend does a coarse grind for his cold brew, it does great for both).",
        "This makes a great spice and dried mushroom grinder. In just seconds it turns dried mushrooms and spices into powder, use less time for coarser grinds. The mushroom powder is wonderful for enriching soups and sauces by the way. As far as cleanup, just wipe it out with an ever so slightly dampened paper towel, not wet. Then tear the paper towel into a few 1/2 inch pieces and pulse the grinder a few times until it runs smooth then run at full speed for a few seconds. Dust out the shredded paper towel with a brush and you are done.",
        "I actually got this to grind some curcumin-based pills so that they could be put in my mom's smoothie for anti-inflammatory purposes - or mixed into peanut butter for the dogs. I had tried a kitchen aid grinder previously, which may have been ok for coffee, but not for the pills. It would make this big cloud of dust and as much would be lost as collected. By contrast, this one seems to work for whatever I throw at it - be it spices, coffee, or tablets.. It is also easier to clean than the other one I had tried. Both thumbs up.",
        "Our old grinder was waking the kids in the morning, so we found this with the vortex blades - super nice. No more having to shake the grinder to make the beans grind evenly! Just hold the button down for NO MORE than 25 seconds and you're done. We've already tossed the stainless steel part in the dishwasher - no problem.",
        "This is a simple and effective design, and I've been using one for over 25 years now. It's sturdy, it works, and I've gifted it to people who prefer to grind their own fresh coffee, or even to those who like to grind herbs and spices for freshest taste. You can \"hear\" when the desired grind is reached after a while. If you want more bells and whistles, for example, to be able to set a grinder to \"coarse\" or \"fine\" then this may not be for you, or may take a bit of practice. I've had other grinders (which end up unused.) Remember the lid can be used as a cup to hold the grounds as well.",
        "I bought this to grind up ferret kibble into powder. I've only had it about a week but it couldn't be easier to use and it works great. It's not the easiest item to clean - the powder does lodge in the corners/seams/nooks, but I would think that's normal for a coffee or spice grinder. It does come with a fairly short cord for safety reasons, and I don't believe it's has a specific place for the cord to be wrapped (some grinders have an open groove at bottom where the cord can be wound). If it holds up, I'll consider it to be a great purchase.",
        "This worked great, for a little while. I did use it frequently, but mostly for grinding freeze dried liver for a dog food supplement. Freeze dried liver is no where near as hard as a coffee bean! In fact it is easily broken by hand. So after 3 months of use it just stopped grinding. The blades spin if the grinder is empty. I tried contacting Krups. No one answered the phone. The website was very frustrating. Basically I can take it to a repair center 50 miles away IF they are open. So Im ordering a different brand",
        "OK, so it's pretty quiet for a coffee grinder. But if you're grinding at anywhere near capacity (we make 12 cups each morning), the beans on the bottom will turn to dust while leaving nearly whole beans toward the top. And the ground beans will pile up all around the top edge, so that as soon as you take the lid off to empty the beans, the grounds go everywhere—counter, between the grinding cup and motor, etc. Cleaning up after each grinding session takes 5x as long as the grinding. Too much hassle.",
        "The only comments I have and the reason I didn't give 5 stars is my previous grinder lid fit on the outside of the chamber where the coffee beans are and this lid fits along the inside along with the beans. That with the slight tilt in the design of the body of the grinder seems to be a little messy in that unless you are really careful spills of the ground up coffee can happen especially at 4:30 AM. Overall its good as works well to grind the coffee fast and to a fine grind.",
        "This is the second Krups grinder I've had. The first one lasted 40 years and was used every day for grinding coffee. The new one is just like the original, it works in a flash and is easy to use and to clean up. I've had several other grinders and they do not compare to this nifty Krups one. Best grinder and best price.",
        "I had received an used one with dodge grinds in the grinder. I had called Amazon and was told to return it. I had sent it back. I don't like to leave negative review in general especially this is more Amazon but not related to item itself. But, I want to warn buyer that Amazon does send out used item but stated new.",
        "Had a Krups grinder for at least 25 years so when it quit working we ordered this Krups F203 in February, arrived in March and today (April 17) it seized up. We are an elderly retired couple who have used this new Krups grinder for its intended purpose, primarily grinding small quantities of spices, once or twice a week (since March) and cleaning it with a dry cloth (never water). In looking at other customer reviews, which I wish I had done before buying it, I see an awful lot of recent 1 star ratings and agree with the comments (no stars was not available). I want to exchange it for another brand.",
        "Does not give a consistent grind - half is powder and the other half are large flakes. This model says it can also do nuts, well if you want nut dust maybe. Again, the bottom was powder and the top were big pieces. Also the design is incredibly messy, the grinds stick to the top of the lid and fly everywhere when you open it. Regretful purchase.",
        "I've owned one of the KRUPs grinders for over five years. My original is still grinding away at home. I've enjoyed the use of this grinder so much that when I needed a 2nd one for my Airstream, I opted to double down on a trustworthy grinder of my beans that's been responsible for my caffeination for so many years. Durable. Grinds. With the clear lid, I use the eye test for my coarseness of grounds - if you're looking for something to tell you the type of grind, this won't cut it for you. If you want a grinder that gets the job done, I recommend this one at a great price!",
        "Yeah, it will grind coffee. But the grind is so terribly inconsistent. Not satisfied at all, returning for a refund and getting a manual burr grinder. I tried several grinding techniques but still there is no consistency.",
        "i purchased this grinder because i could not find the cup to my back-up grinder and my main grinder had stopped working... my main grinder i got off og amazon some yers ago, i went to repurchse the same grinder however it was 23$ and i had paid like 14$ and this grinder was 14$.... so i got it, it does not have a removable cut wish makes it a little harder to clean.... it gets the job done so its okay, i purchased based on price and i cant complain.... cheers",
        "Bought this in Dec 2018 to replace a Bosch grinder I had for 25 years. This one didn't make it to one year. The switch kept getting stuck in the down the position, which would cause it to turn on without the cap being in place. I always had to verify it wasn't stuck down before I plugged it in otherwise my digits could have been ground. This morning, the switch finally gave up the ghost and it no longer engages...THANK GOD. Buying different brand and hope it works better. Good riddens to this junk! I am glad I still have my fingers to type this review.",
        "Nice product to replace my Mr coffee grinder from the 80s lol This product works excellent & the interior chamber is very nice, stays clean. Same with lid. The only thing I don't like is the semi uneven design where the lid meets the grinder base, I would have preferred an even design When you turn it over to take the lid off with ground coffee it slides more of the grounds to one side so you have to be careful not to lean it in that direction too much or it spills. Overall good product that feels it will last a long time. Solid",
        "Hello - I purchased this item on August 1, 2018. I went to grind my coffee for tomorrow morning, and the machine started smoking and now does not work. What is the warranty on this? I am very surprised as this item is not very old and it is meant to grind coffee....very disappointed!!! I know it was $18...but painful as I will now go to Giant Eagle and buy ground coffee.",
        "DONT BUY THIS ON AMAZON. It was advertised as “new” and clearly open box upon arrival. It was missing the button to operate the machine so I had to return it. Terrible experience would not recommend.",
        "Going through Amazon purchase history, I saw how long ago I purchased this grinder and could hardly believe it! It still works like new, looks great, and I've never had a problem with it. Thought it was worth popping up on the very same, still available grinder to say what a great investment this was!",
        "We had one of these back in the early 1980s. Oddly enough, we used it to grind coffee. We eventually moved on to more sophisticated grinders. I was having trouble getting the ground flaxseed that I prefer, so I bought some whole flaxseed and one of these. I am somewhat surprised to say that it works brilliantly on flaxseed. I imagine it would work as well on any other small seed. Cheap, easy to use, easy to clean and very effective - not much more you could ask for.",
        "Almost perfect. I bought this coffee grinder mainly for the quietness and it met this important expectation. The only flaws in this design is that (1.) it gets messy (but I guess this is normal), (2.) the power cord isn't long enough and (3.) I have to unplug the cord to release the cup inside. Since it's a lot quieter than most grinders and grinds well, I will keep it. I plan on grinding some other stuff other than just coffee so will update after.",
        "It grinds your coffee down to molecules if you want it to: this little machine is so efficient! We grind to espresso consistency and it takes about 10-12 seconds. Yes, there's some grinds left clinging to the stainless steel, but just scrape it out, it's not a lot. Perfect for every morning coffee grinding. Not too noisy, either, for a grinder.",
        "I love this little gadget!! I would definitely recommend. I noticed and some reviews that people were saying that the blade did not grind equally. I shake the grinder a bit while it is grinding the beans, and it helps to give it a little more consistency. I've had many Grinders before where if I don't do this, the beans will not be ground consistently... meaning that the beans on the bottom are far more finely ground than the beans on the top. I think most small grinders will do this. This is a great product!!",
        "Stopped working after minimal use. Had it for awhile but only used it maybe once every other week and only to grind one or two servings of coffee beans. I usually would use my manual burr grinder but once in awhile would use this to save time. Always cleaned after every use with a damp paper towel. I got maybe around 30 grinds out of this product using only short-medium pulses and was never grinding heavy amounts. Pretty disappointed.",
        "I'm new to grinding my own beans, but I figured out pretty quickly that I'm not patient enough to use the handheld manual grinders. Or maybe the one I bought was just junk, idk. Either way, this thing makes grinding coffee a breeze. My only complaint is that it's LOUD. I can't compare it to any other grinders, so maybe the noise level is normal and to be expected, but it definitely caught me off guard the first time I used it!",
        "Got it for Coffee grinding usage. Works really well while it works which unfortunately is very short lived. The Grinder got jammed (even though I wash it after every use) after I used it a few times and stored it. They sent a replacement unit and the same thing happened to the replacement unit. I would say if you going to use it for coffee grinding then get a burr grinder rather than these chomping blades. As long as it doesn't jam this is a great product.",
        "Rarely used this product, maybe 5 times total since buying it, and now when I press the button down to have the blades spin and grind, it just hums with no spinning. I even smacked the thing down on the counter a few times, pressed the button again, and only got some slow weak spins out of the blades. Just stirs the coffee beans around inside. Trash!",
        "I purchased this to grind spices, nuts, and chia seeds and it works like a dream. Grinding the chia seeds to make a flour did not take any time at all. It is easy to pulsate it to grind to the consistency you are looking for. Holding the lever down steady will result in a fine powder very quickly. I have ground granular erythritol sweetener to make a fine powder. It works great with grinding granular sugar too. Cleaning it is not difficult. Gentle scraping and using a damp paper towel works for me but be careful as the blades are sharp. I would recommend this grinder to my friends and family.",
        "Have been using this grinder (for coffee only) for more than 2 years. I use an AeroPress to brew the coffee. Over more than 2 years the grinder has worked well with no drop-off in performance. I pulse to a grind at the line between fine and coarse, with some shaking and tapping between to make sure the grind is consistent throughout. With this as grinder and the Aeropress as brewing device, I make very good coffee. For cleaning I use a moist paper towel, and the grinder still looks pretty clean.",
        "Purchased this product in June of 2020 and it failed in October 2020. While it worked, it seemed to grind the coffee beans very well. It was a bit on the loud/shrill side but I didn’t really care. Used almost every morning until I tried to use it one fateful October morning and it started up for an instant and immediate failed. Totally dead. Four months seems like a very short usage period. Do not recommend.",
        "This grinder is amazingly quiet. I won't wake anyone up in the house using this in the mornings. It's sturdy, built well and looks stylish. Easy to use and I love that it comes with a cap to put over the grinder cup to store unused contents. Had it a week and will use it regularly.",
        "Works great for making cracked wheat. Do not wash the lid.... mine hasn't dried in 4 days. The lid is not a good design. There are 2 parts that don't separate. It won't dry quickly in between. I can see mold forming if I'm not careful.",
        "It's an even ground for my french press, is fairly quiet and I can safely store leftover ground beans with accompanying lid for next round. I leave it off my counter on top of my fridge where I used to store leftover ground beans in a glass jar w seal. Glass jar is too risky on top of fridge. This isn't as tall as glass jar and more stable sitting on top of fridge. I’m in S California and I live storage challenged. So this is great!",
        "I get my morning coffee already ground. But with cold brew coffee I want the freshest coffee I can get. So this little grinder is my ticket to the freshest Nitro Cold Brew around. It’s not to noisy and compact enough I can put it away quickly until needed again. I got a electric one because I’ve got a million cords for a million different kitchen gadgets and I didn’t want to have to look for a cord. This one it permanently attached and that’s what I wanted. Four Stars ⭐️⭐️⭐️⭐️!!!",
        "I use the Krups Electric Grinder every morning to grind coffee beans. I want a very fine grind for pour-overs. The Krups Electric Grinder achieves a very fine ground beans for pour-over, in under one minute! If I want a coarse grind for french press, it takes about 20 seconds or less to grind. It feels very durable. I use the lid to measure the coffee beans too. There is some grinding noise during operation, but not terribly noisy. It uses such a short time to go from fresh whole beans to coffee grind that the noise is not a problem. Highly Recommend !!",
        "Great grinder! It grinds the coffee to the consistency of talcum powder. (I like my coffee strong) Obviously one doesn’t have to grind it to that degree. I just say that because grinders I’ve used in the past couldn’t do it.",
        "Bought the small blade grinder in October when my other grinder busted one night. The KRUPS blade grinder was cheap, came quickly and ground coffee beans adequately enough. The machine itself is louder than my previous comparable grinders and has a smaller basin, so I usually have to do two batches if I'm making 8cups. It worked fine for about 4 months (ground coffee beans about 3-4 times a week) then suddenly stopped this week. The grinder makes a sound as if it is trying to work (a low *hum*), but the blade doesn't move at all. For the price I added some extra stars, but you definitely get what you pay for. Switching to a manual grinder now.",
        "I love this coffee grinder! It is powerful and quiet. I have less expensive Krups that is very loud, although it does grind coffee beans efficiently. I definitely recommend this product to coffee lovers who want freshly ground beans every morning.",
        "A nice, compact little grinder with a great price. This fits nicely on my counter next to my coffee machine without taking up much space and it is a strong, efficient grinder despite its small size. It is easy to clean and I use a clean small paintbrush to dust out grounds residue. I took away one start only because since it is so small, I have to grind coffee in batches to make cold brew. But otherwise, I love it! A good buy.",
        "I really recommend this product. I purchased with the intention of grinding spices and my boyfriend also uses it to grind his coffee. There is no setting for the courseness, you just have to pulse it for a shorter amount of time. It isn't a problem though. I was able to grind my spices very finely and he grinds his coffee course for a French press. Like other reviewers said, I pulse a peace of bread to pick up all the leftover and then wipe it out and it stays in perfect condition.",
        "Broke with first use. This is the same model I used for many years. I expected to recieve many years from the new one I purchased but the very first time I used it to grind a moderate amount of coffee, it smoked and the motor died. The new krups grinder had a 20 second lifespan.",
        "Seems like better build quality than my cheaper Hamilton Beach grinder. The HB broke so got this one, because it's advertised as quiet and has a removable bowl, like the HB grinder. Well, it's fairly quiet, but I don't think it's as quiet as the HB grinder. Also, the HB grinder grinds more evenly. This one, you end up with smaller grinds and larger grinds. I just hope it lasts.",
        "My wife had this product before I even met her, and used it all the time. When the motor finally burned out the other day. I had no problem at all buying another identical product. It's well made and holds up well. There are bigger grinders that may suit some people better, but for us, this one is a reliable workhorse.",
        "I pitched the old Krupps grinder we had for years. It was complicated and had so many safeties on it that it became a rubics cube to operate. You could wake the family grinding beans at night or early in the morning.. It was not in my mind to find a quiet one, just to go with a known brand. That said, I no longer have to go to the basement or garage to grind beans when folks are sleeping. Happy with the purchase.",
        "Does the job! Not very loud, easy removable cup, grinds our beans in less that 20 seconds. My only issue, and that's if I'm being nitpicky, is that ground coffee will sometimes get under the cup and into the main part. Annoying to have to clean. But over all, great product.",
        "This product is great. It may be that it's still new and I haven't ground my own coffee in a while, but I'm loving this. It's very compact and you could store it anywhere. I think I would add a tiny brush to get the coffee grinds out though. Another downside is closer to the end of grinding a 'batch' of maybe 6 fills, it will get a bit warm. I suppose it's a good thing this is about the time where your grinds container is just about full.",
        "i like this coffee grinder the only complaints i have is that its super loud, it needs to be a bit bigger givin how tall it is i thought i was going to be able to grind more at a time, lasly i wish the coffee grounds didnt sitick to the bottom of the grinder.",
        "I bought this for my wife. Next thing I know I am getting delicious home made Pad Thai with ground peanuts! Yum. Basically I pulled it out the box and wife was grinding....the peanuts...so yeah. Definitely recommend.",
        "Wow! Fast, fast, fast. First, I DO NOT use this for coffee - I use it exclusively for nuts. I have to be very careful because it is so quick, two or three pulses is enough. I imagine, given what it does to nuts, it must pulverize coffee. I replaced my old Toastmaster brand with this one. That brand was more controlled for my purpose. I could get a good chop without pulverizing the nuts. With the Krups, I need to be quick. Although I have not used this for coffee, I can tell by how it handles walnuts, almonds, etc., that you can get a course ground down to espresso ground very easily and QUICKLY with this brand. Thanks",
        "8 yrs later and this little grinder is still going strong (purchased Nov 2012). Use it nearly everyday for coffee. It’s not the most professional or best for coffee, but it’s also not expensive. I’ve found the best way to get a good even-ish coffee grind is to shake the grinder up and down while grinding. You can even take the extra step of sifting the grind (But who wants to do that much work in the morning. Works perfectly for my needs and my daily grind.",
        "This works as expected. I was trying to grind some fennel seeds to make my own 5 spice powder. This grinder works fine and cleans out with a brush, as others suggested. Don't need to toss it in the dishwasher and ruin it. The noise level did not register with me, very likely it is the same as a blender. Blenders will not grind up fennel seeds and make the same amount of noise. Fresh ground spices have significant aroma over pre-ground spices. Taste is good too.",
        "This is used for grinding coffee/espresso beans in our household and it works absolutely fantastically! You do need to sort of shake the grinder to ensure that everything gets blended up evenly, but that’s has just become part of the ritual to make coffee. Even after cleaning, there does remain a coffee smell so I would recommend not using it for both coffee and spices. Just get two if you need that, because it’s so affordable. (That’s what they do on all the cooking shows on TV anyway.)",
        "I'm not a coffee drinker so no idea how this works for coffee beans BUT.... I've used it for other purposes in the kitchen. First was to chop pecans, it made quick work of them and was much much easier than my hand chopper. I've also used it to grind black peppercorns. Wow, just a few seconds and fresh ground pepper. Finally, I used it with granulated monkfruit to make a fine confectioner's-sugar-type powder. Again, just a few seconds and it was done! I'm really going to like having this in the kitchen. Pretty sure it will handle your coffee beans with no problems.",
        "I buy true cinnamon (Ceylon cinnamon) in its form of softer, almost papery curled sticks (compared to the hard, thick version), and grind my own for freshness. (For those using cinnamon for its health benefits, the stuff you get in grocery stores is NOT effective in that regard. It's actually Cassia, and will flavor food, but that's all.) I also order green cardamom from India, to make the wonderful Chai type of tea, and sometimes I grind it to flavor hot chocolate. This grinder does the job beautifully, giving me close to a powder even with fairly hard substances.",
        "I had the same model, which I loved, and it lasted me for many years (maybe 8?). Sometimes the blade stuck after cleaning, and I'd have to manually spin it around (with a towel over my hand so I wouldn't cut myself) to get it working again. Otherwise, it performed very well. When it died recently, I purchased this new one. The new one has had the blade-sticking issue from the get-go, but this time, my manual spinning trick doesn't work. It's just dead less than three months after purchase. It was being sold at an unusually low price, perhaps that's why – faulty product. Unfortunately, I'll be switching to a different name brand.",
        "I've purchased a couple of these over the years -- they're cheap, Krups is sort of a name brand -- but they always break, seizing up. I never wash them with water either, and I don't live in a humid environment. Never again. These things are cheap and you get what you pay for. Except I expect them to last more than a year or two when only being used for light spice grinding. Disappointing.",
        "Love it! Super quiet and has a lid to store extra ground coffee in the ginder. Grinder container is removable and I clean out loose grounds in the machine itself with a small clean paint brush. Grinds to super fine which is perfect for my cappuchino machine.",
        "This is a small grinder that works great for my morning cup of coffee at the office. Its quiet enough not to distract my coworkers and does a good job grinding the beans down quickly. It only has a pressure activated switch so grind size is controlled by how long it runs. It cleans up with a quick wipe down and leaves no mess behind. I would recommend to anyone trying to use a french press or have fresh ground coffee in the office or on the go.",
        "We LOVE this grinder. The beans grind fine & Evenly. We returned one that had uneven grounds even after many grinds. It does the job quick, easily & very quietly. We find it easy to separate top to pour in coffee maker & clean. (Would be nice if brush was included.) The fine grind has made our previously really good coffee even tastier. So glad we chose this one.",
        "I always buy Krups coffee grinder. They are the best and finest grind. I will buy again. That said this last one I bought did not last. I bought it may 3 2020 and it died July 5th. I did not get to use it much. I can’t return it because item return ended June 3rd. I am going to get another one now. I have had burr grinders and several brands of grinders and this littl grinder had more power than the others of this type. The burr grinders did not produce the fine grind of krups. Amazon price more than doubled I will look somewhere else",
        "I've had one for a couple years now and it's never failed me. I recently moved out of the house and I think my mom was going to miss that coffee grinder more than her own daughter. At least this second one could fill the empty hole in her heart. It certainly does the job and grinds up whole beans in just a few seconds. I'm not sure of the \"proper\" way to use it but I've found that giving the grinder a little vertical shake while holding the button gives a more even consistency to the grounds, otherwise the beans closest to the blades will turn into a finer grind than whats on the top."
    ]
}