{
    "entity": "Electric Burr Grinders",
    "text": [
        "The motor stopped working after 8 months of light use. It has an 18 month warranty, but the customer is responsible for all shipping and handling. It has been difficult to reach the company with the number they provided to request warranty repair or replacement. I will update this review and let you know if my experience improves. The product worked well until it died.",
        "I've been using this for a few months now and the #1 problem is that while leaving the settings alone and never touching them it will grind different amount of coffee each day. Sometimes it's 4 TBSP of coffee and other time it fills the entire container. If I want to use it at all I have to keep the coffee bean container empty and just put the amount of beans I want to grind in it each time. This is a piece of junk and I cannot recommend it. It taints all things Cuisinart for me. Conair has made the band cheap so I'll be avoiding it in the future and buying other brands.",
        "The product only worked twice, then churned out broken bits of black plastic, then stopped working entirely. The grind was inconsistent the only two times it worked at all, a common problem with Cuisinart grinders. I think the Burr aspect that allows you to select the kind of grind is gimmick-y and clumsy. It's possible the unit we received was just defective, but the product seems cheap and I do not feel I can recommend it. We ended up getting the Epica Coffee Grinder instead and it's great:",
        "I purchased this to replace a Mr Coffee burr grinder and found that the same design flaw is present in the Cuisineart, mainly that the beans don't drop into the grind chamber which requires a vigorous shaking and/or smacking on the counter top to get the beans to flow again into the chamber. The video for the product shows the unit in operation but must have been edited as the noise in the video is a fraction of the \"wood chipper\" noise that I was trying to get away from. I have a Breville grinder for espresso beans that is almost silent in comparison.",
        "I am impressed with the level of grinds for the various methods I have to make coffee. The static level is about the same as any other. I still have to clean up some powder after a fine grind. The course grind is course enough not to get that powdery residue in my French Press. However it is the loudest grinder I have ever had. It scared my grandsons the first time they heard it. I actually have to step away while it's grinding. I am considering making an insulated cover or using the box it came in to drop over it while grinding. I would highly recommend this grinder... if you're already deaf.",
        "the Good: Easy to clean and dis-assemble for cleaning. Large hopper for those who wish to put multiple days beans in the hopper chamber. The Bad: Noisy as a lawnmower without a muffler The grind is not consistent, which leads to incomplete results in the brew. Leaves many beans not ground or incompletely ground. Impossible to completely clean the grinding disk. The Ugly: In my case the Cuisinart tech support the Amazon connected me with. She couldn't or wouldn't resolve the technical issue. So she just disconnected the call. The product is made offshore and the assembly is shoddy. Bottom line I would not by this product if you are a coffee lover, buy one with conical burrs.",
        "HAHA! This thing is louder than an old blender chopping rocks inside of an oil drum! Unbelievable. If you're wanting something quiet, you'd be foolish to even consider this. Seems to have a serious static issue too. When we open the bin after grinding is complete, grounds explode everywhere. It's a too person job to open the bin and cup our hands around the top of the coffee filter. The actual grinding of the beans is pretty good though.",
        "As other reviewers stated, it's not very quiet. As long as you're not trying to get a grind in while others are sleeping, you'll get a decent cup of coffee from this grinder. We really like the Colombian Supremo from Costco and a full 12-cup carafe takes the whole 18 cup setting to go the distance, flavor-wise. We chose this as an inexpensive replacement for a blade grinder (the problem with blade grinders is that they re-grind the coffee that is already ground and leave a lot of variance in your grounds, making your carafes hit or miss). It's been doing well but I definitely recommend getting a brush to clean with. Hopefully it will last a long time.",
        "I've gone through several of these Cuisinart DBM-8 units; they last 6 - 12 months. I feel the motor is underpowered, ultimately resulting in \"burn-out\". I grind approx. 2 hoppers worth every time I need to go through mess of grinding (static attraction of grounds) to avoid build up, and \"choking\" of the burr grinder, but invariably I need to replace it someplace within the number of months previously mentioned. The output results are consistent, the operation and clean-up is messy and the longevity is poor.",
        "I've been using this product since November. I'm the only person in my household who goes to the trouble of grinding beans instead of using K-Cups. Given that, we are not talking about a lot of use. When I do grind beans, I fill up a 1QT container with coffee grounds. Given the brand name, I definitely expected a greater life span. Previously, I'd use one of those hand held electric grinders that do a handful of beans at a time, and I'd always get years of use out of them, so to day I'm disappointed in this product is an understatement.",
        "This is an excellent coffee grinder which I use daily with fresh espresso beans. I looked forever for a grinder with all of these features as we have several different coffee making apparatus in our home and different grind options is a must for beans. My only issue with this machine is it is not easy to clean. The oil from the beans does stick to the exit area and makes it cakey which clogs up the small area. I haven’t worked out a way to effectively clean this between grinds to prevent eventual clogging. Just a brushing isn’t doing the trick. Aside from this I get a fairly consistent grind and I’m pleased with the product.",
        "I use this little machine a lot. It grinds great. I'm not an expert, but I'm pretty sure the grind is perfect for espresso. That's all I use it for. You have to clean it regularly for it to work good. For the price it's great because I use it so much and I haven't had any issues. I have a super automatic espresso machine but I can't put my flavored beans into the machine because they have too many oils on them. So I put them in this grinder and it works great. Because of the oils on the beans it does get clogged up a bit but you just have to clean it out and it works fine.",
        "I've owned an exact model of this coffee grinder for 15 years. The only reason I bought a new one was that the three safety buttons that contact the base of the bean hopper got to where they would only allow the grinder to activate if the grind setting was on the highest (fine) setting. But this current batch is not as good as the 15 year old model. The motor vibrates a lot and it is very loud. I either leave the room or wrap a bath towel around it. The metal finish is brushed steel instead of chrome. I may just swap out the defective safety contacts and put them on my old grinder.",
        "I bought this for my office espresso machine, brevilla cafe roma, I think the machine works great for grinding coffee for regular coffee makers or other methods besides semi auto espresso machine, I have a breville barista at home which has a grinder on the top and it is by far better than this at grinding coffee to fine powder to make a delicious espresso, with this grinder even at the fine setting it is still kind of course and not consistent you will get some super fine coffee mixed with medium coarse coffee, I'll keep it since will see maybe some ocassional use and its a good product but not for my intended use.",
        "I bought this to replace a > 10 year old grinder of another brand that is no longer available. This one is very loud. The slider used to adjust the amount of ground coffee doesn't relate much to cups in my coffee pot, but I figured out how to adjust it. I like that I just have to press a button now. I also like how the coffee goes into a receptacle with a lid: it keeps the grinder tidy and, if I open it over the sink, I avoid mess on my counter. The hopper holds a reasonable amount of beans. It does what it is supposed to do.",
        "This grinder is an extremely expensive piece of trash. The grind is uneven and inconsistent, it's extremely loud, and at this price point there's no reason for it to be this bad. Also, this might bother some people and not others, but the square hopper will never face straight out at any setting so people who like their kitchen appliances to look nice should also avoid this. Overall, this machine has the worst performance for the amount of money spent out of any grinder I've ever used, and I was a barista for five years and a daily coffee drinker since my early teens, so I've used quite a few.",
        "The first two grinds the bottom contain filled to the top,, then it would only fill half the bottom container, then it quit totally. This was the first time I used it, this machine is brand new. What a total disappointment. I have coffee beans to grind and no machine to do it with. Update: Two hours later I was able to grind more roasted coffee beans, it worked but only filled the container half full even though the hopper was full of beans and the setting was set at its highest setting. The brand new machine over-heated. This coffee bean grinder was purchased to replace my previous machine, which worked great for years, it was just worn out.",
        "Bought this unit based on reviews of its grinding ability, which seems fine. The concept, of grinding a little coffee each brew cycle, is a good one. However in use, the process of getting the coffee out of the catch container makes a considerable mess all over the place, making it impractical for frequent use. Fine coffee powder all over the counter So, if I was going to grind my coffee all at once, why not do it at the store where I bought it? Returning the unit, despite the very attractive price. Keeping my \"spice grinder\" unit for occasional use.",
        "Love Cuisinart...most of the small appliances in my kitchen are Cuisinart and this grinder is the same high quality. First grinder I have owned but discovered some wonderful coffee beans from Myanmar and this grinder is perfect. The answer to the noise level is marked 5 stars, because I can't imagine a grinder that is not a little loud to do what it does. Those beans are like little stones and this one does a great job. The top holds exactly 12 oz. of beans and keeps them very fresh. it also matches our Cuisinart Coffee Maker perfectly. Recommend.",
        "Not exactly sure what I was expecting, but, the noise level, specifically the inordinately long amount of time it takes this grinder to grind what would typically take between four and ten seconds at most to do with a normal grinder/ electric, is off putting. The high pitched squeaky/grind sound at the end of each session is the worst part. Very similar to unpacking a new tv/computer from it’s packaging; foam sliding on cardboard, if you will. Maker that sound EVERY TIME..... I hope mine is the only one that does this, and that all others are less noisy, as this is the biggest downfall in my opinion.",
        "Like most things, in order for it to last and be effective you need to maintain it and clean it in order to keep it working. I am happy with my first coffee grinder but the first time it stopped working I thought it broke already. It just needed thorough cleaning. I use a toothpick to break through the build up and a paintbrush to brush off the excess. Cleaning the coffee grinder takes patience! If you think you cleaned it enough and it's still not working... KEEP cleaning it and manually spin the grinder (when it's off of course) to get rid of any build up.",
        "We grind coffee maybe twice a week, unplug it after each use, never change the settings, and simply turn it on. This morning, just like our last identical model six months ago, the grinder started up, made a strange noise, then stopped (with an electrical burning smell.) We've had no other appliance in the house burn out. Not going to pay for return shipping for another grinder that will last maybe last six months. Will not buy this model or brand again.",
        "Cuisinart DBM-8 Supreme Grind Automatic Burr Mill, Stainless Steel Ordered on August 10, 2018 ♱ Died early February 2019 Cuisinart DBM-8 Supreme Grind Automatic Burr Mill, Stainless Steel Ordered on February 22, 2019 Never Delivered Order replace on February 25, 2019 Received February 27, 2019 ♱ Died April 19, 2019 ♱ Died May 12, 2019 This one died as well... Cuisinart products have gone way down hill in quality. I will always look for a different manufacturer for and product sold by Cuisinart in the future.",
        "It's cheap because it's cheap. Look at the one star reviews. There are hundreds with the same complaint. That the grinder just stopped working one day. Mine failed 5 months after I bought it (with infrequent use). Cuisinart and Amazon know this is a defective product yet they still insist on selling it. The Amazon return window has closed and Cuisinart has refused to refund my purchase price, but immediately offered a replacement which I refused. They then offered a Cuisinart credit which I also refused because I WILL NEVER BUY ANOTHER CUISINART PRODUCT. Reporting them and Amazon to consumer affairs.",
        "We have enjoyed this work-horse coffee grinder. Fits nicely into a corner on the kitchen counter. Yes it is noisy but it is working to grind that coffee. Multi levels of grinding. We found the setting we like and just leave it there. One thing people always mentioned in their reviews was Static. Yes there is some static of the ground coffee but it is manageable just be aware that it happens. Tap the plastic container gently before the lid is opened. This seems to help. We make several grinds and place them in an air tight container, the we are ready for our next pot of coffee.",
        "I purchased this product in January 2019 and it has completely quit working. Took it apart but not repairable without costing more than it's worth. I researched grinders and always liked my Cuisinart products but this is a compete dud! Don't waste your money. I had a cheaper brand before this and it worked for 6 years before it quit. They don't make things the way they use to.",
        "As others have described, this grinder inevitably produces a lot of ultra-fine dust in addition to your chosen grounds. And as Anakin Skywalker says, it's irritating and it gets everywhere. This renders it useless for grinding beans for cold brew or French press, which require a coarse grind. With a commercial grinder, there's very little dust, and most of that is heavy enough to settle to the bottom of the container. On the coarsest setting, the Cuisinart produced dust that's so light and fine that it stays suspended after 24 hours and then passes straight through two layers of filter paper without leaving residue.",
        "Two identical grinders purchased four years apart had very different operating results, hence the three star rating. The grinder purchased four years ago performed great, and stopped working in late February 2020. We bought the replacement immediately and it stopped working completely today 3/27/20 after two and a half grinds. The motor apparently burned out. The latest grinder would get less than a star rating while the old one earned five stars. My guess is this product is problematic with some working well and others not. Good luck!",
        "Lots of control, its NOT quiet. This is my 3rd one in 8 years, but I grind for 2-3 expresso pots a morning at home. its possibly airtight, but I only leave my coffee in for a few moments. just fill for the days grind. I bought it again, so I must like it. The third one seems to have a a bit less \"UGH\" to the grind process. Maybe a little more \"dainty\". At the end of the grind works. This thing was also half the price of the original so many years ago, so makes sense if its more cheaply built or assembled.",
        "This is the 2nd one of these I've purchased. My original one bit the dust after 12 years of daily use. The old one was chromed steel instead of stainless and the build I feel the build quality was better. But the price on this one was lower than I paid for the original. It just has a cheaper feel to it with the thinner stainless steel housing. Other than appearance, it performs identical to the original. It is fairly noisy. It holds an ample amount of beans.",
        "We bought one one these 20, or more, years ago and it was great until it died. A pretty good run. The new one is the same model but doesn't operate nearly as well as the old one. The grind and amount settings aren't remotely similar to the old machine, this one is much noisier, and coffee grounds are all over it inside and out. It leaves a small amount of ground coffee all over the counter with every use. I wouldn't buy this one again, sadly, the old one was great, the new one, not so much! I'll be researching other grinders in the near future.",
        "This is my second one. I believe my first one was about 10 years old. I use it everyday. The first one finally gave out..not sure why. Usually when it quits working it needs a good cleaning with the brush that comes with it. Ive done this several times with perfect results..runs like its brand new after cleaning. Didn't work this last time so I bought another one. For a small appliance, the amount of use it gets and the fact that it was 10 years old, I didn't feel cheated. I like to perk coffee sometimes so being able to adjust the grind is a feature you don't find in many coffee grinders.",
        "I have only experienced a blade grinder until purchasing this unit, so I don't have anything else to compare it to. Wow, I am amazed at how much better my coffee tastes! I always read about the tasting notes but with the blade grinder it just tasted like coffee. With the burr grinder I actually taste some of the flavor described. I understand the more you spend on a burr grinder the better it is, but I an very pleased with this little inexpensive model. Maybe one day I will break down and spend $200 on a better unit, but until then I'm excited to try different beans in this unit!",
        "Well, first of all I never received this Grinder. It literally got lost in the mail. When I went to reorder they were sold out. But in regards to the name brand Cuisinart,there Excellent. I've bought other products from Cuisinart and they lasted me litterly 15 yrs or more (until I dropped them). You won't go wrong buying a Cuisinart (it'll last a long long time).",
        "This product replaces a small coffee bean grinder that eventually met its match in trying to keep up with my coffee consumption. It gave a good fight though. That said, I could not be more happy with this product within the price point. It is stylish enough that I gladly keep it out and it does the job. I appreciate that it holds beans in the top and has an auto function that allows you to select the amount of beans that are needed and it goes to work.",
        "Very first time grinding beans with this device, hit the on button, and more coffee grounds on the counter than in the storage bin. Cleaned up mess, re-read directions. Attempt number 2, same exact results. Their is approx a 1/8-1/4 inch space between the storage bin and the actual grinder that provides a space for the coffee grinds to come flying out as it’s grinding. Why ? I have no idea I purchased this 8/6/20 arrived 8/7/20, attempted to grind fresh coffee 8/8/20. Will be sending back Monday for a refund, not worth the hassle.",
        "After 6 or 7 years of faithful service, the motor in my previous unit failed. Happy with the overall performance, I simply replaced it with the same product. This new one has a bit different grinding performance. I would set my old one at 10-12 cups when making a full pot of coffee. The new one has to be set at 16 to produce the same amount of grounds. Weird, but fine.",
        "Even when set to its coarsest setting, rather than grinding consistently, this burr grinder produces a huge amount of fine powdery chaff or coffee dust. The chaff then gets everywhere, sticks to everything with static cling, and can't be settled by any amount of tapping or shaking the container. The grind container is so large that it's impossible even to open it and move the grounds into the coffee pot without getting the fine, blowy, staticky powder absolutely all over the place. If you don't want a kitchen covered in fine coffee dust, look elsewhere.",
        "You might not feel special when you own this grinder because the manufacturer's name doesn't end in a vowel. But, you will have a quality grinder that doesn't cost you an arm and a leg. I've read other reviews about it not working right away. That is not close to my experience. I've had mine for 7 years. I use it heavily. I currently use it 4 times daily. It's been a tremendous machine for me. I highly recommend.",
        "This burr mill, cannot be cleaned and it is poorly made. The burr mill itself is glued together and can only be used for one spice or one kind of coffee, because you can't clean it. So if you try to grind/mill something else it will be mixed with what you ground before. I tried to clean it and it came apart and doesn't go back together. Awful design, broke and is not reparable after second use. Buyer beware. Awful product",
        "For the price, this is an excellent grinder. It does what it's supposed to do effortlessly. Not sure if it's normal or not but this grinder is exceptionally loud and has a high pitched whirling noise to it. It's my fault for not requesting an exchange before the window closed. It grinds the beans effortlessly. Unfortunately the bin is not airtight so if you grind too much, make sure to move it to an appropriate container. Other than that, definitely worth it for better tasting coffee.",
        "I like the fact that this has many, many choices for grinding coffee ... from very small & fine to coarse! I drink \"regular grind\" coffee & my husband drinks the heavy duty coarse grind! We are both extremely happy with the size & choices of grinding. The problem is I put the holder for the ground coffee in our dishwasher. It came out cloudy, very white. I haven't been able to clean off the residue (?) off of it so it doesn't look the best ... BUT, the grinder works like a dream!! The residue on the \"holder\" does not affect the quality of the different types of ground coffee that we both love!!!!",
        "Bought this for coarse grinding for cold brew coffee. While you do get some coarse grounds, you also get plenty of fine dust, and the coarse grounds are consistent in size. I have also had a hard time using this and not making a mess, between the large size of the output bin, the hole where the grinder shoots the grounds into the bin, and the fine dust stuck near the top, I just can't manage to not make a mess. I haven't used it much, less than ten times, and will probably replace it, so I can't report on the reliability/durability issues this grinder seems to have.",
        "I do not know if it tastes better fresh ground, but the grinding process itself smells wonderful. Not that most any grinder would not do so, but I have always bought coffee already ground, and this mill is the first I have used. It is fast, fairly consistent, and not messy. It is quite loud, but fast enough that the noise is brief. It grinds consistent in that it does not produce larger grinds than the setting, though it does produce a fair amount of much smaller dust, so you still need a fine filter even if using course ground settings, though the majority will be course. I like it. Looks nice on the counter as well.",
        "Owned this machine for 9 months and use it on average about once a month. Stopped operating completely today. I upgraded this to a four star because it stopped operating because I had used it too long that day. It needed a rest and when I resumed it worked well. It also needs to be cleaned frequently to keep the opening unclogged. Once I started doing these two things it is working very well again. I am also grinding beans more frequently now.",
        "I have only been using this grinder for a week, but so far I love it. WHO cares if it is noisy (it's a grinder)? I like my grind like powder, and that's what it produces on \"fine\". Also, it is so convenient because you can load the hopper up with lots of beans, so when you need to grind you need to push only one button. From french press to espresso this delivers the correct coarseness. If it lasts a year I will be pleased. So funny the people (poor idiot people) that pay a few dollars for a product and expect it to last a lifetime",
        "I used to dread having to grind beans. It was take out the grinder, take the beans out of the refrigerator, spend who knows how long grinding enough to fill a mason jar, put everything away, clean up where I spilled grounds, and then make coffee. Now I just pour a 1/2 pound of beans into the hopper, select the grind and amount of beans I want ground, and turn it on. Done. Love it. Don't believe what it says about how many beans to grind for say 10 cups. It grinds far too many. But I will grind what it says is 15 cups worth and have enough tor three days.",
        "This is a fantastic burr grinder. The noise level is a bit on the high side, but I live alone, so no problem. But, if you are in a house full of sleeping people, and you are the one appointed to get up early and prepare breakfast for everyone else, then you will wake the dead when you hit the start button. You can take it to another room that is isolated, or take outside and plug in , grind the coffee, then go back inside. Except for the noise level, it is really a very good grinder.",
        "My first grinder ever so I am not sure if I know what is a better grinder or worse including what features I have or are missing. As my first grinder I will say I really like it. So far just using for drip coffee and it works well. I did have an issue initially trying to figure out the how many cups button. I was grinding to much and over filling my coffee pot. I have since found the correct amount to grind to make a super strong pot of fresh coffee and love the strength and grind of what I am using it for.",
        "I didn't really have time to return this, but I would not buy it again or recommend. It does the basic function, one of the rating items was airtight, it is not. The problem is it creates so much static it literally spews grinds out the sides of the container all over the counter, and is impossible to dump grounds without getting shavings everywhere. A big mess, I have used this for over 2 weeks and tried changing some things, but the problem is consistent. It is also very noisy, more so than the one I replaced.",
        "We were attracted by the size and brand name of this item but ultimately, disappointed as this frequently jams while grinding dark roast coffee. The grind selector is not too accurate as well. Even at the coarser setting, we are getting a rather fine grind. So long as you frequently thoroughly clean this, it has continued working. Would I do it again - NO... I will likely spring for a more expensive unit that will not clog as easily and easier to clean - like the Baratza Encore Conical Burr Grinder -- MUCH more expensive but reading through the reviews, this does not have the issues we experience with this unit.",
        "Just bought this. Directions aren’t very detailed but it states everything but Housing is dishwasher safe. Cool. So I washed the parts except Housing in my dishpan. However, the Hopper trapped sudsy dishwater so I called Customer Service. Guess what? All the representatives were helping other customers and my call is Important to them. And guess what? They are experiencing higher than normal volume so I opted for an email. If I can fix the problem and use the darn thing, I will edit my review.",
        "I should have read the reviews more closely. Got this for Christmas. Won't grind fine enough. Set to fine, the output won't generate any measurable pressure in my Breville espresso machine. Does fine for drip, but still set quite fine. It must generate large, fractional beans set to course. I'm going to have to hang onto my spice mill to make espresso grind. Static is an issue, too. Coffee adheres to the walls of the output container and ends up all over the place if you don't open the lid carefully. A couple of gentle raps on the counter help before opening helps. Disappointing. If you have and espresso machine, pass on this one.",
        "I really enjoy this coffee grinder. Its a bit noisy and sort of messey evertime we scoop out coffee but it really does an excellent job at grinding coffee to fine dust. I prefer dust rather than chunks or bigger pieces of ground coffee. This product grinds coffee both coarse or fine. I get more flavor out of finely ground coffee rather than coarse a d thats what I like. Big roast flavored coffee. This machine helps provide that. With the exception of a couple issues, this machine does a great job. Nothings perfect after all. The price point is a fair deal for what you get.",
        "Works like a charm once you figure out how the buttons work. We recently switched to one of the combo coffee makers that you can use the Keurig pods in and also make a full pot of coffee. We had an older coffee maker that had the grinder built in. I had always heard the burr grinders were better so tried this one out. I do think the grounds come out much better that the other style of grinder. It is kind of hard to get the plastic container to slide into place. I have to monkey with it every time I use it. You would think this brand for this price that would be a synch.",
        "This grinder does an awesome job at giving you the perfect consistent ground coffee for your taste. It is nice having the hopper on top to save having another container on the counter. The downfalls of this grinder is that it is very loud, and it has to be cleaned about once a week. The ground coffee tends to build up on the spout of the grinder before it gets into the container, I just hold it over the sink and dig the coffee out with a butter knife (the brush that is included is worthless).",
        "This grinder is the worst one I have ever bought. The unit is very noisy, the grind settings do not seem to make any difference whether it is set to course, medium or fine. The coffee comes out like fine powder. Why did they use a plastic container? So much static that coffee grounds cling to every part of this container. I was very dissatisfied with this product after a few days (1 week) of using it. Just bought it recently. I would not recommend this grinder.",
        "If you are looking for a grinder that provides good quality grinds, this is not the unit for you. All grinds I have performed contain grind sizes from very fine powder up to what is to be expected from grind level setting. Definitely way below quality obtained from a brand like Baratza and other quality machines. For a quick grind for the novice who is only looking for the freshness of just ground beans, this may be an ok product, otherwise look elsewhere. Cuisinart has produced some poor products and this is definitely one of them. Spend twice as much and purchase a real grinder.",
        "Finally getting the fine grind necessary for a great espresso coffee! The storage is nice. The noise level isn’t ridiculous. I haven’t cleaned it yet so I cannot comment in that. It seemed like it took forever to get, but I guess it was only 3 weeks since we ordered it. The size and shape fits nicely on my counter. Easy to operate. If you’re doing a 4 shot espresso, set the number of cups to 8 when using the finest setting.",
        "We purchased this in 2017, but never really used it until recently because it really didn’t work as well as we hoped. Our small one finally died, so we’ve been using this one much more often. It’s probably been in use for about 6 months and the motor just completely died. Won’t be purchasing Cuisinart again since we also had a coffeemaker die after about a year. The brand is overpriced for the quality in my opinion.",
        "Excited when this came. Fast shipper. I initially had trouble taking it apart for cleaning, just a matter of adjusting the tourque. Filled the hopper and the smell was amazing!. The 2nd setting attempt was the best one for me. I only grind a couple ounces at a time, filled the hopper twice. Very little waste between the hopper and grinder and the little brush is great for cleaning. Less noisy than expected too. I love it so far! Glad I bought it. No more coffee pods.",
        "I studied reviews over and over and purchased another grinder, that turned out to be a cheap rip off. Thanks Amazon for changing what used to be a good review service. Now when you read a review you don't know if it is the same product you are trying to purchase. But this Cusinart is wonderful. I get an even, consistent grind. It appears to be of good quality and I think it will last. I wish there was a way to clean out the burrs, but this isn't a big deal, I just make sure I grind every bean when I do each grind. Very happy with this.",
        "This grinder does a great job, has plenty of grind settings - more than anybody needs, and it is fairly quick. It is not that loud and it grinds a good amount of coffee at one time. If you are gentle with the grinder, it will last for a very long time. If I were to improve this at all, I'd would make the grind receptacle easier to empty, and some how make the grids drop into the receptacle vertically, rather than being dispensed horizontally.",
        "This is my second unit. The first one suffered from stress cracks and fractures of the plastic housing surrounding the burr mechanism. Result? The interior fills up with ground coffee! The timer mechanism and other circuitry are somewhat fragile, so when you take the unit apart to clean it, you run a risk of disabling the machine. I replaced simply because I couldn't find anything with a better mechanism (e.g., nothing but blade grinders) short of very expensive units. It's a shame small appliance manufactures build in failure. Ratings: 5 for utility, 1 for longevity. It's loud as heck too because it runs at high speed.",
        "I’ve had this do-dad for a week or so now. It does what it says and I enjoy it so far. I use it for my French press and the course grind works nice. There are some variances in grind but I wouldn’t return it because of that. In regards to noise, it’s a grinder. The storage bean bin up top fits a hefty amount, also the grind bin fits a good amount for me to use more than two presses at a time. I think so far it’s nice!",
        "Works great! I've been using mine for over a year. It is kind of loud, but worth it for the freshest coffee. It grinds fast and has many different grind settings. The only thing about it that annoys me is the transfering of the grounds into another container. The brush that comes with it is a useless tool. The brush just adds to the static. The grounds are so static, they get in your hands and countertop. I would say I'd lose about a 1/4 teaspoon of coffee. I feel like that would happen with any big coffee grinder though. I got mine when it was on sale. Totally worth the money.",
        "I really like the abundance of settings on this grinder. Anytime I would make coffee at home, the grounds would be too fine and leave sediment at the bottom of my cup. This took care of the issue, plus I can grind bigger pieces and use them for cold brew! It's fairy loud, but it's a grinder.. I expected it. My biggest annoyance is the static caused by the heat + plastic combo. Every time I pull the container away from the base I have coffee grounds all over my countertop and hands. Minor detail, but worth noting.",
        "I bought this as a present for someone important at work and it totally failed on me. The receiver is very enthusiastic about coffee and of the brand, and was actually exited about the present. It turns out that it didn't work as expected, it was loud and it would not deliver the finesse and uniformity of ground coffee that was expected. The controls and set up would not make much difference between extremes. I was very sorry and kind of ashamed of the performance. Being fair, benefit of the doubt is due since I really don't know exactly how my friend used it but still it raised strong concerns.",
        "There is a tremendous difference between my previous blade coffee grinders and the Cuisinart Burr Mill. The flavor in the coffee is so much better from a burr grinder. The Cuisinart has a timer and the hopper so you fill with beans, hit the button and it grinds the necessary amount for the pot of coffee. Fully adjustable for coarse, medium and fine for different blends of coffee, I found the one that fits best for me. Super Coffee Experience!",
        "So I have been using the grinder now for about 3 weeks and I'm disappointed: - grinds by amount of cups instead of grinding to the fill limit of the bin, therefore having to push start several times. I had thought that you had a choice of filling bin. - loud - extremely hard to clean, brush included does not work for me - the small whole where the ground coffee falls into the bind is extremely hard since you cannot submerge the unit. I had to use a small bottle brush to get in there to clean.",
        "Grinder worked really well until we switched to S'Bucks French Roast which is pretty oily. As the oily dust catches inside the grinder it builds up until the beans no longer go down the chute so you hear the motor working but no beans getting through. With typical 'dry' coffee, never a problem. So keep in mind if you're buying this for an oily coffee, unless you plant to clean often, might be better grinders out there for you.",
        "It’s a reasonably good grinder for different grinds. Used mainly for press brewed & pour over coffee it gets the job done. I really wish it was better insulated for noise but you can’t argue the price compared to other grinders. This is my 2nd unit which replaced my 1st which died after about 4-5 years of almost daily use so you can’t go wrong with this grinder unless you have higher expectations.",
        "For the money, this is still likely a much nicer coffee grinder than I'm getting from similar priced blade grinders. However, the DBM-8 is the single loudest device in the history of earth - rivaling jet engines, metal concerts, and the screeching decibels of children. The grind seems to be somewhat similar regardless of where the fineness adjuster is, but you're usually too busy being deaf to care.",
        "This grinder works well for the purpose I need, however the grind is fairly inconsistent. I mostly use course grind for commercial coffee pots, and while the bulk of the grind is ok, there is a lot of fine powder in the grind (more than expected). I basically sift this out and use for personal coffee maker which works, just an added step however when attempting to get a more even grind. So far the machine itself performs well, no other issues and I use it several times a day. Fairly easy to clean after each use, and have not had any issues with it clogging etc. to date..",
        "I’ve had my grinder for about a year now. Works great! Yes it’s a little loud when grinding but your grinding hard coffee beans! Of course it’s going to be loud! I love the hopper so I don’t have to handle beans while I am half awake, press the button and it grinds the preselected amount so I can have fresh coffee everyday. Not a single problem in a year and I use it daily!",
        "Looked around for a burr grinder for light household duty. We enjoy our french press coffee, but ar not coffee fanatics, and used the blade-type before it broke. I also didn't want to pay an arm and a leg for a grinder. Although this grinder is bigger than our small blade grinder, it still fits under the counter and its footprint doesn't take up too much real estate. I feel the setting make the course grind too course, even for french press, so we moved it to a medium setting. I like the reservoir both for beans and grounds. You can make up to 18 cups of ground coffee should you need! We've been happy with the purchase.",
        "This coffee grinder / burr mill is wonderful. It is a little loud, if I lived in an apartment it would probably be too loud. I love the simple way choices are made, nothing complicated. Slide the bean tub to select coarse or fine, then the little slider for how many cups to grind for. I've owned this now for about 6 months, coffee made fresh every day, sometimes twice a day.",
        "This grinder is like that kid at school who is average at everything and exceptional at nothing. Think of your slacker coworker who is somewhat competent but you can never trust with big responsibilities. That’s this grinder. I’ve had it for two years and it does the job but it’s not great. Even at the fully coarse setting, it still produces some fine grind. The cup setting is completely wrong. You can put just 2 tbsps of beans and set it to 4 cup grind and it still won’t grind all of it. But it works decently well. I’ll keep using this until it breaks. Also, it’s loud.",
        "I previously had this grinder when it came out brand new several years ago, but somehow the top portion broken off mysteriously. I couldn't figure it out, but realized that one of my sons was home at the time and I was in another room of the house when he asked me how much I paid for the grinder. Obviously I put two and two together, he accidentally knocked it off the counter onto the floor. I was so happy to find it here on Amazon so I could grind my own beans again. I like the different settings since I like my coffee strong and I can make it weaker for company by just adjusting the grind.",
        "I originally bought this to use with an espresso machine. it made great, espresso grind. last year I switched to a French Press, which uses a coarse grind. again, it makes great FP grind. However, once and a while, it stops working, much to my consternation (a day without coffee? perish the though). I found, by chance, that if I turned it upside down, it loosened the beans inside, and would work once again! so don't despair if this happens to you; just remember my trick. I don't remember when I bought it, but it's held up perfectly.",
        "This is my first grinder so I’ve nothing to compare it to but I’m satisfied with my purchase. For a novice it’s easy to operate and clean. It’d be nice if it were a bit quieter but it’s a grinder after all and it’s not nearly as loud as my food processor attempting (& failing) to grind coffee beans. I was concerned that I’d need to measure the amount of beans necessary for ‘x’ amount of cups but the machine does that automatically. Just pour in the beans, set the texture then select cups of coffee desired and press start. Easy peasy!",
        "I originally purchased one in May 2010 and was super happy with it. The grinder lasted exactly 8 years which is very respectful! When the unit burnt out (would turn on after pressing the button many times and then eventually wouldn't turn on again) I decided to get the exact same one, hoping it would last for years to come. However, the new unit was purchased in May 2018 and we're now in October and the unit just burnt out again. The same exact issue as the 8-year-old grinder, but this one lasted only a few months. So very disappointed, as I was hoping the quality would have gotten better instead of worse.",
        "I switched from a cheaper grinder that wasn’t specifically for coffee beans, and I can tell the difference in the way the beans are evenly ground, but this is sooo messy. There’s no way around it-taking the chamber where the grinds fall into, I end up with dust and grinds. It’s more is a hassle for me, I would not purchase again for that alone. But it does do what it says as far as a good grinder for the beans.",
        "This is our second Cuisinart DBM-8 grinder. We wore our the first one after a few years of consistent use. It does a uniform grind without leaving whole of half bits of bean behind. It is a bit noisy, but you are grinding beans so I don't think it's a big negative. The coffee dust is easily brushed out with a coffee brush. Can't beat the value. I wouldn't say it has airtight storage, but if you have to leave your ground coffee in the collection cup it keeps well enough until you can put it in an airtight container.",
        "Considering this grinder is only $40 it’s not a bad buy but the grind it produces is all over the board...on coarse I get fine and course chunks throughout which aren’t appealing when using a French press. The fine grind seems ok with just a few chunks in there. Update: I’ve used this for almost 1 1/2 years and it now sporadically will go over the amount I have set to grind, I usually use the 4 for French press which is about 5 scoops, sometimes it grinds the 6 which is around 8 scoops. I have used the warranty and am getting something better.",
        "I bought this in April of 2018; it's now September 2019. Long story short.. Its dead! Motor completely gave out. I know this isn't the most expensive grinder, but I'd expect a little more useful life. I liked it for the variability in grinding coarseness preferences, amounts and the timer. We didn't use this unit for what I call heavy use. We used it: 5-6 days/week to grind enough coffee to brew 7ish cups of coffee to have on the way to work. I'd expect A unit like this to last a little longer. personally I'd expect it to last 4-5 years at that usage rate. I don't think I'll be replacing it with this make and model.",
        "Perfect. Until I tried using for the third time! Would NOT start. Called Cuisinart for technical support. They had no ideas and said to send it back through Amazon. I HAD NO COFFEE TO BREW ONE MORNING. Fortunately a dear friend promptly brought me some before I had a complete breakdown. Very disappointed. It’s a perfect grinder- IF it worked!!",
        "This my second Cuisinart DBM-8 Suprime grinder...the first one (exact same make and model) lasted about 10 years and the burrs seem to be getting dull, but still works pretty good. I wanted to replace the burrs but there are no replacement parts available. It was a great grinder and bought a new one as a replacement. It has been only 14 months and the old one grinds better!!! Very disappointed...there is another “highly rated” hand grinder for about half as much I will try.",
        "I got this grinder to go with my semi automatic Delonghi Espresso machine. I'm new to home espresso making, and just wanted a simple burr grinder so I can practice pulling shots. I was nervous to get this because of the mixed reviews, but so far I haven't had any issues. The grind is consistent all the way through, and I typically use it close to the finest setting. I havent seen any leakage or major static. So far, so good! It was a wonderful purchase for my needs, and affordable too. Most people think I paid much more than I did for this grinder!",
        "I read some reviews about coffee container being flimsy. I’m not sure what you guys are doing with yours, throwing them at animals maybe, but I have no complaints with mine. Grind consistency is just okay. This is because while 95% of the container is spot on but there’s always some residue with espresso like consistency. I expected this and sometimes I decide to use it for espresso or just toss the little that is not consistent.",
        "Negatives: • grind-hopper is a plastic that generates & retains a STATIC-charge!, making ground-coffee & chaff to STICK & CLING to the plastic hopper! •. Grind has vastly irratic gradual sizes within each grind! Irratic grind sizes (CONCISTENCY!) is NOT a CONCERN for the average coffee drinker.!!!. However, it is CRUCIAL for someone making Espressos!, where CONSISTENCY is CRUCIAL in CONTROLLING PRESSURE & EXTRACTION times.!!!. ie, this grinder is adequately SUFFICIENT & a DEPENDABLE choice for a drip-coffee-maker.!!!., But definitely NOT sufficient for the REQUIREMENTS of a Espresso maker.!!!.",
        "I've been grinding my own coffee for decades and noticed a flavor improvement in when I bought the Cuisinart burr grinder about eight months ago. It lets you select your grind, so you don't over-grind. It's convenient—don't have to hold your finger on the grind button, like my previous grinders. The ground coffee sits in a big easy-access receptacle, so I don't have to scoop around the grinder blades to retrieve it. A bit of grounds spillage is inevitable but can be minimized if one taps the receptacle lid before removing it. I purchased two of these for gifts and just bought myself a second one for my office.",
        "To preface this, I have another Cuisinart coffee/spice grinder which works well but grinds enough coffee for a few cups. I however grind a 12 oz bag every month for the month. This product does the job well. Pros - quick coffee grinding at your desirable size - easy cleaning - grinds ALOT of coffee Cons - a bit loud but not a problem for me - this specific product came used (it was supposed to be new, sigh) Other than that it does the job. Wish it was fully new but I guess not",
        "Happy with this purchase. I bought this for the coarse grind it provides as I do cold brew coffee. Some people commented that the noise level was unacceptable. Well, it's a coffee GRINDER so I'm not expecting a whisper. It does the job and it takes a minute...I can live with the noise. It cleans easily. I've only had mine a month but my mom is going on two years with hers. We both use ours about once a week.",
        "Unit did its job at first but always sounded as if it were cheaply made. 2-1/2 months later, the motor starts performing slower and eventually refused to even grind the beans while the grinder ran very sluggish. Now, it does not even power on. Not even gonna waste my time with tech support, I'm sure they won't offer any replacement after this amount of time from purchase. Personally, go find another grinder. Grinder looks sharp and like a good quality but didn't come close from this experience. I knew I should've returned it early before it actually gave up working. The JUNK that is made today!",
        "It grinds coffee, so I can’t complain. I used it on a semi-fine mode and it came out fairly consistent. This machine is loud (my wife will attest to the noise). I’m sure Somewhere in the instructions there is some warning about the noise level, or hearing protection required, but who needs instructions. Moving forward I’ll be grinding coffee in the garage.",
        "To be honest when I was buying it I didn't realize all the features on it. So if ur not fussy about ur coffee then this may not be the one for you. It has a couple of settings ... fine.. medium and course depending on how you plan to brew your coffee. You simply fill the top part with beans and click on roughly how many cups you want to grind for and voila it does the rest for you. I love it !!",
        "This grinder is legit. We absolutely love it. The only kicker is it’s pretty loud but, I mean, aren’t they all? Also it asked for an ‘easy to clean eating’ which I had to give a 3 because I have no idea one way or the other. I’ve literally never tried to take it apart to clean it (that’s probably gross... pretend you didn’t read that). But really.. we love this grinder. Definitely worth the price.",
        "If you don't like a messy kitchen, don't get this. Not sure if this is a 'feature' of all burr grinders, but the static build up with this grinder makes using it a messy proposition. Once ground, the coffee sticks to the lid and the removable grind box. Once you open the box coffee goes everywhere! It will leave your counters and shelves covered with coffee. I've even resorted to opening it over the sink to cut down of the mess a little. After two months I can't take it anymore and will be replacing this with blade grinder.",
        "This is my second Cuisinart grinder and I basically purchased it for parts. I altered my other one, so it would make a finer grind for my espresso machine and wanted to make sure to have spare parts if anything should happen to my first one. Oh yeah, and I am using the grind chamber, as I chipped the old one (it alone would have cost me almost half of a whole new grinder!). With the alteration it makes a perfect in-expensive alternative to way more expensive grinders needed to make fine espresso grind."
    ]
}