{
    "entity": "Levels",
    "text": [
        "If you want to be level or plumb look no further. Don't spend money on any other level on the market. These levels are the best in the industry. They have a good weight to them, solid construction, they dont flex and if you drop them they can handle it. Been using this brand for years and always will. A friend of mine was so impressed with mine he had me order him the same set. You would think they are made of gold when he get the 48 inch level out. He just grins. Great tool.",
        "Stabila levels are great. I set the new 48 inch level on my 72 inch stabila, that I've had for 12 years, to see how they matched up.... Dead on, exactly the same bubble at level... That says a lot considering the 72 inch rides in the bed of my truck(for 12 years) because it's too long to fit in the tool box... We'll worth the price.",
        "I saw the same thing in a local store for 30 dollars more, so for me it was a no brainer to get it here. The 18\" level is handy, as sometimes the 2 foot one is ever so slightly too long. These guys make good products . The old story is you get what you pay for. I got a cheaper digital level that stopped working after a few drops. If you need something for home, this might be overkill, but I use it for work and home and expect good tools to last a while.",
        "Well built level that will serve for years to come. Unlike other levels at the big box stores, where half of them show different readings on the top vs the bottom. Build quality then you are building green. Build cheap and you only feed the landfill. Stabila is a company that builds quality and hopefully they won't whore out their brand like most public companies do nowadays for a short term bump in stock prices.",
        "Item received in a timely manner. Levels finish is acceptable, don't appear to be bent. I don't find the packaging to be sufficient for the 48\" especially. Box arrived beat up, would have thought to see some kind of brace in there for $140 but nope. Anyway, Enjoy these levels already. Been using a Stanley 48\" and 24\" empire. I find the 16\" to be the sweet spot between 24\" and 12\", even sometimes my torpedo if I can fit it. Make sure you write your name in some sneaky spots for these ones.",
        "I've had many levels of the years, including high precision machinist levels. This set of Stabila levels replaces my old Craftsman levels... I should've done this years ago. These Stabila levels are so much nicer and a lot easier to read and spot on for accuracy having checked them against my digital level I can't wait to get the Stabila 78 inch.",
        "I've always thought these were overpriced, why would I spend that much on a level, who in their right mind buys these. Until I used one. I now have the 48\", 16\", and the 8\" torpedo level (with the rare earth magnets in the bottom; awesome!) Just don't come any better. The rubber grips and caps make handling them easy and safe, solidly built (a drop isn't going to take them out of business), the top and bottom are machined perfectly parallel, and the levels are, quite simply, dead accurate. Not much more to say.",
        "I purchased this because I require a level that is extremely accurate. I've had to replaced this level with another 48\" just like it. Now I don't 2 that are just not accurate. I have the case to keep them nice and from getting beat up. I plan to see if theres a place that can fix these.",
        "First time using stabila slowly swapping my dewalts and others out for stabila. My 2 foot dewalt vial started leaking now my air bubble is twice as big as it should be, so it’s going in trash. Next I’ll be trying out stabila electric levels.",
        "Great deal, yes there are cheaper levels. I once bought a nice looking fat max level from the store when my last Stabila was stolen from my truck. Started setting post for timber frame home when nothing was adding up, just a 1/4 out of plumb in 4’, no big deal if your a hack. Don’t be cheap, at least not on your level",
        "As a general contractor, I can judge the quality of a subcontractor typically with the tools that they equip themselves with. Poor quality tools, produce lesser quality work. Stabila produces the best quality levels out there; bar none. The construction of the tools is flawless, after years of use (and occasional abuse) they're still as accurate and flaw free as when I got them. The paint is extremely rugged, having zero dings or scratches as of yet. I use only Stabila levels, as do every other carpenter I work with. I would highly recommend this brand of level, specifically these box beam levels. They're a great tool that you'll have for life.",
        "Wife got these Stabila levels for Xmas... The levels are well constructed! Lightweight, cushioned grips and have a high gloss durable enamel paint finish. Rubber ends are removable. Time will tell on the levels performance as I have not used them yet, but judging that both levels showed the exact same reading on my hardwood floor (very very slight pitch to the left), that's a great start! Made in Germany.",
        "I couldn't find out which model these were but can confirm they are the 196 model. Levels are excellent quality and showed up in decent shape in Spite of the absolute terrible packaging. Zero padding way oversized box. Amz wouldn't allow feedback On this when I tried to open the link next to orders. Be warned, order third party shipping from reputable company and hopefully have better luck, esp on the more pricy electronic levels. TriState was the seller, not sure if tristate sends them that way or someone who sends them out has zero common sense. Either way someone needs to wake the up.",
        "Unfortunately i cannot speak to accuracy as I'm building in cold weather outside and haven't taken time to check that out - but if I discover they are not accurate, the package says they will be replaced if not damaged. That top read bubble is indispensable on things like laying waste pipe in a trench and setting posts straight. They both are very easy to read, well designed ergonomically, very well built, and have a great warranty. They cost more than others but should be well worth it over the years.",
        "These are very basic but accurate and nice levels. They’re on the expensive side but that’s what you have to do to get this level of quality. Happy customer.",
        "Been working over twenty five years, I tried lots of brand (Stanley,Milwaukee,etc...) none come closer to stabila I have levels for over 10 years and they still rocking",
        "I have had mine for 4 yrs now, purchased the 48\" and 16\" combo, Im in commercial construction and use these everyday, they are stored inside the truck with no sunlight getting to them. Now all my vials are clear instead of green so its making it hard to read, yes Im getting old. I own 4 Stabila levels and all of the levels have this problem.",
        "Finally a reliable level. Great purchase. Worth the money to be confident in performance",
        "The best levels you can buy, proven time and time again",
        "Our box was delivered to our front porch EMPTY. Husband disappointed, but Amazon was good about refunding. The box was very long and the end was torn, so the levels must have fallen out. Some driver somewhere is happy because they look like nice levels.",
        "Great levels. Needed to replace a Johnson level that had lost its accuracy so decided to buy once and cry once so to speak. They read dead accurate right out of the box.",
        "Very well made. Seems like they should last forever if I don't drop them off a ladder. The 16\" is great for framing bulkheads and working in tight spots. The 48\" is perfect for general framing. The bubbles are easy to read and yield consistent results in any orientation. It seems like you can get cheap levels or ones in this range, but nothing in the middle. I hate to spend so much, but these appear to be worth the extra money.",
        "My dad needed these for work and he really likes the quality",
        "Awesome levels. Best in the business. The most visible bubble vials I've ever seen. It has the feel of a quality product and I've used a lot of levels in the 30+ years I've had in the industry.",
        "Best, toughest level youll ever purchase. Ive got a 12+ year old 4 footer thats still tried and true.",
        "Hello?!? Can you not see? They’re made by Stabila. Finally, I can build a house that’s level. They are awesome!",
        "Expensive but well worth it. Best levels on the market",
        "Great levels at a great price! Stabila is by far the highest quality level on the market! Very easy to read and use the levels!! If you want years of service from a level, buy this one!!",
        "Did a lot of reading before choosing these levels. Apparently you can't go wrong with Stabila. I was not disappointed. Easy to read and accurate.",
        "Got them for my husband so I don't really know about this things. he owns his construction company, he buys the best thing and most efficient tools.. he loved them and said their great!",
        "Owned this same series years ago. These are the same high quality as before. Very pleased.",
        "Quality levels! I am a mason and prefer these levels over wood levels because they are lighter and tougher. The Seattle area is pretty wet sometimes and these levels hold up perfect in the weather no oiling all the time like the wood levels.",
        "If you have Stabila Levels you know they are the best. This new set from Stabila is even better. This is the new frame design and it has a frame about 1/4\" wider than the regular frame. The hand holes are really nice, comfortable in your hand. The end caps are nicer, removable and are rubber. It also has a metal hang hole so you can hang this nice level on a nail rather than lean it against the wall for the painter to kick over. I have this set, and I didn't think Stabila could make a better level than the ones I already have, but this new series is better than the best!",
        "It's Stabila.....they work great. Some complain they are too sensitive. I do not find that to be true.",
        "Finally bought a set of nice levels. These are the nicest I've owned. They do make a difference.",
        "Arrived with damage on the 48 inch level which was also missing one of the removable rubber end-caps. Both were returned.",
        "Love the removable edge guards. I first used them on a floating wenge desk and they performed great. This is a good starter pack as both sizes are very useful.",
        "Seem well built and very accurate like them a lot.",
        "Now there's no doubt! If these levels say it's level, it's level. There may be other levels that are good but with Stabilla you know it's good. They are expensive but you want it level.....just take good care of them.",
        "Been using Stabila for 25 plus years. Lost my first one. I do take care of my tools. Hence, my first one lasted 25. Tried a Fat Max 48\" was out of level within 2 months. With levels and alot of other tools, you get what you pay for.",
        "Hey nobody’s perfect. But why in the world does Amazon add padding when I order a pillow. But when I order $100 levels, they’re just rattling around in the box.",
        "This level set is just a great, high-quality product at a reasonable price. I did try using the level on all sides to see if the bubble remained constant and it certainly did. I can't say the same for other levels that I have. I wish the 16\" was a 24\" level but I'm sure I'll find many uses just the same.",
        "Very professional and accurate, don't ever go on a job with a cheap level, that's a good way to make yourself look like an amateur.",
        "Best levels on the market in my opinion. Very high quality products.",
        "Wow! These are nice! As you would expect for the money.",
        "I thought these were a package deal for the newer Stabila levels. I had liked the tubular box-frame features of the updated levels. While these were not them, they work great. They are solid feeling and they can be read from the top. The were replacements for my old aluminum long level and plastic short level. Stabila has a reputation for quality levels, and I expect these to meet that reputation. I like the cushioned handholds that I would not have gotten with the Stabila beam level; they have an added feature that provides a hooking point. That was the main reason that I didn't return them.",
        "Quality look, feel and function. Totally happy with it Expensive, though.",
        "Purchased this as a gift for our son in law for his construction work. He loves them for the accuracy to the durability of the product.",
        "Best levels on the market right now! The upcoming Milwaukee levels look pretty sweet as well though.",
        "As good as it gets, level and easy to hold work with. Lightweight but durable.",
        "These are great levels. They are perfectly accurate and two sizes are very handy to have. I would highly recommend these to anyone who uses levels.",
        "It's a Stabila what more do you need to know. It was time to retire my 30 year old wooden 4' level. It served me well, and I sure this one will last me just as long.",
        "Great levels stabila is the only level I trust to be accurate and stay accurate, the deal I got from amazon saved me almost 50% couldn't be more satisfied with my purchase.",
        "Nice levels, however one of the vials on the 48 inch is off. Stabila usually has their stuff together....",
        "No better levels than Stabila, and you cant beat this price for two. Just was dissatisfied with the shipping time it took to get to me. Other than that, you cant beat Stabila/this combo deal",
        "Stabilas are the best and even more convenient when you have all of the different sizes.",
        "Best level for a mason, hands down!! Virtually indestructible. Still have an old one and its still accurate after 10 yrs.",
        "STABILA LEVELS ARE MADE IN GERMANY. THESE LEVELS ARE HIGH QUALITY. THESE LEVELS ARE VERY ACCURATE. THESE LEVELS ARE VERY RELIABLE.",
        "I have used stabila levels for years and when my old set where stolen there was no Question I would be buying stabila again. But I was surprised at how much the price had went up in the 15 years since I bought the old version of this set the 48' alone was over 100.00 locally so you can imagine how delighted I was i find this set for the price it was.",
        "If ur serious about ur work this is the only level to own",
        "The levels themselves are stabila (the best). The packaging for shipping wasn’t good enough to ship a $10 level in but the product is a 5/5",
        "When only the best will do. Super accurate, I checked it against a water level and it's dead nuts on. Thank You.",
        "On the advice of a carpenter friend, I upgraded from my cheap $8 level to a professional model. No regrets at all except for not doing it sooner. These are very nice.",
        "The Bentley of Levels. If you make your living in the construction industry you can't go wrong with a Stabila level.",
        "Stabila-What more needs said, By far the best and most accurate a carpenter or any craft worker can get. Worth buying the strorage case for.",
        "Stabila makes excellent products that are precision made. If you want the best in tools, Stabila has it. Great buy.",
        "They sure aren't cheap, but they're great equipment and you'll use them for the rest of your life. I've used mine to check my table saw and miter saw tables, and even as a straight edge. Good stuff.",
        "IF you know levels, you know Stabila. These were of the same quality as all of my previous Stabila levels. Good buy.",
        "Use them nearly every day. The little 12\" is coming in real handy",
        "They are the best levels to have. I love them.",
        "Really nicely build and good feeling tools. Easy to handle and dead on accurate.",
        "These things are the real deal. The craftsmanship and quality are amazing. If you want the absolute best go for these.",
        "This is a top quality product for mid price range.",
        "Yes, stabila levels are twice as much as the others. However, since they are guaranteed to remain true for life, it seems that they are cheaper in the long run than the other levels I'll have to replace eventually.",
        "Excellent level. Had been using a 40 yr. old level and after checking it's accuracy, could not believe how far off it was. The Stabila 48 and 16 were dead on. Since then purchased a 24 also.",
        "These two seem very well made and hopefully will be long lasting. Nice casing, seems very sturdy. A case would be nice.",
        "If you want the best - here it is. Worth every penny. Used it to help level ground for pool.",
        "Excellent, but of course it's a Stabila and the top choice for professionals who value quality and precision and accuracy in their contracting business. Solid extruded frame. Easy to read vials. Worth every dollar.",
        "Items were as described. Took a week for shipping but looking forward to putting them to use...",
        "In my trade I have used just about every brand of level, most start out accurate, but as time goes by the bubbles change, these levels are guaranteed to stay accurate. So far so good.",
        "The best level made in this price range. Awesome warranty!",
        "My step up to quality grade level has not disappointed. Best price I found, packaging and delivery were good, now it is up to me to take care of them.",
        "great precision level. 16 inch is perfect for some jobs.",
        "This is exactly what my husband needed. Very pleased. I got exactly what I saw.",
        "can't go wrong with stabila: quality of levels is great, plus a lifetime replacement warranty if they ever fail to stay true! amazon offered these at a terrific price, and with prices of other brands creeping up, this was a no-brainer;",
        "I have had quite a few of these levels for 20+ years and they have all been great. They have been dropped, thrown in the truck and actually abused. Always perfect. After all these years the vial liquid is turning clear and is getting hard to see. Not to mention they are looking quite beat up so I decided to update. Perfect right out of the box. thanks",
        "I love this set. Separates the boys from the men!! Local 3 Boston!!",
        "Arrived on time. These are quality levels. I bought them because I know they are top of the range. I use them daily and need them to be reliable. And as expected they they did not disappoint.",
        "damage the drop have spare. is a level of 48 \"",
        "Bought this for my husband whose a concrete mason with 12+ years of exp. and he says it's that BEST level he's ever had!! Recieved it 2 days after ordering!",
        "My limited use of the Stablia since my purchase has been as advertised plus.",
        "Items arrived as expected, and are of high quality. I have recommended this set to friends, will add other stabila products as needed.",
        "Best level I've ever owned.Don't waist your time with anything less this German made masterpiece. The craftsmanship is excelent. Very resonable price too. Don't forget the carrying case to go with it.",
        "my husband was very happy with this purchase,it is a very strong level for mason work, great value for price i payed",
        "Great product. Very happy with it! Order arrived very quickly and in perfect condition.",
        "With tools, as with most things, you get what you pay for. You can buy much cheaper levels, and that's exactly what you'll get, a cheap level. Less reliable, less durable, and you'll almost certainly be buying another in a year or two when the vials fail or move in the frame, making plumb and level a time consuming guessing game. Stabila levels are tough. Take reasonable care in the use and storage of a Stabila level, and you'll be handing it down to your grandchildren. Simply put, the best there is.",
        "Iam very pleased with both the levels and AMAZON'S SERVICE. THANK YOU!",
        "Levels are great everything I expected them to be would buy again they arrived quickly and as they should have packaging was more than adequate.",
        "From the weekend warrior to the seasoned professional these levels are a step above the rest for all your home building and renovating needs. Quality + precision craftsmanship = STABILA: dead on balls accurate.",
        "I use these for work (Journeyman Carpenter) and they are excellent in quality and accuracy. They also have a good weight ratio."
    ]
}