{
    "entity": "Levels",
    "text": [
        "A better level isn't much more expensive. This one does the trick but feels cheap, have to tap a few times to get the bubble to react sometimes, and the hash marks aren't very crisply painted on the ruler edge. Feels plastic. Wish I had spent a little more and gotten something that feels sturdier, has crisp measurements, and lasts forever.",
        "For the price this is fine. An end cap was missing when it arrived and it's definitely for occasional home use. I broke my rule for trying to buy high quality tools whenever possible and this purchase reminded me why I do it.",
        "l just used this thing all weekend to hang a bunch of pictures and other items on our walls, and I couldn't be happier. It has a measurement scale (both inches and centimeters) and three different water levels (90°, 180° and 45°). It's extremely light and well-balanced, so it doesn't stop you from holding or using other tools (e.g pencil, hammer, etc...)",
        "It's a Stanley i-Beam level, hard to go wrong with Stanley and really how can you screw up an I-Beam level? We'll Stanley definitely didn't with this product and with the addition of an adjustable angle measurement feature I'm exceedingly happy with this purchase. I highly recommend for any one in the market for a new level.",
        "It works okay as a level, but the scale on the side is deceptive. The zero point is not at the edge of the black bumper, so it's easy to make a mistake in your measurements.",
        "This is a great little level for small projects. Lightweight, accurate easy to make out the bubble without too much of an air gap. Well-made and worth the money.",
        "I have 4 levels and this is the best one and probably the cheapest too. Buy it, you won't be disappointed! It is very accurate. The lines are exactly on either side of the bubble, so no worries that you are off. I also like how it has a window to view the level from the top of the level, not just the sides. It's my favorite level of them all. In fact, I have been putting this level on top of my longer levels to get a more accurate view. I am very pleased with the value, function, and shipping speed. A+++",
        "It's a level. Not much more I can say. I like that it's lightweight. I would imagine it's accurate because I trust the brand.",
        "Purchased for my daughter as she recently purchased a home and needed some basic tools for little home projects. It does what it is suppose to but it does seem a little less durable than other 24\" levels that I have in my garage. However for the $ it is a good inexpensive level.",
        "Beefier than I expected. However, while dialing in the adjustable level to 0 degrees, the bubble in the fixed horizontal level and the bubble in the adjustable level did not match. A bit strange.",
        "Looks pretty heavy duty for the price. I used it as soon as I got it and it worked well. Would definitely recommend this to others.",
        "My local store does not sell a leveler with a ruler. This is just what I need at a good price.",
        "Simply does what a 2 foot level should do. Good quality and it is accurate.",
        "As with my framing squares, my 24” level has been abused over the years. I like this level and it’s color makes it easy to locate across the room. Also the easy to see measurements make life a little easier.",
        "Great Product as expected with the name \"Stanley\" on it. I highly recommend it.",
        "Overall good level. Only problem I see with it is the measurements on top are not correct unless you take off the black end piece, which seems like an oversight to me. The dimensions should account for that piece. But I didnt buy it for measuring distances, so not a huge deal for me.",
        "Good value use often and last one lasted years before I ruined it doing tile.",
        "This level was not level. I found out the hard way when building a fence. Compared it to my old level, and string level - and the bubble is slightly mis-aligned from the housing. Don't waste your money. Luckily Amazon as usual was great about taking it back.",
        "Bought this to mount a new flat panel television on a wall mount. This beam level made it easy to tell when the mount was level. This is the level of quality I've come to expect from Stanley tools over the last 40 years.",
        "so easy...even a girl can use it! This is my favorite household tool...hanging pictures on the wall was so hard without a helper, but now with this, I can do everything on my own!",
        "Sturdy, well built, reliable, good measurement markings. I have made so much more use of this level than I initially bought it for - to mount tv's. It's a good length too - if you're level is too short it will not be accurate. I've dropped it a few times and it's barely scuffed. Just a solidly built tool that is essential if you're into home projects like me - highly recommended.",
        "This is a professional level, at a hobbiest price. It's nice that it also has the ruler on one side. It's a good quality level, with a great color.",
        "It's big, sturdy, straight and accurate at leveling. It does not feel cheap or bend easy. I bought it for my girlfriend to put up picture frames, floating shelves, and various hooks around the house. It kept her busy enough so I can play video games. Thanks Stanley!",
        "A very reasonably priced tool. This thing isn't the quality of a Stabila but it certainly isn't priced like one either. Very light weight, but it's metal so more durable than plastic. The ruler is handy too since it can be used as a straight edge. Perfect medium sized level for a homeowner or DIY type. Made in Thailand.",
        "not a precise level. 4/5 of the levels I received are off level out of the box. even the level lines are blurred and thick, not thin and precise like the fatmax line. pay up for hte fatmax box level, it's worth it.",
        "It does what it needs to do and well. It is light enough to be lain on top of a picture frame to tell if it is level without damaging it or the wall. I don't have much to say about this, but it's a good product.",
        "The 3rd level is adjustable, you don't think you'd be hanging stuff at 45 degrees very often but it actually comes in handy as a redundant level. You can put your hand right over the other if you have to and still see what you need, plus then you're double sure it's even.",
        "All the reviews about this item not being calibrated correctly are true . It does not read level . It was cheap enough I took a chance on getting a good one . I did not . However , Amazon return and refund are unbeatable .",
        "No more arguing with my girlfriend on whether or not pictures are level. Now the level decides who is right.",
        "Very light, not nearly as sturdy as my old Stanley The adjustable dial seems cool, but doesn't seem accurate enough. The vials are pretty unclear after sitting in my truck for only a few months.",
        "I dropped it on the concrete floor twice from my ladder and nothing broke.",
        "Stanley - made in Thailand, but oh well it still works ok.",
        "great piece for my deck. I also have the bigger and smaller sizes.",
        "Seems like a good sturdy level. Exactly what I was needing. It seems like the end caps may mess up the built in ruler though. Not really a deal breaker though.",
        "It's a level that levels as expected, so it's hard to complain too much. It's lightweight, but I'm not sure it would stand up to serious abuse. Probably not a wise purchase for professional, job-site use. One star off because I do not consider the printed on ruler to be very reliable.",
        "The center bubble in mine is too large making the product defective and unusable. I realized too late, after buying this and not using right away. only to surpass the ability to return it through amazon.",
        "This is smaller than what the contractors use but perfect for home repairs.",
        "It's a leveler it works as intended and has a cool swivel level for angles",
        "I’m totally turned onto these now. My coworkers told me about this and I decided to invest in one. House hold tasks are forever improved.",
        "Great level. I like 180-degree rotating view option as well as how light but durable it is.",
        "Purchased this to become part of my household tool kit. It has both standard and metric units to help with measuring, so it doubles as a ruler and a straight edge. It's lightweight, so perfect around the house. If you are looking for a basic level for your home projects, this is a great choice.",
        "just as advertised. works great in helping level my camping trailer",
        "Dissapointed with the quality. Really flimsy and the plastic seems cheap. Also it is mission one of the end caps.",
        "Was great for my purpose. So far used to install three Elfa closets",
        "I didn't look at the size of this leveler when I bought this. It is quite big, but it does it's job. I'm actually glad I bought this size, because the size actually makes it easier to hold when measuring and makes it harder for me to accidentally lose it!",
        "always happy to see Stanley quality help me with projects around the house (this helped me hang a few large mirrors)",
        "nothing much to say other than great level and a good price!",
        "I use it all the time- it's sturdy and made well.",
        "Nice 24 inch level. I bought it because you can view the middle level bubble from the top. My previous level did not have a cutout. The tilt bubble is a nice bonus feature. Having a ruler marked off is also a plus.",
        "Way better than my old level that had a large groove in the bottom. This level is flat on both sides, and gives me different bubble readings. The bubble on the right lost its juice, but I never used that one anyway. Great level (or leveler) for the price....",
        "Have used this extensively for multiple projects. Has survived several falls and still holds a perfect bubble.",
        "Does the job. Straight. Very convenient as a straight edge/ruler too.",
        "Markings are only on one side and it doesn't factor in the additional length of the black end caps.",
        "Kind of ridiculously huge for my needs. I really need to start reading the comments and measuring before I buy. It seems like a pretty solid leveler and well made though, I'm sure someone working on bigger projects will get much use out of this.",
        "Item was delivered faster than expected but was missing a black protective end piece which led me to scrapping my hand when pulling out of box because it got stuck when removing.",
        "I typically prefer old-style tools-metal and wood. I was timid to buy this plastic level but it's not bad. The adjustable angle works better than I expected.",
        "Great item to have around the house, the length has come in handy... and been a hinderence as well, so may need a smaller one for other projects. No flaws in this unit though.",
        "Certainly not close to that expected of Master Carpenters,but just fine for framework and other trades where super-tight tolerances are not needed. A good deal for such or do-it-yourselfers.",
        "Not much to say about this other than it's well made and very functional. The level works perfectly and I love the fact that it has ruler markings on the top as well. Great buy, well made, very accurate.",
        "I am not a construction professional by any means but I have been satisfied with this product. It looks good, has been useful for projects around the house, and was a reasonable price.",
        "Not much to say here but it's a level that works. Has been very accurate so far and the angular aspect of it help a lot as well. I just hung a bunch of things at a 45 degree angle, all look perfect. If your looking for a level around this size, your not going to do any better for the price then this one.",
        "A nice affordable level for the beginner or entry level do-it-your-selfer. Basic level with vertical, horizontal and rotating leveling bubbles. Lightweight and easy to read. Basic functional level.",
        "Does the job. Seems accurate. It's a bit long for me but that's not its fault. Made well, strong and the bar is level. How can you go wrong. One of those how can you review it unless your a carpenter or at the very least a home do it yourself guy, I'm neither.",
        "Been using this for basic household projects. It works great and is made well!",
        "Love this thing. Was hesitant to buy it, thinking my little 12in level was enough, but it turns out, size matters. Bigger is better. This thing rocks. 24in of pure leveling heaven.",
        "Great value, great little level. We use it for shelves and pictures. Works fantastic.",
        "Only thing I wish I could change about this level is there are no measurements, but i took an old cloth measure and cut off the length needed and glued it on. Level is lightweight, I had two old magnet strips that I ended up putting on the edges so I could attach it to my ladder as I have high ceilings and hauling stuff up can be a pain.",
        "I bought two of these levels to give to my sons for Christmas along with a tool set. They've both used it and it does what it's supposed to do. Light but strong and easy to see the bubble.",
        "Well built and perfect for our needs for hanging different pictures around the house. The adjustable level feature is also great for leveling items not the the traditional 0, 45, or 90 degrees! Highly recommended !",
        "Twice I received a level with the same problem- missing end cap. Poor quality control.",
        "every home should have a level right? I researched and decided on this one, I really like all the angles you can use and the length perfect for hanging pictures.",
        "Bought this as a gift for my brother who was just building his tool set. Seems to be a sturdy product that will get the job done.",
        "Purchased for ceramic tile install and worked as intended. Plan to use for many other projects around the house.",
        "great to have around the house...you always need one especially if you hang artwork",
        "Totally worked. You can adjust one of the levels to a particular angle too. Haven't tried to calibrate it yet, but it seems legit.",
        "Delivered on time. Works perfect. Will buy again. Totally recommended.",
        "Great build quality. I'm pretty sure you can bash this thing up against a wall or throw it into the bed of a truck for a while with no major concerns. It does exactly as it needs to do (level things). It comes in the distinct Stanley yellow. Not much else to say about it.",
        "Great product, works perfectly and well made. Excellent price, would recommend if you need a good level.",
        "Works well, very solidly built. I was able to use it to help hang up my 5-piece painting. Great tool to have around the house.",
        "This is a decent level for the price. For some reason I thought it was longer, this is a tad short but it works good. The level is accurate. I had my father who is bricklayer test it for me. For the price, then is a nice little steal",
        "it's cheap, served its purpose, easy to read and durable. I bought this so my wall frames and decor would be attached to the wall correctly and im satisfied with my purchase.",
        "Awesome level that is the perfect size. It's convenient to have the ruler on the side as well. Everyone is jealous of my shiny level.",
        "not much to say, its a level. one nice thing about it that i wasn't expecting when i got it was that the level inside can rotate to allow measuring angles, nice unexpected feature. feels sturdy and for the price an excellent buy",
        "I'm pretty impressed with how nice this level is for just $7 to my door. Would buy again, and highly recommend. Heavy duty and well designed.",
        "always nice to have a level of some kind in the house, this was nice and inexpensive and well calibrated.",
        "As advertised and expected. I like the ruler scale on top and the adjustable angle bubble vial. And I didn't see this one locally.",
        "This is just another level added to several of different sizes I own or inherited. This one is light weight so I find myself using more for a straight edge and secondarily, for a level. The bubbles are easy to read and the ruler on one side comes in handy.",
        "Ruler is not edge to edge. So cannot really measure 2'",
        "Framed in a door and used this with the 48-inch version and it's square, flush, and looks professional. I dropped this guy at least three times and the floor has a dent but the level still looks new.",
        "This is value ++. Love this level for the price. Be careful with handling but it has everything on it to get your work projects square and plumb..",
        "Very accurate and well built. What more do we want?",
        "Good product, nice price and adequate for my purposes. Good for routine household use but not for the professional I think. Would recommend to any homeowner.",
        "Arrived on time and looks and works great. I purchased with carrying case for a gift. Thanks, Jackie Lynn Campbell.",
        "It does what a level does. It's a good length, easy to read, and the ruler on the side is a nice touch.",
        "It's a level.. Very helpful in that you can adjust the leveling bubbles to varying degrees",
        "Because of the black end things you can't put the end against the wall and then use the ruler. I did just remove the black end next to the 1\" maker and now it works fine. The level is level and it is very sturdy. I like the level that rotates.",
        "Its a 2 ft. level how can I not give it a 5 star rating. The price is good the level is rugged and it works just like it should, buy it if you need a 2 ft level.",
        "I leveled my level to make sure it was level, and this level is level.",
        "This is a great level (especially for the price)! If it is out of level for some reason, it can be easily adjusted to perfection again!",
        "Not accurate..Waste of time and money.. Just buy a good one and done!"
    ]
}