{
    "entity": "Contact Grills",
    "text": [
        "I just got this in time for Thanksgiving. 30 minutes on sear/5(after pre heat) and I can't get a piece of bread to turn brown. I am sick and devastated. I can touch it, the grill surface . As a test run I put a poblano pepper on there. An hour, and it still isn't ready to be skinned.!!!!!!! And IDK if it's the mail place I have to get my mail from or what, but the package came open.. I am so disappointed. This is the 8 seving inside grill. When buying it you have to read through multiple reviews and instructions that are obviously from their higher end models. So mad right now",
        "Just like every other indoor grill I have ever bought, this one does not get hot enough to create any sear on meats. It can take forever to cook foods as well. I use the lid from my electric skillet to help contain the heat and cook things faster. Would not buy this product again.",
        "This is exactly what I wanted with living in a condominium, I really don’t want to use the grill provided by the association. During this time . So with that i bought this on a whim . It’s so easy to set up . Starts off low heat and then I turned it hire . Works great with thin hamburgers and other items Easy to clean no mess ! Dump and go , tip when cleaning it when it’s hot a spray bottled water On it and used a towel Excellent heat and grill marks",
        "Had this grill many moons ago and wore it out. Was searching for something on Amazon and Hamilton grill popped up as a recommended item. Purchased immediately and so glad I did. The only item I would change is the control nob, there is no setting for 'Off\" so once the grill is plugged in it starts heating up.",
        "Love this, burger were great. Just as good as as a gas grill. Going to try chicken next.",
        "Doesnt heat up well enough. Preheated it for half an hour then put porkchop on your the grill then changed the setting to 3 since pork rib is a bit. Waited 40 minutes, pork chop is still raw inside. I wish I could return but hubby already disposed of the box. Now im stuck with it",
        "maybe it's because I'm over 70 but, the numbers on the temp control are almost impossible to see. I decided to use nail polish, red for the high temp and green for the min temp.",
        "Easy to cook, does not splatter grease on counter and food tastes great. Very easy to clean. Only con is I Wish it got hotter because food takes longer to cook than it says.",
        "I’ve been looking for a smokeless indoor grill for while and this is almost perfect. Easy to setup and clean up. It smokes a little but still way better than stove or bbq grill. Can’t beat the price.",
        "WHAT A GREAT GRILL. HAD A BBQ IN MY KITCHEN. I WISH THE CORD WAS A BIT LONGER THOUGH. GREAT CLEAN UP TOO!!",
        "I ordered this item on Sunday June 21, 2020 - it was delivered to my door on Wednesday June 24th. So excited to get and use it. I heard so many good things about the Smokeless Grill. I cook skin off chicken thighs today. It was tender, juicy and mouth watering. Happy I purchased. Money well spent.",
        "We bought this grill after a friend used it when we were over for dinner. It is slower than a charcoal/gas grill, but really does a fine job on the food. It is large enough for 4 nice-sized steaks, but not so large as to be difficult to handle/store. The grills went right into the dishwasher, unrinsed, and came out clean as a whistle. When the weather is nice, we plug it in outside on the porch. Otherwise, I just use it on the kitchen counter. Just be a little bit patient, and you will get the hang of cooking times (as opposed to a regular outdoor grill).",
        "Easy to clean in sink, lightweight, and works great for me",
        "the base is made of thin plastic. Basic china crap. If you want a grill that lasts 6 months get this one.",
        "It takes entirely too long for the food to cook. I had to put the food on the stove to finish cooking because it was still raw after about 20 mins.",
        "This grill has been awesome so far even though the package was crushed when I received it. The item itself was not damaged and has worked perfectly.",
        "This grill still smokes, not completely smokeless. Easy to clean, beats taking out a pan and cooking and making dishes.",
        "Absolutely love it! Was a gift for the hubs and he uses it at least once a week, he’s super happy with it!",
        "This was a gift for my retired parents, mom in particular. She loves to cook outside on the grill but recently due to poor health she hasn't been able to. she Loves this indoor grill. It cooks quick and is a breeze to clean up. She tell's all her friends and family to buy one.",
        "Well made & easy cleanup! I tried steaks on the grill & it seared them as advertised & the steaks came out perfect! #MedWell",
        "It does clean easily and warm easily but takes forever to cook things as thoroughly as i think they should be.",
        "I love cooking with it. Clean up is a breeze.",
        "high quality water and electric power grill and very easy to clean WONDERFUL",
        "I had one years ago. I love the it grills veggie and seafood",
        "Too big and too heavy for my tiny kitchen. A bitch to clean, but cooks very well. Wish they made a smaller version",
        "I wanted a dishwasher safe indoor grill. this was advertised to be sol I only called the Hamilton Beach Company to ask if it mattered which shelf of the dishwasher to use. The representative told me neither piece could go in the dishwasher!When I said that even the manual said it could, she replied that the manual was for ALL their indoor grills, (more or less a generic manual), and that this one could not go in the dishwasher. It is of no use to me, and I returned it.",
        "For what this is it works great, we cook hamburgers on it fairly regularly for a family of 3. What no one tells you is that you need to put water in the base to catch any drippings so they won’t splatter, and won’t melt the base. The instructions explain this.",
        "The grill is simple to use but we made kebabs with it the first time and we found that it’s taking 45-55 minutes to actually cook the kebabs. This grill might be fine for grilling non meat dishes but my recommendation is to spend a little more money and get a better grill.",
        "Works very well and cleans easy. We bought it because they have a fire ban at our property so this way we can still cook out doors when we want. It cooks just fine and does not smoke much at all. I would recommend it.",
        "Caught this on a last minute 1/2 price sale. Sent it out as a gift along with some liquid smoke. They absolutely love it. Prefect for indoor grilling without the smoke.",
        "I have a small apartment and this grill works out great for my kitchen. I do keep the vent going while using but it worked great.",
        "Short plug if you’re trying to use outside forget it Not that easy to clean in a small space I use the outside hose",
        "Like everything,not much to dislike,except wish it had a flatiron grill top to interchange with the grill.",
        "Love it !! Super to cook on and clean up is quick and easy !",
        "First this indoor grill is amazing. Pros Easy to clean Heats up fast Shuts off when it gets too hot Fits dishwasher rack Meat kept it’s flavor (korean bbq) Well packaged Various settings of heat Portable Cons Nothing about the product but i guess instead of smokeless indoor grill it should be less smoke grill.",
        "Absolutely love this indoor grill. The steaks turned out perfect.",
        "This is perfect for times when you don't want to or can't fire up the outdoor grill or don't own one. I put the grill on the stovetop, so I can use the exhaust fan. It produces great hamburgers and hot dogs. And it could not be any easier to clean. Both pieces can go in the dishwasher, but thanks to the non-stick surface, they are very easy to wash up in the sink, too.",
        "Kitchen remodel going on over here so needed appliances that I could cook with instead of a range or oven. This is practical and efficient. Easy to clean. Heats and cooks great. LIFE SAVER RIGHT NOW!",
        "Just got this product. Easy clean up.Lightweight.I've never had an indoor grill before; so it is hard to compare. Cooks with less heat than outside grill - slower.Saving 5 rating for more use.",
        "This is a great product. I rarely use my gas fired grill anymore. It's very easy to clean as well. Several of my friends purchased them and they love them as well. I have not had a problem with insufficient heat as reported elsewhere. The adjustable heat control works fine. All in all we are very satisfied with this grill.",
        "Spend your money on another grill. It does not get very hot! It takes forever to cook.",
        "Have been watching this grill since it was higher priced. Bought at $29.99. Out of box ,very basic unit but when placed on counter, wobbled. One leg cover missing! HB 800# shut down, so I called Amazon. Rep Alexa was very helpful and resolved my problem. Using the grill, I would advise to put it under an exhaust as it is NOT smokeless esp. when used at 450 degrees. Steak had beautiful sear/grid marks; clean up easy. Gets the job done...",
        "I put this grill on my patio and set it to the highest temp (450*) to grill some eggplant slices I’d already marinated. It was a hot day and I expected to have these cooked and inside the cool house in no time. Instead, they were dried out from the sun on the top before the bottom was even cooked! I’d hate to try cooking chicken on this. Very dissapointed and ended up cooking my steaks under the broiler instead. This would be good to grill hot dogs I suppose but I wouldn’t recommend it for anything else. Two stars because it was easy to clean.",
        "Great for a quick an easy set up to make yourself a burger or a brat. Plenty of space on the grill for cooking your family a meal. This is great for the people that don't want to go out in the hot summer sun and cook, but want the great tasting flavor a bbq. The grill has plenty of heat settings and is easy to set up, clean up and store in your kitchen. I like it because in the winter months I will be using it to still get the bbq taste in, without having to go out in the cold. Great for parties too.",
        "Hamilton Beach 31605N Indoor/Outdoor Grill is the perfect accessory for the kitchen. If you have electricity in the backyard I guess it could be outdoor but I use it indoors. Sometimes you don't want to use the stove to make one dish and this is a great way to do it. It is versatile and can accommodate 1 dish up to about 4 dishes. It heats up fairly quickly and maintains a steady temperature. Temperature gauge is not really necessary since it is a grill and not an oven. Definitely 5 stars. I love it.",
        "works great and breaks down easily for cleaning. did a great job on our chicken, corn, and veggies!"
    ]
}