{
    "entity": "Contact Grills",
    "text": [
        "\"Perfecto,\" or \"Perfect,\" aptly describes this appliance. I can't think of anything I would change! Cleanup is a snap. Lid keeps any smoke from going throughout the kitchen. Sturdy base. Solid. Uses a standard two-prong plug. For my first attempt, I grilled a Ribeye steak (check out the sear marks!) and some asparagus tips (season with olive oil and salt). Added some water to drip tray to prevent burning/smoking. Note: The fastener for the glass lid handle is \"hidden' in the cardboard/carton packaging. You have to look for it.",
        "I had a horrible experience with this grill. The thermostat and grill continuously turns off and one while grilling. It took 1 1\\2 hr to complete the grilling of 6 🐔wings. I returned the grill & received a replacement grill. The same happened again. I missed the deadline to return the replacement, so now I am stuck with a grill that does not work.",
        "Received my new grill today and was excited to use it. This was a replacement for the West Bend grill I had used for a few years. It had been through the dishwasher so many times and was looking a bit sad. Decided I'd hand wash this new one for awhile. The cheap plastic end where the plug slides in broke in half being hand washed!! I might be able to super glue it back together, but this is the last Delonghi for me. I'd give it zero stars if I could and I'll stick with West Bend!",
        "We love to grill but are staying in a condo in Maryland that doesn't allow cooking on the patio. Ordered this grill and love love love it. Food grills up same as outdoor grill and it's super easy to clean up. My husband is the grill master and very skeptical at first but now is the indoor grill master. We grill most of our food, our fish, pork chops and chicken. We have made venison hamburgers, grilled wahoo and lots of chicken and it all looks and taste like it was done on an outdoor grill. Highly recommend this grill.",
        "I love this grill. I used it year round for grilling chicken and fish. We also grill fruit and veggies in it. It doesn’t smoke up the house and everything turns out perfect. We have always had a George Forman and our electric switch was always flipping off when we used the George foreman and the food was so dry. We have had this grill for almost a year now and it still works perfect. We use it weekly. Clean up is very easy I just wash it with a scrub daddy and everything comes right off without scratching anything.",
        "I think this product would be great for a college kid or possibly a younger person that doesn’t have high expectations for food texture, flavor or taste. This appliance isn’t for you if you prefer a good solid sear of the cast iron pan, or the smokey flavor and juicy texture of a charcoal or gas grilled piece of meat. This appliance will do what it’s designed to do- grill your food indoors- but it will be at the cost of flavor, texture and taste. I found some pieces to cook quicker than others and some pieces were cooked unevenly. I used it once, put it away and haven’t used it since. Wasted $78.00 in my opinion.",
        "Very very quick to heat, even heating across the entire surface and extremely easy to clean. I spray with non-stick cooking spray, then grill my chicken or steak, then pop the cooking surface into the dishwasher when cooled and she comes out clean each and every time. The lid is super helpful in containing spatter and helping to quicken cooking time. I like this better than my outdoor gas grill as the the food sits directly on the cooking surface and therefore cooks quicker. Very pleased with this grill. And the cooking surface is quite large, I can cook 4 large hamburgers at the same time without an issue.",
        "Great buy! The family loved the steaks. I ordered it in the morning and it came by 5pm same day! Simply amazing! Only reference is the book states 5 min each side. I did 8 minutes each side and 10 minutes in the oven to keep it warm while preparing sides. It was sooooi yummy! I earned big Fam points on this one!",
        "Wow wow wow... This little grill is amazing.!! This is exactly what I have been looking for. My George Forman grill drys the chicken out and the oven doesn't give it that grill taste and texture that I like. This product does the job. It's so quick and easy and the chicken comes out perfectly grilled and juicy. I rarely write review buy I had to write one for this product because it's exactly what I wanted. I food prep and this is perfect '",
        "This thing never heated up enough to actually cook the meat. Instead, it produced a kitchen full of smoke and the coating started flaking off after the first use. Also, the knob handle for the top of the cover was missing from the package. I contacted the manufacturer to ask how to get a replacement and never heard back from them. I returned this piece of *#*$ to Amazon. Will never buy a Delonghi product again.",
        "Removing the drip tray after cooking was tricky. The pan was too shallow and was difficult to balance when emptying the liquid. Be sure to let it cool or you could easily get burned from hot liquid swishing/spilling out. The cooking surface did not have consistent heating temps, eg, some spots were hotter than others and cooked more quickly than others. The depth/height of the lid does not accommodate enough space for thicker cuts of meat. Please note the cooking surface is non-stick (possibly toxic) which I overlooked when I purchased it.",
        "I have owned this for a few months. Used about a dozen times. The connetor to the side is not staying powered/hot. Have to prop up the connector to keep the grill on. Was wicked excited to get this since using one at my parents. Bummed it isn't as well made as I thought it would be.",
        "I purchased this grill so that I could make meals on the gill inside my home. I am very pleased with my purchase. This size is definitely perfect for a family, for a single person like myself it is a bit big, but but fine nonetheless. There is limited smoke, the temperature dial works great and it heats up very quickly. I would recommend",
        "I love this! I use it almost daily. Everything ive cooked on it has been perfect. Make sure you fill the bottom pan with water to keep food droppings from sticking.",
        "Now my family and I can enjoy cooking at the tabletop at home, versus spending a lot out at the Korean Yakiniku restaurants. Just cut up some veggies like zucchini, mushrooms, onions, and carrots...plus marinate some meats and shirmp...then you're good to go! It's easy to clean up and safe for the children to use.",
        "Less than a year of ownership, it just stopped getting hot in the middle of me grilling some chicken breast. No reason. It got hot, grilled 3 pieces and then it conked out on me. Disappointed. I wrote a raving review when I first used it but sadly I'm writing a unhappy review about less than a year later.",
        "The good, and the not-so-good: Grill cooks evenly, and its size makes cooking several burgers, steaks, ribs, salmon or whatever, very easy. Moreover, the glass cover helps hold the heat, distributes heat more evenly, and speeds cooking time. HOWEVER, this thing is a BEAR to clean. (Tip: Helps to use cooking spray.) Surface areas, ok, but in the hard-to-reach places, not so ok. I'm not sure DeLonghi could improve the design to overcome difficult cleaning issues. Too bad because DeLonghi makes good, reliable, easy to use (mostly) products. For example, I've used my DeLonghi \"turbo convection\" toaster oven multiple times a day for years. Love it.",
        "Finally had a chance to use it and its great. Very easy just heat up put food on grill and let it cook. cleaning is easy everything comes off the grills nonstick surface. I have been using a very gentle sponge and gets everything off. The bottom tray since it has water nothing ever sticks pour out water and give it a scrub and its clean easy as well (the bottom tray is not nonstick but isn't really a problem.)",
        "Had this grill for about16 months. The whole enclosure for the plug just broke and fell off this morning. No way to fix it, as it's shattered. Pretty bad for a grill not even 2 years old. I really expected more life out of it. Other issues are that the grill does not keep constant heat, as set by the dial. It gets hot and then after about 15 minutes, the temperature goes down. Lastly, the cover is nice, but it doesn't really fit the unit. On the bright side, it has given us lots of nice indoor cooked meals. Just wish the life would have been longer.",
        "Unfortunately, the Delonghi doesn't hold the temp well. There isn't a sear option or at the high level of 5 it doesn't sear. Bottom line, the temperature doesn't sustain.",
        "I was initially really happy to use it as my electric cook top didn't seem to have the heat to sear evenly. Now that I've used it a bit I've realized that the hottest setting is actually not that hot and it doesn't sear very quickly. It is easy to clean as it can go into the dishwasher. You have to be careful when removing the tray with oily/fatty water. One false move and it makes a huge mess. If I could return it I would",
        "This indoor grill contained a stripped screw which prevented the knob on top of the lid from being attached. As you cannot lift the lid without the knob, I had to return it! What a waste of my time and effort!",
        "Love this Grill...Was worried on some of the reviews I read about temperature not get HOT enough. It works great. Secret is to let the HIGH temp preheat about 20 min. Easy clean up as I always line drip pan with foil. Grind cleans easily also. I put wet paper towels on grid for about 15 min and put in sink and cleans great! I wish I would have seen this sooner. Live in the midwest so miss outside grilling in winter. This is a great substitute! Only had it about 10 days and we have used it 7 times. Steaks,brats,pork chops, hot dogs,burgers and chicken ! All tasty",
        "I purchased this indoor grill for my husband who really missed the burgers we made on the grill before we moved to the city. Since we don't have a balcony or anything else where we could use a grill I figured I'd give a shot to an indoor one. Let me tell you he loves it. It's easy to clean, doesn't take up too much space and works great. The food we made on this thing is so delicious. Best gift I've ever gave to someone.",
        "Three stars because we never got to use to it. Our house has a fairly small kitchen and we wanted this because we don't have space for an outdoor grill. Unfortunately, even though we have a small kitchen with limited counter space, the cord is just incredibly short. The largest open area of our counter is not far from an outlet but the cord on this grill was so short it was taught when plugged in. All I can say in addition is it looks nice and was easy to assemble although one of the handles was broken on arrival.",
        "DO NOT BUY IF YOU WANT TO CONTROL HEAT MANUALLY. It has a HIDDEN feature - The Grill will AUTOMATICALLY turn the light off and the heating will stop and it will go on stand by if it reaches the max temp for your knob setting to avoid overheating. It will stop heating for a few minutes or so and once the temp go down, it will reheat again. This will result to UNEVEN and SLOW cooking process. Manufacturer will tell you it is really the behavior of the grill but that feature is not anywhere in the product description or in the user manual.",
        "I just got this yesterday and already used it twice. Took advice on other reviews and put some water in the drip pan to prevent smoke. The chicken quarters and the steaks I grilled on it came out perfect. Snap to clean, even grilling service, fast what more do I want? Oh yea to add a more woodsy flavor I soak some mesquite wood chips in a tuna can put more water in the can with wood chips and lay it on with the meat. What a wonderful flavor.",
        "Came with a piece broken but it had nothing to do with this appliances purpose. It was a small plastic protector piece that goes on the lid before you attach the handle. It was no problem to me or the product and since it was previously purchased, sent back and refurbished then I understood. Everything else works perfect and was super handy for a backyard birthday party that had to be moved indoors from the rain. It's very easy to wash and while it does take a bit of space in the cupboard I was able to move things around and make it fit. It's a good product.",
        "I love this portable grill. It worked great for my family's korean BBQ nights. A portable grill with a lid makes it even better. Extra protection from splatters. One small downfall about this portable grill is that when you try to carry the grill by it's handle, the grill top comes off and leaving the base behind. By all means, if you want to transfer the whole thing, you must carry it by it's base.",
        "This is not a High dollar grill, yet; it gets the job done. I have enjoyed several good grilled steaks since I bought the item. I like it; only negative I can say is the basic cooking instructions. Still that can be overcome with time and more use. It's not the price of the grill, but; who you share the meal with.",
        "We love this grill. So far we've cooked delicious burgers, chicken, kebobs, and pork chops. The grill held 9 good size burgers. And we just turned off the grill, put the cheese on and then the lid and easy peasy cheeseburgers. It held 9 thick pork chops and gave us beautiful lines...if you put a bit of water in the tray it doesn't smoke at all. My only complaint is clean up. The first night it was tough getting it all off but now that we've seasoned the grill plate it's a bit easier. But get yourself a brush or a grooved sponge, it makes a big difference.",
        "Purchased this so that I could \"grill\" indoors when the weather wasn't cooperating and I have no complaints. Sturdy, non-stick and has plenty of surface space to grill on. Not to mention it's a bit easier to control the temperature when compared to an outdoor gas grill. When cooking it is best to add water to the bottom catch pan so that grease/fat drippings don't get too hot and start smoking your house up.",
        "My unit stopped working in 18 months ( only one year warranty). I don’t usually by extended warranty because a good product shouldn’t break and if it dies too much hassle to collect on warranty. This is simply inferior product. Almost new condition and it stops working! Power cord works but unit doesn’t heat",
        "6Star! I want to add one more star because it grills my meat Perfecto! If your a bodybuilder or fitness junkie looking to cook a healthy meat this is it! Cooks really fast and taste like heaven food! I love it! Now I can meal prep the easy way! For cleaning, its so easy. Just spray with water and your done, lastly just a tip put some foil in the bottom of the tray because when its grilling, all the water or fats from the meat will be pouring but its easy to clean. Trust me, its worth the money buying this.",
        "Only used twice but so far I love it. Grilled some chicken that came out wonderful with great grill lines. My only complaint is that you really can't just \"wipe the grates\" to clean. That is just plain disgusting. Food does stick but comes off quite easily with the nonstick coating. Overall, very pleased. Buying some steaks today at Costco so that will be the ultimate test!",
        "This is amazing. It comes in handy when I have a lot of people over. I cook a lot of food and this is great to have for bacon and sausage. Pro tip... line the bottom with foil. When you are done all you have to do is toss the foil out and just clean the grill part and lid. It would be nice if there was a little more space between the grill and lid. Some meats will touch the lid.",
        "Don't buy this product. Thermostat turned off just after few miutes. VERY VERY WEAK in terms of heating. It took me 20 minutes to cook chicken thighs. I am going back to use my gorge foreman grill. It's made in china. I just hate all these paid reviews. Extremly disapointed. I am returning it.",
        "I've used this grill twice and both times have had problems. I put it up on 5, wait for it to heat up, put the burgers on and they start sizzling -- perfect! BUT when I flip them over, the grill loses it's heat, never comes back up to 5. Both times I have had to finish cooking the burgers in the house. It's like the grill can only maintain heat for a short time and then the thermostat turns it off. If I set it to 5 I want it to stay at 5 until I turn it down/off. I am calling DeLonghi to get my money back.",
        "This works great! It heats up pretty quickly. I always have it turned on high (level 5) and heat seems to be consistent throughout the dinner (approx 1-2 hours). The light turns off sometimes but maybe that happens to keep temperature at a safe level. Cover is a bit shallow so I can't quite grill corn in it so I just put th cover on the corn cobs. Definitely a good buy for the price!",
        "When this arrived, the glass lid was missing the top black knob. I reached out to the Delonghi Customer Service (it's on their website), and it took FOREVER to get a response. Finally, someone responded, gave me all the information - and I think they completely forgot about me. Weeks passed - nothing ever arrived. I got back in touch with them and I received finally received a replacement lid. Using the device isn't the same as grilling. Everything I cooked it dry - maybe it's user error? I don't know. Now it's just collecting dust.",
        "This thing is awesome! I ordered one because I live in a small apartment in NYC with no room for a BBQ grill. Now that the weather is warming up, I was really craving grilled food again. This was the perfect compromise! It fits perfectly in a cabinet and is so easy to clean. If you're unable to have an outdoor charcoal or propane grill, this is a way better alternative than a George Forman! Heats up incredibly fast, and is very easy to clean. The lid is a bit shallow, so you won't be able to use it with foods much higher than 1\" or so. Definitely would recommend!",
        "Like other reviewers, I was unable to use this product because the cover did not come with the knob to lift the lid. On overall inspection, I decided that was okay because it didn't look like it would grill as expected.",
        "It does its work. But not really satisfied. The temperature is somehow little lower. You gotta wait little more to cook steak. The base is kind a big and it uses so much space. Overall it is just fine. If you are looking for something space saver, look for others",
        "I use the grill on a daily basis and just purchased my fifth grill. Of the different grills I have tried this is the best because of its cooking size. They do wear out (electric part) under constant use after about three-four years.",
        "Best indoor smokeless grill i have owned in my 82 years. Cooking for 65 of them. Cleans up great. Only negative is grease pan. Poorly anodized aluminum. Turn dark if washed in washer. Grill cleans easily. If sauce is used or meat highly marinated little pam spray helps washer get what sticks between griddle. Very nice better than a self clean broiler oven. Enjoy P.s. put cup water in drip pan before placing meat on grill. Very important to tendernessa and cleanup.",
        "I did a lot of research before ordering this grill. I grilled a skirt steak I had marinaded, burgers and chicken breasts. My smoke detector never made a peep. I did put water in drip tray. Love this grill. Highly recommended.",
        "I had heard good things about this grill. The grille did not fit the space well enough. Ok, I wanted to return it. I'm sure it's good, but even though I belong to Amazon Prime, I had to pay $11.38 to return it. I will think carefully about what I order in the future in case I need to return it..",
        "I was so excited to buy this grill since summer outdoor cooking is officially over. I let it heat up for ten+ minutes as others have suggested but the grill just does not get hot enough to cook food in a reasonable amount of time. As a full time working mom, my hope was to speed up nightly dinners but even chicken thighs took over an hour to cook. I got frustrated and put them in my oven. This could potentially be a decent product if you have all the time in the world but it is not ideal for a busy family. The grill is currently collecting dust on my table. I wish I could return it.",
        "We just finished its maiden voyage...Skewers of beef kofta, followed by chicken breast tenders, thinly sliced sirloin, fingerling potatoes (previously blanched), 14-25 peeled and deveined shrimp, and unskerwered asparagus spears. A labor intensive meal prepared in the middle of the dining table for our kids and grandkids,. It all turned out beautifully. Cleanup was a snap. As with grilled anything, good ventilation will keep the smoke alarms from going nuts, but the carmelization and grill marks were perfect.",
        "Even though the reviews said items cooked on this grill would not taste like they were cooked on an outdoor grill, I had to learn for myself. Cooked some lamb loin chops and it took quite a while to get the grill mark. Did not have a smoke problem, but the taste was definitely lacking. Gave it away. Will continue to use my cast iron griddle for indoor cooking.",
        "This is the closest to actually grilling as it actually gets. I bought this to grill indoors, as we are not aloud to have an open flame grill at our apartment complex. I`ve experimented with different smoke enhancing juices and rubs, which help make it more like a charcoal grill. If you cant use a grill where you live, this is about as good as it gets. I would like it to get hotter and distribute the heat a little better, but for $40 you cant beat it.",
        "Glass lid top handle found to be missing of the grill when opened. Have requested a pick up of item by UPS which is scheduled for tomorrow and a replacement resent. Asked if the item being recent could be checked prior to shipping replacement grill and was told by Amazon customer service that it could not guarantee that the next grill lid would have a handle. How can this be, when picture of item shows a handle? Very frustrated as this was a gift.",
        "This works pretty well considering the price. It gets to grilling temperature in 2 or 3 minutes and browns pretty good. It seems to be the same temperature all the way to the corners. I wish the glass lid was a little taller. The little circle that attaches to the handle came broken.",
        "I had my doubts that this grill would really work as well as described but it really does. I think the key is to pre-heat the grill very well, not just until the \"ready' light comes on. This will give you the grill marks. After you turn the meat you can turn the heat down and put the lid on to finish cooking through. I add a little \" liquid smoke\" to the marinade to give a grilled flavor. I rub the grill with a little olive oil, on a paper towel, and haven't had any problem with sticking. Easy to clean.",
        "This is an excellent indoor grill!!! It's not completely smokeless, as no grill is. You will get a little smoke during initial searing, but it subsides once you turn the temp down to finish cooking. Excellent quality, super easy clean up. Amazing non stick coating. I'm really impressed.",
        "yes I read the previous reviews on this product and I am not disappointed at all. Great indoor grill, versatile and easy to clean. I have done chops, burgers, chicken breasts, and salmon, all turned out great, sausages/dogs not so hot, I think it's because of the surface contact to the grill. SOOO, This is not going to replace outdoor charcoal grill flavor, for me that is the ultimate in taste, but inside, this is the best grill I have used thus far.",
        "I was a little skeptical of buying this because it was an indoor grill but after getting the product in using it several times to cook steak, chicken and hamburgers it is the best grill I think I have ever bought even compared to my outdoor grill! I sit mine on my stove and turn my fan on over my stove while I use it to keep the smoke down (its not a bellowing smoke just a little as you would expect). it leaves char marks on the meat and cook so perfectly anyone would think you cooked it on you gas grill outside. You wont be disappointed in your decision to buy this item!",
        "Well made and easy to use. The grill heats evenly, and even though it's not smokeless there's very little smoke due to the drip-pan. I highly recommend it .",
        "I love this grill! It’s very convenient, light weight, and gives you a grilled taste. It’s not quite like an outdoor grill, in terms of the flavor. But, it’s close enough, given all the other pluses. Clean up is easy. I wipe off all of the drippings and let them fall off in the drip pan, and tilt it sideways in the sink (just don’t get the electronic part wet!) to wash the grate. I definitely recommend!",
        "Heating is fine. Not perfect on all surfaces of the grill, but using the lid does keep meats moist. Cleaning does requires a large sink, and so far no issues with the lid handle. Yet it does get a bit too hot to hold. Use tinfoil to catch the grease, or it's a cleaning nightmare.",
        "This product is great!!!! The only down side is you have to hand wash it with non abrasive materials to clean it. Its not dishwasher safe. However for the price you pay it is well worth washing it by hand. This grill cooks great food, burgers, chicken (bone-in or boneless). Just remember with bone in chkn it will take longer. I even did a pork loin roasts.",
        "I absolutely love this grill. BONUS: you can put it in dishwasher! Tastes just as good as getting a steak from a restaurant! I highly recommend it!!!! I would give more stars if I could.",
        "I have been using this for a year now, and I am still in love with it! I am able to get those grill marks on my chicken without having to be in this sticky Florida heat to grill chicken.",
        "Bought this grill as the condo we rent doesn't allow outdoor grills.. It does a great job cooking streaks, chicken etc. It cleans pretty easily but it needs to be soaked in hot sudsy water right away if you don't want the pain of cleaning out each individual slat in the grill.. It can go in the dishwasher but once again I would say yo soak immediately so food doesn't stick then just put in the dishwasher!!",
        "This grill does what it's supposed to do. Its simple to use and cooks food pretty fast with relatively easy to clean parts. However, it doesn't last particularly long. I just purchased my 3rd grill in 5 years with each one dying about 18-20 months after purchase. Since I like the grill I purchase the $5 3-year protection plan. I've cashed in twice on my grills so basically just get a brand new one every 2 months for little to no extra money. Works for me.",
        "I absolutely love this thing. I work 12 hour shifts around the clock and we do have a kitchen, but I felt I was missing out on a lot of grilling. After a lot of research, I selected this grill for the non-stick surface and the smoke free feature. Its not totally smoke free, but any average kitchen fan can handle what smoke does come off it. Clean up is super easy. I wash the entire thing by hand in about 5 minutes. It sears and browns meat just like a gas grill, without the flare-ups. The only problem I have is I started using it at home and now I don't want to take it to work!",
        "I don't normally review items but this grill is amazing. It cooks evenly and perfectly. We have done steak and pork so far and they came out amazing. Clean up is a breeze because it breaks down into 4 separate pieces to clean. We have had almost no smoke from it and absolutely love this product. Not only would I recommend this product to everyone that loves to grill, but I will be getting them for Christmas gifts for 2018 for all of my children.",
        "This is a small, convenient grill. works for us because we don't have space to keep a regular grill outside. But as other reviewers have noted, the grill doesn't get hot enough, so the grill is frustrating and messes up all the timing. Another problem is that the lid does not fit snugly, which makes storage difficult. Be careful and make sure you don't drop the lid in moving the grill.",
        "I love it! Since I got it 3 weeks ago I have cooked all my dinners on it. On my balcony. I have a full kitchen but this is so much fun and easy!",
        "My gas grill kept getting clogged so easily that I stopped using it. I've been using a small round electric grill outside whenever I BBQ a steak because of the mess. I've only used this one twice but I seasoned the plates and they clean up so easily. I read other reviews and I think users may not have taken the care they need. NEVER place hot plates (or other pans) in water as it is the quickest way to ruin the non-stick surface. I covered the bottom drip pan with aluminum and clean up was a breeze. Looking forward to lots of grilled meals!",
        "This isn’t a smokeless grill. It doesn’t get hot enough to sear a steak but it can grill, it dries out the food. It’ is very difficult to clean. I like my Foreman grill better. I was hoping that this would be a good substitute for a gas grill, as I live in an apartment and we can only have electric grills. I am giving it 4 stars because it is what it is and for the price point it is adequate. The lid is a nice addition.",
        "I love the convenience and simplicity of this grill! Living in an apartment, I am not able to have a grill, and sometimes the frying pan and oven get old. Being a culinary student, I am always cooking and trying new things, and I found this to be the perfect addition to my kitchen. And although it is not a typical grill, which adds that certain \"smokey flavor,\" I place liquid smoke (I picked up at a regular grocery store) on a sponge, and rub it on the grill lines. Definitely a great purchase!",
        "I am very pleased with this grill, I have used it a few times since I received it. I have made steaks, chicken, hot dogs and hamburgers. I used the tip about lining the pan in foil and it makes for an easy clean up. The food comes out tasting great and for us apartment dwellers that to not have a gas grill this is just what we need. It is well made and you will get your moneys worth.",
        "I decided to include more lean protein in my diet and grilling fish and chicken with minimal use of oil seemed like a healthy option that was tasty as well. The DeLonghi indoor grill has exceeded my expectations. It does take a bit of time to heat up, but once it does reach the temperature, it maintains it quite well. I have never had uncooked or undercooked meat/fish issues. The clean up isn't too much of a mess either. The construction is remarkably good for the price and it is modular enough for cleaning all the parts. I'll not think twice about buying this again or recommending it to friends.",
        "I wish it came with a smooth pan besides the grill top. I'm a harsh critic but my food tastes amazing! Burgers and steaks I was surprised it has the grill Marks and flavor. Easy to clean",
        "what a great grill! the problem I had with our outside/propane grill is that it became so messy and greasy and was nearly impossible to clean. This one makes the food taste just as good and it is a breeze to use--and clean.",
        "HATE IT!!!Vegetarian here tried,not hot enough to thoroughly cook Pablano peppers-took over 45 minuets to get even 2/3rd s done and that was w/lid on!!!Maybe works for meat but sucks for grilling vegetables!!!",
        "This is a great grill....love how the steaks come out, nice and juicy especially when you use the lid because it locks in the flavor. If you really want that outdoor charcoal taste, purchase liquid smoke from you grocer. it comes in a bottle and is in the aisle with seasonings. Perfect! ummmm good!",
        "This is very durable but yet very huge and bulky. It does not cook evenly for being electric, when you put it on low to medium it shuts itself off which is a nuisance! The lid does not even fit on top very good, it seems like it is too small and it is flat so it sets right on top of what you are cooking. It was pretty much a waste off money for me, I do not intend to use it again!",
        "Love the lid. It is easy to clean. I don’t put the grill in dishwasher but is very easy to wash off in sink. I use it in my RV too.",
        "This is a very good grill. I loved the fact that you can put 98% of the grill in the dishwasher. The cord is the only thing, you have to pull off before cleaning. I had a smaller grill that I dropped before buying this one. I use this one a lot. I only put 4 stars because the base doesn't have a bottom. The bottom is the grease pan. That makes is a little \"difficult\" to carry around. Outside of that ++++",
        "Too bulky. Great product but could be smaller.Also If lid had a prop it would make it safer. The current design means I need to find place for it in the middle of cooking.",
        "All the reviews are raving about this grill and with good reason. It cooks steak, burgers, chicken and veggies just like my outdoor grill always did. A good light over the sink helps with cleanup, but I've found that keeping it clean and a spray of cooking oil goes a long way toward maintaining enjoyment of this product.",
        "Bought this as a Christmas gift, my mom LOVES this indoor grill. She said it tastes just like cooking out on her grill in the summer, which is great for her chicken salads and grilled veggies.",
        "This is a really good grill I got for us because we live in an apartment that doesn't allow outside grills on our patio. There's a lot of space and it cooks very evenly. You even get that smokey flavor. Our only problem was that the plastic on the outside of it does melt a little easily near our oven/stove, but since that was 100% my fault for putting it near the stove in the first place, I'm not going to take stars from this product. :) It's easy to clean, though I do suggest using hot water to help melt off the excess grease. Makes it a ton easier.",
        "My prefecto indoor grill, works great for all my grilling needs, when you don't want to fire up the big one..But I also use it on my patio for steaks, grilled corn, brats and hot dogs. Easy clean up and store.",
        "This thing is awesome!!! Been cookong on it almost every night... Burgers steaks chicken Adjustable temp is nice... Doesn't get quite as hot as a real grill, however I'll seat both sides, leaves nice grill marks, wrap whatever in aluminum foil and either throw it in the oven to cook the inside or let it finish cooking itself on the counter... Foreman is going to goodwill Easy clean up... Water catch tray is easy and its dishwasher safe",
        "This is the second item we bought. The first one was a Christmas present. Since then 3 years ago we did not stop using it. Is a perfect way to cook small pieces of meat, ribs, fish even vegetables. I love the fact that it can be easily cleaned. You can even use the dishwasher.",
        "This thing is pretty awesome. Easy clean up, just wipe with hard side of the sponge and throw everything in the dishwasher. Dump a cup or two of water into the drip pan before-hand and you won't have any smoke, makes girlling inside way more feasible. Only 4 stars because I can see the grill material seems to shed a little bit. I see the wear on this becoming obvious after a few years of use. Better, more durable materials would be nice.",
        "Great grill and the cover is perfect. I had another one without a lid and it didn't work nearly as well",
        "I love the inside grill especially the lid. The food is cooked evenly every time and tastes great.",
        "AMAZING! I am always being invited to BBQ get together's and loathe that I cant have a grill myself. I live in an apartment and this has made my day! Keep in mind, it does take up some counter space so you may need to re-arrange the a few things. It cooks evenly, distributes heat and as long as you provide the resting water beneath it, it doesnt really smoke up. (mind you i only made steak, squash and asparagus!) Very Happy!",
        "I rarely write reviews, but this product met every spec that I wanted in an indoor grill: large surface area, had a lid, and a drip pan that didn’t have a coated finish. I received it it same day and used it the next! Cleaning was easy. I was overjoyed! This grill will not disappoint!",
        "Great! I purchase this as a Christmas present for myself and I lovve it. I have used it once not because there is anything wrong but lately my family and I have been traveling outdoors to grill up food, otherwise this has amazing grilling power and easy clean up! It is long though.",
        "I don't have an outdoor grill because I don't trust to leave such an expensive piece of equipment outside. Anyway, I'm used to a propane grill, and so I think this grill cooks wonderfully. So far I've done hot dogs, hamburgers, bratwurst, and will soon add steak and chicken. Everything I've put on it so far has cooked up wonderfully.",
        "I have had this grill for over ten years, and kept it outside on a terrace for most of the time. I works great, even though it is looking a bit long in the tooth. Having the glass cover makes it easy to use indoors. I may be getting a new one, only because this one visually looks pretty sad, but will keep it as a backup!",
        "The grill work pretty good, but it is kind of a pain in the butt to clean. The highest setting is really the only setting that will cook anything. I've done kabobs, steak, and burgers so far. I started the kabobs on the grill, but ended up finishing them off in the broiler because it just wasn't working on the grill. I will continue to use it, just need to get the right cleaning utensils to be able to clean the grill really well.",
        "Well, I am not sure about 3 stars, but here is the thing. I've used it today for the first time and not sure what went wrong. Rather small chicken fillets I've marinated in lemon juice and spices 10 hours before grilling it. Well...I've never ever had such a dry chicken, never! So those people who loves he grill and say that everything it turns out to be juicy either never had juicy steak/chicken/fish OR they do know some secret, which I wish to learn!!! So please, help:)",
        "I enjoy grilled food & I’m single & wanted something small, this works well & food teast great",
        "I've been using one that I got used for the last 5years. It stopped working, something with the dial. It was probably around 6-8 years old when I got it. I use it at least once per week, best grilled chops ever. Just got this new one and wow, we're back in business, burgers, sausages, pork chops and kabobs. We still use it every week."
    ]
}