{
    "entity": "Contact Grills",
    "text": [
        "No smoke. My wife said the apartment would be filled with smoke the first time I grilled burgers. Nothing like that happened. The taste reminded us of the times we cooked outdoors in N.J. If you are looking for an easy to use, no smoke indoor grill, make this one your choice.",
        "I am shocked at all the high positive reviews on this grill! I had a horrible experience with it. I had read multiple reviews, got tips on how to use it from other owners, read the product manual and instructions, and followed all instructions to the letter. All I did was grill a couple of hamburger patties. I have NEVER seen so much smoke and spatter from a grill! We live in a downstairs apartment with smoke alarms in each room. I was so nervous that the alarms were going to activate, they didn’t because we fanned the area and opened all the doors and windows. I am so disappointed in this grill.",
        "I purchased this due to a change in fire code which now prohibits grilling on my balcony. I love it! Over been using it almost daily. It is, as promised, smokeless. I've been sharing the information with neighbors and friends affected by the same change.",
        "Delivered early, used it the first night. Works fabulous. Steaks and Vegetables came out amazing. I would recommend to anyone using this to line the drip tray with aluminum foil to protect the drip tray and save on cleaning time. This would make a great gift to close loved one that dont want to stand outside and bar b q. This is smokeless.",
        "The handle broke while I was taking it out of the package. I blamed my clumsiness, and did not try to have it replaced. As shown in the picture, it works well even with the broken handle. I have never before managed to cook whole fish and not have it stick. Fish with this grill comes out great. I also tried steak and burgers. For steak and burgers, they tasted much better than they looked. Actually, even for the fish, it is not easy to determine that the first side is ready. I learned to trust my timer and flip. It worked so far.",
        "Really like this grill for quick dinners. Cooks even and does a good job. Cleanup is super easy too. The plug can get a bit greasy where it plugs into the unit (from spatter) but very easy to clean. Just make sure you place near a vent. I would use it on top of my stove but there is no plug close enough, so just be careful with placement as there will be fumes and may need some type of ventilation.",
        "My Korean friend had a similar looking grill and decided to try this one. If you fill the bottom pan with some water it'll really reduce the splatter (I tried w/o and only had a few splatters)! So easy to clean, although it said it was Dishwasher safe (plastic part) it was really easy to clean everything by hand. I've used it 4-5 times already and performs amazing! Very strong, I was happy keeping it at Medium and the heat was even (you can leave meat on the edge to keep it warm).",
        "I was a little concerned about the reviews that mentioned that this grill does not get hot enough. After getting this appliance today I immediately used it to grill two full sized steaks, and after that some zucchini. The grill did both quite nicely, so I am giving this product 5/5",
        "I shopped for months for an indoor grill and ended up buying this one. It is so easy to use and cleans up nicely with a scrubbing brush. My meats and veggies turn out so great, I am loving it. Would recommend this for apartment renters. I place it on top of the stove and use the overhead venting system so not to set off any alarms should cookinnt ug get smokey. I have used this for well over a year now and it still looks brand new. The oil pan clean easily too. Highly recommend this,",
        "my family is really enjoying this grill... initially, i was worried about the power/heat this grill can provide but after the first use, this is as good as a coral grill and i washed the stand and the tray in dish washer the top is a bit tricky by dishwasher but it is 85% clean and just need a few time of warp",
        "I really wanted to like this indoor grill but there was no way to prevent splatter from spitting all over my cabinets. I even moved the grill onto my cooktop - which prevented any other food prep - so that I could put on the overhead fan and more easily wipe down surfaces, to no avail. In the end, my old George Foreman grill did an equally good job with none of the mess. I sent this one back.",
        "It works well and is mostly smokeless. There is still smoke from the cooking process, but the part that creates the most of the most is relieved because the juices don't fall on the heating elements . So to enjoy a nice cook at the table if its marinated meats from H-Mart or cuts marinated at home this was a good purchase.",
        "This grill is amazing!!! I live in an apartment and we aren’t allowed to have a BBQ grill, and this is so easy to use indoors. Everything I’ve made cooks evenly, and there is very little smoke. So convenient to use and easy to clean!",
        "Really love this grill, cooks and looks great, love that the non stick coating is on both sides top and bottom of the grill grid, that makes it so much easier to clean, and has a much nicer look, you don’t see grease cooked onto aluminum under side, last grill I owned, had large area, uncoated underneath the grid and looked nasty, because of all the grease that was cooked on and could not be removed.",
        "Temperature Control is hard to achieve. Cooks chicken good, and fish, fast cooking meats, veggies...do not try to grill a thick steak, it will not work, takes way too long, and the outsides are burnt before they get done.",
        "Been grilling meat, fish & poultry for the last 8-years on this unit & it has held up quite well. It will smoke a little at high heat when cooking cattle, but that is to be expected. Grate little grill !!",
        "We bought several indoor grill because we love grilling and Korean bbq. This grill is the best we have used. The best part is, it is very easy to clean and wipe clean. Highly recommend!",
        "Grills well. Need to put water in pan before grilling for easier cleaning. Would have gave 5 stars if seller did not sell me item with a chip in grill, and they used a marker to mask it. I chatted with amazon and they solved the problem. But still 4 stars for using Sharpie to mask dent.",
        "This gadget is super fun. As other reviewers have mentioned, it does not get hot enough to grill anything thick, but for flank steak and shrimp it's fine. It does NOT give you that wonderful sizzle or aroma that you get in an actual Korean Grill restaurant, just a fun, unique way to gather around the table.",
        "Out of everything I've bought for my kitchen on Amazon, nothing has gotten as much use as this grill. It still makes perfect steaks after eight years. That's great value. Pretty easy to clean. Highly recommended.",
        "It is a great grill as I can't have a gas grill where I live. It is small enough, but if your looking to grill a lot of hamburgers at a time, then this isn't for you. I was able to grill 2 hamburgers and a hotdog. It is easy to clean up. Used it twice this July 4th weekend. I did have to turn the vent on over the stove as it does get a little smoky. Smoke detector went off. I would recommend it over the George Foreman Grill which I have used for years. The cord is longer on this new grill. Foremans grill cord is too short.",
        "I think this works pretty well and the design is sound. It requires hand clearing but seems to be holding up unlike the George Foreman which let you put the plates in the dishwasher and then stopped snapping in. The key to these things is the little mechanical parts that hold the plate. This one looks OK - not great but I believe it will hold up and so far has worked fine.",
        "Love love love it. Exactly what we were looking for!!!",
        "Bought this in July 2014 and have used it maybe once a month. So far it has been none stick and grills very nicely. Only now I see a couple of places where the Teflon is starting to come off. I have only used silicone utensils with this and taken care not to submerge into water while it is hot. So far the spots are in places where food does not touch it so I will continue to use it. It doesn't seem to be as durable as the cooker I bought of this same brand and I have used it more frequently.",
        "Not really smokeless - depends upon what you're grilling. Fatty or marinated meat can smoke quite a bit and requires placing under an exhaust hood. Otherwise does a nice job grilling meats and veggies and veggie burgers. Easy to clean.",
        "The best money spent since floyd concert in 94. Absolutely perfect. Restaurant style burgers. A must have. No weather no bugs bbq inside.",
        "Avoid this grill if you're going to use this to grill thick steaks. Doesn't even get hot like it said at 410 F.",
        "I've had an indoor grill before but this is the best one I've had. I've done salmon, steak, hamburger and chicken. All turn out perfectly and the clean up is so easy.",
        "Love this....bought 5 one for each sibling!! They love it!! Spray grill top and under...line bottom with foil for easier cleaning!! Made more for very thinly cut meats!! You’ll love this!!",
        "I purchased this grill in October, 2011, and have used it frequently. You cannot compare it to a charcoal grill in temp and speed of cooking, but you shouldn't. It does a very good job for a small electric grill. It does smoke some depending upon what you are cooking, but I use it next to an open window or on the stove top under the vent hood with no problems. You can buy a Kenyon Custom electric indoor grill with a 1300 watt burner for $1,000 or you can buy this grill with a 1300 watt burner for $75. Seems to me that each will put out the same amount of heat.",
        "I am very pleased with my Zojirushi EB-CC15 Indoor Electrict Grill. What I like the most about my Indoor grill is that I can use it inside like an extention of my stove top. It is easy to clean and store.My family loves it as well as a matter of fact, since I have had my indoor grill, it gets used more than my stove top.. I give the Zojirushi EB-CC15 Indoor Electrict Grill five stars and I plan to recommend it to everyone I know. A great investment.",
        "I tried this grill because the reviews said it got really hot. Well, it does. On high, the surface temp is over 800 deg. Cooking steak, chops, ribs, chicken, etc. will provide excellent results. There is a small amount of smoke created if seasonings are not used, but seasonings are a different story. I have a favorite steak seasoning but must limit its use to the outdoor grill since the high temperature produced by this grill will quickly fill the room with smoke. Overall, this grill is simple, easy to use, has good temperature control and easy to clean. For the times when grilling outside is impractical due to weather, this is a great substitute.",
        "Placed it near the stove on my counter and the heat from the stove melted a whole corner off....",
        "I purchased this grill to do traditional korean BBQ on our dining table. I've used both thin and thick cuts of meat and love how quickly the grill heats up and sears everything. The best part was that this bbq was approved by my korean mother who demanded I order her one immediately while she was visiting us. Need I say more?",
        "Small. Compact. Good temperature. Easy to use. Easy to move. Clean? Can't tell. Looks easy. If you are not lazy, I mean.",
        "While it was more than I wanted to pay for a countertop grill, I \"bit the bullet\" and purchased this one because of the reviews. I'm glad I did. After having had two George Foreman Grills, I decided it was time to go with something that didn't SMASH the meat. I have now done steaks, chicken and salmon on my little Zojirushi grill and can't praise it enough. Easy to clean, fast and efficient. I hope it lasts a long time. ;-)",
        "This is the first appliance I can say I'm really excited about using! It gives just the finish I was hoping for. I am able to place the grill on my smooth-surface stove to make use of the exhaust fan and still use a couple of the burners. The clean up is a dream....everything wipes clean with a damp cloth. Can't wait to try veggies and other cuts of meat.",
        "I put all the pieces in the dishwasher. There has never been a problem. I just make sure everything is dry before using.",
        "I bought this grill after ruining my grill pan and being turned off by the high prices and design of other grills. I have grilled pork chops, chicken breasts, and fish without any problem. I take care of the smoke by grilling directly under or near the fan for my stove, even though there is not much smoke. The grill and grease pan clean up very easily. I especially love the variable thermostat. The only thing that I wish this grill had was some sort of glass cover to help hold in some extra moisture (like when grilling pork chops).",
        "I've had this for over two years and it's still going strong! It does smoke, but it is a grill and that is to be expected. Over time it will become seasoned as you grill your meats and really makes anything taste delicious. I love making grilled vegetables with this too. This is one of the best things I've ever bought and I highly recommend this grill.",
        "I ordered this product because it said it didn't smoke while cooking. I live in an apartment and did not want the fire alarm going off. I like the way it cooks food, it is easy to clean and I have used it often. The only drawback is that it still does smoke but not as much as other indoor grills I have tried. It was worth the purchase. Still have to open door because of smoke though.",
        "Easy to clean,cooks evenly,food seems to taste better and it's versatile",
        "Great for grilling but would not recommend for indoor.. its not a smoke less griller for me.",
        "This little grill is amazing. It heats evenly and stays hot, giving you grill marks on your food. I've never had a problem with smoke in the kitchen while using it. I seasoned it per the instructions and always put a bit of water in the drip pan. I've made steak, chops, bratwurst, potatoes, bacon, and zucchini strips without any issues at all. It's easy to clean as long as it's been seasoned properly. I did a lot of research on grills before buying this one; I'm very happy with the purchase,",
        "we like this for a indoor grill. although sometimes our smoker detector still went off.",
        "Replaced my George Foreman with this one: upgrade for sure. The grill is very well designed with a heat control dial and incorporated drip pan. The grill lifts from the base for easy cleaning. Two minor observations: (1) the grilling surface is somewhat compact--large enough to prepare 3 entrees but not sides contemporaneously and (2) it is somewhat cumbersome to stow.",
        "I live in a condo and can no longer grill on my porch per fire codes. I bought this grill as an alternative to outdoor grilling and am very pleased. This grill gets very hot and leaves your food with nice grill marks. It's easy to clean especially if you line the drip pan with foil. Would highly recommend this product to other condo and apartment dwellers.",
        "Ok, I read the reviews & ordered it. Bought lean hamburgers to cook. Result: What grease there was stayed mostly in the groves and little drained down in the drip pan, that grease splattered everywhere within an 6 foot radius, plus a fine grease smoke drifted everywhere . This was no better than my 12\" revere frying pan and at least I have a splash screen and a lid for it. The plastic molded base was cheap looking and some of the edges on the bottom were sharp (where you hold it to pick it up). Not worth even half the price. Guess whoever writes these \"its great\" reviews must have maids to clean up the mess.",
        "Great grill, super hot. We used it for Korean BBQ, only dislike is that the holes are big enough small pieces of food fall into them.",
        "\"Handsome\" unit. Decent length 65\" cord. Easily read temperature settings, albeit no figures. With bacon or hamburgers, would start with \"MED\"; burned bacon twice before \"catching on\". Bottom edges sharp but will not cut. Didn't see a need to put heat protection under unit when using. No grease splatter when cooking bacon! Hardly any need to blot excess grease! Cooks 5, possibly 6, slices of bacon at a time. Easy cleanup.",
        "Absolutely love it! It does have some smoke( maybe just vapor, I can't tell actually), but not a trouble as long as your smoke detector is not too close to where you use it. It has enough heat if you are doing Korean/Japanese style bbq, not sure. Recommend it! It is of good quality but light weight and easy to use. But it is not dishwasher safe.",
        "This is a great Appliance! The first thing I cooked on it was Chicken Breast,it had great Grill marks and was juicy and delicious. Well worth the money!",
        "This is our 2nd Zojirushi. We had the first one for over three years and it was great. When we moved we gave it away thinking we would get a gas grill for our new patio. I missed it to much we bought another one. It is the perfect size for a 1-2 person meal. Heats up quickly and evenly. We mostly use it outdoors but have also used inside to grill small simple things like veggies or hot dogs. It is so easy to clean and to store.",
        "It's okay doesn't taste like BBQ food. More like a griddle. Would of returned it but missed the window",
        "I have bought and returned three other models for the same reason: they don't get hot enough. The Zojirushi gets hot enough that I can satisfactorily grill meat. For everything else -- vegetables, seafood, fish -- you actually have to lower the thermostat to medium or medium high. That is remarkable, considering that other types I tried had to be on high, and often that still wasn't hot enough. I put water in the catch tray, and the smoke is minimal cleaning is rather easy too. I wish I could have an outdoor grill, but in a Manhattan apartment, that isn't happening. This is probably the best I can get.",
        "I really like this grill. It heats up quickly and evenly. I use it for bacon, burgers, and veggies. One word of caution: the finish of the grill scratches fairly easily. To clean it, I use a paper towel to wipe down the surface. During one cleaning session, I scraped off one of those crusty charred bits that you'd find on any grill and it actually left scratch marks. Not really a deal-breaker for me; just thought I'd point it out.",
        "This is a well engineered appliance beautifully finished and simple to use and clean. It would be great to use right on the dining table for Korean style barbecue. Steaks don't come out with a crusty surface that one gets from exposure to actual flame. I am quite pleased with it.",
        "Used this grill about 4 times thus far - pork chops, bacon, fajitas, thin cut steaks... it's really an amazing little gadget and I can't recommend it more. It heats up very quickly and cleans up like a charm. My only regret? I didn't get one sooner. My family loves to grill, and that's not a possible thing during the winter months. I have a feeling we might be using this WHEN it's grilling season.",
        "My husband and I love this company and we use this grill all the time. It is easy to use and easy to store. If you are on the fence I highly recommend getting this",
        "We have used this grill many times since we received it. It works great and cleans easily and the price was right. It is especially handy on days when the weather is bad and you want to grill something. I especially like that you can adjust the heat on the grill. I would recommend this to anybody looking for an indoor grill.",
        "....as others posted, should have included a cover! Keep the heat in baby! Does cook salmon and other meats/veggies within that thickness very well. Boneless skinless chicken breasts should be sliced in half first, otherwise it takes forever and bye bye all your juices. I would buy again, and recommend though.",
        "Quality electric grill, good cast iron grill surface, yet without lid, and electric which means that high searing temperatures just can't be reached. In case you cannot use a charcoal grill at all this might work. Otherwise don't buy an electric grill.",
        "Great grill! I use it nearly every day. It is dependable, easy to use, the flavors are delicious.",
        "Got this to cook family favorite Korean BBQ cuts of brisket and beef ribs. Get's plenty hot. This heat combined with the grill design and drainage results with great cooking performance. And you get nice sear marks too! Easy to clean as unit comes pieces. Highly recommended.",
        "its not a webber, but for bacon and burgers its a handy little unit. well designed and constructed. I have had it for about a year know and it has held up well. 6 strips of bacon or 4 burgers, just to give you an idea of the surface area",
        "Great little grill for two. Used it several times to do tabletop grilling as you eat. Grill gets plenty hot. I usually keep it around low-medium setting. Easy to clean.",
        "Works great, easy to clean. So far I’ve done vegetables, lamb chops, steak and chicken ... very little smoke if any, ditch the grilling pan and use this for your indoor grilling needs.",
        "Bought this as a gift, person loves it. Heats up fast and evenly. Well made.",
        "I love this grill. Bought it as a Christmas/Birthday present for myself. So far everything that I have cooked has been tender and juicy. By the way, this has been the opinion of friends and family that have eaten food that was prepared using this grill. Set up is easy and so is cleaning. There will be some smoke but very little of it. One has to expect this when using a grill indoors! I love this grill.",
        "Just like cooking in the oven..not a bit late me bbq!!",
        "I purchased this grill cause of other positive reviews, and after 11 years my T-Fal grill blew my plug and never worked again...so i decided i would get this. I must say i was worried if it would meet my expectations cause i was worried about the plastic base, but let me tell you this grill is awsome, got it this morning and cook steaks, wow, taste like the steak you would get in a restaurant....cooks well, and clean up is a breeze, the grill you cook on is non stick when you wash it, it cleans so easy...i highly recommend it, although some folks might like the plastic base it is sturdy. I love it.",
        "I live in an apartment and we can't have grills on the balcony... this is a nice alternative! I would buy this again!!",
        "I purchased this grill about 8 months ago. Yes it is easy to clean, yes it heats up nicely, but, suddenly the heat drops. One side of meat nicely grilled the other side just gets grey and ugly. I have used it several times and it is always the same problem. Now it is in the trash.",
        "will not cook a steak well done unless it is very thin cooked for over 20 minutes to expensive to ship back",
        "Very good grill. Heat up fast and stay very hot. Great for Korean BBQ.",
        "It's very easy to use at home. It's light, easy to clean and no oil splatters. Was able to cook a yakiniku dinner easily. Love it!",
        "Best for Korean grill but it’s kinda hard to clean with the corners",
        "I never thought it would be possible to grill indoors and not set off smoke alarms. Apparently, it is, and to get great results too. A very smart design allows for this grill's power source to be removed from the grill so that it can be washed (and/or stored away) with very minimal hassle. A *favorite* kitchen appliance!",
        "This was purchased when I moved into my new house, about a year and a half ago. I am always grilling various meats and vegetables and required a tabletop grill to make dinners easier. This one was a perfect choice for us. It's incredibly easy to take apart and wash by hand. Doesn't take long to heat up, either. If mine breaks at all, then I'll be immediately purchasing another.",
        "Every positive review you've read here is true. It is fantastic. The only issue I would give it is that it does splatter fats from cooking on the counters because there is no way that I know of to shield the cooking. But the way it browns and cooks the meat is worth the clean up",
        "Not only does this grill cook to perfection but it cleans up so quick and easy that it is remarkable. No matter how long it sits unwashed, it cleans up with a dishrag and hot soapy water. I love mine. I received it as a gift and am giving it as gifts to others. Even easier and quicker then an outdoor grill.",
        "perfect for me and my husband, we are in our newlyweds, and we have been using this for make beef, chicken etc, easy to clean, .. we like eating healthy, this has been a good purchase..",
        "This is seriously one of my top 5 best purchases ever, in my life. I had reasonable expectations for this in that I expected it to cook my food. Holy crow, this thing blew me away. It gets HOT and your food will have actual grill marks! We use this for KBBQ, but also love it for just grilling up some chicken for salads. It's an amazing little product and we use it even more than we expected.",
        "This grill were very nice . I like to use this to cook some Korea meet at home. It’s very convenient.",
        "Best grill! I use it almost everyday. Grills perfectly, I've used it for meat, chicken, shrimp, fish and vegetables-worked perfectly on all. Cleans easily too. No comparison to the foreman grills, which dried out the meats and were a pain to clean.",
        "this item is listed as an indoor grill, however it does not get hot enough to leave grill marks on food, it does eventually cook the food but it needs more power or a different delivery method to the cooking surface to actually grill food.",
        "I use this more than my stove. Since I can't grill outside any more, this is a great substitute. It's almost as good as outside grilling, easy to use and easy to clean.",
        "We moved into a senior apartment complex which does not allow outdoor grills of any sort. This seemed like the perfect solution and it is. Great brand and does a really first class job - just be sure to turn place on your stove and turn on your fan otherwise smoke alarms will sound.",
        "I like that this gets pretty hot and STAYS hot. I just wish the grilling surface was a tad bit bigger, otherwise, it is a good, solid grill and I use it at least 3 times a week.",
        "I was really excited when I got this, but the food gook gets dried and stuck on there. so guess i'll have to buy a scraper? it was a pain to clean it then put the next round of meat on it. seems smaller than the picture. Def Not Nonstick..",
        "easy to use. yummy grill. but one thing i dont like. the grill smell goes around the house that makes me can't sleep. should use it with good air flow. use for outdoor is good idea.",
        "Everything I have cooked on this grill has come out as desired. The only thing I would change would be to make it submersible for easier cleaning.",
        "Ive been looking around for a good size indoor electric grill and finally came across this one. This is exactly what i wanted and i love it. I cook fish on it and make full korean bbq dinners. i Recommend this product",
        "Love, love this indoor grill. Use it all the time and don't have to worry about the weather and it is very easy to clean. I do use it over my gas burner so that I can use the vent to dispose of the smoke.",
        "easy to clean and will literally scorch meats. may be too smoky for some indoor use if you do in fact like to put a nice burn on meats.",
        "We used it last night.. we had a great dinner and cook calbi on top of our dining table.. feels like we are in the Korean restaurant but not costing us a lot of money... I bought also for our shabu shabu...",
        "This grill is the bomb. We are happy. The end.",
        "It does a great job. The meat has a nice grilled appearance, texture, and taste. The grill cleans up really easily, doesn't smoke too much. Beats going outside in the cold and snow to grill!",
        "I got this as a gift to my husband for Christmas. He loves it and we've used it on family gatherings making korean bbq. He loves more that he can grill inside the house during winter.",
        "Pro: It is easy to clean Con: no more than 2 people dish can be cooked. If you slice vegetables too skiny, vegetables will fall down through the grill and end up bottom of the tray."
    ]
}