{
    "entity": "Rebar Cutters & Benders",
    "text": [
        "This tool hit the spot! I'm building a project that requires some 180° bends and found the benders I've had for years would go just past 90°. I ordered this bender and it was delivered the next day! It has the same radius as my other bender, so I finished a bend I had started with no problem. My only gripe is the bending surfaces are painted and will leave paint smudges on the work as they become worn. Polished bending surfaces are preferred though not reqired. They feel sturdy. Well worth the money. I wish I had bought this one for all my bending needs years ago instead of buying the other one first.",
        "What? No 3/16ths? It's well made and does what it does, but if you're looking for a bender to do 3/16th brake line, you want something else. The Robinair 18548 is what you want. If you want to bend any of the sizes this thing is designed for, it'll work great. You can use the 1/4 inch channel for 3/16ths but the tubing will have a tendency to slip. It'll work, but not nearly as well as a proper fit.",
        "I tried to get this tool locally but no one had it stock and it would take a week before it came in, so i turned to Amazon, I although i reviewed several tubing benders from inexpensive to top of the line. Ii wanted a bender that was decent enough to do the several tubing jobs and not a cheap one time tubing bender job. I decided to go with OTC i was very impressed with this product, decent size and the long handles made the job of bending tubing a little better. Best of all i had the tool in my hand by the delivery date...it only took two days!!!",
        "Bender's great*10-grandfather. Only used it for two bends, but it's heavy duty, well crafted, definitely something I could see using in the future. I bought it to bend some brake line, then realized that the brake line metal was actually easily bendable and it was far easier to hand bend then to use this. However, those two bends I did with the tool were easy enough. If I have to use it again in the future I may edit my review, but for now I'll say it's solidly built and seems like it would work well on harder tubes.",
        "Used this for 3/8” fuel line. I’d recommend you practice a few bends before committing to your project. I found if you try to bend a 90* all in one motion, it kinks and squishes the line more than I’m comfortable with. I had to bend in small increments, slowly making my way to 90*. There may be better tools out there but this one works great for me.",
        "Another OTC Five Star product! Being able to purchase quality automotive tools in the most trusted brands from the comfort of home is wonderful. Item arrived ahead of schedule, was packaged securely, and as usual Amazon delivers the items to my front door at about half the price of local retailers! Makes brake lines a breeze This is a product that I feel comfortable in my buying decision, would purchase again if needed, and would recommend to other consumers without hesitation.",
        "First bending tool for brake lines. Used on some copper-nickel tubing. My old school (sorry old timers) dad said that bending brake lines was a test in patience and moral fortitude. I found neither were required. First attempt with this tool and copper-nickel tubing was a one shot out of the park, piece of cake. Take your time, mock up some wire to know your bends and presto change - you've got your first custom brake line.",
        "The only tubing bender I've found to date that doesn't kink the big stuff, and I've tried a few. A+ Product.",
        "Using it to make 3/8\" fuel line for my Bronco. The four lines I have built so far have been completed without any issues or complications with the bender. I find it easier to place one handle in a vise so I can manipulate the tubing and work the bender with more control. It does work better than my other benders that I had in the past, as the tubing stays in the slot with a good fit.",
        "Works just fine. Used it for stainless steel tubing for a watch pressure tester",
        "tried bending without this tool and kinked the tubing. with this tube it bent correctly without kinking.",
        "great tool for making bends in tubing, this is not the best one made, but it lasted long enough for me to replace all the tubing on fuel line, brake lines, and transmission on my recent restoration project. Not exactly \"heavy duty\", but I would buy it again !",
        "I haven't used this item yet. It was bought as a replacement for an exact same tool that was stolen from me. This review is based on my experience with the original tool. They work exactly alike so I feel my review is appropriate. The tool is easy to understand and use. It is versatile and permits difficult bends and angles.",
        "Bending 5/16\" brass thin walled tubing - flattens the outside, kinks the inside and I'm only doing 90 degrees. I don't recommend this one.",
        "Definitely a good product! You will be surprised by how late it is it is made from cast aluminum. With my used so far I do not believe that that hurts it’s integrity.",
        "I was excited to use this but on my second time, the handle literally snapped. Sure, it'll probably be fine for light duty copper but that's about it..",
        "Great QTC quality, easy to use. I had one for decades and lent it to the wrong guy. Glad to get the same one again.",
        "Great product however the item appears to been used, arrived in a damaged box saturated in oil and taped up.",
        "The two handle bender makes things MUCH easier than the old one handle one that I was using.",
        "I've used it to make some 90's and even some 180 degree turns in ACR copper tubing, seems to work fine as long as you know how to use it properly, I'd recommend obviously not using it to make 180 degree turns in refrigerant lines, and maybe watch a video on how to use it properly.",
        "I've used this tool several times with 3/8 and copper refridgerant lines makes tighter cleaner bends than with a ratchet bending tool for small line. Awesome for HVAC.",
        "Otherwise this tool looks like it should do the job. Typical quality for an imported tool. I purchased a MAC tool bender years ago that was mfg. in the USA. Noticeable difference in look and feel. But then the price was considerably more. So this bender should suffice for the homeowner.",
        "Very high quality tool. It would have been better if the mfg. had included an instruction sheet for how to do left and right bends, and when I finally did get the instructions, they were not that great, even when looked at by professional tradesmen who use this or similar tools. Tool itself is great.",
        "Good quality tool for the money. I have replaced every steel brake line on my 97 Ram and I have not had any problems with this tool so far. I wish it had a groove for 3/16\" tube but the 1/4\" groove bent the smaller line just fine.",
        "Excellent quality bender. Much nice then the ones I looked at in the tool stores.",
        "OTC shines again. We had to make a fuel line from the front of a truck to the gas tank. The tool could not have made it easier.",
        "Nice little tool to have. Simply place in your pipe, and bend it until you've reached the angle you need. So far, I have only used it on 3/8 ni-copp. The bends were very nice & smooth.",
        "Worked great. I bent 1/4 and 5/16 steel fuel lines. First time using a tool like this and had no problems.",
        "This is a quality bender. I was able to bent up a new fuel line for a jeep. It really made all the compound bends loot nice. The handles are a little short, but its just preference......",
        "Bends brake tubing easily, and is nice to have when you need more than 90 degrees",
        "I have owned all the other benders out there. Decided to go with this one since it is identical to blue point(snap on). Almost positive its made by the same company just re branded. Very good quality and easy to use. Get it.",
        "Works very well, had no issues with this making all new brake lines for my project.",
        "Easy to use, for the money a great tool! I only had one tube to bend (toilet supply line) and was looking for an inexpensive tool to use that I probably wouldn't be used again. This did the trick nicely.",
        "Used daily. Works Fantastic. I bend brake lines and fuel lines with this bender. Highly reccommend",
        "Nice design. Makes precise bends. Requires some muscle depending on tubing gauge.",
        "seems like it's made to last. I'll update as I use it more. Have used this bender many many times now. Excellent bender!",
        "Bought this because my exisiting tubing bender would not bend 3/8\" transmission lines for my ford truck. Made quick work of all the bends needed and did not pinch or colapse any bends.",
        "Very nice high quality tool. I purchased it to bend the sensitive brake lines in my motorcycle. It works well and is of good solid quality.",
        "Seems to do the job ok, and it's useful having the 180 bend capacity. The degree markings are way off though, but what the hell, I always eyeball it anyway!",
        "Tough enough to make perfect bends in 5/16 solid aluminum rod. Made many bends so far.",
        "It works fine but I bought it to bend 3/8\" and found its OD not ID.",
        "I'm with the Local 198 Union and I use this mainly on supply tubes and flex copper. it is dimensioned perfectly! all of my offsets come out perfect with 1.414. 90 degree 45 degree and 180 degree is precise! its small convenient and it just as precise as the rigid brand. and compact size makes it perfect to just throw in a bucket. others are unnecessarily big. Love it",
        "I really make some nice tubes with this tool. Just use some care and it will last forever.",
        "This tool is perfect, as described by seller and is better than expected. Great deal Would refer to any co-workers or people looking for such a hand tool.",
        "It is a little funny trying to get used to bending my pipe correctly, but that is my fault. THe item bent copper brake line cleanly.",
        "I was installing a hvac unit at my house. I only need around 10 feet of 3/8 copper. Well I never used it but did bend some original pipe and it did the job.",
        "I've only used it twice but it does a nice job and met my expectations. I would recommend this product.",
        "Used this to bend up 3/8\" aluminum fuel lines for my old car. No problems.",
        "these are very simple and effective. It works great and I can't find anything wrong with them.",
        "I didn't like the gap between the two parts but it works",
        "Good tool. Did what I needed it to do and well made!",
        "Has a tendency to kink the tube when bending 3/8 in.",
        "Been looking for a tube bender for 3/8\" copper pipe. This was only $20 so why not. However this thing really works! Probably worth more than $20 (at least to me). Very happy.",
        "Impressed me the first time I used it. I needed to make a 45' just before at a right 90'turn 180' U on the rear axle of a chevy sunfire. Work great.",
        "I've used this several times so far replacing all the brake lines on my 89 Buick LeSabre and thus far works great!!!",
        "Nice tool, worked very well bending new brake lines. Recommended",
        "One of the best tools I own. Forms steel lines for brakes, fuel and coolant with ease in three different sizes.",
        "5-STARS EXCELLENT 3-1 180 DEGREE HEAVEY DUTY TUBING BENDER WORKS GREAT ON BENDING TUBING FOR BRAKE AND TRANSMISSION LINES FOR TRUCKS AND CARS.",
        "Lightweight and works well for steel brake lines although with the new copper lines it is not necessary.",
        "for a reasonablely priced tubing bender it got the job done but wasnt capable of certain bends wich required a different technique or as i did adapt and improvise. oorah!! lol",
        "Great bender. Durable. Would suggest to any real service tech.",
        "Does the same thing, bend brake line just like every design like this one. Just look at the Quality, price and, yes name of the manufacture due to the fact you are working on brake lines and safety come first1",
        "Keept grabbing and holdpipe also puts cress on inside off the bend or any thing more than 45 degree",
        "Works great on SS tubing. Plumbed coolant and oil to my turbo with solid SS lines and couldn't be happier with the results. Plumbed fuel from tank to engine using 3/8 stainless so the fuel would remain cooler and got great results with this bender as well.",
        "Worked well. Tends to pull lines if you don't hold them still. I just wish I could do 360 degrees with this. But it got the job done in the end",
        "It works well, and is a heavy duty product. If I needed to ever buy another tubing bender I would buy this again but I think this will oulast my project list!",
        "Great tool at a great price. I had zero issues.",
        "There is nothing heavy duty about this. It will not bend the hollow steel tubes I bought it for, not even close. It will bend soft copper. It doesn't feel solid, I am certain it will break in half after another few bends. I have no confidence in this tool.",
        "This is a well made tool but the \"Heavy Duty\" nature of the tool makes it into a one-trick pony. I bought it for bending automotive brake lines, and it will bend them with ease. But, it only makes one fairly wide radius bend, and the 3/16\" tubing was really too small for the tool. Keeping the tubing centered in the tool and making an accurate bend requires three hands because the tool can't get a good grip on the tube until the bend is started. This tool is better suited to bending gas line, water lines, or other general larger tubing. For bending auto brake lines there are better choices out there."
    ]
}