{
    "entity": "Rebar Cutters & Benders",
    "text": [
        "My wife and I are in the process of building our home and I bought this so she could help with the rebar. Honestly great product, easy to use and effective. Cost is high but it cuts and bends something that my 12in demo-saw doesn’t do. AND there isn’t a fear of sparks starting a fire. I was able to cut and bend 256 48”x12” #4 dowels in 2hrs using this tool. Ya it costs too much money but with the lack of available labor its worth it.",
        "very cool tool , not cheap but so much easier than the manual bar cuter-bender especially with # 5 bar",
        "Felt a bit too bulky at first but after using the product, the weight was no longer an issue after its performance worked exactly as needed. Functions perfectly and is durable for all rebar bending and cutting uses. Highly recommended!",
        "A bit expensive but worth it if you're bending rebar all the time!",
        "Need to use longer for durability but so far so good",
        "If you work with rebar up to #5 grade 60 this is a great tool. I work with tons of rebar on every job. The price is definetly worth it. pays for itself in labor.....quickly. Cuts quick and does precise preset or custom bends. has no problem doing #5. Well egineered and a joy to use. easy to carry around. HITACHI really thought this one out. I can't see anything that would make it better.",
        "I like the bender but the cutting is not very good",
        "This machine has transformed my company's efficiency and productivity. Not sure how I ever got by without one.",
        "Don’t know why we didn’t buy this sooner. Definitely recommend",
        "I got this for my husband as a Christmas gift because he is a metal artist who uses rebar frequently in his creations. I was amazed to see how quickly and easily this machine shapes and cuts 1/2 inch rebar. It is perfect for getting precise bends with no physical effort and is easy to use. My husband has told everyone about the wonderful Christmas gift I gave him this year. He says he highly recommends this machine.",
        "I am a commercial user and this is a great cutter/bender. It is quick and easy to use and will pay for itself in time saved!!",
        "I use this tool on a regular basis. Works well. Looks to be a decent build. No signs of failure yet. Work mostly with number three and number four Rebar. Handles it with ease. Wish it was a little less expensive.",
        "Great product, have purchased one for all of our crews",
        "Great Machine. Cuts 5/8 Rebar with no problem. Bends 5/8\" with absolutely no problems. Wish I had it a long time ago.",
        "This tool is very easy to use, easily cuts and bends sched. 60 #5 bars. Perfect for forming variable configured pieces on site. I feel like it paid for itself in the first couple of days of use.",
        "Great machine works excellent, bends and cuts, easy to learn, don't hesitate if you need to cut or bend rebar.",
        "the Hitachi rebar bender does what we bought it for and therefore I am very satisfied. I usually expect A little oversell but so far it performs as advertized",
        "The rebar bender works great. It helps make the job go faster, a time saver and easy on the body. Should have bought it along time ago.",
        "when cutting rebar makes a weird sound and smells like burnt",
        "The VB16Y is a remarkable tool. I'm building my own home and there are few significant tasks I can get a 5 ft. tall 105 lb. wife to do. But with the VB16Y I can set up an assembly line and my wife now cuts and bends rebar. It's really that simple. The tool is light enough (around 45 lb.) I can bring it down to the job site. It's bends are repeatable and the tool is remarkably rugged. I bought mine used for our construction but if you are in the business you need this tool and I wouldn't be scared off by the price.",
        "This thing is flat out amazing. There's nothing else this portable and this durable. I had one of these on a job site and bent and cut around 6k #4 rebars, the cutter was still going strong and the bending was bending effortlessly. I hate using the phrase paying for itself, but this tool paid for itself less than half way through my first use.",
        "This was a great machine for a week. I currently have 3 of them and none are in service. So for those bragging this machine must only use them occasionally. Its not for everyday steel workers",
        "This is the iphone of rebar bending tools. Automatic systematic, user friendly, effective. If you find a better rebar bender and cutter in a single package, buy it. This tool makes cutting and bending rebar effortless.",
        "This is truly a gift to anyone involved in bending and cutting. One of my helpers wants to own one before he dies! This is the mans life wish to own one. I bought the VB 16 Y when it first came out and never once thought about the price once I started turning out consistent bends in 3 seconds.You can cut a ton of steel w/o breaking a sweat! This machine is durable, strong, and reliable. I hope you also get the chance to \"play\" with one some day.",
        "This awesome machine caught my eye at a tool show in Hawaii.. I was amazed at how portable and versatile it was. What made me buy it was its ability to cut up to #5 rebar and custom bend stirrups and angles, ... ALOHA"
    ]
}