{
    "entity": "Rebar Cutters & Benders",
    "text": [
        "Don't buy the expensive handles they recommend for these. Go to you favorite hardware store and get a 42 inch piece of water pipe for $6.",
        "I kind of didn't want to buy this. I thought maybe I should buy pre-bent pieces and fittings but when I totaled the cost, it wasn't even close. Those pre-bent pieces and fittings are very expensive and I would have spent around double for my fairly small project. With this, I can tackle my future projects without forking over a lot of money. One regret is that I wish I had purchased 3/4\" one instead of 1/2\" for more flexibility.",
        "Absolutely invaluable for careful bending of heavier tubing, but a long and strong \"stick\" is necessary. Rather than pay the exorbitant prices for a length of steel, there are cheaper substitutes that fit.",
        "Works perfect I love the built in levels everyone will call you lazy but it’s so handy and quick and easy to use! Would recommend to anyone that bends pipe!",
        "I really like the arrows on the Gardner Bender tools. So easy for an older guy to see and read. They work awesome too. Perfect 90's",
        "This tool allows me to make custom Yamaha golf cart tail pipes. Easy to ise",
        "Very strong and the level makes it easy to see when you have the right angle. Used both sizes for a big project (maybe 50 bends) and they made it easy and quick!",
        "This tool makes a perfect 90 degree bend, I was amazed.",
        "Total crap first use, one 90° bend with a kick. Lay bender down and level viles fall out.",
        "Very strong and the level makes it easy to see when you have the right angle. Used both sizes for a big project (maybe 50 bends) and they made it easy and quick!",
        "My old bender was a Greenlee set (3/4 and 1/2) I purchased several years ago. Well, after considerable use they finally bit the radish. Purchased these, and put them to use right away. So far I am very pleased.",
        "I thought it would include the handle. Returned the product.",
        "Item was missing bending manual. I would like a manual sent to me please.",
        "Can't beat the value and price! I originally was looking on Craigslist for a used bender, but nothing came close to this one with the bubble level. I'm thinking that the only way to break the bubble is to continually drop the bender/handle after using it (which we all do), so I wrapped some bubble-wrap around the handle about mid-way up. Problem solved! Highly recommend! This thing will last forever!",
        "Can't beat the value and price! I originally was looking on Craigslist for a used bender, but nothing came close to this one with the bubble level. I'm thinking that the only way to break the bubble is to continually drop the bender/handle after using it (which we all do), so I wrapped some bubble-wrap around the handle about mid-way up. Problem solved! Highly recommend! This thing will last forever!",
        "I'm just a hobby guy....this is an easy to use, fun little tool. I've been experimenting with thin wall conduit tubing. If you follow the directions, it's accurate and easy to duplicate bends. I hooked it to a 5 foot pipe for leverage and that's plenty.",
        "I will update this when I finally use it later on, but it does not come with a manual, unless you include the few pictures on the back of the box as being a manual. UPDATE: turns out I received a 931 bender (does not include a manual) in a 931B box, so I am returning it and hope to receive the proper item, with the manual as well. FINAL UPDATE: I returned the item for an exchange, and I got the same thing, a cheaper 931 bender in a 931B box, and again, no manual, so I am dropping my star rating to perhaps gets their attention, and getting a refund. I'll try another brand.",
        "It's pretty good for the price. I like the levels, and the degree markers, however it doesn't give the length to measure for the stub, like other benders I've seen.",
        "The level bubble was broken when it arrived, and to get a precise bend is difficult with half inch. But it worked for what I needed. If you are looking for cheap, this is your tool.",
        "I bought this as a replacement for the one I broke. It is great. It is like the one I broke..",
        "I have only lightly used, but until I filled down the edges there were dimples where it gripped the conduit.",
        "This is well made and does the job. It's made of aluminum with built in level. Great for the price I paid. Thanks.",
        "Happy with this item , just wished it would have been delivered to the right place took longer to receive ,due that it was delivered to someone else ,other wise item does work fine for my projects",
        "Yeah I said it. This bender is for real electricians, not you homeowner boys and guys that run a little conduit in a basement once a year. It has two levels for 45 and 90 degree bends. I love a Gardner bender because you get more bend for your buck. I mean that when the handle is straight up and down on a Gardner bender your conduit is bent to 45 degrees, not thirty degrees like a Klein or Ideal. The levels make bending even short 90s easy because they are always true.",
        "The design is a good one but only for 3/4\" EMT. If you use smaller 1/2\" EMT the tool is off and 90 degree bends are trial and error and the level is inaccurate. I bought this pipe bender with the expectation that it would work well for both 1/2\" and 3/4\" EMT but found this to not be the case. If I was going to bend a lot of 1/2\" EMT I would buy another bender for this purpose.",
        "I recived diferent b ender biger heavy now i have to pay for shipping back",
        "I have had a 1/2 bender for years, but when I decided to install solar on my home, I elected to use 3/4 conduit for which I did not have a bender. I bought this and it worked very well. I was quite happy with it for the 6 bends or so that I needed to do! I'm glad to have it around, though, and even those few bends were definitely paid for in the savings.... And, yes, the solar was permitted and is producing the energy I'm using to write this review. Good bender...",
        "In the item description, it is said this bender \" bends 1/2\" to 1-1/4\" EMT, and 1/2\" to 1\" rigid and rigid aluminum conduit.\" This is not true. This bends ONLY 3/4 EMT and 1/2 rigid tube. You must purchase a different head for each size of tubing. There is nothing wrong with the tool that I am aware of; but the description should be changed.",
        "If you need a manual to know how to use a bender, leave it to the pros."
    ]
}