{
    "entity": "Garbage Disposals",
    "text": [
        "Normally I don't review products. But this one deserves it. Our disposal broke last Saturday, same model, and it only broke because we did not notice a silverware inside before turning on. Today (Monday) it arrived. I was able to replace it in less than 30 minutes. I never replaced a disposal before, in fact I'm not American so this is the first time that I actually saw one close enough. Easy instructions. Just took the broken one off, replaced the power cable, put the new one in place and done. Working like a charm.",
        "Our 16yr old Badger 1 bit the dust....so I ordered this as a replacement. Hookup was a direct replacement. I didn't even bother to use the flange part that installs on the sink itself...just used the existing one. I did have one operator-error. I failed to read in the instructions where it says to remove the plug for the dishwasher inlet. This prevented our dishwasher from draining....and we thought our dishwasher was going bad too. Thankfully it was an easy fix to remove the plug and now everything is working fine. Hopefully I'll get another 16yrs from this one. :-)",
        "The manufacturers of these product need to develop a simple standard for a two piece system that drops one piece into drain hole and a simple screw on from below. Modern homes have numerous room issues including reverse osmosis piping and and sprayers that are all crammed into a space only a small child or a smart chimp can work. Unfortunately, all the manufacturers, like the car companies when Japan and Europe started cleaning their clock ,will take decades to evolve their designs into the 21st Century!",
        "This was a replacement for the exact same model made 12 years ago that died due to rust. Mounting system is unchanged, which I liked, just popped it on. Noticeably, though, is that more parts are made with plastic and this thing is LOUD by comparison. Looking at the older model I'm replacing it was almost entirely metal and was quiet. Functioned ok but due to the noise it gets a low rank. I did buy this in 12/19 and it's now 5/19 and it barely works anymore as well. Larger items continue to get stuck. Do not recommend it you want a lasting item.",
        "This is a very good inexpensive sink disposal unit. I bought this as a replacement for an identical model that had started leaking from the bottom. Installation was as easy as can be with one exception. In my system there is a little vent line that in some way connects to the dishwasher. I didnt realize that the connection for this line on the disposal unit actually has to be drilled out as it comes completely blocked from the factory. Be sure to do this before you install the unit and have your dishwasher and sink overflow :)",
        "We were able to replace our garbage disposal all on our own which was a wonderful thing. Hate paying someone $100 for a five minute job. The unit works well and I finally feel like my sink is clean again. The previous unit broke but was also getting a little smelly. It was a little more than difficult to get the new one to screw Onto the existing mount. Considering that you need to work under the sink and with the wiring attached, the mounting system could be a bit simpler. Now that it’s on. We are all good.",
        "As this is a direct replacement for our 8 year old unit that developed a leak, this was a snap to install. Unless you spend big bucks for a high end unit, 8 to 10 years is the expected life span. Lets see if the new unit gives us another 8 years.",
        "Easy to install! My old version of this disposal has met its match.. it was leaking and with a price point of under $90 it was hard to talk me out of replacing it all together. (Maybe it could have been repaired, but who knows for sure or how much that would have cost) my dad was able to install while chatting with me and watching A YouTube Video and was done and cleaned up in under an hour.",
        "The same model lasted almost 10 years. I rarely ran the previous garbage disposal so it rusted, eventually locked up and the motor burnt out. I think the smaller ones are known to rust over time. There are tips online on how to make it last longer. If you are replacing an old garbage disposal, I recommend installing the same model to avoid possibly needing to change the drain fittings.it is a hassle if you do not have the righ5 cutting tools or drain fittings. It is a good garbage disposal for the price.",
        "The Insinkerator I had installed in 2006 finally cacked and since that model wasn't made any more, I purchased what was suggested as a replacement. Works as well as the old one with a noticeable drop in noise level, though I'm not certain that the previous one just got noisier as it aged. No complaints so far.",
        "watch it - this one does NOT have a cord already installed - i guess i am surprised because i didnt read and learn well enough before buying, but that didn't stop me from installing a new cord or this motor. installation is easy if you already know how to do these, but if it's your first time, READ THE INSTRUCTIONS and be sure to follow the correct steps or you may be having to redo things a couple/few times.",
        "I bought this disposal to replace the one in our house. I bought the exact same model so I wouldn't have to change the plumbing connections. I arrived promptly and I was able to install it after watching a few youtube videos. It has been working fine. In addition, I looked at the same model at Lowes and it was $20 more expensive. Whats not to like, I highly recommend it for light to medium use as this is how we use our disposal. It has been working for several months now without a hitch. Great purchase.",
        "I was a bit uneasy buying a 'damaged box' item and was unsure of what to expect. Box had a small (quarter sized) 'puncture-type' hole however product was undamaged and had all parts included. Product arrived quickly and was exactly as described and was what we needed. It is a nice smaller size disposal for household use. (Note: be sure to purchase a power cord kit separately (if that's how you plan to power it) as the disposals do not automatically come with them. They are very simple to install with step-by-step instructions). The disposal has been in use for several months now and it is still working great with no issues; also very quiet motor. Would purchase again-",
        "We purchased an InSinkErator Badger 1, 1/3 HP Household Food Waste Disposer (mouth full), to replace the exact same one that broke. Likely due to user error. This thing is what it is, and does what you expect it to. The only issue is that it's not the quietest. Its like a bathroom fan loud metallic blades grinding sound, that isn't obnoxious, but its no pur. For the money its worth it for a family of 3 (2 parents 1 toddler).",
        "My first badger rusted completely thru in less than a year. I unfortunately learned right after I bought this one that they have disposer units with 1,2 and 3 sets of stainless blades. My sink is always pretty much filled with water I feel that this single set of blades the food doesn't get get chopped up fine enough and it clogs the pipe but if I hit the switch it always goes down. I would advise you to buy a unit with minimum 2 rows of blades.",
        "I had a 3/4 HP Garbage Disposal for about ten years that finally went out that went out. when I looked here on Amazon for a new one, The first Garbage Disposal that Popped up was the one I purchased, thinking that it was a Badger \" 1 1/3 \" HP InSinkErator. When I received my product, I noticed on the box..... \" BADGER 1 \" 1/3 HP. So now I have gone from about ten years with a 3/4 HP....down to A 1/3 HP....I have already installed it. I would not purchased such a low HP, had it been described better........ inSinkErator Badger One 1/3 HP, is probably a better Description.",
        "I AM SINGLE WOMAN AND I CALLED AROUND TO GET QUOTES FOR DISPOSAL. AVERAGE WANTED OVER 200.00 TO INSTALL PLUS LABOR. BLAH BLAH. DONT BE SCARED I DID IT MYSELF. THE ONLY THING YOU MAY NEED IS A PARTNER TO HOLD IN PLACE. I JUST CRAWLED IN CABINET AND USED MY KNEE AND A BUCKET FOR SUPPORT ITS WORTH THE HASSLE FOR 88.00",
        "Our disposal had started to leak, so this ia a replacement; it's the same model which was original with the house and 13 years old. There are larger units available but we are a small household and larger was not needed. The new unit is quieter than the one it replaced. Installation required some new connections and mounting was not easy. It must be held at arms length under the sink and perfectly aligned in order to connect to the sink drain. This took several attempts and some blocking to complete the job.",
        "I actually had a handyman install, so I can't speak to ease of install. I can say however that what you will need is: adjustable pliers, skrew driver, plumbers putty, and a power cord. Yes - that's right, the power cord is NOT included.",
        "this insinkerator lasted 44 days before the motor burnt up. item is sold by amazon llc, but you cant return it after 30 days. lets hope insinkerator honors the warranty.",
        "I was thinking of purchasing a disposal with more horsepower until I looked under think to see what the horsepower was on the one that I had been using in my home for years with no problems and it was a 1/3 horsepower so I decided I definitely didn't need to purchase anything more powerful than that for a home that I'm renovating. Great purchase and saved a little bit of money by buying it online.",
        "This is a direct replacement of the same model in our kitchen. The old unit lasted 13 years until it developed an internal leak. Easy DIY installation if you're handy.",
        "I replaced with the same model which lasted 5 years. It appears that the blade mounting was worn causing loud noise and binding. There is no way to repair them so just plan on spending another $90 or so every 5 years. A plumber friend of mine (more than one) doesn’t even have one. He suggest only putting done soft low volume foods into it as they tend to cause clogged drains as well. (Another $100 every 5 years to clean the drains.).",
        "Replaces the exact model that got old and worn. The sound is the same (3 stars before and after). Remember to take the old wire clamp off from the bottom of the old unit. Mine screwed off the old unit and fit the new one perfectly (hard wired). Clamp sold separately if you need one. Overall very pleased.",
        "Easy install. I had an existing badger so it was a really quick and easy install. Detach pipes. Remove unit. Add plug. Put back in. Easy! Just kidding but follow the instructions and it should be very straight forward.",
        "drill out the hole for where the dishwasher attaches, i should have known better but with that being said the instructions don't say to so it took me a little while to figure out why it my dishwasher stopped working",
        "In every house I have, these Badger disposals have lasted as long as 10 years with daily use, the shortest time was 7 years. Lasts longest if you don't let silverware, beer bottles, or other items it wasn't designed for, to go down the drain. Never peel potatoes and try to put the skins of 3 or more into it and expect it to dispose. It will do the job but the skins plug the drain. Throw the majority of skins into the garbage can and dispose a minimal amount through the disposer and drain.",
        "Our house was built in 2006 and this is what was installed, it recently stopped working so I bought this as a replacement. I am no plumber and I could install this within an hour. It is very quiet compared to the old one! So it seems like these things last about 10 years at our rate! I'm OK with that. Our dishwasher feeds into the disposal too. We throw everything from egg shells to food scraps down there and it chops it all up no problem. The quality is great, very sturdy product. I don't know what I would do without it.",
        "This was a drop-in replacement for the same model that was installed in our home by our builder in 2005. The old one began to leak from the bottom of the lower case. It seems 10yrs is the usable service life of just about everything. Anyway, the old one must have been cranked on by Thor himself so I had to resort to using a Dremmel tool to cut the locking ring. The new disposal went on in less than 10min and is far quieter than the leaking unit. It shreds thing just as effortlessly as the old one. This is a pretty easy do-it-yourself task.",
        "The headline of the review says it all. These are quality units and install in just a few minutes. They also run quite quietly, which is also a bonus. Pretty capable little disposal.",
        "This is a direct replacement for my old unit and it was a snap to install Sound is a bit loud but you can opt for the quiet version.",
        "Unfortunately, I didn't do my research until AFTER purchasing this item. The casing fails almost as if it is meant to be a disposable garbage disposal. The one it replaced was the same brand and it was leaking worse than a sieve and severely damaged my under-sink cabinet. Unless the manufacturer has revised the design, I expect I will be replacing this with a different brand in a few years. Don't buy this product.",
        "When we bought our house, the garbage disposal was a cheap Insinkerator contractor model 333. It lasted 4 years. I replaced it with an expensive 3/4 hp model Insinkerator. It lasted 2 months past the 5 year warranty. So, if I've established that Insinkerator is junk, why did I buy another Insinkerator () to replace it? 1) It is a quick and easy replacement. The quick change mounting system is the best feature of insinkerator. Obviously the manufacturer knows something about the durability of their products. 2) We are selling the house within a year.",
        "Great quality. I've owned this exact model before for 10 years but it developed a leak. Most likely it was my own fault as something dropped in that shouldn't have. The best part about this new one was that it was an exact replacement fit, out with the old and in with the new in half an hour. Be advised that the power cord is NOT INCLUDED. Not usually a problem because you can typically re-use your existing cord. Just be aware.",
        "Works well. We were replacing an old model of the same brand so it was a quick install. It eats food scraps like it’s supposed to so I’m happy.",
        "Replaced the builder grade unit that was same model as this in my daughters town home prior to her selling. Few minutes to install and works as expected. Rock solid brand and have installed about 7 InSinkErator models over the years. Would upgrade to better model if she was keeping the place.",
        "The disposal looked new but when I turned it on there was a humming noise and the blades will not rotate even after using a wrench to rotate them. Defective I returned it and it took a while to get a refund.",
        "Amazon needs to change the description of this item. I thought I was getting a screaming good deal on a 1 and 1/3 hp disposal. In truth I got no deal on a model 1, 1/3 hp disposal. Could have driven to the local hardware store and bought the same thing and installed it same day rather than wait 2 days for shipping. The product is good, Badger makes a quality product, but the description is misleading.",
        "This disposal work perfectly. I went months with a cracked/ leaking garbage disposal because I thought that replacing it myself would go horribly wrong. Boy, how wrong was I! I watched 2 Youtube videos and witnessed just how easy it is to remove the old disposal and install the new one. Ordered it, got it and rolled up my sleeves. I replaced my garbage disposal by myself with no assistance. It's working great! No more cracks. No more leaking.",
        "Good product. Easy to install but this was same as disposal I replaced. First disposal lasted 20 years so good brand.",
        "When I removed the old one I found that the drain was clogged down stream of the garbage disposal. The disposal, same make and model could not push it out. With the addition of a plunger (third time) I was able to open it up. I have had this one for about 9 years now and this was the first time I had a problem. I have a back up on the shelf. Now that I said good things about it I will need it next week.",
        "My old one was installed with a new sink. The \"plumber\" didn't have the right gasket, and caulked a PVC pipe in place with a stiff wire to hold it! No lie!! The wire split the casing after 2 years! Water everywhere! I bought the correct parts & did it myself. Not the easiest thing to do (I'm 71) but it's ok now.",
        "The one that came with the house finally died so we bought this one. It destroys anything we put in it, and we are busy cooks. (Unfortunately it did a pretty good job on some utensil handles too!). I would purchase it again.",
        "It was a direct replacement for my old disposal, so it was easy to install. Works great!",
        "Product faulty 3 days after warranty expired. Motor does not turn.",
        "This was for a 15 year old swap out replacement. The previous one lasted 15 years but never really functioned all that well. For example, egg shells and large amounts of potato peelings would plug it up and had to be thrown out in the garbage. I bought the exact same model because I figured that would be the easiest to replace. It was very easy. While replacing the old one I found that a rubber gasket on the exit tube was not properly installed on the original and was the reason for the easy blockage. The new one works great!",
        "I am very happy to find this . It was very easy to install if you are handy . Great product",
        "IMPORTANT. THE OPENING FOR THE DISHWASHER CONNECTION WAS NOT OPEN. I HAD TO HAVE SOMEONE DRIL THE HOLE TO PLUG IN THE HOSE FOR THE DISHWASHER.",
        "This replaced the identical unit I had which lasted 8 years but that is with a wife I told not to jam food into it before turning it on along with her stupid kids that never listened either. They are hard on everything so I fix a lot of things routinely in my opinion this unit has been battle tested and passed.",
        "Bought this one to replace the exact same one that that lasted for over 5/6 years and it mounted exactly as the other saving time on having to replace everything.",
        "*** updated*** Installed the unit as a direct replacement for older version of the same brand and model (simple to install) only to see it leak from the base of the unit (interior leak). Contacted the company, and after a couple simple troubleshooting steps, they quickly sent a replacement unit out to me. Installed and works like a champ.",
        "ordered this bout four months ago had a lil trouble installing to the sink since i did have the same unit before the trouble was trying to turn this unit into place to snap this on, didn't want to put to much force turning the unit to snap it on since i could see the sink was starting to distort was afraid i would crack or brake sink but once installed im sure ill get at least 6 years out of this as i did with the one before it. great product",
        "After 14 years, our disposal finally conked out on us. To my surprise, I was able to install this new unit and clean out the kitchen's pipes in 45 minutes. This unit replaced a builders grade Magic Chef disposal. The HP rating is exactly the same but I did notice the Badger is a tad quieter. This is a great unit for the price. I recommend it to those who use the disposal infrequently.",
        "Replaced the old one, same model that worked for over 17 years. Brother changed it out pretty quickly. He's handy. He did replace the outflow pile. But once it was done, no issues. No leaks. Really glad I chose this model.",
        "Replaced with same model so it took me 30 minutes. I forgot to punch out the dishwasher drain plug that added 10 minutes. Really simple.",
        "I replaced the original unit that came with our home that was 10 years old. This was an exact replacement and other than needing two extra arms while laying under the sink the installation was fairly straight forward. I hope this unit lasts at least as long as the original one.Next time I will see if Amazon sells extra arms.",
        "Good basic item easy to install. Doesn't take up much space under the sink. Don't use for stuff that should go in the trash and you'll be OK.",
        "I bought this product in Feb. 2016. I filter hard food as possible as I can and use it very carefully because it is new. I just find out it is leaking last week. But still looks very new. It is rusted inside obviously. Now is Sep, 2017. It can only last 1.5 year?! Unbelievable! JUNK! JUNK! JUNK! Don't waste your money!!!!",
        "Replaced the same model with a same model after housemates put something down the last one that didn't belong there. New one runs fast, smooth and deadly. (to food scraps anyway) Great product.",
        "I bought this to replace the one I had. Don't know how old the old one was but it was at least 3 years old. I replaced it with the same model. Super easy to install. I had more issues getting the hose to the dishwasher off the old one than I did with anything else. This DOES NOT come with the power cord, so be aware of that. However, even that is really easy to install.",
        "Great product and works well. Just be sure to knock out the drain plug if you have a dishwasher; I forgot and found water on my counter. Other than that it works very well and runs smoothly.",
        "I bought this Badger 1 to replace a previous Badger 1 that came with our house. Each one only lasted 5 years before it developed a leak at the bottom of the unit. That's terrible. Sure it's a cheapie garbage disposal but 5 years lifetime, come on. Disappointed by the durability of these units as they are made of galvanized steel that will corrode and start leaking.",
        "This was a wonderful replacement to the Food waste Disposer. It was a quick swap out, only issue I had is it did not come wired, so I just removed the old wiring from the one I replaced and worked perfectly. If you do not know how to swap wiring or do not know electrical connections I would tell you to get from your local Lowes instead so you can make sure it is set up for how you need it. This one is so much quieter then the one it replaced.",
        "Was surprised how easy this was to install. Works as expected and noise level is reasonable.",
        "If you have one of these on your sink already and need to replace it, this is a no brainer. Pop the old one off and the new one on just need to change the wiring over. Instructions or Google will be your friend. Our 20 year old disposal developed a crack in the housing and we needed a replacement. Bought this and put it on in no time.",
        "This product had great directions and was very easy to install. It even had directions for how to remove the old garbage disposal. All in all it probably took about 30 minutes. If you already have one in DO NOT HIRE someone to do this and waste the money on a project you can do on your own.",
        "Works great I replaced the old one with the same thing last one lasted 4 years",
        "This model is exactly what I want to replace my old one",
        "Great disposal. Easy to install great instructions. It is a tad loud but it's a disposal and its supposed to be loud.",
        "The one that came with the house lasted 11 years. I think that's a pretty good return for a disposal so I bought the same one again. Just beware that if you have a dishwasher you have to literally knock the plug out of the connection or your dishwasher will act like it's broken.",
        "Ordered the Badger 1 1/3 HP unit, yet received the Badger 5 1/2 HP unit. Not too big of a deal I suppose, the connections are the same between the two, although the Badger is a little longer and my cabinet shelf had to be moved to create clearance. My original Badger 1 lasted 11 years before the case cracked.",
        "A friend installed this for me and it took him 10 minutes. Worked perfectly!",
        "Easy to install, took me less than an hour. Works like a charm",
        "In 17 years, this is the 3rd one. I stay with the same model to make the installation quicker.",
        "Had to get under my sink, perfect fit thought,easy to connect.",
        "Bought this for my son who has a condo. Went in easy as expected. I had to purchase a new cord as we couldn't get the old one out.",
        "I think this is a good product for the money. Easy to install as long as you have a second person or something under the disposal to hold it in place while you mount it. It can get a bit heavy trying to hold it up and it it mounted it without help.",
        "Great garbage disposal. It came with easy to understand instructions and a tool to install it. Our plumbing was different than the example, but there was no problem. You may need screwdrivers to connect the hoses, but anyone who is handy can install this!",
        "After around 10 years we had to replace our old Insinkerator \"1-83\" disposal in the kitchen of a mother-in-law suite. The fittings are an exact match. Ten years seems like a pretty good life for an inexpensive disposal to me; expect this one to last just as long. Rather than put it in myself this time, I used the Amazon installation service for the first time. They were great, and the cost of the service was about $80 less than the going rate where we live.",
        "Easy to install if you're replacing a predecessor of the same brand.",
        "I can't say that I love this. but it does what it needs to. I uses this model to replace disposals in apartments. This is the same that's in the big box stores. Same standard 3 mount flange so quick and easy swap.",
        "This waste disposal has a problem with leakage of water that develops not long after installation. It has happened in the last 3 waste disposals over 15 years. Under the counter was full of water each time. The only reason I am forced to keep buying this unreliable waste disposal is that the attachment to the sink is too firmly set by the plumber's putty and I would have to get a new sink to change models.",
        "I ordered this model to replace the same model so it would line up well. The previous unit lasted 9 years. Installation instructions were clear and exactly as needed, and unit works good. This was also the least expensive model with good reviews, so I was a little surprised at how quiet it is. Yay!",
        "If you are replacing the same brand the mount is the same, which saves you from having to replace the mount if its not damaged. however the reason they didn't get five stars is they said it was already wired it was not and I did bring my good electrical pliers,so make sure you are prepared for wiring the unit.",
        "Makes a horrible noise after only a few months use and caused a huge, Very expensive and messy clog downstream when it let something pass that wasn't even ground up.",
        "Make sure you have all the extras needed to install this. I had to run to the home store for plumbers puddy, power cord and I went ahead and replaced a few nasty PVC pipes and fittings. This is the same disposer as the home center but cost less. Runs just fine.",
        "Easy to install. It is very quiet and does a great job.",
        "Just remember, if you have a dishwasher to pop out the plug before hooking up drain to the unit.",
        "We had one that was a Kenmore made by InSinkErator that we needed to replace. This Badger 1 seems to be basically an exact replacement of the one we had. It is more affordable than other InSinkErator models. It was the best value for us. Has plenty of power for our needs and is plenty quiet. We like this model too because it leaves a little more room underneath for spray bottles etc.",
        "Easy to install if you are replacing a previous InSinkErator Badger. So far, zero issues after a couple months.",
        "Works as advertised. I replaced the exact model with this one, so all pipes lined up perfectly, no modifications needed. My last one lasted about 10 years before it stopped working. Glad they still make this model as it makes my job easier replacing like for like.",
        "Hey... garbage disposals are not sleek, elegant or pretty.... but when they quit working after 12 years you quickly realize how valuable they are to our everyday lives! This unit was the same model as my old one and bolted in effortlessly! Everything aligned as before and no plumbing modifications were necessary! Thanks for keeping your dimensions standard, InSinkErator... some of us really appreciate it!",
        "One week after so far so good, makes very little noise, installation was easy.",
        "I own a small condo in a pre-WWII Baltimore high rise. As a result, I rarely have to replace or repair anything. But when my disposer crashed and burned, there was water everywhere. I had this expressed delivered. Our super quickly installed it. It works perfectly. The cost was very reasonable as I did a quick comparative search over several websites.",
        "This is the only model we can fit under a condo sink. works perfectly",
        "Direct replacement and fairly easy install. So far it works great and have had no issues. The previous InSinkErator started leaking around a seam that is not a fixable/repairable spot. Hopefully this one will fares better. Not a bad price.",
        "My original disposal was exactly the same and lasted for 14 years. So I ordered the same system. It was extremely easy to replace. It actually only took about 15 minutes to take off the old one rewire the plug and put the new one in. I would recommend that it be highlighted a bit better not to forget to knock out the dishwasher plug before installing and connecting the dishwasher (although it was extremely easy for me to remove the dishwasher hose and knock out the plug after installation). Possibly some type of red tag.",
        "It is a replacement for the same one I had. Good product, first was in use for 15 years which is why I bought the exact model again. Price is also very good compared to other places. Always find what I need on Amazon, fast delivery and never any problems. I would definitely recommend this product especially since I also had it in my other homes. This is the first I had to replace.",
        "Easy install .....READ DIRECTIONS FIRST..about punch hole for Dishwasher! Otherwise...all good!",
        "My daughter and I installed this. It was so easy even a cave man could do it."
    ]
}