{
    "entity": "Garbage Disposals",
    "text": [
        "Insinkerator has a fire hazard recall on a switch they sell with this disposal. They will send out a replacement assembly but will not pay the cost of the plumber to remove the fire hazard and replace with the new switch. They expect me to crawl under the sink or pay for the plumber myself. So they send out a part that cost them very little and I pay the real cost of their design flaw. Not fair.",
        "I bought the Badger 5 in November 2016 through Amazon. It's now January 2019 and the unit no longer works. It replaced an earlier model Badger that the builder installed in 2012. Both units operated all right but a buyer should not expect more than a couple years use from a new unit. (3 1⁄2 from the first; 2 from the second.) The problem is the interior is severely rusted. See photo. It has been seizing up the past few months but the allen key worked easily to release it until today. No longer functional! The unit was used just as any normal buyer would, in a kitchen and almost on a daily basis. No extreme uses. Obviously, poor quality.",
        "I bought this to replace one that I had for two years because the plumbing was all lined up for it and we will be moving soon. The old one replaced a 15 year old garbage disposal that was taken out when we remodeled the kitchen. This one stopped working less than two years after installation and we found out later it had rusted through and was causing leaking under the sink. Not worth the money and will not be getting this brand in the new house!",
        "I bought one in Summer of 2017 and it broke down back in October of 2018. I did not want to go through of the hassle of taking everything off the sink and buy another brand (since I am a disabled fighter pilot), I just ordered one. However, it supposedly has two years warranty but I have to spend $50 to get a taxi to get it to a UPS office and then pay another $20 to return it. So I just ordered another one so that I can just hang it without taking the sink apart again which would have been a two weeks work for me.",
        "This review written 7/8/2018. Item purchased in April 2019 Installed late June 2019 (~2 mos. later) by licensed plumbers. Didn't work properly from the start. Motor would only make an odd humming sound. Internal grinders did not turn. Used tool to turn the grinders, didn't help. Then, it simply quit. Caused the GFCI breaker to trip. Amazon orders history says return period ended in May, customer service period ended 3 days ago. i will take this up via phone with Amazon but wanted to write this review and post for all to see.",
        "Cons: - Did not include the electrical pack in the packaging, so did not receive the power cord or the electrical screw caps. - It’s ridiculous that I have to remove a metal plate and hardwire the power cord into the unit with electrical screw caps. Why would they not either have a permanent cord attached or a standard electrical cord we could simply plug in? Pros: - Still fits mountings from the same unit purchased years ago (the unit is physically a bit small now but all mounting points remain the same, so I was able to replace the broken unit with the same model and did not have to remount the sink flanges/mounts, just screwed it in",
        "Replaced an Insinkerater Badger 1 which was leaking with this one about 4-years ago because they use the same mount. Now this one has developed a leak. It only has a 2-year warranty, so I have to buy a new one. I’m shopping for another brand with better warranty since there are many complaints about the Insinkerater Badger 5 leaking within 4-5 years. Not worth it!",
        "Bought this to install in our farmhouse sink, there was already wiring and a switch in place previous owners just did not put one back in after the old one broke. Used to have one of these at my old apartment and loved it although a bit noisy. Bought this it was shipped super quick. Install was easy to follow and there are tons of videos online. Once everything was setup I can't believe how quiet this one is compared to others I've used. Also really good price on this one. Make sure to get some plumbers putty, and wire nuts. Also if this is a new install to get a kit for the drain piping.",
        "Why Badger doesnt put a \"TAG\" on the dishwasher attachment telling you it is plugged inside, I dont know! &^$^** After the night mare to install under a farm sink (very little work space through smaller restricted front cabinet door space). I find the dishwasher will not drain because badger has built a plug in the line. I damaged the body of the Badger trying to remedy situation. It is certainly not self evident that there would be a plug in there. I have built 3 houses, I am pretty handy usually. STUPID IDEA PLUGINING DISHWASHER DRAIN, AND NO TAG ON DRAIN saying so.",
        "Easy replacement job! Postman gave it to me at 5:45pm, by 7:15 I was running the dishwasher looking for leaks, and I ate dinner in that timeframe too! Swap the electrical cord from the old one, don't forget to mark the wires, reinstall on the new one, knock out the dishwasher plug, twist in to the sink holder, reinstall the dishwasher hose...and you are in business. $18 cheaper the Home Depot badger model 500 (1/2 HP). Ladies, this was a snap, you can do it, I did!",
        "Quiet and good quality! We are very happy with the disposer, but warning, **this disposer does not include a factory installed power cord**. You will either need to be prepared for the electrical work or want to consider an alternate disposer. The box says 3 easy steps, not true. There are nearly 30 steps in the instructions, including installation of the power cord. We were able to harvest the power cord from our previous disposer, but needed to purchase 'cord connectors' to complete assembly. Although we found installation to be difficult, we were successful and are very happy with disposer itself",
        "Purchased to replace the same model I previously installed that lasted 25+ years. Easy to install, you can use existing mount but I replaced everything with new hardware. Box included new drain tube, flange and gasket which I did not see included in online description which was great as old drain gasket was no longer usable. Easy to install, just follow directions. Same model design so no issue with plumbing connections to disposal. Tools needed basically flat blade and Philips screwdriver and some plumber putty. Runs quieter and smoother.",
        "I bought this unit on JUly 16, 2016 and installed it myself. The unit trips all the time and stops working until I must in the red button. Now the unit stops working and has an electrical smell and some smoke. We are afraid to turn it on - and half the time it doesn't run anyway. I am past the return date. Guess I will buy another brand as a replacement.",
        "I see here I last purchased one in March, 2012. I had purchased my first one some 12 years before that. So they last an average of 10 years for me. The bottom is starting to rust and leak, which is what the previous one did. But they work well and for well south of $100, as well as it being pretty easy to install, particularly to reinstall where I can just detach it from the sink drain and dishwasher... you get what you pay for and I suppose I'll pay another $89.something today, and have it replaced about 15 minutes after I receive it.",
        "I bought this product on April 4th. Now it stopped working after 1.5 months on May 26th. I thought its good product but very disappointed. I had to pay $150 just for installing. Again, I have to buy new one and have it install. I have lost the warranty card so not sure how to have it replaced. I will contact Amazon support.",
        "These rust out in a few years and start leaking. I was dumb enough to buy 2 (a new one after the first one started leaking - thinking it was a fluke) and just after the warranty expired, the newest one started leaking. It is an unbelievable amount of wasted energy and resources that goes into making these heavy powerful motors so that one very inexpensive and irreplaceable part fails and makes it completely unusable. Never again will I buy these disposable garbage disposals.",
        "Easy to install, quiet, worked great until the motor fried when I was cleaning out the dog bowl. The dry dog food was too much for this cheap motor. Don't buy. Lasted 4 months. Update. Insinkerator awarded me a warranty refund which is cool. I used the money to purchase the higher end disposal from insinkerator which is more than double the price but has a 7 year warranty and runs quieter. So far so good. Also easy to install. Completely interchangeable mount kits.",
        "Our old Badger 5 Plus 5/8 hp model finally gave up the ghost after 18 years of service. Which is probably 8 years past it's intended service life. I decided to replace it with this 1/2 hp model. The decrease in power must be negligible because I use this new one in the same manner as the older higher horse power model and see no difference in performance. It's smaller than the old one, which opens up a bit more space under the sink too. Overall I'm happy. I can only hope this new one gives another 15+ years of service as the old one did.",
        "I had to start a return the same day it arrived. It was faulty with a totally jammed flywheel. I realize every product will have an occasional lemon, the fact that the product arrived in what appeared to be perfect shape, but only hummed the first time I tried to operate it (running cold water, no debris, so nothing jammed it from the user end) suggests to me that these leave the factory without the most cursory check. That's poor quality control. Amazon, as usual, came through with their stellar return policy",
        "I installed, this item, it would not work. All it would do is buzz. I called the help line, in the instructions. The company said they would send me a new one. Said it would take 7-10 days, not only do I not have a functioning disposal, I have to do all the work, again! Apparently they have a bunch of bad ones, all they ask for was the serial #. Not a happy customer, right now!",
        "I bought this disposal to replace my leaking Badger 5. I thought it would be an easy swap. Not quite. Everything was fine until time to hook up the drain. Then I find the 'outflow tube' on the new disposal does not stand off from the body of the disposal as far as the old one did. Therefore the knurls on the slip joint nut prevented it from turning. So I had to salvage the outflow tube from the old unit, cut it off, and install it. A Pain.",
        "First off, I didn’t have to replace the mounting bracket that was already installed in the sink. Otherwise, installing this new unit was a piece of cake. Kudos to InSinkErator for not changing the outflow location in the five years since we had the first InSinkErator installed; this way, swapping them out didn’t affect any of the other plumbing. The unit is not overly heavy and it easily mates to the bracket on the sink (installed on first attempt).",
        "This was an exact replacement of mine that started leaking from the seals (14 years old). It still worked but started flooding my cabinet under the sink. Anyone with any limited mechanical abilities or none, can install this with ease. It came with all the materials needed for install, including new rubber. Just remember to pop out the dishwasher waste flow hole in the unit of you have a dishwasher. Removal, install, and cleanup took about 20 min.",
        "Easy replacement if you already have the same brand. Don’t waste your time removing the old sink baffle(unless you absolutely need to). This one fits right on to the old one. Make sure if you’re hooking up a dishwasher to it that you pop the plug out with a hammer and screw driver before install. Upgraded 1/3 HP to 1/2 and it sounds the same and I believe is slightly bigger. Overall good product. Last one lasted 5 years. Note: Does not come with power cord, need to use existing wiring or new cord.",
        "It is helpful to go to youtube to see an actual installation, rather than try to read the directions. For a simple replace (which) I did, it was very straight forward. Awkward, as I was doing it under my sink. But very easy. Disconnect, bang the install ring with a hammer & screwdriver, and out it came. The most difficult part was re-install - only because the thing is heavy. Once I was able to get it to align with the retaining ring, it was super easy to tighten down (a few wacks with a hammer). Works perfectly.",
        "Loved it, me and my boyfriend have no plumbing know how but thankfully the internet is a plethora of wonderful videos and even luckier for us to discover there was no plumbing work involved! We replaced this exact same brand and type and were nervous hoses and knobs wouldn’t line up correctly because ours was 20+ years old. Nope. This brand and this machine are remarkable and a true testament to engineering done correctly, they didn’t change their design but they did spruce up their functionality; this is something I wish all companies did!",
        "My husband was overseas when I noticed the big pool of water under the sink .. after investigating, I discovered the disposal was leaking out the bottom -- the internet declared a new one was required. After reading reviews where folks like me had installed them, I took a chance and ordered this one -- it is the same model as the one I have though ever so slightly different in shape -- a little more squat and wide. After watching a few youtube videos, I put on my big girl pants and went to work. Took around two hours as I had to navigate the current plumbing, but I did it! Very happy!",
        "This was a direct replacement of the previous one I had for 8 years. The old one just quit one day, not sure why but liked the old one enough that I bought this one to replace it. I forgot to knock out the washing machine punch out plate (not what it is called...but I'm lost at the moment for the real name), and my dishwasher couldn't empty the dirty water it had. There are some good videos on installing and replacing this unit on Youtube. Take a few minutes and watch one of those if you've never done it before.",
        "We bought this and it took 3 weeks to get someone to install it. We had it 2 weeks and it stopped working. Our handy man ended up getting it going again, but I contacted the company in the meantime and they blew me off. Never bothered to respond to my request for help. This thing is working now, but it took 2 trips from our handy man AND TWO PAYMENTS to get this up and running. I hate companies that blow off their customers regardless of what is happening.",
        "I'm not sure how long these are supposed to last but this is the first disposal I ever bought and installed myseld. Flawless service for 3.5 years but now it's dead. I feel like these should last longer as I have never had a disposal die on me except for the one I replaced with this one in a house that I had just bought. Install was straightforward. It worked great while it worked. I'm giving it 4 stars because I feel like it should have lasted longer.",
        "A direct fit that didn't even necessitate the removal/replacement of the sink/locking mechanism. The only difference between the old 17 year old model and the new one was the discharge tube had a different mounting plate instead of a screw-on collar. I'm a 70 year old and the biggest difficulty I had was getting on the floor and holding up the disposal to mount on the collar. I lubricated it all with some divers silicon to make it go more easily. Very pleased it only took a couple hours for an old man....",
        "Installed this back in September of 2015 to replace a much older one. Look under the sink this morning and sure enough, it's leaking from a screw in the bottom. It's still under warranty, but I'm not going to hassle with making an appointment, having a tech travel 25 miles to tell me it's leaking and wait for them to order, then install it. A real warranty is my money back. Went to Sears today and got a Kenmore for $130 and installed it myself. See how that goes... Even when it worked, it always sounded like there was a piece of metal rattling around. Not nearly as good as the older Badger I replaced last year.",
        "Originally had the 1/3 hp model and was going to replace it with the same model. However, after reading reviews, this model had a better rating and other end users said that aside from this one being slightly longer in length, it would be a good swap. Instructions helped me uninstall the previous model and install this model. I’ve had mine for over a couple of months and am happy with the purchase. I also find it a bit quieter than the 1/3 hp.",
        "As you can see by the attached photo, the elbow pipe included is in two pieces. There were also issues with the sink drain ring replacement. Luckily I was able to use the old ones, but just beware when ordering in the future this could happen to you. The box did not look like it was damaged or mishandled, so I don't think it happened during shipment. Outside of that, it works well.",
        "Installation was super easy, once I got the old one out. That was the trick, but not because of this, the old one was installed weird by the previous guy. This was the same model I had previously, which was really old and put up a lot of abuse over the course of 13+ years. Just make sure you read those instructions, or you'll end up missing something and having to take it out again. It chops up stuff like a Honey Badger, it just don't care. To me these are like Briggs and Stratton mower engines, they just keep going and going and I don't wanna buy any other brand.",
        "Bought to replace a leaking Badger 5. Not a great garbage disposal, but adequate. Delivered timely. Went to install it and the flange and mount weren't in the box. Had to use the old mount (fortunately the same kind.) I'm sure Amazon would have exchanged it for a complete unit, but then I would have had to send it back and wait for the new one without having a kitchen sink. If mount were present, would get 4 starts for value.",
        "Purchased to replace a lesser model Insinkerator...thought I could transfer power cord to this newer model. Could not. But when I contacted the company, they sent me a power cord immediately and at no charge. I was very impressed. This model works great in our kitchen. Large family, so it gets a lot of use. Definitely worth the price. Purchased online and saved a bit from local distributor. Directions made this a very easy install. Upgrade was worth it and company support is excellent.",
        "Let me first say I've never installed or helped install a garbage disposal before. It arrived promptly and even earlier than I expected. With my 3 year grandson \"helping\" me by holding the flashlight, between the instructions provided and a couple of YouTube instructional videos, this disposal went in so easy. When I hooked up the wiring, (being a pessimist) I expected something to go wrong, but it worked just fine! Thanks for giving a natural pessimist a good of confidence!",
        "I purchased this to replace a like unit that failed after 13 years of service. With the twist lock mounting ring it took less than 10 minutes to remove the old unit and install the replacement. This disposal is reasonably quiet and worked perfectly. If the new unit lasts 1/2 the time of the original I would be very happy and would purchase again if necessary.",
        "It works good but the install could be better...it has a snap on ring to hold the brackets onto the sink drain that is hard to put on by one person...I used plumber putty to hold the brackets in place while putting the silly ring on...it would be a lot better if the bottom bracket screwed on...40 years and no update on how these are made...they really need an update...I used an air switch to control it.",
        "Fine little disposal unit, easy to install. Docked one star cos it doesn't include a 1/2\" cord grip so u have to supply that as well as the power cord, if you're not replacing an existing one. Also the sink mounting assembly comes pre-assembled, they assume that you know it's all held together with a big cir-clip, which isn't exactly obvious, that you have to take off to separate the pieces so you can install them. But we have YouTube I guess.",
        "I had it installed by a professional and I'm pretty sure I would've had some trouble with it had I attempted to install it myself (I'm not that handy). A pro took a 30-45 minutes to do it so I would probably still be installing it now. Works fine...I bought the same model as my old one so I'm used to it. This was the best price I could find compared to local hardware stores.",
        "Replaced our 25 year old Kenmore last year with another fairly expensive brand, highly rated, but very low performer in actual use here. Rented a beach house a while back and the wife was really impressed with the Badger unit in that sink. This identical Insinkerator unit was a direct fit replacement for what we had, good instructions, and really does what it's supposed to do. The 1/2 horsepower unit is all that's needed for anything we run across. Amazon delivers - again.",
        "We replaced our 3/4 HP garbage disposal with this 1/2 HP one and are very happy with it. We compost so we do not have a lot of stuff to grind up but like to have the option as needed. It is quieter than I expected from the reviews and takes less space under the sink. It was installed by our plumber who had no difficulties. We are very happy with it.",
        "Today is 8/5/2017, Disposal was making a loud noise all week. Felt like one of the metal pieces wasn't spinning. Called customer support and they walked me through fixing it, while on speaker. They could hear the noise and suggested I run hard food to break free one of the metal pieces. I didn't have any, so not usually advised, but I put 9 pieces of ice in there and it freed it up almost immediately. Anyway, I just wanted to give a heads up to anyone else who might have the same issue and also thank the manufacturer for being helpful in walking me through diagnosing the issue.",
        "We had a garbage disposal go out in our house. It was a different brand, but I'd heard good things about the InSinkErator Badger 5. I decided to go with the smaller of the models in terms of power knowing I could just upgrade if needed. This thing fit right the first time with about 30 minutes of work. I'm not a plumber but have a few tools and it was an easy install. It has all the power i need for my home of 2 adults and 2 kids.",
        "I bought this item in August if 2017. Installed it, 3 months later it just stopped working. Had someone come look at it, and he said these were great disposals, and I must have gotten a bad one. He went and got me another one just like it...6months later...I’m now looking for a new brand 🙄",
        "My last Insinkerator lasted over 20 years. I bought this one in December 2017 and August of 2019 the motor hums but isn' t strong enough to rotate. It appears that the outsourcing has made this an inferior product. UpDATE! Insinkerator was contacted and unit is under warranty (2 year warranty) and they are sending repairman out to replace the unit. The company has bent over backwards to make sure that I am satisfied.",
        "It started out great. about a month after installing it sounded like it was dragging. I took it out to check for anything we may have put in the drain. All clean, spins freely but sounds bad. called the manufacture and was told I would have to pay a service charge for someone to come to my house and if they felt it was covered by warranty, only the part would be covered.",
        "Replaced a similar product. The grind chamber is some sort of plastic and that is what failed on my old unit. Did not come with a power cord so I cut the cord out of the old disposal and used that. The installation directions were good and I had no trouble replacing the old unit--except for one thing. When mounting the unit to the drain you must hold the disposal up while also holding 2 or 3 parts up. Then you must reattach a heavy metal snap ring. That is very difficult. It took me more than 1/2 hour to do that because the snap ring has a lot of tension. Once I finally finished that the installation went well",
        "Folks, really? I installed the garbage disposal without removing the plug. No instructions were sent with the item. I found out by googleing it. I thought it would need to be remove but I didn't want to void warranty. I would had save me and everybody else the aggravation if someone would had been kind to include some type of paperwork in the box. Not even the box said anything.",
        "When our garbage disposal started leaking we went online to research if it was repairable or not. After determining that it had reached its life span and that leaking from the bottom meant it needed full replacement, we went online and ordered this unit. My husband replaced the entire thing himself! Few hours of tear down and then replacing the new one and it is working like I hired a plumber to the tune of probably $400-$500!!!",
        "Quit working 2 years and 8 months after buying it. Of course this was after the warranty period. It’s not a really good product either, struggles with a lot of the foods I put down it like cantaloupe rind and such. I am very disappointed with my purchase and do not recommend this product to anyone.",
        "Replaced an old one. You got to remove the nut that hold the electrical cord and the metal tube that is in. Remove the old one and replace with this new one. Minimal time and tools required and very easy even for a novice to replace this.",
        "after finally getting our old GE disposal removed we realized the disposal did not come with a cord and had to reuse the one from our old one....luckily we had a friend that knew about wiring otherwise would have been in trouble on labor day weekend would have spent a small fortune on a plumber or electrician. otherwise works great and runs quietly! would definitely buy again, though I hope I wont need to :-)",
        "It is easy to install, just take out the old one and place on your work bench, transfer the parts, MAKE SURE YOU PUNCH OUT THE DISHWASHER PLUG, before you hook up dishwasher drain line. AMAZON'S INSTALLER DID NOT ARRIVE, OR EVEN CALL ME, WASTED A WHOLE SATURDAY!! Installed it myself the next morning before my wife got up and wanted her first cup of coffee!!",
        "This was my first time swapping out a garbage disposal unit. I was a little intimidated when I ordered it but once I received it and put on the power cord it took less than 40 minutes to install. Installation was beyond easy just make sure when ordering that it comes with a power cord or you can buy on Amazon for cheap.",
        "We had a 1/3 hp Badger that rusted out after 10+ years. We looked on Amazon first to read reviews and ratings. Then we went to the local supply stores. The price on Amazon lured us back as it was almost half the cost. In just a few days it arrived in perfect condition. My husband is close to 70 years old with shoulder injuries so he propped it up on a short stool. He was able to install it in less than an hour. This one is more powerful and less noisy. We couldn't be more satisfied so far!",
        "Since I was replacing the same make and model the installation was pretty straightforward and easy except I’m a lot older and working under the sink sucks! The Badger is a great disposal unit since the previous one lasted at least 15 years. Not much has change since the original one I installed. Total install time just under an hour. Definitely recommended.",
        "I just installed this new InSinkErator Badger 5 after the identical old model finally gave up. I bought this model again because the same InSinkErator Badge 5 had been in use in my kitchen since I bought my house in 1993, and I'm pretty sure it was the original one that was installed when the house was built in 1986. So to survive 35 years of use with a family of 4 says something about how well it's built. I hope this new one lasts another 35 years. Check out the independent review. Google \"Best Garbage Disposal Reviews of 2018\".",
        "Our home was built in 2006. We bought it in 2016. The other day we noticed a leak under the sink. Turns out the old disposal was leaking via the reset button. Found this product on Amazon for a fair price. Easy to install too. Just be sure you also purchase plumbers putty. You will need it for a complete install. Buy it.",
        "This product replaced an identical product that I purchased several years ago. One day I discovered a wet area directly under the disposal. Water was dripping down through the center of the bottom - evidently rusted through the bottom of the disposal. This has been reported by several other reviewers. I rated this two starts because of the \"planned obsolescence\" by InSinkErator. They could make one that lasts for a few more dollars, Of course it was very easy to replace, because all of the fittings and sink drain can just be reused. When it works, it works fine, but come on - the company knows of this issue.",
        "As a handyman I’ve installed at least ten of these. They are so easy to install it takes me about 15 minutes. Some things I like: - dependable operation - collar is compatible across insinkerator models so even if you need to replace it, it’s a snap - a worn or ripped splash guard can be replaced separately - parts across models are consistent and available on Amazon In my experience it’s not the HP that determines longevity, it’s how well you clean it after each use. Any particles left in the drum will eventually cause the moving parts to stick. True of any disposal.",
        "I have little plumbing experience and a moderate amount of small DIY home repair experience. After a YouTube video and reading some of the product reviews here I was able to swap my old badger 1 disposal for this one in roughly 30 minutes. The install is very easy thanks to Insinkerator’s universal mounting system and shared tubing sizes / locations. I just swapped the unit, hooked up electrical (similar to wiring a light switch), and reconnected drainage. Very happy with my purchase.",
        "My husband installed this disposal but did so in a short period of time. He wasn’t yelling or cursing so my assumption is that it was fairly straight forward for him to do so. The noise is so much less than our previous disposal which was 18 years old and falling apart. This disposal seems to consume food with ease. I am very careful about what I shove in there. I think for the price this disposal works really well.",
        "Found blockage during removal of second one, a large fish bone. But this unit had been installed many years ago. Felt like it I might just go ahead a replace with new disposal. Purchased same type just newer, did the job at 73 years old, it was very easy for me to R and R since direct replacement.",
        "When I was young many years ago my dad said, \"do not buy anything but Insinkerator\" He was correct. The house we bought had another brand, and I won't go into how bad it was. When we replaced the sink I bought this, it was actually cheaper online than it the stores. Don't forget the power cord, and you don't need the dishwasher attachment, the website recommended. Works great, and small footprint under the counter so you have more room for storage.",
        "I installed it myself. It has been many years since I have done that -- pain in the butt! The design of the Badger simplifies the install because the unit simply screws (about 1/4 turn) on to the bottom of the sink drain. Designer did what they could to keep that simple, but getting that done is still a pain. Might be worth hiring someone to install it. (I am 74 and not as flexible or strong as I used to be. Head still hurts from bumping on cabinet under sink.)",
        "after 3 days I moved mine broke... so I have to buy another ASAP - I looked all prices in many places, and that was the best price, I already new the product so I knew it was worth... i just have to wait 3 days because was weekend... but even this way was an excellent purshase! recommend this product for everyone",
        "Had to order this when my 20 year old unit started leaking. We purchased this unit as it was the exact model of our old one. It was a breeze to remove. All the need parts came with this and did not have to order anything additional to get the job done. You may need a help hand mounting the unit as it is pretty heavy. Twisting the unit in was a little tricky, but my wife and I got it done. We are not technical by any means and still managed to get this done on our own. Hoping for another 20 years, obviously well made!",
        "Issues! Product itself is a nice design. I was replacing the same unit from 7 yrs earlier, which has been a good disposal. The issue is the unit leaked after install. It leaked through the bolt in the bottom meaning it was a product defect, not an installation issue. Great price, but defective product.",
        "Works like a dream! Easy replacement for an old insinkerator that lasted for more than 10years. Which was in my house when I moved in and I was here 9 years before it quit. Being a single guy with the little mishaps with beer bottle caps and all. lol. even a shot glass got shredded. Yep reason why I stuck with the same one. Now I will keep the caps and glass outta there. The price on here is beats everyone's as I searched Lowes, Homedepot, and Manards.",
        "Am 5'1\" 116 lb girl. Youtube how to install it. Only takes about 1 hour total. Hardest part was putting the spring back on, but everything else is straight forward. Keep the power cord to the old one if you still have it. Remember to stab a hole through the plastic part for the dishwasher if you need to connect it. Don't forget lol. Also, it's easier to put on the spring with two people.",
        "My garbage disposal died after nearly 30 years of service. To my surprise they still make the same model. Consumer reports rates this one in the middle... not First but not last either. In the end I decided to buy the same one I had so that I knew the pipes would all remain the same. I’m not worried about it being loud or on 1/2 HP. Besides... my last one lasted. I expect this one to last too.",
        "Beating to connect under the sink, the connector won't let go after it is connected. To another person to help me connect it to the sink. It works fine, but this one is very noisy. For the price, I am sure it is fine but it was harder to install than the more expensive models.",
        "This was ordered to replace our old Badger Insinkerator that quit working. Since it has the same mounting as the old one, it was so much easier to replace. If you can use tools and some basis knowledge of household electrical wiring, you can save some money and install this yourself without calling an electrician. It works great. Note: If you have a dish washer connected to it, don't forget to knock out the plug before installing it. Just read the enclosed manual first and you will be fine.",
        "I replaced a Badger 500 from HD. My main complaint is the old one had rusted so tight where it twists onto the bracket. This looks to use the same metal, so will expect it to rust tight later. Once I got that off it was pretty easy. The hardest part of the install is getting the mounting ring on while keeping the brackets held up, but that turned out easy, just pull it apart good, and it slips on. Hooks up to my existing wiring fine. The included drain tube pipe was too short; I used my old pipe. Would be nice if it came with a small tube of plumbers putty.​",
        "I bought this as a replacement for the one i had and it crapped out 3 months later. And now they are saying i cant get a replacement or a full refund from amazon. Update: made contact with inSinkErator and they were able to help me get the proplem fixed and said they were will to replace if i couldnt fix it. So updating my stars from one to three for there customer service and in a few months if it hasnt broken again i will update the stars again",
        "The product I have always purchased - it really is a great product BUT: this time when I received it, who would have known that it was defective with the screws on the very bottom being rusted. After paying a repair serviceman $75.00 to install it. It was the next day that I noticed that it was leaking. Amazon replaced the defective product immediately, but I had to have the serviceman come back to remove and install the replacement - costing me another $75.00 I was so disturbed by that, I will never buy another product on line that I have to hire someone to install it.",
        "Bought to replace old Badger 5 disposer. I did not replace existing sink strainer which made installation much faster. Install wire and punch hole for dish washer drain. Hook up was easy since the strainer was not replace. Fill sink with water and then turn on disposer to force higher pressure water thru disposer and pipes. Find leak in pipe connection which I tighten the locking ring. Repeat test with no leaks. Saw reviews about crack housing which was why I did the high pressure test and also to clean pipes since my old disposer stop working months ago. Hope this disposer last as long as old one.",
        "Had a Badger 1 that lasted 10 years. Leaking from bottom so ordered another. It came today, I removed the old unit, the cord from the old unit, knocked out the dishwasher plug, reinstalled it. The longest part of the project was picking up my tools so my wife would be happy.",
        "Would have bought the expert installation, but the first available appt wasn’t for a week or so. Could not live without a garbage disposal another day. Took our plumber about an hour to install. Works great!!! Our old one was about 23 years old I think. Excited for our new disposal! (Never thought I’d say that! Lol) This is brand we always had growing up and this is the first time I’ve encountered needing to replace one. Think this is a sold brand. Was surprised that this was delivered usps and that they left it in the parcel locker. So I had to walk it all the way back to the house from the community mailbox. It’s oretty heavy!",
        "So glad I made the purchase and installed this unit myself. It was very straight-forward and didn't take too much time. I'm sure I saved quite a bit not having a plumber come out to replace our disposal. Note, you do need the power cord but not the sink baffle (as was suggested by Amazon). This unit comes with a baffle already.",
        "Great disposal for the price. If you're just cooking in your home for your family I don't see why you would need anything stronger than this. Super easy to install.",
        "Box didn't include a power cord, but other than re-using the old cord, everything needed was there. It runs much quieter than the 10-year old one of the same model that it replaced. Photo is misleading: label says 3-year warranty, but this particular model is only 2 years.",
        "One for one replacement of the previous Badger 5 1/2 HP model which lasted about 10 yrs. Not bad. Installation was a bit tricky if you're not familiar with plumbing but as someone else has said, it's so much easier when you buy the same model as the original you're replacing as everything can be kept and there's less to screw or wrench in.",
        "I ordered this unit 2 years ago. I got a dishcloth lodged in the unit, I could not get it to run again. I remembered that I had ordered this unit from Amazon, so I went to \"orders\", found the exact unit I had previously ordered, and it was here the next day. To my surprise, the instructions had a shortcut for just replacing the unit (not the sink base). It took me only 5 minutes and I was up and running. This was my first time ever hooking up a garbage disposal.",
        "Insinkerator is the best. This was a replacement for a unit that was in the condo I bought seven years ago. Heaven only knows how old the !aet one was. Extremely quiet and effective! Of course, I had to hire someone to install it (and he ran off with the copper pipe LOL).",
        "Previous unit went out after 15 years. These things have a shelf life of about 10 years. Swapped the unit out and fired it up and didn't hear much. Took a second to realize it was simply much, much quieter than the old unit. Came with everything one would expected and was a fairly simple swap as old unit was same brand. No issues or complaints since installation. Hoping for another 15 years.",
        "Ok this is a great garbage disposal. I am replacing the Badger 5 that came with the house I bought 9 years ago. So the one being replace is at least that old. So these are built to last. I also installed it myself rather pay the $150 the store wanted to charge me. The store was also charging $99 for the same model and they wouldn't price match Amazon. So I bought it, delivered the next day, and it took about an hour to install. I used a youtube video which I found which guided the installation of the exact same model.",
        "I like how quiet and powerful the garbage disposal is and how quickly it clears the drain when I’m doing the dishes. I didn’t install it myself but the plumber made very quick work of the installation. I’d had this brand previously and the plumber also recommended the brand.",
        "The Badger 5 is a straight swap with my 11 year old Badger 1. One thing to remember is that if you will be utilizing the dishwasher inlet you need to pop out the plug from the outisde in. I knew this was there but I assumed it was a much more obvious plug and when I didn’t see anything I connected as is and well you can imagine where that went. Other than that this was cheaper and more powerful than my old Badger so it was a no brainer.",
        "Replaced 9 year old Badger 1 that had started leaking. Fit perfect and works great. Only issue I had with install was moving power card from old unit and that only took three or four minutes to resolve. The Badger 5 is a little longer than the Badger 1 and has the same mounting flange.",
        "Replaced the same exact model that burned up due to a pice of metal being caught inside the blades one too many times. Easy to install since it was just like the other one. But I have installed this brand as a new install and it’s the only brand I use in all of my rental houses.",
        "To start with, I am not always very mechanically inclined. That be said, this unit was extremely easy to install. It is probably not the quietest one on the market, but it's not going to disturb the neighborhood. Also believe that it is a great deal for the price.",
        "I've replaced I don't even know how many Insinkerator garbage disposals in my house the 14 years I've had it. This last one didn't even past 6 most. Switching to a different brand bc at this point I just don't trust this brand anymore. Expensive is not always better.",
        "I was really excited to buy this garbage disposal b/c it showed easy steps for installation. I guess it would be easy installation for handy people, plumbers, or contractors... but not for the every day Joe. The instructions were not 100% clear and I didn't want to mess it up. I had to hire a plumber to install this. I have to say the product overall is good!",
        "I replaced this years ago with an InsinkErator from HD but I only replaced the disposal and not the rusty collar and old drain. This led to recent leaking before I replaced the drain and disposal with new plumbers putty for the drain.I had to cut the C ring with an angle grinder (also an Amazon purchase) that was holding in the old unit. I cut the bolds under the drain with a dremel cutting disk. Once I did that it came out fine. I had only 2 bolts of the three holding it in. Everything works well and my leaks are gone.",
        "You cannot tell if it comes with a power cord or not!!! Check the question-and-answers. Half the people say it comes with a power cord, and half say it does not. The product details don't say. The photography doesn't show one. I did not buy this and went to Home Depot instead.",
        "I can't speak to the installation or deal. Here's what I loved about this product. My brother knows how to install it he told me what to get. I bought it, sent it to mom's. It came the next day or the day after I can't remember and my brother put it in the next day. My mom is happily grinding up all her left overs now. :)"
    ]
}