{
    "entity": "MP3 & MP4 Players",
    "text": [
        "Zunes are so much better than I pods, what ever happened to, unless anyway?! The only thing is now with Spotify and all unfortunately these beautiful relics pre-loaded with 30 Seconds To Mars music videos are a forgotten gem. You should still buy a Zunes though, 1 for the lol and 2 for the nostalgia and 3 just because they seriously beat out every other mp3 player in its age. When will Zune start competing with Apple again?",
        "This product is a great one. However though I wasn't able to use it. Microsoft discontinued the Zune software required for the update. So, I was able to download the software, but there is an updated version that couldn't be downloaded in order to put music on this MP3 Player. I just wanted to download my personal music library to the Zune to listen to in my car. Even though it came with a car accessory control plug, don't buy one of these items, you will not be able to download music.",
        "I absolutely adore my zune. I think the brown is really pretty with the green tint on the edges. I'm not sure where to rate a seller but the one that sent mine out was really awesome! It came way earlier than I thought too :) the only thing I've noticed that people should know is that the little hole for the headphones is slightly big so it doesn't hug the little piece that goes inside as good as it should.",
        "Literally just got this in the mail and went to download music, and there's only 11.9gb of free space (I went through and checked, there's nothing on there). I'm not sure why it says 30gb and I know that usually they don't come with actually 30gb (I was expecting more like 27 or 28) but 11.9. That's absolutely ridiculous. Am I the only one with this problem? Plus amazon customer service basically just said they're not taking calls right now. Any advice/help would be much appreciated",
        "okay, fixing this. Originally I could not get it to turn on. I visited Youtube - who knew that youtube was the source of all knowledge and not just kitteh videos - and found there was a lock on the top that needed to be unlocked. I got this because it looked durable and so far, yes it is. The first screen has a good sized font but the rest of the screens are difficult to read without getting out the reading glasses which, big surprise, I don't wear while driving. On the whole it is the best bet of all available for vigorous use.",
        "This is the second Zune 30 that I own! I really like them...and they don't have an \"I\" in their names! This MP3 will hold up to 7500 songs as well as album art! I could save photos and stuff but....I wanted a good MP3 player not a photo album! The only problem with the Zune is the availability of accessories! Stuff with \"I\" in the name is available at any Dollar Store, but Zune products are hard to find...even on line! I will still keep buying Zune's though! I don't need most of the junk available for I-Pods, etc. I want good music!",
        "This is a great item, bought my wife the ipod she wanted, and I got this same time. Both are great, do not let anybody tell you otherwise. If you can get this for less money, than why get the ipod? (plus the screen is great, a definate plus over the ipod)I had considered the itouch since I was looking for best bang for the buck with the best screen. I am so glad I did not get the itouch! A friend has the itouch, and it is great until you realize that you are constantly looking at it through you finger prints (that sucks).I will update if necessary.",
        "I bought this device to listen to some music while I took long walks or when I decided to exercise at the gym. Here are the pros and cons Pros: -Nice sound -Easy to use interface -Good battery life Cons: -You won't get software updates from Microsoft -Physical controls can be cumbersome -Poor visual display (screen quality)",
        "Bought this is 2006. Still works! Great quality. Only bad thing about this is that it no longer holds charge like it did originally (but after 10 years... it's expected). I want to say you have an hour or two worth of charge, but I just keep it plugged in to the charger while in use. Love it! Still plays video with good picture quality and also has a ton of memory still.",
        "I just received this media player. When I tried to install the software to my computer, I found out that Zune does not support Windows XP Pro 64 bit systems (any xp 64 bit systems or window servers). Seems Microsoft does support the Windows Vista 64 systems. Its somewhat funny that Microsoft products is not supported by their own operating systems. Now I have to return the item which is a waste of time since I waited for deleivery, now have to re-ship the product and maybe get a refund with in the next 30 days, if I dont run into any problems with the seller.",
        "Product is as advertised, Good seller and fast shipping unit works and plays just fine BUT......when software was needed that's another issue, Microsoft doesn't offer free software for the ZUNE only available for purchase. Don't bother looking for customer support that cost too!! Was able to find ZUNE 4.8 which will work on a limited basis unable to delete previous owners info, which is a royal pain in trying to download music Very Good Unit BUT VERY DISAPPOINTED in Microsoft",
        "love this device! i owned one back in 07 it was white and it was a great music player with lots of features that where impressive for its time. Mine broke a couple years ago and i replaced it with another zune 8gb but it wasnt the same and it eventually stopped working. Now i have this refurb one and it looks brand new..i would recommend getting one if you want keep your music seperate from your phone like me..lol . only downfall is the zune music subscription sevice..is practically useless unless you had one previously and still have an active account. the software itself can be buggy at times but is useable",
        "I love my zune. A little bulkier, but the interface is better than an Ipod. I have never really gotten used to the scroll wheel and the directional pad is great. Probably not an exercise device, but totally pocket-able. The screen is huge and bright and I have watched several movies on plane trips without any problems, and the battery life is probably good enough for two+ movies on a single charge. If you can find one of these for less than $100 I'd grab it. 30GB will be enough to store all of your music and the video playing is about as good as it gets for the price.",
        "It’s a little bulky to carry around but great use at home. Clarity of videos, pictures and user interface is amazing. However, battery doesn’t last long.",
        "My girlfriend loves red, so when she \"hinted\" at mp3 players (by looking at those \"fruity\" ones), I knew what to get her. I have owned every brand of mp3 player under the sun, and I can say the Zune is the best bang for the buck - especially with the new software upgrade. I didn't think I'd be able to find an affordable 30GB red Zune in early December but Amazon not only had one (and I mean 1 in stock!) but their fast, free delivery got it to me in enough time to wrap it and get it under the tree. She was blown away, I scored major points :) and life is good! Thanks Amazon!",
        "Ordered this to replace my 80 GB Zune I had had for a long time. The charging wires on the old one got bent and could fine no one to repair it, so I measured the amount of space I would need to my current amount of music, pix, etc, and ordered this one. Looks great, sounds great, even came in safety case. The only slight disappointment was that it still contained previous person's pix and music. But there is upside to that as well, deleted pix for their privacy, but got some new music!!",
        "I love my ZUNE. Unfortunately, it never took off like the Apple products. I put music on it years ago, and I still listen to it all the time when I'm working around the house. However, I switched over to an iMac a couple of years ago, and I don't really know how I can do anything to update or change the contents on my ZUNE. But, it still has hundreds of tunes on it and it still sounds fantastic!",
        "I have to say that I was a little hesitant at the thought of buying an MP3 player that wasn't an iPod. Now that I have experienced Zune, I will never go back! You can upload music, videos and pictures from mulitple computers. You can access the Zune Marketplace with the WiFi. And The screen is so much bigger than the iPod Video! You can really see your pictures and videos. The only down fall to owning a Zune instead would be that most of the accesories out there are made to work with or fit an iPod. I LOVE MY ZUNE!!!",
        "I am a Zune lover mainly because I hate itunes. I bought this Zune 30 GB used because I already had a great newer Zune and lost it. When I got this one I was pretty disappointed. It's kind of big and clumsy by today's standards. On top of that the music quality I'm getting out of the this model isn't as good as on the newer Zune (I know that's hard to believe but certain instruments or vocals are really quiet on some songs...it's weird). My advice, don't buy this used. Go with a newer nicer Zune for a little more money and enjoy the fact that Microsoft has made a legit alternative to the ipod.",
        "Bought this to take along on a Honda Goldwing. I only wanted something to play music with large capacity. I turn it on, set to shuffle play, stow it in the fairing pocket and ride. The only thing I don't care for is you have to load the software on your PC to get it recognized and to transfer my music to it. However it does find all the music already on my PC with no problems. My cheap little 1GB just appears as a drive that I can copy music too. With 30GB of music on board I can ride for weeks and not get bored with the music.",
        "Nice storage size, good sound, easy controls. Only thing I'd like to see is a folder option, but that's not something this does. You have to d/l the software to add files instead of opening my computer or something. You should make a playlist in advance because it's pointless to try and make one from the product itself. Gotta do it on the software and load it onto the product.",
        "Plenty of room for music, movies, TV shows...if only Microsoft would've been better at the WiFi capabilities. Or better yet...if they would've made this comparable to the iPod Touch before they dropped it and moved on to a Windows device. Big mistake. They might be able to compete with the iPhone, but honestly? I own an iPhone. Not a Windows phone. Give me a free one and I'll compare it to my iPhone 3GS.",
        "Prior to purchasing this Zune. My son had ipods which were great for a while and then just stopped working.I told him to forget ipods that I would not be buying another one. So, I researched and Zune kept coming up as a recommendation. So now he has his Zune and loves it. Has way more features than the ipod. Since my son loved it so much I bought a second one for my nephew. He's just as happy as my son. Good bye ipods. If your on the fence between ipod and Zune go for the Zune. Can't say you weren't warned.",
        "I had a Zune 30 back in the day and I loved it. It died. I bought a new one. Cannot update software on computer or Zune. Therefore could not sync music. Had to send it back. I was bummed out. Had to switch to an Ipod. Not sure I Like it as well. Too many bells and whistles.",
        "I bought this player for my daughter who broke her 30 gig ipod. This Zune player has it all and works great. It has a nice program to run on the computer that lets you ad all your videos and songs and automatically does it for you. The only problem I had with it was that it is twice as thick as the ipod video. I guess it is up to you and if it really makes a difference. If you are going to jog or do exercises, I would rather have the ipod. Other than the size, I recommend it for the price and quality.",
        "I absolutely adore the hardware, the player itself is great. Large, bright screen gives far higher video quality than I ever expected. The factory headphones are fairly decent quality and when upgraded to a better pair of headphones the sound is amazing. However, the software is beyond difficult to install. I've spent hours on the phone with customer support because of conflicts with my Windows Media Center. I've been using my mom's computer to store my music library and synch my Zune rather than deal with reinstalling so many of my media programs and drivers.",
        "This is my first MP3 player and I found it easy to use and figure out right out of the box. I had previously ripped all my CDs (3300 songs worth) into itunes and the zune software converted my entire library and uploaded it to the zune in a matter of a few hours. I like the control (the ipod button annoys me) and the radio feature works well. The only complaint that I have about the zune is the lack of supporting accessories at this point. You will not be dissapointed unless you are a stubborn ipod owner.",
        "I bought a Zune for my daughter for Christmas. She loves it! My other daughter, who has had her Zune for a while was experiencing difficulties (she's had it almost a year) and Microsoft is repairing it with no hassle through Customer Service under the warranty. I own a Zune myself, and find it a great way to take movies, pictures and music with me on business trips, without having to rely on a laptop for entertainment. They are well built products and very user friendly.",
        "I use this on my long trips.. still works great music storage.",
        "This was the first \"good\" MP3 player I ever had. My last one took a dump on me and just up and died out of nowhere. 5-Stars for the seller too. It looks brand new and started right up! Thanks for a great product at an incredible price! Now that Microsoft doesn't make these anymore they're extremely hard to come by. Appreciate the fast shipping! :)",
        "I wanted a Zue b/c I already have the dock. This unit was a dinosaur. It was not touch screen; there was a big button to press & I couldn't get it to do almost anything. I think they took an old unit, & added memory - can't think of any other reason it's so ancient. I returned it, & all is well.",
        "I bought this zune for my friend because he had windows application with windows media player and thought it would be easier for him to download music and video than the ipod. I was right! he really likes it. He has been able to download alot of his music and video collections and still has plenty of available space left. The price that was offered by Amazon was the best around for the same exact unit other stores were selling. This was a great buy!",
        "I really like the Zune, it has a lot more memory tha the other mp3 players, and you pay the same price that you would pay for the other types. Plus, I was even able to get it in my favorite color, so it's a double bonus for me. It's also cool that you can share music with other Zune owners (even though you can only play it three times). I recommend this product for anyone who listens to a lot of (or different variations of) music. This thing Rocks!!!",
        "This seems to be more heavy duty than the iPod. I've dropped it many times with no noticeable damage. The translucent cover that it comes with probably helps to protect it this way, but it makes the item a bit thick (two cm or so). You won't need to get a case for this. The Zune software for syncing media is a bit more circuitous and less intuitive than iTunes, but I prefer how it begins with nothing in sync.",
        "I had my Zune for a few months when my computer and the Zune software suddenly stopped recognizing my Zune. After deleting the Zune software and reloading it my computer recognizes the zune, but the software still doesn't. I have done everything that the Zune trouble shooting guide suggests, and to no avail. The internet is full of discussion boards about the same problem. Many times the people in the discussion board note that the Zune hotline could not fix their problem either. I never had any problems with my ipod. I have decided that the money I put into the Zune was a waste.",
        "I have had this player for some time now (sorry about the late review) and I really love it. I have it hooked into my car radio with an add-on fm broadcast unit since the radio is older and does not have an 'aux' jack in the unit. I have over 200 albums loaded and still haven't maxed out the drive. For the price, I don't think you can beat it.",
        "I cant tell you how excited I was to get this Zune. I stinken love it! It hold a lot more then an ipod and its a whole lot cheaper! The only proble Ive come across is that all my itunes music that I had wont transfer over to zune like it said it would, but Ive managed to get a little of my music library transfered over. But other than that i really really REALLY love my zune. Get it while you can you'll love it!",
        "So far I LOVE IT. Im still figuring things out with it but overall it is great. I am putting music on it every day and have loaded my pictures in it. I am a photographer and I love to have my work close at hand. I use my Zune at work. When I get there in the morning I turn the music on to shuffle and rarely hear the same song twice and it keeps me in the zone all day long. I am very happy with this!",
        "I haven’t figured out to add songs. I mostly listen to the radio. It works beautifully.",
        "This didn't even work. Wouldn't allow me to add anything onto it. No computer recognized it either. Garbage product",
        "Before you freak out over two stars, just know that I never actually got to use the Zune! Bought it new and followed directions for first start exactly. Let charge first but the device would not keep a charge! After a while it did get a full charge but the device shut off after 15 seconds and refused to turn back on. Customer support made me feel smart, but did not solve my issue whatsoever. If you get a Zune that works, awesome, but be wary. Manufacturer does not care if the new products they sell work or not.",
        "great product for the money! had to replace the harddrive for a new one since the old drive died on my after 3 months of use, but in the end it still works and it still runs great on the old bat",
        "I bought this Zune 30 GB MP3 player for my brother's 21st birthday. It's EXACTLY what he wanted! Because I pre-bought it the price was FABULOUS! Awesome! Amazon said it wouldn't get here before January. It was here before December! I was thrilled (as his bday is early December). He has been using it non-stop since! Great deal! And the quality of music/video/pictures is just as good (or better than) an Ipod!",
        "This is nice when you are going out for a walk or just want to chill out. One thing though, Ocean Reef Electronics didn't send me any directions with it & were of no help when I emailed them. I have no way to print the directions & going to the Zune site was not of much help either. That was really a shame. The seller should have provided an instruction manual with the product!!",
        "I like all the storage. I was able to fit all my music on there. My only complaint is that (at least so far) I haven't been able to organize my music the way I like. It makes folders by name of artist and doesn't list them like I have it in my folder.",
        "I am older (61 yrs) and wanted an mp3 that I take on my walks with me. The screen is big and it was very easy for me to download my cds unto the Zune and very easy for me to select an album to play on my walks. I also have downloaded pictures of my grand kids so when I go out with my friends I can show them. That was also very easy to do. I also like the fact that you can re-charge the battery by plugging into an electrial outlet or car outlet (like a cell phone).",
        "I had one from the time they came out this size - tell about three months ago the battery went dead on - it will not charge any more - I used cause it had A FM player & nothing else @ that time had one in it + the space you had back then - when this thing cam out 30 gigs was A lot",
        "Very pleased with the condition, basically new. Only two very minor marks on the back of case. They put a new screen on and you even get to peel off the film. MP3 player very easy to use. The other upgrade using Zune's music software on your computer vs. Windows Media Player; only problem with Zune music software they rate music like, hate or unrated... losing the 5 star system.",
        "I got the brown Zune right before Christmas as a gift to my self.. I must say its the best gift I have ever gotten. Set up was easy. I have had only one problem with downloading and that was easy enough to solve.. My Brother who is Mister IPOD MAC guy..took one look at my Zune and said.. well crap its better than my nano.. Oh yeah i got mine for 99 bucks on here .. I love it!!!! Oh yeah download stuff from Amazon because it works on both formats.!!",
        "Got this Brown 30GB Zune in 2007 for a steal (especially for the storage size). After all this time the thing still works great and stores most of my travel tunes. Of course the bulk and weight make it seem very outdated (my husband and I have dubbed ours \"The Brick\") but it still gets the job done!",
        "This was a gift for my father inlaw. He loves it and uses it daily to listen to music of course. Great condition and color. Holds all of my father inlaw's music without a problem.",
        "Well this didn't start out as a great purchase but the seller stepped up and made right. Would definitely buy from this seller again.",
        "Very good media player. Good video and sound quality, make sure to encode media in native formats (wmv, wma, etc..) or file transfer will take a long time. Nice that Microsoft allowed customers to update to new firmware (adding improvements). The wifi feature is pretty much useless, it lets you send files to other zune owners quickly and easily, but they can only play the file a few times or keep it a few days then it expires. Software typical Microsoft = good and bad, Ok once you learn to work with it.",
        "This was my first zune I have ever owned. I knew nothing about them but I am so glad I decided on a zune. It is super durable. This device is by no means delicate which is exactly what I needed. This older model is not a touch screen which was exactly what I needed. It has a huge hard drive which is a super bonus especially considering how affordable this device is.",
        "Bought this on sale for my son for Christmas. It has an incredibly sharp picture and he has put a lot of things on it already. We have found the synching gets trashed when synchin while using the computer online so he does it when the computer is not in use. It takes some time. He is very happy with it. A friend at work plays it through the port with speakers and the sound is great.",
        "I am using it now and it seems to work very well. I have had an Ipod for 4 years, until it self destructed. I bought this for the price of materials for the cursed Apple. Zune software is a lot easier to use and more me friendly. The Zune itself has more features, and works exceptionally well. I strongly recommend this, and my only regret is not getting one before.",
        "The Zune worked for a week but now it requires a firmware update which isn't available from Microsoft website to download. The Zune can't be used anymore and it can't be fixed.",
        "Love it still working they do not make them like these any more",
        "I have owned a Zune for a few years now, but my children wanted them for Christmas this year. I ordered them and the ease of adding music, vidoes, picture and games is outstanding. The best part about this is the seller I purchased them from, Osman. When the original shipment came one of them was damaged and he express mailed it to me so that it would be here for Christmas. If you are reading this review and planning to purchase this product, I suggest buying from Osman. He has the colors black, pink, red and white. All good quality and if they arent he will replace them with no additonal fees or charges.",
        "I'd give 8 stars to the vendor for service. Shortly after I ordered my ZUNE, I realized I'd not provided a current address for delivery, and when the postal service refused to help me intercept it, I contacted them to send it to where I live now when it was returned. They did. I'd been a happy ZUNE owner for years, but I'd inadvertently flushed my first one away (don't ask!!); this one is so far performing quite as satisfactorily as my first",
        "Zune is a nice media player. The software Zune 4.5 is way better than Itunes in my opinion. If you want to get a media player go with the Zune instead of the Ipod. The Ipod is more popular but always weigh out your options. You get 30 Gigs on a Zune for the same price as a Ipod Nano that only has 8 Gigs. I recommend this product to anyone looking for a media player. Zune is the way to go.",
        "I WASN'T AWARE THAT THE SOFTWARE NO LONGER WORKS, AND MICROSOFT NO LONGER SUPPORTS IT. THE VENDOR WAS VERY GOOD. IT STILL WILL SHUFFLE PLAY BUT EACH ALBUM AND SONG HAS TO BE LOADED ON BY ONE, AND ALL PLAYLISTS ARE GONE. STILL WORKS WITH MY LOADING DOCK",
        "All and all, fantastic. I have owned one before but it got stolen from my car so I had to buy another one. Only thing I noticed was that every now and then it wouldn't really play songs anymore, I could skip through them but they wouldn't start playing. So I had to shut it off and turn it back on, then it would work. But I love this Zune!",
        "This music player works fine after many years. Freezes at times.",
        "The Zune 30 is a great buy sice you can easily upgrade it to the lastest software (The same software as the Zune 2) For the low selling price you now have the same functions as the Zune 2. The old software (Firmware) was buggy and not very nice. The new software is a great leap forward and is much easier to use. Sound and picture quality is great and with a little effort you can turn included your pictures and even include movies to watch when you travel. It is much nicer to carry than a heavy DVD player. Grab one at this price before they are sold out.",
        "I was very pleased with the recent purchase of the 30g Zune. There were a couple of issues I ran into when downloading: First I found that I loaded 800 or more songs from my cd's and after loaded I deleted some of them to find that when I synced it the songs deleted were removed from my Zune. That was very frustrating. A book with directions and FAQ would have been most beneficial then I would not have had to look all over the internet to find out what the problem was. Overall I do like my zune",
        "I order a used Zune 30 gb. not knowing how it would work. Well the Zune has a great support website. The battery has a long charge which makes it perfect for my use as I work long hours and need 10 plus hours. 30 gb make this hard to fill with music. Comes with radio which is a great feature. I won't be suing it for pictures or videos so I can't comment on that. Paid $80 for this one and very happy with the purchase. I'm going be on the look out for another maybe 80 gb Zune because of the great sound that comes from this player.",
        "I saw the brown Microsoft Zune listed for about 89 bucks... I thought it was an error but checked out. Good display and sound (with FM tuning). Through the Zune software while syncing, a few of my CDs listed several multiple tracks (`Frankie Goes to Hollywood' goes a long way). For a first MP3 player, the Zune is a good product. 30 GB will take awhile to fill.",
        "Even though this is a bigger Mp3 player and not the new slim ones, I still love it!! It works great and it holds all my music. I like the fact that its a bigger player because I have lost some feeling in my fingers so picking up little things that dont weigh much I end up dropping and not knowing it at first so this player is just right for me! Shipping was fast as well. Plus what i spent on it wasn't bad either!",
        "This is my second Zune. Had one that I used constantly for over 4 yrs. Finally wore it out and went to see if I could find another one. I did and got alot more that I counted on. They had reconditioned it. It had a new battery, more GBs and a new screen. It was just like my old one but instead of getting 30 GBs, I got 80 and got a good deal on it. Very happy with it.",
        "The Zune delivers a good, usable MP3 player. Durable - 6 of 7 family members are using Zune 30s, and have been for several years. An occasional operational quirk is all that has been encountered with these - my daughter's is in use almost nonstop, and has outlived an iPod nano and about 30 headsets... Purchased this unit to give as a gift.",
        "The 30 GB ZUNE is absolutely the best product out there even though the newer versions are out on the market, this product can't be beat. You can't purchase any brand with the equal amount of space and features as this model for the same price, heck even the 4 GB model is more than what I purchased this one for. It was purchased as a gift, so its going to be even harder finding the 30GB ZUNE at a reasonable price. I'm glad to have been able to get one.",
        "Received my Zune...was just like new and even came with a leather case from previous owner. However, love the Zune have put on a ton of songs and still have tons of room left. Mine was white and so makes it even more girlie! Hubby has had a Zune for years, love it too. Which is why I decided to go with a Zune also!",
        "I had some lucky timing and got the Zune 30gb for $99. While it is a little clunkier and not quite as sexy as the 2nd gen Zune it is still a great media player. I'm still waiting on some accessories and I have to say that I am a little disappointed by the dearth of accessories available. The Zune branded items seem a little steep in price and third party manufacturers must not have been all that interested in stepping between MS and Apple on this turf. I'm enjoying it, especially for the price.",
        "I purchased this product from Justine's Electronics. All of the reviews were good so I thought Justine's was a reputable company. The purchase was for my nephew who lives in another state. The Zune battery life is only 2 hours. It should have a battery life of 12-14 hours. After inquiring, I was told by Justine's to buy another battery. Wow! I could not believe what I was told by that company. The Zune is less than 35 days old. I would never recommend buying anything from Justin's Electronics. I'm thinking that I paid $200 for a refurbished product. You live and you learn. I will never buy another electronic off the internet. Thanks for nothing and taking my money!",
        "I bought this because my 16 GB was running out of space and i had stuff to put on there. The 30 GB holds everything in my collection and at least two audiobook, and only makes a dent in storage. The only thing that sometimes gives me trouble is the bulk of the player, but having once had a 30 GB Mp3 Player, i expected this one to be bulky. I love Zune, and i love this player!",
        "I got my 30gig Zune as an X-mas gift and took it for a test run today. It's a really awesome mp3 player so far, nice storage for the price paid for it, easy setup and software updating. I even thought that the packaging was pretty neat. Synced right up to the music on my computer and ripped a cd with no flub. Not a very detailed review but I'm happy with this product.",
        "Love this zune, works every time , amazing storage , would buy it again, it lasts forever. Can't stress how much i love this zune, plays music well with the smart dj and true gem",
        "I'm not yet a Zune fan, but this unit does do well. Microsoft had a good idea to put out a mp3 player that also played video. These are reliable. The \"red\" is sort of a faded red, but the machine itself is really good. I made good points for picking this one up as a birthday present. It arrived well packaged, and has worked as promised ever since.",
        "Overall it been a solid MP3/Video player, bought it over the holidays when they had it on sale for 90 buck as a mp3 player upgrade for my 8 yr old. Two firmware update later it's become a really good player. The Zune market place allow me to give her some choice but still have control of what she can an can't get and video looks great. As a video player actually like viewing better than my ipod.",
        "Had this device since 2009. Finally just locked up on me December 2014. It is stuck in a reboot loop. EDIT: Turns out I just need a new battery. Cheap fix. It was a good player with a great battery life [10 hours+]. Didn't like cold weather though. Would restart on me when I would take it snowboarding on cold days. Major cons 1: No keyword search for songs 2: No way to create and save playlists from the player",
        "This was on a clearance on Amazon, got it for my daughter for Christmas and got a lot of bang for the buck. She is VERY happy with it, was more than she expected. The only downside is the color (yuck) and screen quality is good but not great. Very good sound quality, very very good ease of use. Great capacity if you're mainly a music (i.e. not a video maniac) person.",
        "Works and functions well for an older versiin, it is a bit bulky and I thought it would be more slender; hence the 4 stars",
        "I really like this product! This is the first MP3 player I've had and I'm 54 years old! The music is clear, I have 200 CD's loaded and it's not even half full. The screen is large and also very clear. I have been able to download pictures of my grandkids and have them with me all the time. This is a great product....I can't compare it as I'm not familiar with the others, but I have been so happy with my Zune that I bought one for my husband too and he really likes his.",
        "Even with the recent device software updates, the Zune has a way to go to catch up with the iPod. I believe the PC software update has been a major step backward. iTunes is so much easier to use. However, when it comes to price, the Zune 30 is the best value, over the new, flash memory based brethren, and similar iPods.",
        "I was in the market for a media player with video and more and saw the Zune. It was such a deal ($99) that I could not resist. It is fantastic. I now have all my music, pictures, videos, TV from my Tivo, Podcasts, and videos from YouTube in one place. I bought the car adapter as well, so I can play my favorite tunes everywhere I drive. With TV shows from my Tivo, I can keep the kids entertained while traveling as well. The device interface is intuitive and quick to learn, and the software interface is very easy as well.",
        "I cannot believe that the Zune comes without a manual! I would like to use Windows media player to managee my Zune's content but instead I have to use a software that I do not like at all. I was hoping to move the music, pictures and videos from my computer using the Zune as an external drive. I find it very cumbersome!!!",
        "Pros: Huge, vivid screen. Truly excellent sound, even at low volumes. Robust design. Excellent updated software/firmware. Wireless connectivity. Best packaging ever. Cons: Huge, bulky chassis. (versus the competition) Backlighting can be uneven. Battery life not quite as advertised.",
        "Wish they still made these -- the PERFECT player for audiobooks. Instant on, no accidental jumping between chapters, but if you keep holding the rewind or forward it gains speed for faster scrolling. I have 2 of these and they hold a ton of audiobooks for long drives or working around the house or yard.",
        "This thing has already broke; it wont sync to the computer when you plug it in right away, you have to unplug and plug it in multiple times for it to finally sync then when it does it wont update the usage rights so you cant play your songs. I regret buying it.",
        "The seller said I would be receiving a refurbished Zune, you know, one that WORKS. I get it. It's fine. It turns on, it's empty, everything seems in order. I download the Zune software from the internet because the device did not come with such, and then the Zune starts rebooting. It will not get out of reboot mode. I researched this issue on the internet and apparently they sent me a Zune with a corrupted hard drive that will not work in the updated mode. I only used it for one day. One day. Don't buy anything from this seller. I just wasted about 100 bucks.",
        "This is just outta this world..After you get to understand how to use this..You'll love it..It's just ashame you can't drag and drop everything you want to from your computer.. And you will be spending some more money to download some good stuff from an on-line web site.. Amazon did have the best price, for sure.",
        "Refurbished but works just fine. Occasionally randomly reboots or locks up after three years of use. I do need to break down and purchase something else at some point, however.",
        "This player is a major pain in the neck. It is very hard to download songs, transfer songs that I already have (sometimes it works sometimes it doesnt) If I dont want to have all the songs on my hard drive...well there is just no way I could figure out without the stupid software deleting in my player also. The software stinks!",
        "I got this before the iphone first every came out. I though the big round button on the zune would but some of a touchpad like the ipod but it wasn't. It was ok for what it was. Though it was expensive for something that can't do much. If I could do it again, I wouldn't have gotten it.",
        "The Zune is great - it lacks what a lot of things do today which is directions - but once I started to use it I love it. My husband and I both have one and you can send a song from one Zune to another - it is super. also if you sign up for a membership the majority of uploads are free...I like it better than an ipod",
        "I purchased the 30GB Zune for my Fiance for Christmas and she loves it. It is very easy to use and very easy to set up! The rest of my family has Zunes as well (80GB modles). The only thing I don't like about the 30GB is the size. It is bigger than my 80GB. But none the less the screen size is so much better than ipods. And I can tell you that at the store I work at we have never had a return on a zune nore have we sent one off to get fixed. ipods come back all the time. This product gets an A+",
        "I love my Zune - it is alot bigger and heavier than my son's IPOD which is a drawback, but it is very easy to use and I can plug it into my car's sound system - no more fumbling with cd's on my long drives on the freeway! The only disappointment - it was sold as \"red\" and it is actually a odd pink color. I also purchased the travel pack with it, which was a great buy, I have a car charger, so when the battery runs down in the car I can plug it in and keep on listening!",
        "I've had the 30gb zune for about a month at time of writing. It is definitely a player worth considering. If you're completely sick of ipods, their small screens and annoying controls (like I was), this is the only other mp3 player that you should look at. At the current price, it's a steal and you get an excellent product. Videos look amazing, sound is perfect. Battery life is also very good, lasts me about 4 days with about 2 hours of use each day (mixed audio and video). Overall, I greatly recommend this product to anyone, even if you're considering an ipod. I personally like these much much more.",
        "After all these years, its still working , my kids had many I pods but my Zune still works great, I love it !"
    ]
}