{
    "entity": "MP3 & MP4 Players",
    "text": [
        "This MP3 player did the job on one of my thu hikes. You definitely need to use the SD card for additional memory. It's a good little player for the money if you don't want to spend $100+ on an Apple.",
        "I like the K-I-S-S (keep it simple stupid) approach to this player. You use Windows Media Player to manage your music and down-load it to the player and the Sansa simply plays what you've loaded. No extra software required, just drag & drop into the player; cool! The player is VERY light weight and straight forward to use. I also realy like the capability to upgrade it later on by adding an SD card - nice! Pros: Light weight Easy to use No extra software Upgradeable Replaceable - AAA battery Cons: Battery door seems a bit flimsy (use the case provided to protect this)",
        "This is an impressive little device. I just loaded it up with 18 CDs worth of music at FM radio quality, and it's playing fantastically. Using CD quality I could only have fit half of that without using an expansion card, another great feature of the device. The player comes loaded with accessories too, including a sync cable (that works great with Window's Media Player's synchronization and straight drag-and-drop), a clear protective case, an armband, and a pair of in-ear earphones that have terrific quality. It also features an FM receiver. I highly recommend this player to anyone looking for a robust, expandible MP3/WMA player loaded with accessories at a great price.",
        "I'm liking this MP3 player. I specifically got it for the added radio and because it uses regular replaceable batteries. I've had to retire many a unit because it just wouldn't charge any more. Between that and the bargain of a price this w=one is great. My only problem is that to go to the radio feature you have to select it in the menu... wouldn't be a problem if the menu was in english. It's in chinese or korean or vietnamese or something. I'm going to be contacting the company to see if this can be changed, or at least to get a translation so I can use it.",
        "I made my purchase decision by comparing all the Amazon reviews for similar MP3 players. This one seemed to have the least negative remarks for an affordable unit. I have NO negative remarks. The sound quality (using the equalizer) is better than I had expected. The controls are not what I'd call intuitive, but they're easy to learn. The complaints about the armband case are puzzling - it's tight, but you just need to push it down from the top rather than pull it - comes right out! Maybe my MP3 tastes are not as advanced as some of the other reviewers but I think this is a great expandable player at a very affordable price.",
        "I used this all throughout high school when I couldn't afford any \"i\" products and this thing works like a charm! It sounds great, the headphones are awesome, you can sort and find songs easily. This is the perfect MP3 product for anyone who is on a budget but wants a great product. I highly recommend it!!",
        "I like the simplicity and the beauty of it (it's so different from other mp3 players out there). I figured out how to add my own 'genres' and how to make it recognize my files and folders (retag your files, I simply use WMP to do it). I just need to know whether there is a way to make it pick up where it left: turn it off, then on, then say minute 2:34 seconds in the last song played (that's 6minutes 14 seconds long for example). Another thing: where can you get it new for less than $50?",
        "The product is excellent the 500MB held a little over 150 songs for me in WMA format. It was relatively easy to learn. I had to adjust the graphic equalizer to make the sound right for me. The battery cover is a bit loose and the screen display is a little small if you do not have 20 20 vision. I'd recommend the 1GHZ unit for more song capacity and loose the ear buds too tinny. But it does what it was made to do give you excellent sound in an easy to figure our package.",
        "This MP3 player was great - when it was working. We've had it two weeks, and it just died. We changed the battery twice, but that's not the problem. We are waiting to hear back on what to do next. If I had to do it over again, I'd spend a bit more and get a better player - one that will last long enough for me to get tired of the songs I have on it!",
        "I received this a month ago and loaded all my songs on it within minutes. You can drag and drop songs right onto it... very convenient. I put in a 1 gig SD card and it worked like a charm. The BEST thing about this player is the headphones. They are by far the most comfortable earbuds I have ever used. I would like to get a few more sets of these for my other players (including my Ipod Nano). Battery life is good also. I think in 1 month, I have only replaced the battery once.",
        "I don't have the money for a I-Pod but this is a wonderful alternative. It is small and portable and its big plus is the SD disk drive that comes on it. This way you don't have to buy a whole new MP3 player when you run out of space. Just get a new SD disk so space is unlimited. Another big plus is the arm band that comes with it so it perfect for running or walking and you don't have to stuff it in a pocket. The one downside is that you can't create a playlist and have to thumb through the songs manually. But it is easily compatible with Realplayer and a real find for the money.",
        "I am 63 years old and did not want to pay a lot of money for MP3 player, and this is the unit. For less than 69.00 you got a great little player with lot of memory space. Even a fm radio. Down fall is the earphones that come with the set , but these can be upgraded without spending a lot. Battery last a long time. I do wish you could seperate memory chip instead of the music on one big chip.",
        "While this device is easy to use and gives you the ability to increase the storage with a SD card, I found the sound quality to be poor. The equalizer function changes the way it sounds, but the result is always lacking. The reliability is also poor. When I recived it, I could not get it to turn on. I tried different bateries but it still would not work. I contacted Amazon and they sent a replacement to me right away (5 Stars to Amazon for customer service). The second one worked. It is a battery hog.",
        "The sound is good, easy to navigate are pluses of this little mp3 player. However, the software is terrible to arrange files in order; and also it is not reliable when I want to play back my recorded files. Sometimes the mp3 player was frozen when I plyed back the recored files and I had to take the battery out then put it back to \"revive\" the mp3 recorder. I will not recommend it to anyone who want to record voice.",
        "I admit that I haven't given this a complete test of every option, but I was able to quickly download a CD and take it to the gym for my workout. I love that it is so small. I haven't used the armband yet, but that looks like a great option. Being over 50, I have a hard time reading the screen without my glasses, but I didn't expect the type to be any bigger. It is very lightweight.",
        "I bought this for my wife and she is EXTREMELY HAPPY with the unit! She uses it daily whenever she does chores around the house or reads her magazines. Its easy to use. Uploading songs is a breeze. Battery life is great. Very Good Product...",
        "This is a great deal. It even takes a 2 Gb SD card. Instructions a little weak, but once you crack the code, its a pretty good unit. I strap it to my arm and do some pretty rough jet skiing. Hasnt missed a beat yet",
        "Incredibly easy to use, sounds good, lightweight... what's not to like? The FM Radio's a nice bonus. Good price, too.",
        "simple way to listen to riped music plus AAA bats",
        "I recently bought this MP3 player and I love it. It works great! It is my new walking buddy!",
        "The biggest problem with this item is that the battery is not rechargable so when listening to a book and you set it on pause if you cannot go back to the book immediately either the battery dies or the pause goes off and you have to start the book from the beginning. Great for music no good for books",
        "Trying to play back several files (mp3 at 128kbps or variable 180kbps) there was noticeable distortion at various points in many songs. I don't know if it was just my unit or not, but I couldn't stand it, so back it goes. I Addendum: The Sandisk M240 sounds much better than this one did.",
        "The SanDisk Sansa e130 is an awesome little MP3 player. It has great sound quality. It really is a lot of bang for your buck.",
        "It's a good MP3 player but it lacks technology upgrades that I was aware of when I bought it. It is having a hard time recognizing my cards. Now the earbuds I love them because of there features.",
        "volume control does not work and cannot play my playlist.",
        "I don't know how so many good reviews got posted for this item. I had mine about three weeks before it began to go through periods where it would stop working for no apparent reason. This was a complete waste of money and time for me. I won't even bother with the details about the flimsy design. I tossed mine in the round can.",
        "I liked this mp3 player it sounded good and was easy to load music on to. The only problem I had was that the volume button didn't work well.",
        "This product was a complete disappointment to me. After reading a number of positive reviews, I purchased this device to use with audiobooks from Netlibrary. The first disappointment was in discovering that although you can play wma files on the e130, it cannot bookmark them. Therefore, it is difficult to find where you left off, especially when you're listening to an 11-hour book. The next disappointment came when after only two weeks, the device will no longer power up. And finally, I am frustrated by the fact that I paid $66 for this device and two weeks later the price is $54. Buyer beware.",
        "Easy to use and has nice sound and features. I like the expandable memory and the price",
        "I purchased this MP3 for my deployment in Iraq. It has survived all the abuse (ie: climate, sandstorm, and accidentally dropping it). Transferring music files is a snap. The sound quality is good. It even has a sleep feature (up to 2 hours). The in-ear headphones help filter out some of the noise so you can hear the music better. I especially love the memory extension feature. Overall this MP3 completed all of my basic needs. Just one note. The case was ample but sucks when it's hooked on the armband. It keeps on falling off so I modified it with the velcro sticker. I suggest that you do the same thing or purchase a better case for it.",
        "This is my first MP3 player and it was very easy to download music onto. The FM tuner works great but the headphones are OK and will need to be upgraded but I love it otherwise. It's great for working out and the price is much better than any competitors especially since iPods don't have half the features let alone come with a case and armband. I have no regrets and if this is your first MP3 player or you just want something simple for working out you will be 100% satisfied like me. Go ahead and compare and you will see the value.",
        "This is very nice mp3 player. It comes with all the accesories for downloading , listening and armband for running. Very easy to download music and has decent sound quality( might need better headset than the free one that comes with it). For the price you can not beat it. It takes roughly 100-130 songs as is but you can add SD card and add 2GB to the capacity increasing the number of songs by 4-5 x. Also if you download as wma instead of mp3 it doubles the number of songs so you potentially can get to 1000 songs with it. I have not tried WMA yet but that is what the instructions says.",
        "Bought it as a refub for $17. The most that I like is that I can connect it to my computer with usb cable, and the player shows as a disk, then I just delete the music file that I don't want and copy over the file that I want, without go through the sync up process like the ipod. It comes with a FM tuner as well. Unlike the ipod, once the bettery is dead, dead as the player. Just keep some rechargable betteries around, this thing can last forever. It also allow me to expend its memory up to 2 GB with memory card, which costs like nothing these days.",
        "I purchased this item after reviewing several different mp3 players. The delivery was extrememly fast (which is even better since the shipping was free) and everything was as advertised. I've only had the player for 1 day but I've been able to just hook up the usb cable and start down loading things without a problem. The sound quality seems really good to. I would recomend this product to anyone who's interested in buying a mp3 player.",
        "This has to be one of the best mp3 players ive purchased in a while~Sound quality is very good,The wrist strap is a plus at the gym,The clear plastic case protects it from scratches on the front & back.On its own it holds alot of songs & the earbuds came w/a variety of sizes to fit my ear.I also purchased a 2GB card to hold even more songs I think i can squeeze out about 400+ songs on here w/card.LOVE IT!!!",
        "The features on this MP3 are pretty standard. The SD storage slot is a nice touch. The screen makes it very simple to play songs by title, artist, album, or random shuffle. The battery life on an iPod shuffle may be better, but for the money, I'd buy this. I was able to fit about 18 full albums onto it using the internal and extertal memory (I had a 1 gig card). The first time I put songs on it, it took a few seconds to load, but after that it worked fine. It even remembers your place when you turn it back on.",
        "The pros & cons have been covered by other reviews but one BIG surprise was there is NO Resume or Bookmark feature on these players. Audiobooks have to be cut into 3-5 min chunks or everytime you stop you have to fast forward through a hour or more to get back to your spot. I recommend the older smaller Sandisk player which at lease has resume.",
        "Nice navigation although the sound out of the box wasn't very good in my opinion. After I found my way to the audio settings it sounded pretty darn good. The navigation works out pretty well, but the yes/no on settings & stuff is a bit hard to get used to. And I just love the fact that I can load up a spare SD card with someone else's music, then take it out when I'm done. Overall, I think I'll like this. I originally had a negative review about this product, but I added this one once I figured out how to adjust the sound it was very good.",
        "Pros -Arrived about a week early, with free shipping -Backlight -Menu is easy to navigate -Low price -Shuffle/Repeat functions -Holds about 150 songs -Radio -Stylish case -Easy to transfer songs -Pocket-sized -Low battery indicator -Various playlists, ex. new music, favorites, artist, album, etc. Cons -Bad sound quality with the earbuds it comes with, unless you jam them in your ear and put yourself at risk for premature deafness. I'd recommend spending $10 and buying a new pair -Only 493/512mb are available to save songs to",
        "I listen to netcasts all the time and it is a real pain when I have to interrupt my listening for something. Whenever you turn the unit on it starts over from the beginning of the netcast. That's the only complaint I have with the unit, and unfortunately, listening to netcasts is the main reason I bought it.",
        "I purchased this as a Christmas gift for my tech savy Granddaughter. She loves it. Her only gripes are that when it arrived there was no cable included to download from her computer,she had to go out and purchase one and it eats batteries. Beyond that she loves it. Easy to use, easy to carry. Sound is of good quality. For my part, the price was right and the customer service from Amazon is as always, outstanding.",
        "We accidentally purchased two, but my husband kept the other one. We love them. They don't have some of the options of the Ipod, but at the price, they are all that we needed. Good sound, small, easy to use. We really enjoy them for car trips!",
        "In general, its a good player, the sound quality is just good, the earphones are comfortables and the LCD display is very easy to read, if you want something that is cheap, good looking, with a good quality,weightless and small, you have to choose the Sansa. The things that i didnt like were: - The rotary wheel is very difficult to move, and its more difficult to move with the carrying case. - It doesnt have lyrics and playlists supported (i hope that sandisk make a firmware that supports this features) And thats all for now,in general, im pleased to bought this product",
        "I am very pleased with the Sansa mp3 player from SanDisk... I like the radio too. Its great at ball games with it being so light (weight) to listen to the announcers broadcast the game and watch live. The sound is excellent ... I especially like the comfortable fit of the headphones... ear phones I guess you would call them ... they fit snug and comfortable in your ears. I also like being able to put a new triple A battery in right away when it gets low on charge. And the price beats anyone else... not to mention SanDisk is the number one maker of flash memory... sweeeeeetttt!!!!!!!!!!!!!!!!!!!!",
        "I have purchased two of these horrible pieces of equipment, and they both died the same way. one day the battery died, and when i replaced the battery it never came on again. i tried different batteries. no effect. also the computer doesnt recognize anything has been plugged in to it when i connect it. and i can't get a response from anyone at sandisk. if i could give the product less than one star i would. this product is terrible and so is the sandisk company! save your money!",
        "A couple of months ago I bought this wonderful mp3 player. Of course Amazon's shipping went smoothly and the little thing works like a charm. Recently though I lost my earphones, and thought that I could just go online and buy them. Not as easy as that. I could find them no where and I loved these, they are very comfortable and have great sound quality. So I called up Sandisk Support and they are mailing me a FREE pair. I just really want to thank Sandisk for all their love and support, I think the company is just great.",
        "i ordered this mp3 player from amazon and i got the standard shipping and it came in 5 days. this mp3 has awsome sound quality and the FM radio is crystal clear and you can set your favorite stations. scanning throught your songs is fairly easy. this thing is the perfect size for pocket and hand. the backlight is very useful. this this is so good for the money and is easy to put music on and off. I use realplayer and it is so easy to edit your music. the only foblem is that your playlist does'nt stay it sorts it by song but it is easy to navigate. THIS THING IS SWEET!!!!!!!!!!!",
        "Alright- to sum it up, this Sandisk player is remarkable. The sound is acually better than any Ipod, which are over double the price. Also, this thing is very small, taking up just over half of the palm of my hand. With great features such as the FM tuner and expandable memory, you can not go wrong with this mp3 player.",
        "It works fine and I'm very happy with it. It plays every mp3 that I have with a great sound. But it has some issues that need fix like the volumen control sometimes goes higher or lower. The navigation in the menu is very slow. Sometimes when you put new songs, it doesn't refresh the playlist, so I have to delete the playlist file from the device. I would like if I could create playlists in my computer rather than select each mp3 in the player and put it in the favorites playlist.",
        "I purchased this unit for my wife on her birthday. She uses it constantly , we go through a lot of AAA batteries but its still more convenient than trying to replace the iPod battery. She has 80+ songs loaded and a few extra memory cards with approx 400 more songs that she carries with her, the entire set weighs about 6 ounces, with the extra cards. It has not caused any problem and she's had it for almost a year now. Great item , great price (I got it at a really low price- under $50)",
        "I purchased this Mp3 player a year or so ago. The first time I left it in my care over night when it was between 45-55 degrees. It never came back on. I then returned the product because I had bought the extended warranty so I got a replacement. I then gave the replacement to my father in law. He used it inside and when he went to use it the next day the same thing happened. These are cheap and terrible.",
        "Got one from eBay for $20 (shipping included). This is my second MP3 player. My previous one is a Creative Labs MuVo TX/FM 256MB. I think the MuVo is a better MP3 player then e130 in four ways: 1. Better FM radio reception. 2. Better battary lift. 3. Better sound quality. 4. Better built.",
        "That's very good mp3 player, he will be work more than 5 years, I would like to recommended this item for everyone",
        "I'm disappointed that the player cannot organize the music by folder and does not order the music by filename. I assumed that, since my wife's SDMX1 did it, this would too! A prominent review here implies that the firmware upgrade fixes all your organizational needs, but it just tweaks the software a little (allowing you to play albums by track number.)",
        "I have been satisfied with this product. It was simple to load songs on to the player. The operation is very straight forward and easy to understand as well as implement. The ear buds were different than I was previously acquainted with but after a short time, they were comfortable. They also provided an excellent quality of sound reproduction. All in all I am very happy with my purchase and would make this same purchase again if I had the need to do so.",
        "The Sansa apparently pays no regard to organization of mp3s into file folders, instead playing songs in alphabetical order (rather than by album or artist). Playing an \"album\" (folder) of songs requires digging into a submenu, and even then depends on all songs having well-formatted ID3 tags. The interface is somewhat clunky, and hard to use without looking (an important consideration for listening in the car).",
        "I recently purchased this product and have to say that I am very pleased. Pros: Great price, SD expansion slot, small/lightweight, great headphones, good sound quality, FM radio, uses AAA batteries, VERY EASY TO UPLOAD MUSIC TO! Cons: Volume scroll is a little stiff Overall, GREAT PRODUCT! Buy it today! You wont regret it!!!",
        "The headphones that come with this mp3 player have very poor sound quality. The buttons are very difficult to use and the volume blasts all the way up for no reason. It also drains batteries. I decided to buy an iPod and liked it a thousand times better.",
        "I got this MP3 player at BestBuy for $47.00 on black friday. For such a cheap price, this thing has impressed me so far. If you're looking for a low-price MP3 player with quick results, just buy this. 250 songs is enough for me because I am always changing them around and what not. If you have Windows Media Player its very easily to drag music and download it to the player. Ipods are overpriced and a bit terrible. Oh yea and the earphones for this thing are terrible but the rubber knobs on them are extremely fun to play with. Rumor has it that this comes in pink too...",
        "Before I bought this I went over lots of reviews to see what everybody thought of different ones, and I decided on the Sandisk Sansa SDMX2 512 MB, and I have to say, I made the perfect choice. It is a great mp3 player, I've had mp3 players that lock up etc..and this one does not. I bought it through amazon (buy.com), I signed up for the buy.com credit card, and got $20 off!! this only cost me $40. Excellent deal, great mp3 player, and great price.",
        "I bought the Sandisk Sansa thinking that it would be a good, durable mp3 player. Boy, was I wrong. About a week after I bought this player, the LCD screen got shattered after being in my pocket. I was able to return the player, and get a new one. About 2 months after I got the second player, the same thing happened. Now I am stuck with an mp3 player with a shattered LCD screen. If I were to do it again, I'd go with the smaller Sandisk player. It's less expensive, smaller, and is much higher quality. You may have to take some extra time to organize your music, but it pays off in the end.",
        "I looked around a lot before purchasing and the time spent was worth it. Compact overall design but has large buttons to allow changing songs while running. SD memory allow me to have different cards of different music for spearate situations. Great headphones come with it. I was looking at getting some just before purchasing this and they were goint to cost me 30 bucks.",
        "THe MP3 player is very easy to use, only should copy the MP3 files to the card and that's all, the only compleinment are the headphones, you must change this maybe by Sony Headphones, then the sound will be great.",
        "I got this for my 6yo and she loves it. SHe can listen to all of her kid music and I do not have to be annoyed with it. The SD slot is a great bonus. Also it is easy to \"drag and drop\" MP3s to the player like adding files to a Hard drive. Great little player - wish they still made this model!",
        "This is probably the best mp3 player I've ever owned. Works great and never gives me any problems. I love the expansion slot, I have multiple SD cards with different playlists on them so all I have to do is swap cards and I have a whole new set of tunes to match my mood, just like changing CD's, it's GREAT!",
        "I PURCHASED THIS FOR MY SON FOR CHRISTMAS. HE RESEARCHS EVERYTHING HE BUYS AND THIS IS WHAT HE WANTED. HE IS VERY HAPPY WITH THE MP3 AND I AM GLAD I DID MY HOMEWORK. RECEIVED IN SHORT PERIOD OF TIME-GOOD JOB.",
        "Scroll wheel very laggy. Almost crashed as I was waiting for navigation menu to scroll down. Great for listening to while driving! Comes with amazing earbud headphones! Didn't notice the sirens and lights in my rear view mirror for at least 5 miles!",
        "I liked the fact I could replace battery instead of waiting for charge. Music was not so good sounding so I used for audiobooks only.",
        "This mp3 player works really well and is a great alternative to dishing out piles of money for an iPod. I'm very pleased with this purchase.",
        "I bought this mp3 player few days back inspite of some negative feedback about it. I personally found it pretty good considering that its a flash memory based player which can be upgraded and also has FM inbuilt. The sound quality as as good as an iPOD , creative and i dont think quality is an issue except a few small bugs which can be overcome by experimenting a bit.",
        "Perfect design. Excellent combination of radio and MP3 player. SD card reader/writer. Nice size. Good sound and screen quality. Convenient features and menu.",
        "This is a great player! I have yet to have any problems with it (over a year now). I love that it is expandable. It is so light weight and small, it just fits right into your pocket. Get it, you won't be disappointed.",
        "I went through two of these in a short period of time. I own and use two of the 1gb version without problem (one for me and one for my oldest son), but have gone through two of the 512mb versions (for younger son). Both times it just suddenly stopped working. Returned and won't buy again.",
        "very good sound,easy to load with all popular formats. sd slot makes this a real value. also purchased the fm converter for car use. they work great together. only downside is battery use. carry spares to ensure all day use.",
        "The Sansa is very easy to use. I like the FM tuner and the memory cards you can purchase to upgrade.The sound quality is great. The Sansa has all the things I wanted in an MP3 player. For the price you can't go wrong.",
        "Of all the Mp3 Players I've listened to, this one definately plays the best quality music. Great features and you can easily find the song of your choice. But, there has been a downside. The Mp3 Player automatically shut off on me after only 3 days of having this product. I thought it was the battery, but it was not; I changed the battery several times, but the Mp3 player would not start. A day or so later, it finally worker properly again.",
        "It looks kind of cheap when you take it out of the box, but other than that, the mp3 player is ok.",
        "This item I got because I was looking for a great mp3 player. It has great features, like you can orgainize songs into different files. It only uses 1 AAA battery for more than 17 hours of listening to your songs! Over all I WOULD recommend this MP3.",
        "As good as the IPOD? I don't really know, but works for me, and its got a nice display, the radio is fine also. The SD slot is what I bought it for... but I was pleased with it as is.",
        "Excelent mp3 with a very good sound system. And a very low price at Amazon. So buy it!!! Don't hesitate on it.",
        "Very GOOD!Clear sound and nice looking. It can start from where you stop last time. Expandable SD slot is very useful. If can use as a sound recorder would be better",
        "i love it, its easy to use, the music is orgenized so i dont have to search and search for the exact file i feel like hearing, pros: easy to use, looks good, light, good price cons: no direct USB connection summary: o love it",
        "Downloading music and copying tunes from a CD is a snap! I can't seem to put my MP3 down. It was a wonderful investment!",
        "After reading so many good reviews, I had to get this. When I got it it was so tiny. It has a great display and amazing sound. I love the headphones that came with them, as well as the carry case and armband. I absolutly love this player.",
        "i really like the sdmx2 i got it for my son it is easy to download music and easy to use it is a great buy",
        "first mp3 player for me. i am very pleased with it. easy to use and very well made. can do a lot with it for a small price.",
        "it is a very good mp3 for its price i bought 3 of them for my family i strongle recommend it.",
        "Wat up everybody! Ya'll all need to get this! I bought one of these and it rocks! I haven't had any problems yet! This is definately worth the money!",
        "Good product no problems so far, fits a good amount of sounds and you can buy a memory card to fit more great.",
        "Really ugly mp3 player. Did the Sandisk designer ever check out the ipod? Features are just average. No surprise.",
        "It may have been a good product for some people, but my son only was able to use it for a day or two. I'm completely disgusted. I don't know what to do."
    ]
}