{
    "entity": "MP3 & MP4 Players",
    "text": [
        "I have a current Muvo..which died...battery wouldn't charge. Bought a new Muvo although an older model..I wanted one like my old one. Purchased and it was delivered promptly. The battery in the package had swelled up and wouldn't fit in the unit. Could not find a battery...out of date...not available anywhere. Stuck with a new Muvo which can't be used...$60.00 down the drain.",
        "Very difficult to use and constantly....CONSTANTLY shuts off on its own in the middle of my workouts. If you plan on using this while sitting still it may work better but with the slightest movement it shuts off. The user interface is very poor. I expected more for my $[...] and all the good reviews.",
        "With all of the hype over Apple's IPOD, many people have seemed to overlook the large number of MP3 alternatives on the market. The MuVo Slim is definitely one of the best products out there. The slim and lightweight design is perfect for carrying or putting in a pocket while exercising and the 256 MB capacity is more than ample to store enough songs for numerous workouts. If you're looking for a portable MP3 player that is smaller than any of Apple's options, this is definitely the best product on the market.",
        "Not a bad mp3 player. Credit card sized but only issue is the memory is very small, I bought it for the built in microphone which works nicely with real player. Easy to use and light. Also has a radio player",
        "This is an awesome mp3 player. I bought it last year for my oldest daughter and she still prefers it to the new RCA Lyra she got for Christmas. It sounds great and it's easy to use. Recharge through your usb port and never change batteries again.",
        "First off, this thing deserves ZERO STARS. I bought the Muvo Slim for my son for Christmas, and I am very sorry I did. It was great for a couple hours. Then it stopped connecting to the PC. The worst thing about this player is the battery retention mechanism is REDICULOUSLY DELICATE and was begining to fail almost immediately. Why do these product engineers use a TINY sliver of plastic where they should use spring steel? I expect better from Creative Labs. DO NOT BUT THIS PRODUCT!",
        "Although it works fine. It is very flimsy especially the battery compartment. The buttons are tiny and the display and the menus are difficult to use. It's a far cry from Apple iPod. I think I wasted my money on it instead of saving money.",
        "It works, but the capacity makes me sad. I guess this is what I get for only spending $40.",
        "I'm still using this thing but don't recommend it. The rotary/push knob is a pain to use. It often misfires in the 'push' mode. I usually use a fingernail to rotate it so it doesn't mis-push. I'd avoid this feature on any other Creative products. Playing from folders and the play modes are a bit strange. The battery connection became loose. I had to pry up the poor 'leaf spring' inside the battery cover to make it tight again. Recording from FM is nice but only makes WAV files and not MP3.",
        "I bought two of these for me and my wife for christmas. This is my first mp3 player and I am very satisfied. The battery has a very long life and is replaceable. I love the fact that you can transfer the music and other files to the muvo without any special software. I love the backlit screen and the tiny size. The sound is great (with my own headphones). The included headphones are okay, but aren't very comfortable. You can't go wrong with the Muvo Slim or Amazon!",
        "Creative normally makes good products, but I didn't even have this player a year and the plastic flap that covers the battery chipped off (even after taking care of it well) resulting in my many problems. At first I thought it was my headphones, but I went through three new sets, and the mp3 player still sends input to the left headphone on and off... The headphones work in other mp3 players just fine. This is a decent player but new ones hold more music for the same amount of money. I'm just sad it didn't even last a year!",
        "just received my Muvo. Very cool. Like the design, the pager like interface, the rechargeable battery, the usb cable (my usb ports are in the back). Little black creditcard size case with view windows and slot for earplugs and usb connector.Like the rock equilizer setting, crisp and hot. Not using Muvo earplugs,already had a sony pair that I like. Radio is ok but not a radio fan. When I carry it, people ask what it is (pager or phone) Doubles as a conversation piece when not in use. Using it on a imac in finder osx1.28. Dragging and dropping music folders are a snap. Have not tried it with itunes yet...",
        "I received this as an office Christmas party gift. The LCD screen failed after only 1 week of use. Creative Labs accepted it as an RMA, but refused to repair it without a receipt. Surely customer service would know about gifts around the holidays, but no luck. Even a customer service supervisor could not make exceptions for gifts. A bad product, with worse customer service.",
        "In the age of 8GB iPod Nanos, this player does not offer much by way of storage capacity for your songs. For some reason, the replacable lithium-ion battery keeps dying out on us. This has happened *twice* to us - the first time around, it was within a month of having bought the player so it was replaced under warranty and the second time around it was within a couple of years. On both occasions, the battery \"puffed up\" (making it very difficult to remove from the casing). Since a replacement battery is around $35, it's not worth replacing it for us. Don't bother buying this player.",
        "Purchased one for myself, two as Christmas gifts. They work initially, then fail with in a week. Creative replaced the first one, now the replacement has failed. The two I gave for Christmas have failed also. Stay away from this disaster of a product.",
        "I received mine for my birthday. It was great for the first week. My recordings were clear with decent quality. The battery was exceptional for an mp3 player. Unfortunately, the latch to close the door on the battery broke after the first week. It will no longer work unless I tape the door closed. I tried to replace it, but the store (Staples) acted like I was a thug who stole it, instead of a professional working on my Ph.D. I'm stuck with a broken model I've had for a week.",
        "What a great buy for the money. Very simple to use. Runs right off Windows media player if that is what you are familiar with. I installed their disc but deleted it after finding out about the media player. The sound quality is excellent. It is perfect for running and taking to the gym. The only downer is the ear buds. They don't stay in very well. I am very happy that I bought it!!",
        "This was my second Mp3 player and I must say that I NEVER knew that it was possible for a player to be so easy to use yet of such high quality. I definitly recommend it to anybody looking for a small/simple/high quality Mp3 player. Another great thing about it is that you can purchase interchangable face plates to make it more colorful!",
        "I read an earlier review of this in a magazine, and it received a 9 out of 10. It is an incredible piece of machinery. I did purchase better headphones for it, but I never expect top quality headphones to come with an Mp3 player. The Ipod may hold more music, but the ease of use of this player, makes it much better.",
        "The headphone jack went bad after 5 months, and I had to pay $40 for repair - they only give you 3 month warranty on labor.",
        "I bought this MP3 player after researching many different brands and models, and I'm so glad I chose this one. It's small, charges from USB (so I'm not creating battery waste!) and hold enough music to satisfy my commute. The FM reception is excellent!",
        "i feel bit disappointed after listening to some mp3 format songs. the sound is not that good, as if there is a layer right between you and the sound. see? but overall, it's real handy, you dont even feel anything stick on your body while doing exercise, etc. i like this."
    ]
}