{
    "entity": "MP3 & MP4 Players",
    "text": [
        "I don't believe Sony makes these anymore but I've had many of them. They were much less in price then and I gave them as presents. They are simple to use, very compact, sound quality was great for me. This unit even has FM radio, shuffle, hold. When new, 3 min charge gave you 3hr playback. 30 min gave you 18hrs. I got many years of service form these.",
        "The player is perfect for the money: small, light, good sound quality, only needs to replace the headphones...Radio is ok, but there are no memories available to store my favorites...overall very good player. The software (Sonicstage-Connect) is much more solid than previous version, works fine, it cannot be compared with Itunes (like many itunes fans like to do)does its job pretty well...",
        "Small and light with a built in USB interface to boot which prevents the need of hauling an extra cable all around. Sonic Stage isn't horrible but locks your device to only 1 PC for transfers if you don't register...sucks. Another proprietary product forced upon by Sony. Controls, sound, and battery life are great on the other hand.",
        "Always been a fan of Sony MP3 players, Sound Quality is awesome and the it easily fits in any pocket and is awesome with the armband accesory (Purchased seperately) only negative is the software you habe to use (a little tricky at first), You wont be dissapointed.",
        "This is my mp3 player of choice. This is simply the best MP3 player ever made sub 4GB! What makes it the best? 1. 3 minute/3 hour playback charging. 2. Direct USB connection. 3. google \"NW-E00x Mp3 File Manager\" 4. Ergonomics. It is best handling mp3 player for running/in-car. BAR NONE! THE BEST MP3 PLAYER IN THE WORLD!",
        "I bought a refurbished unit and it performs very well. Lots of features on it and seems to be very reliable so far. It is very light weight and small with very good sound. Sony's music store is no more using their ATRAC music but still can utilize MP3 music such as from Amazon.com. I'm glad I have the unit and especially at a refurbished price.",
        "This is a very good MP3. It's so small it fits bascically anywhere. It plays very loud music and hold a lot of music too. Note: download your music as MP3s formats because it will hold a lot more songs that way. It also serves as a flash memory.",
        "The player is perfect for the money: small, light, good sound quality, only needs to replace the headphones...Radio is ok, but there are no memories available to store my favorites overall very good player. The software is much more solid than previous version, works fine, it cannot be compared with Itunes does its job pretty well",
        "I have 4 Sony Minidisc players (2 older units and 2 Hi-MD units) so when the wife wanted a smaller music player, Sony was the first one I looked into. This unit supports the same file format (ATRAC) as the minidisc players so there was no need for me to re-encode all the CDs in my collection to MP3 (it will play MP3s as well). This is a very nice music player, very lightweight and it has great sound.",
        "One of my top MP3 players. It is such an easy to use MP3 player that I'm going to get another one. No need to fumble with USB cords to upload music. Just plug into your computer and upload music. Also very sleek and ergonomic.",
        "Very small and light with BIG, big clear sound. My only complaint so far is that it's a bit hard to find the song you want. You pretty much have to scroll a lot. Even so, the sound is great -- both on MP3s and FM.",
        "I have been using this player for over a year now (1GB version). If you wanna have a music player, just go with it cuz it sounds just great... I love its user friendly customization on equalization. All you probably would need a better headphone and you are set. Try to get a headphone that supports 10hz to 23khz. Its provided software for transferring mp3 files, is bit hard to understand for a first time user.. if you spend a little time, you could do it. I am still happy with this player as I charge it once a week & it just goes on and on.",
        "I've had the product one month. It does play the music that I put on it, but I would not buy again. First, it only works with the special software that comes with it, which limits it to connecting to one computer. You cannot simply copy MP3 files to the unit, so it is really false advertising to call it an MP3 player. Another thing: in daylight, I cannot read the display at all. It is very dim.",
        "I just got this today and it is a nice little MP3 player. Unlike the old Apple Shuffle I had (that died), this unit has some heft to it, which is nice. I've heard that the menu system is tricky to figure out, but I found it very easy and intuitive. The SonicStage software is quirky, but I've never been a fan of needing software to add songs (like iTunes).",
        "I had this player for six months and loved it. I guess I am used to the extra steps involved with the SONIC Software. I just bought a new computer with Window VISTA and didn't have any problem with running the SONIC Software. If Sony would add a 4GB or 6 GB model, I will jump on-line to buy it!",
        "Walkman is very good, but the software included to load music to it is absolutely a mess. Radio is an excellent feature and audio is very good. I'm an ipod user and was very difficult to transfer music to the walkman. I would recommend sony to place the holder on the usb cap instead of the back of the walkman and to include a lanyard with it. I've lost the cab twice!!! Thanks God I found it and the usb piece is covered. Other little thing: Is a little bit complicated to turn the walkman off. It is tricky!. But is a good and recommended product!",
        "I wind up losing these, or having them stolen long before they break down. Sound quality is amazing!",
        "its supposed to be an mp3 player. you put files on it and they play. whats so hard about that. Sony has made this as difficult as possible to do. all your mp3 files have to be run through their program before they get onto the machine, they get renamed and re-formated to some propriatary file system, and if the mp3 is not formated with author, title, date, time serial number etc exactly as sony likes it this system screws around with the file so you can't find it on the mp3 player. this is a disgusting hunk of over-engineered junk.",
        "I got this player close to a year ago. I really like it, holds lots of music, good sound quality etc. The downfalls are that you cannot see the display when in sunlight - like if you're outside for a run or a walk. The other thing you should be aware of is the sony software. I received an email from them last week stating that they are moving away from their ATRAC files. Will still be able to use their software to organize. I'm not sure of what that means long term for my MP3 player.",
        "People complain about sony's software, but it actually let you fit the same amount of songs as a 4 gigs Nano! You only have to drag and droop the songs into their software which transfers the songs really fast to the MP3 player!",
        "This is a very good device. I have used costly devices and it hungs sometimes. But this one is very neat. Only dis-advantage of this tool is the software which comes with Sony. As someone above suggested use Java tool JSymphonic available in internet. It is very light weight and it is Java, so it runs on any OS.",
        "It's elegant, but stupid and combersome. I was expecting to plug it and transfer my MP3 files and start listening to them, which I couldn't because it sofetware and propriotry music format must be used. Thus I cannot used it with any pc. I am returning it tomorrow and buying me a Creative Muvo V200 though its only 1G. It's realy a Sony Music Player and not an MP3 player, so beware before you buy. And shame on Sony; they should be aware of customers wants and not deliver a product this bad.",
        "I was really expecting a lot from the mp3 player (I don't know why) but sadly to say I was slightly disappointed. It is nothing more than an mp3 player and flash drive. I can't see the screen in the daytime because it's too bright. The drive also cannot read Korean so the titles and artists come up funny. And if you are like me and used to an ipod layout you might find the navigation limited. You can only search by song or album, (the artist shows up while the song is playing).",
        "This MP3 player is so easy to use, the sound is great for such a small size. The software as well was easy to use.",
        "Plays ok, good tuner, but... Trying to get an audio book loaded was a pain. First try, wound up with the mini chapters loaded in almost random order. Used another ripper, copied them to the player and it would not play the files. Loaded those files through their software and got everything in order, but it removed the names and changed the MP3s to their pet format. Should never buy a MP3 player from a company that sells CDs.",
        "I searched out a replacement for the same type of MP3 player that I had lost. I really like it and the service provided on shipping was VERY prompt -- I received the product much sooner than promised in the original purchase date. Thank you!",
        "i absolutely love this MP3...great memory, holds a lot of songs, and easy to use...def. a must!",
        "fantastic, fantastic, fantastic i spent hours reading reviews before deciding to buy this. the battery is good you can charge it thriugh your computer. earphones are great. Fantastic product. Can store a lot of music tooo.",
        "This is a very light and compact mp3 player. Unfortunately, it does not play mp3s! You need to use Sony's proprietory software to convert your mp3s into another music format before being able to play them.",
        "I got one last year and it has been a joy to use. It works right out of the box (good sony). I got two more for my kids. They like the size and 1200 song storage.",
        "The software is freezing the computer, I tested it in my desktop and my laptop. And you can't transfer the files using the windows explorer, you have to use the sony's software.",
        "I bought this today and I am returning it tomorrow. It claims to be an MP3 player, but you can not load mp3's onto it. You must put Sonicstage on your PC, transfer all of your mp3's to that program, and then convert all of those files to ATRAC (?) format on the player. This thing is horrible."
    ]
}