{
    "entity": "MP3 & MP4 Players",
    "text": [
        "This is a discontinued item. This particular unit had been on the shelf for a while. The foam earphone covers disintegrated to dust upon touch. I had never seen that before. The real problem was the battery was bad and would not charge. It must have been a poorly manufactured model because it is not offered new anymore and is only being offered on a few sites for more than I paid for this unit. I guess they need to move their current inventory and are looking for more suckers. Oh well.",
        "I have had other Sansa MP3 players and loved them. With the kind of work that I do I use these things A LOT! I don't get much use from this player and here is why. 1. Battery doesn't last that long when charged and has to be plugged in a USB port to charge. A huge hassle. 2. Screen contrast is awfull. If you have any vision issues at all this screen will be almost impossible to see. The buttons are fairly easy to use and the sound is good. But with the other problems I would skip this model and find one a little more user friendly. I still like Sansa just not this one.",
        "iPod has almost become a generic name like aspirin, but don't think that there is nothing better than an iPod for an MP3 player. The ScanDisk Sansa c250 does anything that the lower-end iPod does and much more. The Sansa is user-friendly and sounds great, just like an iPod. However, try as you might, you won't find an iPod for the price of the Sansa with an FM radio, a user-replacable battery (the iPod must be sent back to Apple), the ability to record voice and an expandable memory with the addition of a memory card. For the money you can't go wrong with the Sansa c250.",
        "Having purchased a larger Sansa before this, I was expecting this smaller one to be perfect for my younger son. I was very disappointed when I found the ear phone jack will not stay plugged in snug and tight. I am constantly having to take it out and put it back in, then wiggle it, whatever...., to get the connection going and for the sound to come through. I know once I give this to my son he is not going to like having to constantly mess with the ear phone jack to be able to hear his music. Too bad, out other Sansa works great.",
        "Sound quality is excellent, easy to download music on to it and it has all the standard features for playing songs such as, shuffle, repeat, making a playlist, ffwd and such. You can listen to FM radio, which is great. What this can do that an iPod can't is record voice and radio. The only drawbacks are, you have to hook it up to the computer in order to charge it or delete songs. You can only have one playlist at a time. In order to hook it up to anything other than a computer, you'll need to buy a different cable. But overall I love my SanDisk Sansa MP3 player.",
        "This is a reasonably decent device, spoiled by a lousy interface. When you try to navigate in album mode, or in any other mode other than 'songs', it mixes up the album order. I have my mp3 albums named so that when you sort the songs in alphabetical order, the songs will be in the correct order within the album. The Sansa device sorts the songs by the write time of the song to the player, making it impossible to play an album in the correct order. Compared to my iRiver player, this is junk.",
        "I just received this player and I had it out of the box, loaded with music, and playing in under 10 minutes. The screen is good, the menu is laid out well, and it sounds great. This player is comparable to my daughter's new iPod. It's as easy to use and it sounds just as good. It's a great deal considering it was only about 1/3 the price. This player is a good, cost effective alternative to an iPod. I'd highly recommend it.",
        "Well I must say the delivery from the company is fast so this by no means is a strike against them. This new and improved product has a bad habit of freezing. The product comes with a (supposedly) a free trial to napster but the website that is on the card does not exist.. I don't really care but for those who expect to use this.. don't! The little device does hold a charge for a good amount of time which is a big plus when you want to leave it in your gym bag for a week. I do always buy these but really miss the older model.",
        "Great product for the price! A friend purchased the same brand, but his has video capabilities for another $50. I don't need video capability so not having that feature isn't a big deal. Having 500 song capacity is more than enough for me. If for some crazy reason I would need more, a disk can be purchased for about $20 which holds another 500 songs. But the Sansa MP3 has all that I need and sounds great. It's definetly worth the money.",
        "I have had this MP-3 player just over a month now and it has performed just fine. I have had no problems loading or unloading songs onto it. The quality of the music it plays is good with both headphones and external speakers. The only thing I wish it had was an actual stop button instead of having to turn the unit off (it does at least have a pause button. For the price I paid I feel that I got a good deal.",
        "Loved this MP3 Player. It was so nice somebody stole it off my computer stand. Good thing I replaced it with a smartphone, I guess. The battery life is phenomenal. If you need a long-lasting MP3 player with superior spund quality, this is the one for you.",
        "This is an awesome MP3 player for the individual that wants to use it to walk, listen to the radio, use while cleaning the house, etc. You can also put pics on it, but its WAY simple to use and load. User friendly and friendly for tired eyes:) I received one for Christmas, then bought one for hubby, my sister and brother in law. They all use and enjoy it. Excellent value for small investment!!",
        "The manuel needs to show or explain the new items of the NEW C250 i,e what was format in the listings and what to do when you install the new SD micro card,it looks like the manuel that came with the product is a cover all for all the c200 Mp3 players.Tech support was great we discuss the manuel also that there should be one for each Mp3 player that explains the product you have and not to guess on how it works!",
        "I bought this for my wife for christmas. she's not really all that techy but even she can figure out how to put her songs on this one. Works super easy with WMP 11, I like the interface better than that of my iPod. Build quality is a little cheap but for the money you can't beat it. It also locked up a couple of times and had to be plugged in in order to reset it. I have updated the firmware (highly recommendable) and haven't had a problem since. For those with charging complaints, the iPod style charger works just fine with the USB cord for this guy.",
        "Wanted a product that I wouldn't have charging/re-charging issues on a long airplane flights (US to S.Africa- 18+hours). This serves the purpose...J\\just have to remember to carry replacement battery. The fact that it's small is a bonus but this can also be a problem as you need a pocket or something to keep it in since it doesn't attach.",
        "This was my husband and my first mp3 player and it has turned out to be a great deal. We were excited to plug it in and use it right away, but had some trouble getting my computer to recognize the device. A colleagues did, so we knew it was not a problem with the mp3 player. Finally, after contacting technical service at Sandisc, we fixed the problem (needed to download new drivers) and it has been just great. Technical service was very helpful and prompt, which I appreciated. All in all, a great buy for the low pricetag.",
        "I like this little player a lot, but I've really enjoyed it much much more since I loaded the Rockbox software on it. Way better than Sansa's default. I can now use the MicroSDHC card slot, so I have 6 Gb available, which is plenty for me. The 'lanyard' setup has to be the worst I've ever seen, however. For the $26 I paid, it was a steal.",
        "Wow. What a value. Compact without being flimsy. Sturdy unit that performs very well. I have since purchased external speaker system to enhance the unit. Probably wise to use after market ear buds. The supplied earbud unit is inferior. The ability to easily expand the memory is a positive feature. The USB hookup is very simple. Purchased mine for myself for Holiday gift and the price was outstanding. Makes me laugh at the iPod systems.",
        "I have owned a C250 for the past five years and loved it. I used it for at least eight hours a day during that time. When I lost it, I ordered a new one. The quality of this C250 now is NOT what the old one was. I use it on the road and the light kept coming on every time I hit a bump in the road. It wouldn't always turn on and would shut down and pause with no one touching it. This is NOT the old C250 that worked so well and without any problems for so many years.",
        "I bought this product because i wanted something to replace my ipod shuffle. i'd gotten tired of not knowing which song i was listening to, about to listen to, and so on. It is a great little thing and even though i'd read that it doesn't work with windows vista, it certainly does. The only problem i'm having with it is that no matter what cd i upload to it, it won't work. i wish i knew how to fix that problem, but other than that it's great! and i thoroughly enjoy it. =]",
        "The c series of Sansa players are pretty great. The native controls are easy to work with and navigate, there is a SD slot for expansion, the player is amall, and the battery lasts a long time. Add Rockbox, and the player gets even better. My player ended up being a dud. After a few months of use, the headphone jack stopped transmitting sound to the left ear. This is not normal, as I have owned a few other sansa players, and they have all been pretty durable, looks like I got a bad one.",
        "I bought this Sansa almost a year ago. I was happy with it at first, but I'm beginning to discover it's more of a headache. I'm not a technical wizard, but I'm no slouch either. I found it extremely easy to download the music onto the player, but I have run into trouble. I can't get the music OFF of the player and download new music. I've sat down at my computer three times to try to acomplish this with no success. I end up giving up and walking away. I think I'm going to suck it up and buy an ipod.",
        "Great product and price. has a very high build quality and works extremely well. Not good for people who need to have every record stocked by virgin in their collection. I change up my music frequently and this works fine for me.",
        "Great little player and storage unit.. Have had for some years now and still works perfectly. Also bought the 4mb sd card to expand the memory.",
        "I have an i-pod nano also, and I like the Sansa better. It has a better price. It is easier for me to download my music from my PC (I don't really like to use iTunes that much). And, it has an FM radio, which the ipod doesn't. I can use the radio in order to listen to the TV's at the gym when I exercise.",
        "Originally, I bought this unit for my kids who wanted an iPod Nano. They're pretty young, 7 and 10, so I didn't feel like spending the money on an iPod only to have it lost or broken shortly after they received it. They both love the c250 and I really like it as well. It's got decent sound, handles wma as well as mp3 files, has a great little FM radio, and has very respectable battery life. Overall, a nice little unit!",
        "Other than not finding many accessories for this product, I have no complaints. Being able to add additional storage was a huge plus. My husband would prefer an EQ more like the iPod, but prefered the easy file transfer that does not require a whole music database to operate. Great product for a great price.",
        "This MP3 player connects directly to the computer to charge and load music. It does not require any special software, it simply shows up as a removable drive where you can drag your music on or off. Done and done. Also features microSD for more storage, an FM tuner, and a microphone.",
        "i'm an old fart at 37 years old and a little behind in everything except desktop pc's. was very frustrated with this gadget when i couldn't figure it out in fifteen minutes after receiving it. the next day, i slowed down, relaxed and figured it out in 15 minutes. didn't know what the hype was about these mp3 thingamajigs. i do now! how did i go so long without one? over a 1000 of my fav songs and a radio into something this small.... absolutely incredible. it has motivated me to start exercising because of its great company. i highly recommend! btw, you print the 16 page manual from the cd included. print the manual before you do anything!",
        "This is my first mp3 player and I am completely satisfied with it. The only big drawback is that there is no separate charger unless you buy one. You charge the unit by connecting to the computer with the USB connection.And it was so very easy to install a 2gb micro disk for additional storage.",
        "Generally I liked the product - good capacity, easy to use (rewind function could be designed better, but it's OK). However, after few months its left channel died. I returned the item, they repaired it (or replaced ?) and sent me back, but two months later the left channel died again.",
        "I love Sansa's MP3 players and have the Sansa Fuze 4GB MP3. I purchased a refurbished SanDisk Sansa c250 and it played well but the c250 did not recognize any size micro SD card I tried to use with it. It may be that the factory technician did not repair that function on the unit I received. The Amazon merchant provided me with a prompt refund when I notified him of issue. If the unit accepted a Micro SD card I would have rated it higher.",
        "it's small, it's easy to operate and best of all it's cheap. My son says the sound quality is just as good as or better than his ipod touch and if he loses this one, it's no big deal. Love that it has a rechargeable battery and the ability to add a microSD card too.",
        "love my mp3 player, it is just as good as i pod but u are not lock in to only using itunes. and works very well with windows media player. i use it everyday for my walks. i even have pics of my kids on it. my lil personal photo album with my favorite workout music. just love it!",
        "One of my pet peeves with the ipod is that it doesn't have built in radio. I always thought if you gonna pay so much money to play your own music you can atleast enjoy FM radio. But as an alternative device, I see that the sandisk player is great with MP3's and radio which should be good enough for a music lover that desires a portable device. (the memory card option is also a nice touch) Though the screen resolution isn't that great and making an organized playlist is yet to be discovered...this device is great. I recommend for those of us that don't have \"ipod money\".",
        "Even though the highest memory card the Sandisk Sansa MP3 Player would take is a 2GB, it works great and my daughter is enjoying listening to the music that is loaded.",
        "A very nice MP3 player, It lets you record the radio and audio with the on-board mic, never had any issues with it except you may have issues putting songs on it that didn't have its info cleaned and fixed by itunes, wmplayer, or any other program that fixes tags for your songs. Battery life is about 20hrs unless you crank the brightness.",
        "So far I'm pretty pleased with this player. The one thing I don't like about it is that it is recharged via a USG connection to a computer. When traveling, it isn't always convenient to recharge this way. The user interface is simple and using iTunes and Windows Media Player it was easy to rip 20 CDs onto the player.",
        "I have now had this player for three weeks and it has been very good. I walk every day and it supplies me with good fidelity music without skips, blips or static. I found it very easy to load from my computer. My only complaint is that the screen contrast is low and I cannot read it outside in the daylight. All in all this is a great value. I would buy it again.",
        "Equalizer resets whenever changing artist, rendering the player useless because of the headphones I use (Koss UR40, using the equalizer to tone down the heavy bass.) Great player for anyone who doesn't need an equalizer for their headphones.",
        "I bought this product for my husband. He loves it. It is pretty easy to use. He would like to get a charger that he can take to work. I am looking for one right now. The memory on it is great. He esp. likes the recording feature of it.",
        "Good Product and excellent service. The device works straight forward like a mass storage system. For photos, you have included the required software. Do not expect High Definition on a 1\" screen. This is a MP3 player, photos are good to have.",
        "I still have this and now the cell phones take its place.",
        "I really like this MP3 player. It's very easy to figure out and use. The music subscription, Rhapsody is also very good. I like the fact that it has a radio, so I can tune it to the TV stations at the gym. The sound is really pretty good.",
        "Bought this as a christmas present for my child. Haven't had one problem. Loading the music is a breeze and the sound quality is great. I personally can't get the volume low enough. Would recommend to a friend.",
        "The SanDisk MP3 Player was very easy to install for a 11-year old. Easy music downloads. The display was easy to navigate. He had trouble finding his downloads. The title of the songs didn't appear. They only appeared as Track 01 and etc...Would like a better way to rename the Tracks. Over all it is an excellent product. I would recommend it to anyone. Great Volume also.",
        "This little mp3 is has a long battery life. I use it about 4 hours a day and throughout the whole week i only charge it once or twice and thats it! Although it cant hold a lot of songs, u can buy an addition microSD for it and it could increase the memory.The screen is easily scratched but u can always buy a screen protector or put it in a case. Lastly for all you loud volumers, half way into the volume option its already loud.",
        "This it the first MP3 player I've purchased and so far, I'm happy with it. I enjoy the compactness, the sound quality and the lanyard which I can use during my workouts. I ride my exercise bike about 50 or so miles a week and the music sure makes the time go by faster. I recommend the unit.",
        "I wanted to get an MP3 player but didnt want to get an IPOD as they are more expensive than I wanted to spend... This SanDisk player is so easy to use, download music and listen to... It took me only minutes to learn how to use it and now I can work out in comfort listening to my music instead of the machines making noise.. Great Product",
        "This MP3 player has pretty poor software. For the life of me, I couldn't get it to play tracks in the order that they appear on the album. With my MP3 collection, you could sort by file name, ID3 tag, or even date created and you'd end up with the proper order. But this unit played them alphabetically! Text contrast on the screen is awful.",
        "I was looking for a good alternative to the over priced Ipods. I bought this product a few months ago and I'm fairly happy with it and haven't had any big problems. I love that it can hold music, that I can easily cycle through, as well as play a radio. Blowing away the Ipod Shuffle at a lower cost. I've had some troubles with songs sometimes falling under their own separate categories. But for the most part the product was well worth the money and I'd recommend it to others.",
        "This is a very nice light weight mp3 player. pros: it has the easiest to navigate screen of all the mp3 players I have had, decent transfer rate, good radio system, good sound quality of mp3 files and voice recordings, and it is a cheap alternative to the ipod 2 GB player. Cons: it was a little heavier and bulkier than I expected and my friend's c250 screen cracked but other than that it is great.",
        "Received the player very quickly, as expected. It was given as a gift for the holidays, and out of the box, it did not work. I was able to connect it to a computer, read all the directories, even do updates and such. The only problem is the battery would not charge at all, to allow it to power up when not connected to the computer. I even bought a separate wall charger at the same time, and no luck there either. So now I await a replacement.",
        "Best entry level Mp3 player on the market. The sound quality is amazing. The built in recorder is fantastic. The firmware is a bit weak but if it works everything is damn skippy. Might take a little patience. Works directly with Mindows Media Player's sync command. Syncs easily very little bs. The jump from song to song is a little slower if your used to a zune or an ipod but if you your new to the mp3 player market this is one fine tiny option.",
        "could not get it to charge sent back .will give feedback on return later thanks",
        "This is a great MP3 player for my son. It's inexpensive in case he damages it. And it's easy to load songs on. Drag and drop with Windows Media Player.",
        "This is well worth the money. I wanted sommething to play music and that is what I got. I was new to the whole scene and needed a more detailed manual. The company promptly supplied me with that. Help was very courteous and prompt. I highly recommend SanDisc.",
        "I've bought 4 of these player because they are so easy to use and I like them so much. I think you can't go wrong with this brand",
        "the battery was dead when i received it! however once i received the new battery that i had to buy for around 15 bucks the MP3 Player worked great so i would almost plan on getting a battery with this",
        "Sansa makes very nice stuff at a GREAT price. If more people tried it, WHY buy iPods?? Easy to use, sound great and VERY durable! My kids have gone through 4 iPods (broken) while my Sanza keeps on tickin. I have 2 Sanza's. C250 and E280",
        "Mine worked fine for the first month, but then quit working. It won't take a charge at all. When I try plugging it into the USB connector, nothing happens. The battery is dead and I cannot turn it on, and the computer doesn't recognize it. I have 3 computers and tried connecting it to each of them with the same results. It's a worthless piece of junk now. I wish I had purchased a different brand.",
        "I owned the earlier model and found this one more complex to operate. There was also several musical selections residing on the device that I had to delete. All in all, I like it.",
        "For the price, you can't go wrong with this player. I've read the negs about the light blue scrolling on the blue background, and it's true. BUT, aside from that, I've had no problem the player at all...",
        "This was my first mp3 player, and the hardest problem I had was taking the battery cover off ..lol honestly its rough going getting that sucker off. The download of the music was a breeze. The sound quality was better than I expected for a rather inexpensive player. I would recommend this to anyone just looking for a mp3 to listen to music primarily.",
        "So far, a solid POS. Doesn't recognize the the microSD card on which I put music from my computer, though my cell phone does.",
        "I have not had any problems with this mp3 player. It is very simple to use and figure out with out reading the manual. The color screen is not the greatest with graphics but I have no problem reading the text. Battery life is great I would recomend to anyone looking for a decent mp3 player",
        "I bought mine in 2007 and still works great. One of the main reasons why I love this product is that it has voice recorder and radio. I had a couple of interviews and needed a voice recorder, so I used this one. The voice recorder option can also record straight from the radio, so you can just press record like you would in the old times with the cassette recorder; but now its Mp3 files.",
        "Great digital audio player but photo and data capabilities are a waste. External micro SD feature works well and is very nice.",
        "Its a great player I take it every where has great features love the radio on it and that you can adjust the sound settings",
        "I've had my c250 for almost a year and it's never given me any trouble at all. I took it on a six-week cross-country bicycle ride last summer and the thing is bomb-proof. I didn't even have the protective case, but I think I may purchase that now. Great battery life too. I can't really explain the negative reviews this player has gotten, my experience has been great. I find the display easy to read and I've had no issues with XP compatibility. I had an iAudio player by Cowon before and it was always freezing up, requiring a firmware update. The Sansa has been trouble free.",
        "This is a great player. I highly recommend it. Sound is great and the bonus is it has a radio too.",
        "This Sansa MP3 player works great. I have been using it for years now and have never had a problem with it. My music sounds great if I am using my earphones or if it is connected to speakers. I love it.",
        "The SanDisk C250 is a really good bargain for the price. It works better than I expected and is easy to operate. Amazon's price was the best I found and I checked a ton of places. It is worth the money.",
        "Took me a little while to work a few things out, (like it doesn't seem to play nicely with XP Pro) but overall great product. Have even used it's personal recording utility and it works very well.",
        "the player itself is okay, but the instructions are minimal and of little use. it took me several days and a call to the techhelp line to get it to work. and i'm still ironing out the little bugs.",
        "I bought this for my dad who after seeing my Sansa liked all it's capabilities. this little guy has more bang for the buck. It buy far suppasses the I-POD equal. the does music, pictures, videos, FM radio, FM radio recording, and voice recording. I haven't really played with the thing since it's my dad's but I love mine.",
        "The sansa is very easy to use and holds a great amount of music.Also love the fm radio.",
        "The screen on this unit is almost impossible to read outdoors, especially in sunlight. The engineers who designed the blue and white display must never have tried it outdoors. Really a poor design unless you never go outside.",
        "I am very pleased with this product. It was refurbished, and arrived in great condition and works well.",
        "small and light. the buttons seem flimsy, but they work fine. after rockboxing the player, it unlocked great potential (games, eq, applications, etc). i wouldnt use it as my main player",
        "This was a great buy for the money! If your looking for a less expensive mp3 player but not looking to comprimise on quality then this is for you. The menu is really easy to navigate and puting music on it is a breeze. I love having the option of adding the memory card to increase my space if I want to.",
        "Easy to use, sounds great. My only complaint is that the screen is sometimes hard to read outside in the sunlight.",
        "It is a good quality product. It's fairly easy to move through songs and menus. It was a little tricky trying to get the songs on initially, but we figured it out. Can't beat the price for this type of mp3 player that has an expandable memory option.",
        "Great player for the price. It has all the features I was looking for. I would recommend this product for those who don't wish to pay for the ipod name, but are looking for portable music.",
        "If your goal is simply to listen to hours and hours of music then this is the perfect mp3 player. I especially like having multiple playlists and shuffle play. The headphones are contructed well but the sound is just barely average. Overall though, still a great value for the price.",
        "This is my 1st MP3 player and I'm really happy with this purchase. You can't beat it for the money. To make it better, its expandable so you'll never need another player for music. I highly recommend it.",
        "Pros: Light, small, good sound quality and cheap for a 2G player. Cons: I did not like that you can charge it only via USB (but some may prefer it). Also it looks little bit 'cheap'. I think it has a quite high quality/price ratio.",
        "A really good mp3 player. It doesn't come with any clip so you would haveto buy a case to put it in. The sound quality is good and it is easy to use. I am so happy with my player that I bought one for my brother for Christmas :)",
        "I ordered this player for a Christmas gift. When I gave it to my friend they were totally excited. I had already pre-loaded much music on the device and it was very easy and simple to do. And very easy to use. As of right now I am very happy with this product",
        "I bought this unit for my 10 year old so she would have something simple to use. Unfortunatley it is too simple. The music management is terrible. It seems to put songs and albums where it wants to, and some things will show up on the player when it is connected to the computer, but will not be there when you look for it on the player. The other issue I have it even the lowest volume setting is too loud, especially for a child. I guess in hind site I should have loved her more and purchased the Nano.",
        "this mp3 is okay having problems with using the micro sd card will not read it so i only have the 2 gb it can with also the battery seems to not hold charge to well. other than that its good nice size good sound some what easy to use.",
        "Very nice for the price. Good sound, no proprietary software. If you're looking for a basic straight forward player, this is an excellent choice.",
        "I've tried I-pod ...didn't work right... Tried aother brand....wouldn't recharge sooooo... tried this one.. a home run!! Good price, works as advertised, good sound etc... the only neg I could find is the display is a bit difficult to see in the bright sunshine outdoors.",
        "Good value for the buck, it works fine, software is not great, slow and difficult to update. did not include the CD",
        "Bought from Blueproton (via Amazon) got a version 2 of the c250, so sadly it is not yet compatible with the much better Rockbox firmware. [...]The player doesn't have it's own software appears automatically in Vista as a mp3 player (storage device). Making playlists is clunky. It's a lot like a 1st gen MP3 player, I would say skip unless it's selling for ~$25.",
        "I have really loved this new player. It's a great little player and perfect for use at school. Battery life is good and the sound is good as well. No complaints!",
        "I have another Sandisk mp3 player and never had any problems. This one is next to impossible to erase the preloaded music and I was never able to download from my computer without error messages. I thought it might be me or my system but had my electronic engineer son try on his with the same results. This player will find it's way to the trash.",
        "I purchased this thing years ago. It still functions, but with an annoying buzzing. However, I used it for many runs and it worked just fine. The buzzing is probably due to all the drops it had to go through.",
        "It works. Software interface is a hassle. Not impressed. Battery charging is lame. Ear buds also useless.",
        "My husband bought me the 2 GB and himself the 1GB. Great product for a great price. Love how it is small and with a colorscreen. Only drawback is that you can not listen to it while it is charging. Battery life is insane!!"
    ]
}