{
    "entity": "Ventilation Fans",
    "text": [
        "Just got this fan yesterday to replace an existing unit. This one was a little bit smaller so I was worried about installation headaches but had no such problems. You CANNOT install this fan from room side, you need access up above. Went in easily, the toughest part was the attic crawl and crouch! Installed it, tightened it down and it’s nice and quiet compare to what it was replacing. Not silent by any means, but very reasonable. Good value for the money.",
        "Fan is moderately quiet, and without having any way to check air flow, seems to move an ok amount of air. The exhaust duct \"connector\", flimsy plastic piece, that slips onto side of box is junk. Had to screw it onto the body to keep it from coming off. The way the grill mounts to the light \"reflector/shade\" is junk too. There is all of 1/4\" of a lip onto which you would attach the grill and the pre drilled hole in the plastic grill puts the screw about 1/16\" from the edge of the light shade. Just a cruddy way to design something to attach.",
        "We bought this to replace (hoping for a direct swap) an older Broan of the same model. Unfortunately, we had to remove the entire casing and enitrely re-install the new fan. Even though measurements and everything were the same, we had to remove all the guts and re-install. Had I known we were starting over, maybe would have shopped for other options. The new fan is very nice though and a nice update to the same older model. We originally wanted a fan without a light because there is already a vanity light, and the fan light seems redundant. That lightless model would not fit in this casing (well, either would this one lol) so we just kept the light.",
        "Good replacement, slightly different from the 20 year old unit it replaced. It's also a bit more efficient, the original motor was 2 amps, this one is 1.5 amps but pushes the same amount of air. I kept the original housing in place but replaced the motor and the light assembly. Overall, not the highest quality vent unit but excellent value.",
        "When it arrived I noticed it had the same motor assembly as my old fan so I decided I didn't want to get in the crawl space and re-wire a new fan. I just popped the tab and replaced with the new motor and had it done in less than 5 minutes with no trouble at all.",
        "I had the Broan fan in our guest bathroom and it was 20 years old and was pretty noisy, so I wanted to replace it with a new one without too much work. It was pretty easy to replace and I'm happy with the result (see before/after pictures attached) - it took 10 minutes to get it replaced as I just kept the original box but replaced the motor and fixture. Unfortunately the fan still has the same sone rating and is still not that quiet but at least the motor is running smooth now, so for that price, I'm happy that I replaced it.",
        "This is very very weak. I have a very tiny bathroom and this is not strong enough. And my bathroom is TINY! :( DONT BUY THIS! buy one stronger",
        "I bought two of these on prime day for each bathroom. I wanted extra light in addition to the fan that was already installed. Can't speak to the installation though, my electricians put it up but didn't have any complaints. I love how quiet it is. It is so quiet that the old toilet is much louder, and now I want to replace that too. The light is a nice, bright more of a warm white light. It works well with the daylight bulbs in my other light fixture in that room. Very happy so far.",
        "This model was same at current house. I don't know how old, but probably more than 10 year old from last remodel history. The fan started making noise time to time. The new unit received is almost exactly same. So it was very easy to swap old motor and fan unit. It took about 5 min to replace the parts. It was about 5-6 hour research to find this model. About 30 min clean up time. Over all, I'm pretty happy with result and they kept same model",
        "so we bought this because our old fan went out. We have a small house so without a fan during showers we actually set off the smoke alarms in the house. We installed this joping to fix that problem, but even leaving it on and the bathroom door shut after showers the alarm was still going off. We had to spend an additional 40 dollars to get a dehumidifier for the bathroom to do what this fan is unable to do. I do however love having a light attached to the fan, because I can choose how much light I need in the bathroom now.",
        "I didn't get the light fixture part of this fan/light combo. Unfortunately I am in the middle of a big build and didn't check the package as soon as it was delivered so now it is too late to send it back. Buyer beware! I'm guessing this was a return and someone didn't check the box when it came back - so I lost out... Now I'll have to buy another one locally to be sure I get what I need!",
        "Meh, it does work well. It’s not too loud that you can’t hear someone from another room trying to talk to you. But it isn’t very good looking. So although it’s just a bathroom fan, it just looks too “plasticity” for me. I hated to tell my bf who installed it for me but ... nah. I think I’ll switch to something a bit better looking. But hey if function is your number one concern because of number two, you should be fine with this.",
        "Remodeling two bathrooms, bought two, finished one room and installed fan/light unit, ,works great. Give that one five stars. Finished second bathroom about three weeks later, installed fan/light unit, good for about fifteen minutes and then gets very loud to a point we have to turn it off. Give that one one star I am a retired appliance technician and I would say that it has a off balance blower wheel of tight motor bearings. We missed the 30 day return policy. Too Bad so sad, next time I'll shop at a local store. Never had a problem returning items there.",
        "Worked great! As another reviewer stated, I was able to use the motor, fan blades and cover from this unit to replace the 20+ year old fan that died. It was a little tricky to use the new cover, and I had to bent the metal a bit to get it to reach the center bolt. Other than that no complaints. It’s quieter and probably the same CFM or close to the previous motor and can",
        "It works and is not horrible to put in. not too noisy. for he price it is a good deal. I have purchased much worse so this one is ok. you will not be unhappy. It is not really impressive and sort of looks like 1970 fancy but hey it is inexpensive and works. you want the steam out of your bathroom and you only have one light switch. This works. you will to put in two switches to have a fan separate from a light. this works. its ok",
        "Good price, fast shipping....Replaced old 15yr old Broan fan. Removed fan mounting plate from ceiling then took new fan off of the new mounting plate (wouldn't fit in existing opening) installed using same hardware. Works fine. Total time to refit and install about 30 minutes....I used the new opening vent cover and light cover to give a fresh new look...",
        "I purchased this to replace a bath fan for a customer of mine. I used the motor, mounting frame assembly and cover. The job took 10 minutes to perform. The fan is so quiet that my customer called me to ask why I hadn't replaced the fan while I was at the store doing other tasks. I explained that I did. He went back into the restroom to verify. He called me back and apologized. The fan was running so quiet he couldn't hear it. Great product!",
        "Great value. Works well. Installation a bit trickier than I expected because the original install method that I tried to mimic was shoddy. It would be easy if I had to do it again. There is enough slop in the way these are designed to be installed that precise measurements and markings aren't important.",
        "The toughest part was me having to make the opening bigger!! Easy to install after you have a big enough hole!!",
        "If you’re looking for a simple bathroom light with fan, this is perfect. In an apartment you don’t have attic access so we (by we I mean my friend who does interior fixes) resulted in having to cut out a piece of the wall and then put it back with some cement to cover cutout opening to connect the vent and install. Came out perfect!",
        "Keeps the wood in the bathroom from getting water damaged while taking a shower. I installed one of these eight years ago and the fan went out so i bought another. Found out that the lead to the fan was undone and it was till good! but since i was in the attic anyway, i decided to replace. Might as well get at least another eight years out of this fan unit without a visit to the attic!",
        "It is easy to install, however i just need to replace the fan for my vent tho, so i took out the fan parts and replace it with my old one, very simple and easy but the screw that tighten the cover thru the fan is way too long than the old one i have so i need to use the old tp tight it up(will hit the fan if using the nut provided) the noise is quite bit loud, but for the prices it is good tho",
        "This fan works well and the light is a bonus! I was able to wire them separately to control them independently so I can leave the fan on and have the light off if I needed. The installation wasn't as hard as running the electrical and everything worked good, it didn't completely eliminate the moisture in my bathroom but it definitely made it a lot less and it doesn't stay as moist inside as it used to.",
        "Of all the sides that have provisions for mounting, the one I needed (without re-wiring or re-plumbing my attic's setup from our old fan) was not available. I had to mount it up OVER a joist and shim it in. Not ideal, but it would be nice if there was mounting tabs and holes on ALL FOUR SIDES. Fitment of the 'lens' and grille are also not the best and tightest, but it hasn't fallen down yet. Good thing we don't live near a fault line....",
        "Received it today with super fast shipping. Installed it in 15 mins and wow what a difference. I replaced a old fan without a light for this light/fan combo. My bathroom is brighter and the fan worked great during a hot shower. Thanks for the easy replacement that works like it should. Not to forget the price was perfect I will be ordering again for my other bathroom!!",
        "I replace a similar unit in my bathroom and the installation we pretty easy. The only issues I ran into was that the unit was smaller than the older unit and the power was located on the opposite side from my existing power. The ceiling cover was plenty big enough to cover the existing hole and the power issue was easily solved. Fan and light work great.",
        "Easy to install and wire. Gives you the option to hang with screws or nails. Connects easily to exhaust hose (not included). The fan is very quiet but seems to move a lot of airflow. The light (bulb not included) is bright but softened by the shade which is nice. It was $40 cheaper than a similar model at Lowes, and accommodated a better wattage lightbulb",
        "Great replacement for my 20 year old 688LN, although about 1\" smaller I was able to make it work. This is the perfect sound level for a half/quarter bathroom where you want enough noise for people to be comfortable, but not too much noise. Quality is decent for the price and everything fit together nice and snug. Does not come with a bulb, so you will need to buy a standard sized bulb for this (I used an LED). Would recommend.",
        "I ordered this 678 model because the model number is the same as the old one I was replacing. The switch plate is now on the opposite side which does not work with mine. I didn't know this until my contractor came to replace it and it is too late to do so. I am stuck with a fan I can't use. Broan has changed this design but makes no mention of this.",
        "Great product for the price! I replaced an older unlit fan with this one. I mainly needed more light in this bathroom and it does the job well. As far as noise, it's the same as the last one. I don't want anything too quiet, this bathroom is mainly for guests and I don't want to hear what they're doing in there. I'm ordering another one for another bathroom.",
        "This unit is nearly identical to the old one from 1978. You would think it could be refreshed by just changing the operating stuff but the whole enchilada needs replacement, requiring an attic visit. kind of noisy but not quite as loud as the old one. Wish I had spent more for a quieter model. This does move some air so it functions well.",
        "Works great! I probably should have just ordered a replacement fan only as that was what was broken on my original unit. I went ahead and disassembled the fan from the housing and mounting to my existing brackets. It was very easy. There are several helpful YouTube videos. My fan was blowing air down rather than sucking it out so I found a video on how to reverse the poles on the motor and now it works great!",
        "The housing is very thin and built cheaply as possible. The acorn nut was missing in mine so I am going to have to go find one and buy one because I had already mounted the housing and I don't want to fool with taking it back down. I expect it to work fine. I am just not impressed at all with the cheaply built product. Also the damper in the exhaust vent stays open a little which will allow outside temperatures to come into the bathroom. The damper has a counter-weight molded onto it engineered to make it close but it doesn't work.",
        "Got tired of the previous fan not doing the job, as it was placed center of the master bath instead of over the shower. Pulled the inset light out that ran off a switch, cut some drywall out, placed this in and screwed it down. Takes all the steam from the shower, not letting a bit get anywhere else in the bathroom. Will buy again for the next upgrade in the house.",
        "This light was purchased to replace one of the same brand that had been in our bathroom for 26 years. I hope it lasts for just as long. It is quieter than our previous one. I helped my husband with the installation. The instructions are clear. You do need 2 people for the job and some experience is required. Best to hire an electrician if in doubt. I bought it when it was on sale.",
        "I bought this as a replacement for an identical Broan 678 fan. The old one (original to my house) lasted 10 years before the fan became noisy. The socket that holds the light bulb also stopped working and wouldn't light up any of the 5 bulbs I tried in it. 10 years is a pretty good length of time for something like this to work. I hope the new one gives me as much time.",
        "I bought this unit to replace the one in my basement bathroom. As it wasn't the guest or master bathroom, I was less concerned with noise and appearance so I opted for economy. I was truly surprised at both the aesthetic and ease of install. Additionally, the fan noise wasn't bad at all. I will definitely buy this model again when it comes time to replace the others in my house",
        "Bought this unit to replace an old noisy one at our cabin. It was easy to fit and wire up. The light is great with a 100w bulb and the noise of the fan is quiet - way better than our old one that could be heard throughout the cabin!",
        "This exhaust fan certainly is a good value for the money and so far after one month of use it has turned out to be a very good investment. The noise level is not the quietest but extremely good for an exhaust fan at this price point. The build quality seems to be excellent and finish or excellent and overtime I do expect it to continue performing at the optimum level",
        "Great price, decent quality, nothing of special note, nor would you think so at this price point. It does the job it was designed to do using inexpensive plastic and metal, motor is louder than some but again, for the money, you don't have an excuse to complain.",
        "Not really noticeably quieter than the 50 cfm it replaced and as noted by another reviewer, the way Broan got this qualified to meet U.L. ratings is to hold the damper open to let heat out, which means the conditioned air in your home (that you've paid for) is escaping to the outside by Broan design 365 days a year",
        "Bought 2 of these for a new construction house. Mounted easily to the ceiling joist. Had to buy an 8 ft, 4in flexible dryer duct to zip tie to exhaust the humidity to the attic. The instructions said that an extra switch was needed to be bought to run the light and fan on separate switches. That wasn’t true. The unit has four wires. Red for fan, blue for light, 2 whites for common. I used a 2 gang box on separate switches.",
        "Product was used. The wires were cut. Sat in my basement",
        "It is priced to be quite a bit cheaper than anything comparable you can get in a box store. It has gotten a little louder since i installed it, which seems like a fairly common complaint. I Can further brace it if need be, but it works great and is still quiet enough as it sits. My installation required me to use my old cover/lens due to the size of the hole in the ceiling, so check your ceiling before purchase!",
        "This thing doesn't vent our hall bathroom for nothing. It doesn't come close to doing its job because it's false advertising. Hubby had to go to home depot to buy a replacement and it was the same everything as this one but vents so much it works.",
        "Nice fan for a smaller bathroom. Light gives minimal brightness w/ a bright white bulb. Fan again works for a smaller bathroom/ room-can't see much circulation for a bigger area. Install is simple- Out of box to completion took me 40 min. Quality seems good. compact unit that does what I need it to.",
        "I suspect the product would have been fine, I I had received a complete shipment. When I open the shipping box, there were just some parts thrown in without any manufacturers carton, instructions or even the full fan casing. As is, this is unusable and will be returned immediately... VERY dissatisfied!",
        "Compared to the builders quality bathroom vent, this one is very quiet.",
        "Got this, a little big for my old unit, but I had no problem enlarging the opening. Installed this in no time. Runs great and is quiet, maybe a little too quiet for people who make noise. I would definitely buy this again. Received the correct product in the right time.",
        "Instructions seem ok. Doesnt really explain that you need to plugin in the light and fan into the outlets in the unit, then wire the unit from the outer top. Also doesnt really explain to put the light guard in after that and use the only nut it comes with to hold that in place. Also, the plastic nozzle for the air output didnt sit well on me, doesnt clamp in. Other than that it works great",
        "Purchase this item for my father's very small bathroom. It was easy to install and as all ventilation fans it had some noise but it wasn't overbearing. We used an LED light bulb in it to make it even more economical. It works very well.",
        "Both fans came damaged. I can't even exchange the second one that came and that is frustrating.",
        "This didn’t make it out of the box. Go with Nutone at Home Depot This one is yellow and has cheap looking plastic. It went right back",
        "This was easy to install. Our house is old and had to bath vent fan, so I put this in with a long duct to the end gable. It was easy to install, and the noise level is fine.",
        "This fan is amazing for the price. It is much quiter than our old fan. It's not silent but the noise is relatively low. The only issue I ran into was the size of the vent tube did not fit the old vent tubing. Easy to resolve with the right tools.",
        "The fan itself is quiet. The installation was a bear. The quality of the light fixture is subpar because the light cover keeps falling out. The screw for the light fixture is too short to be able to hold it. I had to drill holes where the plugs go in for the power. Buy with caution.",
        "Great brand! The one that we had before this one lasted 30 years. So we went with Broan again. Great fan and love the light. Gives off good light in the shower.",
        "The plastic frame/vent cover looks a little cheap but we’re otherwise satisfied with the product. It is also a little louder than I expected, but not too bad.",
        "I had a similar vent fan installed before, which suddenly stopped working so i ordered this one I thought it will be and easy plug and screw in job but it isnt. Also this fan is a bit noisy than the previous one.",
        "This works amazing. I love that it has a light built in. I put this above my shower to help with moisture. The built in light is an added bonus. It sheds light on taking a shower. :) great worry in the construction and materials. Overall very satisfied",
        "Would liked to have been able to install from below the ceiling without having to go into attic. I had an older model that could have retained the above fan housing if I were able to remove the internal fan . But I couldn't, so I had to replace the whole fan which required installing above the ceiling.",
        "This is a great deal. Idk what y'all paid but I got it for 35 bucks!!! It's very quiet and with a little knowledge,easy to install. Absolutely would buy again!",
        "No good whats so ever. its not strong to take out all the steam when you shower. i wouldnt even recomade it to anyone! not even if you have a small restrrom.",
        "Great value. Not loud at all. Although you dont want your fan too quiet if you know what I mean lol. It's easy to install and looks good",
        "We replaced our old one in our house. It was old and yellow. This one came in and we installed it ourselves. For the price, we were very happy with our product!.",
        "This fan makes almost no noise which is nice in a small bathroom. I couldn't tell it was on with the door shut. Works great for smaller bathrooms to keep the moisture to a minimum and wasn't very expensive. Would definitely recommend.",
        "I am well satisfied with this product and the service I received from the Seller. This was a replacement item and it was exactly the same. I had no problem installing it and it works as described.",
        "Great design, simple install, average noise level, but doesn’t seem to move air very much. Blowing vape to the fan has no noticeable effect on the clouds. Fits a standard LED bulb and the ability to separate fan and light is great for our install.",
        "wotked perfectly much like the original. i wouldnt have noticed the loudness if i havent bought a 1.0 for the downstairs bathroom.",
        "May 6 2018 installed , our large bathroom mirror does not steam up , and relieves moisture in bathroom after shower, will update in 3 months",
        "For the price, it's a great light/exhaust fan! We installed it in one of our powder rooms yesterday - hassle free - and it's of very decent quality! Highly recommend it if you're looking for something inexpensive! What you see is what you get with it!",
        "Unfortunately, I couldn't find just the motor size I needed and It was the same price to order the whole unit. I was able to replace the motor on one unit, and the plastic grate on another unit. So win, win.",
        "Works great! Contractor installed, so can't comment on ease of installation.",
        "Bought this for the parts to update a 30-year-old Broan bath fan that has different dimensions that any of their current models. Was super easy to use the parts from this light to make my own fix kit and it's working/lighting good as new now! Very happy with the outcome and no new holes in the ceiling!",
        "It works fine but started to have squeaking sound after a week. Not sure what is happening. I's really impossible to take it off and return it now. Just wanna leave a review so you guys know.",
        "** TIP ** Before buying a ventilation fan, you could go to a Home Depot or Lowe's and test out the different ventilation fan sones. It was very helpful to us in selecting how many sones we wanted. We purchased 2 of these in October 2010. Both of our fans are working just fine. We picked these fans because we wanted a fan that has some noise to drown out some of the bathroom noises. As for the light brightness, in one small bathroom, we also have a light fixture above the vanity. In the toilet closet we just have this ventilation fan/light and it's bright enough to read a magazine.",
        "Easy install...worked well...happy with my purchase...cheaper price then home depot...saved me a trip of 100 miles to buy it...",
        "Super easy install, not completely silent but not at all noisy. Light made a hugh difference. Very satisfied, highly recommend",
        "Was an easy install, I had to add additional bracing in the attic due to the previous cutout was a bit larger than this model. While the noise level is low than our previous venting (15yo model), it was higher than I expected. Supports a 100w light which is very nice, brightened up the bathroom quite a bit. Attaching venting tubing was a breeze.",
        "Fan is pretty weak. It barely pulls a test smoke into it. Much quieter than my previous one but that one cleared the room of steam fast.Cheap and easy to install.",
        "Very loud, but you get what you pay for and the quality is not bad.",
        "Good fan but it’s loud, it’s white noice so not annoying but just definitely could be quieter!",
        "You get what you pay for but I would think they could have made the visible part look a bit better.",
        "Typical install for a bath fan. Relatively quiet. Doesn't move a ton of air but works just fine",
        "Not clear on instructions and it bends easy still working on getting the wiring figure out",
        "Updated and replaced a 50 year old fan. Lighted fixture is a plus. Slightly better air flow.",
        "I had it installed. Good value for the money, adds light by our tub so a good improvement. Use an LED bulb.",
        "Needed to replace this unit to list my house. Whisper quiet. Easy to install. Great price.",
        "Works well. Since my old exhaust fan wasn’t a light/fan combo I had to use a extension cord (which I had shortened) on the inside of the housing to run the light with the fan.",
        "If you’re looking for a basic vent fan for a bathroom this is a great one. Can’t beat the price and it does a great job clearing steam from our average size bathroom. The noise level is moderate. It’s a little louder than a fancier one at my sisters house but this one also works better than hers. It’s not obnoxious. Will buy again for our other bathroom when we’re working on that one.",
        "Purchased this after going to the big box stores for our remodel. No issues to report. Worked for what we needed.",
        "good value for the money. for around 32 bucks it was cheaper than homedepot.",
        "It came as advertised but the fan is not very strong. It doesn’t seem to help much with the steam but the light is great.",
        "Absolutely a perfect fit. It was cheaper to buy this whole unit than to buy a replacement fan motor.",
        "Love this fan and light. Easy to install and quiet! Replaced a fan that was not working.",
        "Good price but its noisier then I would like. It works like expected and have had no problems with it",
        "This is a little on the cheap side but it was very inexpensive so what do you expect right? But, it works great. My husband installed it in about an hour. He spent quite a bit of time in the attic venting the fan. But it looks fairly nice and its doing the trick. I think its a good buy for the money. I rated it a 4 just because it is a little bit cheap....but like I said, you get what you pay for. And we were looking for an inexpensive fan/light.",
        "The model says it’s the same as what we took down however it really should say version 1, etc as you couldn’t install the same way. My handyman had to add a 2x4 in the ceiling to fasten it to",
        "Fan is good and price is great. The problem I had was installing it to the ceiling. Not many ways to attach it so I had to go into a hot attic and add 2 x 4s so it could be installed properly.",
        "Easy to install, and quieter than I expected. Used it for a pool changing room, perfect!"
    ]
}