{
    "entity": "Ventilation Fans",
    "text": [
        "Good product for new construction but horrible as a replacement fan. Snap in design makes it impossible to replace an existing fan. This design requires a much bigger hole in the ceiling than the fan being replaced because you need to install it at an angle instead of straight up. No way to install in the existing hole without significant damage to the ceiling. This would be OK for new construction before a ceiling was installed. Returned fan because not as advertised, i.e., a good replacement fan...it is NOT.",
        "Install went fine. The light is good. The fan does a good job of clearing odors and steam quickly. However, the description says this fan is whisper quiet at 0.8 sones and it's more like normal conversation volume around 2 sones. Since I bought this specifically because of the sone rating I give it 2 stars. I have a NuTone in another bathroom which is rated at 1.2 sones that I can hear only if the house is quiet. I will stick to that brand and pay the extra from now on.",
        "Got this for a RE-model and read reviews before I purchased. The only negative I saw was for the mounting mechanism that came with it. I never use the clip in crap anyway preferring to mount solid with screws. It matched up easily with solid duct work and moves air real well for a 120sqft bathroom. I'm completely satisfied with the installation, look and operation. I would purchase again.",
        "I have the 90cfm fan in several of my bathrooms and am happy with thrm. I decided that I would like more air flow in one of the bathrooms. The BFQ 140 seemed like a good choice. I didn't mind more noise so long that it moved more air quickly. The install was easy since the BFQ 140 motor fits in the same housing as the BFQ 90. The issue I had was vibration. It works well, noise level was acceptable, but it vibrated my attic joist so bad you can feel it down to the basement. I wish this came with some sort of rubber damper to reduce the vibration.",
        "I read other reviews and was concerned about the noise, because it seemed as many people felt they are loud. We have two of them in our enclosed porch with the dryer vent as well as a hot tub. Our old fans would still have the condensation building up on the windows, but these fans work amazing! We could have just used one fan, but since we had (2) of the older ones, we already had the electrical in place. They do a great job keeping the condensation from building up and are much quieter then our old ones.",
        "Excellent fan. There is no fog on my mirror after installation. I was a little hesitant buying this for a retrofit, as a lot of people have said it’s necessary to cut an oversized hole to snap the fan in. This is NOT necessary!! Orient the fan so the exhaust is closest to the joist the bracket is attached to, and cut the hole to their spec plus an 1/8” or so. From underneath, aim the exhaust tip corner up into the hole first, then kinda rotate and push up and snap it in. It takes a smidge of force, but it goes. No patching! I’m about to buy a second one for my new bathroom downstairs.",
        "This think has a bracket that's supposed to mount to the ceiling joist, and the enclosure is supposed to simply snap into the bracket. It doesn't work. There's no nail flanges to simply screw the thing to the rafter. It's really a silly setup. I had to screw around with it for two hours to come up with an alternative mounting. The thing does run pretty quiet, and has good airflow. Too bad they didn't come up with a better way to install it.",
        "Pay attention to the existing home mounting reviews and comments. I’ll get both of mine installed but the directions and easiness are false/misleading. One design change (the two tabs on the frame for airflow ducting could be made on the plastic transition piece and voila, the instructions for the size of the hole in the drywall would be closer to accurate). And I’m doing my install from above mostly so it helps me cut the minimum for the fan swing.",
        "This fan was in a guest bath. Used five times before sounding like a freight train. Now the night light doesn't work. Maybe whatever was making the noise broke into the night light bulb. Almost afraid to take the cover off.",
        "Extremely low cost unit, the bracket that mounts the motor to the housing on four of the six I purchased were bent, not allowing the motor to rotate. I am handy enough to take apart and bend it straight. Pay a few extra bucks and get a higher priced model. But to be fair the mounting and electric hook up were great. Also after a blower door analysis, and air balance , these unit do not move the rated air volume, most of the six I have installed move about 75 cfm......",
        "Like other reviewers have pointed out, this fan seemed to give the most power for the price and got good reviews so I tried it. I was not disappointed! I was a little concerned about installation because I was replacing an old one and some reviewers had pointed out issues with installation in existing homes. However mine was as easy at it could be and I am not a professional. It didn't take long to install and works great. It is pretty loud, about like a dishwasher maybe, but that was disclosed in the specs, so not a complaint at all. Seems to really move air so far. I would definitely recommend it.",
        "Not a “do it from the bottom floor fan. For Old Work replacement it is impossible to snap housing in without over cutting the drywall. Instructions are missing key illustrations. If you’re going to get this unit be prepared to put on your bunny suit gloves and respirator to go up in the attic, hopefully on a cloudy day or nighttime. It’s cheap, well built, and quiet. But even with ten years in the handyman trades I’d never buy this again for remodel.",
        "Mounting system is a joke would have to cut out a bunch of extra Sheetrock to use the bracket, and then wouldn’t be able to remove it to replace it without cutting Sheetrock out, I threw the bracket in the trash and shot screws through the side into the stud. Kind of loud but for a cheaper unit it’s pretty much as expected",
        "This is one of the most quiet exhaust fans I have ever had. The value for the price is excellent. The directions for installation were average and because it was a replacement we had to do a bit of work to make it fit. The most difficult thing was trying to attach the cover - maybe it was just me, but I had a hard time finding the slots for the spring clips to fit into :). Overall, I am very happy with it.",
        "For new construction this fan would be fine. However, for existing construction, to install this fan you will have to cut a large hole in your ceiling in order to have sufficient access to install. The instructions recommend that you cut a 24\" rafter to rafter hole. So, if you don't mind patching a large hole go for it. Otherwise, I recommend that you find a fan that can be installed using an opening the size of the fan frame. I sent mine back because I wasn't in the mood to patch.",
        "I've had this for 10 months and IMO I wouldn't buy this again. I'm actually going to replace this with a delta breeze greenbuilder 80cfm (.8 sones) from local brick and mortar. Noise is considerable around 3sones. I don't mind the noise to drown out my personal time but the wife wants it tone down. CON: The cover is flimsy and cheap looking and also does not cover the fan unit. This annoyance becomes apparent when there's too much time to observe the bathroom during private time.",
        "This fan is powerful. We had to replace a cheap fan put in our smaller bathroom which held water and caused the ceiling to get wet. We have roof ventilation. This fan isn’t necessarily quiet but man is it effective! Honestly the noise level for us isn’t a problem. It’s equivalent to white noise and helps with bathroom “sounds”.",
        "While the fan works well and is quiet, installation was tough and you can see through the vent too easily. The issue is, my house has plaster walls/ceilings, even cutting with a fine tooth saw blade, the cuts never look good. I spent 2 days cleaning up the edges with filler and painting it so it doesn't look bad. Like many other reviews have stated, the bracket installation was extremely tough. The hose adapter sticks out too far making it nearly impossible without bending the bracket. This would be better for new installation. Was contemplating putting a 2x4 across the top of the unit between the studs and then screwing the unit right to it instead of using the brackets.",
        "Is it the most quiet fan in the world? No. But it's by no means a loud fan. It's probably about as loud as the low powered fans from the 70's that I'm replacing. Does it move a lot of air? Heck yes! My kids will take 20 minute super hot showers on a cold day in a small bathroom. With this fan running, the mirror doesn't get even slightly foggy.",
        "It wasn't all that easy to install, and it's certainly loud, but that's expected. No bells and whistles. If you want automatic on/off, or adjustable power, or whisper quiet, look elsewhere. If you want your bathroom thoroughly ventilated, and maybe some noise cover when you are in there, this works great.",
        "I just pulled this out of my bathroom ceiling and replaced it. We got to the point where we just couldn't take the noise. It does exhaust the air fine, and we never had anything break, but my recommendation is to spend the extra money to get a quieter fan. It was super easy to install, and I liked their mounting system. Hopefully they can work on making it more quiet.",
        "This is a great bathroom fan if you don’t want to spend a lot of money and you want high CFM. However, you’ll need to be willing to get creative with how you mount it. Some goofballs on here have pictures of them cutting out WAY too much Sheetrock to try to use the “snap in” system. Forget about using the snap in thing—it’s not designed for renovation. I ended up simply drilling two pilot holes in the plastic housing and shooting two screws through them to mount this right into the 2x4 stud. It may not be how it’s designed, but it sure got the job done. I’m glad I didn’t spent $100 on a different unit!",
        "Typical fan noise is low, but makes a very annoying high pitch noise. This was installed in a closet with a kitty litter box to keep the smell out of the room. Pulls air, but not enough. Installed it after everything had drywall and paint, it was a pain in the butt to get it installed.",
        "Had problems with a 50cfm fan installed. It was not powerful enough to force air up the 3 inch plastic flexible tubing that went a few feet to the roof. The new fan moves the air and the users of this particular bathroom are happy with its performance. The additional cfm with a 4 inch aluminum semi-rigid exhaust tube works great.",
        "I used to get mold on the ceiling in the bathroom for a few years, and had to scrub and repaint each time. After reading up on possible reasons why it kept growing mold up there, I realized the ceiling fan was the culprit and was inadequate to handle the size of the bathroom. I bought this fan which doubles the CFMs and it did the trick. I did have to buy an adapter to fit the original vent piping. Been in and running for a few months now and I'm satisfied.",
        "This is exactly what I needed. Fit perfect and easy to install. Bad part is the clips on the plug are super weak. I pushed the plug in to plug the motor into the box and both clips on the connecter broke when it clicked in. So now I have it installed but it will not work cause it won’t stay plugged in. Supper bummer!",
        "Not , NO !! 0.5 sones for almost silent operation . It is still a great product but , not that silent like 0.5 sones . I will say more like 1.5 sones to estimate . It is still a lot quieter than many other more expensive ones out there . For the price it is awesome . Real nice plastic body witch is great for anticorrosion and quietness . Easy to install . Overall great buy .",
        "Screw the bracket to the joist and it snaps right on. Gives you enough room to shift the whole fan 1-3 inches up or down the joist so you can more easily to attach the exhaust hose. You can also switch sides for a right or a left mount if you need it. Use aluminum tape and no need for sheet metal screws of clamps.",
        "I strongly recommend this fan. I have installed fans like this one in bathrooms for years. The difference is that this fan sells for 40% of what you'll pay for Broan and Nutone. The fan has a 5 year warranty, the others have a 1 year warranty. It is a very good fan, as I have one in my own home. I am a licensed electrician and plumber.",
        "Easy to mount and install. It's a solid bathroom fan that I put in my downstair basement bath. Noise level isn't bad. While isn't not super quite, it's definitely more quiet than the original bath fans that are installed in my home.",
        "I just installed this today. The fan works fine and the installation was fairly easy. However this is supposed to be 0.5 sones? No way. It's louder than the fan I installed in my other bathroom which is 2.5 sones. Since the very low sone rating was the reason I chose this unit, I have to give it an unsatisfactory mark. I wouldn't buy this model again.",
        "I purchased this exhaust fan almost a year ago, for a remolding power room that we did, my biggest concern was the noise level, as the old one we had was very loud! This one is very quiet I'ts not annoying when it's on. Very happy with choosing it.",
        "I have installed 3. They are tricky, as many have stated, but that's not my complaint. I don't like the fan because it only seems to last 3-5 years before it starts getting louder and louder and has to be replaced. I'm literally listening to it rattle and it's been just over 3 years. I'm looking for something new this time.",
        "This fan is so good, I bought one for each bathroom. The ones we had were the $150 ultra silent ones which are nice but when it’s 6AM and the house is quiet and taco night was last night, they don’t provide much noice cancelation.",
        "I was able to replace this from inside the bathroom. Did not have to go into the attic crawl space which was a welcome relief. It was a fairly easy installation and no issues encountered. I think the unit we replaced was a NuTone that was no longer getting much airflow. That older unit was quieter however it moved less air. I was honestly surprised by how much louder this new one was. As per other reviews saying how quiet it was I wasn't expecting this much noise but perhaps this is normal for this amount of airflow. In any case I am very pleased with the performance and would recommend to anyone.",
        "Our handyman who installed this one was surprised how quiet the fan is. He said that he installed many bath fans, this one is by far the quietest. The fan looks good in my bathroom. I didn't pay much attention, but I did see him struggle a little to install this fan, I think there were few minor issues, If I could I'd take only half a star away instead of a full one. 1. Installing the bracket and mounting fan was bit difficult 2. The size of my duct did not match, we need to get a reducer. 3. The plastic damper looked little flimsy and not sure it will last in preventing draft",
        "Almost went with a $150 Panasonic, but decided to give this a whirl at 1/5 the price. It's relatively loud, but not in a bad way; I actually like the white noise this provides, giving the bathroom occupant a little cover should a melodious (or discordant) toot make itself known while atop the throne. This fan sure pulls the air. It keeps up with our shower no problem. Two months w/no problems so far. Five stars for value.",
        "turn off the power switch and tape it off. check with tic light to ensure power is off. mount to a beam with some sturdy wood screws, may have to predrill holes. hook the quick disconnect pin to the power. mount the bracket and just snap into the bracket. runs very quiet and pulls a lot of air out of the room.",
        "Purchased two first one no problem second one motor makes noise plus fan out of round. Motor makes noise not fan. Hoping for replacement motor and fan. I do not want to remove compkete unit do not hsve attic access.",
        "Put on of these in each of our bathrooms. If you are looking for quiet, this is not it... But we have just a thin wall in between our two bathrooms, so we wanted something that would move the air and maybe block out the noise in the bathroom next door. Bought two of these and very happy with the amount of odor and moisture that it pulls from our bathrooms! High performance, but it is noisy just FYI. Also better price than our box store offerings!",
        "Great motor..... But mounting was horrible! I had to make shift it to mount. Housing is cheap plastic that flex when mounting. Cheap metal clip leaves other side pop up. I WOULD have gladly paid 20 bucks more for a metal housing. Only reason I'm not giving one star is it was cheap and motor is strong. But I wouldn't have bought it if I knew what a headache it was to install. Going up and down attic when mounting what a pain.",
        "This was Mount it with ease I really didn't have any issues with the quality. Based on how quiet it is I did not expect much air movement, but I was wrong. This time it was good to be wrong",
        "The fan work at it should, but it's very loud, louder than I thought it would. Not jet engine loud, but definitely loud enough to annoy people. Not rattle noise, we installed the unit perfectly level, but the fan noise. I haven't tried other brands, so I can't compare a similar cfm fan, but this one is too loud for me. On the positive note, my mirror doesn't fog up anymore, even when I ran the hot water for 15 minutes.",
        "The product works ok. The “ez install system” absolutely sucked. I have installed many standard exhaust fans and never found it to be difficult but this quick install system gave me nothing but problems. It is not very secure at all. I had to come up with alternative ways to support it. I would not buy it again do to the installation system.",
        "This exhaust fan has saved our bathroom from so much moisture, and our wallet from overpaying at hardware stores. It's fairly quiet, but honestly, I don't mind the white noise while I'm in the shower. It's well worth the purchase. It was very easy to install!",
        "I purchase these two fans after having installed another one about a year ago. It works very well and is fairly quiet especially when compared to the fan it replaced. I did extensive research before purchasing this fan and it was the closest fit for my application. This fan is definitely not an easy replacement into the existing internal opening. If I could have replaced it from the roof side it probably would have been an easier installation, but that would have required even more work. I was able to work around the installation problems and was pleased with the performance. That is why I purchased two more of the same fans.",
        "I replaced an old 4+ Sones fan with this 2.5 Sones one and My girlfriend loves me now. This thing is whisper quite!! It took me about 30 minutes to install this after taking the old fan out. the bracket screws into the joist and the fan snaps into place.....its that easy! With the old fan installed we would hardly use the bathroom fan while taking a shower or getting ready after taking a shower because the noise was so loud. Since installing this fan I swear you can hardly notice its on, and now we use it all the time.",
        "Pros: Quiet, moves a ton of air. The glass light lens is nice since it won't fade or discolor like the plastic ones. Cons: The \"faceplate\" is fairly flimsy and the spring wire design to hold it up is kinda cheesy. Installation was a nightmare but that's not the fault of this fan. Just a general warning for people looking to replace an existing fan from below.....I've learned that these are apparently meant to be installed from above. You can do it from below but it's a BIG pain. We don't have attic access to do it from above.",
        "Was super easy to install and worked great. . . . For two months. Motor cramped out yesterday and I just missed the return window. Going to go after the manufacturer for a replacement motor. For now I give it three stars. It will go to zero if they don’t send me a replacement motor.",
        "replace an old fan form the 60's in one bathroom and installed a new another one. Both went without a glitch. Not as quiet or powerful as the big ones, but great performance for the money",
        "Came with the fan jammed inside and it didn't work. I have to opened it and adjust it, which it's a lengthy process of trial and error, because it's done by bending a piece of metal that holds the fan in place. Even being a snap on, it's impossible to install on sheet rock ceiling without cutting 3 inches on the side to install the exhaust pipe. Noise level is good if you manage to adjust the fan in the sweet spot it doesn't scratch the sides, which is very difficult",
        "I added two Air King Bath Fans to our old house to vent steamy shower air to the exterior of the home. This will help keep the interior and attic dry, and now we do not have to open the window to vent air out of the bathrooms! The fans are QUIET and move a lot of air which is exactly what I wanted. They appear to be well made and designed for low maintenance. I used Deflecto GVH4 4-Inch Galvanized Vent Hoods (also available at Amazon) to duct the air out the side of the house. Both are good products and were low price at Amazon.",
        "I wanted something like this but with oil rubbed bronze screen color so I spray painted this. It was a bit risky but it turned out good in the end. The fan is a bit louder than what I wanted a fan to be but I think you can't get much quieter with this power. The bathroom is quite large so we need some fan that actually is strong.",
        "Just replaced a small fan in my larger than normal bathroom with vault! This thing looks and works great not super quiet but it moves 2 x as much air as my last ceiling fan and is about the same in loudness. This does have a 4\" vent so make sure if you are upsizing from 3\" you are aware! I was and wanted the upgrade and was easy to wire, mount and re run new 4\" vent tubing!",
        "Seems like a good fan for the money. Hard to find a fan with less than 2 sones for under $100.00. Now for the problem. The fan I received is for NEW WORK ONLY. This fan was made to be installed before any drywall is installed. If your ceiling is already installed ( replacing an old fan) , this fan will not work with the included mounting bracket. They should have included this information in the item description. I ended up making my own mounting bracket by installing a board across the top of the housing and bridging two ceiling joists. Four hours later I had it installed. Fan: five stars, Installation and documentation: one star.",
        "so easy to instal only thing that was like work was having to increase the size of the opening for the fan and they move the air! not a fan of the cover it could be made better so you dont see the fan inside but for the price cant have the world",
        "Bought two of these for my bathrooms, I upgraded the 3\" vent size to the 4\" vent size if these fans. Installation of these was pretty straightforward for having never done this before. My bathrooms no longer fill with steam from hot showers. Only thing is that they are somewhat loud, not terribly loud, but I guess moving 120 cmf of air is going to make some noise. Overall very happy with purchase and great price.",
        "I did not like that it would not take the steam out of my bathroom after a shower vey low sucking power. Dpend a little more and get one that works. It was very quiet and easy to install.",
        "Installation was weird as it angles up allowing attic dust to come in. Followed instructions with friend perfectly. Makes no sense why it angles.",
        "Fan was easy to install. It is not as noisy as everyone suggested. I can stand in the bathroom with the door closed and feel a breeze across my legs. Very well built for being made of plastic Good bang for your buck, well worth it.",
        "This works pretty well, and it's pretty quiet... unfortunately, the motor conked out after 18 months. The only easy way to replace it is to buy the same thing, and just replace the inside unit, which we did. So I've bought two of these, and I'm considering buying a third in case the new motor conks out... I hate to give more business to a lame product, but guess i gotta do it... BTW, I paid $31 for this in Dec 2015... it's currently selling at $39...",
        "Fairly easy to install. You need to be next to a stud as the snap-in mount will only mount to a stud from the side. You may need to cut a larger hole in the ceiling if you are replacing a contractor installed fan. Fan snaps-in to mount as advertised. The exhaust duct is 4\" so you may need an adapter if your current ducting is 3.\" Moves air very well, as advertised. The only problem I had is that the fan is a little out of balance making it louder than the advertised 4 Sones. I can hear a distinct vibration on startup and spin-down of the fan.",
        "Bought this after reading online reviews for worthiness. Installed easily and operates as described. Quickly pulls humidity out of the room. Not too noisy like other bathroom fans I’ve had. I would buy again.",
        "I bought this for my handyman to install in our main bath. It was fairly easy for him to install - he had all the parts he needed. I was completely surprised at how quiet the fan was. In the winter it's too cold for us to keep the window open during nighttime showers, and we needed ventilation to keep mold from growing on the bathroom ceiling. This fan is strong enough to keep the fog off the mirrors for quick showers. For longer showers I just make sure to keep the fan running for a little white after the shower is done to help clear the air. I love that it's Energy Star rated too.",
        "I love this new fan. The sound is minimal, not expecting whisper quiet here, especially since I bought the biggest one. It has a blower type fan within it, not your normal blade fan, the same kind in your furnace. The design is amazingly simple and it was easy to install. I have the largest motor, which is definitely overkill for my bathroom, and it has a 4\" outlet which I added a 4\" to 3\" converter and this thing blows like crazy out of my house. I am extremely satisfied.",
        "This moved the air in the bathroom really well for about 6 months, and then just doesn't work that well anymore. There used to be no moisture in the air after showering, now the mirror is covered with condensation. I tried cleaning out the fan blades (it's carousel style) which took forever and that didn't help. Ducts in ceiling and attic are new, so I know it's not that. It still functions at a lower quality level but the first few months were so good that I came to expect that kind of quality air moving on a regular basis.",
        "I've purchased two of these and they both work swimmingly. I bought them about two years apart and my first one is just as quiet as the new one. Let's be clear, they're not super quiet but for the amount of air they move, I can't complain. I bought Woods timer switches to go with them and leave them on for 20 minutes after each shower. Getting them to vent outside was a bit of work but well worth it.",
        "My Air King BFQ 110 motor went out. But because of the size of the room I needed more CFM. I noticed that the 140 had the same size housing as the 110. So I took a chance and ordered the 140. Install was easy because the housing was already in place. The noise level is a lot higher then the 110, but as long as it moves more air I can live with that. I did price replacing just the motor. The price of a new motor was just a few dollars under the cost of the 140. So I went with the whole kit. Shipping was average.",
        "This thing is great - easy to install as long as you follow the instructions. The only complaint I have is that the air duct location is on the opposite side of most standard / nutone type fans. SO, if you're replacing an existing unit, you need to reroute ducting (which was a bit of a pain. Very quiet too",
        "Great deal for a higher grade exhaust fan and I like the way they install without the metal housing . I’m a electrician and have been around plenty of those things",
        "Great for the price. Installation is a little more difficult than they lead on, would not recommend if you dont have attic access. Is louder than most but not as loud as some make it sound(what do you expect for 50 bucks cmon). It does move a large volume of air if you install sufficient pipe and outlet (obviously).",
        "I bought 2 of these for complete remodel of 2 bathrooms. Very Nice Quality and work well. Not too loud. keeps the humidity down in the baths while showering. Helps with the funky smells of bathroom users.",
        "The fan is much quieter than the twenty-year-old builder brand fans that came with our house. We ordered three and I've installed one so far. This one runs silently for about ten seconds before making a slight rubbing sound. The sound is very faint but it's obvious that it's not a normal operating sound. I'm hoping the other two units don't have this problem. The installation is, as it says, very easy. For $30, I was hoping it was American-made but the box tells me that it's from China. Regardless, it's an improvement for me.",
        "Works perfectly!!!! Replaced a lower CFM fan with this and I wish we had done so years ago. Not even loud at all.",
        "It's a great price compared to other similar fans. It is a little noisy, but while taking a shower the noise isn't a problem. I did have to take the fan out of the housing. The bracket was bent or flattened during shipping...easy fix. It installed easily and looks great.",
        "Nice design and relatively easy install. It is larger than the low end Air King fan that was originally installed by the builder... so it required some trimming of the ceiling.... Having the right tool it was no big deal. It produces some noise but not as much as the fan it replaced, that sounded like a jet engine in warm up testing.....",
        "As headline says, motor quit in 7 months. Bearing is free wheeling with no apparent strain. Replaced the capacitor, no luck. Have to replace the entire unit for the motor alone. Hopefully we'll have better luck.",
        "I had this installed over the weekend and it is working great. It is so quiet. My other fan was terribly noisy and I can barely hear this one run. The box did say easy snap in installation, however, the person that installed mine had to go into the attic to do my installation.",
        "I've bough this fan around 6 month ago for kids' bath and so far we've been quite happy with it. First le me list downsides: external cover grill plastic has rough edges (easy to fix with knife), it is no-housing fan, and it has to be installed with provided metal clip, which may be confusing. Now BIG advantages: VERY LOW NOISE, motor bearings sleeves are definitely made to last: big bronze pieces with low-rpm motor. Overall, if you are technically inclined: this is great buy as you can easily work around downsides and enjoy great product at very reasonable price.",
        "The price is right, the instalation is simple, and the product is well made. This is a product I am very happy that I purchased for my new construction, i ordered 3, I will always consider Air King for when I'm in the market for a new fan. Two years later they work great, they are a bit loud but work well for me because I use them at nights for white noice while putting my kids to sleep. A great value at this price.",
        "The fan is alright; about what I expected for the price point. It's not quiet, but I knew that when I bought it. The install bracket didn't work well for my situation, and the grill is so see-through you can see the drywall and motor beneath it.",
        "I bought two of these, installed the first one and was not impressed with the quality or ease of install. This fan is far louder at “2.0 sones” than another 3.0 sone fan I have. Will be returning the second one, wish I didn’t have the first one installed, but it will be too much of a PITA to uninstall it now.",
        ".It was a challenge to install it where our old fan was but cutting slightly larger opening and a small ceiling repair, it's good. Our unit runs quietly as a .6 sones fan should. Most others this size and price are loud",
        "Works well just be careful with ceiling opening as the fan bezel is not to forgiving of enlarged hole , may not cover cutting mistakes.",
        "Considering the 50 CFM fan that the contractor installed in your home; it's loud. But I have this on a timer and it does the job well. Lets face it; you turn the fan on when you want something out. This delivers so well you'll feel like you got ripped off when you bought your house. I can take a hot steamy shower and this keeps the mirrors in my bathroom fog free. And those odors that we won't mention are out in just a few minutes (hence the timer). I have two more bathrooms with no windows so this is a must have.",
        "Finally got to installing and it works very well but is a bit louder than I thought it would be. Regardless suction is solid.",
        "It is surprisingly quieter and moves much more air than a standard 4 sone 50 cfm bath fan, for about twice the price. It is also much more efficient electrically. A standard 50 cfm bath fan draws 38W. The BFQ90 draws 43W and with no load and 40W with a full load. It includes a small capacitor that improves the power factor (.86). This makes the fan more efficient if you need to run it from a battery and inverter such as in a solar powered home or a power outage. UPDATE: 2 years later the fan is still running quiet and smooth. I have been running it 6 hours/day.",
        "This fan is super quiet and I bought two of them for our bathrooms. I have a smaller half bath that it works perfectly in but my master bath is just too big. I would say to look at the specs and as long as your bath is closer to the lower end of the specs you will be fine. Closer you get to the top the less likely it will move enough air to keep it cleared out.",
        "Works good it moves air Had nothing to compare it to but I think it was a good buy for me",
        "The fan motor and everything seem to work well however it appeared to have the wrong mounting bracket holding the motor to the housing. The fan did not even line up with the hole in the housing and the fan was wedged and would not move while turned on. I pulled the motor, had to shim to fit properly and remount with new screw holes and it seems to work fine",
        "Very Quiet Install took about 1.5 hours because Adapter did not fit the unit or the duct ,if the adapter had fit as advertised It would have been in .5Hours This Unit is Great",
        "cover is a bit large but not obnoxious. works well, noise level is slightly higher than prefered but isn't annoying. Good fan",
        "This was an awesome buy. It installed easily in the 6\" depth wall of our bathroom reconstruction. Super quiet! You can't find prices like this for this quality at the big box local home improvement stores. I will keep this product in mind for future renovations.",
        "It does anything BUT \"easily installs using the included snap-in mounting system\" as the fan will not be securely held in place by this system once it is wrestled into place. You'll get the hardware installed ok, but trying to snap it in is very difficult and will cause the metal frame to bend. This will cause the instability. If you have plenty of working room, you could snap it in from above, but then you might as well buy a cheaper non-snap in fan. Other than that, it is a fan like any other fan having this noise rating.",
        "Very quiet but I wish the dimensions were more obvious. I had to get into my ceiling to remove the old fan box and cut a larger hole. It’s says “snap in” but this only means it snaps into its own bracket once installed. This is odd unless the hole is even larger than the fan box.",
        "I purchased three of these to install in a remodel. One arrived with a broken screw that holds the fan unit in place. The fan rattles and vibrates and is unusable. Since I did not get to the installation on schedule,it is no longer returnable. Too bad for me. the other units are working for now. I would say the quality is low, next time I will spend a little more.",
        "Fan operate very quietly, which was a big improvement over our previous fan. The only thing I was not impressed by was the mounting bracket which attaches this to the ceiling joist, it didn't seem to be as strong of a support as I would have liked. I was installing with access to the attic above the bathroom and the bracket disengaged very easily from the top of the fan assembly after installation was complete.",
        "Was easy to install, just four screws to attach the big metal clip then snap the fan on. I installed it from my attic but noticed that if you are installing from the room could be tough unless you cut the hole bigger. This was much quieter than my old fan, but then my old fan came with the house and was super loud and barely pulled any air out. This fan seems to work great so far. Time will tell if it lasts...",
        "Relatively quiet and very easy to install. I use the fan to run almost constantly in our laundry room where my wife's cat-litter box is located. It does draw a lot of air and keeps the smell completely contained. I've had it installed just about 2 months. My ONLY COMPLAINT is that the fan makes a new sound when shutting the unit off. I hope it's not on the road to failing?!?",
        "The fan is quieter than the original contractor-installed fan, and I like the balanced motor (as opposed to the original C-frame motor. Air flow is good. There are two things I did not like: (1) The vent is large and very close to the bottom of the fan. Consequently, if you are trying to install it as a replacement above the ceiling drywall, it will not \"swivel and snap\" into the bracket. It took me hours and significant labor to coax it into place. (2) The cover is extremely cheap and poorly constructed. It is not rigid and does not sit tight."
    ]
}