{
    "entity": "Ventilation Fans",
    "text": [
        "This unit is very neat, sleek and compact. Very good fit for my bathroom. It was installed in May, and we had a very hot summer, so the heat function wasn't used much until mid October. That function has already burned out, and with winter almost here, I'm going to need it soon. I'm concerned as to how to proceed from here. I'll be without a light and fan too, if I remove the unit to send back for a replacement. Help!",
        "This was just what I was looking for. This Broan 655 Heater / Bath Fan with Light has all three in one. I am very pleased with this purchase. Heater provides heat, fan gets rid of steam from shower all with built in light. Excellent item and highly recommended as mine is working fine. I had to have electrician install it, so beware you may need one too.",
        "This item is incredibly loud, both the fan and the heater. Unusually, unbearably, teeth-chatteringly loud. And, to add to the fun, it actually vibrates such that the vibrations can be felt through the floor above. Functionally speaking, it's fine, but unless you want a simulation of a jet engine in your bathroom or wherever, I wouldn't recommend your buying it. (In case you were wondering, yes, the fan was indeed installed correctly.)",
        "The unit works fine and is not very loud. I wanted to retrofit an existing exhaust-only fan. Installation was extremely difficult as this is apparently designed only for new / remodel installations by experienced contractors. The directions are very sparse too, reflecting that.",
        "It sucks, blows hot and shines; just what I wanted. Could be quieter, but then maybe some fools would walk out and leave it running. Good performance versus cost. I had more work than average because I was upgrading from a smaller ceiling fan/light, thus I had to enlarge the hole and run better AC power, but that no reflection on this product.",
        "The wiring diagram is the problem. The colors did not match those in my house wiring. Despite persistent effort--and about 4-5 hours of work--to try combinations of wiring hookups I never succeeded in getting it to work. It has been sitting on the shelf now for weeks. I called several electricians and none would come out for this sort of job as it doesn't pay them enough. Unless you are an electrician save your money. I have installed numerous ceiling fans and light fixtures in the past with no difficulty. This was well beyond my skill set.",
        "I have now purchased (3) of the Broan bathroom fan/light/heater units. At our local construction/lumber stores I paid $119.00 for these units. But my last purchase with Amazon.com, for the exact same unit, was $59.98. Quite a savings compared to the stores. Plus the convenience of having it delivered within two days of purchase with Amazon Prime is an added bonus. The unit itself is fantastic for remodeling an older outdated unit. I'm replacing an old exhaust fan and a huge 3 bulb/heat lamp type unit. The switches were already wired into the wall so all I had to do was rewire the existing wiring to the new unit, plus some sheetrock work, but that's to be expected.",
        "We bought three of these for our large master bath to replace Broan-NuTone heaters installed in 2008. The heaters didn't even work for a week. My electrician came by today and said an internal fuse popped on all three. I'm very disappointed in the lack of quality and will return the units to purchase a higher quality unit. The exhaust fans were exceptionally loud compared with the models we replaced.",
        "Installed this in a 12x7 bathroom in my basement, the unit provided plenty of heat. We use this in addition to 1 4” recessed light and it is a good amount of light, provides enough heat for the space as well. The instructions are not written great for the average DIYer with little experience, so i had my father-in-law who is an electrician install it. The fan and heater are a little loud but for the cost that is expected.",
        "I had this exact unit in my small restroom and the heater quit working and burned out. I bought this same unit a second time and within 2 1/2 years with minimal use, the heater burned out again. I noticed a burnt, electrical smell and noticed the heater was no longer operational. Save yourself the time and headache of this device. It’s cheap, and obviously Broen does not care about the quality of product they put out.",
        "I only realized the unit had some negative reviews for the sound level after taking delivery, struggling with the install onmy own, and hiring a contractor electrician to upgrade my board and wiring to 20 amp regulations ~550 😔. Everything works As it should and the install is solid and tight but the sound/noise level is too much and prevents all conversation from or to the bathroom from even the adjoining rooms 😟😟 will be searching for another Panasonic like we have elsewhere. The two are night and day...",
        "Nice looking, my husband had no issue with installation and functions well. It’s not particularly loud or quiet based on our previous experience with bath fans. It was a bit dim with a standard bulb so got a daylight version and that helped brighten it up.",
        "I used the components of this unit to replace the components on a 20 year old Nautilus unit. The modular style components with plug-style wiring made the replacement process a breeze. I didn’t even need to get in the attic for the project, although a new install would have been much more tedious with drywall cutting and exhaust piping. It’s great that they are still making a version of this unit so homeowners don’t need to start from scratch.",
        "I had good expectations buying the exact replacement vent for my home. While the duct and vent can were in excellent condition, there was no need to remove the entire originally vent. This allowed me to swap the heater,vent fan/light components exceptionally fast. All screw holes/hangers aligned perfectly! One of the few times anything goes as planned. 45 minutes later I was returning my tools and ladder with a job completely finished! Research your model number first before ordering a replacement for the easiest repair you'll ever do!",
        "This heater/vent/light works great! I've read where some have said it was loud, but this one is not any different than the one we changed out. The noise level is not loud, in my opinion! It does the job it was made to do! I just hope it lasts as long as the one we replaced that was over 20yrs old! It was an exact model & fit! Easy installation for my husband!",
        "Our 25 year old exhaust fan's heater had died. Easier to purchase this as a complete unit rather than just getting a replacement heater unit. Thankfully Broan has kept the sizes and mounting tabs the same all these years. New heater is a direct drop/plug in. Now I have a spare exhaust fan if I ever need it as well.",
        "Exhaust fan is average noise level heater is loud still debating if I will replace it’s pretty damn loud don’t know if I can make it any quieter by tightening anything up but the light works in the exhaust fan works as expected",
        "See attached wiring that supplies power to the heater plug. IMHO it should be heavier gauge and/or solid copper. Some might say this constitutes a fire hazard. Luckily I caught it in time and the clue was the terrible odor from the burning wire and plug.",
        "I am very disappointed,,because ONLY one side puts out heat. The other side does great. I wanted to call Broan-NuTone direct but do not have their number. I hope it can be adjusted as I dislike returning. This must be corrected because I live in South Texas and it is warm here now. I am very cold in the shower since there is NO HEAT and I cannot imagine using it in winter.",
        "I just paid an electrician to install this exhaust fan heater and the motor is broken! Now I have to pay to have him remove the motor, diagnose the problem, have him come back out to re-install and they charge $120 per hour. I will be talking to Broan customer service tomorrow and see what they can do to compensate me.",
        "NOISE ~ Too bad this unit would be offered in a lower sones rating as an option INSTALL ~ If you can work a screwdriver, you can install the components in this kit Value ~ Broan charges way too much for what you get. Since the years old fan was making noise and I wanted to replace the beige grill with white, I had limited options. .",
        "The Broan 655 Heat/Fan/Light is the most wonderful thing I have ever bought in my entire life. I ordered it with the suggested 3 way switch and had it professionally installed. Now heat...glorious wonderful heat...pours down out of the ceiling in my bathroom. I go in there sometimes now and never want to leave. Thank you, Broan! Oh and the light and fan work great.",
        "If replacing same unit you have to go thru attic or floor above the ceiling in which this unit is installed. That said, Electrican who installed this literally gutted the old unit and used the parts from the new unit to replace. My only other option was to remove the floor from above and that would have added incredible cost and effort.",
        "Had a similar model. Noted the power connector to the heater unit was melted, so replaced it and rewired it (received it with the house 7 years ago). Haven't used the heater, but the vent really moves the air. It is a little on the loud side, but the old one wasn't quiet either, and this one works a lot better. Overall, satisfied.",
        "Vent fan is louder than expected. The heater is out of balance or something. Everything is tight but the fan vibrates too much to use.",
        "Finally installed it, the heater turned on the houseing got red hot and the plastic outside covering started to melt, thankfully I was watching it or this could of been real bad! If I hadn’t been paying attention my whole house would of caught fire, how in 15 seconds does the plastic start covering start to melt and smoke fill the home!",
        "It heats up my bathroom well and isn’t too noisy. It was expensive to install because a separate electrical line had to be added or it would have blown the fuse (but that is because of how my house is wired). The extra light is great in the shower, but the vent fan also sucks heat out. A separate wall heater might have been a better choice for added heat, if you have room in your bathroom (I didn’t).",
        "Heater unit melts the grill after a few years of use. But I leave the heater on longer than a casual user would. I just gut the machine and replace it's heater and fan and light with new grill about every 4-5 years.",
        "A much newer version than what was installed when the house was built (1988) but the parts from this unit fit perfectly into the old one. Needing a fan and a light lense it was cheaper to buy this and cannibalize it than buying the parts individually. And I didn't have to get up in the attic to replace the entire unit.",
        "This unit works great. Our new house only had a 60cfm exhaust fan and had no heat. This unit does the trick. We had the same unit in our old house for 30 years, and never gave any trouble. It's also easy to retrofit if you have access above the ceiling and can get a 20 amp circuit to the heater part. I installed a wall thermostat to control the heat.",
        "I bought this item as a replacement for another unit of comparable size and functionality. So far, this unit has functioned as expected and I have no complaints on performance. I'm marking this as a 4 star because of the wiring and installation setup. It's not as easy of an install as you think it would be due to the way the side brackets mount on it. The connection points to the wires were also a little shorter than expected and required additional wiring to be purchased for easier wiring. The wiring point is not housed within a protective box, so if that bothers you I would suggest another product.",
        "Inexpensive - the volume of air it moves is amazing -- makes me realize how bad my last one was and it says it is not quiet -- it is noisy! In this case I am okay with that and if you have other lighting you should consider not putting in a light bulb, as it is on with the fan,",
        "Good unit. Easy to install in new construction, difficult to install in an existing structure. If you have an older model, there isn’t much difference and the main can has not changed at all, so you can just swap parts if you need to.",
        "It has a fan, heater and light. The heater stopped working within a few months of installation and I didn’t see that it was powerful because my bathroom ceiling still got a little bit of mold even though it was turned on during every shower. I don’t recommend this unit.",
        "Although difficult and tight to install, it went in. Both fans are pretty loud. !EXHAUST HAS almost ZERO FLOW!. Not even enough to open the plastic louvered vent cover. Yes, it has a turning fan. -- It must be rotating backwards",
        "Bought to replace a 30 old model and was pleased to find out I could just use the motors and not replace the whole unit. Was cheaper to buy the whole thing rather than individual parts! Very pleased! Would buy again!",
        "got a fan, heater and light for price of fan and light at big box store. heater kicks plenty of heat for bathroom. nice light and fan works well. had someone else install but they said it was a breeze.",
        "I had this fan/heater combo for many years. And the heater goes out in it every 5 years. I’m on my third heater. Thankfully it’s 2 screws and a plug to change out. Pretty easy. Heater by itself is 75 bones without tax. New exhaust is a little more. I always purchase a complete set up and replace both the exhaust and heater . Only the guys, I leave the body in place . The designers made this extremely serviceable.",
        "Great value. $229 for similar model at lowes. Works well thus far.",
        "Bought this to replace the same unit that had both fans and heater coil that stopped working. After receiving the new unit I opened the old one a saw why the old one stopped working. I used butt splice terminals instead of screw on winged wire connectors. I doubt the wires will come loose this time. After connecting all the wires and air duct I turned on the switches and everything worked fine. It's a great little light/fan/heater unit with a very affordable price.",
        "There is a LOT happening here, in a SMALL space. This unit can (and should) be switched for each of its three functions: ceiling light, ventilation fan, and a heater for cold mornings. It does all three functions quite well, as you might expect from the Broan brand.",
        "I bought this unit because my sister has one and really likes it. But when mine was installed, the heater made twice as much noise as my sister’s. I contacted Broan technical support through Amazon, and I could not have been more delighted with the help provided. They shipped me a new heating unit, then walked me through the installation. Everything works great!",
        "Replaced an older model of this unit with this one. Installation was easy. The unit hasn't changed in years. I took the individual parts out of the new unit's housing and installed them directly into the old housing. No need to remove the old housing as the parts were completely interchangeable.",
        "Alot quieter than our other fan/vent that we had and it was Brand new. Also it heats up our bathroom. Not a huge amount of heat but enough to take the chill out of the air. We love it.",
        "But one makes a decent product. I recommend it if you want a value fan with heater. It’s the best I found for the money and quality",
        "Bought to replace an (much) older model because ours burnt up. Easy to install. Didnt realize how loud or how poorly our old one really was until we installed this one.",
        "... but noisier than the fan it replaced. Will admit that the old fan was not as powerful as the new purchase, probably the reasoning why the noise level is higher.",
        "Aside from being a bit noisy, this is a decent heater/fan. The design hasn't changed over many years. The original I bought was a Nautilus, and this Broan is the exact same thing. I actually bought this to replace the heater in my old, currently mounted unit. It's ultra easy to replace the old with a new one taken from this new full assembly. Heck, it's smarter to buy a whole new heater/fan assembly instead of a single part. It's more economical that way.",
        "Installed in bathroom. This model has not changed in at least a couple of decades. Heat components work very well n relatively quiet. Suction fan is very powerful but very loud.",
        "Just have the unit installed and have no complaints. Some of the reviews said there’s a problem with noise but no more than expected. Great value for the money",
        "I ve purchase these for work and for my own home so far they work great an clients are pleased. Heats well and last",
        "Clears out a 8x10 bathroom after taking the Browns to the Super Bowl pretty well, no need to use air freshener",
        "We have had this unit in our house for over 15 years. The fan motor was used every day as the primary exhaust fan in our bath room. The Fan motor finally gave out. Instead of buying a new motor for a few dollars more I ordered the exact same model from Amazon. Replaced all the internals Fan, Heat, Light with the new parts and works fine. Hopefully for another 15 years. I just didn't cherish the idea of crawling into the attic and trying to change out a new box that likely would not fit my existing opening. Simple solution that saves time and money.",
        "Got the fan started to install and the red plug to plug in the fan is missing,had to use the old one.",
        "Three functions: light, heat, vent fan. Two switches. You do the math. However, it's in and its staying.",
        "I bought 6 of these bathroom fans. They are loud when you turn them on and louder when you turn the heater on.",
        "I'm spoiled and can't live without my bathroom heater! This is a nice combo light/fan/heater product. I have a large bathroom and with the door closed it heats the whole room nicely. Others complain about noise level--the heater is a little louder than the fan, but let's face it, you are usually in the shower or just warming up the bathroom. It's not like it's on for hours or you are trying to hold a conversation while it's running. I only gave it 4 stars because my first one lasted 8 years and the second one only lasted 4...it is the main bathroom for the two adults in the household and gets daily use. Overall, I'm satisfied!",
        "This product is hard to find in stores where I live and when I do find it I can’t find it this cheap it is a great replacement for the one I had",
        "I got creative, and made it work, but this is not designed to be installed without access to the ceiling.",
        "Needed the heat for winter. Did not fit hole. Had to have installed by an electrician.",
        "Have one already & this will replace it, great in winter when you need a little warmth in the bathroom, renovating, old one turned yellow after 10+ years.",
        "I loved the price. The heater, blower and exhaust do the job for my 2nd bath with no windows",
        "I ordered this to replace the unit in my master bath. I ended up just taking out the individual components and replacing the malfunctioning parts in the ceiling. Much easier than trying to reinstall the entire unit.",
        "heating the bathroom - 5 stars. but the heater fan is VERY loud, you won't forget and leave it on. I guess thats a plus.",
        "Good price on these units which perfectly replaced my 25 yr old Broans",
        "Everything works great. 12.9Amps allowing me to add it to existing circuit without any worry.",
        "Replacing the heater and the fan and not the entire assembly box took less than 30 minutes. We replaced two 20 year old Broan 655 heaters and fans that both had heaters that recently quit. We purchased 2 complete units to also update the 20 year old grills with the more modern look. This is a good example to purchase a well established brand like Broan that was still making the same model 20 years later.",
        "I installed this in the attic just over the bathroom and it does not work properly, after three days of terribly hard work.",
        "While its not top of the line, this economical kit does exactly what I wanted it for. Works fine, gives a mild heat output. Yes it's a bit noisy, but I don't live in the bathroom. To those that purchase the 655, do your diligence, The higher the Sone, the louder it is, I see people mention that way to often in reviews.",
        "Except for exterior cosmetics, the unit was identical to one I bought around 20 years ago. Housing and wiring did not have to be changed. The fan, heater and light receptical are all separate units. Loosened two screws and unplugged and replaced the 3 units. and was finished. Replace exterior grill. Finished. Since I did not have to mess with the housing or wiring the job only took 20 minutes tops.",
        "Exactly what I wanted, got it quick. On-line description and reviews ensured it was the right replacement for what I had before.",
        "This heater/vent fan replaced a 23 year similar Broan fan. Luckily the fan fit the ceiling hole perfectly. The 100 watt light was very bright and all seemed to work as it should. Easy for husband to install. Great purchase.",
        "This is an identical replacement. It is a little quieter than the original that lasted 21 years.",
        "Fit my application but heater motor was defective. Took 2 months to get a replacement due to back order.",
        "Super disappointed. I also went by the high reviews and purchased this unit, paid a contractor to install from the attic and expected at least the same quality as the one being replaced. To describe it as loud is clearly an understatement. I now have to purchase a better quality unit (definitely not from Amazon as the reviews are a little suspect) and hire a contractor to take out the one just installed and replace with one that doesn't sound like a lawnmower.",
        "difficult to install for novice but was fairly easy but it works like a charm. It is noisy but the heat it puts out is very good!",
        "Used these products in my bathrooms. I am disappointed in the heater feature. I am also disappointed in the noise level on the exhaust fan feature.",
        "Cage on this item not cery good it rattled like an airplane taking iff Had to repkace cage to reduce tbis nouse Glad tve person who looked at heater knew what to do Purchased end of august and said warranty ended the end of sept Now this oroduct has totally stopped working'!! I want my money. Back!!!!!",
        "It was a perfect plug and play for my 30 year old broan fan. Not sure why all the complaints I read prior to purchasing. Fan, heater and light literally swapped with a few screws. Only difference was the new parts were phillips head and the 30 year old existing were flathead. Easy peasy. Highly recomend",
        "Was able to get around to putting the heater vent lite in the wife's bathroom. Works great and she is happy so we are ALL happy!",
        "My builder installed this model and the heater went out within two years. The fan is EXTREMELY loud. The light, is fine, just a light. I like having a heater/fan/light combo, but would prefer a higher grade model if given the choice next time. I had to buy the model again so I could salvage the heater (cheaper than buying the heater component by itself).",
        "Haven’t tried it yet , put it in a job I’m working on but easy to install for new construction",
        "Needed a New bathroom fan. I’m very happy with this product! Great price, easy install, not noisy and heat element works great",
        "I use this product to repair existing installed devices from the same manufacturer. All parts work fine and fit into the existing installed devices without any problems.",
        "The Broan 655 is a replacement for a previous one which finally bought the dust after many years of making my bathroom warm and moisture free. The new one is the same except for the cover which is a new design and seems to take longer to warm the room and does not disperse the heat as quickly as the old design did. The unit was delivered sooner than expected and works well.",
        "Works great and easy to install. Just swap out the contents of the box and install in the housing of old box. Get help from a second person if you are climbing high on a ladder. Taking pictures of the old and new device before you start the installation helps too.",
        "Came in fast packing was good. Not too bad too installing except that I had to go into my attic to replace it. Wire it in wasn’t bad either. Overall took a couple of hours to do.",
        "Bought to replace the exact one that was already in. Works perfectly.",
        "We got these for parts for our older fans--the parts fit perfectly. We replaced the fan in one of our bathrooms and it is identical to the ones we have in our house. Now we have parts when something else goes out.",
        "It's a bit on the loud side. Replaced the same model I had previously but this one doesn't seem to exhaust as well.",
        "I bought 2 of these for bathroom upgrades. It is well made and although I wasn't sure that the heater would be up to the task it surprises me how very well it does the job.",
        "Put it in the home bath --Fan is loud But I can read someplace else",
        "I installed the original box for this lite/heater/fan 30 years ago. I am glad they are still made because when the heater goes out I just replace it. This item is not installed in a very friendly environment. However, I consider it a good value and have for a very long time.",
        "This model was selected by our contractor when we had our basement finished a couple yrs ago so when we had a rental property that needed one - we didn't hesitate to order it. Per my hubby - easy installation :)",
        "Replaced existing heater/fan which was the same model as this one. The first one was satisfactory, so I bought this Broan 655 again to save having to retrofit another model in the ceiling. The noise is enough to make on wear ear plugs. Dreadful sounding, especially when the heater is turned. Wasted money on this purchase. Will not use this brand again. Would not recommend this particular model.",
        "I bought this and installed it for a customer of my Handyman business. It was the only one that I could find at a reasonable price that was powered by 240v. The old heater was also run off of 240v with thermostat control and we did not want to run a new circuit with 110v. The heater worked great and the customer was highly satisfied with the results.",
        "I just needed the inside parts and not the case and it fit perfect. No Issues",
        "Used it to replace all the parts in a 17 year old unit. Works great!!",
        "It is perfect exactly what we wanted our old one gave out had that one in our bathroom for over 30 years so glad to have the same kind",
        "Well satisfied. Hasn't been installed yet because the new house is not ready to move in yet"
    ]
}