{
    "entity": "Ventilation Fans",
    "text": [
        "This product works well and I have no complaints. I just wanted to upload this picture because it's something I felt was lacking prior to my purchase.",
        "Perfect for our bathroom. We're in the prices of renovating our bathroom and in the process wanted an exhaust fan. The ceiling above made it almost impossible to install a ceiling fan complete with duct exhaust due to the HVAC bring literally above the bathroom. The solution was a wall fan better through the wall. This fan is almost silent and moves air well. You can tell it's high quality and the exterior vent is equally sturdy. Recommend.",
        "Hard to believe something so quiet works so well. Installation was very easy and it came with adaptors for various wall thicknesses. I especially like the exterior flap that does not allow cold air to flow from outside back through the fan.",
        "I'm an electrical contractor, installed this for the first time, customer loved it. I split the fan unit using 8\" Insulated flex duct to the vent register on another outside wall. All the HVAC contractors who saw me bring this in to size the flexduct were in awe of how well the outside register was constructed. The fan very quiet, outside register is metal painted white. [a baked finish] Has a mesh \"bird guard\". A heavy gauge metal that would not get dented easily. Nice to install.",
        "Ordered blemished unit. Slightly lower price. ABSOLUTELY NO MARKS OR DAMAGE. All screws and covers in package Painted the intake cover to match the wall. Blends in well. Decided on this ultra quite model to transfer air from one room with wood stove to another room. 70 CFM is enough to move warm air and not back draft the wood stove. (Very important) The output side has a back draft damper. It works well and has a hardy down draft surround. 3rd Panasonic wiper quite unit I've bought. They are not cheap but they are worth every penny in silence.",
        "It is very quiet. Instructions are ok, key pieces missing for a product install in a finished wall. It if you are even semi handy it is no problem. I installed in a home theater in a corner basement room that suffered from stagnant air if the hvac wasn't running. The fan made a huge difference even with a projector running 12 plus hours. Pricey - yes. Worth it - yes.",
        "Perfect for above the stove ventilation!! This is the quietest exhaust fan I have EVER seen!! You hardly know it's running, but moves a lot of air! Exterior hood looks nice and is very sturdy. I'm sure it will be very long lasting! I looked at Panasonic because I was so please with the three bathroom light/fan/heater combos I have already had installed for months. Great quiet fan!!",
        "This fan is very quiet and would work for bathroom fine. But does not pull much air and does not eliminate odors very quickly. I am using it presently but ordered a broan like I have had in the past to replace it. The broan was noisy and not as pretty but did a monster job compared to this.",
        "Bought this to replace the identical fan we bought about 10 yrs ago. It finally stopped working. This thing is WAY quieter than any other fan we could find, and has decent power. We use it in a large bathroom, to vent out through the side wall. I don't really know how easy it is to install, as we had a handy-man guy with a tall ladder do it (we are high on a 2nd floor). Highly recommend.",
        "2nd purchase of this fan...I have moisture in the crawl space under my house...bought this same fan last year and it helped but home is large and area away from the fan was still damp so bought another this year ...they really make a difference...very quiet and low current ( uses less than a light bulb)",
        "I did not think I needed a fan when I renovated my small 5' x 7' bathroom, but the Building Code said otherwise (IRC 2015 and later code editions govern residential building in most all US states). The Panasonic FV-08WQ1 is the only through the wall, quiet fan I could find on the internet. It is exceptionally quiet and very effective. If I run it for 5 minutes while I shower, the mirror over my sink is totally free of fog and condensation. I installed this fan with the Lutron MA-T51MN, and they work well together. Recommended.",
        "Have never had an exhaust fan in our small first floor bathroom, but after spending lots of time skim coating and painting walls, and buying all new chrome fixtures and lights, we didn't want the moisture to wreak havoc. We had this fan installed a couple weeks ago and it works so great! No more steamy mirror or dripping walls! And it's so quiet! Highly recommend if a wall fan is what you need!",
        "I'd have to say, it's a professional installation but the deal is so quiet we all went, wow is it even running. Used as a through wall vent for an addition laundry room. Not a lot of CFM but good for small room ventilation, comes with flapper installed and everything you need. Nice piece of equipment.",
        "I didn’t want to install new modern ceiling fans and pay a ton for someone to do it. This worked just fine. It’s unbelievably quiet and is super easy to install. If you have some time, on the exterior vent - put a small rectangle of metal mesh so bees and wasps can’t make nests in the hood - literally costs be $4 to do. This is super quiet but isnt the strongest powered fan, but with using a timer - an extra few minutes works just fine.",
        "Super quiet and able to clear steam from bathroom...even after a teenager takes showers that last forever. Was missing a couple screws, but they were easy to replace. Instructions were fairly simple to follow. We replaced an existing fan that sounded like a small lawnmower and didn't move nearly enough air. This fan required a larger diameter hole in the side of house. So far no significant draft noticed in bathroom, but temperature has only been as low as 30F.",
        "This thing is super quiet. Not just \"not annoying,\" but I can't tell it's on when the shower is running, even though it is just a couple feet from my ears. The plastic is really well molded and has a very clear appearance. I was apprehensive about paying this much, but hate loud fans, but don't want to go cutting through the wall twice. It is exactly what I was hoping for-- quiet, attractive, high quality. It us simple, which is good and bad. It's really just a fan. No auto humidity control or anything, but it doesn't claim to be and it does a great job at what it does do.",
        "The fan is wonderfully quiet and does move air but I deducted a star because it could move \"more\" air to be as effective as I would like in an exhaust fan. For those who put importance on aesthetics, the cover (sadly) is not white like in photo. It has a yellowish tint to the \"white\", which is never pleasing but function wise, it's adequate. The biggest asset of this fan is the quiet operation. It was also easy to install. The toughest part was cutting through the exterior of your home as that is unnerving but the actual set-up of the fan was simple and straight forward.",
        "Eight years now of continuous use without a hitch. I have two of them running that long. They have never been turned off even once. I figure it's time to retire them and buy two more now which I just did. What more could you ask for.",
        "Yes, this fan is quiet. Yes, this fan is well built. But, on windy days the backdraft damper flaps open & closed which is loud & annoying. I am planning on returning it.",
        "These fans are very quiet and still move a nice amount of air. The contractor who installed it said this was a very good unit that he prefers to install for his clients. I will buy it again when the need arises.",
        "Extremely quiet, quality wall mount exhaust fan. I highly recommend it for exhausting cigarette smoke on demand. Panasonic fans are worth the money. I have a ceiling mount one in my bathroom which runs 24 hours a day for six months of the year to control humidity. It is ten years old and functions perfectly.",
        "I looked long and hard and this was the lowest sound level I could find. I saw several different sound levels for this. It turns out that this fan has a switch to choose low speed or lowest speed, and lowest speed is by far the lowest sound. It is far from silent, it is easy to hear in the same room, I can hear it in the adjacent room, but it is quiet.",
        "Put this up at our cabin in a bathroom that really needed an exhaust fan during the winter months when it is too cold to have a window open. It was I stalled while we were doing a total gut job redo of the bathroom so we had access to studs. Installation and wiring was easy, as was drawling and painting around it. We painted the exterior flap of the unit a bronze color to match more od the wood on the cabin. The input is quiet and definitely does work for our needs.",
        "Overall, we like the product. We didn't have a fan in our bathroom and now we do. Well made. Very quiet. Fan has a soft fluid sound to it. However, if you leave in a windy area, the flap will open and close. You will hear a soft \"THUD\" when it opens and closes. We tried a few adjustments, but the problem is consistent on windy days. We live on a Great Lake, so wind is a factor.",
        "We purchased this fan for a basement that had mold and moisture issues in the past. Not anymore! The air feels so much fresher in the space now and the fan is quiet. You do hear it but does not to any degree that is a disturbance. Very happy with it.",
        "This is a really great unit if you need to vent a room that has an exterior facing wall. Check the hood dimensions as it was a little larger than I had anticipated. Installation was smooth. This package contains: 1 Fan+Motor Unit Wall plate (for remodeling) Wall sleeve (with wall plate for new installation) An exterior hood Extension sleeve for walls up to 6\" Be sure to replace the wall sleeve mounting plate with the remodeling wall plate if remodeling. It is also whisper quiet, as advertised. My shower rooms are less than 40 sqft, and since installing these fans I don't experience damp walls. Great product!",
        "Finally a QUIET bathroom vent fan! I won't say that you won't hear it when it is running but it is amazingly quiet compared to the other vent fans I've used over the years. The grill is a light tan color, not white. The outside vent cover is bright white but a little spray paint quickly took care of that to better match the siding on the house. I control it with the DewStop FS-325-W1 Adjustable Bathroom Fan switch which works great with this unit.",
        "This unit is fantastic. The biggest problem,no joke,is that I can't hear it and forget it is on ! IT wasn't as easy to install as I hoped and it took two of us. Have someone experienced help you.",
        "Based on its positive tiny house reviews, I got this for a second bathroom in a semi-sunken brick cellar not only to remove moisture, but to mitigate any radon risks. My contractor did have to rig an extension to the already-generous provided part that goes through the wall because our wall is so thick. Other than that, he found installation easy. The fan performs perfectly, as others say, and I hope continues to for many years. I will order another for a third bath, and may replace the other model in my first bath with this type.",
        "they were relatively easy to install, the are quieter than my old ones but the baffling/damper greatly reduces the air flow....lets see how they last and help to reduce the hose overall moisture level. I put 2 of them in my 1000sqr foot home with a couple of automatic timers to run in a 3 hour on 3 hour off cycle every day. the housing needs to be sealed with some tape to make sure that you are sucking as much air from the faceplate and not from the sides and inside wall.",
        "Very quiet and one of the few wall mounted options out there. I like that the cover is removable for easy cleaning, however, the screw/bolt to hold the fan assembly flush against the wall was missing and finding a replacement has been impossible at the hardware store.",
        "Quiet, perfect, awesome. This fan is what we wanted and looked for. Although spendy, we were unable to find a single through-the-wall fan in our location. The only other thing we would love would be a timer. Expel the smell and turn off after 10 minutes or so. When we shower or bathe, the bathroom tends to accumulate humidity and this fan really works well to mitigate the steamed up mirror and general wetness. It is well worth the money!",
        "Quiet, easy to install, all parts included Color of the grill is almond? Darker than picture in real life. Design of grill is older looking, but you know that when you buy it right?! Construction is solid, heavy gauge metal used Runs very quiet. missing a star? because the anti draft check flap. It's cheap thin metal with a very cheap foam edge. (the only thin metal piece in the whole unit!) Outside noise is funneled through and heat is lost more in the winter, i'm sure the foam will peel off in a few years.",
        "I have Panasonic Whisper fans in all my bathrooms and I love them. For this remodel, I had a small powder room that I needed to find a wall-mounted fan for. So glad Panasonic had one - just this one. It may have been overkill for tiny powder room, but I want the quiet and the quality. The reason I only gave four stars is that it doesn't mount flush against the wall. It does come out a little. But it is mounted high on the wall so it is not noticeable.",
        "Quiet but not strong enough to ventilate a campground bathroom. That’s our own fault for purchasing a low cfm fan.",
        "Great product. Super quiet and effective. I'm an average \"do it yourselfer\" and got it in OK. Tip: when you get both inside and outside holes cut, measure the distance between outer wall and inner wall. Dry run the install by pushing the inside and outside units together on the floor and push the electric pack in the designated slot. If you have to trim the vent slot, now is the time to do it. Recommend this product highly if going through the attic space is not an option.",
        "The fan comes with several fixtures allowing you to install it different ways, depending on the wall where you want to mount it. I had to modify my mounting site, but that was because mine was an unusual situation. I think the fittings would work for most normal walls (I was mounting it through a boarded up window,not a wall). A little thought is required as the instructions are not always clear, but they are adequate. It does run very quietly, which was the main thing I was looking for.",
        "This unit is SO quiet you would think it's not effective, but it's actually more powerful than any other I've seen. Face/grill are deceptively small but the duct to the outside is huge (8 in Diameter) so it's pulling a ton of steam/air out of the room. Great addition to a formerly fan-less bathroom.",
        "my product was a next to new.......was reconditioned perfectly works very well and saved some money good for the enviroment and good for the consumer. Actually have bought three of the units for my home.",
        "Was the perfect solution to replacing one of those old metal wall fans. NO BACK DRAFT (I am amazed and it's in the 10s to negative F now). Try quite! Have had for a year now- works great. Pair it with DewStop FS-100 Condensation control and you have an awesome moisture solution. I also have a celling one for another backroom (GREAT products!)",
        "Besides the low noise level, the damper seems to work well. I have this mounted on the west side of my house, and the winter winds have not dislodged the damper.",
        "This fan is made of quality materials, is so quiet you cannot hear it, and really does the job--it sucks the smells and heat right out of the kitchen, We did not have a fan vented through the roof because we have vaulted ceilings and the range fan is a recirculating filter in the microwave hood. I disliked the heat and smells throughout the house and this is in the wall above the corner of the kitchen and does a perfect job! I wanted a quiet fan...not like living at the airport, and this is perfect. 70 cpm is really enough!",
        "Product not as pictures. The junction box will actually be on the top left and this cannot be rotated. I have a stud there and was expecting the unit to match the picture with the junction box in the bottom left. Sucks.",
        "This is a terrific product. When the tenant from India in our downstairs apartment asked for a kitchen exhaust fan so he could make his native Asian dishes, this is the fan we bought. It was a horse to install since it had to go through a brick-on-block wall, but we did it. Effective, powerful, quiet. Not an odor in the house, and Paul couldn't have been more delighted. Nor us.",
        "Installed this at a rental house which is an older house. Requires a very big hole thru the wall which seems like overkill and if you are not prepared to do so find a different unit. It does however work very well and is very quiet. It is rather expensive also but if you can't use a ceiling unit this is a very nice looking fan and was rated very good which is why I got this one.",
        "Panasonic makes the best extractors in the world. I installed this wall fan in my laundry room. This wall fan is quiet, efficient and looks good.....just like me :-). The outside cover is well made. This fan will not disappoint.",
        "Installation is definitely not for beginners, but once you figure out what is needed it is solidly built and quiet. This won't clear out a large room, but for my small bathroom it fits the bill.",
        "This is an extremely quiet, efficient exhaust fan for bathrooms or other places where humidity is a problem. We have two, and leave them on for most of the day. It draws something like 35W, so it's very efficient, especially compared to A/C or a heating system. I may try the humidity sensor switch for it, but manual operation has worked fine so far.",
        "This is almost completely inaudible when it runs. I especially like the outer hatch that opens when the fan runs and slowly closes when the fan is turned off. Buy this if you need a wall mounted exhaust fan. It's worth every penny.",
        "Hands down the best bathroom fan I have ever installed. Easy to wire, easy to service if need be. And as the name says WHISPER quiet.",
        "Due to installation restrictions we chose this wall mounted unit for our client. Quiet little fan that works well in those small bathrooms. Well built with a stout metal housing.",
        "This fan is very quiet. Vents to the outside wall instead of into the attic.",
        "You absolutely can NOT hear this fan running - works great. Exactly as advertised and has an added benefit of a downdraft hood for the outside so no rain can get in. NO WIRING INCLUDED, so be sure to get that first. We attached it to a rheostat to adjust the airflow as needed. I LOVE it! Well worth the price!",
        "Great so far, have been running 24x7 for about 10 days. It sounds about as loud as a 20\" box fan from across the room, louder than I was expecting from the other reviews but, just white noise not too annoying. I use it to move hot air from the 10' ceiling near my fireplace to another room with no heat and it is getting the job done.",
        "After a year, it is starting to get a little louder than originally. Still quiet compared to 99% of the fans out there.",
        "I just finished installing it. It works well and it’s nice and quiet. I knocked down one star because there were no screws included in package.I looked all over for the included screws,,, I had to make a trip to the hardware store buy the correct screws for installation.This is the best fan out there as far as I'm concerned.",
        "This product had easy to follow instructions, and works great. I wired it directly to the ceiling light, so that it comes on when the light is turned on. It is very quiet and works great. I would definitely purchase again.",
        "Almost completely silent. We've never had a fan this quiet and it clears out odors very fast.",
        "We didn't have a built in at our summer cabin...This turned out to be perfect for the space and soon shockingly quiet you'll be amazed!",
        "Great product. Lots of power, super quiet and easy in every way. One of my missions is to make better airflow in my 1898 apt building. This does the trick--have four. I want one in my own unit to replace the \"I cannot hear you now!\" older model of X brand. Nut tenants first--don't hesitate, this is a winner",
        "Functioned as expected. Extremely quiet. Installed in a lawyers office that moved their servers into a closet. Closet was running about 90F degrees. Installed in top of closet above doors and it keeps the closet about 80 now. The server fans are louder than this unit",
        "It worked well augmented with a wireless switch and receiver. My only complaint is that is does not come with junction box short protection. But that part was easy to find at my local Lowe's store.",
        "It is extremely quiet, and seems to move an appropriate amount of air. One thing to note is that the exhaust duct is 8\" - a heck of a lot bigger than most bathroom fans. Make sure that'll work for your application.",
        "We installed this in our laundry room that had no ventilation. No more litter box odor in the house! It runs super quiet as well.",
        "Quiet and moves a lot of air, fairly easy to install.",
        "I've installed a few of these in different homes. Best bathroom fan I have found.",
        "I bought this based on other reviews I read on Amazon. I was not disappointed! The fan is amazingly quiet and very easy to install. Would definitely recommend this to anyone looking for a wall fan.",
        "Very, very nice. And so quiet. The thing you might want to think about is the older fans might have a 10\" hole, and this is an 8 1/4\" hole so it will require some fill in. During the install I had to rotate mine 180 degrees for the wiring but it wasn't any problem.",
        "It's quieter than other through-wall exhaust fans. Sticks into the room more than I'd like.",
        "Nice fan and runs quite compared to the old one. Installation through the wall required some dry wall modification but I was putting it in a 40 year old house. Amazing how much air it moves for how quite it is. I am going to purchase a ceiling model for another bathroom.",
        "I love this ventilation. It is not noisy and working perfectly in my bathroom. I recommend this item.",
        "Compared to other fans,this is a quiet bathroom fan. It is not obtrusive visually either (but then we have white walls in our bathroom. So glad we got this instead of the cheap one at the local box store.",
        "Primarily purchased because my current fan sounds like a jet engine. This is so much more quiet. Installation was easy because of preexisting fan. Seems well made. My only gripe is the price. This product should be in the $120 range. If you don't mind the premium price, then you will be happy.",
        "Quality fan, super quiet and very easy to install. Best of all, it was Made in Japan. We use this in our laundry room. Installation was very easy with the right tools. I used silicon caulking to seal the extended duct instead of aluminum foil tape recommended in the manual. The aluminum foil tape will peel in a long term. Therefore, noise will be induced.",
        "Fantastic unit. Super quiet, fairly well made and not a huge pain to install. Knocked a star off for the fan motor assembly not sitting perfectly flush against the flange due to an electrical component on the back sticking out the tiniest bit, and because it's the only Panasonic fan I've come across that does not appear to have a ball bearing motor. and, at this price, it should. Still way better than anything else on the market since it appears Broan-Nutone simply stopped caring altogether about the design and quality of their wall fans.",
        "great fan and works well in my small bathroom...... so quiet... like a previous post.. my wall was about 6.5 Inches thick, does require cutting with snips the metal that allows the junction box to fit in.. not a deal breaker, but does take a little work to fix...",
        "The unit operated as advertised. Sound I used this unit to exhaust air from above an oppressively hot bed loft. Sound emitted (which is well dampened from vibration) is 4 ft away from sleeping area. Although one can hear it running, the sound emitted is quite low and unobtrusive with no vibration. I have run it almost constantly for 2 weeks with no change in sound level so far.",
        "Perfect replacement for the old 70's models that were in my home. Easy install, move the air well and have held up fine now for years.",
        "As this has a 70 CFM rating and is a member of the 'Whisper' series, I expected it to be a bit quieter, but still works like a charm and a previous one I ordered has been in service for over 4 years.",
        "This is the third Panasonic I have installed. The first through wall unit. Looks like air might come in in the winter. Will let you know.",
        "Product installed over a month now and was well worth the money. Instructions were straight forward and well written. My installation included drilling through bricks but with the included template turned out perfectly. Hood included is substantially made and should last for years. Others who have used the fan are impressed how quiet it is - to the point they cannot hear it with the shower running! I therefor recommend the fan be installed with a timer to prevent it being left on. Overall, the fan was well worth the expense and would not hesitate to install another in the future.",
        "returned because it was deemed to be too large, 8-inch hole in the wall required.",
        "Works great in my bathroom. I have a large walk in shower with multiple shower heads. This takes care of all the steam so there are no streaks on my walls. This is the quietest fan I have ever used.",
        "Good quality and it is quiet -- but it seems buring off of Amazon and it is made in Canada -- it is not warrantied for 3 years?",
        "Easy to install, works great. I installed with a speed control and timer. Best investment I've ever made for my bathroom. No more fogged up mirrors or other moisture related problems (mold or mildew). Would recommend to anyone who needs an easy ventilation solution.",
        "It is a quiet in wall fan. If ducted through an attic and out a gable, use an 8\" duct.",
        "Quiet attic exhaust vent for a kids vaulted room. Not very powerful, but quietly and slowly does the job of exhausting hot air. You can't go wrong on quality when buying Panasonic.",
        "Does its job quietly and without fuss. Good materials of construction, no shortcuts. Well worth the extra money as compared to the competition.",
        "This wall vent really moves the humidity out! (It has an 8\" opening, so it's understandable that it moves humid air out quickly and quietly.)",
        "I lets in a lot of outside air..looks like there is supposed to be 10 louveres (flappers} inside the grill to stop air coming in from out side ..they are not included..will try to reach company to see if they can be ordered..fan IS very quiet",
        "We have a large bathroom that did not have an exhaust fan. It's almost silent and moves the air out from above the shower with no problem. Easy to install through the wall as well.",
        "This is the only product on the market that I found with enough CFM's. It really does the job in a 5 X 7.5 bathroom. There aren't many that are made for verticle use. The product is excellent.",
        "It was perfect for the small bathroom under the stairs in our rental unit. The tenants say it works real great!",
        "This is the quietest fan I have ever heard (not heard)! Serves its purpose well in our garage converted bathroom.",
        "Price was right to replace the bathroom fan that no longer worked. Arrived quickly and in perfect condition",
        "The WhisperWall fan is very accurately named. Most people do't even notice it running. It is VERY quiet. Oh and it sucks the moisture out of our bathroom very effectively.",
        "This was a direct replacement for the same product that was 15 yeas in use . Exactly the same -easy swap",
        "Fan is super quiet and has great pull. It was worth the price.",
        "Great quality, clear instructions to install and it's very quiet just a advertised.",
        "Panasonic stuff is awesome this thing is whisper quiet and made with high-grade material highly recommend."
    ]
}