{
    "entity": "Ventilation Fans",
    "text": [
        "Wow...this fan is EXTREMELY quiet and works very well. After installing and replacing a noisy bathroom fan, we couldn't even hear this fan working over the sound of the furnace air blower in the basement - a piece of paper at the intake confirmed it was running. It's amazingly quiet and has several installation options that allowed us to mount inside a wall cavity and use the intake vent with screen (in the picture, this will be relocated on top of the sheet rock when it's in). Highly recommended if you want a quiet fan. i would have video taped it but you wouldn't have heard it over the sound of my AC unit running.",
        "Amazing fan but the electrical hookup box is an afterthought add on and VERY poor engineering. The wiring is done on the cover :( of the box instead of inside the box so you are holding onto the wires, cover, connectors and wire nuts in cramped, hot attic spaces trying to keep track of two tiny screws to put it all back together once connections are made. ARE YOU LISTENING PANASONIC?? A cover is supposed to be just that! A COVER",
        "I know that this is a lot larger than the traditional bathroom vent fan but if you have access in your attic this is a much better alternative. This unit is quiet and it moves about three times the volume of air over the in-ceiling vent fans. My daughter had a problem with the ceiling and walls being wet after a shower, I installed this unit and vented it about 9 feet across the attic to an outside wall and this eliminated the moisture problem. Over a number of years I have installed four of these units for other people and have never had a problem with durability or failure.",
        "This unit is a little larger than I expected but the workmanship is quality throughout. It is very quite and for a medium size bathroom it is perfect. Mounted in the attic and 6 feet from the register you don't know it is running. The bathroom it is used for has no outside walls or windows this exhaust fan eliminates moisture from the whole area in just a few minutes after a hot shower. It is on a timer to run for 15 minutes after the room is left and does a great job in that time frame.",
        "Finished installing this today to add more airflow to a bedroom that does not cool well in the summer as it has a lot of sun exposure. I am quite please with the airflow vs. noise on this unit which is way better then a Tjernland unit I sent back. I added a new 6 inch duct feeding a 4 x 12 floor register as part of the install. The noise out of this duct is less then a window AC unit that this is hopefully going to eliminate the need for.",
        "If you need fans that move a nice amount of air and barely make a sound in the process, these are the fans for you! If you understand how most inline fans sound and especially the regular high volume fans that are available for medical grows and other indoor grows. I have witnessed first hand entire neighborhoods where the whirring of fans could be heard from the front walkway. I have had repairmen and acquaintances within 20 feet of these babies without an audible sound emanating (with a little help of additional insulation). I find them amazing and reliable, as they have been running 24/7 for close to a year now.",
        "Used to force more air conditioned air to second story bedroom that was to hot in the summer. Working perfectly and much better than expected. I bought the 240cfm unit and the air flow on second floor via 7in duct and several turns is strong; glad I didn’t by the higher flow unit. This product is quiet and well built. Glad I went with this instead of a window a/c unit. Cools the room nicely. I used a relay on the 24v a/c call circuit in the furnace and ran romex from the furnace. I didn’t want this to run during winter as it would make the room to hot. Thank you to other reviewers who recommended this.",
        "Super quiet fan. Plenty of CFMs for a small to medium sized room. It was pretty easy to install, I had access from above and put it between joists. The variable speed is nice too. My only ding on this fan is the tapered hose mounts. I felt I needed zip ties back to the main cabinet to ensure things wouldn't slide off. Wasn't hard to rig that up, but I didn't want things coming off with the fan hidden up in the ceiling.",
        "awesome unit! I used it to move air from one room, into three other rooms.. moved air VERY efficiently!! The intake however, is pretty loud, if you use the 6\" inlet with 6\" ducting and cover.. By noise, I am refering to the sound of the air being sucked in...not motor noise.. this unit has almost NO noise itself.. I would recommend sizing it up to a minimum 8 \" duct with a 10\" intake cover to help with the noise.. overall, VERY pleased with the unit..",
        "Put this in our remodeled bathroom with two 6\" inlets and one 6\" outlet. The most difficult part of the install was figuring out how to mount the fan in between 24\" OC joists in the attic, while moving around insulation in 140 degree heat. This fan is so quiet, you can't even hear it running. Had to use tissue paper in front of the inlets to detect the air movement. This is my 3rd panasonic fan I've put in (for other projects), and I continue to be extremely happy with the sound level and quality. Will continue to use them for future projects.",
        "My family and I live in a small house with one bathroom that gets used often. Mold was constantly growing on the ceiling above the shower, and the curtain rods rusted out fairly frequently due to the high level of moisture in the bathroom. We had the WhisperLine fan installed a few weeks ago and I can't believe the impact it has had. The ceiling and shower curtain rod are completely dry, the mold is gone, the floor rug dries very quickly after showers, and the fan is incredibly quiet. Couldn't be happier, I highly recommend this exhaust fan!!",
        "Very quiet, very good air flow. I placed this unit on top of a board in the attic, hooked up to 2 baths using the double inlet kit. Both bathrooms have good air flow. If not for the sound of air gushing thru the grille, I wouldn't have known the thing is on. I install 3-way switch so either bath can turn the fan on/off (works great when guests forget to turn on the fan, I can turn it on for them lol). I also bought some foam pre-filter for AC units and placed it in the grilles to hopefully catch most dust before it reaches the fan unit.",
        "Exactly as expected. High quality equipment that keeps my bathroom dry and definitely did not expect it to be so easy to install. Did I mention how quiet it is? If I am not listening for it, I forget that it is on, which is night and day compared to the unit it was replacing",
        "Remodeling the guest bathroom and ran the six inch duct to this super quiet exhaust fan. It is so quiet I installed a timer because you won't know it was left on. And it pulls the moist air out 3x faster than the original contractor grade junk.",
        "Great product. I have been using Panasonic exhaust fans for years and they reek of quality. Well worth the money. If you have attic access or space to mount this inline fans are the way to go vs the tradition fan where the motor is mounted in the ceiling. The only disadvantage is that you now have to crawl up to the attic to clean it (which I probably will never do.",
        "The build quality seems extremely solid and well made. I love that you can mount it remotely, there is very little sound you can hear, in fact I think you hear more the air going around the grate than anything. I feel confident leaving this in a customer's house that I've not placed a disposable fan, instead a fan that will be around for decades.",
        "I used it to pull 2 4\" vents from separate areas of a combined laundry/bathroom. Plenty of suction from both and very quiet. Mounted mine in basement below laundry room and vented 16 feet along joists thru basement to outside. Works perfect and plenty of push to open damper at end of run.",
        "This puppy can suck some air! And very quiet. Have two, both mounted to rafters. You can only hear air movement. Each of my units are connected to two 6\" inputs, panasonic's kit. The 340 CFM sucks the steam out of the bathrooms as if you had never taken a shower in the room.",
        "I have not installed it yet. I tested it on the bench it is really quiet. It appears to have adequate air flow will not know for sure until installed. Responding now because I am tired of getting these requests to rate product.",
        "Awesome! This fan pulls so much air you have to open windows or it will pull air down the fireplace chimney and furnace/water heater flue downstairs. Just what I wanted. Surprisingly quiet as well. You rally just hear the \"whshs\" of air going through the 8\" diffuser above the shower. Want to pull massive air and do it quietly? Then this is the fan for you. I will say one gripe is that the inlet/outlet on the fan is tapered in a manner that makes it difficult to use traditional aluminum ducting.",
        "Wow is this thing on ? Wouldnt believe it was unless I taped a piece of paper to the exhaust vent. VERY QUIET Highly recommended for moving alot of humid hot air from bathroom, indoor pool/spa area or any stale humid room. Dont hesitate to buy any of the Panasonic Wisper line. It is so quiet you can hear when someone farts in the bathroom. I forget its even on sometimes !!!!!",
        "I use these fan in cooling installs for people at home server installs. They ARE QUIET and they push a lot of air. I have bought several different size that they offer. You can hardly hear them unless you are really trying hard to hear them. Be sure to size your intake and outputs right in order to provide the unit with enough air to take in and exhaust. This will eliminate any whistling you may get because the unit pushes a ton of air. Be sure to take your time and figure out which unit you need depending on the space you need to vent.",
        "Sooooo quiet!! Had to check with my hand to see if was even pulling air. Wonderful!! So much quieter than my last inline fan. Keeps the bathroom dry!!",
        "Super quiet for the amount of air it moves! Understand nothing it silent moving 340cfm but this is quieter then most fans moving 120cfm. You won't be disappointed. I don't have a grill on it which makes it so quiet. The more restricting the grill is the louder your fan will be.",
        "This was used over a hot tub in a great room. It pulls enough air to hold a 10x10” piece of 3/4” pine to the vent grate we used in the ceiling which is 15’ away from the mounting location of the unit. It’s also very quiet. I was very impressed with this unit.",
        "My unit has been running on a timer for 2 years. The timer turns on for half hour every hour in the winter and runs continuously in the summer. Never had an issue. Great product.",
        "panasonic makes a fantastic line of home fans. this is one of them. easily meets the stated CFM rating. quiet. excellent quality. expect it to last a long time. very satisfied. doing a great job keeping my garage cool in the summer.",
        "This is a big unit w/a lot of pull. However, it is not as quiet as I had hoped for. I used flexible dryer ducting, but am wondering if insulated ducting like is used in heating systems would be better. Also note, you will need a baffle for the output end and some sort of cover for the input side. I got this for a man cave w/cigar smoke. The room size is within the capacity of this unit, but it can only do so much. I think an ionizer in conjunction with this would be good.",
        "Instead of moisture dripping from the grate of a conventional exhaust fan on to the floor, moisture collects in the fan body and find its way through the ceiling regardless of how good I insulated the unit.",
        "WOW! This fan is very powerful and quiet. I installed it during our new bathroom remodel and It's hard to tell if it's running. I installed two vents, one in the middle of the bathroom and one right over the shower and put a \"Y\" at the vent inlet. At 240 CFM, it clears the room fast.",
        "Quiet, powerful, and easy install. 30 feet of 6\" round steel duct mounted horizontally and drawing air from 2 different bathrooms utilizing a three way switch.",
        "We purchased a Laser Engraver for our custom sign business and needed a quiet exhaust fan to remove fumes from the machine as it cuts the materials. After extensive research, with a strong emphasis on low level noise requirements, we came up with the Panasonic FV-20NLF1. From its specifications, it had the right CFM and also one of the lowest noise level (40db or so). We purchased it and when it came installed it rightaway. To our surprise, the unit is extremely quiet (even in our application where the unit is external to a wall system). We do recommend this unit for its quiet operation and ease of installation. Belmeade Signs. [...]",
        "Best bath fan ever super quiet, moves a lot of air I don’t even get steam on the mirror with a long hot shower",
        "Nice to install in the attic resulting in a quiet fan I the bathroom",
        "I absolutely love this fan. It is so quiet that I have to listen to hear if it is running. I purchased 2 of them...one for each large bath. My mirrors never even fog up at all. The electrician who installed my fans said that he had never installed fans this nice. I would definitely recommend this one. If you purchase it, be sure to purchase the accessory kit as well. It's definitely needed and probably will need to purchase duct work as well.",
        "Used as a booster for hot air from a pellet stove to send to the second floor. It is relatively quiet and much more quiet than any other \"Booster\" air plenum fan. Very nice design and does put out 240 CFM as opposed to others that claim the same specs. I love this fan. Finally a good night sleep.",
        "Outstanding product. Great powder coated paint. The fan is quieter than the moving air coming out of the air duct. I am using this to move hot air near my wood stove into the new addition (kids playroom.) This is 13 feet and there is plenty of air coming out. This 57 watt fan will cost me $4.11 per month, if I leave it on all the time (Nov. 2011 electric costs.)",
        "Just reiterating what others have said. The only noise you hear is the air moving through the grates. I mounted it in my attic above my bedroom to vent the 2 bathrooms in the house. I can' t hear a thing in my bedroom...not even a hum of any kind. I'm fairly sound sensitive and this fan is quiet on a whole new level. When I move I may just take this fan with me. Very nice to see a product that works as well as claimed.",
        "Have not installed this yet because it’s going in a new house that’s under construction. Our son bought one and recommended this to us",
        "We installed this with the Leviton IPHS5-1LW Humidity Sensor and Fan Control switch. It is perfect for our indoor spa. It is very powerful, and yet very quiet. I highly recommend this.",
        "Still running quietly and efficiently after 6 years in a hot attic. I had low air flow from the AC vents on one end of the house, so I installed this and it solved the problem. To avoid wiring it directly to the AC, I used a Honeywell S688A 1007 Sail Switch installed inside the air return housing which turns it on when air flow pushes on the sail. I highly recommend the Panasonic WhisperLine. It is well worth the price.",
        "You have to listen to make sure this fan is on. When coupled with the humidity sensor, it comes on when needed and goes off when not, but you can still override it and turn it on yourself.",
        "This unit is super quiet and very efficient. It allowed me to place registers in the bathroom where they need to be and not because they happen to be where the light is. The only recommendation that I would make to anybody considering this fan is the addition of a timer type power switch. This unit is SO quiet that we keep leaving it on.",
        "This may have been the single greatest addition to our bathroom. We have an em suite where the bathroom and closet are together and I was concerned about the steam reaching our clothes and creating a great environment for mold and mildew. I installed this unit combined with the dual inlet system and it has worked superbly!!! Also, the name \"whisper\" is 100% spot on! Every other unit I have purchased was a chore to listen to and I don't even realize this one is on. I can't believe that with 340cfm it would be this quiet. Highly recommend this piece!!!",
        "This is the second fan I've purchased. This one is being used to cool an equipment room by cycling fresh air through. My other is used to move hot air from a fireplace to a second story for winter heat. Both are extremely quiet and efficient.",
        "Quiet and powerful . I used it to increase the return air power to my furnance for three rooms.",
        "My go-to brand when I think about any residential ducting fan. Reliable, quiet, well made.",
        "The gaskets are loose ok both sides. Be sure to fix this when installing.",
        "Easy to install and very quiet! Great alternative to a range hood over our island.",
        "I installed this 240CFM Panasonic fan to replace another manufacturer's 250CFM unit installed by a contractor 9 years ago to vent two bathrooms. This fan is very quirt and appears to move more air. The online fan size calculators say I need about 130-150CFM so the fan is a little over sized for my two bathrooms. The noise level of the old fan was similar to a vacuum sweeper. All I hear now is a gentle rush of the air being pulled through the vent.",
        "Not quite whisper guilt, but moves a lot of air.",
        "I have three of these for the bathrooms in my house. THey are all ducted outside with insulated ducting. They are so quiet that people often ask if the bathroom fan works. I have to go up to the vent to make sure air is flowing. Put it on a timer and this makes a great bathroom fan.",
        "I installed this in the attic over the master bath. Easy to install with a little know how. Works great and is much quieter than the Braun I had from Lowes",
        "Wow! Super quiet; can barely hear it running. I'm ventilating two bathrooms at once using this fan, and it works like a charm. I do have it mounted horizontally, as it was so much easier in that configuration.",
        "Panasonic has the best fans. The inline fans are silent and last a long time.",
        "I wanted to replace my noisy Broan 502 exhaust fan with something much quieter in my workshop. This thing really sucks! Like almost 100 more cfm than the 502. I used the hanger option and attached the hanging bracket to the subfloor inbetween the joists. Then used two inlcuded short brackets to keep the unit from swaying off the hanging brackets by attaching them to the bottom of the joists. If I was building or remodeling a bathroom(s), this would be my only choice for a highly efficient and whisper quiet exhaust fan. Nice engineering and rock solidly built.",
        "This fan unit is great. Very quiet, easy to mount and really moves the air. I would highly recommend it.",
        "Appeared to be well made but was still too loud to install",
        "nice and quite and works to get steam out of shower",
        "only way this fan could be bad is if it conks out really soon, don't know that since I haven't had it very long but it pumps a lot of air and it does it quietly",
        "Amazingly powerful, yet very quiet as compared to an in-ceiling model. I have this powering two vents in my rather long bathroom. Previous to this I didn't have any vent and everything would get immediately fogged with a hot shower. Now there is zero fog even after two long showers.",
        "Mounteed in the attic with two intakes one on each side of a cathedral ceiling support beam. I put it on a timer switch to run for 45 m​inutes. Cannot hear the fan at all, I can only hear the terbulance of the wind being drawn into the intake.",
        "GREAT FAN!!! I am a smoker and the only room I can smoke in is the bathroom, because it's the only room with a fan. Well the fan went out and I decided to give this one a try. No more smoke smell in the house at all. BEST FAN EVER!!!",
        "very quiet slight vibration/drone when running, not annoying enough to detect unless really looking for it. Mine is in attic sitting on a rubber mat on floor.",
        "So quiet I can barely hear it running! Make sure to read the installation instructions though as I think if you install it wrong it makes more noise.",
        "This fan works great. Super quiet and really moves the air out quick. I set this up to ventilate two rooms and does an excellent job. Don't buy the duct kit. You can get the parts a lot cheaper buying the pieces yourself.",
        "Quiet fan that moves a lot of air from my gas stove to the back of the house.",
        "Installed this in a 2 story house with only one furnace. The upstairs bedroom on the southwest corner was always hot in summer. This fan unit is high quality and easy to install. Very quiet running and did the job.",
        "on time delivery. High quality fan. quiet and will last a long time.",
        "Excellent product..... installed in kitchen and we are very pleased.... we usually do fish outside on the grill because of its smelly properties but we thought it provide ultimate test for this unit.... it handled it well.... the smell was limited to the half of the kitchen where the stove was but beyond the vent there was no telling we were frying fish....",
        "The unit was larger capacity wise then desired so I installed a fan variable speed switch as part of the installation as I am only using I ceiling vent initially.",
        "Quiet is king, but mostly bought for convenience. Very easy to install.",
        "this thing will suck the cover off a golf ball. be advised it takes a lot of planning and time to put something like this in old construction. expect to pay as much as the fan price for ducts, roof vent and electrical hookup.",
        "Super quiet - works great! Very happy with this purchase. We put a wye in to have two grills in our master bath and toilet closet with one fan. No issues with ventilation - runs great and handles the operation well.",
        "Added to my laundry room in basement to vent excessive moisture and humidity. Very quiet and moves lots of air. High quality construction. Solved the humidity problem. Air in basement much fresher.",
        "Just what I was looking for! Quiet, powerful, fit above the ceiling.",
        "Incredibly powerful... too much for a single 6\" pipe run of 50'. I should have gone with a smaller model!",
        "Incredibly quiet. The sound of air rushing through the ducting is louder than the fan.",
        "Useing this fan to move air from one room that is too hot to two that are always cools works great and all I hear is the air moving through the grill but the fan it self is under the house and i cant hear it",
        "installed this three years ago for my kitchen hood vent. works great, nice and quiet, and strong.",
        "Need to wire a plug on which is ez. good quality and quiet",
        "If you want a exhaust fan that really moves air and prevents steam from building up, this is it. Low noise level and top quality fan.",
        "Everything as good as it get but only with slightly noisier than I expected.",
        "Easy to install, moves plenty of air, and really is very quiet. Really. Would absolutely recommend this fan if you don't want anybody to be bothered by machine noise. Even directly next to the unit it is quiet enough to have a conversation in a normal voice.",
        "Works great and is quiet. I guess you get what you pay for but wish they were a little cheaper.",
        "Just recently installed, so far no complaints, works like it suppose to. Not sure about the whisper part,but it's still ok.",
        "This is amazingly quiet. Can't even tell it's on. I only know it's on because it creates a breeze at my feet!",
        "Amazing fan assembly...I can't stress how great the air flow through this thing it. The only negative is that it is almost too quiet. A couple times a week, I come home from work and the fan was left on by my fiencee. She says that she couldn't tell it was still on. This fan will normally keep the mirror from getting steamed up in my tiny bathroom. If I turn it on after a shower, the steam is clear within a couple of minutes. Just a note about the noise level, the only noise we hear is the suction from the fan, not motor noise.",
        "When we opened the boxed I was worried because of its size, but....it's fantastic. \"Whisper\" doesn't to it justice.",
        "I purchased this fan as a kitchen exhaust fan. I do not understand how anyone could rate this item low for any reason. The housing is very well constructed, very sturdy and is epoxy or powder coated. The unit when running is very quite and really moves the air. The duct inlets are shaped to easily receive flexible or ridged duct. I am very pleased with this product and may purchase a second one for our garage.",
        "I have already installed these fans in our church bathrooms. Even though they are 'high velocity' fans, they are very quiet. I bought two of them and received them in two days. Thank you Amazon Prime. These were a breeze to install, Panasonic makes a very good product.",
        "This fan is very quite and it moves a lot of air. It does not vibrate when turned on/off or during normal operation.",
        "Replaced my Home Depot special with this thing and it made a huge difference. As advertised: quiet - all I hear is the sound of the air moving through the grate. Move a ton of air - keeps the mirror fog free with the shower cranked to the hottest temperature for over 15 minutes.",
        "this in line fan was purchased for an industrial installation. It is remote from me, but all I hear is thank you for the quiet.",
        "I love this fan, it is quiet and works well.",
        "Excellent exhaust fan! Easy to install, quiet operation, strong suction which works well with a speed control and/or timer switch. Makeup air availability is highly recommended, especially in smaller bathrooms. Amazon ordering/shipping is remarkably fast!",
        "Very powerful and quiet. After several months of use, this unit has not let me down! Highly recommended!",
        "I am writing this review about a year-and-a-half after running the fan. The fan was installed for my wife's at home grooming shop. We made a shop by partitioning off our third car garage (still not happy about that). We purchased this fan and the accessory kit to split the intake to two different areas (the grooming/bathing area and the closed off kennel area. After 1-1/2 years the fan is still running great and is very quiet.",
        "This fan is awesome. Moves a lot of air and is very quiet.",
        "EASY TO INSTALL A COUPLE HOURS FROM START TO FINSH WORKS GREAT NO FOG IN BATHROOM LOVE IT.."
    ]
}