{
    "entity": "Mobile Storage Islands",
    "text": [
        "Bought this for the idea of half bath's counter, really like after I stained it to white color😆",
        "I love it. It was easy to put together and the quality seems quite good. It is from Tiawan where it appears quality control is important. All of the pre-drilled screw holes lined up nicely, the wood in finished in good fashion and is a solid, heavy wood. Rolls easily, 2 wheels have locks on them to prevent unwanted movement. Took about 15 minutes to construct.The only thing I am not sure of is the slide out cutting board but I did not get this for a cutting board, it is perfect to keep my induction cooker on and to store my induction cookware. Probably the best quality import piece of furniture I have seen.",
        "First small issue is it was missing a couple little hole fill knob things. The wheels took an insane amount of force to insert and one wheel holder cracked on insertion - I superglued the crack and it seems to be holding up. Upon close inspection with a flashlight, I could see there was some unextruded plastic in the wheel well housings that I ended up filing out for the other 3 wheels (which all had it somewhat). The wheels clicked in securely with the amount of force expected after that. Also did not include banana peels or tortoise shells so for a Mario cart I was somewhat disappointed but I can overlook that in lieu of the real issues.",
        "Easy to assemble, sturdy. Rating reflects a quality to cost ratio, as there are certainly higher quality products out there, but not at this price. There are cheaper too, but not at this quality. Big enough to place a medium sized microwave on, which is what I use it for. Knife holder is optional, it doesn't need to be installed. Tip - When assembling any kind of piece like this, never fully tighten anything until you have it all together. This gives you the chance to set it up, shift it around, and get it nice and level. Once you've taken as much of the wobble out as you can, tighten.",
        "The only reason I gave this 4 stars for easy to assemble was because the castors would not install and kept falling off. I thought this was going to be an insurmountable problem as the cart comes from Asia. Well the vendor is actually in the USA and after I emailed them, they got in touch w/me in less than 24 hours and after much troubleshooting, sent out replacement legs and castors. They couldn't have been nicer or more efficient. Got the replacement parts today and all is well. I love this little cart. Well made and addresses lots of needs.",
        "Beautiful solid wood, easy to assemble...My only complaint is that the pre-drilled holes for assembly are slightly too large. You can easily strip the holes with the screws if you tighten too much. I ended up using construction adhesive in conjunction with the screws and the next morning it’s as solid as a rock. My only other complaint is more ascetic than quality related, the wheels supplied belong on an office chair and not this beautiful cart. However, you still can’t beat the quality for the price....I would buy it again.....",
        "TOTALLY solid piece of work! It takes a bit of work to put it together, but I was able to get it done with arthritic hands and all. Just find something to use as a “lever” to really crank these screws in tight. You can opt not to put the knife block in if you choose. I decided what the hell, let’s give it a try. If I decide I don’t need it, it’s easy enough to remove. Once it’s all put together, you’ve got one VERY SOLID, stable, and gorgeous piece. I couldn’t be happier with the purchase!",
        "I was very pleasantly surprised by the quality on this chopping block/cart. Love the look of it. Really a nice piece. I had some trouble with the wheels 🥴 I think they may need to be placed BEFORE you screw in the sides ? Took them out for now so I could move it form porch to kitchen without the wheels falling out",
        "Super Fast delivery (next day!) I desperately needed something to hold a large sheet cake that I could quickly move to location for an event. I saw this cart with next day’s delivery and was nervous about assembly. I even posted an assembly job on Thumbtack but when the package arrived I realized there were VERY FEW PIECES to assemble. I did not even read the manual. Took 30 minutes to assemble with a screw driver and the little wrench that comes with it. The wood is great quality and sturdy. Pleasantly surprised. I’ll be ordering a second one. Buy with confidence!",
        "Cart seems of good quality and seems to be very sturdy... assembly wasn’t difficult. I give it 4 stars because of top board having damage, seems like it was cut or cracked down the left side towards the center... I asked for replacement so will see how this goes and if i get it replaced it definitely is worthy of 5 stars *updated 1 week later received damaged part and everything is excellent... great customer service handling in a timely manner 👍🏼",
        "Well packaged,easy to assemble. Suggest to silicone to all attaching areas to reduce separation.Can use glue but must prep areas first.This is second one we have had over the years and these simple tricks during assembly will keep product solid.also if slats come lose apply a dab of silicone to bonding surface and give it few hours to dry.Well worth the price.",
        "I literally buy more than 100 items on Amazon each year. But I personally have not left a review until now. This is truly a quality product. Beautiful solid hand finished wood. Very easy to assemble. They even provided wood caps to cover the screw holes. Hard to believe that they can manufacture and ship such a quality product for what they charge. Enjoy",
        "I received a kitchen aid mixer for Christmas but didn't have space to set it up. I bought this cart and it worked out great. Have the mixer on the top, the attachments on the second shelf and have room for a fruit bowl with extra storage space. My son put is together quite easily. The shelves are pre assembled , so it was quick and easy!",
        "Needed a good looking Serving Table for the Holidays. Well packaged, no damage in shipping, no missing parts and packaging easy to remove. My kind of furniture. Large hardware, engineered so hardware slips easily into frame. Actually looks much better than I would have expected for the price. Looks nice against an expensive Butcher Block table I have.",
        "This cart was perfect for our needs! Super easy to put together, sturdy enough to hold our soft drinks on the shelves and our convection oven/air fryer on top. It freed up so much counter space for us, tucks away nicely in the corner and I love that it's on wheels so it can easily be moved to be swept around. We love it!",
        "I certainly have no complaints with this item! Arrived in a sturdy box. No visible damage, imperfections, missing parts. It's sturdy, exactly as depicted. All holes in the right places. I am a 68 year-old arthritic lady, and I put this together by myself in about 45 min. The wood is beautiful, flawlessly finished, and the piece is quite attractive. I almost didn't order this because of some of the reviews, but my experience was a very pleasant one, and I strongly recommend this cart to all buyers. I only give five stars when I am extremely satisfied, and this is definitely a five-star item.",
        "Can't review this well as it arrived broken. The remaining pieces look sturdy, and I hope once I'm able to repair the broken shelf it will assemble easily. The shelf doesn't appear well made & is held together only by \"staples.\" Need it soon so don't have time to ship back for replacement.",
        "Very easy to assemble especially with a drill and correct bit. I find the unit quite attractive with the natural clear finish. Nice to get something not made of particle board. I did not use the knife holder which I though gave an unbalance look to the cart. Your choice. Don’t overtighten screws.",
        "THIS CART IS SO NICE! I needed something for my rental house and this cart added so much workspace to the kitchen. The cart is very sturdy wood, easy to assemble, and has the nice details of the towel rack, knife slots, and included cutting board. I had hoped for something more modern looking, but I am not disappointed in this cart at all. The height makes it a great workspace next to my stove, and even though the kitchen floor is uneven, somehow this cart doesn't wobble at all.",
        "This Winsome Wood Mario Kitchen Cart is easy to assemble and is very good quality! We put this in my son's small kitchen and filled the need very nicely. I was able to put this together in under 30 minutes, by myself. The cart is quite sturdy and looks great! Highly Recommend! CFH",
        "I love this sturdy cart. My husband put it together easily. It's so attractive and has extended my kitchen counter space. I received a NuWave Oven as a gift and this was the perfect place to put it. I was also able to free up other space on my counter by storing my seldom used food processor, electric pressure cooker and mini food processor. It can take quite a lot of stuff and even has a nice removable cutting board that I didn't know about when I purchased it. Fits right back into the carved slot and out of sight. If you are looking to conveniently expand your counter space without breaking the bank, buy it!",
        "The cart was very easy to put together since, fortunately, I had an electric drill with the required star bit. I''m sure that fact made a huge difference in the ease of assembly. The cart itself is quite sturdy and the build is solid. I did have a small buld issue with one of the storage slats being loose, as they are only stapled on the frame.",
        "Great product. Bought it for my mom to use in her new apartment. Went together quickly. Very sturdy and most of all...mom loves it. However, when we got it, it was missing all the hardware. I called the company and they got it to us. It took about 11/2 weeks. We were not in any hurry so that was not an issue for us.",
        "I was really surprised by the quality and value of this kitchen cart. I needed a place for our ninja foodi and other small kitchen appliances. This fit the bill. It came very well packed and it was really easy to assemble in under an hour. Everything you need is in the package.",
        "Very sturdy, and extremely easy to assemble! I received the item today, assembled it in about 45 minutes, and managed to clear most of my kitchen counter contents onto this cart. That includes a bread machine, a professional mixer, a blender, an electric skillet, and a large crock pot and a crock of kitchen utensils, and there is still room!!!!! Its hard to impress me, but I am impressed by the quality of this items weighed against the price!",
        "I love this cart. I bought this the first week I was in my very own first apartment in 2013. It is now 2020,and i am fondly staring at this cart in my bedroom,currently serving as a TV/DVD/Cable box stand. When I first got this cart,it held my microwave,fruit bowl and knives in my small apartment. It has followed me through 4 apartment moves and hasn't fallen apart. I used to use it for its intended kitchen usage,but my current place has a small kitchen and there was no room! I still use the chopping board it came with,as it is also still sturdy!",
        "i purchased this cart for additional food prep space in our small kitchen. We have ample space but there is no countertop space. This is a wonderful addition and also provides extra storage. We keep it locked in the center of the kitchen but it is moveable. I love the cutting board and knife block it comes with as well. Very useful cart and it's real wood! Great price!",
        "Received this as a gift from my husband and I love it. It's larger than I expected, which is a bonus for me. I use it daily in my kitchen as a work area. My son-in-law assembled it for me in under 30 minutes and it's solid and well made. The wheels rolls easily and the locking feature on two of the wheels is a great benefit when in use. The two storage shelves hold more than I thought they would. Overall I couldn't be happier with this cart and would recommend it to anyone.",
        "We just got this yesterday and I was super excited to put it together. First, one of the shelves didn't have pre-drilled holes, so I had to try to just screw the screw in by hand, which cracked the wood. Like, cracked it pretty badly. I was able to get it screwed in eventually, but it's really wobbly now. I'm going to have to reinforce the legs or something. The wheels are really cheap too and don't actually prevent the cart from moving. I really wanted to like this, but I feel like this was just not a good purchase for me.",
        "I read all the reviews because I am not a particularly handy person and would be assembling it alone. I wanted a cart for my toaster oven and storage for my smaller appliances. I wanted one with wheels and it matches my microwave cart in color. The instructions were easy to follow and I was able to prop the pieces to be able to assemble it myself. It is sturdy and very well made. I recommend it.",
        "I have a very small apartment in Chicago, and needed some extra counter space. I use this every day and am grateful for the extra space! The cutting board is okay, but since the cart is a little low, I tend to just take the cutting board out and put it on my counter -- and I'm only 5'3.",
        "I bought this piece because even though my kitchen is large in terms of square footage, it does not have a lot of counter or shelf space. The cart has wheels but I lock them and leave it in place. It is the ideal height for me and adds just enough work and storage space. I sit my pots and pans on the shelves and hide-away cutting board is a nice touch. I assembled it myself in under half an hour -- very simple and straightforward. No missing pieces and the cuts and holes were wonderfully aligned. No complaints whatsoever.",
        "Very easy to put together. Very sturdy. Wheels lock into place when needed. The perfect size for my small kitchen. I store my pots and pans on the bottom shelves, which holds them with no problem. My microwave is on top. The wooden cutting board (not a drawer), pulls out completely. I am very tempted to ship it back to the States when I PCS.",
        "High quality and easy to assemble. I am horrible at assembling furniture, and this was simple and perfect for my needs. Very high, and love that there are wheels. The price was amazing, and I know that I will be buying another one soon. Love this isand like cart. It has made my day. The knife holder is ok, but does not fit many knives. Some review said they did not know how to work paper towel holder. That is not the purpuse of handle. It is for cloth towel. Just buy this product now because for the price, you will not find this quality.",
        "This gives me the extra space I needed in my kitchen. It's nice solid wood. It looks really good in my space, and the cutting board has really come in handy. It's nice it stores away and doesn't take up extra space.",
        "I use the top of this cart as a place for my microwave. The second shelf has ample room for my large slow cooker to live, while the bottom shelf houses other large pots. This is lovely wood, solid quality construction - but I paid someone to put it together for me, with power tools. It didn't take him long, but I'm sure it would have been a hassle for me, so I can't vouch for ease of assembly. I highly recommend this cart if you need extra counter space.",
        "What a handy product, nice for extra counter space and has a pull out cutting board which is pretty cool, there's slots for four knives to keep em handy. Looks great too, you won't be sorry!",
        "I love these carts this is the 2nd one I have bought from this company, easy to put together, great quality so satisfied and happy with this product. Thank you for a quality item at a decent price.",
        "We bought the cart more for carting plants in and out of the house. The cart is very well designed and highly recommend the purchase. The cart is sturdy and handles the weight of multiple pots without getting all rickety. Also, the stain is durable and handles small puddles of water without getting water stains. We roll the cart across a thick carpet and across the boards of the deck. The wheels can handle the weight and the various surfaces. The product has great craftsmanship and is properly designed. There aren't any hair-line cracks in the board. A great product all in all.",
        "Great sturdy cart that provides instant counter space for cooking. I have a kitchenette so don't have a lot of counter space to prepare food on. This thing really fills that need. Fairly easy to put together and once it is together it is solid. The shelves are also great to store pots and pans so helps with space saving too. Built in knife block and slide out cutting board are a nice touch too. I don't move it around much so not sure how long the wheels will hold out if moved a lot but so far so good. The natural wood look is very attractive. Definitely recommend this for small kitchen chefs.",
        "This cart is almost unusable - it is rickety and sways back and forth at every touch. I managed to stabilize it somewhat by adding 1x2's across the back but it still pretty bad. It was not cheap and I am really sorry that I bought it.",
        "Product was well packed and arrived with no damage.At first I was concerned with the lack of written instructions but once I studied the images it was evident how simple the assembly would be and was.The knife block is an added bonus.I can store all my juicers and blenders underneath and have a good working surface on top.The unit is solidly built and perfectly level.No missing parts and everything fit.I was also able to assemble it by myself even though the instructions suggest two people.Excellent product!!",
        "solid construction, not hard to assemble (I didn't do it, but I watched my son do it and he didn't curse once!) gave me extra versatility and convenience in my compact kitchen. It rolls easily...the only drawback I can see is the pull out cutting board slants downward a little. You can put a wedge of cardboard in the gap when you use it and its fine.I actually don't need it, as I just use my cutting boards on the top",
        "My liked this piece. It is exactly as shown in the picture. The Lower shelves are rather delicate and may not be able to hold a very heavy appliance. It is for lighter things.",
        "Very good solid table. I’m most impressed with how easy it was to put together. I’m 57, retired and handicapped, I got it at 12:30 and it was together by 1:15. Taking my time too.",
        "The cart is solid wood and is a nice cart but the rolling casters are completely inappropriate for the weight of the cart. One of the wooden shelves had some staples missing and one of the slats had come off but I was able to fix that.unfortunately two of the plastic caster sockets broke off while trying to insert the casters. I will have to purchase some casters that I can screw onto the wood. I gave it 3 stars because oF the casters otherwise it would be a very nice cart",
        "The hole that one of wheels went in was cracked so you can’t pick up cart without will coming out. Not happy about that. Update all wheels came from under table I’m VERY UNHAPPY, surpassed time to return",
        "This piece is beautiful and worth far more than its price. It took about an hour to assemble and it is solid wood, beautfiul , sturdy piece. Well worth the price!",
        "This product has been great. I just bought another one, My counter space is limited plus I really like the cutting board a lot. By the way, this is my 3rd one. Very Good product.",
        "Fairly easy to assemble, even though the instructions are general, with photos instead of written instructions. If you aren't fairly handy putting things together, just get someone who is. It's a good cart for the price, and sturdy. I wish it were about 5\" taller though...it's a little low for putting a microware on. Put I am happy with it! Only complaint is that the allen wrench that you use to screw in the screws can strip the screw heads if you aren't careful...don't take the wrench in and out alot or you'll have an issue. Go slowly and carefully on that part.",
        "I am short and the kitchen counters at 36\" gave me back strain when I worked too long or strenuously while cooking. This cart is about 3\" lower and has made my job easier in the kitchen. I don't use appliances on it - it is a work island. I also roll it close to the table when we have company. My table is small and the cart gives us the needed space for serving dishes. It went together well and looks great.",
        "I bought this for my son who is divorcing and rented a house and needed this for his kitchen. I hadn’t seen it until today and was completely surprised! I really checked it out and it was amazing! I still can’t believe it was all that for the price. You can’t go wrong with this, I’m still shaking my head, really?",
        "This cart has worked out great for me in the capacity of a portable taboret for my art studio. I move my easel a fair amount during the day to keep up with the shifting natural light conditions and thus being able to wheel this baby around is very helpful. I have a piece of plexiglass on the top to make it a solid surface and ditched the knife block. The handle unfortunately cannot be removed, otherwise I would have made that a paper towel dispenser. At some point I will still do that but that will require power tools, etc. Overall, a very versatile cart and also attractive and sturdy.",
        "My stove is not close enough to my counters. I needed a movable prep area with enough room for my bowls, ingredients and tools. This is perfect. There's even enough room for storage on the other shelves. I keep potatoes, onions and garlic in a bowl and my spices are very handy on the second shelf. I have my knives handy as well as a towel. When I have company, I use it as a buffet to put my plates, flatware and glasses. It's so convenient and portable! I've priced these and this is by far the cheapest. I'm really happy with this purchase.",
        "I purchased this cart about 3 months ago. After putting it together I noticed that it wasn’t very sturdy at all but kept it anyway because I needed it. Now I wish I never bought it. It has become even more wobbly and the wheels will not stay in place. It’s incredibly frustrating and I do not recommend at all!",
        "We wanted an extra work surface and pot storage for an apartment kitchen. This is big enough to fit two big pots and our collection of frying pans and saucepans on the two lower shelves. We did not want the knife block, and it was very easy to leave it off while assembling. Casters are sturdy enough for our purposes.",
        "Had to find some replacements for the two broken inserts - not perfect but will work out OK. Other than that the cart is made of nice whole wood and was easy to put together (up to the inserts for the casters). Just be aware of the issues with the inserts. Still recommend.",
        "The cart was pretty easy to put together and it looks really nice in my kitchen. Its very sturdy and has plenty of storage.",
        "I put this together by myself in about ten to fifteen minutes, which could have been less if I wasn't talking on the phone and getting interrupted with doggy helpers trying to give me kisses constantly. It's very simple, but feels solid so far and looks great. I'll update this later with any changes.",
        "Excellent, attractive piece of furniture. VERY sturdy. Easy to put together. After reviewing the instructions, it took a little less than an hour to put together by myself with the one included tool. Has a very nice finish and provides good room for most any item. Comes with a very useful large cutting board that easily tucks away on the cart for storage. The knife rack is convenient and the castors make it oh, so easy to move around. One of the best items I have ever bought on Amazon.",
        "I bought this to help organize some items in the kitchen. It was easy to assemble, looks nice and is sturdy. Very satisfied.",
        "Well constructed. Solid wood. Came well packaged and went together in 30 minutes. The rollers are light duty so they don't roll smoothly but for the price I'd buy again. The screws go in slightly hard do you'll need a cordless drill with an Allen wrench bit to save your wrists. It comes with an L shaped allen wrench so you can make do if necessary.",
        "Super easy to assemble. Took about 15 minutes, no fuss, a few screws and that's it. Excellent price. Super functional and versatile. You can move it around. Perfect size and height to cut on. Perfect match to my cabinets. Now I don't have to store things in the oven. And can chop and cut in the cart to save me counter space.",
        "Great quality and easy to put together. Absolutely love the functionality with slide out cutting board, knife holder, and adjustable wheels, and the handle makes a great towel rack! We use it in the kitchen and outside on the patio when grilling/entertaining. And, I had a piece of my kitchen countertop left from a recent install and it fits perfectly on top. :)",
        "Easy to assemble. Well constructed out of wood and holds a large heavy microwave. Love the extra storage shelves. Great value for the price.",
        "Currently using as a microwave cart to free up counter space. Solid wood, no particleboard! Very impressed with the quality of the wood and workmanship. I’am a DIY’R an appreciate value to cost especially in an imported item.",
        "It is definitely sturdy and useful. You need two people to build it. One person is fine, but two would be better",
        "This product is absolutely amazing! It is very sturdy as it holds our huge microwave as well as a large family crockpot and blender on the shelf right under the top. It was very easy to assemble and is about the size of a small dresser.",
        "Beautiful and solid, definitely try to have two people during assembly, there was a green stain on the top piece but it's facing the wall.",
        "This is a great utility cart. I bought it to put a portable dishwasher on. It was one of the few rolling carts that was large enough to fit a portable dishwasher on top. I roll it right over to the sink and hook it up when I'm ready to wash dishes. Almost all portable dishwashers are the same dimensions, so this cart is great for them. It is VERY sturdy. I was really surprised. The knife holder works great, and overall it looks good to. I put it together myself. Two people would be ideal, but still only took about 15 mins by myself. Nice product.",
        "This cart is the perfect size and it looks so nice! My family were victims of hurricane sandy. We lost everything, the house, two cars, and all of our belongings in more than 3 feet of salt water. We have been moving from place to place while we try to rebuild. When I saw this cart I thought it was cute and it was the beginning of the fantasy that things will somehow return to normal. My husband is a carpenter, so he was able to put it together quickly. We already have a microwave on it and the wheels make it portable, which we need. It got to us quickly and I am so pleased with the product!",
        "The cart is really sturdy and arrived in great condition. We use it constantly and love it. The one downside is that the screws are always visible because the little wooden covers never stay in. Otherwise, this is a great addition if you need more space in the kitchen. We store plenty of weight on the shelves and use the cutting board regularly and it holds up very well to the use and abuse.",
        "Like many other reviewers, I bought this for a countertop dishwasher. Also like those reviewers, I am impressed by its quality and sturdiness. It is the perfect size to hold the dishwasher, and the lower shelf is good for holding detergent and etc. The towel rack makes for a good handle to pull it around by, since the dishwasher makes it fairly heavy.",
        "I bought this cart to replace a table on wheels because I wanted the shelves. I have it in my kitchen and it goes very well with my oak cabinets. I use it for my phone and phone books, my VCR Combo, my satellite receiver, my sound bar and woofer, VHS and DVD movies, and two boxes containing RX and first aid things. I like that it is on wheels for easy movement to clean the floor. It mostly just sits in the one spot and looks pretty. It is very useful to me and holds lots of stuff with the top and two shelves. Cher Keffer",
        "This cart is made of solid wood. The surfaces are finished very nicely. They are smooth. It looks very good. It fits perfectly in my walk-in pantry and holds my food dehydrator and rice cooker on top. I store other smaller appliances on the shelves. It was easy to assemble. Our only complaint was that their special screws needed a special tool to screw them in by hand, (which they supplied) so we couldn't use our electric drill. The price was reasonable, compared to the stainless steel carts I was looking at",
        "Materials and workmanship are very good. Design is even better to ensure it is assembled correctly. I'm pleased with the dimensions, and it is a nice complement to my kitchen.",
        "Opened the box and it said it takes two people to assemble this utility cart. I did it by myself in about 30 minutes. Some people have complained about screw alignment problems. As long as you go around the card starting each set of screws - But not tightening them fully - the alignment is perfect - so, don't tighten until each set of screws has been started and you won't have a problem. Once assembled it's a very solid unit. Actually, it's better than I expected - and, you can't say that very often.",
        "After moving into a smaller apartment, I found myself in need of a small microwave stand. I searched around at several retail stores, but couldn't find anything that didn't seem super cheap and unstable around this price point. Long story short, this particular cart is much, much better quality than the other carts I've looked at in this price range. It looks great, seems very stable, and was easy to assemble by myself. Can't ask for much more for $100. The bottom slats did have some minor separation (only held together with three small nails on each side), but nothing some wood glue couldn't fix. Overall I was pleasantly surprised by the quality.",
        "We needed to free up counter space and bought this cart to hold the microwave. It is perfect and exactly what we wanted. The cart arrived very quickly and in good condition. We are not handy, but we assembled it in no time and were very proud of our work. All the pieces fit well together, and the hardware was perfect. We chose to not install the knife holder. The cart looks very cute and is sturdy and stable. Glad we chose this cart!",
        "I wanted something I could keep outside our (covered) porch for our little toaster oven. This fit the bill. Completely solid wood and sturdy. Pretty easy to install, but HEAVY - so be careful lifting and moving the box. I installed it myself within an hour or so. It's been outside on our porch for over 6 months (with wind/rain/cold/hot) and it is still in good shape. I would not leave it completely unprotected though as it is not exactly \"treated wood\". Regularly put wood oil on it to keep it in good shape.",
        "I have a large master Closet with an area perfect for a coffee/tea cart. I placed my Keurig on the top shelf; a small microwave on the second shelf; and accessories on the bottom shelf. With a small fridge next to the cart, I have the best setup for my upstairs master suite. It was simple to setup and is long enough for the small appliances, etc. The wood is sturdy and is properly sealed. Should last for many years to come.",
        "This utility cart is the perfect complement for my dining room. It's roomy, rolls easy, locks easily when necessary, and provides a nice workspace. It was very easy to assemble, with good fit and finish.",
        "I bought this as a storage accessory to my already congested house. Assembly: Can be done by one person for the most part of it. You do need someone to hold the racks in place before you screw them in. Components: Came packed well. The two racks in the bottom were basically strips of wood held together with nails. That is fine bu some of these nails were hammered in poorly and so these strips and loose and pop out easily when you assemble the whole thing. That is my only problem with this. But I guess for the price, its a good deal.",
        "What a wonderful, sturdy product. I am a 67 year old woman with a very inadequately sized kitchen. I thought I would need help, as the package was very heavy and cumbersome. Once I maneuvered it in the the door, by dragging it, the fun began. The instructions said \" two person assembly\" but I am only one and chose to challenge it. An hour later, thanks to the Allen wrench included, I was done and very pleased with myself and the end result !!",
        "This is a real wood cart. My husband and I put it together in less than one hour. There were some part already assembled. The screws were in a bag, we actually toe extra screw. I wanted the cart for my art supplies, it is perfect for this and moving the paints around and near my easel. It has a cutting board, and a place to hold knives. It is terrific kitchen cart, for the price - I can't believe it is made of wood.",
        "LOVE THIS CART! Looks great w/baskets on the shelves for potatoes, onions or whatever. Sturdy construction, nice looking and practical. Perfect for my kitchen needs...Especially Love the pull-out/removable cutting board! However, ITEM ARRIVED w/a BROKEN LOCK ON ONE OF THE WHEELS and AMAZON does not give an option for just a REPLACEMENT WHEEL. [I would have to return the whole cart.] But instructions enclosed give information to address missing/damaged parts. i'm sure it will be handled quickly after receipt of my faxed complaint.",
        "I wanted something to put a hand grain grinder (CLGM) on as well as add some storage for pots and pans. Does well as storage. A little wobbly when grinding wheat. I need to add some kind of fastener to attach the table the wall which should really stiffen things up. Overall a nice cart. Used an impact driver to start the screws which really helped and used the allen wrench to tighten the screws. You probably don't want to use the impact to tighten the screws, probably strip them.",
        "Pretty big, adds a ton of space to our kitchen. Feels solid and is easy to clean",
        "I can't believe what a value this Winsome wood utility cart is! It's beautiful, heavy duty, and so easy to put together. It took my husband and I only 30 minutes and it was done and ready to roll. All the parts came as specified and there was not a speck of damage to the beautifully finished wood. It's a great addition to my small kitchen space. Don't hesitate!",
        "We are thrilled with this cart! We have it in our kitchen holding the food processor and other items. Very sturdy, smooth rolling wheels, attractive, a great purchase. In fact, after our son saw a picture of it, he ordered one for himself as a bar cart for his first apartment!",
        "Super easy to put together and the shelves were wide enough apart to put my instapot underneath. Great for food prepping or as a serving cart when guests come by. The cutting board is a nice bonus. Really solid. It does however shake a little when I have to cut up something tuff.",
        "Beautiful wood. I use this in my kitchen as a rolling island. I load up ingredients from my refrigerator and roll it over to the counter where I prepare the food then move it all back to the refrigerator. This saves me numerous trips back and forth from refrigerator and counter. The cart is well designed and my son put it together in a jiffy. I store some frequently used items on the lower shelves.",
        "I purchased this item to store my air fryers and other small appliances. I love the look of wood. All of the pieces were very well packaged (no scratches, scrapes, blemishes, etc.) and it was very easy to assemble and it was a great buy for the money!",
        "I purchased this for my mom to use as a microwave cart. It is very well made and very easy to assemble, (don't pay the ridiculous $221.00 for expert assembly) Once assembled it is very sturdy and holds her 2 CU FT microwave perfectly.",
        "I purchased this item to gain additional storage in my kitchen. I am so pleased with this cart. It was easy to assemble, it looks great, and it's very practical in terms of storage, it looks great, and arrived one day early. I highly recommend anyone thinking of purchasing a similar item, you won't be disappointed with this.",
        "This cart is great for the price. It's large and sturdy. Very easy to put together. A great value...",
        "I bought this one to replace another I had in my kitchen that was too big and we were always stumbling over. This one is just the right size but it is table top height, something I had not checked. The overall dimension was great but I wish it were the same height as my countertops like the old one I'm replacing. Went together easily, took me about 15 minutes. Quality is nice and I love the two shelves for storing some of my bowls and choppers. Doesn't feel cheap or shabby.",
        "Started out ok, but plastic wheel anchors crumbled, making it impossible to install the wheels. After assembly, shelf sways about 1-2 inches side to side. Disappointed in the poor quality.",
        "Good solid piece. Easy to assemble. Quality a bit flimsy.",
        "The stand itself is cool. The wheels it comes with are absolute trash. They don't snap in so the whole thing will tip when they slip out on even ground somehow. I went ahead and superglued them in to avoid that problem only to have one snap of under the weight of its own cuttingboard..."
    ]
}