{
    "entity": "Mobile Storage Islands",
    "text": [
        "This came packaged extremely well. All of the pieces were in perfect condition. It was easy to assemble, sans the drawers. Those were kind of a pain because the tap holes weren't drilled deep enough, but it wasn't impossible. Once assembled, this is an extremely solid piece of furniture! Much better quality than IKEA. The only other thing is the white is not bright white, but slightly more on the ivory side. Very much worth $450.",
        "Shipping was faster than stated, unit fits great in kitchen. Was a lot of pieces but was easy to assemble. Very functional. The main negative is that there were 4 pieces of wood that were cracked, and you will not know this until you unpack it all... Lots of packing. I had to repair these broken pieces rather than pack it all up and send back.... The functionality outweighed the inconvenience of broken pieces (note: I have my own work shop,,to make repairs while others who purchase this may find this problem too big.) Very difficult to pack back up once you unwrap and unpack.",
        "I'm very happy with this purchase. I was skeptical at first, but it looks great and fits our needs. It wasn't too difficult to put together, just time consuming. It took my husband 2 hours. It's a good buy for the price. Super happy with it!",
        "The best thing I have for my kitchen. Now I have the ability to utilize an empty space. The Cuisine Cart is very well made. All hardwood sides, back and front. Easily put together by my husband and myself. It is very heavy. All the materials for both the cart and the granite top were packaged very well, no broken parts, even though the granite top box had a smushed in corner. One of the pieces in the directions is stated incorrectly. But the directions are easy to follow. Make sure to lay out all of the pieces first and you won't get confused.",
        "We love the kitchen island. It looks beautiful in our kitchen, love the storage and drawers and the granite is so pretty. Very easy to put together, my husband just needed a little help to hold the parts sometimes. Will recommend this island to our friends.",
        "Well I finally built it and have it sitting my kitchen. It looks great and is very handy. Gives me the extra storage space and work top space I was looking for. I took the suggestions of other posters and did not add on the side racks to it (Towel and spice rack) I have a smaller kitchen and those side racks add on another 4 inches (rounding) but over all looks great and the top is granite which was a plus.",
        "Not that it is finally put together. The handle on the second draw was pre -drilled uneven. I had to verify this to my self with a level. Now I have a $500.00 eye sore. It was very cumbersome to put together. Next time I will buy direct from a store that already has it put together. We wery disappointed to find the granite was chipped.",
        "delivery men were awsome!! thought about the packers and what a wonderful job they did !!! Putting it together was a little hard but hang in there you'll get it together...get help if you can. my hubby and daughter got the job done. I was in charge lol",
        "This kitchen island is wonderful! It’s narrow so it fits well in our small kitchen and it looks very nice. Very well made and the drawers slide easily and the granite countertop is really nice. We decided not to put the wheels on for now which makes it a little lower though. I wish they made a pantry / cabinet that matched it and was made of the same materials.",
        "Awesome product, not that particle board crap either. Put it together in an hour n a half. Very easy and straight forward. Packaging was great and everything was there!",
        "Very Particular. Beautiful cart/island. Fits beautifully into my new kitchen. Great guality, roomy, wooden cabinets with outstanding granite top. More than pleased. Order, timely delivery, and putting it together; all went smoothly. Looks better than I expected. Just thrilled with this cart/island. Can't wait to show it off. Will order again from this company. Amazon-fantastic",
        "This is absolutely beautiful! The best thing about it is that it was easy to put together and is really good quality. I bought for extra counter space and the granite is one of my favorite features. It is elegant, but also can fit in with any kitchen scheme. I would absolutely recommend this product.!!",
        "We love this product. It was shipped to us on time but the granite counter top was broken. One call to customer service is all it took. They had a new counter top on the next shipment out. It is beautiful and looks great in our kitchen.",
        "Very heavy, sturdy wood. Very heavy granite top. Came very quickly. Took about 4 hours to put together but well worth it. My only issue with it is the top drawers pre-drilled holes are off center, therefore leaving the face of the drawer crooked. I cant seem to find a way to contact anyone to see if we can get just a replacement of the one drawer. A little frustrated.",
        "We were so excited for this cabinet, but it arrived to us with a terrible / deep smoke smell that still hasn't faded after one month. It's sturdy and beautifully designed, but we are having trouble even keeping it in our apartment given the smell even after trying baking soda, candles, cleaning etc.",
        "Easy to assemble. Great Looking. Only complaint is smell of drawers was like chemicals. Finally seems ok after lots of dryer sheets.",
        "🌺Love-love this kitchen caddy. Got it in 3 days live in Hawaii, packed well granite top solid. Easy to put together looks great plenty of storage space and lots of compliments 😊 thanks to prime free shipping. Can't get any better !!!",
        "The unit is very well made and was easy to assemble. All the parts fit perfectly and the doors and drawers work great.",
        "Love my cart that I use as an island. Just has a very strong smell when opening the drawers & doors finding it's slowly leaving over time. I was missing a few minor prices, called the company & they sent them right out in just a few days.",
        "It was easy to put together. This is a beautiful island, but it was on the smaller side of what I was looking for. The cabinets doesn't pull out as far as I thought it would. Also, there's a smell that takes awhile to dissipate.",
        "It's beautiful and sturdy. My husband and I were able to put it together in about an hour and a half... taking care to do it correctly. The only issue I see is that it's a bit front heavy and feels as if it could topple forward if you're not careful. We will be buying a block of wood to slide under the front center to remedy that from happening especially when we entertain with families with small children. Otherwise, I love it and have received many compliments on how nice it is!",
        "It did not come with the granite top as described in the description.",
        "It was just what I needed, we put it together in 2 hours, no problems, (my hubbie is great with tools). It is just as described.",
        "Order received several days earlier than anticipated, a good thing. Parts were well marked and assembly instructions with pictures were easy to understand. Assembly took me and my 16 year old daughter less than an hour. Though I was a little skeptical, the cart is exactly as pictured on-line and the fit and finish is decent. The granite top finishes off the cart nicely, greatly enhancing its character from a cabinet that could look rather plain and perhaps cheap to something that looks really elegant. I was surprised at how much and how quickly the price could fluctuate. I saw the same cabinet selling for about $35 less on Amazon about a week after I purchased mine.",
        "I am very satisfied with the purchase. My wife says that she wishes it had a bit more depth, but loves it none the less. It was a breeze to assemble.",
        "A great cabinet--gives extra drawer space and the granite top is beautiful. It has been admired by many friends. A friend and I put it all together one morning--the only help we needed was from a man neighbor living next door to lift the granite top onto it when it was completed.",
        "I love my new kitchen island cart. It is so beautiful and well finished. Perfect for any kitchen size. It works for me cuz i have a small kitchen and can't have a fixed island, so this fits right in and make my kitchen look beautiful. Also, love the extra draws for storage.",
        "My second purchase from this company. A chest of drawers was first. For the money (any chest and kitchen island under $1000 is considered \"cheap\") this hits it. I have looked at many carts in this price range and higher and for under $1000 most are partial if not all particle board (i.e. will fall apart in no time and not withstand much stress). This cart is solid oak with a granite top. Unbelievable for the price! Nothing broken or scratch and the top came packed in a wood protective frame and Styrofoam."
    ]
}