{
    "entity": "Mobile Storage Islands",
    "text": [
        "I am so happy with this purchase. My boyfriend assembled it for me last night and it took him a couple of hours. Results are perfect and he was particular about it being even everywhere he placed the pieces. I'm not quite sure how I feel about the microwave there but it gave me so much room on my counters as well as putting my crockpots in the cabinets. I live in an apartment and my dining area is small. The photo gives an idea of the room it takes and how much is still left on the ends. Love this cart!!!!!!",
        "I am so pleased with this purchase. The cart is nice and sturdy. It took my husband and I just a little over 2 hours to assemble. I love that all the pieces were labeled and really, really enjoyed the fact that all the screws were CLEARLY labeled for easy identification. This had a lot of storage and looks pretty good in my kitchen. I'm very satisfied!",
        "I love it - Seems to be very well made - I had very little problems putting the unit together but I would recommend you have a helper that's done these kinds of things before - I seen some people complaining about the side handles breaking off really soon but I would say its because they were trying to move or lift the unit by these handles and it is not designed for that - also would say the way it was packed for shipment was awesome - I was worried because of some damage to the outside packaging but it has so much Styrofoam around it that it was protected from a hurricane - LOL",
        "Ok, so, assembly was terrible. If you're a person who's handy, then you shouldn't have a problem. Me, on the otherhand, I am not that handy. The graphic instructions were difficult to understand, but after a few hours, I had it assembled and ready to go. I admit, I was cursing all along the way while assembling, but I have to say, it's a beautiful cabinet! It's very sturdy and it holds a lot. The wheels roll very smoothly. It's everything I was looking for in a kitchen cart/island. Just take deep breaths, and a few breaks, maybe a glass or 2 of wine while assembling, but, to me, it was worth it.",
        "I used this for my coffee bar in my kitchen! This thing is sturdy as a rock! Mine currently holds a drawer full of k-cups, etc. a drawer full of kitchen dish towels & wash rags, a Keurig, coffee grinder, coffee cups, 5x distilled water jugs, a KitchenAid mixer, an ice cream maker, etc. etc. I was afraid it would buckle under all that weight but it’s still going strong!",
        "I needed more storage space in my small kitchen as well as some additional counter space, but I did not want to pay too much. This island filled the bill for all three. I even put it to the test at Christmas. I was making fudge and cookies and I pulled the island right behind me so I was able to have all my pans and ingredients within arm's reach.",
        "I just moved into to a smaller house. imagine my disappointment when I discovered that my china chest was too tall to fit inside the house,. I kept a lot of things in the chest and among them was bakeware, and pots and pans. Well, this Dolly Madison Black Kitchen Cart by Home Styles was just what I needed to store away all those items and fits neatly in the kitchen. It is not only well made, it is very attractive and I highly recommend it. As for my old China Chest, it is sitting in the garage like a discarded step-child. However, I will find more uses for it too.",
        "Assembling was an act of faith and a bit of frustration. I would suggest two put this together, there are parts, slats, one pair of arms aren't long enough to avoid slippage, it took me numerous times to get the slats in place by myself. The work was worth the finished product, a gorgeous piece of kitchen furniture with detailing, rewarding of my perseverance. The drawers slide open and shut smoothly on coasters, the doors pull shut by magnets. The front casters keep the cabinet stationary enough for counter work while permitting motion when necessary. Shelf space is adjustable.",
        "Very beautiful. My husband just finished assembling it. He said he was really impressed about how the nuts and bolts were labeled in their individual little plastic bags which he said made the assembling easy for him.. I gave it 4 stars because I don't know how durable it is in the long run.",
        "So far so good, just got it. If you are handy with tools, easy to put together. I'm a 61 yrs old, female , I did it. Instructions easy to follow. The only problem was it was left outside, at the bottom of the steps, which is normal but it is soooo heavy. Have a dolly and 2 to 3 strong people to get it in. It's sturdy, attractive. I was able to clear my counters. I love it.",
        "This is a solid, well constructed rolling cabinet that has added the extra storage space I needed in my condo dining area. It's perfect as a buffet table, stores my table linen and party serving ware, and keeps large beverage bottles neatly out of sight. The step-by-step directions for construction and the fasteners provided made assembly uncomplicated. When purchasing this type of item, check out the shipping weight. This item is a solid 100-pounds and I feel it's a great value. The wood quality is very good for the price! Go for this one!",
        "It's the size we needed for our kitchen and the storage that we wanted. It took about 2 hours to put together and one of the doors has a hard time latching while the other is a little tough to open. It did come with a few marks which is a little disappointing. Update: purchased in July its now the end of December. We've used the top only a handful of times and the top is already cracked.",
        "The doors don’t close evenly but it works for now. Not a long term permanent solution so in the end I didn’t make an effort to have the company correct the problem with the doors. Couple areas slightly damaged but none could be seen once together and placed in its spot so again nothing worth having fixed.",
        "Love this ... however, the cabinet doors like to pop open too easily which I’m sure can be fixed with some hinge bending. When I move the unit around a lot I tie the doors together. It was easy to put together and took me maybe a total of an hour. Great for the extra counter space I need in my RV. I bought this one when the price had dropped 30% and I’m glad as $245 is a bit high for the quality of this unit. Overall it’s a nice kitchen island.",
        "Serviceable in all regards, not outstanding, never an issue. Assembly was probably in the realm of IKEA-level, maybe a little more annoying. Mine seems to have some idiosyncrasies: the doors don’t hang perfectly, probably a cm or two different from each other. There’s some general bowing at the midsection, but who among us hasn’t experienced that? It comes packed with more styrofoam than I’ve ever seen in my life and I’m still finding little orbs static clung to the inside of it a year later. So just be ready for that. It works for what I needed it for.",
        "Item arrived in good condition, and all parts were included (there was exactly one extra of each fastener). Assembly was easy, and only took ~45 minutes, which would have been faster with one extra person for some steps. However, the \"handles\" on either side look sturdy, but are not. Attempting to move the unit by pulling (even gently) on these handles caused the wood where the bolt is to split, and I suspect any further pulling will cause it to come loose entirely. The handles seem to be entirely cosmetic, though they will hold a kitchen towel, I suppose.",
        "Excellent manufacturing and outstanding packaging. Another great value from Thailand; we have noticed the difference with other furniture-type products from Thailand. Heavy and substantial, easy assembly. Even the nine (as I recall) different types of screws and fasteners are packed in their own little plastic bags WHICH ARE LABELED !! Further, this manufacturer even includes ONE EXTRA OF ALL SCREWS ETC. which we have never seen from another maker. Wish they made more stuff !!",
        "I live in a one bedroom apartment with a lot of appliances and little counter space. I lose this to extend my counter and love the size. The only thing is you do have to put it together and pieces are quite heavy so I had to have my husband hold pieces as I screwed them in. I also wish the wheels locked better. It is up against the wall so I don’t mind. Great for the price :)",
        "Disappointed in the quality of the product. Received with a chipped and cracked corner as well as a hole that wasn't drilled all the way through in the wood.",
        "I am very happy with this cart. It did put it together while watching movies, three of them, so it was a long process but the directions are clear and so far it seems like a pretty sturdy cart. I was careful to make sure each screw was tightened well but not overtight so that the cart has a long life and doesn’t get rickety. Arrived fast.",
        "Best I've found for this price point. I was able to put it together by myself in about 90 minutes. The directions were clearly laid out and simple. In the box, it is quite heavy but once put together it moves quite easily on the casters provided. It feels quite sturdy. I have no complaints. Please don't mind the photo, I've yet to paint and decorate, but I thought it would be helpful to show the finished product. Overall I'm very pleased and wish more flat box furniture was this easy to put together and as nice.",
        "Overall thus us a lovely cart & im happy with it. The instructions must have been for another cart; thankfully my husband is very handy & figured it out on his own. One door was defective & one magnet bad but it’s still a great value!",
        "The manufacturer took time to correctly package the many parts so all was there and in perfect shape. The instructions were written clearly and the packaging for the fasteners were marked as described in the instruction. Due to the many pieces the assembly did take some time but was well worth it in the end. Good materials of construction with a quality finish. It's a solid piece of furniture and it looks great.",
        "Very nice cart. I had someone put it together so I can not judge that ease. But, the cart looks very nice and I love the doors & drawers. I was going for hiding things instead of visually seeing everything. Looks very nice & uncluttered. Well made in my opinion.",
        "This fine kitchen island-cart has turned out to be perfect for our little kitchen. It took about three hours for me to assemble -- if you've put together Ikea furniture then you'll know what you're in for -- and wasn't difficult, but did require close attention to the instructions and some patience. The two hinges on one side had gotten bent somehow, and pliers and muscles were necessary to set things to rights, but otherwise it was a straightforward construction. My husband and I love the results. The cart is solid and elegant and a good value at $250. We've not seen anything that would have been better, even at twice the price.",
        "I orders this after a failed attempt with another brand which was about the same price but the quality was much cheaper. It arrived quicker than expected. When it arrived, it was clear the box had been opened before. When I opened it up, one of the boards had large gouges in it. Amazon was quick to send a replacement which was brand new. Building it took some time but all in all not too bad, it took about 90 minutes. The quality is not bad and I would recommend this cart for the price.",
        "This looks nice and was fairly easy to assemble. Not worth the price in my opinion as it was poorly made and the magnetic strips don’t keep the doors closed and the end pieces are loose and flimsy. It also doesn’t have a lot of depth so it doesn’t store as much as I would like.",
        "Love this island/rolling cart. It really does look as good as it's picture. Everything was well labeled and although assembly takes a little time, it's worth it!!! Adjustable shelves, and drawers that actually hold stuff. This is a gorgeous, well made, useful island. The wheels work great. We have a hardwood floor in kitchen and it glides.",
        "Key functional item in my kitchen. It is more narrow than I imagined, but the dimensions are true. The drawers and doors work great. The magnet clasp keeps the doors shut. I did follow advice I found and placed 2 additional wheels in the middle of the island. The additional wheels increased the stability of the island. I cut up veggies on it all the time with no wobbling!",
        "Great cart. Took more than one person to put together because it is not particle board and a bit heavy. Wouldn't expect this quality for this price. Everything matched up perfectly.",
        "Ordered this and had it delivered to my daughter in another state as a Christmas present. I haven't seen the item in person. From her and her husband I hear that 1) it is made well, 2) it took about 1.5 hour to assemble, 3) it looks gorgeous in their white and black kitchen. They are really pleased with the kitchen island.",
        "What a beautiful piece of kitchen furniture. Assembly directions were easy to read and all parts were marked clearly. Some experience in assembling furniture is nice to have with this. Took about 2 hours. Lots of parts. There is small dent about the size of a pencil eraser on the edge of the top piece though which I assume is from the fact it was such a heavy package, almost 120lbs. I am quite sure it got dropped somewhere along the way although it was packaged well but still very heavy. 5 stars without the damage.",
        "This island was easy to assemble.It is sturdy, has good storage area below and holds lots of utensils in the drawers. Easy to move around and it really does look good. The wife is happy with it so I'm happy! A good product at a good price.",
        "The shipping was poorly wrapped and there was damage to some corners but I had no desire to go through packing up the entire thing. My husband put it together for me in a shorter time than others who complained. He did say it was difficult though. I love it, I use it with my mixer and pastry board on top and baking supplies and cookbooks stowed inside. It has provided me with extra place for serving family style meals. There are some issues as far as aesthetics with the corners of the doors and some of the \"dots\" that fill in to cover holes for screws falling out, but otherwise it was a worthwhile purchase.",
        "I love this thing, it's exactly what I needed. I was pretty concerned by some of the reviews when I bought this but I'm glad I didn't listen to them. It holds all of my larger pots and pans and my large crockpot. It looks great and feels sturdy. It did take some time to put together but I didn't find it overly difficult or too time consuming for what it is.",
        "Had this for 6 months now. Drawers don't come out as far as I'd like. Doors seem to randomly pop open. Easy to assemble and has a really nice finish. besides the minor annoyances this does have good storage and it works well.",
        "An excellent product. Well built with easy to understand pictograph illustrations to aid in self assembly. When properly assembled, the Dolly Madison is functional, sturdy and very decorative.",
        "Loving this kitchen cart. Wanted something for a coffee bar & it fills the bill nicely. Very impressed with the quality of the product, ample space in the drawers & cabinets. Perfect for intended purpose. Hubs put it together in a couple hours. Very pleased with this purchase",
        "I received this cart as a gift and I love it! It took my husband roughly an hour and a half to put it together and he did it with ease. This cabinet is beautiful and fits perfectly in my small kitchen. It arrived earlier than expected and there were no shipping issues. All hardware (Plus one extra of each) was included and instructions were easy to understand. Although I've only had it a week or so it is very sturdy and looks more expensive than what was paid! I would definitely recommend this purchase it is well worth the money!",
        "Love this kitchen cart! Very easy to assemble since all the pieces and screws were carefully labeled. Instruction is extremely easy to understand. Took me and my fiancé less than an hour to set it up.",
        "use it for my microwave and food storage under neath it hold alot in the space under the top. love the color ..cleans well and is sturdy..comes with wheels to clean under or move",
        "This is just the best! Almost bought one at Odd Lots. Got there and thought it to be junk. So while I was standing in Odd Lots looking at it my daughter pulled up Amazon and found this one for $50 less. When it came, she put it together while watching two babies, all by herself. It's well made and I just love it. Very spacious but doesn't take up too much room. Very Happy!",
        "The pre installation that was their was all over the place not even doors can’t close good horrible product don’t buy",
        "I like it a lot. It's super cute and holds a lot. The only thing I don't like much is if it gets water on the black portion it leaves weird white marks and I feel like it doesn't clean off perfectly.",
        "Giant chips, cracks and scratches on pieces, fresh out of box. It wasn't too difficult to assemble. Overall it looks nice but it's unfortunate that it came damaged. I'll update with a picture later.",
        "This was an easy project and the cabinet is ideal for our use as a popcorn popper cabinet. Very well made and sturdy; took a while to assemble because of all the parts but the instructions were ok and with a little thought, it was complete in about 30-40 minutes. Would highly recommend",
        "We love our cart! Took about an hour to set up. Directions were a bit confusing, but we figured it out! I would give the quality an 8/10. Works for our apartment and storing our food!",
        "Came with no directions!! Tried to call the manufacturer and was forwarded to voice mail. Unbelievable. I'll never buy another product from this company. Edit: changed to 4 stars because the cart itself is very nice. I had to download the directions from the manufactures website. Still can't believe they were not in the box. But all said and done I do love this item.",
        "We have several similar products and this is slightly less quality than the others. However, the fit and assembly was fine, the instructions are concise, and all the parts are clearly labeled, which makes it much easier to put together. The door hinges do not fit properly, requiring a bit of adjustment (with a vise and pliers) to allow the doors to close. Prior to adjusting, the hinge position put a small amount of tension on the door frame, which was stronger than the door closer magnets could handle. Each time we rolled the cart, the doors would pop open. All in all, it's an attractive, functional cart for a small amount of money.",
        "Hard to put together alone but it was beautiful once I was done.",
        "The kitchen cart is beautiful and functional, and operates good for the price. The installation was tedious because there are many parts; however, the instructions were very helpful. Keep in mind that this cart is not 100% wood, so be careful during instillation because it scratches easily. Also, make sure to follow directions, and put the cart together correctly to ensure that everything lines up well.",
        "This was crazy to assemble the doors were off by a lot my dad is a carpenter he was able to fix them overall I like it glad I brought it",
        "There were damaged parts and the doors don't shut because of sizing issues. Waiting to hear back and see if they will assist me in resolving the issues. Install was easy, just a little time consuming when you do it by yourself. Would've been faster with another person.",
        "This is completely lovely. It takes some time to put together and a piece or two had some slight denting at the edges but that doesn't subtract from the finished product which is as shown in the picture. It is completely worth the time and effort of putting it together, I'm very happy.",
        "It works well with the look of our kitchen, but the quality of fit could be a little better. The doors don't fit properly on one side of the cabinet. After tapping on the hinges with a hammer, they aligned a little better. The doors still aren't 100% straight. There is a small gap in the drawer area that I just can't eliminate. The instructions were relatively straight forward for assembly and it took just around an hour to put together. For prefab furniture, it is acceptable. I feel it is nothing to write home about. My rating would be adequate at best.",
        "Nice cart for storage. Holds multiple items easily. Assembly was tedious but fairly simple. Plan on about 2-3 hours for assembly. All parts were included and labeled. '",
        "I honestly don’t know what is so hard about using a measuring tape it to hang hinges. Whoever assembled the doors can’t tell me, as the doors were horribly misaligned out of the box and several frustrating hours of trying to re-do the hinges later I gave up and purchased new ones to avoid the hassle of returning this. Be like past me and don’t even purchase this in the first place.",
        "One edge was bit damaged. I guess it was dropped. my husband did his very best to put it together without having a good description. Also the doors are a problem to put straight and won't necessarily match with the magnets inside. so my husband improvised.. it worked out. I wouldn't purchase it again. But I like it. So 3 stars.",
        "Great kitchen island. It works perfect in my kitchen and provides sturdy storage for all my pots and pans. It took time to put together but well labeled. The only concern I would share is that I can't get the safety stoppers on the wheels to work. The island moves very easily even when they are locked. So if you have a young child at home who will be using this to stand up/stabilize on, I would proceed with caution.",
        "I received my cart pretty quickly. The assembly looked confusing at first bur was actually pretty simple. Solid cart but I'm disapointed with the manufacturer. I received three left doors and one right door in my box. I was hoping to just put it together and be done. I reached out to the manufacturer and am currently waiting for a reply.The extra time that Im spending to correct the issue is a little anoying to be honest.",
        "My instructions literally left out an entire part from the steps. I had to figure out where it went, and then disassemble several parts I had already fastened to get it in the right place. If you buy this, figure out where Part C goes before you start - you'll see it in the pictures in place.",
        "It is a good product but don't expect all to be perfect. The assembly was not complicated but was easier with 2 people and the panels all fit the pre-drilled holes. The doors however have the hinges already installed and they are not square so the doors do not line up very well. There is plenty of room in the cabinet and the shelves are adjustable for customizing the space.",
        "I found this very easy to assemble. It is my portable project cart. For anywhere I intent to work on projects- the casters are heavy duty- it looks very nice.",
        "What can you expect from something made in China! The doors did not line up or shut properly. I had to work several hours to fix the doors and put the thing together. It looks good and is somewhat sturdy, but the doors still are hard to shut. That is why I give it a 3 out of 5 stars",
        "Great piece, takes awhile to assemble but instructions and all parts weee there and fot. Finished product looks great and is durable. Drawers are somewhat narrow.",
        "Just opening this item and already a damaged section. No have to decide whether or not to go through the return hassle.",
        "We love this! Wonderful storage and great fit for our office environment. Easy to put together if you follow the directions (which we didn't but still we got it corrected!) It took a while to get but it was worth the wait.",
        "I bought this to create a coffee bar in my dining room, it was easy to put together, and it looks great. Definitely worth buying.",
        "I was surprised at how sturdy and significant this cart was! Not to mention looks great! Well worth the money. There was one small scratch on the door but not a big deal. Assembly was easy, every screw was packaged and labeled clearly. I’m very happy with the purchase!",
        "It was pretty easy to assemble with 2 people. It's sturdy and holds more than I thought it would. I also like the way it looks, it doesn't look or feel cheap (except the back panels but they're not that bad). The wheel locks don't really work but it doesn't move as long as you don't push on it too hard.",
        "Received it a day earlier than thought. Took us about 3 hours to put it together. But my husband is a pretty handy man. He did all the work and I assembled the parts. IT looks super in my kitchen because I have black and stainless appliances. GOT LOTS more storage for my pots and pans. I HIGHLY recommend it. And with my Amazon Prime I saved on shipping. THE SAME item thru Target would have cost about $68·00 in shipping. LOVE MY AMAZON PRIME. THANKS AMAZON.",
        "I was wary of this Kitchen cart because of its low price. And admittedly, there are heavy-duty alternatives that will probably be good for those interested in shelling out some money. I had a need for an item like this, looked over the options, and finally decided to risk seeking a bargain. I am very happy with the result. This is a great bargain. It is aesthetically pleasing, not overwhelmingly hard to put together (though it took some time by myself), is sturdy with perfectly operational wheels, and... it was half the price of the next best option.",
        "Although it took me 3 hours to assemble, the directions were very easy to follow. It took so long because I had to take inventory of all the parts and pieces and I was assembling in a confined space.",
        "Nice cart for our kitchen. It took about 1 hour 15 minutes to put together with my spouse. There was a small chip in the paint on one of the doors.",
        "Sturdy, nice cart. Putting it together wasn't too bad at all. I was very impressed with the heavy wood. Would recommend",
        "This is very sturdy and looks exactly as pictured. It took my boyfriend and I about 3 hours to assemble. I'm sure the directions were clear to most people, but I'm terrible with picture directions.",
        "This was the easiest thing I have ever tried to put together!! It looks professional Would I buy again most definitely. Would I recommend absolutely",
        "Great little cart/island. Doesn’t overwhelm a smaller kitchen. I added 2 more caster wheels to the bottom(center) for added strength. Haven’t had any problems with it.",
        "I thought that this would be difficult to assemble. It was quite easy. All of the pieces were labeled and most hardware already attached. All bags of screws and bolts were labeled to show where they were to be used. I would definitely recommend this product. It is very sturdy and great storage space!",
        "Love this cart. I put it together by myself and it took me about 1hr 30min. It was easy to put together and it is nice quality. The top is a nice solid piece and the cart rolls smoothly.",
        "Its a nice product. Took me 3 hrs to build. Some areas are uneven but you cant tell. Also my top drawers can't be fully pushed in. But like I said you can barley tell.",
        "This was really difficult to put together. (I had to hire a mechanic) But it was worth it! This is a lovely piece of furniture and extremely useful. You can store small items in the 2 drawers and you can fit a lot of larger items beneath in the storage space below the drawers. It is pretty good quality and sturdy. I put a microwave and a coffee maker on top and it still has room for cups. I recommend this one.",
        "I'm currently remodeling our kitchen and had to get the wife somewhere to place her spices and such. When I received this, it exceeded my expectations. It has plenty of space and the design is great. I could fix almost half my kitchen in it, but in seriousness this was a good purchase.",
        "Received this today and it was surprisingly easy to assemble, very sturdy and looks amazing. I searched for the perfect kitchen island and I found it.",
        "Still laying around in pieces after a couple of months. Not easy to assemble.",
        "great piece of furniture especially for the price! Solid wood",
        "I love how much space this kitchen cart offers. We have plenty of kitchen gadgets that fit in here to clean off counter space. Plus this gives us another work/prep station in the kitchen. The instructions were pretty easy and it didn't take too long to build. Item came protected in the mail so there were no chips in the black finish. I love it and would recommend it again.",
        "Have this in my kitchen and it was a great buy. It was easy to put together",
        "I've never put anything like this together. Every part was labeled which made it much easier. I will say at one pont I did need an extra pair of hands to help me stablize it while I screwed in parts. I didn't use the top that came with it. I bought a butcher block top from Lowe's for $90 which fit perfectly. It looks beautiful in my kitchen. I've received alot of compliments.",
        "This has been a wonderful addition to our new home. Relatively easy to assemble (provided you can follow direction) and it’s been super sturdy. We get compliments on it all the time.",
        "Fits perfect in an odd space in my kitchen where the cabinets just stop. I left the towel bars off so it would fit. Good direction and Easy to assemble, did it by myself.",
        "This is beautiful and functional. Really happy about the purchase. Everything was packaged properly so product arrived safely.",
        "Not hard to assemble; just takes time. I did it by myself with a regular screwdriver. I used my own hexagonal tool. It looks great and is sturdy.",
        "Decent quality for the price. At first I regretted not paying for the assembly, BUT it was quite easy to assemble. The instructions are easy to follow and the parts are labeled.",
        "Lots of parts. A few dents and dings as seen in the photos. Doors a little off. Nice for the price.",
        "Love LOVE love LOVE it! For the price, you can't beat it. Some of the parts might be a little difficult to screw in BUT add a lil elbow grease and ya good to go",
        "Looks and functions great but the wheels don’t lock worth the darn. It rolls around no matter the setting. Eventually ended up replacing the wheels with IKEA Capita 4” legs to keep it more stable.",
        "The wood for this unit is very heavy and sturdy and I like the look very much. However, one the the hinges to the doors is completely unusable and now the unit has a door missing. The draws were impossible to put together without a power drill. Be careful putting this together as some pieces are very heavy. Not worth 200 dollars with defective parts.",
        "Great quality, especially for the price. Mine's in a place that didn't allow for the handles to be mounted, but I can't imagine they'd break too easily. It wasn't hard to put together, but you might want a set of hands to hold it into \"box\" shape while you're bolting it... I did it alone, though.",
        "Bought it for my son. He lives in a upscale apt but it does not have much counter or storage space. This worked out perfect."
    ]
}