{
    "entity": "Mobile Storage Islands",
    "text": [
        "I was very impressed with the workmanship of this cart. Solid wood and no pieces or hardware missing. All screw and dowel holes lined up. Very well packaged. No damages. The leaves when fully out are pretty solid. Not much room in the little cupboard but I didn't buy it for storage but extra work surface for prep in my small kitchen. I'm nearly 70 and my husband only had to hold one piece in place so I could attach it. It took just over 1 1/2 hours and that included sorting the pieces out. Very pleased and well worth the money.",
        "Arrived damaged. The beam that helps hold the leaf side il had the screws ripped out of em. Alot of worn damage and dents. Guessing it wasnt new. Very hard to assemble. The instructions were clear and labeled with letters like any other item needed to assemble. But the pieces did not have any of the the actual stickers on them to label them so it was difficult to figure out what piece was what. All the screws were mixed together and some were deformed and couldn't use them for assembly. It looked so nice in pictures. But was ultimately let down.",
        "I am so impressed how solid this cart is. The wood is all solid. The 4 legs are all 1-1/2\" solid wood. The rolling casters are steel with rubber wheels (like a grocery cart). The shelving in the table top are OVER 3/4\" thick. The back is made out of the same material as the side walls (NOT CARDBOARD). Everything fit perfectly, the holes were all aligned perfect. I did not need to do anything extra for the assembly. Assembly only took 1 hour. At a standard pace. I would definitely buy this again!",
        "Arrived in one very well packed box. There are about 7 steps to the assembly; the directions are very clear; assembly only took an hour; and was a 1 person job. The only tools needed were the Allen wrench (supplied) and a Philips screwdriver (not supplied). The cart itself is very well designed and engineered, made from solid wood (no laminates). The wheels are heavy duty and 2 of them have brake locks. The leafs come preinstalled as a unit with the top which makes assembly simpler. The doors and draw are also easy to assemble and install. This is a very sturdy kitchen cart.",
        "ok, so solid beechwood body apparently means composite stock walls and drawer bottom. otherwise a solid piece though there were several places the wood was damaged. to note: i was able to install two lid racks to the back of the unit to increase storage space. if you have a small kitchen like me, this could be a force multiplier. .. small when i'm not using it and big when i need a larger area to work with besides my countertop. innuendo unintended.... ironic'd.",
        "wonderful addition to my small kitchen! It is sturdy, and very handy. I love the fact that I can have more work area with the drop leaves on both sides. The extra storage is awesome as I use it for my pans and bowls I use the most each time I cook. Having a drawer too, I keep my cutting boards in there so they are ready to go. Assembly wasn’t bad, my husband and I had it together in about an hour. It fits in our kitchen and gives me the space I needed to prep. Great piece.",
        "We bought this cart to have a place for our InstaPot/Air fryer, and all the pieces that go with it. This gives us a sturdy work surface that can be wheeled out for use and stowed in the corner after. This cart is a quality piece of furniture, mostly real solid wood, except for the cabinet back and sides, but even those are thicker and more durable than most boxed furniture. Took about an hour for two people to put together. I highly recommend this cart and you can't beat the price.",
        "I absolutely LOVE this cart! I have an extremely small kitchen with one small counter, so I had been looking at different carts for some time now. I read so many reviews on other carts and finally decided on this one. I chose it because of the real wood, real wheels (not plastic), and the folding sides. I could not be more pleased! The height is perfect, the length is perfect, plenty of room in the cabinet and drawer. Easy to put together but heavy. I would highly recommend buying this!",
        "Very impressed with ease of assembly. I used Allen head drill instead of wrench provided. Product is larger than picture with ample storage and great additional drop-leaves that add a ton of work area to our kitchen! Sturdy with wheels that lock. Bargain price. Super fast delivery.",
        "For the price, this is an excellent cart. The top depth is 20\" which is deeper than most cars that tap out at 15\". Its mostly wood with fiberboard for the drawer bottom and back/sides of the storage area. You most likely will need a second pair of hands to put the top board of the storage hut. The cons are not all boards are labeled so you have to really look at the parts list carefully. The screws and other hardware are easily distinguishable. Only tools you need it a hammer and Phillip's screwdriver.",
        "Awesome once assembled, but was a BEAR to assemble. Small changes in design would have made it even stronger and easier to assemble. Why the sides and back couldn’t have been individually secured so as to make each side easy to finish baffles me. Having said that, I am happy now that it’s finished (even if I could have finished two and a half swear jars full of coins while assembling it).",
        "This is one of the best flat pack items I've ever bought. The packaging was sturdy (even had corner padding); every hole lined up; every part was present; and the assembly instructions were very good. I needed help holding panels during part of the assembly, but most of it was a one person job. The cart is solidly built and the large wheels make moving it around very easy. The drop leaves are sturdy when extended and the size is exactly as advertised. I would definitely purchase this item again if I needed more than one of them.",
        "Product arrived yesterday in perfect condition. It took my wife & I about 2.5 hours to assemble. We are in our 70s. A second person is very helpful & probably necessary (Recommended in the directions.) for most people. The directions (Pictures are worth 1000 words.) were perfectly clear. I used a T25 screw driver bit as well as the provided Allen wrench. I lubricated the screws with dish soap & hand no problems with rounding out the screw heads. It does take a very firm, strong grip to install the screws. If you have no experience with self-assembly or simply not a handy-type individual, I recommend finding a family/friend who is qualified to help you.",
        "This took about two hours to put together including unpacking, reading instructions and just doing it. Nothing was missing. Every piece fit together very well, although there's one awkward step wherein a piece kind of hangs so I propped it up while screwing it together and until the next step was done and held it together better. Its heavier than I imagined so the very sturdy wheels are a must. Very useful in the kitchen of my 1890 home. the price is good despite the time to put it together because of the quality",
        "We bought this Cart to replace the old one in the Kitchen. It was very easy to put together. All the parts were there and all the holes were drilled properly. The door handles are high quality. Even better than Amerock. The transportation wheels are heavy duty ones that should be able to stand the test of time. The Cart is all wood which was a pleasant surprise. All in all a great cart that looks good in the Kitchen and should last a long time.",
        "The box was very damaged when it arrived - fortunately there were only 2 minor breaks and a little wood glue worked. There was a small chunk out of the board that is the drawer bottom. The instructions were clear (if you ever put together an IKEA item you will not have a problem). This was put together by a 67 year old woman by herself! Once the cabinet was together it is very nice and sturdy. It would be nice if there were side bars like the back - so when moving the cabinet items do not fall off the middle shelf. Very pleased with this item.",
        "This is a great little cart! I bought it knowing I would be taking the drop leafs off of it and painting it to fit my space. I had an awkward, unusable corner/wall in my kitchen and needed to retrofit some cabinets and countertops for more functionality. This cart is very sturdy and well made. I used it as an island, as it came, with the leafs for about a week before I got around to altering it to fit my space and it worked great for that too!",
        "Notice that I have virtually no counter space behind the cart. You can wheel the cart over to the refrigerator and load on the items you need and then wheel it back to your working place of choice. In my case, I like the kitchen sink to my back and a garbage can handy. It makes all the difference in the world in a small kitchen.",
        "This cart met every expectation as to quality, usefulness and storage capacity. We bought it for our new (to us) travel trailer which lacked counter and prep space. The fact that it stores securely for travel having large rolling wheels, 2 of which are lockable, is a bonus. My husband says the assembly instructions were clear and all of the pre-drilled holes perfect.",
        "Wasn't as hard to put together as some of the reviews said. Great cart, sturdy, well made and most of all solid wood. Drawer opens and closes perfectly. Storage underneath is just what I was looking for",
        "I would buy again. Very nice finish and perfect for small kitchen. Love the folding side extensions. Took two of us to put together so one could hold parts in place while other inserted pieces and screwed together. Easy instructions that were photos with parts marked. Took us under two hours. Would have given a 5 but I never give 5's",
        "to put this together. It takes two people and lots of patience. Two of my boards had small dents in them right out of the box. The instructions are just pictures. It is sturdy and does do the job we bought it for. Beware that it is in a long box that weighs 67 pounds. It took my husband and a neighbor to get it up the stairs to our apartment. It is safe from porch pirates.",
        "The cart is sturdy and well designed. The instructions say that it takes two people to assemble, but one person can do it. It is all wood, save some possible non-wood veneer on some of the cabinet sides, but no big deal. My package arrived with two damaged pieces, but it was easy to get them replaced through the manufacturer. Strongly recommended!",
        "I have a small kitchen and no space, but this fits perfectly. It has a small cabinet, but, it’s enough to fit my large slow cooker, a rice cooker, and a few shaker cups. The center shelf fits my pizza stone, cutting board and George Foreman grill, and the top shelf fits my large spice rack, with plenty of room for my cookbooks and other items. Looks great too!",
        "I love this little cabinet.... the quality far exceeds the price and the sturdiness is far better than most you buy at a higher price. Husband put it together with precise clear instructions and kept saying WOW this is made so well. I would recommend this to anyone looking for a nice work space and for extra storage. Love it!",
        "Bought this because I moved into an apartment with no storage or counter space. Use a standard screw gun to put it together in about 30 minutes by myself. Solid piece of furniture. I suggest getting some wood wax, to put on the drawer glides, for smother operation",
        "The product itself, perfect for my needs. The issue though was it arrived with a crack across the entire leaf. If you note the pictures, you will see that the crack is due to one of the screws that attached the frame assembly to the leave. Since this part of the product comes pre-assembled I can only conclude that whoever attached that part torqued the screw down to tight and cracked the wood. The fact that it was sent in this condition is most disappointing.",
        "My wife and I recently moved and our new kitchen has less cabinet space than our previous house. We purchased this with hopes of adding a little extra storage, and we haven't been disappointed. It took me about 45 minutes to an hour to assemble, and I'm very impressed by the fit and finish. The unit seems very sturdy, as well.",
        "If you have some DIY skills, this unit is well worth the price. We’ve set ours up as a coffee station in the kitchen. So nice to have something made in the USA and not real wood, not mdf. The two drop leaves are well supported, no sag. Casters are good ones as well. VERY happy with our purchase!",
        "I love the product and not too hard to assemble however the screw that inserts into the door I received 3 1/2 not 4. So what do I do now. I am gonna contact company to send me a new part. HOWEVER, I notified the company of the issue and within 12 hours the responding and the part is on its way. What wonderful customer service.",
        "I love that you can drop or put up the sides so it fits pretty much any where. This is the second one I have gotten so now I have 2 for my kitchen. I love how I can add extra counter space while I cook then drop the sides to store in my small kitchen. And easily move around on the wheels so I can move it even into the dining room if needed.",
        "This is a very sturdy cart! My daughter and son-in-law put it together for me and my son-in-law kept repeating how solid and sturdy it was and he's a carpenter. My daughter wanted to know how much it cost and they were both impressed. The quality is top notch. If something is wrong with yours, contact Amazon or the manufacturer ASAP because you just got a bad one. I love the fact that I can roll it where I need it and then lock the wheels so it doesn't roll on me while preparing meals.",
        "This is the perfect little cart for my aunt in her senior living apartment. Providing her additional counter space plus storage, she is thrilled with how it solved several problems at once! A leaf was cracked upon delivery but thanks to Amazon's messaging service, the company replaced it (just the damaged part) immediately. So thankful we didn't have to disassemble the whole cart and return it, then reassemble a new one.",
        "Packed well. No missing or damaged parts. Easy assembly. Good instructions. All wood. Beautiful wood, IMO. No cardboard or particle board. Sturdy. Drop leaf design is efficient. Heavy duty casters. Not perfect but a real bargain. I am 73 and assembled it by myself. Yes, 2 people would be better.",
        "I was pleasantly surprised when I laid out all the pieces and everything was solid wood. No crappy glued up pieces. The drawer has nice grooves in it to hold the bottom piece. Hardware is nice and strong. Here's the best part, REAL CASTERS! You would never think that having real casters would make someone so happy. The casters are durable, lubricated casters with rubber wheels. Its was very easy to assemble with clear and easy to follow directions. The one thing I'd suggest is to use your own allen wrench that is a little longer. The wrench would rub against certain parts when assembling, but not enough to be too concerned over. Overall, very happy.",
        "Instructions for assembly were adequate. Had to loosen two screws to allow side panels slack to slip in as are shown installed after screws were to be tightened other than that seems well made . Everything links up perfectly. I did apply touch of wood glue on dowels and in panel slots prior to tightening screws which pull sides together. Just a habit . Clear silicone would work as well but I like glue. Solid, square and well finished for the price.",
        "Very nice...Item as described...Is sturdy and has a good appearance...Until you get to ASSEMBLY.. then it will test your patience, ingenuity, and your faith. Very nicely designed and engineered..but VERY MANY UNSUPPLIED TOOLS ARE REQUIRED...i.e. a T handle allen wrench, long woodshop clamps, or straps to hold it together during assembly....which could take a very long time !...... and the average person would really need two people to assemble. Assembly woodscrews are made of very soft metal and strip out very easily. If you can buy it assembled, at a fair price....DO IT !! ............THIS IS NOT A QUICK ASSEMBLY JOB!! .",
        "I was very nervous ordering a table that I would have to put together. I was very, very happy with this product. Excellent quality, very firm and it was pretty easy to put together. It is very sturdy, I could sit on it. I have had one for a year and just ordered another.",
        "Box arrived dirty and torn, but contents were fine. Well designed and very solid, and heavy. The only issue is that the instructions should have made it more obvious the way you assemble the main pieces that surround the drawer. It''s too easy to do them backwards. It all works fine, but now the tab that keeps the drawer from being pulled out too far is on the wrong side. I didn't want to reserve assemble and put it back together. It also takes some finessing at one stage to get all the pieces and slots to line up. Very nice and substantial though. Should last many years",
        "I am impressed with the construction of materials and how well they line up. My husband is good at figuring out assembly items. He usually has to fix things so they work as intended, but this cart was perfect. Unusual these days. He uses it as a puzzle cart.",
        "This is one of the best investments ever. I was easy to put together, it is very sturdy and very attractive. I had bought this monster of a microwave which had take up most of my counter space in my kitchen and I hated it. It was a perfect fit on this cart and the drop leaf sides are perfect for placing utensils and plates when cooking. Great price for a great product!",
        "We bought this to use as both a storage location and a cooktop for the Cuisinart Griddler Elite. We have had the cart over a year and store it on our covered patio, protected in winter by a plastic covering. It is a beautiful, solid, very functional piece of furniture. My husband and I put it together with no problem. The interior is just the right size for the Griddler, and with the wings of the cart up, it makes a perfect work surface for cooking with the Griddler. It is a good value for the money, and we couldn't be happier!",
        "Was expecting this to be all particle board and kind of flimsy. Was pleasantly surprised, its all made of real wood and seems really sturdy. Takes about 30-45 minutes to setup and works great. 100% would buy again.",
        "This is a great cart! It's solidly built and is very handy. Assembly was straight forward. It fit perfect into this small space we have and since it has leaves, it gives us even more cooking surface when we pull it out. The only reason I gave it 4 stars is because the drawer is really rough going in and out. It makes it a little less useful (I opted not to use this as a silverware drawer for this reason). Would definitely recommend.",
        "Even though the wood for this cart is beautiful, solid ,heavy wood, I am a bit cautious after assembly due to construction design. It is a beautiful piece, but I feel it should be a tad more sturdy. I am thinking I might get some wood glue and make sure it stays together. It also wasn't easy putting it together solo, they do recommend 2 people for assembly, but that wasn't an option for me.",
        "I LOVE how this has leafs - we have a smaller kitchen that really does not allow extension of the counter-top without interfering with the dinning area or feeling boxed in... needs a remodel, person who did this was ridiculous. Pretty good quality and will stand up to use for the years to come. Nothing fancy. Easy / simple to put together. I would replace the hardware - personal preference, looks sorta cheap / tacty. I might down the road stain this - the wood would stand up to it, which I was questioning. This is the perfect height, easy to move around as well as lock in place. Definitely, exactly, what we were looking for, for sure!",
        "As we all know u can’t get six stars or would. Don’t know if a mistake or not but it was all solid wood and thick no pressed composites or Junk. Rock solid no cam locks - screws and dowels. My only fix was the top draw stop hanging down in draw keeps from filling it. Being a carpenter took it out and made a new one fast and easy on both sides. Put 11 kits together since sept till Xmas by far the best built and constructed. Loved it - for my mom should have keep it for myself 😞 😞",
        "3-Star not for design or appearance... But when it says \"Used-Very Good Small cosmetic imperfection on top, front or sides of item.\" The first 2 pictures matched the description... but the last 2 pictures are damaged broken product. Not simply an imperfection. Disappointed in condition of the product for the price and description given.",
        "I’ve been on bit of a buying spree after a recent move. This cart is right at the top of the list of best value purchases I’ve made. The packaging was excellent. Assembly was done solo and I had no problems. In addition to being very sturdy and well made, this cart is also efficient space wise. I could go on and on, but the short of it is if you are looking for a kitchen cart of this type, IMO you will find nothing comparable from a value standpoint.",
        "This kitchen cart is perfect. I was shocked at how sturdy and heavy the wood was. I expected IKEA grade particle wood. Locking casters and storage space are great. I use this with my meat smoker and it holds all the accessories and wood pellets, and allows me to easily wheel it all in and out of the garage.",
        "good looking, well built...wished they came in white as well",
        "This cart is one of the best pieces I have ever encountered. All wood, not pressed garbage. So well made, all parts present, all holes line up, nothing missing. Very sturdy & nice looking too. I recommend this cart to the max!!",
        "High quality, useful cart. We use it in our camper for extra counter space. Sides fold down to save space when not in use. Great value for the price. In fact, we were so impressed, we feel it's the best deal on Amazon.com.",
        "Movability, compactness, sturdy construction and simple and practical design. Make a small kitchen larger and gives extra room for kitchen necessities in a drawer and cupboard. The ease of movement gives the cart an extra space when needed when working in a small area. Excellent natural wood finish gives a luxurious appearance in an established Formica built kitchen.",
        "Went together well, nice tight fit. Haven't used it enough to comment on durability but seems very solid. I needed a small mobile cart like this for my small kitchen and it fits my needs. I like the extra cabinet space and the folding extensions on both ends. Nice design for raising and lowering the extensions and in the raised position they are sturdy. I'm glad I chose this model.",
        "Bought this for our RV to extend kitchen cooking space. We removed the washer/drier unit in the RV and this cart now fits perfectly in that space. The locking casters keep it from moving during travel. Super happy!",
        "This is a solid piece of furniture. Fairly easy to assemble. Looks great and has decent storage capacity. I especially like the extendable side leaves that can be used as needed.",
        "Product is well-designed and generally sturdy, but the top was cracked in manufacturing process. They tried to cover with glue or resin. Trying to get in contact for replacement part.",
        "I highly recommend this kitchen cart. I gave it five stars because the wood is high quality and for a number of other reasons like it was very easy to assemble, the instructions were easy to follow, all the parts and hardware came in excellent condition. It is really sturdy and a beautiful addition to my kitchen. Love it!",
        "Mildly surprised! This cart is all wood except side and back panels of laminate. The laminate panels are a little off in color but not too noticeable. Actually using this as a laundry cart. Storage space is quite adequate underneath and drawer is wide and deep with a lock-in mechanism so it will not fall out. Fairly easy to put together with 2 people ,instructions were good. Watching movie while assembling so took about 1.5 hours. Worth the money spent . Love the drop leaves, very convenient for folding laundry , but would be great in the kitchen with 2 stools for extra eating space.",
        "Losing counter and storage space, needed a solution. Cart is right height to underside counter top and color to oak floor. Laid out unit by grain to build and GORIILA glued all mating/joint construction. You will have to really torque screws to bottom the heads for sturdy construction. Drawer stop can be positioned to miss items and bottom not as thick as cart sides bit glued in place makes it stronger. Leaf stops are different, but have successfully supported coffee makers, toaster and machines for months. Had misgivings about wheels, but all I hear is nice cart and great wheels. Assembled glued correctly it is 5 stars.",
        "Locking wheels!!! Be SURE to tighten ALL Connectors... and do it again before adding the decorative PLUGS... Or you'll have to unplug to tighten later... So versatile!",
        "The instructions make it look harder to assemble than it is. It does require 2 people to complete. I was amazed how STURDY and Solid it is. Solid wood, highly recommended.",
        "I purchased this as I moved to a smaller space. The kitchen needed a little extra counter workspace and this fit the space. The extra leafs are perfect. I put it together with the Allen wrench that was provided and a Phillips screwdriver. Lots of parts but so very well packaged and the wood parts were carefully protected. This is solid wood - probably beech-wood or other hard wood. The finish is well detailed, no rough edges. I especially like that the two front wheels lock. It is solid and a really good value.",
        "I am very happy with this cabinet it's exactly what I was looking for its sturdy heavy duty wheels easy for me to assemble except I needed my own tools the provided one is very cheap and stripped on the second screw",
        "I made sure to read reviews, as I always do before purchasing items off of Amazon, before I made the decision to buy this kitchen cart. This was super easy to assemble, did it in about an hour. It is super sturdy. Did not come with any damages. The storage is great. The apartment I live in has very limited counter space so this is the perfect addition. So happy I bought this!!",
        "I bought this for my 84 year old mom. The cart is stable enough for her to push it around the kitchen and the wheels lock so she can use it to chop up food or as a cart to move dinner from the oven to the kitchen table. She is very happy with it becuase it doesn't take up much space and the leaves provide added flat surface to work on. Assembly is a bit complicated and my husband had to put it together but that is ok, the cart is quite solid. We also used wood glue for all the joints just as extra reinforcement as my mom leans on the cart for support when she uses it.",
        "I use this in my pantry/laundry room. While I have lots of shelves, I needed a place for folding clothes. When not in use, the leaves are lowered, and the cart moves easily to where ever I need it. It's very sturdy, well made, and (mostly) all wood. It's a very nice cart for the price.",
        "This cart is great and really serves the purpose. I needed some food preparation space and this adds nearly 4 feet of usable space without taking up too much when put away. I was particularly impressed that it is nearly all solid wood. I've assembled so many pressed wood cabinets lately that this came as a surprise. The wheels roll well over berber carpeting, making it easy to store when not in use. Assembly was pretty simple, although I did put the top on backwards and had to swap it so the drawer stop would work. This is very sturdy and I expect it to last.",
        "Not as light as pictured. Has a slightly darker note to it. Not a deal breaker. Also, the lack of material stickers, telling you what part goes where was slightly obnoxious",
        "This was much nicer than I expected. I was able to assemble it myself even though I am a 70 year old lady. It would have helped if all the pieces were numbered. It seems very sturdy and is a nice height.",
        "We were needing a small, sturdy cart for an appliance. We also wanted one that had some storage space. This cart was the perfect size and was easily put together. After several weeks of use, we are very happy with our purchase.",
        "It took me almost 2 hours to assemble by myself which I thought wasn't too bad. It looks like it should hold up very well and looks nice for the money.",
        "Works perfectly for what I needed. I needed a sturdy work space for my kitchenaide mixer that would fit in a small area of my kitchen. I love the drop-leaf feature, it gives me extra work space when I need it, but is not in the way when I don't. This is a good quality product. The only reason I didn't give it 5 stars is because the assembly directions are not real helpful, only two of the pieces were labled.. Luckily my husband is very good at assembling things, and it took him about an hour.",
        "I was concerned when purchasing this unit based on other reviews. I had no damage to the packaging and product. I was not missing any parts nor was anything damaged in transit. I am a 60 year old man and was able to assemble the product without assistance. The instructions were weak, as only pictures were given (no written directions), however, I did not have any major problems figuring it out. The cart is very sturdy and the wheels are of high quality. I am overall very pleased with the appearance and functionality of this cart.",
        "Great little cart. Purchased this for the mother in law for Christmas and she loves it. I put it together in about 25-30 minutes with no issues at all. Instructions were fine and easy enough to follow. The tools provided aren't ideal so if you have your own the set will go quicker. I would say quality is on par or a little better for similar carts for the price. No real complaints here. Packaging was fine and didn't encounter any of the issues with damaged shipping that others did.",
        "By far the best 'put it together yoursef\" item i have purchased in a long time. At that price and quality I didn't mind spending one hour putting it together. It's almost all wood, not laminated pressed junk. The screws tighten up since they are going into wood. I read one comment complaining that the price was too high for the quality! Idiotic comment. The hardware is of surprisingly good quality as is the towel rack. Everything fitted well and even the instruction were understandable.",
        "Really like this cart. It was easy to assemble, and has good storage. Like that I can roll it around and have a extra work area if needed.",
        "It came very well packaged, easy to put together, all pre drilled holes lined up, excellent hard, solid wood. Very beautiful and strong. No veneers, all wood construction. Drop leaf mechanism very sturdy. Very good wheels. nice hardware, not junk!! Will recommend to friends. Worth every penny and would buy again.",
        "Love this cabinet. Holds a microwave and can be extended for extra space when needed. Storage drawer and cabinet are nice. Very sturdy.",
        "Not too difficult to assemble. I'm a single woman and I assembled myself- I just needed to perch one of the shelves on a stool to tighten the screws, other than that it's a one person assembly. Great product made of real solid wood. Looks great in the kitchen!",
        "Received item on Friday afternoon. After looking at the instructions and making sure all parts were accounted for. Started putting cart together. Assembly time was about 1.5 hours. Everything went together very easy. Cart is heavy duty and it look great. Wife is happy. Very pleased with my purchase. Buy it you will not be disappointed.",
        "This is a great little cart. It fits perfectly in my new kitchen. However, the directions are somewhat lacking. My husband and I have put together alot of stuff thankfully, but a few things to keep in mind. When you first start, make sure the little drawer stop faces the front. We didn't and had to add one later. Also, even though there are letters on the directions, there are none on the parts. Just take it slow and you shold be good to go. Make sure you put the two casters with breaks diagonal from each other so you can lock the cart in place. Overall, I would recomend it.",
        "I sent this back. Q & A said it was solid wood and plywood (which would have been acceptable) - but the 3 side panels are fiberboard with fake wood printed paper over it. They don't match the wood well and it makes it look cheap. If it weren't for that I would have kept it bc it seemed solid and I liked the overall look. If the particle board wouldn't bother you would have a nice cart.",
        "Very sturdy table and very high quality. We just moved to a new home and have been assembling several pieces of furniture (not much fun). This is the best quality of all of them. Real wood and very good looking. I like the storage and shelf underneath. We have a toasted oven and microwave stacked on top to give me more counter space in a very tiny kitchen. Great purchase. Highly recommend.",
        "I've been on Amazon 10 plus years and have only written 2 reviews - both one star, very harsh. However I'm giving this little kitchen cart 5 stars. I received about 3 emails from the company over the last two weeks asking how it was going, was I happy with the product. I replied I was waiting for my guy to assemble. Well that finally happened today and it looks adorable. No scratches, took my handyman an hour and a half to put together. I was busy in the kitchen but didn't hear any groans, sighs or profanity so I guess it was pretty straightforward. Came with instructions.",
        "This is a very nice cart. I was impressed with the quality of the materials, as well as the fit and finish. Assembly was fairly easy. The instructions say one step needs two people, basically, one to hold the shelf up, and one to screw it in, but I rested the shelf on some cardboard from the box and was able to do it all alone. Overall, this cart is as good as anything from a fancy furniture store, but at half the price.",
        "This cart is super sturdy. The wood is solid and it just looks and is of very high quality. It is a little shorter than I was expecting. That's my fault for not checking the measurements, however it's still high enough for me to use as counter space when cooking. I very highly recommend this cart. Just be patient when you assemble it as it is a little tricky to put together.",
        "I have put together a lot of furniture over the years, I was extremely pleased with this unit the fit and finish was impeccable, All the predrilled holes lined up perfectly and the hardware supplied was top notch. Honestly, for the money this is a steal if you didn't know it when assembled it looks like it could have been delivered by a furniture store already together.",
        "I absolutely love ❤️ it! It works perfectly in my kitchen/ dining room. All the room in it allows me to store the appliances and clear my countertops. I would highly recommend this cabinet .",
        "There was a pretty substantial crack in the the bottom shelf when it arrived in UNDAMAGED packaging--couldn't blame this one on the carrier. Otherwise, I would have easily given this cart 5 stars. The crack doesn't show or affect the function (it is where it meets up with the back panel), so I am keeping it rather than dealing with the hassle of exchanging it. It is sturdy, attractive, well-made and had a great price tag! Despite the crack, I would try another Winsome piece if I was in the market (and may be doing just that very soon).",
        "I love this thing!!! I always hated folding laundry on the kitchen table, or on the bed. I got this for my laundry room. It has enough room for folding, storage space underneath, and I can fold the ends down when I don't need the full table. It was easy to put together too, took about 30 minutes.",
        "Using the cart to hold audio equipment. Good size for that - and very sturdy. And good design for our needs. It took about 1.5 hours to assemble. Drop leafs are easy to raise and lower. Drawer slides easily and aligns well when closing. I added bumpers to drawer for a quiet close. Overall - very pleased with the cart.",
        "This unit is a wonderfully made piece of furniture, good looking, locking wheels and gave me the extra room I needed in my studio kitchen. Assembly takes time but if you take your time, set out the pieces and follow directions, you will have no problem. I highly recommend this cart.",
        "Whenever I’m down and need to cook something in my small kitchen... it’s there for me. It expand and give me more then I ask.",
        "Looks great in the kitchen, easy to put together and nice it can be moved around to clean under it.",
        "If this is the new standard for products made in Thailand then watch out America! I purchased this cart for my wife to use for cooking those food items that can really smell up the house. She can just roll the cart out on the patio and presto good food without the smell. I didn't really think that for the price that the cart would be of very good quality, but I was shocked and in awe of the quality of the materials and ease of the assembly. Had I known that the quality was that high I would have been willing to pay twice the price.",
        "All the pieces fit together very well. It makes a very sturdy cart. Turned out to be exactly what we needed in the kitchen.",
        "My husband swore this would not be useful. \"Too small!\" he swore. But it's just right. I put some bowls that tend to get lost at the back of my other cupboards in the bottom, a pretty salad bowl on the open shelf (just grab and fill), and a fruit bowl on top. It's a lovely addition to the kitchen and I have fantasies of taking it to the dining room when I give a big dinner so I can open it up and place the serving dishes on it--serving dishes I never find enough room for on the table. This is a great addition!",
        "Horrible product. Cheaply made with screws that DONOT fit. Holes that are pre drilled that don’t go deep enough. I screwed the legs in as tight as I possible can just before the crews started stripping because I couldn’t twist any tighter and the legs are wobbling around like crazy. Absolutely insane. I have never had a do it yourself product come out so unsturdy. I will be returning and will never buy another piece from this manufacturer again. HORRIBLE"
    ]
}