{
    "entity": "Satellite Radio",
    "text": [
        "I had one of these installed in my car as part of a kit back in 2009. It worked well right up until 2014 and it started giving me all kinds of problems. Traced it to the tuner. Also, there don't seem to be too many accessories around for this tuner, great concept, but didn't seem to keep market interest. I transferred my service to a portable XM radio and that's doing just fine.",
        "This product is perfect for my car and home...even for my another car.I'm using this for my Kenwood head unit with the KCA-XM100V and its awesome! Then i boutgh this XM Mini tuner home dock for my living room. Now, i don't have to subscribe two subscription. All i have to do is take with me the tuner after driving and plug it to my home dock connected to my reciever and i have XM to my living room. I'm planning to buy another home dock so i can install it to my work, XM while working.All i need is the compatible dock for this mini tuner and i can have XM anywhere i want.",
        "I purchased this little unit for a Polk I-Sonic. I'm already an XM subscriber and can be activated online. Is about the size of 2 quarters put together. The home docking station is required to use this unit and can be purchased seperately. This tuner can be moved receiver to another receiver that is XM ready. I believe this unit will work in automotive applications as well. The XM Mini Tuner is a must!",
        "This tiny device is an actual radio tuner. I put it it the home dock. Hooked it up to my XM ready receiver.Registered on line, and in just a few minutes was listening to XM radio. The sound quality of satellite radio is amazing and the variety of programmming can't be beat. The magic of the Mini Tuner is as eguipment becomes avialable you will be able to carry your one subscription to your car , office , and back home again. This is a win win situation!",
        "This is just what the Dr ordered! Replacement cartridge, which was marketed as used but was actually brand new, fixed my XM radio system back to perfect!",
        "The XM Mini Tuner is a great product if you have a compatible device to plug into it. It can also be moved between compatible devices too.",
        "came brand new in package. was simple and easy to install. Glad i avoided having to deal with sirius/xm directly.",
        "I am not technically savvy but this works and was easy for me to hook up. I had an HD ready receiver so I needed this with antenna.",
        "The XM mini-tuner and Home Dock works perfectly with my Sony satellite-ready boombox. Shortly after signing up for a subscription with XM, I was receiving the 170+ channels clearly. I love listening to satellite radio in my home with this easy, portable system.",
        "Received the XM mini-tuner in a timely manner, hooked it up to my in-home receiver and I was able to receive XM radio in the home immediately.",
        "The new one worked fine but unfortunately I had to buy it to replace the one I had that went bad after 3 years of use.",
        "This is what my radio needed to work again! I'm so happy to have it working.",
        "The product is exactly what I ordered and 100% worth the time spent to purchase my item. Very happy with the overall outcome of my dealings.",
        "This product seems to have a shelf-life. My last one worked for 2 years and then quit on me for no apparent reason. I bought one from Satellite Radio Superstore in May of 2018 and it never worked. SiriusXM told me the product is no longer supported and that I would have to buy a new XM tuner to get XM on my home stereo.",
        "The only negative to this product is that the signal strength for this unit seems to be less than the original home docking station I had even with the antenna placed in the identical location.",
        "Put together with an outdoor antenna. XM never drops out. Works well with my Pioneer reciever. Perfect add on to the new XM ready recievers",
        "the part i ordered fixed the problem with an existing sat radio setup. FORTUNATELY IT WAS IN STOCK AND THE RIGHT PART NUMBER.",
        "I needed an XM tuner for the house reciever,went on Amazon to look for one and found it in less than five minutes.Great product ,fast shipping.Will go back again in the future for other devices I need.",
        "This XM Mini is a wonderful device and works wonderfully. I have great sound and never have had any problems. This is a great buy.",
        "Nothing wrong with this product, does what its supposed to!",
        "The Mini Tunner couldn't be refreshed over the internet. Had to call and stay on hold with XM for about twenty minutes Once it was on, it worked fine",
        "I purchased the XM home docking kit and tuner under the impression I could use the tuner in a portable device as well as with my home stereo system. It turns out that most, if not all, of the portable devices out there already have a built in tuner and come with a home docking station. Therefore it only makes sense to purchase the home docking kit and tuner if you don't plan on buying a portable receiver. Luckily Amazon customer service is awesome and they are taking the device back. Thanks Amazon, great as always!",
        "This product worked as promised. It plugged directly into my reciever. Displayed all of the relevent information. It got excellent reception. No need to place the antenna in the window.",
        "i use this tuner with my Onkyo receiver. Its easier than attaching a inno though RCA."
    ]
}