{
    "entity": "Satellite Radio",
    "text": [
        "It worked quite well in car and in house connected to amplified speakers. Not really outdoors. In general, I haven't lived anywhere that satellite radio had a strong enough signal indoors. I did have an outdoors antenna by my pool for a while. That worked well, at that address. Th stiletto worked well an alcoholic friend put it into her cup of vodka. That was the end.",
        "One of my first models, and works great. Happy camper.",
        "I didn't like anything about this product because it was incomplete. I couldn't turn the item on because it did not have a battery to charge the Stiletto up. Plus, other items missing: ear buds, antenna headphones, ac adapter and USB cable.",
        "I have had many different sirius receivers over the years, (actually since conception of the satellite radio), and this is by far the best receiver made to date. I have had numerous occassions that I wanted to listen to a program, but had to be away from my truck so I could not listen to it, but with this receiver, you press only one button and you are recording the program for future listening pleasure. Great receiver for any use.",
        "The Sirius Stiletto SL100 is totally useless unless you have a fast 802.11b connection from the Internet. Otherwise you can forget getting a decent reception inside your house or office. It is also not able to record off of the internet connection! You have to have a satellite connection to do that or even go to your favorite stored stations! Remember,802.11b is the only WiFi that works with this unit! Not 802.11g,802.11e or any future WiFi signal! I took it to work but could not get it to connect to our WiFi connection because they only use 802.11g.",
        "I have owned this device for a while and love it so far. I have not encountered any issues with it yet. I have a friend who was having issues, but a software update took care of them. The recording feature works great and there is plenty of storage. One thing I would like improved is the size of the Sports Alerts/Updates. When the scores show up, they are too small to see.",
        "This is a wonder raido. I live in Cali. among the desert and I still get reception. Only thing I didnt like is that they claim it;s commerical free. There plenty of commericals. I like the comedy station. It weird the first time you hear forbidin cuss word over the air. They even have a play boy channel. My husband paid for the \"forever package\". About 400$.",
        "Bought this 13 years ago and it's still going strong. Move it between vehicles all the time--no problem.",
        "My son has the Sirius Satellite Radio in his home and has subscribed for some time now. He requested the portable Stiletto for travel and loves it. It came new as promised. The only issue we had was the \"extra radio\" usage fee (monthly). We assumed this would tack onto the subscription he already had - not so. It's not a large amount, but an extra we hadn't planned for.",
        "The Sirius Stiletto is an amazing product. I listen to Howard Stern and cannot always listen to the whole show. I am able to record it when I wake up, listen on my way to work and record the rest of the program when I arrive to work. always have new Stern to listen to even when he is on vacation. The love button instantly stores any song or show on Sirius for listening again and again. Can listen anywhere either live or from recordings. I flew last week and had new episodes to listen to for the whole flight. A great MP3 player as well.",
        "I just got my Sirius Stiletto SL100. I am a big fan of Sirius, especially Howard Stern. I can now listen when out walking the dog. I have no problems with reception using the Antenna Headphones. When I'm at home I just switch over to the WI-FI connection in my house and continue to enjoy because I don't have any Satellite reception in my Apartment. Bababooey to you all!",
        "This is a nice upgrade from our previous receiver. Nice clear easily readable color display. Good reception. Nice portability but a little heavy. Reasonable reception while using it in the portable mode. Battery life is good. More presets that are easier to program",
        "I needed a replacement as the company no longer makes this item and was glad to find the radio on line. I received the item in short order and it was as described. I am very sastified.",
        "The radio receiver arrived quickly and in perfect condition. We are very happy witht he quality of the product, the price and the service. Definately a winner!",
        "I read a lot of good things about this portable SIRIUS radio and ended up returning it. After reading the manual, it turns out that it gets horrible reception unless you are wearing the antenna headset that comes with it. The headset is big and bulky. Also, with the mp3 player, it is very difficult to seperate out a single track. You have to load the entire CD.",
        "This product is great except for the fact it does not receive a signal inside your house which keeps you from ever listening to it while inside. Also, it is not compatible with an outside antenna or a \"repeater\" system sold by Sirius. It is portable but has weak reception!",
        "I bought my Stiletto about a month ago and haven't had a single problem with it. I love that you can walk around with it and record 100 hrs of programing. The navigation is very easy, the programming is easy. If you are thinking about getting an Ipod - I would get the Stiletto instead - it is way better!@",
        "as low as a rating I can give it. Buy a Walkman, or I-pod. The reception on this sucks, it is REALLY bad. Read the blogs on the unit BEFORE you purchase on.",
        "The Stiletto SL100 was what I expected but the batteries have very short life.",
        "Stiletto does not work in mobile mode with antennae headphones connected. Sirius satellite does work in docking mode in either home, or car. Assume higher 12 volt docked antennae system, and the 5 volt headphone antennae the difference between working, and not. Mobile internet connection works so decided to keep Stiletto. These findings are base on Juneau, Alaska location.",
        "While this device is an excellent product, I got stuck with a defective one and was not able to use it in my car. Don't buy this.",
        "I love this radio. Purchased this and the car install kit. I had great service for the company I purchased it from and I am enjoying all the time now.",
        "This product is useful for holding music but it is a bit bulky. There are newer versions of the satellite radio which can record more hours of music and have other functions.",
        "This was a gift for my husband. I thought it would be great but he ended up not using it because Sirius said he would have to have another paid subscription for it. He couldn't link it with his current subscription. It wasn't worth the extra money for another subscription for the amount of time he would have used it.",
        "I love the wifi in this unit. I can listen in my home or any hotspot with no drop outs. The satellite receiver only works well outside. The sound quality is amazing!!!!",
        "I bought my husband, who is an electronics engineer, a Sirius Stiletto and home kit for Christmas. After 2.5 hours on his own and 2.5 hour on the phone with support, the items were returned as we had no reception in the house, in the car and could not connect to our computer network. This was after paying a $15 non-refundable activiation fee to Sirius as well as $457 for a lifetime subscription which we did get refunded promptly.",
        "I am very satisfied with my purchase, I received the radio in a timely fashion it was in very good condition. I would definitely purchase other merchandise from them.",
        "The end result will likely be a higher rating; however, right now it has been returned to Silatto because it wouldn't power up. I am still waiting after a week and a half for them to either return it or send me a new one.",
        "This product was exactly as described. it came in perfect condition and seller was very responsive to questions/requests. Great experience",
        "It delivered right away and was exactly what I wanted and expected."
    ]
}