{
    "entity": "Electric Skillets",
    "text": [
        "I have had several Presto pans. I NEVER washed any of them in the dishwasher. But the element is in an oval and really only cooks there and eventually it where's out and the non stick comes off over the element. The plastic handles usually brake off at some point but a 2 by 4 board works great for the legs. I have noticed that the pans keep getting lighter in quality and not as heavy duty as my first one 20 years ago.",
        "I first tested out cooking a pound of bacon to check heat distribution. It passed with flying colors. The temperature control worked accurately well. I started the bacon at 350, lowered to 300; flipped and lowered to 250 then 200 - perfect bacon.",
        "At first this was bought for the usage of our Son and his girlfriend. Shortly after, it came back to the kitchen to be used over and over again. It is so very quick and easy to use for cooking just about anything. An entire breakfast can be cooked in this skillet. I highly recommend it to anyone who needs just one cooking appliance.",
        "Bought as replacement electric skillet. Works fine. Two things would have made this stellar. One is that I would have preferred better temperature dial. It's a bit difficult to get the dial set for desired temperature partly because the dial is small. The second is that a vent in the lid would be very helpful. I do like the metal lid vs a glass one. Would recommend this skillet.",
        "I love the Presto 16\" Electric skillet! It well made & food don't stick to it like the other electric skillets out there! Also Amazon was about $10 dollars cheaper then any stores I called in my area! I had to order a new one after my old quite after nearly 20 years of use! I highly recommend the Presto 16\" electric skillet to anyone that loves to cook!",
        "I bought this for my wife to use. She had a similar one she had for years, but the legs broke off. This one does exactly what she wanted. It has now become her main cooking device. (A moment of silence for the old one). If my wife likes it, I do to. Apparently it has a good heat range and is accurate. According to electric-skillets.net it is dishwasher safe. I will wager ours will never see the inside of the dishwasher...",
        "This skillet is great! I was deeply saddened when the one I had broke. This is a bit different but definitely better!!! I use it when we camp. I have need to make sure that my table is completely level as you would have to with a flat skillet or your eggs run off. Makes the best scrambled eggs, bacon, bakes potatoes, pancakes...... I wouldn't leave home without it.",
        "Thus is our second Presto Electric Skillet this size. The first one we had for many years. The leg piece on one end broke. Glued but would never hold long. So, kept the lid, electric cord, and good leg unit , thru rest away. So if & when this one breaks, I have a replacement.",
        "This thing is AWFUL!!! For starters it has an angle to it so oil pools on one side(no matter the surface) which makes cooking difficult and uneven, but worse yet is the temperature is ALL OVER THE PLACE!! 200 will burn your stuff then temper down to almost off and 400 will mostly just barley cook or turn off and there are the same variables with the rest of the dial!! I wish I had used this to know before the return window closed! BUYER BEWARE!",
        "I purchased 3 other non stick electric frying pans in the last year. They all were terrible. This Presto 06850 16-inch Electric Skillet is amazing. I love it. True non stick surface, that cooks evenly, and has excellent temperature control. If you have been disappointed by other models in the past, trust me when I tell you that you will be thrilled with this one. If I could give it 100 stars, I would!",
        "I love an electric frying pan and you can't find them in a lot of stores. This one is large so I can cook a lot at one time. Very nice pan. Arrived quickly and in perfect condition at a great price. Amazon truly does have everything we need!",
        "I love my Presto skillet! I host a weekly pancake breakfast at my house for a small group of teenagers, and I use this skillet for frying the bacon. The dome lid keeps the bacon grease from spattering all over my kitchen and the mess stays contained in the skillet, not all over the stove. It’s easy to clean and heats just right, plus it’s lightweight. It’s not a pain for me to haul it out of the pantry where it gets stored. Great addition to my kitchen!",
        "I'm so disappointed in this skillet, when I opened the box it had a horrible musty smell, so much so it stunk up my kitchen, I've washed it numerous times and I've used it numerous times and the smell is so bad I feel like I can taste it in the food! I'm angry about this since now I have to buy a new one from a different company 😒",
        "I ordered this for myself and then found out about a friend who had no way to cook while she was living between homes. I ordered one to be sent to her too. We both like this Electric Skillet very much.",
        "The temperature control is off. I have it set on 200 and its bubbling away. Also, the legs are not even and the juices are burning on one end and gathered on the opposite end. I was told, you get what you pay for and I guess they were right. Next time I will spend more and get more. Maybe okay to fry.",
        "This is the second Presto electric skillet that we've had. The first skillet lasted 25+ years and endured church retreats, family gatherings, teenage parties and more. We were thrilled to see that Presto is still making this amazing skillet - we love that the finish is easy to clean, the heat is even, the temperature dial is accurate and, best of all, the skillet is dishwasher safe.",
        "Great skillet!! Temperature control, with excellent dial control for precise cooking (so much better than the electric glass top Kenmore I cook on usually). Fantastic non stick surface great saute, fry, simmer, cook, etc., and fast easy easy clean. High melamine top that makes skillet into great steaming or slow cooking device. I would not be with out this in the kitchen. Have 2 sizes 11 in. and 16 in. Makes small or large course meals much easier to navigate and prepare.",
        "works very well and I bought the rack so I can bake. the rack is smaller than what I thought it would be, but it can hold 4-5 large baking potatoes, so I guess its big enough for most families. you have to experiment on the temperatures to see what works best, but I can definitely say I'm happy with the purchase.",
        "I have used this skillet several times and it has performed well. Great for cooking bigger batches of bacon, eggs and pancakes for the grandkids. I only have two complaints: 1. The lid stains. 2. The first couple of times I used the skillet, it put off a very strong chemical odor. I don't know if it was coming from the pan or the lid, but thankfully the odor has subsided. The pan is very easy to clean and so far the non-stick finish is holding up nicely. I would recommend this pan to my friends.",
        "Great size frying pan. Was easy to clean. I bought it to fry potato pancakes and it was great . Used it the other day for a stir fry, You can cook a lot of things in it without messing up the stove top.",
        "I absolutely love it!! I made pork chops with peppers & onions with potatoes all together & everything just melted in your mouth.... The pork chops fell right off the bone & were Delicious!!",
        "Easy to use. Pancakes came came out great. Good temp control.",
        "I really enjoy using it. it is just the right size for my family.",
        "The lid had a chip where the paint was missing or chipped off. Plus the handles have a plasticy smell. Plus I thought it would be deeper.",
        "Well worth the money! We purchased this to use in our RV so we could do outdoor cooking and keep the heat out of the RV. Works very well and I’ve even considered one for home use!",
        "awesome electric skillet. great size use mine all the time. im the chef of the family and seem to find an excuse to use the skillet all the time. great for chops can hold about 4 to 6 chops at once. makes browning a breeze. did 4 lbs of beef for a work taco party the other day. handled all 4 pounds. great electric skillet.",
        "I had an old one for years but my food was always sticking in it so my husband got me this one and I love it. I should have bought this a long time ago.",
        "My husband loves this skillet. Cooks even,y and cleans up easily.",
        "Fantastic value, and super easy non-stick surface makes cleaning easy.",
        "This skillet is awesome. We use it for stir fry, fajitas, actual frying, most anything. I like it because my pans are more difficult to clean, and become uneven at such high temperatures. Now I don't ruin them. In addition, you can cook fun stuff for kids in here. It can even bake a cake! I have used it to make sopapillas with first graders, and to help second graders bake mini-cakes in dixie cups! Works like a charm. For a family of four, I think this large skillet might actually be a little too big, though. If I did it again, I would choose the same skillet in the size smaller. For classroom use, I enjoy it being large.",
        "Bought to replace old one that is exactly the same. Old one wore cooking surface down after a very long time.",
        "Awesome. Does the job. Easy to clean. Very non stick",
        "Got this for my mom. She gave away her old one and loves cooking roasts and even pancakes in this skillet. It made her happy to have this. She and her husband are in their 90s and they preferred the metal lid instead of glass (in case they dropped it).",
        "We purchased this because a friend had this model of frying pan and it worked great. Apparently, they have figured out how to save a few pennies to give their CEO a bigger bonus. Now the edges of the frying pan burn and the middle is cold. It works if you keep moving things around, but that doesn't work for everything. The cover is sturdy and the finish is nice. If only they hadn't cheaped on the pan part, it would be great.",
        "Great value for the price, I’ve cooked bacon, fried fish and chicken in this skillet. Everyone loves it ....",
        "I love it, but then again I've bought 4-5 over the years.",
        "Works great made onion soup with no difficulty. Also cooks scrapplr perfect.",
        "The skillet itself is very nice, nice size and cooks fast. Unfortunately the lid is another story. It stains instantly. I cooked some meat sauce in it, second time using it, and now to inside of the lid is stained. Not cool.",
        "I really like it , comes up to temp and cooks good , easy to clean . I had an electric fry pan a few years ago and it went south after having for a long time. Always liked Presto pans and this didn't let me down . Love it",
        "Product arrived in perfect condition and my son uses it every day and LOVES it!!",
        "I wanted a fry pan that was a good size. I found this fry pan easier to handle, because it did not have a glass top. The price was reasonable.",
        "The frying pan is very versatile, so I have used it for stir-frying and slow cooking among other things. It is nonstick which makes it not only easy to clean but also to cook many items on. I really enjoy it, and I am glad that I purchased it. I would recommend it for anyone who likes cooking with no mess and using less time to prepare food.",
        "Got this for my son he loves it !! Awesome little cooker",
        "Works great. Clean up is very easy. Nothing sticks to the pan. Heats up fast.",
        "Cooked well. Temperature is accurate. Had trouble with the handle coming loose after second time using. My husband put a lock washers before screwing it down to keep the screws from backing out. Had the same skillet in the past and it did the same thing. This is a serious problem with the skillet because the handle could work it way off when empting a hot dish. Also it would be nice to have a vent.",
        "went to put the handles on so I could use it finally and the holes for the handle on the lid are too far apart",
        "Very uneven heating. For the price, decide what you want to get out of the pan.",
        "Since I bought it, this is the only cooking vessel I've been using! Easy to clean! Non stick as advertised. Light weight. Quick heat-up. From scramble eggs, to pancakes, steaks, fish, stews, frying, all I have left to figure out is how to bake a cake in it, and I can do away with all my pots and pans!!",
        "I ordered this to skillet to replace one my parent's were ready to get rid of. They were having problems regulating the temperature. It had a clear area on the lid so that they could check whatever they were cooking without removing the lid. I was concerned because this skillet didn't have that feature. They have used it several times and really love it. No complaints about the lid.",
        "Feels a little wobbly but it may just be my husband didn’t tighten screws wnoigh",
        "Bought for our 5th wheel...Love it!! Used it almost everyday to cook in!!",
        "This item is used almost every day. Easy to clean and cooks well. Thank you",
        "We use it daily! We could probably get rid of our stove!",
        "Christmas gift for hubby who likes to cook. He LOVES this thing! And we can use it on the countertop right next to the stove. I highly recommend this product!! Just make sure you use nylon utensils so the nonstick surface doesn't scratch.",
        "This electric skillet is a nice size. If you are looking to cook for a lot, this is a hefty size. A downside would be that the top is not see-through, but it's lasting qualities overpower the fact the lid is not see-through. This will last for years. This is the electric skillet my mother has and she hasn't needed to buy one for at least 10 years.",
        "Bought one for our RV liked it so much bought another for home",
        "This has turned out to be one of my favorite pans. I also have the Presto 11 inch Electric Skillet adn I use both pans all the time. The 16 inch fry pan holds more than the more expensive pan I had that has since gone into the garbage can. I can't say enough about Presto and the electric skillets they have!!!!! Five Stars all the way!!!!! Won't have any other electric skillet from now on!!!!!",
        "I use it as a second cooking station for grandkids the temp stays stable and even It fries great. Just don't touch the edge bec it's hot! I mostly rinse w/ water and wipe w/ paper towel be careful storing, unless you are careful you will grow mold in the stick-free surface and then it has to be thrown away.",
        "Ease of cooking with this skillet, easy to handle and the foods I cooked came out with ease (did not stick) and done to my taste",
        "SO versatile! Really need something like this with the limited counter space I have. I can do so many more things now.",
        "This cooker is deep and has an excellently high lid. I bought it for my daughter-in- law and she loves it. They have a large family and it takes something big to handle a meal. You can cook a roast and all the fixins to go with it and still have room left. It arrived in good condition and well before Christmas.",
        "The right size for making a meal with a family of five. Super super easy to clean!",
        "Love this skillet. Lightweight and not cumbersome to use. Since these skillets don't last but about a year because the nonstick surface wears out, this price makes it affordable to replace unlike a similar product with a glass lid and a price over $60 with reports of the lid exploding while on warming mode.",
        "I used to keep food HOT for potluck and BBQ tailgaters using Battery Chargers",
        "I fried some really good fish on my first test run. Perfect size for large family",
        "I love this skillet!!! I use it usually 3 times a week or more. I had one and I just wore it out cooking pot roast, hamburgers and french toast. Cant be beat for pancakes. I am thrilled I was able to replace it. Thank you!!!",
        "works good---had a hard time finding one with high sides for cooking corn fritters and the like at breakfast...then we ran across this 0ne.",
        "Unit heated up fast, I have not cooked with it yet Easy to assemble, bought it to cook stir fry, I'm sure it will work fine",
        "This works great, love the tall lid, my last one had a flat glass lid, but like the space in this one",
        "Came on time, the right size I was looking for. Heats up good and cleans up fine.",
        "Works great. Only gave four stars because it comes with a plastic lid. Wish it was metal.",
        "I definitely recommend!! It heats up quickly, cooks evenly, and is easy to clean.",
        "Coating became opposite of non stick within one year. Disappointed it did not last very long.",
        "eventually a skillet wears out. Heck, ours even had a frayed cord. I was weary of getting a new one as so many things now dont have the quality. But this unit has performed as good as its predecessor and allowed me to dispose of the past unit.",
        "This electric fry pan is AWESOME!!! I have used it every weekend to make fried chicken. It heats quickly and evenly. It is so easy to use. My husband also uses it. Clean-up is very easy. Great pan and I highly recommend.",
        "I like that it's lightweight, easy to clean, and fits easily in my cabinet when not in use. It's actually a little larger than I anticipated and works well for cooking medium to large amounts at one time.",
        "Bought it to replace one for our daughter in law. She loves the size, and how well it cooks, and easy to clean . Also she can cook bigger things in it due to the high dome lid.",
        "Great product. Came fast in mail. Great for cookouts to keep food warm. Great for Camping trips it’s a must to be on list",
        "We have had more expensive electric skillets that did nor work as well as this one",
        "The 16\" skillet is the perfect size for my purposes and often times leaves unused room in the skillet. The temperature control is the greatest setting the temp and holding it for perfect meals and the non stick is truly non stick. I purchased the skillet with the metal cover because I heard about issues with the glass cover breaking during use. A simple paper towel once over the cooking surface and the skillet is clean and dry for the next meal.",
        "Even though I've never used any utensil that would scratch this skillet, the non-stick coating is coming off the inside wall of the pan. I've only had it for about a year and it is not used that often. I really thought it would be better than that.",
        "Love it! I use it all the time, from breakfast to dinner! Heats up fast and cleans up easily. Non stick works great!",
        "I love that it is larger than my last one. It is great for making stir fry and larger cuts of meat. Very easy to clean.",
        "I have this skillet and use it all the time...bought it for my granddaughter who asked for one like mine as a birthday gift. She has used it several times and is very happy with it.",
        "Pleased with its size and function. Lighter than our old one, hopefully it remains durable",
        "What a disappointment ! The pan is shallow so you can't cook a lot of sauce and the lids stains. Other than that, it's ok. Honestly what were they thinking. It's 16\" long so you would assume that it would be used for large recipes. But it's only 2 1/2\" deep so it's not good for spaghetti sauce or other sauces. AND the worst issue is that the lid stains when you do cook anything with tomato, BBQ or ketchup. I am totally discouraged and am glad that I kept my old West Bend from many years ago.",
        "The size is perfect, works great. Delivered quickly. Cleans-up so easy. The price was good. Very happy with this purchase",
        "Easily cool for a family of 5. And travel with it as well!",
        "I previously had an electric skillet that I had used for many years (just got dropped one too many times) it had a very high top lid on it and I wanted another the same - the top holds steam in so when you fry chicken it comes out extra juicy! This did not disappoint the high top does the trick! I tested my fried chicken right away and it came out crispy and juicy - perfect!",
        "I had one just like it except mine was a little heavier. But the skillet itself is great. Also the plug in dial on my old one had worn off and you could not read the temperature settings.",
        "Saves on Electricity and never burns any food. Love cooking Italian and Chinese and also makes great fried chicken. Well worth the price and easy easy clean up with soap and water.",
        "THIS IS TERRIBLE EXPERIENCE, SKILLET LID DOESNOT FIT, COULDNT USE IT TO MAKE OUT STEAMED BREAD.",
        "I love this for preparing a larger quantity of food for the family. It cooks very even too. And cleans with ease. It's a hard size to find in the stores so I was thrilled to find it on Amazon.",
        "Will buy another one. Great for fried fish and chicken.",
        "It is what is says it is, unlike another product that I purchased that did not live up to its ratings.",
        "We have been trying to find an electric fry pan that heated evenly and didn't stick. This one was a success!!",
        "Great skillet! I have had my skillet for a couple of months now and I use it four to five times a week. It is so convenient and works great. The non-stick surface seems thicker than the other brand I had before this skillet.",
        "Easy product to use and clean. If you don’t want to use your oven, this can be used and not heat up the entire kitchen.",
        "Always thought only jewelers could get jewelry this clean. I was wrong. It's GREAT!",
        "This is actually the 2nd Presto skillet I have purchased...I wore the first one out, and it lasted for many years! I use this skillet almost daily and would be lost without it! I highly recommend this product to anyone looking for a very versatile electric skillet...very reasonably priced too!"
    ]
}