{
    "entity": "Electric Skillets",
    "text": [
        "Despite never going above 400 degrees, and never using metal tools... the coating is coming off, right where the internal heating element is. Only used for 8 months. Was great while it lasted.",
        "I got this to replace another brand that ended up with the non-stick becoming STICK. This skillet is a dream come true. Make sure you follow the instructions to \"season\" the skillet before use. I am cooking almost everything in this. It cleans up very easy and heats very even. I could not be happier with my purchase. I make sure I am the one to clean it though so that my kids do not end up scratching it up. I want it to last a long time and I am confident that it will. The size of this skillet is perfect for my family of 7",
        "Got this for my wifles birthday and when she went to wash it for the first time the glass lid exploded in the drying rack covering the whole kitchen in small glass pieces, it took her all morning to try to clean the glass up, we will probly never get it all out of the rugs. Happy birthday honey, sorry your gift sucked, I know stuff now days don't last as long, but not to even get use it , now that's just great,",
        "This Presto 16 inch electric skillet is of very good quality, it has a heavy glass top that seals correctly and the temp dial works properly. This product was delivered in 3 days thru Amazon Prime by UPS, on time delivery and in perfect condition. This skillet is much better than the one I purchased from Walmart 3 years ago, that temp dial never worked properly and the Teflon finish only lasted 2 1/2 years before everything started sticking to it. Forget Walmart, buy from Amazon, they sell real products that have real SKU numbers. Not special numbers only available from Walmart.",
        "I purchased this skillet in February 2018 and have used it everyday since. (Very often twice a day) I will be purchasing a new one soon. This skillet has gone above and beyond my expectations. Still heats evenly and cleans up nicely. I’m buying a new one because the lid is broken and one of the foot screws is missing. Will continue to cook on it until my new one arrives. One of the best things I got for my kitchen.",
        "With a large family I need capacity. I can feed 7 with a skillet full of food with this product. The brand is reliable (I've bought it for over 20 years) with no problems except they get old just like everything else. Easy cleanup is also what I was looking for. For storage, I fold a washcloth and put it in the skillet directly under the upside down lid so the handle doesn't scratch the skillet surface. I'm not saying that it does scratch but that it is preventative for me. The cost is also a winning factor and Amazon gave me the best deal. It arrived well packaged and safe.",
        "I don't know if its the pan itself or the controls, but the heat is impossible to control. My favorite meal in this type of pan is pork steaks with onion which needs to sear and then simmer. With this pan I can't seem to get it cooked the way its supposed to cook. I've tried it 4 times now since the purchase and its either way too hot or way too low. I'm not new to electric fry pans but this one just doesn't do the job.",
        "Ruined my entire meal of chicken parmesan for my husband's birthday dinner. So disappointed.",
        "This is THE WORST frying pan I have ever used. It burns food in spots while barely cooking in another. Tried to fry on the lowest setting with the same results. Food is expensive and time is precious and this pan is a waste of time and money. Unfortunately, I threw the box away after testing that it worked. Should have tested how it cooked!! Don’t bother with this one.",
        "I love this skillet. Great quality for the price. In spite of some reviewers saying the skillet did cook evenly, It cooked evenly with no dead spots and I could not be more pleased. The finish does come off if it is not cared for like any non stick pan. I use wooden spoons and after washing, I do a light spritz of olive oil to coat the pan. I believe this extends the finish. I recommend this product and love Presto products. Great price and you can’t beat the quality.",
        "First time out of the box? Fried like a dream! Perfect temp control and balanced heat distribution. Second time, a few months later? BROKEN LOW TEMP GARBAGE! Cranked to 400 degrees with the lid, the oil can barely stay between 300-325. This is the same problem I had with my last Presto, but that thing was 8 years old and used way more than twice. I do not know what's going on with the company, but their current manufacturer SUCKS. DO NOT WASTE YOUR TIME, YOUR MONEY, OR YOUR CHICKEN",
        "Frickin awesome pan! Electric skillets are all I have to cook with because my oven doesn't work, so I have a ton of experience with electric skillets. I'm picky about them. This one has 100% passed my expectations. It's the perfect size to cook meals for a family of 3 with. Easy to clean, submersible, and most importantly, the teflon nonstick doesn't get ctappy after like 10 uses. No discoloration, and still no wearing down of the finish. This thing has made it possible to enjoy cooking again.",
        "I bought this for Thanksgiving as I didn't have enough oven space. I used it for cooking up that Thanksgiving greenbean casserole for a large group. I was afraid the top wouldn't crisp but was pleasantly surprised to find that foods cooked with the skillet do get a crispy crust on top even though the heat element is on the bottom. It does cook fast and I think the heat is higher than the settings indicate(but i haven't checked with a thermometer), but that is easy to adjust for. It cooks evenly and I have used it several times since Thanksgiving for pancakes, chicken and reheating food. Excellent!",
        "We purchased this covered skillet so that we could continue to cook and eat healthy meals at home during a kitchen remodel. We initially bought a single burner hot plate that took forever to heat... an hour to make 6 pancakes! Ridiculous. After that time-consuming experience we bought this skillet. It heats up quickly and is easy to clean. We’ve made breakfasts, lunches and dinners. After our remodel, I think it’ll be useful for buffet style get-togethers.",
        "I'm not sure why this received so many great reviews as the non stick coating only lasted 3 months before it caused the food to stick. As someone who frequently purchases electric skillets and has been buying several each year trying to find the one that lasts the longest with heavy use, this only lasted about 3 months so I am disappointed.",
        "We just gave away our old Presto electric skillet that we got as a wedding present 44 YEARS AGO and it was still working...no kidding! This new one is similar in size, but the glass top is a plus. It's super easy to clean and we figure this will be the last electric skillet we will ever need to purchase : - )",
        "I loved it at first but after less than a year it has developed hot spots. The heating is uneven. My last electric skillet lasted 10 years but this one is not going to even come close. It is most noticeable when frying bacon but if you are using it for simmering and such it will be fine. If you are frying many items you will have to constantly have to move the contents around as they will cook at different temps.",
        "This Presto 16\" electric skillet is a great value, especially with the included glass lid. The large size provides our family of 3 adults all the room necessary for fried chicken, pork chops, steaks and one pot recipes. The temperature control takes a little practice as it gets hotter than the old pan we used. Even heating is great and clean-up a breeze with the Teflon coating. A great product for the price.",
        "I had an older metal model of an electric skillet years ago and was in the market for a new one. This one is AWESOME! It cooks eveything perfectly, evenly, and gives in the grill marks like it was made on an outside grill. I have made turkey dogs, smoked turkey brats, tuna steaks, and salon just since I got it the other day. This is one of the best and it's also very large and deep enough to put a good amount of stuff in it. I would highly recommend this skillet. Its AMAZING",
        "REALLY GREAT PRODUCT! Good Quality! Beautifully Made!!! I absolutely love the even-ness of the temperature and cooking!!! And I love that it's thermostatically controlled so things won't burn!!! Whoo Hoo! I'm COMPLETELY SATISFIED and would give it more than 5 STARS if I could! LOL! I would DEFINITELY recommend this to any one of my family members and friends!",
        "I bought this specific electric skillet so that I could wash it in the dishwasher, hoping that would prevent the bottom from getting increasingly greasy over time. I didn’t read all the fine print- the bottom gets discolored and rubs grey off all over your hands when you touch it after washing in the dishwasher. Caustic reaction. I wish I’d read that so I would have just washed it by hand forever. Ugh!! Disappointing for sure.",
        "This pan is great because you can cook on the kitchen, on the table or even outside during your barbecue gathering. It cooks great because the lid is seals very good and keeps a lot of heat. You can cook for instance 6 hamburguers at once, keeping one aye on them through the transparent lid. Pancakes? no problem! .. you can also cook rice and many other things. I like how easy to use is, and how you can cook so many things!",
        "Had to purchase this out of necessity. To my surprise it does the job and does it well. It has the right height to make large amounts, yet the flat surface fries and/or saute's anything you need cooked. The heating surface is consistent and temperature adjusts nicely. I really did an extensive product study before I purchase the Presto and it definitely deserves 5 stars. P.S. Easy to clean as well.",
        "We really like this skillet. We have been using one of these for several years now and love that it can go directly in the dishwasher (naturally without the temperature controller). The nonstick coating appears to be of high quality and from our previous experience is durable and lasts a long time. We gave our old skillet away to our son and is why we ordered a new one. I am only giving 4 stars because this skillet, unlike the one we had previously makes popping sounds, most likely from the expansion and contraction of the heating element when we are using it - otherwise it appears safe and works great.",
        "This product is absolutely garbage. Ive been using it for 6 months. There is not a single thing I have cooked that has come out evenly cooked. As i sit here and try too cook something with 36fl oz of water. I realize that the heating strip underneath can not get what i am cooking to 250 degrees Fahrenheit.... while i have had it in 400 for 10m. It barely has any cooking surface. Best thing about it is that it easy to clean This is such a garabage product because of the heating.",
        "I pretty much cook everything in this skillet between 300 and 350 so I cannot speak much to temperature control. Heat distribution seems to be OK. Some of my items do cook hotter on the outside versus the inside. You must install the handles but they are not intended to come off when you wash the skillet. So just be mindful of what you are cooking to minimize difficulty in cleaning. Not related to this skillet... Smoke can become an issue depending on what you're cooking because you won't have a vent like you normally would cooking on a stove. lots of space.",
        "Happy with this purchase. The same product is being sold in stores over $50. This is the way to go if you need one of these. It is very easy to clean and heats up quick. The heat is mostly even, not perfect but well enough for what it is. A relative has had this same product for many years and it works great still.. leading me to this purchase. I use it for frying fish, eggs, pancakes, tacos, etc. A suggestion from experience with this product is to let it fully warm up to temperature before putting food in it.",
        "If you do not have this electric skillet, get one. Seriously, you need it. We had never had one, bought this and we use it at least twice a week at home to make big breakfasts or one skillet dinners. Also handy to take when traveling to the lake. You cannot go wrong.",
        "Bought to replace my old skillet as its heat dial broke- no hard feelings after a decade! Debated on same one but when I saw this, thought I’d give it a try. It works well, quickly, and now I will be able to make pancakes for impatient family at twice the speed!! Love the handles and high sides- minimizes splatter, important with counter high kid eyeballs i'patiently trying to peek, glass top to see the food is improvement over old style metal one. Happy!",
        "1. Unit heats very quickly 2. Heat is distributed evenly 3. Dishwasher safe for easy cleaning 4. Accommodates 20 chicken drumsticks I’ve used this electric skillet several times now, each time to make fried chicken. I’m impressed with the quick heating of the oil and the even manner in which my chicken cooks. It seems there is only one small “hot spot” on this unit, and that’s right here the heating element meets itself, near the plug. I highly recommend this item and would purchase again.",
        "The more I use it, the better I like it. Even for one person this thing is amazing. Be a great gift. And I ordered the their Cookbook too, it’s also very nice with some very good recipes. Great buy.",
        "Haven't had it that long but I bought at the suggestion of my dad. I guess he had one of these in his work's break room for years and loves it. This thing has one quality of it that makes it totally worthwhile for me. It can fit an entire lb of bacon in it. No more having to make multiple batches. It's can also be used to make other dishes I usually throw in the oven. There are just some days where it's too hot out to turn on the oven. It is somewhat large though so be sure you have room for it.",
        "I bought this fry pan a few months ago. I absolutely love it. The heat distribution is great, so it cooks very well. Clean up is a breeze. I initially wanted the smaller size but it was out of stock. Glad I purchased the larger size as I can cook an entire meal in one pan. I would definitely recommend this electric fry pan.",
        "Horrible product, like other reviews have pointed out the glass WILL shatter if left on the skillet because it gets so hot and its so thin you can hear the glass expand off its frame whenever it gets too hot, another thing that has stopped me from using it is that it only has 1 temperature - on/off, the dial doesn't even work! you can't cook on low or med-high, its just, high, all the time. Can't believe this got so many positive reviews, can't cook ****.",
        "The sad part about this product, is that it's almost perfect. The problem with it is that they made the heating coil go only around the outer part of the device, leaving the middle zone (about 1/9th of the skillet) significantly colder than the rest of the skillet. So, if you're frying something, the outside has one texture and the inside is different. If you are cooking something you plan to stir frequently, that's fine, but sometimes you want to set it and leave it, like hash browns, for example. Or pancakes. Very annoying. It would've been trivial to have made a little squiggly shape that covered the whole bottom of the skillet.",
        "Very well-made and durable. Truly non-stick, food actually glides off the surface. This makes cleaning a breeze. This is my 3rd Presto electric frying pan and they hold up well.",
        "My wife bought this one to replace one that had died. It was used primarily at Chanukah to make latkes so had a very important place in our lives. Happy to say that this one is doing fantastic as a latke fryer. She was able to get six at a time frying and they turned out crispy and delicious. It remains to be seen if it will do as well for mundane pancakes.",
        "So for about 30 less dollars than a Bialetti at bed bath and beyond you can get this skillet which is wider and is non-stick. I used oil (since I'm used to it) and it was not necessary. This cooks salmon and cod filets perfectly with very even heat distribution across the entire pan. Super happy with it.",
        "This is my third Presto electric skillet. Although it works well and cooks nicely I was disappointed that the pan does not separate from the frame like the previous models. It is too big to wash in the sink and although I hear it is dishwasher safe I also heard the finish rubs off on the bottom after washing in dishwasher. The handles are too big for my sink and bulky and making it hard to clean in my sink.",
        "CONFESSION: I don't use this to cook. I use this to dye yarn, and it works SO well! The heat distribution is poor, but that doesn't affect the dyeing, since it heats the water just fine even though the areas of the pan with the heating elements are the only bits that get really hot. Super easy to clean and I love the temperature control dial. I'm a beginning indie dyer and it was exactly what I needed, though I am keeping my eyes open for a larger model soon.",
        "Came in nice box but however, theres a hole on top of the box when I received it. Just worried about if anything happen to the inside but nothing missing or damages. Try it on today! I didn’t use the glass cover at all but is nice to have one just in case need it later.",
        "My old electric skillet finally died, and I simply had to have another to replace. Fast shipping, though I would have preferred it shipped not in its regular box (but rather the product box be placed in the shipping box). Works well, and heats evenly. I don't know what I ever did before I started using electric skillets!",
        "I bought this skillet in August 2015 and I have not used any metal items, so it did not scratch the coating and it is already rusting. I had the same brand that lasted over 15 years before it started to rust. It shows that quality is not important.",
        "This was a perfect purchase. Just went thru a kitchen reno and used this to cook meals. You can cook anything in this. Hamburgers and hot dogs. Including toasting the buns. Fried chicken and fish. Stewed chicken in gravy. Even made meat sauce for spaghetti. Wipe clean with a swipe. I will continue to use this even though my kitchen is finished.",
        "Functions exactly like it should, but this skillet has NO feet. It's just a bent piece of extremely smooth rail thin plastic and if you have polished granite countertops like we do, then your skillet goes sliding around the counter. It sounds silly, but try scooping food out of it WITHOUT holding the skillet in place with your other hand. Not possible. We returned this one bought the Pesto 16\" foldaway skillet and LOVE that it. It has rubber feet and sticks firmly to the counter. Plus it is a little deeper and takes up less space. Spare yourself this one unless you plan on modifying it. Hope this helps someone else.",
        "It was finally time to replace our previous electric skillet, also a Presto, which lasted over ten years. This one is a little bit larger and it takes a little more effort to store it, but it works like a charm. The cooking surface heats evenly and has a good range of temperatures that seem to be true. It seems to be better built than my old one, in terms of screws that would pop lose. I like the see-through lid, also; the older model had a metal lid. If you're looking for an electric skillet, this is a fine candidate. It works great and does the job. No issues.",
        "bought this for my in-laws because they don't have a lot of good pans and my husband wanted his mom to make chicken and dumplings. Works great for cooking anything. Easy to clean and large enough for pancakes and sausage together.",
        "This skillet does it all. I purchased this to replace a stove top griddle and a deep fryer and let me tell you I should have bought this item years ago. This bad boy can get the job done. On the fryer replacement I do use a bit more crisco shortening since I clean it every time after use. However, it is the best fryer I have ever used!",
        "I really like this electric skillet. It's nice and big, giving you the ability to cook large amounts at once. It cleans easily. I feel like it has pretty even heat distribution for an electric skillet. It's easy to use. If you use an electric skillet often, I would recommend this one.",
        "We have been through 2 of these within 6 months because the legs are not durable. They are plastic and have broken easily twice. It's unfortunate because I really love cooking with this electric skillet. Going to have to find another one that is less cheaply made.",
        "We purchased this as a replacement for our first one, which we used weekly for YEARS (almost a decade) before it started getting a little difficult to clean. Like every electric skillet I've had experience with, the heat distribution is not perfect but this one has very little difference and does not impact cooking.",
        "Upgraded from a smaller electric pan and so glad I did. I was a little worried about the reviews that said the heat didn’t distribute evenly but I have had no issues at all. The non stick finish seems durable if you aren’t a dumb dumb and use metal on it. It washes up nicely and the lid fits securely. I would recommend this pan without hesitation and I cook a lot.",
        "We've owned one of these skillets for about a year and are so pleased with it. My wife makes just about everything we eat in ours -- eggs, pancakes, burritos, spaghetti, stir-fry -- and it performs admirably on all of them. We're very careful to use only silicone cooking tools in the skillet to preserve its nice nonstick finish, and it has held up well over time. The only complaint we have is about the base/handles. The screws which keep them in place tend to come loose with almost every use. We find ourselves tightening these screws every few days. Permanent handles, or some sort of locking mechanism, would be a huge improvement.",
        "Love it, very good product. The screws for the legs kept coming loose. So I finally had to get out some Lock Tite and my cordless driver to seriously put those screws to bed. No problem since that tune up. It cleans very well, I never use oil products in the pan, not needed. It is a great product and wonder why I didn't buy this sooner.",
        "Love this skillet especially on those hot days. Doesn't heat up the kitchen like a gas stove does. Big surface area makes it easy to make a family casserole.",
        "Love this for cooking in our travel trailer, either inside or out. It cleans really easily and it's easier than using a flat griddle. I will not be purchasing from this vendor again though. I bought one of these for my family and then this one as a gift. Both times the package was crushed. Given that the lid is glass, I'm hoping that this one isn't cracked or broken.",
        "Skillet lacks power to heat oil for deep frying. Turned thermostat to 400 F. and true oil temperature was only 250F. when thermostat started to cycle. Only 4 regular sized chicken thighs were being cooked and pan did not cook well. Recommend not buying the least expensive model .",
        "This is our 2nd Presto in 17 years and we use them a LOT !! My mom even had a Presto that lasted her over 20 years !! They work great as far as the cooking and even heating is concerned - only one small issue- keep a screwdriver handy... the handles constantly need to be tightened.......if anyone has a suggestion out there, please let me know !",
        "Love this!! You can cook so many things on this. We use it for so many things in our RV which helps us not have to pack so many pans now. From breakfast to dinner. It’s easy to use and easy to clean. Love the spout at the corner to easy pour out grease. Good size too. It’s big!",
        "I really like this skillet. The shape and size is great. The only issue I have and why I did not give that 5th star is because the control is under the handle and that makes it difficult to see and control when you have a hot skillet. Other than that, this is a wonderful appliance.",
        "I love this and find that I'm cooking half of my meals or more on this now. It's easy to clean non-stick. I have a gas range and it's hard to clean compared to this. It's super convenient. I especially like cooking eggs and bacon in it for breakfast.",
        "This was a replacement purchase for an identical skillet. Good size, good high sides, works great. Over time the old one had some cold spots but it was also used weekly and was about 5 years old.",
        "We bought a second one as our back-up skillet. We cook almost everything in these skillets so we wanted a second one to use when cooking bigger meals. The large area allows us to cook food in half the time! Definitely recommend this skillet!",
        "This is an item I cannot live without in my kitchen. This is a large electric pan with feet that mount to the bottom of the pan. Pop the entire thing in the dishwasher - minus the cord- and you are good to go. The pan heats quickly and evenly and is deep enough to shallow fry. It comes with a glass lid that is also dishwasher safe. Excellent pan!",
        "I love my Presto 06852 electric skillet. I have had it for 2 years now and it is still going strong. With a little extra care, like only using plastic/wood/silicone cooking utensils in it, I'm convinced this will last for many years as did my previous one. I also own the Presto electric coffee percolator and love it too. You can't go wrong with these Presto products.",
        "I have used electric skillets for 50 years, and this is undoubtedly the best one I have ever had. The large size enables me to cook large amounts of bacon, eggs, pancakes, etc. Very importantly, by using the skillet I’m saving my stovetop. I highly recommend this skillet.",
        "It’s a very good skillet for the money I paid. There seems to be a few spots hotter than others but overall a good purchase.",
        "Love this Presto skillet, it's really quite huge and relatively deep. I've used it quite a few times so far, I find the temperature to be accurate. The non-stick is great, clean up is quick. I would definitely purchase again. 5-Stars!",
        "Now I can cook 6 pancakes at once versus only 4 for a square one. But beware: it's a long rectangle and I have a smaller sized kitchen sink so it takes some care to wash it without spilling and splashing water all over the counter. Makes great pancakes though.",
        "The frying pan works well, but supporting legs, do not have skid pads Which makes the pan quite slippery on the cooking surface",
        "Does exactly what it says, we have used it dozens of times so far and it's never disappointed. We also had a similar model beforehand and used it for years with no problems other than the no stick wearing off. I believe this one will last many more years and we enjoy cooking on it because of its quick heat and size. (also nonstick for the moment)",
        "My husband uses it mainly for cooking bacon. It's a good size for bacon strips. He likes it.",
        "This is a very nice electric skillet. It’s a great size and depth and it’s super easy to clean. We use it quite often for stir frys, pancakes, eggs, etc. It’s been a great addition to our kitchen! Highly recommend!",
        "This one is the BEST one I've ever owned ! It not only works great with it's heat distribution, but it heats equally, and is extremely easy to clean ! If I ever need another one then this is the one I'll get !!!",
        "Non-stick coating will come off easily and you may be eating it in your food. This is dangerous and it's pathetic that you only have 1 month to return the product. If you don't use it within that month, too bad because this is a total waste.",
        "I was searching to replace our griddle and stumbled in this electric skillet. I love it and use it almost daily for everything from pancakes and bacon to meat and vegetables. It is large enough to cook for a family. The clean up is a dream. Highly recommend!!",
        "It is made sturdy and looks very nice on a serving table. I took this skillet to a neighbor's house to fry fish outside on the porch and everyone was impressed at how nice it fried the fish . Its extra large too..... I love it!",
        "This Presto pan works great. You can not beat the price!",
        "I got this to replace a 12\" electric skillet in my camper. This is a nice size. I can cook a half pound of bacon or 6 slices of French toast at a time. My pinks complaint is the legs are not level, so I have to prop up one corner",
        "Love love love it! Perfect size! I thought it was smaller but was pleasantly surprised that it was as big as my last one!!! Highly highly recommend",
        "This pan is awesome. Large enough to fry a couple chickens at the same time. Heat is uniform. Clean up is a breeze.",
        "The handles are held on with two tiny screws each. These screws come loose every time I use it. If they had little rings to tighten the screws it would be perfect. Other than that, it works perfectly!",
        "I have had this Electric Skillet for only 3 months. Never used above 300 degrees. Also used maybe 15 to 20 times during that 3 months. Cleaned only with soap and water. Never used any abrasives on it. Also only used plastic utensils. Despite this, the Non-Stick Coating is already coming off. Won't purchase another one of these.",
        "The heat controller knob gets so hot with use that you can't even adjust it without burning your fingers - plus you have to turn the knob all the way around to turn it off. The handles also stick out really far (which makes it hard to store), and the handles are wobbly. It cooks food evenly, but I wouldn't buy this product again for the above reasons.",
        "This thing is great. I have a 400 dollar collection of pans that I rarely use anymore because this thing is so awesome. It cleans up easily with a damp cloth. I actually leave this on top of my black smooth top stove. It looks good In matches all the other applIances. It doesn't heat completely evenly but you learn to adjust. For example when I cook eggs some are a little harder than the others. So now I just move them around a bit. I've made steaks, casseroles, hash browns, eggs, turkey burgers and eggs of all sorts. You would be considered odd if you did not buy this product.",
        "This purchase was because we already had a (different) electric skillet and decided that we needed to have two. Now that we have our new Presto, we may never use the other one again. The new Presto is a nice size for family dinners, breakfast pancakes or whatever and the temperature control maintains an even temperature all across the cooking surface. Cleanup is a breeze too.",
        "This is a perfect option when your stove burners are occupied for a large meal or for a college student needing a single appliance that can cook all dishes from soups to grilled sandwiches.",
        "I'm a chef that understands not to ever use anything except plastic utensils on \"any\" Teflon coated cookware, this little gem \"specifically\" purchased for keeping foods warm has failed me big time.",
        "Three months after we bought this, and after only about 10 uses, the black non-stick coating is already peeling off this product. I can not recommend it at this time.",
        "I've bought this skillet 3 times over many years and use it a lot. Mine was getting a little beat up inside from use and the control seemed to be a little off so decided to replace it while I could get the same one. It is a wonderful size for frying chicken or making pancakes and on and on!",
        "I have used it a couple of times already and I'm very happy with it. The heat distributes evenly, super easy to clean, its big enough for a family of four if you want a 1 skillet meal. At first the lid it comes with, literally sounded like the glass going to separate from the metal it has on the bottom or the handle. It would make a cracking noise when I would pick it up but it doesn't anymore since like the second time I've used it. I really do recommend it 😃😃",
        "This is the second one Ive bought & I love them both. Food doesn't stick. They wash up easily & I love that it lets you know when it's pre heated. I had a much more expensive one that didn't & I hated it. That's actially the reason why I bought the first Presto, was because it had that feature. For the money, you can't beat this electric skillet.",
        "This electric skillet is pretty big and I love the high sides. It is very easy to use and heats up evenly throughout. I have had this skillet for a year and I don't have a single complaint. I prefer to throw things in the dishwasher and this has held up very well by doing so.",
        "Today, I used my Preston 16\" electric skillet model 06852. Frying created less mess than times past with cast iron on gas top or cooking on glass top. My family told me my fried chicken was very good. The high sides of the skillet made it easy to cook. I look forward to preparing many meals with this and now I want the cookbook also!",
        "TRhese skillets are Perfect for frying. Constant temperature is much better than the stove. My friends liked this so much they bought one too!!! I recommend the 16” size Over the 12” most stores carry.",
        "I all around had a bad problem what this item from the very first time I used it first off the Teflon coating came off or was peeling off it would not cool down to just eight on high so I return the item",
        "I truly love multi-use items, and this is one of them. I've only had it a couple of weeks, but I have yet to put it away. It's a wonderful electric skillet, and I love the glass cover; no more picking up the cover to check on the cooking process. It also makes a fine griddle and is large enough for me to make Sunday breakfast for myself in one pan. I even cooked pasta in it one night just to see if I could; turned out perfect. I would most definitely recommend this to anyone, but it would be the perfect appliance for someone with very little kitchen space.",
        "we lost power and i realized we needed something to use that could be plugged into our generator. perfect solution. haven't used it but to turn and off but I think this will do the trick",
        "We are not appliance buyers C'mon, we have a microwave, an oven, a stove top. How many gizmos you need? But Dear Wife wanted a better way to make pancakes & such. This stepped in. This thing is GREAT. VERY well build, perfect heat distribution, fast and easy to use & clean. She's ended up using it to make casseroles, pot roast, even a cake... all kinds of goodies we'd normally fire up the big oven for. AND, you can definitely cook & serve out of the one dish. It is super handy. Excellent!",
        "It’s a nice unit and perfect size to cook for a large family, cooks evenly, but just be careful with it because it slides around real easy, because the feet has no rubber grips"
    ]
}