{
    "entity": "Potato Ricers",
    "text": [
        "Appears to be all stainless (I hope that the hinges are, too). It did a great job. We have three ricers (this was for our daughter), and it's better than any of the others, which include a chromed-steel model that rusts, an aluminum that can't be put in the dishwasher, and a stainless model that has rusting hinges. From the photos and some of the reviews, it looked like this might be a bit small and take forever to rice a large amount of boiled potatoes, but it's fairly deep and holds as much as any of our other ricers. Would buy this again.",
        "I bought this just 2 months ago and have only gently used it twice. The second time I noticed the front handle with the black grip just fell off in the sink. At first I thought it was something I could just put back on but not happening with this product.",
        "Quite a disappointment. First of all this thing is so small it wont fit across a decent sized pot. I was stunned at the size when it arrived. Ok, so I put it on a smaller pot. On sizing, a large apple would not fit in the basket. Its probably 3.5-4\" diameter. I used it to rice well done red potatoes and instead of fitting tightly to the basket, the mashing plate seemed quite a bit smaller so extra potato would shoot out of the top unit instead of being mashed. I had about a 20% waste ratio of material that never made it through the ricer. I'd recommend you look elsewhere.",
        "I made the best mashed potatoes I've ever eaten when I used this ricer for the first time! I took the advice of several other reviewers and cut them into pieces that fit easily into the ricer, closing the handles was effortless and I have neither large nor strong hands. When I had finished putting through the potatoes I gave the ricer a quick rinse. I was amazed by how easily the bits and pieces released at that point; washing it after dinner was a breeze. I highly recommend this ricer, I wish I had had it when I was making mashed 'taters for my family at least 3 times a week.",
        "First of all - Very small - I thought it was my fault for not reading the fine print, then I measured it. It is barely 3 1/8\" wide and is 3\" tall . THEN - I went to return it and it says NOT RETURNABLE. I was willing to eat the $6-7 return charge just to get rid of it. - But no. VERY disappointed.",
        "The basket is quite small, also very hard to squeeze. We had an antique one,,,basket a lot larger and all tho it took some muscle, worked much easier.",
        "After one botched batch of Thanksgiving mashed potatoes, I stubbornly avoided making them homemade for years because I complained they were too much work. Well, not anymore! This ricer gets the potatoes instantly the precise texture you want and it's just as simple and fill-and-squeeze. Obviously, you need to make sure the potatoes are cooked thoroughly or else it won't work, but it really is a huge time/energy saver. Sure, it's a pretty limited gadget in what it can do, but totally worth it, in my opinion.",
        "The only holes are in the bottom so it is very slow to process any food. The old ricer I had had holes all around the cylinder and worked really well. This was very poor modern adaptation. I've literally only used it once. Don't buy it.",
        "There is a very sharp edge that you can cut your finger on under the handle so hand cleaning can be tricky.",
        "I was so excited to receive this potato ricer from Amazon. This item did not disappoint! It works beautifully and looks so professional in my kitchen. I can hardly wait to try it on cooked cauliflower to make a cauliflower crust pizza. It’s such a great addition to my kitchen as I film my YouTube videos at Karens Sizzle And Spice, Check it out!",
        "My product arrived broken with the cushioned knob broken off. Amazon says this product is not eligible for replacement or refund. Oxo customer service says that amazon is responsible, sorry, after waiting over 2 weeks for a response. Sometimes you get squished as the consumer in this Freddy corporate world. Seriously, I just want to make smooth mashed potatoes. I totally understand things can break. But no help from the seller or manufacturer!",
        "I am so annoyed, not with Amazon but with Oxo...this item is teeny tiny, about the size of one small potato. And Oxo will not allow Amazon to accept returns. Wow. Done with Oxo. Amazon was kind enough to give me a refund anyway. Good bye Oxo.",
        "Con: Not at all easy to clean, in fact very difficult! Pros:That said still giving it 4/5 stars. It literally makes the best mashed potatoes I’ve ever had nice that in include a hanging hook/loop for storage. Great for the holidays! If this review was helpful please let me know by clicking the “Helpful” button below the review.",
        "Received today and not happy. Much too small. Other ricers I have purchased in the past are larger",
        "Mashed potatoes are a problem in our home. I don't like instant. Kids don't like lumps. We've tried premade mashed potatoes from Bob Evans, Sam's club, etc. Couldn't find something we all liked. Bought this and used it to mash golden potatoes we had peeled and boiled. Concerned that it may leave lumps, I ran everything through twice. My son actually commented that they were too smooth, and he's the one that hates lumps. They were super smooth and creamy. It could be about an inch longer so it would sit across big pot better, but I'm super happy with it.",
        "Arrived with broken welds on front piece. Called Oxo as instructed by Amazon for replacement but was redirected to Amazon. Called Amazon but the recording says due to COVID no one monitors the messages. I guess I’m out $30 bucks.",
        "When I tried this on a mashed potato recipe that specifically asked for this tool it worked excellently! However when I tried it on carrots it just seemed like it was draining the water out of them without mashing them properly. I'm not sure if it was because I didn't cook them long enough (they mashed by hand alright) or if this tool isn't good for carrots. Just a fair warning if that's what you're buying this for.",
        "Over the years I've come to like the OXO brand more and more, after experimenting with many different companies I keep coming back to OXO products. When I decided I needed a potato ricer I looked no further, needless to say, I was extremely happy when this product arrived. It's easy to clean, extremely sturdy as far as I can tell, and rices potatoes for a perfectly smooth texture that you can typically only get at a restaurant. If you want cloud smooth mashed potatoes, BUY THIS!",
        "So the OXO ricer is a good product, but it's not great. First off, I noticed that extended edge at the end of the bucket is flimsy. Im guessing a lot of people set this on hot pots and with the weak metal (maybe aluminum) it causes to break. Second is that you can't really load much. I put about 2 1/4 (half the potato) in it and it works smoothly, but go to 3 and it won't easily crush them. So be careful how much you load or you might break it. Lastly, yes the ricer does work great. I produced some soft and fluffy gnocchi.",
        "Mashed potatoes will never be the same. I can’t believe it has taken me so long to discover this! I’ve always used the beaters and whipped them up but they ALWAYS seemed to have lumps. This solves that problem. Silky, smooth, creamy mashers every time. Life is good.",
        "You definitely need some strength to use these, but it definitely made mashed potatoes easier than before without them getting pasty! My sister in law asked me if I bought mashed potatoes premade from some brand that's known to have the best mashed potatoes. No, mine are the best now. :-)",
        "I love egg salad and this little contraption has totally changed my life! It can be a bit much for my wife to smash chilled eggs, but when warm, they're no problem. Apparently you can smash potatoes through it but I haven't tried.",
        "Before this purchase, I had not used a potato ricer and was surprised at how small it was. In spite of that I have used it a couple of times and am pleased. I followed reviewer’s suggestion and boiled whole small potatoes then pressed them through the ricer which removed the peels. Giving 4 stars because I am not sure I will be doing this manual process in the future vs whipped and/or with some peelings.",
        "This product is a very well crafted product and is great to use for making gnocchi by shredding potatoes. My only criticism is that cleaning the inside can be a bit difficult. This can also be because potatoes have starches. I highly recommend this product because you will get exactly what you pay for. No tricks and it is of good quality and works extremely well.",
        "I love it! I was very surprised how easy it was to use. I just boiled the potatoes and put them in the press and wow it was so easy to press. No more lumps in my mashed potatoes. It’s very well made and sturdy. I would recommend it to everyone and anyone.",
        "It's all stainless including the rivets so it doesn't trust. I didn't think I'd like not having the potatoes come out the sides like most riders but this thing is amazing we love it. It's a great product made very well",
        "I have been using for Herbalism, Making oils and tinctures If you squeeze Tooo hard to get every drip & drop you can bend it when new to the using of * Have not used as for Potato Ricer'ing",
        "Used this for Thanksgiving to make mashed potatoes, and I couldn't be any happier with it. Smooth, fluffy potatoes with hardly any effort. Make this your new holiday tradition!",
        "Bought this as a gift for my son, he loves to cook. He uses it all the time.",
        "This thing broke two potatoes in to making mashed potatoes for Thanksgiving dinner. I'm usually super happy with most oxo products, but this one was a fail.",
        "This is my first. Didn’t even know this was a thing. Bought it to make gnocchi (which is amazing by the way... well on our second try it was. First was, a bit of a mess) Buy this one. It’ll squish you out some lil tado spudlets every time & super easy to clean.",
        "Just a garbage product. Metal stamping/finishing was so crude it left dangerously sharp surfaces the entire length of the handle/lever. That is not what I expect from this company. Also, when trying to return the defective product, Amazon directed me to contact OXO customer support instead. Not cool.",
        "I baked potatoes for an hour at 400 F, cut them up, then tried ricing them. I got through about half, when part of the connection between the grip and the plunger broke off from the plunger. Every time I try using it now, the plunger bends, making it less effective and annoying to use.",
        "bought this for Thanksgiving to make a large recipe of mashed potatoes. (serving 25) Loved, loved, loved the ease of mashing the potatoes through the ricer. Cut my prep time into 1/4. The potatoes also were creamy and smooth. My hands were a bit tired after doing so many potatoes and it had to be cleaned off a couple of times but in the long run much easier than ever before and I have been making mashed potatoes for many years. Looking forward to many more years of mashed potatoes. The price was right and less than I could find in local stores.",
        "Very good at it's job. Real tough too, I can prop it up in the corner of the sink and bounce up and down on it. The biggest problem is that the inside edges are freakishly sharp so you better be careful.",
        "This ricer is easy to use and feels like it will last a long time! The only downside is that there are a lot of little cracks and crevices that the potatoes get stuck in while you're ricing. You have to make sure to rinse thoroughly RIGHT AWAY or it'll be impossible to clean without tools of some kind because none of the pieces are removable.",
        "Very disappointed. This thing is so small it wont fit across a decent sized pot. In the pictures looks so big . NOW WE ARE STUCK WITH IT NOT ABLE TO RETURN THAT . We tried to print the return label, and NOT ABLE , means this item is not returnable. SO THINK BEFORE YOU BUY IT.",
        "I kept seeing chefs using this on the tv and thought I'd get one and see if it really made a difference in mashed potato texture. Oh my gosh.....what a wonderful texture. Wish I had bought one years ago! I love the padded handle and the extra handle length makes it easy to use. Cleans up great, too.",
        "I’ve used a bunch of ricers but with the nice handle grips this one makes ricing so easy and doesn’t hurt your hands. Great product.",
        "I’ve owned 3 ricers, this is the best for ease of use, sturdiness and hand comfort. Where it fails is, like all ricers that have a disc insert, is some potato squeezes through around the disc",
        "This will give you the fluffiest potatoes and is so much easier to use than the old school potato masher. I can put 5 lbs of potatoes through this thing in just a few minutes and it's way easier.",
        "It holds fewer pieces of potatoes at one time than I expected, and the potatoes that don't make it through the tiny holes come up the interior sides and sometimes on top of the piece pushing down. The overflow potatoes then fall off into the bowl. I was constantly scraping them back in. So if you don't mind a little extra work, the potato texture came out great.",
        "Aha! No more lumpy potatoes. Sturdy device. Easy to use for potatoes and cauliflower. I recommend it.",
        "I didn't give it a 5 star because it only has one size holes. It's hard with carpal tunnel to use but it's not the products fault. My husband helps me. Love the way it does the potatoes.",
        "It could be made a little sturdier, and have a better seal so the potatoes don't \"leak\" around the sides. But I have not found a better way to get fluffy mashed potatoes",
        "I bought this after hearing how it makes tastier mashed potatoes since it doesn't over whip or mash them. I have used it several times for mashed potatoes and find it easy to use. It is not convenient for large amounts of mashed potatoes (ie: large Thanksgiving family dinner) but does give the potatoes a nice consistency. I use it more now to make cauliflower \"rice\" since starting a more low carb way of eating.",
        "As always OXO hits the mark with a thoughtful design. This made Thanksgiving dreams come true by producing fluffy, light, and delicious mashed potatoes. I can’t wait to use it to make mashed sweet potatoes next!",
        "I boil potatoes in the skin, then cut them in half and put the cut side facing down into the ricer. The skin slides off and can easily be removed before mashing the next potato. Gets the potatoes done super quick, a nice consistency so the milk and butter stir in easily. Cleans up fine in the dishwasher. I only use it for holiday meals but the results are amazing - I get compliments every year!",
        "Good build and does exactly what we wanted it to. It's a little pain to clean, but really, aren't most kitchen \"gadgets?\"",
        "This is one of the best Potato racers in the market. However, it is too expensive for what it does... I will be fine paying $15 for it not almost $30...",
        "This is the best and what every kitchen needs! Potatoes were perfect and it was so easy to use! Now I need to know how to decorate my potato masher for the wall as I will always do my potatoes with this ricer. Works great for other veggies also! Highly recommend",
        "Some oxo products i find to be on he cheaper side of things. This one works exactly as advertised and is perfect for home use. If you are looking for something to use for larger quantities then you should get a larger ricer.",
        "Rice them spuds 'til your heart is content. Love to run butter thru it with the potatoes. Mashed or for Gnocchi, works great every time, easy to clean. Oxo hasn't disappointed me in 20+ years of consumer products. Good grips, good value.",
        "Love using this for mashed potatoes. So nice to have potatoes that aren't starchy. I used to have one that was bigger, that had holes in the side as well as the bottom. This one could be bigger but I get done with a big pan of potatoes in no time and my family loves them.",
        "Works great, cleans up fine, little smaller than I expected. Makes my mash marvelous",
        "Worked like a charm. I’ve never had such smooth potatoes. I’ll use it every time I’m making mashed potatoes or lefse.",
        "10 years and going strong. It is the best way to drain frozen spinach, which is a tip I picked up from Martha Stewart.",
        "Product came apart where is was soldered together during the first use. Cheap.",
        "Love this, so good and easy to use! Potato washes right off! Been using this to make gnocchi and the most divine mash potatoes",
        "Have only used to squeeze all the water from spinach I'd steamed and was using in a main dish. Worked great!",
        "My mother had one of these. I really never knew what she used it for until I decided I wanted to make some lefsa for our Christmas party at work. It works great on the mashed potatoes to get them really nice and fluffy!!",
        "Best textured mashed potatoes after using this tool. Worked well and liked how it could rest on the bowl as you pressed it.",
        "Gnocchi! I just learned how to make gnocchi in Italy and this ricer is a key part of accomplishing that. Very nice grip, easy to use, and washes up quickly.",
        "This thing is awesome. Everyone loved my mashed potatoes for Xmas dinner!! They were creamy with no chunks! Would definitely recommend.",
        "I had flirted with the idea of buying a ricer before & saw during Thanksgiving season that most chefs on cooking shows highly recommended ricing your potatoes instead of mashing (use yukon gold potatoes you’re gonna be amazed) and just adding butter & cream. My mashed potatoes this Thanksgiving were out of this world!",
        "Well, it does the job, sorta. Too much squeezes past the paddle that pushes the potatoes down. This is unriced stuff that you need to run thru again, only still some slips up the sides unriced. I'll be looking for one that does not let so much get by.",
        "I used this because I wanted real mash potatoes without lumps and it worked. You have to put some elbow grease to press the potatoes but it's well worth it.",
        "Been wanting one of these for awhile. Love it for ricing potatoes, cauliflower.",
        "It makes egg sandwiches so great so creamy.. just love it.",
        "I always mashed potatoes with a hand mixer or masher, and always had a few lumps. The cooking shows all recommend a ricer, so I finally tried it -- and it works. The Oxo Good Grips products are known to be comfortable to use and this certainly is. I boiled the potatoes in the skins and riced them right after draining. The skins are left in the ricer (but can be chopped and added back in if you like skins) and the mash is silky smooth with absolutely no lumps. The butter and milk can be stirred in with a spatula (along with garlic or wasabi for a great taste) and you have a product you can be proud of.",
        "I honestly don’t know how I made it this far in life without one of these.",
        "Bought this for the holidays to make my mashed potatoes better. After using this I will never make mashed potatoes again any other way! They were lump free and extremely creamy. I have also used it in steamed vegetables for babies. Homemade baby food has never been easier!!",
        "Great product. Eady to clean. Makes the best mashed potatoes.",
        "A Potato Rice is a must tool in every kitchen!. You use it to make the smoothest potatoes ever! It was certainly the best mashed potatoes ever!",
        "Works great. Mashed potatoes turn out smoother than I have ever made.",
        "Well made easy to use. I'll never go back to smashing potatoes again. This makes mashed potatoes fast with no lumps, and it is perfect for gnocchi .",
        "Works very well and I’m very happy to have lump-free mashed potatoes. The product is well built and sturdy.",
        "This is not a good product does not work well very very hard to squeeze",
        "I normally like oxo products quite a bit but this one surprised me in that it did not have sufficient rigidity so it was difficult to use. I subsequently purchased the adjustable rice or from oxo and it works great.",
        "This is very hard to use. You would need tremendous strength for this to be worth it. Would not recommend",
        "I never had luck with making mashed potatoes...until now. Easy to use, great results.",
        "I bought it to make hash browns the best way possible. It works just fine but don't kid yourself. It takes a fair degree of upper body strength to use this products effectively. Don't overload the basket to get the best results. And the hash browns do turn out crisp and tasty.",
        "I use it for making hash browns. Works great. Put it through a lot of abuse and hasn't broke. VERY TOUGH!",
        "This thing is amazing! The only thing I have to wory about now, is not over cooking the potatoes. You can even undercook them a ltl, and the ricer will still break them apart",
        "Hands down the very best way to make mashed potatoes. This is very well designed and easy to use and clean. Don't bother getting the ones with multiple screens, unless you have a specific application for them. This one has the perfect sized holes for making smooth and creamy mashed potatoes. The handles are very comfortable to use, with the signature OXO padding.",
        "Really good, used it 3 times this week on regular potatoes and sweet potatoes.",
        "I am a German teacher that uses this product to make Spaghettieis (spaghetti ice cream). Thus product worked well and my students loved this activity. I will be buying another one this upcoming school year.",
        "I am a self-proclaim mashed potato lover. This product has changed my mashed potatoes' lives forever, as they are no longer lumpy and condensed, but light and fluffy. Easy to use and clean as well! It might be considered a littler large for an average kitchen tool, but it gets the job done so I don't really mind that part.",
        "This works perfect to make gnocchi. This works perfect for mashing potato's for gnocchi, I have tried electric mixers and hand potato mashers and none work like this for gnocchi. If you make gnocchi this is a must have. If you are buying this just to mash potato use a potato masher or electric mixer if you already have one of those. why have another thing in your cabinet.",
        "Im not an oxo fan, but this one does the job. The only way to make fluffy mashed potatoes.",
        "It is dishwasher safe and it is already a very good point. My only concern is that working with it you 'feel it' a bit too light in your hands then it should, that's all and this is why the 4 stars instead of 5. Happy mashed-potato everybody (try the real/original parmesan cheese instead the usual cheese and a little, little, little *VERY LITTLE I MEAN* nutmeg powder). I love it! PEACE",
        "The potato ricer works fine and produces fine textured potatoes. I had thought this one was the one with the multiple adjustments on the underside. I had looked at that one previous to this. This one has one fixed hole openings and worked as advertised. I did make sure the potatoes were thoroughly cooked and soft. No complaints.",
        "I had one of these years ago and it broke! I didn’t realize how much I missed it! No need for a mixer. Smooth, perfect potatoes every time!",
        "Good product to have. Potatoes came out fluffy and good.",
        "Hard to get potatoes out of little holes in ricer. Hard to squeeze all ricers",
        "My niece is a chef, and she suggested using a potato ricer for mashed potatoes. And I have to say, I made the best mashed potatoes ever using this ricer. I only wish it were a little bit bigger so I could do more in each mash.",
        "There's such a difference when you use the right tool to make mashed potatoes. I used to do it the old fashioned way but this makes it easy and the potatoes come out extra fluffy. It's a well-constructed, quality tool.",
        "Never owned one before but now I’m not sure how I lived without it.",
        "The aesthetics of this product are nice but it broke after one use. I used it to rice 3 potatoes and the metal where the cup meets the lower handle started to deform and bend. I have been burnt a few times by low quality OXO products not lasting. There are better ricers out there for a little more money. I ended up buying the Norpo 469 deluxe cast aluminium jumbo potato ricer. The Norpor is a lot sturdier and has no such quality issues like the OXO ricer.",
        "I had never used a ricer to make mashed potatoes before - I love them but I always managed to overmix them and get a texture I didn't care for. No more!! This worked perfectly - it's a little small for a holiday dinner sized batch but it really didn't take long at all. Never going back to the masher!!"
    ]
}