{
    "entity": "Potato Ricers",
    "text": [
        "I'm a new fan! Glad I picked this one because I had a whole lot of mashed potatoes to make. My only complain is that the pin comes out too easily. If you tilt it a little it comes apart. It's suppose to come apart for cleaning but if it had a lock to hold it in place, it would be an improvement.",
        "I have tried various ricers and Norpro is the best. The handle is comfortable and it holds enough potatoes to make quick work of ricing. Some people say that the pin at the front of the ricer doesn't hold the ricer together. If you turn the pin so that the hook of the pin faces forward the pin locks in place. There weren't any instructions with the ricer so you just had to observe this from what the ricer looked like on the packaging.",
        "I like it and it seems to be sturdy. I wouldn't put it in the dishwasher, though. I would have preferred the handles to have silicone for a better grip, but it did make smooth mashed potatoes. The cup is larger than other ricers I've seen, which is why I bought it. You have to be sure the potatoes are cooked til tender. Wash it immediately after getting all the potatoes through (even before completing your dish), and you won't have a problem getting it clean....all those tiny holes will clog easily.",
        "Great product, can’t understand why I didn’t have one earlier. I suspect there will be a load of these bought for Christmas presents. The hindge pin is odd as it runs in a slotted hole and only engages at the loop ends. The problem is easily improved by slightly flattening the pin end. (See photo.)",
        "Love it. Makes light and smooth mashed potatoes. First time I've had a ricer and it works great. I can't believe I waited this long to purchase one. I like the Norpro in particular. It's very sturdy. Easy to take it apart and it's stainless steel so I can pop it in the dishwasher to get it sparkling clean. Good handgrips, very comfortable. Screens on both sides makes quick work of the ricing. Great addition to my kitchen tools.",
        "Upset I didn't buy one of these sooner! I have been making the most fantastically fluffy and smooth mashed potatoes since I purchased this ricer. I'm thrilled with its performance. It's a bit of a pain to clean, requiring quite a bit of scrubbing and, at times, soaking, but it's worth the work!",
        "Questionable quality and craftsmanship. Definitely Not suited for comercial use where food safety is absolutely vital (or even home use for that matter). It had a lot of lose pointy metal sticking outwards on the holes and around the unit. I found pieces getting on the potatoes. Also cleaning this is not easy because it has a lot of gaps around the seams of the unit where food will easily get trapped/clogged. Which later becomes moldy. This cannot be thoroughly cleaned by simply hand washing. Bad construction.",
        "I bought this for my boyfriend because he wanted it to make mashed potatoes. He is strong like ox, and it stands up to his meaty grip. When asked for comment, he said, \"I can only imagine what else I could rice with this.\"",
        "I use this to make hash browns. You load the shredded potatoes and squeeze the water out of them before frying. After breaking a couple of others these have proven to be impossible to break. Maybe the Hulk could bend them, but I can't hurt them.",
        "I purchased this for my daughter, who wanted one. I have the exact same brand, I've had it for the past 22 years and still works great!",
        "Last year at Thanksgiving, I was a guest at my mother-inlaw's house. She was boiling potatos for dinner when suddenly she pulled out a \"ricer.\" In my 52 years, I have NEVER heard of a ricer and watched her use it. I have to admit, they were the best mashed potatos that I have ever had. My 23 year old son is a great cook and he uses the ricer more than I do. Are you tired of lumpy mashed potatos? If so, a ricer is the solution. Once you use it, you will be hooked for life.",
        "MAKE THE BEST MASH POTATOES OF YOUR LIFE WITH EASE! I upgraded to this one from a different ricer with less ricing capacity, and am so glad I did.",
        "I bought this potato ricer for squeezing herbs for tinctures. It works great. A lot better than using cheese cloth and wasting liquid.",
        "After reading some of the other negative reviews I wasn't sure about this ricer. I'm glad I got it though! It works really well, we use it with red potatoes so they're not too big. The nice thing about this ricer compared to the traditional round design is that it has lots of surface to rice the potatoes. It was quick and we made short work of 5 pounds of potatoes. The only thing I don't like about it is that if you're not careful the pin holding the parts together might slip out, this happened once for me. Overall it's really easy to assemble/disassemble and clean.",
        "Solid product, difficult to clean sometimes, but you will make some QUALITY mashed potatoes with this baby, look up the video Gordon Ramsay does with one of these to make king worthy taters.",
        "The part that pushes the potato through is made of very cheap and thin metal. The flat surface needs to be three times thicker, only the second use it bent! Everything else on this is very thick and strong. Baffled as to why this was overlooked. I would have given it a 5 star otherwise.",
        "We use this to drain thawed spinach for varios recipes. This process used to be time consuming and frustrating since it had to be done by hand. This strainer really speeds up the process.",
        "Works great for ringing out zoodles and cauliflower rice as well.",
        "This was a great help at Thanksgiving! It's really large and was wonderful to make a large quantity of mashed potatoes very quickly. The mashed potatoes were light and fluffy and so much better than when you make them using an electric mixer.",
        "After my first use the metal bent. The item Didn’t align correctly. Threw it away.",
        "Works great easy to use and easy to clean, What more could you ask for ?!!",
        "This ricer works good for the price. I like lumpless fluffy mashed potatos & this unit really helps to make that happen, but I only gave it a 4 star rating because it doesn't process all the product placed in it in one ricing. Some of the product squeezes between the bucket & the press & doesn't make it through the ricer which requires it being re-fed, but that's not a deal breaker.",
        "Heavy and clunky, much better ricers out there, which I sent back.",
        "Useful to help make smooth delicious mashed potatoes and other mashed vegetable.",
        "Had no idea what to expect. Peeled, cubed and boiled 10 lbs potatoes with two bay leaves, placed them in this tool in batches, squeezed out the excess water and pressed potatoes through. Added melted warm butter, warmed cream, salt and pepper and gently folded together. Fun and easier than beating them with a masher. The less you work them, the less \"gluey\" they become from the starch. Hit of Thanksgiving, the first dish emptied, and the was a minor skirmish over the last few servings. Mashed potatoes usually play a spring role, but these, made in this tool, we're special!",
        "This was a selfie...I wanted to replace an old consumer unit. I have used it twice and love the way it works and cleans.",
        "I don't know how I lived without this thing in my life. I used to spend lots of time squishing and squishing the same potato just to have chunks left over, and sore arms. This baby smashes those spuds in seconds with hardly any effort. It's a really quick clean up, too.",
        "Great Ricer. Very easy to use and plenty of room for a large amount of potatoes. A time saver. You can get through a large amount of potatoes in a short time. I also like that you pull a pin to take it apart to wash in dishwasher and it is stainless so no rust. Great product.",
        "This is my favorite product to use for making perfect mashed potatoes.",
        "This item allowed me to make the best mashed potatoes of my life!!!!!!!",
        "This was recommended from an online recipe for ricing potatoes. The best ricer I have ever had.",
        "Looked good, felt substantial, but it bent irretrievably on first use.",
        "I purchased this to press herbal tinctures, infusions, decoctions, etc. The handle on top has developed a slight bend but this is normal given the amount of pressure.",
        "Having used one of these from Williams Sonoma, I wasn't expecting this one to feel so cheap. I do expect this to break or cut me.",
        "This is great! We have a small one that is hard to use and hurts your hand....this one makes the work so fast and easy!!! We riced 10 lbs of potatoes in no time!! Lefse has never been easier to make!",
        "this is an awesome tool that I'm using with cauliflower",
        "I only gave this 3 stars because I don't use it much because it is too big for my hands and I don't have enough strength to press it. I wish I had bought the smaller version. Good quality materials.",
        "This device is a life saver!!!! Very sturdy and durable and super easy to clean!!!!",
        "Was nice for a little bit but it broke after a few uses.",
        "Got this as a Birthday gift for my Mom because she was having trouble using her old one. She says this design makes it so much easier. This is a wonderful thing since it means more lefsa!",
        "Mashed 12 large potatoes like a pro for Thanksgiving. Worked like a charm.",
        "Unfortunately, I used this once as the handles bent half way through one pot of mashed potatoes. Do not buy.",
        "There was a metal splinter on the handle that got me. It was like a wire fused to the handle. Pair of pliers pulled it off easily.",
        "Excellent product, mom used one of these a long time ago, so glad to find it here. Easy to use despite my arthritic hands, and easy to clean",
        "Finally. A ricer that REALLY IS durable and does a fantastic job",
        "The ricer is great, it is sturdy and of good quality, it is of better quality than one I had several years ago and I am sure it will last for a long time.",
        "Broke during first use. The weld failed that kept the pin in place.",
        "Have always wanted one... works as great as I imagined! Used it for squeezing the liquid out of canned spinach and was amazed. Can't wait to try it with mashed potatoes.",
        "It still works but it broke the first time I used it. Best way to do mashed potatoes.",
        "This is the best potato ricer that I have ever owned! If you don't like lumps in your mashed potatoes then run them through this thing. Also good tool for making potato dough for gnochi",
        "A potato rises that is easy to use along with durability. My mashed potatoes are much more creamier. Great kitchen gadget!",
        "This ricer did a nice job with the potatoes. Unfortunately, I had left the skins on, and the skins stuck in the ricer and prevented it from working as smooth as it could have. I am looking forward to using peeled potatoes on the next try. This is heavy duty and should hold up well.",
        "Remarkably durable, easy to use and clean, and makes amazing mashed potatoes or riced cauliflower.",
        "It's what chefs use to make small batches ofmashed potatoes. Clean and smooth!",
        "Made over 15 lbs of mashed potatoes with ease. Works great.",
        "We love this potato ricer and use it a few times a week. I made pomagranate juice with it the other day.",
        "poorly designed - It bent initially in the handle and we were able to fix it enough to use. It quickly bent again - unusable after that.",
        "Would give five stars if the sides were perforated too. just my opinion. Very sturdy - should last a lifetime.",
        "I used this to squeeze spinach very dry, rather than for potatoes. It worked well, but it's clearly not commercial quality despite the name; it came close to breaking every time I gave it a really good squeeze. The spinach also had a tendency to leak out through some small gaps in the construction, and I assume potatoes would do the same. So I'll keep it and use it, but I'm already looking for a better-quality option.",
        "I love this. I had an old one from the 1950's. The commercial Ricer is out standing!!! It is easy to use and easy to clean!!!",
        "I usually have a very hard time using a ricer not this one couldn't believe how easy this one was to use the boiled potatoes went through this ricer like a breeze ...",
        "This baby is the goods! I use it for making lefse makes short work of the potatoes.Its very well built supper strong,easy to clean I love it.",
        "This is well made and exactly what I was looking for. I recommend this product. Makes the best creamy potatoes.",
        "I bought this Norpro Ricer and used it to rice about 10 lbs of potatoes on Thanksgiving. It seemed to work OK but the handle was bending a little when I applied a lot of pressure. It finished the job though and I thought it would be OK. The last time I used it, only the third time, the metal hinge that holds the handle on bent and I was unable to get it to work. I tried my damnedest to get it back into place with no luck. I would not purchase this item. A ricer should be able to take some strain without bending. Be warned.",
        "For my daughter-in-law from Peru, the country of potatoes, they have many dishes. Just like her mother's. good steel item.",
        "Use to strain foods such as spinach. Makes making mashed potatoes a breeze. Easy to clean.",
        "There is nothing bad to say about this machine! It makes the BEST mashed potatoes ever! It is so easy to use. The only bad thing is the clean up but the benefits outway this.",
        "this is the 2nd potato ricer I have bought.. the last was a big disappointment and hard to clean.. this one I would highly recommend as it is great for the job and easily cleaned",
        "potato ricer easy to use, no hard pushing, easy break down, easy cleaning great product. my wife really likes to squeeze the potatoes .",
        "Awesome piece! I've been making lefse for about 3 years and this is by far the highest quality to handle all of the potatoes that I rice.",
        "Very good quality and value for money, very pleased indeed!",
        "Made excellent, lump free potatoes! Very easy to use- need some strength to press potatoes. Remove pin to clean press.",
        "I replaced a more conventional ricer with this one. Greater capacity means fewer fills and it takes much less effort. When ricing potatoes, they are almost creamy to start.",
        "Commercial? Where, in slobovia? this thing actually FOLDED UP when I attempted to rice a pair of par boiled sweet potato....It went pretty much from the box, into the garbage can. WHAT A PIECE OF CRAP!",
        "This works OK for a potato ricer with cooked potatoes for mashed potatoes. However, I also use it for squeezing the starch out of grated potatoes before frying them, and it bent the first time. Useless for that.",
        "Hard to use. Volume of basket too large. Span of handles too wide for use. Difficult to remove all products",
        "Product would fine strong construction and stainless steel.Functions what it should.The Big issue is the fact that they have FINGERLING POTATOES pictured on the box.I an a Exec Chef and it is fine for a couples dinner but sad for large production.Picture is misleading and false advertising..",
        "My son, who's otherwise a great cook, sometimes seems not to know his own strength which resulted in our last ricer looking like one of David Moore's abstract sculptures filled with unexpected curve. Though this ricer looks a bit like the others, while costing somewhat more, it's well worth the money. Suffice it to say it's built better and more heavily, making it much more likely to be handed on to my son someday. If you've not had mashed potatoes made with a ricer, you've not had real mashed potatoes. They're simply better in both texture and taste. The ricer works well with squash, rutabaga, parsnips and even carrots, even well cooked beans - any well cooked, non-stringy vegetable.",
        "Manufactured out of stainless steel, This ricer is dish washer safe and almost indestructable. My first one worked for 25 years until I let my 3 year old granddaughter play with it. Make's perfectly riced potatoes for mashed, Polish pierogis or Italian gnocchi. Pay the extra money and get this kitchen tool. Cheap plastic imitations are worthless.",
        "This is described as a commercial grade, and it's fairly thick stainless steel construction justifies that. The problem I have with operating it, is that potato in the hopper squishes through gaps around the \"pusher\" and escapes the tool rather than being pushed through the strainer holes. If it was built with closer tolerances, this would be less of a problem.",
        "This is the one ricer that ruled them all. None makes better mashed taters than this bad boy! And it doesn't stop there either. you can rice many different veggies with this tool. Don't think just buy it, I love mine and its so easy to clean.,.",
        "Works best with baked potatoes and degrades from there. Softer products ooze out around the edges of the pusher, up to half end up in the back. The original purchase was returned for misaligned assembly. The pusher handle was cocked off to the right by fifteen degrees. The replacement was returned after the spot welds connecting the pusher face to the handle failed while ricing baked potatoes for a large Duchess serving at a dinner. Ten pounds shouldn't a life cycle limit, even if it was during a single prep period. The final replacement hasn't failed, yet. There is the possibility of another large Duchess prep. However, at this point it might be more reliable to use the food mill.",
        "Nice ricer. This one holds quite a bit so it makes the job go quickly. The construction seems sturdy and it breaks apart easily for washing. I saw a few reviews when trying to decide to buy that the handles bent when using. My question is what were you shoving in there. The only reason for 4 stars instead of 5 is that the pin holding the two pieces together seems to want to pop out of one end easily. Can be slightly annoying if you have multiple things to rice like a large batch of potato's for making gnocchi like I do. Otherwise good product.",
        "After first use I gave this ricer a 5 star rating. Made great fluffy potatoes. Some waste because masher did not go completely to screen, but I could live with that, Fine on second use. Third time the hinge pin bent, the unit came apart into pieces and couldn't be reassembled for use. I give it one star because I can't give it none.",
        "This ricer is fabulous. We make our own gnocchi. Ricing the potatoes is an important step in preparing it. We have two ricers. One is from an upscale, well known store. This ricer is less expensive AND it works like a champion! The BEST design element of it is cleaning it. My expensive one takes me twice as long to clean. This one comes apart. It’s a snap to clean. We love it!",
        "As the picture shows, this is a poorly made product and bent badly on only the 5th use. Also, Like another reviewer said, the piece that presses the food agains the screen doesn’t meet so not everything gets pressed through the screen.",
        "It may be the way they all work, but I lost a lot of potato oozing up the sides over the top. I used it for sweet potatoes, which I know are fibrous. I did like the fact that the fibers were left behind. It makes using sweet potatoes in recipes much nicer without the stringy fibers.",
        "Sturdy, dependable, and large! Love this device. It is large in length and large in it's capacity for big chunks of potatoes. This hefty instrument produces deliciously creamy and airy mashed potatoes. Shortened mashing time in half.",
        "5 stars all the way! Makes the best mashed potatoes....I've always done them in my mixer and now I know why they were always starchy. Not starchy at all when made this way!",
        "Making garlic mashed potatoes for years, but using the ricer not a lump in the pot. If you want smooth; melt in your mouth potatoes, then you need this ricer, better than restaurant quality",
        "This one will never break or bend out of shape!",
        "I've never had one of these before, but it works well. If I'm in a rush, I will skip peeling the potatoes and just mash them with the skins on. Makes great mashed potatoes! Going to try cauliflower next...",
        "For years I'd been looking for a good ricer to make mashed potatoes. This one turned out to be exceptional in every respect: Solid workmanship; easy to clean; and not overly large.",
        "This thing is built tough! I was so pleased with the craftsmanship in this ricer, it is built of a good stout quality of stainless steel and in no way flimsy. This will last my lifetime for sure and be useful for the generations after me. It was a first for us using this to make mashed potatoes after a lifetime of the wire-form masher and I am in awe of the difference. Everyone in my family loves the new way of making mashed potatoes.",
        "Pros Heavy construction Easy to take apart Cons Pseudo sharp edges on handle VERY SMALL mesh Mashes food---Does not rice food The stop is too high to fully press the top part against the mesh. Expensive bad design. Avoid this product",
        "Excellent tool. Great design that makes it easier to rice the potatoes but also makes it so easy to clean. You are able to wash each part separately. A little pricer than average potato ricer but a game changer",
        "For years I've been peeling potatoes by hand whenever I made mashed potatoes. Not something I enjoyed. A friend recommended I get a ricer. I saw this Norpro Stainless Steel Commercial one on Amazon. It was a good price and free shipping - I decided to take a chance. I was surprised at how substantial and sturdy it felt. So many things you buy these days are so flimsy. I've used it a few times already and it works great and cleanup is a snap!",
        "LOVE this tool! It is the easiest way to rice hot, cooked potatoes for great mashed potatoes. Very easy to use (one handed, rices from two sides) and clean. MUCH more practical, useful and cheaper than a food mill, in my opinion. Great buy!",
        "Purchased to use for family gatherings to try \"ricing\" mashed potatoes. Holds a surprisingly large amount f potatoes in the base of the press, is easy to squeeze and washed well in the dishwasher. Easy to use, made nicely sized potato \"rice\". Would purchase again, well made product.",
        "Really bad quality and hard to use. Get the one from Williams Sonoma"
    ]
}