{
    "entity": "Heaters & Accessories",
    "text": [
        "A very good heater, but with a thermostat that unfortunate activates even when \"off\" as soon as the room's temperature drops to the mid-forties. A convenient feature, perhaps, for bathroom or other plumbing-related installations, but \"off\" should mean off so that installations in an often-vacant space, such as our guest room, doesn't waste electricity by pumping out heat during cold winters when it isn't needed.",
        "Easy to install but it does not come with a knockout clamp to hold the house wiring within the box. It does show that on the instructions so I had to stop the installations and go and get a clamp. It seems that it should have been included (only $0.80).",
        "Love this little heater! We installed it in our new poolhouse bathroom. It only takes seconds to warm the bathroom when using it in the winter.",
        "Just installed in my bathroom. Install was easy and straightforward. Took maybe an hour- It seems to put out nice heat and is quite. We will see how it works as I use it over the next few weeks.",
        "Heats our shower drying off area nice. I had to add a door to to keep the heat in the area PS I used one of those Full glass barn doors from HD",
        "These Cadet heaters have been around for many years. They are so easy to install and work great. I have installed many of they. All have worked perfect for many years with no issues.",
        "There is no temperature control. It puts a nice heat out but not downward. I wanted it for my feet. It only goes up. It’s quiet but it’s not a strong fan. All in all it’s fine.",
        "Works great but need to have an electrician install and would recommend thermostat on wall. Heats very well and does as advertised.",
        "We haven’t had too use the heater yet.but it fits great in our bathroom. I’m sure it will be just what we need in the winter",
        "Unfortunatly electrician reccomended another way to heat building. Returning was easy. Thank You.",
        "Really like this heater for a bathroom. Throws out so much heat so quickly. Not really very noisy either. I would highly recommend it. I have bought a couple of these.",
        "This works great at heating up my bathroom. I just wish it was the same size as the old (1970s) Cadet heater it replaced.",
        "This little heater works great and kicks out a lot of heat. Very quiet, easy to install, and very affordable. What else is there to say?",
        "I used this to replace an old Cadet. Same footprint. Even used the same sleeve.",
        "Easy to install and keeps our pump house warm in winter",
        "Same heater as I had before. Decent heater for the price.",
        "Arrived on time, is what I ordered, installed easily and works great!",
        "Very quiet. I installed this in a bathroom. Heats the room up quickly. It was easy to install. I would recommend it.",
        "Heater works great, but buyer beware, we ordered the one with the thermostat included, the box said 'thermostat included', but the thermostat was not included. We didn't have time to return the item so we wired it with an external thermostat which works fine, but heads up.",
        "Works well and very quiet. The inside electrical parts (like coils and fan) are not protected. As a result if the enviromnet that is used in is Not very clean, the fan will accumulate dirtand might get clogged to a level that it will disable the heather.",
        "This item was exactly what the listing said it was and it works great. I do feel that it took to long to ever ship out.",
        "Works great for my small office. Only problem was getting screw holes to line-up. But great product.",
        "Great little bathroom heater. Easy to install. The 1500 w is perfect.",
        "I bought this heater for my daughter's play room for some additional heat to make sure it stays nice and warm. Unfortunately, the thermostat wore out about 10 months into the heater's life so now it runs constantly. I have to turn if off at the electric panel which isn't very safe and very inconvenient.",
        "Quiet for the amount of heat it puts out. We have these installed in our hallway and bedrooms. Not strong enough for a larger space, but perfect for a bedroom or bathroom size room. Recommended."
    ]
}