{
    "entity": "Heaters & Accessories",
    "text": [
        "Using two of these in a 1000sf garage. Garage has three bay doors and 12' ceilings. The garage is NOT insulated and has cinder block walls. One heater on \"High\" brought the temp up from 26 degrees to 52 degrees, but two brought it up to 78 degrees in 24 degree weather. I will be overriding the internal thermostat this week and installing a manual thermostat for each unit to better control the garage temp. Great heaters. Each heater is rated for 500sf.",
        "Don't even waste your money and time... Mine came defective right out of the box. Called the Manufacturer who offered no instructions or assistance. The fan does not run until the space heats up to 55 degrees. If the unit doesn't run it cannot get up to 55 degrees. Found out there are many reviews online advising the same issue I had. Supposed to be a garage heater, not impressed. Wasted time, and out the money on the wiring and plug connections.",
        "Why 1 star?!?! Who the f designed this thing so well then didn't put way to TURN IT OFF?!?! I'M LIVID. I have to cut it at the breaker or else it'll run day and night. $$$$$$$ Now I have to figure out how to wire a thermostat or pay an electrician $$$ to do it! Whyyyyyy? In the meantime I'm scared I'm destroying the heating element because it gets no cool down when I just cut it. There's a knob, but it doesn't turn it off. The knob doesn't actually DO ANYTHING. Mind boggling.",
        "This heater I cannot say enough about it, purchased for our 2 car garage (living in the North East, much needed). basically set it and forget it. When the temp reaches desired setting it will turn on and off automatically. Very quiet and produces the heat! You must have this heater hard wired in, not a plug in device like a garage opener. Definitely worth the money, if you are looking for a basement or garage heater this is the one. Dimensions are exact.",
        "Nice little heater. I use this in my garage, about 26’x 28’ with 9, ceilings. Keeps it nice and warm. Doesn’t take long for the heater to kick on. Has a small delay from when you turn it on before the fan kicks on. Real quiet, I use it to keep the garage above 40 in the winter and garage projects. I would buy again. It already come wired for the highest wattage. So no messing with it if that’s what you are wanting. I used it on a 30 amp circuit breaker. We will see how much it raises the electric bill!",
        "This is a fantastic heater. The installation was easy. The temperature control is just right. It is located in my wood shop that is separate from my house. I turn it on and in about 15 min the whole shop, about 500 square feet, is nice and warm. This is when the temps are 20 to 30 degrees Fahrenheit. It is a must buy for all shop owners.",
        "Great value. I had this heater installed in a 20x10 garage space (with no ceiling yet, so it's open to the rest of the garage). This heats up that space quickly and efficiently. Thru another review, I got the information needed to purchase and connect an external digital thermostat so I can use that instead of the one that's built in. The only slight negative is the mounting bar, which is fairly flimsy. It'll be just fine if you mount to the ceiling and hang the heater that way, but if you mount to a wall the bar will bend and sag.",
        "louvers were not same color as unit, they were aluminum. after installation it had to be taken apart as the fan was bent. it was really bent see photo. everything would have been okay if it weren't damaged. very concerned about the quality, about how long this will last. Amazon customer service did all they could do to help. wish the product was as great as amazon customer service. i have two more to change, hope the next two are like this one. one star for this item, 5 stars for amazon customer service",
        "Folks..be real careful of wiring system...my unit bought one year ago...worked fine..this winter came out one morning ...shop cold..pulled bottom panel off ...black wire from inside unit sparked main wire from 240v and luckily no fire resulted...power terminal block burnt..didn't trust it. Now will admit been working with Marley Engineering and they have sent me new terminal block and heavier gage wiring but I'm not a electrician and can't find one to rewire the unit..I've ask for new unit..no response yet...again be careful of wiring system...",
        "Great heater, easy to install. There are jumpers so if you have a 20 amp 240-volt circuit, don't hesitate to buy this. Move one jumper inside and you will limit power consumption. I changed my breaker and wiring to 30 amp and it was good. I have not needed to go higher than half power yet. Oversized 3-car garage and this heater does a great job. Super Impressed!",
        "I have purchased 2 of these units - and each failed after 1 years time. Not sure how all of the positive reviews could be valid. guess I had really bad luck. Won't be purchasing another.",
        "Works pretty well. It is slow to come on, but when it does it is satisfactory. I wired it up in line with a thermostat switch. It works well to take the chill out of the garage/shop. If it gets too cold outside, I likely won't want to be out there in the first place to spend the money on electricity. But when I need to be working on something, I can do it now without the need to take warm up breaks.",
        "Garbage. Fan won’t spin. When I gave it a couple wacks on the side it started screeching like a bat outta hell. Also, it doesn’t actually have an internal thermostat. It was running on low even though it was 90 degrees outside. Don’t know how such a hunk of junk can have so many good reviews. Also it was just put in a larger box and was banging around inside that box when I received it. Terrible product on every level.",
        "Like other reviewers, a power lead melted at the junction. Possibly undersized terminals, or a poor crimping job. Solder and copper wiring melted. Unit lasted 13 months. I have rewired the melted wire to connect under the screw terminal, bypassing the terminal connector. Unit seems to be working fine now.",
        "This product advertises its usefulness as an overhead heat source, but the fan is not powerful enough to drive heat to the surface if ceiling mounted. I would look at other products before relying on this one to heat your garage.",
        "I've started a small home-based business that requires me to be in the garage doing woodworking. Being in Iowa, I need a source of heat. This has been PERFECT. It puts out very nice heat, and the fan is strong enough to push it to the other side of the garage, but it is not loud by any means. Very easy hook-up and operation. It's been perfect.",
        "I have a 2 car detached garage. The product needs to be hardwired into a circuit breaker(note: doesn't plug into outlet). No need for a thermostat as the product has an adjustable heat setting and will not overheat. If you were looking for a heating unit with a thermostat setup, I would suggest a gas heater. I only need this for time to time to work on projects in my garage. I put a switch on it and within 15-20min in winter my garage is workable and you can really feel the heat as it keeps running. It is quiet and powerful. I recommend the 7500 for larger garage, but this was perfect for my garage. Price is great too.",
        "I have had this heater for 2 weeks now. I put this heater in my 650 Square foot insulated garage. AWESOME. QUIET. 20 degrees outside and heated entire garage up no problem. I didn’t take temps but was warm in shorts and a t-shirt. About an hour to heat it up. 0 degrees with the windchill outside and still comfortable warm in a long sleeve/hoodie. Not quite as warm. Better then expected though. Took about an hour to an hour and a half to get temps warm enough to be comfortable . Happy with this heater. Quiet and heats perfect for my size garage.",
        "So far so good! Smaller than expected but works pretty good on my insulated 700 sf 3 car garage. The last few days it has been around 30 degrees outside and around 58 degrees in my garage. I wake up at 6am, turn it on for about 20 minutes and it gets up to 65 degrees on low. Then the room is ready for my morning workout!",
        "Worked great for 15 months, heated up a shop for one winter season. It has been working for the past week, keeping the shop to a low (65) temp with outside temperatures around 50. In other words, not working hard. It stopped working today, and upon disassembly it was found it burned through one of the connecting wires from the plug. I don't know what overheated, or why. After that, I certainly don't want it back in my (unsupervised) shop! Two stars because it did work well for the year.",
        "This unit was installed in a single car, insulated garage. The unit can be installed with a wall mounted thermostat. The unit will keep the garage warm on the coldest winter days in the northeast.My only complaint is that it takes a long time for the unit to heat up and warm up a cold space. The unit is better suited at maintaining a heated space and not heating it from a cold state.",
        "works great !! the thermostat takes some time to find the right temperatures on the dial. One mark can be too cold or too Hot. Wish it had a Wall thermostat. We are using it to heat a small greenhouse 16 x 22 with a polycarbonate roof our average electric bill has been $70 much cheaper than propane.",
        "Installed this heater in my insulated 20x28 shed. I had zero electrical knowledge prior to the install. After lots of research I decided to install it myself and it was pretty easy 10/2 wire directly into a double pole 30 amp breaker. The unit heats the entire shed in about 10 minutes",
        "I live at 4300 feet in the Cascades of Oregon with a 24' x 24' Garage. This keeps my garage very comfortable for everything from varnishing to auto mechanics. It does make your electric meter spin, but it will keep you warm. When I need the heat its there for me.",
        "Given the other positive reviews I suspect my unit slipped through quality control. The fan seems to be mounted with two rather than four screws. As a result, the fan is very noisy.",
        "Heater did not even last 6 months. Use my experience, take your money and spend it on a product that has a proven track record.",
        "I've wanted to install one of these heaters in my shop for many years and finally got the opportunity. Totally pleased with the product and the service it's providing. While my shop space is a hair over the recommended square footage, the heater is able to warm things up in a reasonable amount of time as well as maintain a comfortable environment to work in when it's cold outside.",
        "Easy to install. Local electrician did it for a reasonable price. Temperature adjustment is not very accurate more adjust mob until it hits temp where you want.",
        "It does do the job but it is very diffcult to regulate the temperature.",
        "so far so good. Using it to heat shop overnite when wood stove not burning to keep water from freezing and so far works great. Not sure about cost of electric but water is flowing on some cold nights... all that is important right now. Been running on low setting also",
        "I have this heater set up in a 322 sq foot garage. It heats the room up very well. It can get the room up to 60 or 70 in an hour in 0-15 degree weather. I have it connected to a honeywell thermostat and that combination seems to work very well. The fact that it is connected to a thermostat however means it runs at 5000 watts whenever the heater comes on which sucks up more energy but that is how I wanted it to be used. The heat it produces is excellent and was very surprised by it's output.",
        "Easily heats my 20x20 garage (with high ceilings) to the mid 60s with the thermostat turned up barely halfway. And that's during winters in Buffalo, NY. Wiring was straightforward, and there are plenty of YouTube tutorials dedicated to getting it installed correctly. Would recommend to anyone.",
        "It has been a great heater. Only problem I had is when the fan ran I would get a \"rattle\". It wasn't caused by the motor but the back screen/grate behind the fan. Just kind of tweaking/adjusting that made the rattle stop. Been good so far, time will tell..",
        "heater worked great for about a year and then died...",
        "I had this installed for one week and it started rattling and making a terrible noise. It was beyond Amazon‘s return policy at this point so I went and contacted the manufacturer they fortunately are sending me out a new motor.",
        "This is exactly what i needed to heat my garage. I have used it only a hand full of times because it hasn't got that cold yet (40s and 50s) but so far I am very happy with it. The test will be when it gets below freezing.",
        "Bought two of these and had an electrician install them in my basement. They pump out nice warm air, easy to set and are much quieter than I was expecting. Very happy with this purchase",
        "Product was packed well, arrived fast had a electrician run line and tie in to box installed in no time ,only issue was it was missing one screw in front there were supposed to be 6 only had 5 I had one similar so I put it in works very well in my basement workshop/ gym",
        "When it arrived I thought it was way too small to do the job of keeping my two car garage warm enough for me to work in my glass studio. I was so wrong! This little baby does a GREAT job. Love it! I keep it at it's lowest setting most of the time and it is really very comfortable out there. (Mind you, this has been a very mild winter thus far in PA)",
        "It matched the brackets of our previous garage heater perfectly, even though it was a different brand.",
        "Fairly easy to install. I had an electrician wire to the circuit box. I did the rest. It is quiet, but it will vibrate through the ceiling to the room above. Not awful. Heats great and the mid setting works well. I used in 10 degree outdoor weather in my garage which is insulated. I was able to work in a tshirt",
        "I wish this model came with a remote. It only turns on or off by a built in thermostat so I ran a wall switch so we can turn the power on or off without getting a ladder. So far it is a great heater. Have it heating an insulated two car garage",
        "This unit throws the heat! Very easy to install. One drawback is it's fan is very loud.",
        "does the job and very economical on my electric, about $35 per month and I keep my kansas garage of 400 SF warm",
        "I bought this for the garage. My husband works out in it from time to time and it is so cold. This heater is perfect.",
        "using to heat my 24x24 uninsulated garage. I am impressed with how quickly it brings the temperature up to 55-60 degrees",
        "I bought 2 of these heaters. One worked perfectly, I returned the other because it vibrated terribly. I mounted the heater to square tubing & joists. Wired using 10/2 dryer cord to 30amp breaker.",
        "Electrical diagram isn't the best and the mount is a joke, made my own. While they make power consumption very configurable, you have to add your own switches to do so on the fly. Not a big deal, but for the price you would expect it included.",
        "we have a 2 stall garage and the heater works well in MN when tempratures are above 0 degrees. It will warm the garage a little when the temp gets to -10 or -20 but not has well- has to run constantly, which is understandable. We love to use it when we have projects that need done, painting and woodworking. Our garage is attached to the house, stays a little warmer that way. So we don't run it all the time.",
        "Very disappointed with the packing. The box was over sized for what was inside due to the fact that there was one little piece of paper inside to keep the unit from banging around. The outside box arrived okay but the box inside had a big hole in it and the bottom of the box was already open. Someone needs to talk to the shipping department. Unacceptable! Hopefully the unit works better than how it arrived.",
        "Keeps the temp at 50 here in Idaho where it can drop below 0. Easy to install. Very satisfied with this product!!",
        "This is used in our attached garage on the coldest South Carolina days, either to keep plants warm, or to warm the garage when we give the dogs a bath in the laundry tub. It does the job quite well in an oversize 26x28 foot garage with 11 foot ceilings. So far so good.",
        "Don’t let the size of this little guy fool you, it throws some big heat. I have it running in a pretty well insulated area. Temperature outside was 38 outside last night and it was 75+ inside (one click above lo setting). Built in thermometer went above my expectations as the unit hardly had to run to maintain a more than comfortable temp.",
        "Works great. I installed it using a Honeywell thermostat. Easily maintains the set temperature in my two car garage. Note: my garage is insulated.",
        "30 amp Breaker. Dryer type plug and cord. Make sure you know what your doing as far as the electrical work. Everything works as advertised. Have a standard two car garage in mid-west and it does a great job. I highly recommend.",
        "My garage is 24x30 has a 1/2\" insulated ceiling but walls are not insulated. Heater does a great job and thermostat works well to keep a steady temperature even when it is 30 degrees outside. I have it set on lowest setting and after a hour it is up to 50 degrees and 1/2 hour after that 60 degrees and that is where I keep it for working. It does get warmer if I turn the thermostat up. Good product so far and I would recommend it.",
        "Got it for my 700 SF insulated garage. Works great. Already had 240 running for welding that I never used, so setup was fast and easy.",
        "I bought two of these at the beginning of last winter and was absolutely amazed at the amount of heat they produce. I used them for an entire winter and they are still in perfect condition. They do not come with a power cord. You will either have wire it yourself or have it professionally installed.",
        "I replaced an old 10,000 watt unit with this one, and it heats my space faster and quieter. I installed a digital thermostat based on the information given in a previous review, so I cannot speak to the temperature control built into the unit.",
        "I bought this unit for my 530 sq ft garage with 2 regular windows, two wood garage doors with windows across both an entry door with windows and an 8 ft ceiling. I mounted it from the ceiling with 1 bolt and about 12\" from the side wall so I could change directions if needed. Then got a local electrician to install a 220 line with outlet on wall and flexible cord with plug from the Heater. About 200.00. All I can say is this little heater Is far far better than I could have ever expected. it's quiet, no rattles, nice flow of air and the temperature range settings are about anything you could ever want and more.",
        "What more can be said. This Heater packs a punch for its size. I installed today in about an half hour. I already had power to the spot that I replaced a New Air with. There is not comparison to that unit. The garage was at about 35 today and within About an hour it’s up to 70. My garage is insulated at 600 sf. I kept the old bracket and just mounted the new heater to that. I had to turn it down to two clicks because it was getting too warm out there. If your looking for a great electric garage heater you will not be disappointed.",
        "This thing works like a champ. After a trip to the hardware store for needed parts, we able to get it wired in. Heats my entire garage on “low” setting with an ambient outside temp in the thirties. Garage heated to 70 degrees in northern Illinois. Highly recommend.",
        "So far so good.outside temp has only got down in the 30deg range.only used it a week,and have not had a electric bill yet.I think that will be the real eye opener.will update after extended use",
        "The item arrived well packaged and in a timely fashion. It is doing a great job of keeping the basement at a comfortable temperature. I live in the North East and our basements are cool in the winter months. It was relatively easy for my handy hubby to connect and is working just fine. I hope that it is not too much of a pull on my electric bill, but we will see. It is set on automatic.",
        "Nice heater, just installed it. Puts out a reasonable amount of heat. Don't know how much it will impact the electric bill yet.",
        "Haven't had it very long but it seems to be working as advertised.",
        "Easy to install. Kicks out the heat in a small package. Well made quality product.",
        "Draws more current than the one I replaced - had to have the electrician in. Not a knock on the heater...do your home work and buy what you need.",
        "heats well....but really does use a lot of electricity.....dont quite know what the deal is.....",
        "Great heater and I feel safe leaving it run with the thermostat that I purchased .",
        "This is a great little heater. We use it on our sun deck in Korea when the night tempertures drop to freezing and below. It keeps the sun deck at a very comfortable temp when thermostate is set just slightly above low. Extremly good product for the money and easy to install.",
        "This unit was just what I needed. My garage space is 30 x 40 and the heater is perfect. Easy to install, quiet and efficient. Had our first snow storm last week and the family enjoyed their warm cars and dry garage.",
        "I heat my 1200 sq ft office. It is amazing and the thermostat is perfect. We leave it on low when we leave the office and kick up to the 2 line behind hot and it heats the office up so nice and toasty. WE have windows all over our office as its a corner office on the ground three blocks away from lake michigan in Chicago. Its true what they say, its a windy city!!! You may or may not need an electrician, we got the building facilities manager to install it with a 240 watt, 30 am plug and wire. Great buy,",
        "I have only used it for 2 weeks, but up to this point it has worked great. I have a 24x20 shop( 2 car garage ) and this heater has been plenty since installing it. It's small and light weight. I have it hanging from the rafters so it takes up no space and is easy to get to the control. It's 10 degrees today and it took maybe 40 minutes to get the shop up to acceptable working temp.",
        "I bought 2 units for my 1250 sq ft detached garage in Montana where winters are EXTREMELY COLD!!! I may have been able to get away with one however placed one in each corner which easily does the job! I can keep them on a low setting which maintains the heat near 50' for 3 months and then turn the units off come March.",
        "Safe, powerful. I bought one for myself and a buddy. We both installed these units in 2 car garages which are consistently cold and foreboding in the winter time. Suffering from a general discomfort in a cryogenically frozen \"shop\" leads to less productivity and avoidance of cleaning the place up. Within 20 minutes the heater created a comfortable, fume free environment which started at 41° F. Shedding jacket and my husge sweater and hat was strangely odd because I have needed polar survival clothing in the shop since early December.",
        "Works very well, I had one before for 20 years and never had any trouble. The room in the garage is 12' x 24' and it will raise the Temp 45 Deg in 1 hour I already had the power run and connected just like the old one. The new one work better than the old one ever did.",
        "Works too well on high. I have to keep it at medium or lower. This is a good thing.",
        "Great looking heater but could not use because unit was 240 v two phase.",
        "Thought the heater is a great value and easy to install but....RIDICULOUS PACKING. As seen in the photo, the packing box is at least twice the size it should be and no packing material. Luckily there is no damage to the unit.",
        "Two units work well for a large detached garage in NJ. Electrician installed and upgraded electrical service to garage to handle the load",
        "Works great. Keeps 2 car garage nice and warm during cold winter months.",
        "I received this on Jan.5th 2018 and now the motor is going out of it. It vibrates so bad you can feel it in the floor above the unit. I have tightened every screw and bolt on it but this motor shakes like a leaf. I'd probably steer clear of this one if I had to do it again.",
        "I love my new heater. I purchased it for my 24 by 26 foot garage to replace a ventless gas heater which had left a tan deposit all over my walls and ceiling after a few years. I like the idea of CLEAN heat. It keeps my garage at 52 degrees on the lowest setting and quickly warms it up to 60 degrees at a setting just above low. I'm recommending this heater to all my friends. It was easy to install although the company should take a look at their rather confusing wiring diagram. I give it 5 stars in spite of the wiring diagram because I am so happy with the operation of the heater.",
        "I installed the unit December 20, 2014 in my 30x30 metal building that is well insulated. So far I am satisfied with its performance, and quietness of operation. On cold days it does take a little time to heat up the building. To keep from using my circuit breaker to turn it on and off or using a latter to turn the thermostat down, I installed a \"double-pole double-throw\" 30 amp switch in series with the thermostat to cut the unit on and off for my convenience when leaving the building. Overall I am satisfied and would recommend it to others.",
        "Found this unit to be (1) easy to install with the removable bracket (2) has power lugs on the connection strip (3) temp control is easy to adjust. Heats a 24X24 insulated garage to 65 degrees in below 0 degrees with setting at midrange.",
        "I suckered into two of these Heat never gets Hot and fan doesn't put out any CFM or air flow",
        "I wish it was bigger and covered more square footage, but it is what it is. I purchased this heater for the followship hall of my Church, it does well on cold eves but I have greater sq. footage than it can handle so I had to section the area off. I do recommend it.",
        "Doesnt heat 2 car garage as well as expected. After running for over an hour it might raise the temp about 5 or 10 degrees warmer. Does almost nothing for a freezing cold garage",
        "This heater is awesome. It heats my 2 car garage (insulated) with no problem. It has been below 0 here in MT and my garage has maintained 54 degrees! This is by choice, I could get it warmer. Easy install, built in thermostat works fantastic. HIGHLY recommend.",
        "Heats my 24 x 16 barn warm enough to use as a wood shop in the winter.",
        "This is a fantastic heater for my two car garage, I bought it because it was getting to temps in the 40s in my garage. I put it on and it will heat it up and then shut off when desired temp is reached. I highly recommend it",
        "Was a little hesitant about this heaters ability to heat a 3 car garage, but it truly works. I had it professionally installed by an electrician and it does the trick. I work every evening in my garage in my woodworking shop and this really heats the space up. I only leave it on during the hours that I'm working in the space, but within 10-15 minutes the garage is more than comfortable.",
        "I have only run it for about two hours, but so far it seems to work as advertised. I wired in a 6 foot heavy gage cord so that I could plug it in to the welder outlet in my garage.",
        "This heating unit works great to heat my garage in Michigan it has be cold here this year. My heat bill was not hurt by the unit being on all the time.",
        "good value, I have a few of them, pretty quiet",
        "We have a 785 sq ft garage and it keeps it really warm (70 degs) at the lowest setting.",
        "Fills a 13 x 30 non insulated garage with heat in north carolina. Electric cost of about $40 per month when used daily on weekdays",
        "I have a 980 sqft garage w/ 10' ceilings. It is fully insulated. This unit works very well.",
        "All I can say is this heater is fantastic. I have a non-insulated garage not connected to the house and after only 1 hour it raises the temperature a good 20 degrees. I don't need to work in shorts and a t-shirt so this is plenty to take the nip out of he air and allow me to work in the garage all winter long!"
    ]
}