{
    "entity": "Heaters & Accessories",
    "text": [
        "I've replaced 3 of the Model 154 heaters in 15 years at this house. They work, but they also don't last long. I'm hoping the 157 will last longer. Installation was simple--took less than 30 minutes to swap out the old 154 heater and install the 157. As expected, this heater takes about 2 minutes to warm up, but it gets my 160 sqft (15 sqm) bathroom toasty in under 10 minutes.",
        "Straight forward installation. Timer wall switch a must. Wear your safety glasses as you will probably looking upward during the intall.",
        "These ceiling heaters were cheaply made, didn't put out much heat and not worth the price!! When they would shut down they also made clicking noises, warning! Do Not buy these ceiling heaters you will be greatly disappointed! The glowing infrared red light is not something you wou want anywhere in your house! Neighbors might wonder why a light then no light!",
        "There's nothing amazing to report, but if you are looking for a quality brand replacement of an old broken, worn out surface mount (bathroom) heater, this is the one to get. It's a bit pricey for what you get, but I reckon they don't make these in huge quantities like they did in the 1970's, plus they know you can't find a bunch of competing products. Nevertheless, it's better to get one of these and swap it directly in than start with a new type of heater, unless you have time and money to burn to get a better system e.g. Cadet wall heater.",
        "I have a tiny bathroom (probably 9'x4') Not enough heat for that room. I have to hold my hand up to feel the heat. As for installation, it's pretty straightforward except they placed the screwhole that you need to access from the bottom right above the small motor box so I had a heck of a time trying to angle a screw in from my ladder up into the bottom and through the fan blades. Once in, the heater/fan looks good (silver). Just a pain to install and no heat. So, pretty much you are paying for something to fill the hole of an old ceiling heater but in my opinion not a good product.",
        "This replaces the identical heater that was installed over 10 yrs ago. Since we live in the northland of Minnesota, we get quite cold winters. The other heaters we looked at all took a very large space above the ceiling, which in this case is in the unheated space just below the roof. It replace a previous \"heater\" which was just a conduit for cold air in spite of all care and insulating we could provide. This model has a small footprint, as it just takes an 4in? box to be wired into. Great heat for our small bathroom, too.",
        "We had a previous version of this fan. We decided to install the same one, as there are very few heating fans that don't require outside venting. The vented one we have in another bathroom puts out a lot more heat though. This version is a slight improvement over the last one, in that it puts out just a bit more heat. Installation was not easy, but not too difficult wither. I would probably buy it again.",
        "I installed 2 new units to replace 2 old units. Both of the new units failed during the initial test after installation. One ran for 10 seconds before shorting out and the second the fan moved before it tripped the breaker. I tested both units to make sure there were not any direct shorts before I installed them. I was glad I could find replacement thermal switches for the old ones as they were built with quality. I reinstalled the old units and I have heaters again.",
        "I bought this when we did a bathroom renovation. I did not consult my husband who is pickier about gadgets, technology, hardware, you name it, then I am. He was pleasantly surprised and said it was great. I am picky about the look of an item and thought this one looked fine. It does the job, heats up a bathroom, no other problems. I must mention that we are in southern California where it does not get particularly cold here.",
        "Bought this to replace an overhead heater that was part of a light/exhaust/heater combo. This is much quieter, does a better job of heating the bathroom (9×6 feet). Connected to a countdown timer switch to heat bath as needed. It could be connected to a thermostat but we just want to warm the bath up when used.",
        "Placed in my bathroom as a backup heat source. Works fairly well. Heats up pretty quick and does radiate a little bit of heat. The very small fan only sucks air up. There is no way to turn the direction to blow air downward. Other then this, it is a great little heater with not other problems.",
        "I purchased this unit to replace a combination light/vent/heater fan outside our walk-in shower. Thought it would help keep us toasty after a shower during the cooler months. I was set to install when I noticed the installation guidelines said not to install closer than 12 inches from the nearest 'vertical surface' (e.g., wall). Our application was closer than a foot from the wall so it won't work. I guess the heat is probably to intense for a nearby surface and I wasn't willing to experiment. This unit may operate as advertised, but the description online does not list this limitation. Be warned.",
        "Is cheap looking and not as nice as the picture Shows. Id have paid more for a nicer unit if I would've known. Make sure if you get this you put it on a timer so it doesn't get left on.",
        "Have had an older model of this in my small bathroom for years. Since it works so well, I installed one in my larger bathroom up north. Due to more square footage (twice as long as my smaller bathroom), I have to let the heater run at least 5 minutes before I shower for it to warm the entire room, but it does work much better than the old heat lamp I replaced. Still a good product and I recommend it.",
        "this is the 2nd one I installed in the last 2 years. The heat out-put is quick and they are pretty efficient These people are spoiled to have heat in their bathroom where it rarely ever gets cold enough to really justify them.",
        "It takes upwards of two minutes for the coil to finally heat up. Disappointing, because a 20-year-old Broan of the same model, but constructed differently, heats up in seconds. Heat coils are different in each, so a change was made and it is now an inferior product.",
        "This was the only heater I found that attaches below the ceiling and connects to my wall switch. It works well and I'm satisfied with the amount of heat and the time it takes to heat my 6'x6' bathroom. The fan is not too noisy, but I wish it was a radiant heat unit without a fan like the old unit I replaced. However, I had no choice of other units, since most heaters for this purpose are either recessed in the ceiling or are plug-in models. All in all, it's a good unit.",
        "I purchased the first fan/heater and it installed easily at my cabin. It worked well for a few days and then quit working. By the time we figured it wasn't working, the return to Amazon timeframe had expired. I had read some of the poor reviews but thought maybe they corrected the problem and I really don't see any other flush mount ceiling heaters available on the market. I gave Broan a second chance and the second fan lasted 3 days. I can't justify trying again and will return the latest purchase. Good luck if you purchase one of these fans.",
        "I dont do many reviews but this one really chapped my a**. I bought this unit to replace an old model. It was pretty straight forward installation and worked great for about 15-20 seconds. After trying to turn it to half capacity it popped really loudly and burned out I fear it would burn my bathroom ceiling. Needless to say it's a piece of crap. Will not buy another unit and risk losing my house. Terrible safety hazard. Do not purchase.",
        "I installed this, and it worked fine for two weeks. Then without warning it stopped working. Just...nothing. I will contact the seller and see about a replacement, but unless that happens I consider this product a great waste of money. Grr.",
        "This is an exact replacement of the original unit installed when the house was built. It fits perfectly in the same spot as the old unit, looks almost identical to the OEM, and functions exactly like the original. Great replacement!",
        "Excellent replacement for the model 154 we had. The 154 used a \"spring\" type heating element. This 157 uses a solid element similar to an electric stove. Simple installation (hard for me due to bad shoulders) and works much better than the old 154. Better heat output and air movement from fan. Warms up our small bathroom quickly.",
        "Used this to replace an older ceiling heater in a 50-year old home. It was very easy to install. Very light, which is a good thing if you are hanging something from a drywall ceiling. But sturdy enough to do the job, and should last for years to come. I'm happy with it!",
        "I replaced a unit that developed a short in it. New heater exact as old one. Old one would short out. Had an electrician install it, and it has worked very well ever since. Well worth the money, especially on cold mornings when just out of the bath or shower. Heater has a good fan that blows warm air down.",
        "Still going strong nice and warm while taking a shower now. I had the one with the spring type heat element before this one I think it was the lower end model and it worked great for a couple months then just stopped working this one has lasted longer than that one. Also this one is less noisy than the last one.",
        "Purchased to replace the original 15 year old models in both bathrooms. Solid construction as expected, the coil has been upgraded since the original model. Installation took about 30 minutes each. No big deal. Both worked great. The only thin that could have been better is I know what part to replace to repair the old one and where to find it.",
        "My husband ordered and installed our new upgrade ceiling heater so when our grandchildren spend the weekend with us the heater takes the chill out of the bathroom for them.",
        "The ceiling mounted heater installed easily and heats the bathroom wonderfully. The fan seems to drive the heat down into the room better than the old unit it replaced.",
        "I bought a new openbox heather, looks like a knife cut box end open but never out of the box, it is a replacement for a old AirKing, the new one Broan is a little smaller but I painted a small area and it looks and works great",
        "works great just doesn't heat as quickly as the wire element units do update - after 4 times using this for 15 minutes each time, this unit no longer works, figures since the return window is gone.",
        "This fan replaced the previous model, which failed. This is a direct replacement and a snap to install. I suspect it will prove more reliable as the heating element is far superior to the coil used in the other unit.",
        "Smaller than my old siemens with the same output. Id recomment adding a timed switch for safety and economy as the kids always forget to turn it off.",
        "Not as noisy as the 154* which it replaced after several years, but it takes at least three minutes to put out heat. When you have to go tinkle in middle of a cold winter night, it is a looong three minutes. (The ceramic thingies that hold the heating coils vibrate loose and the whole thing vibrates and rattles like crazy. Very noisy.)",
        "Bought thisto replace the 30+ year old heating fan in my Mom’s bathroom. Its simplistically designed, easy to install, and heats like the sun itself is in the room with you!!! This heater fan seems to be well put together, a great value, & would buy another if need be!!",
        "Wish they made one a little bigger, but this one worked fine to replace the original one in the bathroom. I gave it 4 stars only because this is the 2nd one I have put in the same bathroom in the past 2 years. I don't think they last very long.",
        "The heater was smaller than I thought. I really needed a larger on, but kept since the electrician said it will work. It's perfect for a powder room.",
        "Love this, we did not have heat in our bsmt 1/2 bathroom but we put a small shower in and wanted a way to warm the room for just long enough to take a shower .It heats up very quickly and is on a timer switch (recommended)",
        "This heater doesn't really even put out enough heat for my very small bathroom. It works as designed but I will be replacing it in the future with something that puts out more heat than this unit.",
        "Good heater for bathroom. Now has a solid heating element instead of ribbon element which can break after a while. Much quieter than earlier version.",
        "Horrible product ... Installed it, worked great for about 4 minutes and then died. And no, it was not a blown breaker or anything simple. Power still remains at the wires. Of course it took me a while to get around to installing it, by which point it was past Amazon's 30-day return period. What a frustrating waste of time. Oh yeah, and the heater is ugly and feels cheap. Once I got it out of the box I nearly decided not to install because of how bad it looked. Should have trusted my instincts.",
        "Lasted 1 month and quit working. Had this problem before with another heater bought at a Home Depot and thought I'd try again. No such luck! Won't purchase again.",
        "Our older model of this heater finally died after c. 50 years of service (it was there when we bought the house). I'm resigned to the significant quality drop in current \"durable\" products; so I don't expect this to last nearly that long.",
        "Bought this to replace Nutone heater which was probably as old as the house. Heats up as it should. Not much to say.",
        "The fan is pretty noisy with a very distinct rattle. Heat output is okay. It does take a while to heat up but it's fine by the end of a shower.",
        "Just perfect for my bathroom. Keeps a small space toasty, just like I like it. My husband installed it without any problems.",
        "Works well and isn't noisy. Design improved over previous ones. They usually only last a few years. They have hard duty keeping the bathroom warm when it's cold. This one might last longer.",
        "The Broan Model 157 heater was easy to install to an existing electrical box and wiring. The box included a wire hook so that the heater could be hung from the electrical box while the electrical wiring was being connected. The box did not include screws for connecting to the electrical box or the screw caps for connecting the wires. The unit worked when power was turned on.",
        "No instructions in the box. Luckily I knew how to install if not what would you do. Very compatible do you have the heater they sell at Lowe’s for $99. But it’s a bit smaller.",
        "This device takes a minute or two to warm up, and provides moderate warmth under it and in a cone about five feet in diameter. What I like about it is that it consumes less than 11 amps, so it can be installed on a 15 amp circuit with room left over for some lighting. Install LED bulbs (low wattage and lots of light) and you have a home run. Most other similar heaters are either 1500 watts, requiring a 20 amp circuit or dedicated line, or are much weaker and don't provide much useful heat at all.",
        "Straightforward heater replacement that can be found in a lot of track homes for the 50's and 60's. Surface mount so there is no need to enlarge an opening or need for plaster repair.",
        "Its a good idea to add a heat-resistant cicular silicone pad in-between the heater and the ceiling to damoen vibration noises and keep it smoothly quiet.",
        "Good heat. Put on mechanical timer. Benn using 2 years. No issues. Nice to have warm bathroom in morning.",
        "replaced my older heater which finally gave up the ghost. I have a similar broan heater in my other bathroom which is a wired coil element. This one has a more modern single element like a stove - which seems very durable. So far so good. It does put out a lot of heat.",
        "Cheaply made. No style. I was going to install this on the ceiling in our bathroom, but it was too unattractive, so I sent it back.",
        "In a rental, used this model to replace almost the same heater but with exposed heating elements that were common in past decades. Went in easy, and with no problems.",
        "I replaced a three-year-old Broan ceiling heater with the spiral heating element with this Model 157. We have the heater positioned in our bathroom ceiling a couple feet in front of the tub/shower unit. The installation was identical to the old heater and took about 15 minutes. This unit puts out more heat than the older model, and is a noticeable improvement. I would have given it five stars if the fan moved the heat more efficiently from the ceiling to lower in the room. I hope Broan makes this improvement before I have to replace the heater again.",
        "Ordered this to replace an older unit. this new unit was a direct easy quick replacement for the old unit. It worked out perfect.",
        "I ordered this and it came just loose in the box (looked reboxed). Installed it didn’t work. Contacted Broan and they sent out a replacement unit. It came promptly and installed and worked perfectly. This is the second item from Broan I have used and will be happy to use a third.",
        "I have been looking for one of these for a while to replace an old one in my house. I should've went and searched Amazon to start with. Direct replacement.",
        "These used to be the norm in bathrooms, but are now hard to find. This was a smaller model than the original, but works fine. It takes a couple minutes to produce really warm air.",
        "Working well as an auxiliary heater for the bathroom. Has a solid heating element versus the old wire coil version.",
        "This heater replaced an existing unit, of the exact same model number of the original. The original heater was installed in the middle 1970's and even though it still worked, the element was getting weak. With 40 + years of service, why wouldn't I replace it with an identical unit. The new one appears to be of the same quality as the original.",
        "Was looking for the unit to heat up the space its in (8'x10') a bit more quickly. It needs to be turned on 7-10 minutes before it reached the desired temperature such that you need to plan a shower in order to get out of it in warmth. Other than that the unit is fairly nice.",
        "Bought this for my mom over two years ago, she still uses it, loves it. Heats fast!",
        "I purchased this heater feb 2013 to add heat to a small bedroom. It has gone thru 2 thermostats and now the fan has quit. I can say that the heating element is still working but because the fan doesn't work the heater turns off after about 2 minutes. Not sure what i'm going to replace it with yet.",
        "Very good product. It provides heat for our bathroom and is efficient. However, it is louder than our older model that was installed many years ago.",
        "Purchased to replace our old ceiling heater because the old fan seized. Heater worked great for about a month before the fan became noisy as if it became warped from heat from the heating coil. Fan sounds as if it is hitting something inside the enclosure.",
        "Exactly what we needed. Not high tech but quite serviceable. You’re basically buying a broiler in a cage.",
        "Replaced an old heat lamp unit and what a difference. This unit heats up quickly in my northern camp and make taking hot showers very relaxing. I put this on a timer to insure no overheating - awesome little heater!",
        "Makes a little noise when starting but stops after metal gaurd heats up and expands. Works great for my small bathroom.",
        "This was so like what I had, so it was very easy to replace it, connected the wires, screwed in the unit to the holes that already had, works excellent. Just what I needed and wanted.",
        "Purchased on Amazon and installed by a licensed electrician in 2015. It worked less the 12 months and the heating unit went out. It was not easy to install unless you are a professional DIY person. I would not recommend this unit!!! What’s interesting is that there so many good reviews. That was not my experience.",
        "I have been using this heater for awhile now and other than being a little noisy it works very well to warm a bathroom during a shower.",
        "we had to replace this heater for the third time over 20 years. amazon had the best price for it.",
        "All I wanted to do is replace my old one and this one do the trick.",
        "We replaced a 40 year old bathroom ceiling heater. The new one fit perfectly. It is less noticeable and heats wonderfully!",
        "This same model heater was installed in my house when built. That was in 1973. Enough said.",
        "This replaced one just like it that had been up for over 30 years . If this one last as long it will be awesome",
        "I've had this heater since the beginning of fall, (about 3 months) and it is QUIET! The coil resembles a stove top. The less expensive one that I used to have was designed like a spiral notebook's \"coil.\" It rattled and was noisy. I hated it, and was almost happy when one of the ceramic loops that held the coil in place broke. I replaced it with this one and am quite pleased. So far, so good!",
        "Only style my washroom was made for and Broan delivered this much improved design. Absolutely love it and it's worlds better than the old coils that shook themselves apart.",
        "The heating element is not a coiled wire as depicted in the description, but rather a solid wire, much like in an old time spiral cook top. The installation wasn't easy due to poor design. Unit received appeared to be used, as it had scratches and was missing screws. Had to actually make a trip to hardware store to purchase screws.",
        "Easy install and works get. Use in our bathroom which doesn’t have a heat vent",
        "We’ve been using the Broan Model 157 For a week now and it sure does the trick. We have a rather larger bathroom and it warms it up good and fast! I would recommend this product.",
        "I am disappointed with this because it does not heat up fast. I already have it installed.",
        "There is no heat in our bathroom so this is a welcome addition. Sometimes I turn it on and get back into bed. A few minutes later I can use the bathroom without freezing.",
        "The element in this one heats better than the original that we replaced",
        "The heater works great after installation. Installation is always hard because the screw holes are in the center and very hard to line them up.",
        "The fan does not blow out like the original that it replaced. I don't know what the issue is but everything else works",
        "Replaced a similar Nutone fan (that had run faithfully for almost 30 years before quitting) with the Broan model 157. It ran well, and heated well, but was incredibly noisy. I called customer service who were courteous and efficient, and sent out a replacement with no hassle. This ran quietly and heated well, but shut off permanently after twenty minutes. Again, customer service sent out a replacement with no hassle, but this one only worked for ten minutes! I am sure that you will be pleased with the heater if it works as it is supposed to, but be prepared for quite a bit of uninstalling and installing if you select this product.",
        "Works very well and a good addition to the bathroom. I have installed it through a lights switch with a timer and its perfect. Raises the bathroom temperature just enough to make the difference Not the most beautiful and looks rather industrial",
        "Love this product. Replaced an old heat lamp I had in master bathroom with a wall thermostat and now my wife and I are very comfortable in the cold winter months getting out of the shower!",
        "Replaced my old ceiling heaters in my bathrooms. It has been great to be able to heat up the bathroom and not freeze getting out of the shower.",
        "Works fine as replacement for coiled wire unit. Mounting screws difficult to install through fan blades. Screw gripping screwdriver a great help.",
        "It is why we needed to replace the one we had from 1976. We had to use the outer plate of the old one and it fit great in the same potion of the ceiling. Old and new together was great!",
        "This product was purchased for my bathroom. And I liked it so well, I ordered a second for the other bathroom.",
        "Not particular. Does not put out heat in overall room. Must be standing directly under to feel heat",
        "Works fantastic. Only wish the there was a dual operation for the heat and the fan so that the fan can be used without the heat.",
        "Easy install replacing a 13 year old Broan model. Works like a champ.",
        "Replaced both heaters in our bathrooms that were built in 1976. These heaters were a good replacement.",
        "I got this to replace the ceiling heater in my bathroom. It is a little smaller than the old one but works really well. Very pleased so far."
    ]
}