{
    "entity": "Heaters & Accessories",
    "text": [
        "I don't write many reviews, but I felt like there should have been a plug warning. I was purchasing this heater for my garage as I epoxied the floor, to be able to keep the room temp from dropping. Due to the fact that the plug fitting is not standard, and they do not sell the adaptor at home depot or ace hardware, I was unable to use it. Another thing that I found out is that standard plugs would not be able to support the voltage output that this unit requires. I wish that they would have posted these facts upfront before I purchased the heater.",
        "Use this to heat our garage to keep water lines running during those polar vortex days. Works great and is the perfect size for the job. Using a dedicated 20amp 240v circuit on a 2 pole 20 amp circuit with a 6-20r receptacle using a wall mounted line volt thermostat. Reading some of the other reviews that complain about the plug end. The one that is supplied is exactly the one required by code. The problem is seeking help from Home Depot and not a qualified electrician. If you need help get a pro, it could save you tons of time and possibly your home.",
        "I tried to get a decent garage heater at a decent price, my mistake. Even though I had read other reviews of loud rattling sounds I thought I'd be lucky. I couldn't stand it for more than 2 minutes running, a terrible rattle and no matter how I squeezed the sides or tried to find a loose screw it continued.........terrible don't buy it unless you can ignore this sound. I paid more for a NewAir G73 and it's amazing, no complaints a pleasure to own. I guess in 220V garage heaters, you get what you pay for.",
        "I was told by the manufacturer that using an external thermostat would void the warranty. When I asked why, they didn't know. When I asked if it was safe to use this unit with an external thermostat, they weren't sure. It says on the box, \"not for permanent installation\", whatever that means, but it doesn't say that anywhere on Amazon or in the installation manual. I wanted to hang it in the corner of my garage but not being able to put it on an external thermostat or knowing if it safe if I do is a deal breaker. Back it goes. Both of my customer support experiences were not very good.",
        "Heats up a one care attached garage very nicely. My only complaint would be the internal thermostat isn't the most consistent. I have a 220V external thermostat which I will be adding to a remote location which should improve the performance. After the 1st month my electric bill didn't go up as substantially as I had expected.",
        "While studying up on what kind of heater to purchase for my shop I knew I wasn't going to get a large heater I wasn't looking to get a suntan year around I just needed something to break to chill in the air prevent pipes freezing that sort of heater This shoebox arrived at my doorstep I thought to myself how is this going to do? I’ll tell you, we had a cold snap here in Georgia couple weeks back temperatures dipped into the 20s in my garage never got cooler than 59°. I would've never believed never! Don't miss out, buy that little beast and you'll be impressed too.",
        "Mounted up high in a 2 car garage. keeps the edge off the temps have not had it long enough to see how it effects the power bill. Its a little noisy but I'm going to add a small strip of rubber between the mount and the wall and it should eliminate some of the noise transfer. Has same rattle as mentioned in other reviews and I could not find what the culprit was. thermostat is a trial and error, not a temp setting but a 1-6 setting or similar",
        "I just wanted a small heater to help heat the garage while I'm working out there. This one is small, hangs out of the way, and does a pretty good job. It doesn't put out a ton of heat, but it does okay. I only have two criticisms: 1) The thermostat doesn't have a lot of range--it's only a small step above just being an on/off switch, and 2) It's got an intermittent rattle to it when the fan is going. Kind of annoying, but it's the garage, so not a big deal. Happy overall with the purchase.",
        "Had an annoying rattle when I first started it up. Took a long time for me to tweak the metal parts until the rattle finally stopped. Hope it lasts because it seems to be cheaply made. The temp controller is a guessing game - takes a lot of tweaking to get the temperature correct. But on the good side it heats my garage/shop quickly. Another plus is its compact size.",
        "This little heater is tiny but mighty. Made a HUGE difference for our garage gym (2 car standard size). We only plug it in and use it when we’re working out. We usually warm the garage up for 15 min before going in. In a few minutes I’m down to a tank top and sweating! We got lucky that our garage already had a separate circuit and outlet installed by a previous owner, otherwise installation would have been much harder. All we had to do was plug it in and turn it on!",
        "I would have given 5 stars but my particular unit started to have thermostat problems after the first week of use. It would maintain the temperature for approximately 12 hours but would quit soon after that. I would have to turn it off entirely and re-start and it would last for another few hours and then quit again. When it was working it heated my 250 square feet easily...usually within 2 hours (and is in February with outdoor temps in the teens) It seems to be ruggedly built and I like all of its safety features. I called the company and they are sending me a new thermostat, no questions asked. Hoping this will solve my problem.",
        "The heater started rattling and making horrible noise just after the 30 day return window. No support now, I'm just stuck with a $100+ heater noise machine. This really stinks!!!! Another case of Chinese junk and companies that won't stand behind their products. I should have paid attention to the other reviews that stated similar problems. I'll follow reviewers advice from here on.",
        "I mounted this the other day in my 2 car garage. I did have to make a pigtail to go from the 20amp plug on the cord to my 50amp outlet. Not that big of a deal though. It was 43° in the garage and about the same outside. It brought it up to about 60° in about 40 minutes. I will have to wait for next winter to really try it out. I didn’t find it too noisy. Sounds like a forced air furnace.",
        "This has the 240v plug with one vertical and one horizontal prong. That is exactly what I was looking for when I bought it. The thermostat just has numbers, not temperature, but for a garage/workshop that's fine. We just turn ours on when doing laundry or working in the garage. It can keep our lightly insulated 2 car garage at a comfortable temp when it's in the 30s, but it doesn't get colder than that here for me to test it out.",
        "Loved the unit when we purchased it in December 31, 2019. As of today, April 2nd 2020 it stopped heating and blowing any air. I’ve no indicator other than the power. I’ve reset my breaker, I’ve unplugged the unit for 24 hours, I've toggled the thermometer all the way to the left and right and still nothing. My return window closed January 31st and I’ve just emailed the manufacturer. Be a little wary on this item.",
        "Works well. Heated my standard 2 car garage pretty good. Took a half hour but raised the temp where it was actually warm. Good price. Remember it is 220.",
        "I ordered this heater to warm up my 350 sq. ft. work shop -- it has provided just the 'ticket'. 220 volt is the difference. The build quality is quite good.",
        "This heater does a great job of heating my 20'x20' garage when it's in the 30s outside. I have my heat in my house set on 70 and when I came in I noticed it was warmer in the garage than it was in the house.",
        "Used in a 500 sf garage. Ran for about 8 hours in mid 30 degree temps. Best it got in garage was 64 degrees. Not terrible, not great. Gas is still a better choice. Update: Got through winter in Denver, barely. When it was cold, could only get temp in the garage up to 48. And... that cost about $200.00 a month in electricity. Pass.",
        "This is the second one of these heaters I have purchased, the first one for my garage, and the second one for the new garage.Best suited for a two-car garage, struggles to heat the three-car garage.",
        "Easy to use and install. Need the right plug in. Heats the two car garage just fine. Our garage is insulated",
        "WARNING! Before I bought this heater I did notice that one of the reviewers said the thermostat on her unit failed and the heater never shut off. I dismissed this as a fluke but now the same thing happened to my heater. I've been running this heater regularly for the last two years and up to this point I was happy with the heater, though it was a bit noisy. Bottom line.... do not leave this heater unattended. I'm afraid it may have a serious design flaw. NOTE: when I found the unit malfunctioning it wasn't overheated so I do not know if the over-temp switch would have ever shut it down. Be careful with these heaters!",
        "Pretty good for the price. Makes a high pitched whistle/whine when running. Irritating. Delivers plenty of heat from a small package. I run it until my shop warms up, then shut it off.",
        "I ordered this heater to heat my garage when I want to work during the winter but because winter is about over to has not been used enough to evaluate it. I have turned it on to knock the chill out of a Saturday morning and it performed as expected. It is smaller than I pictured it, but being an electric heater it will give me the 4000 watts of heat. The fact that it is small works out well in my garage by taking up very little room but still there when I need it. Not a lot of money but powerful enough to heat when needed. A perfect fit for my garage.",
        "I bought this heater for my 2 car garage. It's very fairly priced and it was on Amazon prime. It heats up the garage very fast to the point that I can work on my car in a T-shirt and shorts during the winter. This heater has a 240 volt plug so unless you have a 240v plug in your garage some electrical work is required. If your panel in in your garage and you are using the heater in your garage you could easily run a separate line for the heater. Consult with an electrician",
        "Pretty good little heater. Not for more than 2-car garages",
        "Easy to install, this little heater has done an amazing job keeping my garage warm through the winter. Perfect temperature! Set the thermostat where you want it. Then it shuts off and on to keep the temperature regulated. Absolutely love it. It not noisy and runs like a champ!",
        "The heater is good for the garage that I put it in. It is a little noisy, something with the element or the grill rattles when in operation. I did not receive the black and grey heater I ordered, I received the almond color.",
        "I got one of these, when i plugged it in it rattled so bad i thought it was going to fly apart. Returned it and ordered another. This one sounded almost the same. Not quite as bad. Video of what it sounds like. If that is what it is supposed to sound like, im not comfortable with that.",
        "Very happy with heater performance. outside air temp. 22 degrees starting temp in three car garage that is insulated 40 degrees in side. In one hour the temp is up to 65 degrees.",
        "Warms up my uninsulated 110sf shop within 20mins. Would definitely recommend!",
        "This heater does not work well at all. It does not put out very much heat and you would be better off paying $30 for something that works better. I was hoping to warm up my garage with this thing but it was a huge wast of money.",
        "we have had this a year, love it! Heats our very oversized 2car garage. I like that it has a thermostat and shuts off when temp is at level you choose. Worth every penny!",
        "Not a good product. Blows cold air. Don’t buy it!!!",
        "works UPDATE: I purchased it in Nov of 2014. today is Jan 19, 2019 and it is still working. the thermostate is weak and does not keep place as hot as it used to, but it is still working fine.",
        "Nice garage heater, has kept my garage a steady 60 F all winter long, even when we dipped into single digits overnight. The fan delay circuit works well and really helps keeps the temps steady throughout the room. I would give it five stars but the fan is intermittently noisy, as if the balance is just slightly off. A good deal for the price.",
        "works fine - this is the second one I bought - first one purchased a few years earlier is quieter and has directional vanes - this new one does not and has a rather annoying hum to it - but it gets the job done",
        "This item is a great heater, small package-- lot's of heat. My first unit was damaged in shipping. Once I received the second unit, I was disappointed that it made more noise than the damaged unit. Everything in this unit shakes, rattles and irrates the customer. However, I disassembled mine, tightened every joint, reassembled-- and now it is completely quiet. There is only a whisper of air from the fan, but this is how it should be. I'd rate this unit a 5 of 5 for heating, but I wasn't happy that I needed to re-engineer a new, out of the box product, and that is the reason for my 3 of 5 rating.",
        "These littler heaters are great. They are doing work in my garage 👍🏻",
        "Just perfect for a small office or garage. Is just a little noisy but I don't even notice it anymore.",
        "Noisy. And not the fan air friction. The unit rattles. Been thru two of these - one from this co. and one thru Cadet. The rattle is intolerable.",
        "Great product. I use it in my outdoor shed.. It generates wonderful heat.",
        "I am using this heater in a poorly insulated cabin and it still does a great job of bringing the temperature up to a manageable level. My only real complaint is that it rattles a bit, particularly when it has first been turned on. I wish the temperature dial were on the front of the machine rather than the back.",
        "I bought this one knowing that I only had a 20amp outlet for 220volt. This heater is not strong enough for my 2.5 car garage in Minneapolis, MN. Sure we've had the coldest winter since 1936 here, but still it doesn't warm the space very much. Just not that strong. I think I'll bite the bullet and run a gas line. Look at the dimensions; it's not very big.",
        "Heated my old 10x20 garage with ease. Fan made some noise but nothing major. Good product.",
        "I was surprised at how small the unit is, but I also am very pleased with how well it works. The unit is quiet, produces a odorless heat and does a great job warming my lower level work area. I would recommend this unit!",
        "This is an excellent little heater and it warms really well. Im a woman who is not inclined towards do-it-yourself but I had no problems attaching this to my garage wall. Money well spent! Deb",
        "Had it for more than a year now. It keeps my greenhouse from freezing down to outside temps of 17 degrees. If your temps are colder, get more BTUs.",
        "Box looked like it fell of the truck and was dragged a few miles (poor packing ). Mounting bracket and accessories were missing.",
        "I put this dimplex workshop heater in my 3 car garage(600sq ft) to heat the garage as needed and I have been in my wood shop (single car garage side) more than ever. This is a great little heater for the $$.",
        "I have a one car integral garage (approx. 250 sq ft) and this unit seems to work well. I'm seeing around a 1 degree per minute rise in temp on a 30 degree day. One comical feature however is they chose to place the thermostat control knob on the back of the unit. It's virtually impossible to see if you install from the bracket near the corner of the ceiling as I did. Not a deal breaker but really poorly thought out. Despite this I'm happy overall with performance.",
        "thought it put out more heat. but works great for products not freezing.",
        "Great product. Keep my 2-1/2 car garage comfortable in East Tennessee.",
        "this heater heats my shop (384 sqft) with no problem.. 74 degrees in 30 minutes on a 40 degree day!! no insulation!!..thermostat is kinda hard to adjust to the desired tempature but that really doesnt matter..this lil heater has been a work horse for sure..been using it for about a month now..i hope it holds up!!",
        "Hooked it to the Honeywell baseboard thermostat because the heater mounted so high can't reach ,the heater.to adjuet.",
        "My husband loved it so much that he bought another one and he hates spending money.",
        "I have a 16ft x 24ft workshop and it works great.",
        "Keeps me from getting up in middle of night to stoke stove, works great",
        "I bought this to heat my new 16 x 24 wood shop.....It heats the shop quickly when the temp is 40.... I live in Georgia, so the winter days don't get much colder than that...The shop is insulated to R30.... It's quiet.... The mounting bracket can be used on a wall or ceiling, and is very strong....The only drawback is the thermostat... The temp drops too much before it kicks on, but not to the point that the shop becomes uncomfortable... Overall, it's a good product...Just remember, it requires a 240 volt circuit and a 20 amp outlet..",
        "Works great. Puts out a lot of heat for such a little heater.",
        "Small heater that seems to work well. I haven't had it long enough to experience a really cold day, but it's working fine.",
        "Perfect little heater for my 250 sq ft workshop- in Minnesota.",
        "This heater was amazing until I received my electric bill. My bill went up $400.00 for the month. So needless to say it won't be turned on again.",
        "great for heating garage, well built, nice thermostat control is as accurate as typical home thermostat. This unit is well designed.",
        "Has not been cold enough to test it completely but it dose get hot quick and is quiet .",
        "Trips the 20 amp breaker they recommend. Had to install a 30amp.",
        "When i received my heater i was a little worried as it really is small. Mounted this in my 20x20 workshop with 10ft ceilings that has no other heat source. This heater is powerful. it's quiet and the fan really throws heat. I mounted it from the ceiling about 2ft from back wall and heats my shop with ease. This is an excellent bargain for the price compared to other units. Couldn't be happier with this purchase and i would recommend without hesitation.",
        "This heater works great and well worth the money. Shipment was very fast.",
        "Product is compact but powerful and very easy to mount. Powerful little fan for circulation and sturdy looking heating element.",
        "Works great ! The thermostat is a dial (1-10), and it takes a short bit to figure out what each digit means temperature-wise. IE, if I put the thermostat dial between 1 and 2, it will kick on when my room hits 55 degrees. My \"sunroom\" (in OHIO), which I use as an exercise room, is glass on 3 sides, and is 17' x 12' --- this unit easily keeps the room at 55 degrees all year, which is what I want to protect the exercise equipment and for working out. Snowing outside, warm inside. This unit CAN be retrofitted with an external thermostat if you want.",
        "No doubt 5 star this lil monster does the job I have in a one car garge I gotta keep it on low it will blow u out if there",
        "Purchased out of emergency when the oil boiler went out! Has done a GREAT job of heating the first floor and maintaining the heat at 68/72...heat rises so it even warms the upstairs!",
        "Rattles badly. They installed a stabilizer type bar (different from previous model) but still rattles like crazy under operation.",
        "May not be the best for this usage and probably should have searched for a swivel type mount or more directional baffeling.",
        "4 stars instead of 5 because it's a bit loud. But then, it's in a workshop, so the noise isn't that big of a deal. Heats well: my shop is about 240 square feet and it gets heated to a comfortable temperature within 15-20 minutes.",
        "I have had the heater about a month, works great. I have a 16x20 workshop, bring the temperature up quickly. Very satisfied!",
        "Quality product. However, poor packaging. Product is shipped in its own package. Should have been packaged in an additional box. Product was not damaged. Box ripped and torn. Check its contents before accepting. On the positive side it is the perfect size for my 2 car garage. Winter is still to come, so the jury on heating is still out.",
        "The product quality was good, but it does not heat up garage/workshop area very well. In order to feel heat you must be within 3 feet of heater. I wanted to use to warm up workshop area prior to actually working in area and it just did not due the job. The heater is good if you are right next to it, but don't count on it to heat up work area...especially if you live in a state like Wisconsin.",
        "I was looking for a heater so I could work in my garage all winter and I did a lot of research online until I found the Dimplex DGWH4031 4000-Watt Garage/Workshop Heater. I ordered it, got it in a couple of days and installed it. It looks small, but after 2 hours my two car garage feels very comfortable to work in. It really works!!!, I think the price is really good for the service you get from this little/powerful heater.",
        "I have a 2 car attached garage 1/2 insulated. This heater works great to warm it up to a comfortable tempature and beyond if you want. Has tiny dial on the back to act like thermostat. Kinda hard to set it just right but it works turning its self on and off as needed. Had to install 220v line from fuse box but it was already in garage so easy install.",
        "Northern Tool was excellent about replacing the first heater that was sent to us... the fan wouldn't work because it was damaged and hitting the motor. They shipped out a new one and picked up the old one asap. It is a little loud, but it's for a garage, so that is to be expected. Other than that, it has been keeping our 600-square foot home toasty warm, even at 5 below zero.",
        "It's a fantastic product ! Heats my shop and keeps it at a constant comfortable temperature. Well worth the money.",
        "Performs very well. Keeps building at 55 degrees when outside is -10.",
        "The heat is ok and it was easy to hang. However, it is very noisy. It rattles when it runs.",
        "Nice little heater. heats my 20x20 garage up to 65* when it's in the teens outside, walls are insulated ceiling is not.",
        "It is in use right now in my 2 car garage. Its 31 outside & 60 inside, good enough. word",
        "for a cheaper heater it is very good .. little noisy but does the job. 10 + degrees per hour.",
        "Miss understood that this had to be plugged into a much stronger socket which means we would have to require our plug. Not worth it.",
        "There's a reason price is reduced ...it doesn't live up to its performance promise. The reviews that love it seem to have attached or under-house garages/shops, or perhaps a greater tolerance for obnoxious noise or working in the cold. But my free-standing, rocked and insulated, double car garage/shop is apparently too much for this thing; which generates, by an order of magnitude, more noise than heat. I live in Southern Oregon so it doesn't get exactly cold here, and it couldn't even stay ahead of 30o temps. After a season of having to augment this roaring piece of junk with a propane unit it just up and quit....pathetic. At least it's quiet now.",
        "Have this heater in my garage and it doesn't generate as much heat as i thought it would. Still very cold when it is running.",
        "Doesn't heat 400 sq.ft. at all.So I was very unhappy with heater . I wished it worked because I need heat.",
        "It has been fine; I am not trying to heat the garage to a livable temperature; Garage is about 500 square feet and we maintain the temperature about 38 degrees; It would maintain garage at 60 degrees if we turned thermostat all the way up Easy to mount",
        "I found this unit to be very ineffective in a garage application. I am very unhappy with it, heating felt more like 300 watts and energy consumption is very high on any setting.",
        "i have an insulated 2 car garage which is 400+ sq. ft. The unit takes a long time ( over an hour) to reach 60 degrees when the temp outside is 30-35 degrees. I had thought the heating element would be bright red when the unit was climbing to 70 degrees, but that has not happened. All I see is a very dull orange/red which seems to be only half of its potential. Paying to have a 240 outlet installed appears to have been a waste. Probably could have used a couple of 110 heaters. I all fairness the unit was easy to install and the 6 foot cord was a big help.",
        "It doesn't warm you up, even if you are in front of it it doesn't Worth the money!!!",
        "Box arrived all mangled, it was very obviously a return/repack, and a really lousy repacking job. OK, maybe still alright. Once open, it had a tiny amount of bubble wrap and the heater itself could bounce around inside the box. OK, still... then, on top of all that, the bracket was missing. Returned. Will not buy this brand again.",
        "This is a great compact electric unit heater for the price. I have a small shop that I used to heat with 2 electric milk house style heaters in the Winter when I had a project to work on. I would have to turn them on the night before just to make it warm enough to work out there. This little baby I can turn on and in an hour I can be working comfortably at my bench.",
        "I liked the simplicity in operation and controls, and that it came with a 220v chord attatched where i only had to hook up a 220v extension chord to my shed. Shed is 12x12. In the coldest days this heater puts out warmth......",
        "This is a nice unit. Not super powerful, i use it for my work hallway way which has an active door. It does a decent job of heating the hallway. For a garage or a small area that doesn't have a lot of in and out would probably be better suited. Overall i am happy with the unit,",
        "So far, so good. Very sturdy and surprising heat output for the size. Quiet fan with thermostat control. I have a wall mount, but can easily mount to ceiling. I am using same outlet I use for AC, so install took 20 minutes. Completely satisfied."
    ]
}