{
    "entity": "Heaters & Accessories",
    "text": [
        "Works great--heats the room well and is quietly efficient. If your house is old, I recommend selecting one size larger than needed, or else the room will take longer to warm, and may not reach the desired temperature. The installation instructions were clear and easy to read. One suggestion is that when installing, be sure to locate and attach the heater to wall studs. Pre-drilling the holes works best, prior to mounting and then wiring the heater, as the pre-stamped screw holes don't work so well and it is easy to accidentally bend the fins during mounting.",
        "The product came in the morning and by lunch we had in set up and running! The heat could be felt almost immediately and it looked quite nice in the room. The measurements are exactly as they stated they would be and it fit perfectly. I would highly recommend this heater for anyone looking!",
        "Exact replacement for an older model that was installed when we purchased our house. Last one lasted about 12 years. Since I was replacing an existing baseboard, it took an easy 15 minutes or so to replace. Heats the bedroom well and is silent.",
        "I am very happy with this product. I bought these heaters for my whole house because I do not like forced air and because I can have separate thermostats in every room and program them according to the occupancy. They give off a lot of heat and do not use too much electricity. I combined them with Sinope web programmable thermostats. The heaters look great installed on the wall under the windows a few inches above the baseboards.",
        "These units do heat up quickly, quietly with a nice gentle heat, however I am a little disappointed. This unit failed at just over 4 years. I have cheapo baseboard heaters in my tackroom that have been running for 20 years with no problems. 4 years seems pretty short. Since I bought the original units from an electrical parts house, I'm willing to replace with an Amazon supplier and hope for a better outcome. If these only go for 4 years, I will find something else next time around.",
        "While the product works very well, the instructions for a 240 volt appliance are poor, with vague instructions and very basic wiring diagrams that even a 20 year licensed electrician wasted time on trying to interpret the exact wiring options. It wasn't until we did a web search and found an obscure heating & supply site [...] that posted their own \"Custom\" wiring instructions that blow-away the very poor instructions provided by Marley. I installed this with the Honeywell YTL9160AR1000 Econnect Wireless Control & T-Stat for Baseboard Heaters and also A Honeywell Red Link Hub to provide for control VIA the Web.",
        "Put it in my mud room where there is no heat, works great, when you turn off the jell stays hot.",
        "We often buy these for replacements in our home when the older ones wear out. I like them better than basic electric baseboard heaters. They seem to be more efficient and are safe around young children and pets.",
        "on my third replacement... seems as tho they fail in under two years. Will be looking for a different product when this one fails.",
        "Just bought 4 of these-I have hooked 3 up so far and they are working just fine. Well made. I do think that the handling in the factory, maybe at the distributer , plus the packing for shipment could be a little better as I have noticed slight damage and blemishes here and there--just not serious enough to return. They should check out how they pack these units as they should be perfect as they are a bit pricy.",
        "This would not heat a 100 sq ft area....maybe 75 sq ft...and still only supplemental heat, not primary.",
        "Connected the unit to a Honeywell line voltage thermostat and it works great.",
        "Purchased November 8th 2018. Unit failed February 2019. Have not heard back from manufacturer. Paid top dollar for what?",
        "Nice and warm bathroom. Should have installed it years ago. I have a wall mounted thermostat, no noise from the heater.",
        "As advertised, arrived well packed, on time. Easy to hookup with moderate DIY skills. Functions well, throws good heat for bathroom",
        "Excellent heater at a reasonable price. Easy to install. Perfectly quiet when heating. Too early to tell how economical it will prove to be.",
        "I am happy with the delivery time, packaging, and the overall workage of this unit. I ordered two of them for my back room which is all windows and they work well.",
        "Did what it was supposed to do for 7-8 years then started to make lots of noise. I called customer service and after giving them the model number and date code they were able to determine that the heating element was still under warranty and arranged to have a replacement heater sent out. Call was 10 minutes on hold and then 2 minutes with the tech. Can’t complain. Hopefully the installation will be easy...",
        "I have these in my house. One crapped out on me within a year of moving in (and its brand new construction) and another is making a really unpleasant and fairly loud boiling sound when its at temperature. Stay away from these, they're some of the worst baseboard heaters I have ever encountered. I have never had a problem with a baseboard heater in any of the other places I have lived until now.",
        "Nice heater with no noise or popping. The features are good but the quality is not so good. It lasted a few year and died one cold winter day. We never had it up past 65 so it was not over-used. Can't recommend.",
        "We have had one of these heaters in our master bath room as a supplemental heater for two years. This fall it failed to heat up when the thermostat was turned up. I phoned Marley's 1-800 service number and was instructed how to test the element to determine where the problem was. It tested dead, and after phoning the warrantee dept back , Marley immediately sent a new element to me. Super polite, super efficient and the unit now works again. I have two more on these that have had no problems whatsoever. I would order again without hesitation.",
        "This product works well and is quiet but it only last a couple of years. My first one only lasted about 3 years and waiting for second one to fail.",
        "I've been using one for about five years now. Hard wired in to 240V line (per documentation) and it has been going strong ever since. Just ordered another two units - 750 and 1500 so take that for what its worth. Those who had issues with the units should have read the specs before ordering...",
        "Have 9 units in my home only one dosent seem to last company replaced first one ,I just had to buy another because can't get threw to Marley yet ,model 504 ,28in,said they had problems with that model, hopefully all the rest hold up 4yrs now",
        "We bought this heater for bedrooms and they are really noisy, so much so that ear plugs are required. Other than that they are a great heater. Every even heat, low profile.",
        "Beware -- this heater is a 120 V AC. It really doesn't say in the information. Ordered one and realized that it was no use, so wasted my money and time. Ordered from Hydrosil as they have a much clearer website.",
        "there is nothing portable about this heater at all. it must be hard wired - you can't just place it down and plug it it and remove it when not needed. very misleading"
    ]
}