{
    "entity": "Pressure Cookers",
    "text": [
        "Terrible product. Please just look at the pot after the first time use. I washed it with a mild soap and warm water before first time use. I put my 2 organic chicken (cost me $30) in this pressure cooker and when I open the pot I saw this black like oxidation type INSIDE the cover and some INSIDE the pot too. I had to put all my food in garbage can. We can not understand why this black oxidation. This is poison. So disappointed. Please do yourself a favor and DO NOT BUY this, and don't wast your money.",
        "If I can rate it less than zero I would !!! This thing almost killed me yesterday!! I had it for 5 years and always fallowed the instructions , yesterday on the pot lid that pin that looks like a nail flew off and the water and steam were coming out of the hole like a volcano !!! It was soooo scary !!! I have three little kids in the house ! And the mess it made was unbelievable!!! That pot is in the garbage now !! But I will email the company to get full explanation why did this danger thing happened?!!",
        "We are very surprise of the good reviews that this pressure cooker gets!! My wife always has a difficult time trying to close or open the lid, and the seal seems to get worn out very quickly because of the friction when having to use so much force to open or close. The thickness of the metal, especially the lid seems to be very thin. We have had other pressure cookers in the past, but this one has the worst quality of all. I would definitely not recommend buying this product....",
        "It doesnt require a rocket scientist to close the lid properly. It took me 3 mins to close the lid. It appears the spring and lock pin underneath the lid has a bad design that makes hard to align and close properly.",
        "I paid 19.99 at Walmart for a better pressure cooker than this POS. At least that cooker could actually reach AND hold 15psi. How can you tell if its even AT 15 psi?!! (I tell by the melted tape on my corn jars. FYI it only melts the tape 1/2 the time when I put it on high)So inconsistent pressure, the handles constantly loosen and have to be re-tightened (probably where I'm losing my pressure), in short, a pain in my tush. If your canning or doing corn/rye for mycelium inoculations don't buy this product111",
        "I looked for a pressure pot just like my grandparents have, this one is as classical as i expect. The volumn is suitable for 2-6 people, it don't sticks, it can stews, steams with pressure, and i also cook in it like a normal pot with opening the lid, for example, fry or boil the ingredients firstly and then put the pressure lid on. Towards it is kind of dangers, the perusal of manual is NECESSARY! It extremely cut a lot of time in cooking, and make the dishes soft,especially to the meats, i can't leave it when i cook.",
        "This pot is beautiful and elegant it has the look and feel the video presents. Easy to use with one exception- it very, very hard to open and close. Sadly I will be returning it.",
        "I purchased this pressure cooker awhile back. I have probably used it 4 times at the most. I'm disappointed in the way they changed the lid. I prefer the handle over what they have now. I have arthritis and it is very hard to open the lid. I'm thinking about buying a different brand. Also disappointed because it's made in China. Presto used to be American made.",
        "I had been using this cooker about 9 months with no problems, but one day while cooking a pork roast the seam at the bottom of the cooker developed a leak while it was cooking under pressure! If I hadn't had my timer set to check on it my house would have burned down!! the entire bottom of the pot was melted to the stove top! This is unacceptable, If I could leave a negative star review I would, all I can do is warn others that this POS is cheaply built crap!",
        "There are more expensive pressure cookers which are more intuitive. However after very carefully reading the manual of this one and making sure to pay attention to similarly-named parts you can achieve the same results. I got this over an electric pressure cooker because you can brown food in the bottom. Using it is more work then an electric pressure cooker, but I enjoy cooking, and that's why I got one which was more work.",
        "I am 70, and I have used pressure cookers all of my life. I bought this one to get a bigger one than my old Fagor. This one has only one pressure setting, but I have never used the low pressure in the past, so that doesn't matter to me. I have cooked only a bean & ham soup, and this is a very good pot so far. It has some thicker metal laminated to the bottom, so it browns well. It appears well made, and it is a good deal, too.",
        "Looks good, works as intended. ...tightened loose bolts of the handles. Lot's of a pot for the price! I've been shopping around for pressure coocker for a while, after my old 10qts coocker had estranged from its spot-welded handle. First to be scratch-off my list were those Aluminum coockers (it appears that Al is not a best choice for a pot, for helth reasons); then discarded were those with long handles: what's the point, who invented those... they take storage space for nothing. Remaining was the Presto 8qts; a bit smaller yet stainless and priced half the competition. Diameter of the pot is a great fit to lat-top stove burners; and provided removable stainless bottom tray comes handy.",
        "I love to cook with this cooker, it's faster and makes foods tender and delicious! Use care in adding enough water for steam, and always let it cool enough. to open away from you. The cover is tricky, but I turn it backward a few inches and then forward when it catches. Nine yrs later, I need to replace the gasket and plug, but it's due to age, I've always washed them by hand and stored with cover loose. Love it!",
        "Pros Well made, easy to use. No tricky digital controls and timers, and none needed. Works great with my Nuwave countertop induction cooker on medium, which is 275 degrees. once it reached pressure, I didn't have to touch it until it finished. if you want to time it, you just use the cooker timer. You can get replacement parts like the gasket, which is about all you will ever need to replace. Even the big handles are great. they stay cool.",
        "I purchased this pressure cooker about two months ago, used maybe a few times, now it is not closing the lid at all. Did NOT drop nor brought any damage to it. I can't return it. So now its Trush.",
        "Pressure cookers are really great tools: Cut the time it takes to cook just about anything in half. Make cheap cuts of meat pass for more expensive cuts. This pressure cooker is a simple, straight forward unit with tab handles that make it easy to handle. The size I chose is consistent with the meals that a single guy is likely to make and fits in my kitchen's available shelf space... which isn't all that much. The only minus is that the lid goes on one way and I can never remember which way that is... but I didn't ding it for that.",
        "If you are thinking this for regular indian cooking, keep in mind that pulao, biriyani etc etc stuck in the bottom, burn and very difficult to clean. You can expect to spend countless hours soaking it and scrubbing it. Not much fun. I have been using an aluminum foil underneath before I cook. It is otherwise great, steaming time is much less. You will need to reoptimize all your cooking time if you are used to a regular Indian cooker. I still like it because it is convenient for cooking idlies or dhokla, or even cooking dal or chole. I wish it had an anodized less sticky version.",
        "Love It! Works fine, used it many times for stews, soups, steamed items, Hawaiian, Chinese, Japanese, and Thai recipes. Summer time fun, quick eats, saves on time in kitchen, heat, and bulk cooking for family and friends.",
        "Every single time I use this pressure cooker, I end up having to re-tighten the handles screws with a cross tip screwdriver. Contacted the company about this problem. I never heard back from them.I ended up using (red 271 Loctite) to solve the problem.",
        "I love this pressure cooker and have been wanting it for quite some time. I like the 2 short handle design that fits on the stove top and in cabinets easily. It is heavy and well made. I have not burned anything on the thick bottom of the pan. It is a life saver for cooking soaked beans in a hurry. Making tough meat tender and making life much easier. My daughter had one and lost the pressure gauge, but I noticed that Amazon.com sells them!",
        "This pressure cooker is amazing! It is just amazing! There have been some complaints or “bad reviews” stating discoloration, melting of the rubber parts and other things that hesitated me whether to buy it or not. But when I received my pressure cooker, it came with a paper stating some safety precaution warnings and how to care for it, which means that if you don’t follow those precautions, it can cause melting, discoloration, etc. I have been using it without any issues and cooks very fast! I love it and recommend it.",
        "Bought this cooker 4 months ago. Initially worked fine for 2 months. Since last few weeks, the top lid get very tight upon cooking and my wife hurt & burnt her hands trying to open the lid. Even after you let it cool, the lid is very tight and very difficult to slide to open. Though, it cooks ok, my wife can't use it any more due to the tight lid. I wish I could return it.",
        "This PC is great if you've never used one. I use it to sterilize. It fits 4 widemouth quart jars perfectly when positioned properly. I will definitely be upgrading to a larger unit eventually, but for now this is great.",
        "I ordered this pressure cooker in February 2020, but didn't use it until March 20th. It was very hard for me to use it due to its weight, etc. Also, it is difficult to lock the handles. For someone stronger it would probably be fine, I am 80 yrs old. Now, on March 23, it is over the return period. I wish I could return it because it was costly for me.",
        "Since when stainless steel RUSTS !! And in the FIRST use !! Im very disappointed , although the meat was cooked perfectly but i cant use anymore!! I need a solution for this !",
        "My wife enjoys using the pressure cooker for preparing meats for meals like chicken enchiladas. This newer cooker has a nice feature for pressure release and the handle arrangement is better for storage. Presto has been very generous in replacing parts we needed for our older model pressure cooker. All that information is right on the bottom of the cooker. Lots of other choices, but very happy with what we have.",
        "The instructions are useless. No photos to indicate it is locked in the UP position. I've tried many times to upload a video, but Amazon blocks it with a useless \"There was an error processing your file, please try another file\" message. I've followed every step. There is no other way to submit an image or video.",
        "I bought this mainly to try canning. When I first received it at first I disappointed as came with a 15 l.b. regulator only while I needed a 10 lb one for my canning project. But that wasn't a big deal. I ordered another regulator that could be adjusted to 5, 10 or 15 lb. My first trial turned out great. Not everybody in my household loves fish as much as I do. Nevertheless, Everybody at home absolutely loved the fish cans I made with my new Presto pressure cooker.",
        "I am deducting one star because, after using it a few times it became VERY difficult to get the lid on and off. I am an older lady with a weaker grip and I am not sure I'll be able to continue using this for much longer due to the difficulty of working the lid.",
        "Still getting use to it, have moved up from my grandmother's model 604. I am 79 yrs old, so you know the 604 has had lots of use and will when I give it away to a believer in the safety of Presto Pressure cooker's. Sort of miss the movement of the pressure valve on top on the old 604!",
        "My wife wanted a pressure pot, so after doing my research I purchased this pot. My wife loves it, and I am amazed at how quickly meats can be prepared, cooked and on the table for dinner. What would normally take hours is now done in 30-45 minutes. Great!",
        "This pressure cooker is a quality item that will last for years. The only issue I had was getting used to locking the lid in place. The first time I tried it was frustrating until I realized that you need to line up the little arrows that are pressed into the metal. Once that was cleared up all went well. I also like the idea that this pot can double as a simple \"heavy bottom\" pan for cooking custards and other items where you would usually need to use a double boiler to slowly cook something at a low temp.",
        "This 8 quart pressure cooker is the perfect size for our home use. We didn't have to add on to the garage to store it, and the stainless steel construction is easy to clean.",
        "it works like a charm. easy to use , easy to clean, delicious nutritious food, in a fraction of the time compared to regular cooking. and retain nutrients!",
        "I had an old aluminum Presto Pressure Cooker that I loved and it still works. But I have been concerned about cooking in an aluminum pot. So I bought this stainless steel cooker and it has worked great. It is a little different than my old pressure cooker but I'm getting use to it. [ASIN:B0000Z6JIW Presto 01370 8-Quart Stainless Steel Pressure Cooker]",
        "Easy to use, to clean. I am very used to cooking with pressure cookers. I bought a T-fal Clipso before, and one day the thing almost exploded in my kitchen. Hated that one! This one I tested several times before writing this review. For me, it was perfect.",
        "This thing is great. I use it for beans, soups, and speed-cooking tough roasts. Throw a pork shoulder in and in an hour it's falling apart - perfect for shredding and broiling to a crisp for some tacos. I did a lot of research before buying a pressure cooker. This one seems to be a really good option. The hardware is right and the capacity is large - remember, you should never fill one of these all the way up, so go big. I would buy this again in a heartbeat. It's probably my favorite kitchen tool.",
        "I had purchased the 6-quart pressure cooker and felt it was too small after I received it. I returned it for the 8-quart. I was disappointed I had to pay shipping to return the 6-quart since I am a prime member. However, I do like the 8-quart cooker. Easy to use, cooks great. Love the Presto brand.",
        "This is a great pressure cooker. I love the large size. I can soak four cups of dried beans and cook them all in one batch in this pot. I cook in this pot even when I don't use the pressure. Love the stainless steel. I feel very safe with this pot. There are several safety features in use every time.",
        "I like this a lot.i bought it to use for canning in pint jars when my big pressure canner is too much.sometimes I will have only a few jars and dont want to get out my big pressure canner.this works great.",
        "Real quality stainless steel and easy to use. Forget buying the Swiss versions of this as this product is made in the USA and is built like a truck. I have had the Presto for about a year and you can tell it's good for another twenty. This pot will make meat so tender you won't believe it in less than an hour. Ribs, chicken, stew beef, brisket, anything that fits will be reduced to total tenderness from 15 to 45 minutes depending on what you are doing.",
        "I like this stove top cooker better than electric ones... easy to clean, locks safely, easy to control on stove. Lesson learned not to overfill as steam spews everywhere if overfilled ... my advice is 2/3 full or less.",
        "Unboxed, washed and used immediately. Love presto brand and having used my old type for 30 years (with regular new seals etc) I expect his stainless version to last forever. Am switching from aluminum to cast iron and stainless cookware out of personal choice.",
        "I have always preferred a pressure cooker over an Instant Pot for certain recipes. Love that I was able to purchase stainless steel over my past aluminum pressure cooker. It was time for a new one!",
        "I don’t usually write reviews but was really disappointed with the pressure cooker, I contacted Amazon after few months of use and couldn’t return it! It stopped working completely after one year of use, it doesn’t hold pressure at all, the lid is falling apart. I had to tighten the handles every few weeks, it doesn’t distribute heat evenly so the food in the bottom would be burned and the top won’t be completely cooked. It was a complete waste of money I wish I bought it for BBB I’d be at least able to exchange it.",
        "I am very excited to use this product and based on the reviews I have very high expectations. However, I just received and unboxed my pressure cooker (photos attached) and it clearly shows it is not new. There are signs of minor scratch in the pot as well that were less visible in the photo but the bottom shows clear scratches (someone let me know if I am mistaken).",
        "I have a 23 qt Presto pressure cooker/canner and wanted something smaller for everyday type meals. This is PERFECT. The 8 qt is just the right size to cook a whole chicken (I think the 6 qt would be too small). I have no complaints with the ease of use. If you are familiar with pressure cookers at all it's easy, but I could see where someone not familiar might be confused as to when to start timing. It gets to pressure quickly, so once you see a fairly steady steam, start timing and turn the heat down.",
        "Cooks food fast and evenly. However, the steam plug disappeared and I had to order a few from the manufacturer. The new order seemed to be more sturdy and the one which came with my order.",
        "I am very with my purchase. At first I had such a hard time opening and closing the pot. Now I smell a tiny bit of cooking oil each time I use it and it closes and opens like a breeze. I am cooking the BEST chicken soup in about 1/2 an hour!",
        "I cook all the time and any issues with this is operator error. I even made a complete mess my first time but now... I get it. Made rice and chicken in this without issue. Enjoyed!",
        "Amazing! If you're a foodie and you don't have one of these click no further! You'll love this thing, gotta get it. Super simple clean up, saves a TON of time and energy as it cooks extremely quickly. Love it!",
        "Much better than electric one and much easier to clean. Haven't tried steamer yet",
        "I got a used pressure cooker as my second unit and while it really looked almost new I am regretting purchasing this used one. Steam leaks in one of the handles and just discovered it only week. I tried tightening the screw but that did not resolve the issue. I had no problem with my first unit which was a new one when purchased.",
        "Perfectly fine product. Arrived in great condition too. Yet, at my age, I realized that it would be too heavy once it contained food. Would have felt more secure if it had extended handles similar to old Prestos I regretted having to part with it.",
        "I use this pretty often. Mostly for roast. It works great.",
        "I hate using its difficult to open and the handle is constantly loosing. I had to tighten it all the times!",
        "This is an amazing pressure cooker that is a good size , most pressure cookers are way to big to keep in your normal kitchen instalations but this one is just the right size. The only problem I have with it is after every use it turns black and it takes a great deal to clean and leave shiny again.",
        "I like it because its stainless, the size but i am about to feel like i wish i didnt purchase it, its the most difficult pressure cooker to close or lock i swear!!! So frustrating! Ugh!",
        "This pressure cooker is a welcome addition to my kitchen. I had been looking for an 8 quart electric pressure cooker. Well, I found one, but had to return it. It took as much time as a regular pot on the stove to cook. I just cooked a 4 1/2 pound cut up chicken in this Presto 8 quart stainless steel cooker and it was done in 45 minutes and that includes letting the pressure drop naturally. It is so quiet that I had to get close to hear when the pressure valve popped up. I also have the Presto 16 quart pressure canner, so I was already familiar with the quality of the Presto line. Highly recommended.",
        "I have two pressure cookers. This model and the model that’s a step down in features (and price). Gave the nicer one as a gift to my daughter. Oh what a breeze to fit a secure sealed lid on this model. Would definitely buy again.",
        "Presto pressure cooker, I bought this cooker in Feb 2020. Overall it works well but the only problem I am having with this pressure cooker is this the handles become so loose I have to make the screws tighten after each use which is pretty annoying.😏 And this problem I have it since the beginning. I don’t know it other people have this issue too or not but for me it is very disappointing 🙁",
        "I've used this maybe once per month for the last 4 years and haven't had to replace a seal. I love using the pot as a multi-purpose pot for all sorts of cooking, it's a great piece of cookware. This plus an induction burner is a killer combo, making it basically an even more versatile Instant Pot.",
        "This pressure cooker is an excellent replacement for the one I had for many years. It seems sturdy and should last for many years.",
        "This is a very safe single-pressure cooker. It has a rubber plug that will pop out if pressure got too high; also a pressure activated lid lock so you can't pop the lid when the interior is pressurized. The control nob switches between one pressure setting and \"vent\". The pan is induction safe, so I get it started on my big stove, then transfer it over to the single ring induction for super-efficient cooking at 100 Watts. It makes the most AMAZING soups and stews; ribs and coq-au-vin.",
        "BEST DEAL I EVER. During Black Friday shopping. :D Cooker works great. The loud noise is unsettling when using it, so if you've never used one before, watch youtube videos to know what to expect. It is very loud and you should understand how to use it first to avoid any accidents. This thing makes stew in 40 minutes, its amazing. Love this model, it's simple not too complicated.",
        "I love it at first the handle was a little tricky too close but now I get a hang of it I just love it",
        "I like this pressure cooker a lot, it's easy to use and to clean. I cook in it very often, because my meals are done faster, retain their nutrients and seem to be tastier. I've cooked from chicken soups, stews, ox tail...to beef tongue, which would take about 2 1/2 hours to cook in a regular pot, but in the pressure cooker only 45 minutes. I recommend it highly.",
        "Love pressure cooking. Learned to use a pressure cooker with various electric pots. Went through three electric pots. The electric pots broke within a year each time. Purchased this stove top pot and am very happy. It seems to pressurize faster than the electric pots.",
        "Awesome. I like that there is no long handle to worry about when the little ones are around (not that they are allowed near the stove but for safety just in case). I should have bought a 12 quart though. Planning to give this to my daughter and upgrade!",
        "My old one quit, Did a lot of reviews, found this one. Works great & remember 8 Qt. is the right size.",
        "This is extremely difficult to close. I have tried the tricks recommended in the booklet that came with this thing to no avail. But it is even harder to open. I have tonight's dinner in the cooker, smelling delicious, but we will be having peanut butter sandwiches because I can't open it. Nor could my son who works all day lifting huge boxes.",
        "This is a great pressure cooker. I replaced my 35 year old one and was a little afraid to start new. It is made well and is easy to use. Love it",
        "8 quart, lots of room. Excellent product, I have 2 of them for cooking pork and chicken, for making tamales.",
        "Quality pot with extra safety measures. Easy to clean. The cover can be a little tricky to get on at times, but look carefully for the arrows and then it securely clicks in place. I'm never afraid of this top popping off.",
        "I bought the 6-quart originally, and then I bought the 4-quart to use for smaller things (like veges to have with dinner). I use both and like them, but the 8-quart is just a much more convenient size for me. I don't have a large family, but I cook a lot of rice using the bowl method (rice and water in a stainless steel bowl in the cooker). This works much better in the 8-quart. I also like the way this regulates better than the other two sizes. The knob is less annoying than the rattler thing on the other two. Cooks great.",
        "Only problem is, I can never figure out the way to attach the lid - I just keep trying and eventually it locks on.",
        "After using this for a half-dozen recipes, it's not the cooker I would have wished for but I'm very happy with what I paid for. The steel is thick and tri-clad on the bottom. The handles feel a little cheap and the pressure mechanism falls off all the time with only moderate handling. This isn't the best pressure cooker out there, but it seems sturdy enough to last a very long time. However, it definitely is a very good buy for the cost.",
        "Best thing since sliced bread!! We love this cooker! We never owned one and decided to try this one. We used it and are amazed at the very very very short cooking time and the taste of the meat and the tenderness.. omg was it tasty and tender!! We are very pleased and would recommend this to anyone who cooks!!!",
        "Easy to use and clean. I started using it for any bone broth as the flavor is so savory as cooked in this pressure cooker.",
        "Excellent does exactly what it should. I cooked chickpeas to be super soft in quarter of the time it take in regular pot",
        "My wife managed to loose one of the safety valve pieces, and whittled down a wood spoon and crammed it in there. I discovered that last night. Nope, time to replace it.",
        "i love the safety features i had a really old one and didnt feel safe using it",
        "My go to for quick dinners, stocks, soups, and almost anything I'd normally bake. Cleaning's a bit fiddly, though.",
        "I was reading reviews trying to figure out how many quarts jars this will hold. It holds 4 quart size jars perfectly. Just what I was looking for.",
        "Buy the stainless version as it is easier to clean and to keep from becoming stained. I also recommend the larger 8 qt over the 6 qt as there is less likelihood of over filling the pot and potentially plugging up the pressure relief. With the short handles on the new 8 qt version I find it easier to open and close. My new stainless is not showing any signs of the hardware corrosion reported by others. I still have my 40 year old 6 qt aluminum version of this cooker it still works!",
        "This pressure cooker is a great helper in the kitchen. Cooking time gets cut in half and full meals can be created easily. Highly recommend!",
        "Very solid construction. I like that with this model, unlike cheaper ones, I can just flip the valve and release all the pressure without having to move the pressurized pot. After some use, there are a few stains, but that is to be expected. If you have never used a pressure cooker to make a cheesecake, you need to try it (this one will accommodate up to a 7\" springform pan).",
        "Not happy with this pressure cooker. The lid gets stuck and is hard to open, even when it has cooled down.",
        "This is a different way to cook your foods, very high quality piece of hardware.",
        "I did not know anything about pressure cookers or what size I should get, so after looking and looking, I chose this one. I am not disappointed. It is easy to use, especially for a first-timer like me. The first meal I cooked was potatoes. I put several in the cooker, enough to feed all four of us, added a little chicken broth and left it alone for about 12 minutes. The taters were cooked perfectly, soft and tasted great. I didn't mess anything up and everything worked as it should. Easy to clean up too. A great addition to the kitchen.",
        "I have been using presto from last more than ten years. It is awesome.",
        "We use this cooker all the time, and we love it.",
        "easy to use cooks fast. Great instruction manual. Love it.",
        "This pressure cooker is fantastic easy to assemble easy to use easy to open easily clean and very efficient definitely recommend it",
        "Have been using this for several years now. The 2 things that may need replacement because of normal wear is the gasket and the rubber valve.",
        "I love this pressure cooker. I have purchased this one twice. I dropped the lid and broke the handle on the first one. I was able to order the replacement part, but after several tries, we could not remove the broken part. I just gave up and ordered a new one. I am happy that I was able to get the same model. A great timesaver.",
        "This pressure cooker is great. I have used it several times now. Its easy to use. I love it.",
        "Wife loves this pot. New design features ensures user safety . Cooks great and runs quietly. Material is nice also.",
        "size I like to get short in high and wider in width so easy to stir, mixing easy and serving , Presto used have them longer ago size wise different type but do not see them now. I use for making stew so it is easier size is short and wider.",
        "My parents love this product very much. They used this cooker every week. You will never regret it."
    ]
}