{
    "entity": "Pressure Cookers",
    "text": [
        "After canning for years with two 7 quart units I purchased this \"top of the line\" unit from Amazon. Working with the All American help line for about half a day, we tried every tweak they could muster. After eight consecutive failures to seal, the correct response from the company would have been: \"we are sorry this unit isn't working, we will send you a new one. The response I got was: \"send it to us so our engineers can try to make it work.\" Now I have spent the better part of a day and am exactly where I started, unit sent back to Amazon and two, tried but true 7 quart canners. A whole lot disgusted.",
        "Unable to use due to the pot being bent into a very slight oval shape upon arrival. Lid cannot sit level, rocks on two points, and cannot be latched or tightened. Packaged appeared undamaged.",
        "Received item without the $30 Weight or instruction manual. This was a next day order and is unusable without the pressure weight.",
        "I had to return it. The lid did not sit right and no matter how I tried to set it on the pot, it rocked. Yes, I oiled it with olive oil. I had a friend who has one look at it and he agreed that my lid did not sit correctly. Cannot pressurize something that defective. I will change my review when I get one that is correctly made.",
        "The defective canner lid would not sit level on the canner. With the light application of oil the lid should have aligned and sealed evenly on the canner pot. The instructions were followed. Very frustrating and I lost $50 in food because it would not hold pressure even with the heat on high the entire time.",
        "1st time using our new pressure cooker. We could not get the cover open. Had people over for dinner and had to order takeout. How embarrassing. Returned item with corned beef in it. Waiting for our $20refu d for the corned beef too. I would never, ever recommend this product.",
        "I’ve looked at these for a couple years now an I just bought one. And I’m glad I did. First of all I’m retired. I live in the scenic hills of southern Ohio. I’m still able to kill a deer. And I also do a little vegetable gardening. I’ve also been blessed with a retirement from the Machinist Union. Just taking this thing out of the box was a real joy. The company that manufacted this baby has the old school knowledge that most have lost. GREAT JOB ! Wisconsin Aluminum Foundry Co. I thank you. And I appreciate your work",
        "This canner was designed with safety in mind. Thought this would be almost too tall for my stove and vent hood but had plenty of room. I like that I can double stack with pints since most of my canning is done in this size. The first canning I greased the lid and rim with Vaseline. Had to get the hammer and cloth to get lid to turn off the side locks and open. However the second time after canning, greased with olive oil and lid came off like a breeze. Have enjoyed my early Christmas present, 6 months in advance. Would recommend this canner for anyone interested in using a pressure canner.",
        "Parts were missing when I received it and I can't get any assistance with this issue!!!",
        "Absolutely PHENOMENAL canner! I bought this as a Christmas present for my mother almost 2 years ago, and when I say it is the best pressure canner on the market I mean it! We have gotten hundreds of uses out of this canner. We can almost every weekend with this! So sturdy, reliable, and useful! We've never had any issues with it what so ever. This is the Rolls Royce of pressure canners, and it works fantastically for canning jellies and jams, fruits and vegetables, soups and meats. You name it, we've canned it! Highly recommend if you want a fantastic and reliable canner!",
        "No where in the description does it state that this product is for \"Home Use Only\" even though it comes up[ under search for \"Commercial Pressure Cooker\". Then if anything fails like my pressure gauge failed, All American will not even sell you the part much less warranty the item at all!",
        "This is an excellent product for home canning. Follow the directions and the online guides you can find and there are several videos on you tube which can be very helpful. I found petroleum jelly works works much better than oils for the rim of the lid and pot. it is a good idea to wash per directions before first use. the first use should be a test run with one jar filled just with water to get the hang of using the unit and to make sure you get the seal correct.",
        "My pressure cooker arrived in July of '19 and I immediately began to use it. Now, in October, we have canned around 700+ quarts & pints. From meat to veggies then broth and lots more in between, we put this cooker to the test. We found the dial to be spot on and the outside held up to the gas stove use. We double stacked pints many times and it has proved itself worthwhile and saved us a boatload of time by double stacking. It arrived snuggly surrounded in styrofoam and heavy box with everything included. The direction manual was helpful and nice to have. With no seals to reorder and mess with I find this cooker efficient. Happy canning!",
        "This is our 2nd one of these. my husband does all the canning and when he does, he keeps 2 going non-stop. It is durable, safe and let's him accomplish so much especially during this time of \"Corona Virus/ food availability uncertainty!!! He uses it for meats soups and veggies. our 1st one is probably 8 years old and functions just like new. ``highly recommend.",
        "Im joining the thousands that gave this the 5 star rating. Never seen such high reviews on ANYTHING in Amazon. This cooker is a solid well built product that will last you your lifetime. I've been through a few cheap ones with rubber gaskets that will leak after a few uses. Should have saved the money and just buy this in the first place. You get what you pay for. Mine is the 24 quart. I canned some trout yesterday. Solid, well built, well machined parts. Very Happy!",
        "I'm using it right now to make some stew. Very high quality piece. Don't be in too much of a hurry to build up pressure or you can burn your food. Use a colander on the bottom to raise food off the bottom if range is on high, or allow more time to heat up your food gently. It cooks very fast as it radiates heat all throughout the unit when it reaches your operating tempreture. I really like mine, and expect many years of service from it. I much prefer it to the my electric ones.",
        "Have only send this twice but it does a great job, heats up very quickly, easy to keep tempature accurate once you figure out your setting for your stove. So far I'm loving it, wasn't sure about getting the 30 quart one but I'm glad I did, I will be able to use it for so much more canning. We called for the DVD that gives you all kinds of tips on the pressure cooker itself but also on canning all kinds of things, Customer service was great when we called for it. Would definitely recommend this line of pressure cookers.",
        "I was so excited to receive this today! As per the instruction booklet, I gently washed and dried it and added a tiny bit of lubricant, but nothing is going to make this lid fit the spot. I can’t tell if the lid or the pot is the problem, but it does not have a uniform gap all the way around and therefore does not seat properly. My only choice apparently was to return it, which I am doing. I hope someday to be able to buy another one that is not a lemon.",
        "This thing is built like a tank. It is as solid and well-made as you would expect any high-end commercial equipment to be. My only piece of advice would be if you are on the fence about whether or not to go with the 30 or the 41 quart, let your available space make the decision. We have already had the need for the larger one but didn't really have the space to heat the 41 quart model. So saying that I would rather have the 41 quart model isn't any kind of knock on this 30 quart model. For its size it does a phenomenal job and we haven't had any problems at all.",
        "No other option on the market in my opinion. So well built, so dependable, and virtually maitenance free.... Canning is a pleasure !",
        "I have 4 All American canners. They all work great. I use this one on the glass top stove. It takes full high setting on the heating element to can a full load. The Presto 23 qt. Doesn't require as high setting, but that appears to be because it is thinner. The bottom of the presto is shaped better for a flat top burner. I use them both a lot. I like the Presto, I love the All American.",
        "I love my pressure cooker. I bought this 3 years ago when my family first started gardening. When we realized that we were producing more than we could eat fresh we decided to start canning. After looking at other pressure cookers I decided to spend a few extra bucks and get a quality one to start with. I know there is a lot of concern about using this on a glass top stove but I have not had an issue with my Whirlpool stove supporting the weight of this. Enjoy the fact that with proper care this is the type of item that you will use, your children will use and one day your grandchildren will use.",
        "First timer hear!!! Have had it up to pressure already on a trial basis and with no problems. Not sure what people who are having troubles getting a seal are doing wrong. Just read the instructions folks!!! Put your oil on the taper, tighten it down evenly and your on your way. Oh and don't forget to put the 'Jiggler\" on or it won't work. This thing sealed no problem - built up to 15 lb @ 250 degrees F. and then \"jiggled\" away and vented as designed.",
        "This pressure cooker stands far above all other rivals. Yes I know that is a bold statement, but I assure you this unit has earned it. My wife asked me to get her one of these for Christmas two years ago, and so she got one. I must say that when you see this thing in person you will be shocked, because frankly I was. The pictures do not do the quality of workmanship of this product justice. As for it's function... it just works, and works darned well with zero hassle. If you want a pressure cooker that will last and even become a family heirloom to be passed down, look no further.",
        "I haven't used this as yet. At my age, it's very heavy to handle so I'm going over pros and cons! I'm impressed with the quality of this product however. I returned this item because of the weight. I'll be 75 in Nov. and older than that next year during canning season. I reasoned that the weight issue wasn't going to improve from me. I was impressed with the quality of this item however.",
        "I love this canner! It's made in the USA and in Wisconsin. It has safety in mind too. There are small brackets that fit under the lip near a connector to ensure that the accidents that your parents/grandparents talk about do not happen. It's very heavy and difficult to move when it has water in it. I can only assume that the smaller ones are much lighter. I would not hesitate to buy this product, it works like a charm and is well built!",
        "A most excellent top of the line pressure cooker. Why settle for anything less. Let me put it to you this way, it's like anything else in life. YOU GET WHAT YOU PAY FOR. Go cheap and you'll be buying gaskets and messing with the pressure cooker every few years just about the time you need it. But the All American 21-1/2 Quart Pressure Cooker and you will have a pressure cooker that will last you a life time. Happy, Happy, Happy Very Nice Seller, Fast Shipping, Great Value. Why go anywhere else. Thank You",
        "Heavy-Duty, quality pressure canner. Did a flawless test run on my glass top stove. Be sure to check with the manufacturer before you try it. I was lucky, my Maytag user manual had pressure canner info. Basically you don't want the canner to overlap the burner. Heat and weight can cause the glass surface to break. Otherwise, be prepared to run it on a gas stove or propane burner. As a note, I did my research and waited until I could save up for this one. There are lots of cheaper canners out there, but then they are cheap.",
        "Love it. Replaced my old presto pressure canner. The capacity is great/double of my old one. It works very well, easy to use. This was a godsend as we had a bumper crop this year. If I ever need to replace this I will most likely buy another. Only down side is the weight when fully loaded. I have no issues moving it buy my wife does. It also does not fit on my stove top so I use an outdoor propane cooker.",
        "Had problem getting the exact amount of lubricant needed so that the unit would seal properly and not leak steam and then water droplets under the weight. I contacted American's customer service and they were not very helpful at all.",
        "Love this pressure cooker. Being a newbie at pressure cooking and having some reservations as to how complicated this could be I was hesitant to purchase. The directions were easy to follow. The only tricky part was getting all the valves correctly seated so there was no steam leakage. Finally figured that out. Have made venison stew, chicken noodle soup, beets, and string beans. Looking forward to experimenting more with next summer's harvest.",
        "This is a nice pressure cooker, a bit more difficult than most because you have to turn each screw down to close the lid where other Pressure Canners you just turn it to secure the lid in place. You’ll need a lot of muscle just to lift the Canner itself. Once you place filled jars in it you may need some help lifting it off the burner. I’m strong yet it is very very heavy! Check the weight when you go to buy it so that you know you’ll be able to lift it, by itself without the weight of filled jars in it . Other than the weight, it truly is a beautiful product American makes.",
        "Canned perfectly the first time. I used it on a two burner Camp Chef. Very easy to use.",
        "This product does what it is supposed to do. My only complaint is that it is very heavy which makes cleaning a bit of a chore. I have a phobia about pressure cookers but this one has the best security locks I've seen and I feel quite confident about using it. The one thing to be careful about is setting the lid down properly, make sure the beveled edges sit properly.",
        "This thing is an absolute must for any person wanting to can in bulk. I cut my canning time for tomatoes in half by using this product as opposed to my water bath. I bought a double burner camping stove that runs on LP to use as my heat source. This is a very heavy canner and the fear of messing up my stove led me to purchase the camping stove. It also puts out a ton of heat, so if you have a cooler basement to use this canner, it would be a lot more comfortable. Great product!!!",
        "I can see why I paid so much for this. The workmanship is impressive. I love that i'll never need to buy a gasket and that the safety features make this one of the safest on the market. If you can invest the money and buy this you won't be sorry. Also like the fact that it has both the pressure gauge as well as the shake weight. You always know where you stand.",
        "I have 2 of the presto pressure cooker/canners. It takes forever for them to come up to pressure and you have to constantly watch the dial. With this one it takes no time for it to come up to pressure. I simply love it.",
        "I purchased this size because I had a microwave above my cooktop. I made my husband put a hood, so I could buy a larger one. I purchased my second one at an antique store. I contacted the company and it dates back to the 1920's and is in perfect condition. So, now I have two. If you love PC, then invest in something that will last a lifetime. All American Pressure Canners are designed to last a lifetime and be handed down from generation to generation. There are no gaskets to replace, so when your granddaughter gets it, all she'll need are your recipes.",
        "As a novice canner, I bought this model after doing some research and reading product reviews online. Now that I've used it a few times, I can say this is a fantastic product! The instruction manual is great and lays out everything you need to know. If you are worried that pressure canning might be unsafe, you can rest assured this product is safe. I am very happy with this purchase!",
        "I bought the 30-Qt All American. One thing to know, that i found out pretty quick, is that it will can 14 wide mouth masons not just 14 regular mouth jars. It is also deep enough to cook 1/2 gallon jars as well. i'd assume probably 5 @ 1/2 Gallon masons. I have been using the cheap Walmart canner by Presto. I have replaced it 3 times. I don't think, by the way this one is made, that i will ever have to replace it. By the way the old Prestos make good water distillers by that's all i'll ever use it for again.",
        "LOVE this pressure canner! I purchased this model (American Pressure Canner Model 925) last summer, and I have not been sorry for one minute! It is perfect! Instructions on how to use it are very clear, very helpful! The quality is great, and the manual includes recipes and guidance for pressure canning times. I highly recommend this pressure canner - I have used it regularly and am so impressed with the quality and workmanship!",
        "Canning my own broth and soup with this canner. Getting more confident every time I use it. If new to canning like I am read the instructions each time until VERY comfortable with this canner.",
        "I have been wanting an All American but wasn't sure about paying that much money for one. I finally gave in and bought one. I absolutey love it! The first time I used it I noticed it was leaking steam from the sides. After making an adjustment buy tightening the lid down more, there is no leaking steam now. It's very heavy duty and durable. I hope to get many years canning out of my 915. Glad I made the purchase.",
        "As you would expect for the price compared to similar foreign-made options; this is a very high quality, heirloom-potential, USA-made pressure canner that will last for decades, properly cared for. There are no gaskets to wear out. The lid closure is precision-machined so that, in combination with a smear of olive/cooking oil, the screw-down latches create the seal effectively enough. You do need to follow proper tensioning of the screw latches in order to keep a proper seal. Could you get away with a less expensive, foreign-made product? Yes, there are some decent enough options. But if you want to support USA-made and have a canner that you might never need to replace -- you've found a great choice.",
        "OMG!!! I could write a whole page on how wonderful this pressure cooker is. I have showed it to all my friends and family and they all think it looks wonderful. I waited a long time to buy one because I was afraid of them. And this one was the only one that I found that I wasn't afraid of. But, most of all it works GREAT!! If your afraid of Athem like I was, this is the one to trust, it is heavy duty and works great.",
        "I was in the market for a pressure cooker for a while, and during the process of researching things (as I often do more than necessary, lol), I learned a lot about these devices. To be brief, if you want the best, buy All American. The metal to metal seal is far superior - and low maintenance - in comparison to any gasket, the construction is good for a lifetime of use, and there is just something comforting about the rattle of the pressure regulator that reminds of childhood with a mother who canned in the kitchen. I could not be happier, and the purchase was money well-invested.",
        "This is a great product. They just do not make things the way they used too so that they last a lifetime anymore, except with this canner. It is such great quality and will definitely be something that can be passed down for generations of canners after I’m gone. Thank you for restoring my faith! I have recently learned to can by watching videos and this canner was a breeze to use. I love the simplicity of use and the assurance that my food will be safe and fresh for my family.",
        "This is my first season ever that I canned my garden produce. The All American Pressure Canner is fantastic! I chose the mid-size 15-1/2 Quart pressure cooker so I could lift it (when it is empty) and that it would fit on my glass stovetop. It was a great choice!!! Just the right size for me to handle. I was at first really apprehensive about the safety issues and after one round of canning my concerns were lifted. It is really simple to get the lid on and off. I am glad I chose to go for a pricier canner. It is worth every penny!! Love it!!",
        "I had a morbid fear of pressure canners. But I really enjoy canning. Some things that I wanted to can could not be done with water bath. So I did serious research and decided on the All American product. Soooo easy to use. My fears have been put to rest. I highly recommend this product.",
        "I love this pressure canner, I made a batch of ham and beans and every can sealed nicely. I also used it on an electric stove top with no issues. Make sure to read the instructions carefully, you don't want to try to use it without proper preparation. Use petroleum jelly on all metal to metal seals and take good care of this item and you will thoroughly enjoy it for a long time. It is very well constructed.",
        "I've been canning for more than 40 years, and recently purchased the All American 921 canner. Without a doubt, it is the best canner I have ever owned, hands down. The safety features are what ultimately convinced me to purchase it, but the fact that I can also process 16 pints at a time is a huge help, too. I know this canner will be the last one I ever need to purchase!",
        "After much research and speaking to friends that pressure can, I went with the All American pressure canner...and I'm so glad I did. I wouldn't go any smaller. I think for my needs this is about perfect. This 21 1/2 quart is a little workhorse and will surely last beyond my lifetime. This is a quality product that is a pleasure to use. I strongly recommend this product.",
        ". Update: I bought a new one. 941. Excellent canning. I'M having a ball. Easy set up, easy to use. Im canning everything i find. Recommend it to the serious canner.",
        "This pressure canner is exactly as advertised...How often does THAT happen. American Made.....How often does THAT happen This canner was a gift for my wife. She was delighted with the safety features and the overall ease of use. I liked the design. There are cheaper canners available but not the same quality. We were both very satisfied with the value. You get what you pay for.....Now THAT happens often",
        "LOVE, LOVE!! Its easy to use, and easy to follow instructions. Grew up using my moms 70's model, so I knew the general process of closing and making sure the seal was good. Have done chicken and broth already and every single jar sealed!",
        "This is the best canner and brand to purchase. My grandmother had this brand and my mom still uses it and it's still in amazing condition. I got this one because it holds 14 quarts. I put it on a burner outside and let it do it's thing. So easy to use and the only one I would recommend.",
        "I was so intimidated when I first got this big ole thing in the mail. It was my first time canning but I wanted the best so I got the best. What helped me so much was the DVD that came with the pressure canner. Watch the DVD and yes read the owners manual. You cannot go wrong if you do those two things. This mamma-jamma is built to last a lifetime. Don’t let it intimidate you. Just read booklet and watch dvd. You can’t go wrong. Great product!",
        "Works well. No problems with the fit. If someone tries to close it without keeping it level, they will probably have problems. That's something that some people just can't do...but if you need something to be fool proof, you probably should not be using a pressure cooker. :-o",
        "I own 3 pressure canners and this is by far the very best I own. Great instructions, easy to understand and handle. Highly recommend this USA made product",
        "I wanted to get a pressure canner for some time. One of my friends who's been canning since she was little recommended this one. The price was intimidating, but she told me that it was worth it. I got it as a late X-mas gift, and used it first to can up some corn and chicken stock. I was amazed on how quiet this was when the jars were processing, and that it doesn't need a gasket, just a little bit of oil around the edge. So far, it's processed everything I've done beautifully. I can't wait until my CSA starts coming in and I can can up all my fresh food.",
        "It's heavily made, and works wonderful. I had to learn how to can after 40 years because my old canner was thinner. This one is heavy and maintains heat so well that you have to turn it down once it starts jiggling. It is heavy when empty for those who have trouble lifting , but well worth the money.",
        "The All American is built solid. I love it. The safety features and durable clamps make me feel secure when canning. It is heavy compared to other brands but I know it will last a lifetime and I will be able to pass it on through the generations. Best buy I have made all year hands down.",
        "Excellent canner. I have always borrowed my grandmas older All American Canner. I finally broke down and bought my own. I like the updated pressure regulator, it’s doesn’t require as much flame adjusting. The fact that this canner will process 14 quarts at a time is amazing.",
        "What can I say that others haven't, it's perfect. It is exceedingly rare in today's world that I buy something and am completely happy with the purchase, however I can't find a single thing about this that I would change. Great job to the All American engineering and production teams.",
        "This is a monster. I love that there is no gasket to replace. It has an actual pressure gauge instead of counting jiggles. It holds 14 quart jars! Ive cooked 3 whole chickens in it at one time. Best canning purchase. I have a glass topped stove so I use a turkey fryer base that I use. This also keeps me from having to lift it full which would be impossible. Hubby has to do that.",
        "This pressure canner is great. Very well made. Comes with detailed instructions. The seller/shipper was super responsive, shipped the canner quickly and even made sure I had a paper receipt for the warrantee. I’ll definitely go back to them-highly recommended product and vendor.",
        "So far so good. We canned beans and beef and chicken. Everything works great. Cleans up easy. It would be nice in the description on how many quarts and how many pints each canner will hold!",
        "Best product on the market BY FAR. Of you're looking for a pressure canner for beginners and experts alike, look no further.",
        "Oh my gosh this is the nicest pressure cooker I've ever seen! So glad to have spent the extra money and purchased this. It is HEAVY, VERY HEAVY, and that helps me feel more secure in using the product. The screw down lid and the extra catches under the lip also make me more secure in its use. I have not used it yet, but expect to in the next few weeks as I put up some pesto sauce. I am VERY VERY Happy with this purchase and expect it to be handed down to my daughter some day.",
        "I purchased the 941 that boasts it's ability to can 19 quarts at a time. I must say that was a deciding factor in my purchase, well I could only get 16 quarts in, still better than 7 but disappointing. I called the company they said that number is an estimation! OR I had wrong size quart jars! I hope they didnt estimate any other numbers! I like the quality, it's substantial. It's a great add I'm just disappointed that they were deceiving. Also I am looking at the 915 for smaller jobs. #pleasedbutdisappointed",
        "Best pressure cooker ever. I use it as a pressure cooker. I love this thing. I had a Fagor for years and changed the gasket several times during it's lifetime, but it lost it's ability to hold good pressure. Now with the All-American I see a huge difference. Holds pressure amazingly. I love after turning off the heat and letting it come down in pressure for about a half hour. Having the pressure gage on the unit is such a nice thing too. Cleans up easy and is joy to use.",
        "I love this pressure canner. I'm a bit paranoid of pressure canners and cookers, but I feel very confident in the safety of this one. I love that it has a metal-on-metal seal and I don't have to worry about a rubber gasket that slips, requires maintenance, and needs to be replaced every couple years. I love that this is made in the USA. I do a lot of pressure canning, and I can recommend this canner above all others that I've used. Just be sure to read the directions thoroughly for safety and best practices.",
        "I researched for months before purchasing this canner. I am so glad I purchased this! My only regret is that I did not order the next size bigger. Seriously, this thing is a beast. It is very well made and heavy! Read the instructions and make sure you put Vaseline on the rim when you use it, or it'll be very hard to open once the pressure has gone down. I will be purchasing another in the future. If you are a serious canner, and would like to be able to only buy one your whole life... Buy this! You will not regret it.",
        "Works very well. The gauge is accurate as well. Some reviewers said that their lids stuck. Mine did not. I followed the directions to lubricate it and had no problems. I love that I can do two levels of jars at a time now. Do note: canners cannot self-regulate themselves, even with the relief valve. You must adjust the heat source so the relief valve jiggles according to the directions. (jiggles and stops rhythmically)",
        "Top notch quality as expected from All American, theres a reason they're #1. Cans 14 quarts with ease, only thing to keep in mind is the whole mess is quite heavy by the time its locked and loaded, you'll want to make sure your burner is up to the weight.",
        "I had not canned anything in my life, but I needed to make room in my freezer. I researched pressure canners and settled on this one. I've canned two batches of salmon (14-pints per batch) and enjoyed sweet success thanks to this easy-to-use pressure canner! Well made and comes with a thorough instruction booklet.",
        "Excited to use this during canning season I tried it out on some turkey stew I made and I have to say I am in love with this!",
        "We finally got to use this pressure canner and made meatloaf! It came out awesome and we were able to fit 12 quart jars in there with room for 2 more! Can't wait to can some more- definitely well made and easy to use!",
        "It took 2 months to get my new pressure canner but it is a serious unit. Very tough and nice design features like no gasket or o-rings to wear out. I am glad I was patient and waited for it instead of canceling my order.",
        "This is one of the most durable presser canners on the market, it is a timeless design. The quality of construction is clearly seen as you open it, and you can tell as you pull it out of the box that you be passing this down to your kids when they are ready to start canning! after becoming familiar with the unit low acid canning is a breeze!!! Seriously LOVE THIS!",
        "used this as a pressure canner and it worked great! double stacked pint jars and got 18 jars per batch. so much nicer than my old pressure cooker/canner with the rubber ring. and was delivered fast! we are very happy with this purchase.",
        "This is one of the best things I have ever bought in my life. It makes canning so easy. It is a tank and will last the rest of my life if I am careful with it. It is heavy and may not be good when I am elderly because it is very dense. I love it it is working perfectly and the instructions are great and they have a video that you can go on the Internet to watch. What I like to say to friends and family is, ( If I can do it you can do it.) anyone could be a successful Homesteader with this amazing object.",
        "This All American 930 Pressure Canner is the best! We were able to can 14 quart jars at once. It is a really well built and designed pressure canner and we couldn't be happier with our purchase! Thank you!",
        "This pressure cooker is amazing. It's easy to use. It takes a minute to screw the top in place, but it is secure. I don't worry about it exploding or anything. The bolt hinges remain attached, so I can't lose them in the kitchen cabinet (or garage in the off-season). The pressure dial is easy to read and the instruction manual is easy to understand. I like that we are able to can seven quart jars at a time...no problem! My husband and I did a lot of research on pressure canners before selecting this one. SO VERY HAPPY!! All of the \"tried and true\" canners (people) that I know, say this is their favorite, too. Buy with confidence!",
        "I have had this for a few years and it still as good as the day I purchased it. As you can tell from the picture It has been through the wringer and still going strong. Great Product.",
        "We had a comical experience the first time we used it, only because no one was hurt. Smarty-pants we were, we didn't read the instructions. It worked great for the first few runs, then the lid became progressively harder to open. We wound up prying it off with a screw driver [turns out that IS an accepted solution in their manual]. The last time, though, it blew and scalded and unknowing husband walking by. Serves him right for being in the kitchen with a bunch of women. He is OK. I finally read the instructions and learned you have to use some vaseline now and then along the contact points. Otherwise I love it!",
        "I use this to cook the most amazingly tender stews in only about 40 minutes. You haven't had a leg of lamb or a chicken unless it's been cooked in one of these. It also fantastic for homemade canning to sterilise the jars and lids. Very heavy duty and has worked flawlessly for many years, and I expect it to last for decades.",
        "That's what my husband said. Very easy to use. Follow the instructions the first few times. I'm glad I went for the one that cans the large mason jars. It sucks to have to use so many little ones when you are feeding a lot of people. I will treasure it for years. Worked great on my 1964 Frigidare stove.",
        "these are probably the safest canners on the market that I've found. Love the idea of not having to boil seals everytime",
        "Everything is soild and works perfectly. My wife (never used a pressure canner) hit the ground running without any problems. Follow the directions and it'll work for you too.",
        "I received a bent rack with my canner. Bad quality control!",
        "I love this pressure canner. Amazing quality, this thing is built like a tank and no gasket to worry about or replace. This replaces a Presto canner that I had for several years. I am really impressed with the quality construction of this canner, it's amazing. Just a great canner, what else can I say. Wish I had bought this much sooner.",
        "I always wanted one of these. Finally got one. Easy to use. I Love it. Thank you.",
        "That heading should only be read as a possitive trait. I remember by grandmother and my mother canning all my life. Those pressure cookers were passed down for generations and seemed nearly indestructable. I was very pleased when I recieved this cooker to see that is was every bit as SOLID as what I remember my grandmother and mother using. This will certainly be passed along to any of my posterity that has any interest in canning. I should mention that before purchasing this, I had never canned before, but I am now a fan. Whether you decide to can as a hobby, or out of necessity due to rising food costs, you will not be disappointed with this canner.",
        "If you are into canning or serious pressure cooking this pressure cooker is for you. Made in America quality. We use this to pressure cook meat for stew. Uses a metal to metal seal which is excellent, but you have to be careful not to damage the lip or the lid. The pressure relief weight just uses gravity, so be careful not to let it fall off when removing the lid.",
        "This canner is heavy duty aluminum with functional safety features. My first canning effort (home grown carrots) went very well. It operated just as the instructions indicated. This canner is not a toy or a knock-off copy, but the real thing. I am looking forward to preserving much of my garden produce.",
        "My 3rd All-American canner. I can 12 or more cases of fish and venison a year. Sometimes I get all three canners going: one filling, one cooking, and one cooling. These are the best. Don't be to greedy; my husband bought the biggest one so he would only have to do one canner at a time. I can't lift it and it doesn't fit on my stove (too tall). Used it on the propane cooker outdoors until I traded on the 25 quart model.",
        "Love love love this canner. Definitely worth the extra money to get an American made, metal-to-metal seal, and double stacking canner. Being able to do 14 qts is incredible. Heavy duty quality, will last for several generations. Beware, do not use this size canner on glass top stoves. The weight could cause the glass to break. Also consider the height above your stove. I took this canner to use at a friends house. Her above-the-stove microwave prevented the canner from fitting on the stove. FYI: make sure you fully \"lube\" up the metal seal area, you'll need to do after every 3-4times of use. If you don't, the lid won't come off as easily. It happened to me once.",
        "bought for the Wife, she loves it, raves about it. beware book and 151 rack come with purchase and don't need to be bought separately, learned the hard way and cost me shipping to send back. Bogus......",
        "This is top quality equipment for your kitchen to hand down to your daughter & her daughter. The reason this pressure cooker is still around is due to quality. If you want to can meat or anything else the All-American is the one for you. It came with a dvd instruction, instruction/recipe booklet, psi weight, 1 rack. Serious about canning - when you look at this pot it speaks \"I'm serious too & ready to do work for you\"!!! It is impressive,"
    ]
}