{
    "entity": "Pressure Cookers",
    "text": [
        "Wow- this canner is amazing!! I took my time, read the manual, watched user videos on Youtube, and took a shot of my own and it was a home run. I found a few recipes I wanted to try (spaghetti sauce, black beans, and caramelized onions) and every single one of them worked perfectly. I've canned 20 pints in my first week of owning this Presto! I follow recipes exactly and it has helped knowing that there is no guessing. I also much prefer that pressure canning is mostly inactive work while water bath canning takes much more work. I love this canner and the ease of use!",
        "it does what it promises. Excellent pressure cooker. I would of loved this canner but after 3 mo the Gage no longer works and I nearly blew the canner up because I couldn't see the pressure. NO longer able to return.",
        "Ordered this product as a large capacity canner, with intent to start pressure canning. First shipment arrived, the lid wouldn't fit onto the body of the canner, so I sent it back for a replacement. Received the replacement, and the same problem persists. Both times, the lid I received was too small to fit in place. Will not order from this company again. Extremely unreliable QC.",
        "I'm not one to complain, but this only lasted 2 months. I used it a lot, but I still wouldn't have expected the bottom to corrode in such a short time. It will no longer hold water, let alone pressurize.",
        "My first one of these the bottom got all “blown out” after a canning process and when I tried to get a replacement the person was mocking what I was saying and refused to help me get a new one.",
        "The original gasket for the gauge broke the first time I used it. I was trying to can carrots today. Unfortunately their is a flaw in the metal on the top of the pressure cooker and it will not seal. I am very unhappy. I am positive the gasket is not the problem I have already replaced it. I ordered this in may of this year. I have been very careful with it. Apparently even tho it is less then a year old I can't return it.",
        "I have had this for several years and it’s been the best and continues to be the best canner. It will hold 7 quarts jars. 10 regular mouth pints jars. I currently today have 20 pints of pork canning (i have an additional metal plate like the one that goes on the bottom ) 10 pints on the bottom and 10 on the top rack. You can not double stack quarts. This is the best canner I have owned!!",
        "I have no problem with the pressure cooker, in fact I like it. BUT..it is for 23 quarts, and I only got one tray. So really it’s only for 7 quarts unless I want to spend another $10.66 for a second tray. Very unhappy!",
        "I find this canner very easy to use, and beginner-friendly. For people who are just starting out with pressure canning (like myself) the instructions are extremely easy to follow. This is fool proof as long as you read the instructions carefully and follow them to the letter. Also, it is important to note, you can use this canner on a glass top range. Certain other brands (not sure I'm allowed to name them here) are too heavy and cannot be safely used on glass, but this one can. I have found the price on this fluctuates significantly, so it is worth watching for a while until a good sale comes up.",
        "I'm soooo glad I bought this canner. I have been canning a lot because of the corona virus scare. Who knows how long we will be isolated and have limitations on our food. It's the perfect way to prepare food for when you need it in a hurry. Just open up a jar and heat it up. I have been preparing meats: beef meatballs in marinara, lamb meatballs with potato halves, chicken thighs both on the bone and deboned, and tomato sauce. And I continue. Love this canner. Highly recommended.",
        "I can salmon, venison and chicken, all up to about 18 pints (18 pounds) and this is the same amount of work as a smaller pressure cooker would be. theoretically holds 20 pints (basically 20#'s) but i find that 9 pints per layer works best, but you can fit a full 20 pints in, they are just a little tight. You need to buy, or in my case i made a plate from a piece of aluminum to double stack the to get the full amount. I \"cold pack\" which is raw meat then pressure cooked, super easy and great tasting. this is the right size as for the time involved for the typical 10+ pints i process.",
        "After using this product for a couple of years the bottom of the pot warped. Since I have moved and have an electric stove now the pressure cooker doesn't heat properly and is burning the bottom of the pot.",
        "Exactly what we were looking for. Originally we wanted an electric pressure canner but this has been a great purchase and I have no regrets. It holds 23 jars with room to spare and seals tightly. There was never a moment I was concerned using it in my small apartment. It stayed sturdily placed on the back burner, which is incredibly important in a tiny living space with a tiny 3 yr old child. All of my canned goods were sealed perfectly and are turning out amazing.",
        "I bought this for my wife as she wanted to start canning after a very successful year in the garden. We've never used a pressure canner before, but the instructions were excellent and easy to follow. Important to note this things is HUGE. i knew 23qt was big, but didn't think this big. WIll be great to just use as a stock pot too for making a giant batch of my chili, but fit 5 quart jars covered in water to can with ease. WOuld i buy again? In a heartbeat.",
        "I researched pressure canners for weeks before deciding to purchase this one. It's big enough but not too big and I can use it on my glass cook top (I checked with the range mfg). I use it several times a week for small batches as they are easier for me to manage. One of the other reasons for selecting this unit was that I could water-bath can in it as well. If you're nervous about pressure canning, this is a nice little canner. There are a number of great YouTube videos on \"how to\" can and these really helped make the process less intimidating.",
        "We used to can then stopped. We erroraneously gave away the earlier version of this one and regret it. Hence, we purchased this one to replace it. It is heavy, seems durable and strong enough to do its job. It looks exaclty like the earlier one, though not as heavy metal as the other. Will update our review when we actually do use it.",
        "Made in China. Seems well built though. Haven't heated it up yet. Have washed it and getting ready to use. Gasket seems well made, good solid bottom and top. will open easily and has a lock to prevent opening under pressure. Don't forget to get some of the canning tools you will need. I bought a 6 piece tool kit from Readitools. Has magnetic lid lifter, jar lifter tongs, WIDE opening funnel if you plan to can any meats, and a couple other extras. I think this will last a LONG time. Gaskets for pressure gauge, over pressure relief valve and main lid gaskets look like main areas of maintenance. Maybe a new gauge at some time.",
        "Great value for the price! This was my first canning experience and I successfully canned 14 quarts of peaches using boiling water method and canned 12 pints of green beans using pressure canning method with no problems. Works perfectly. I did purchase the three piece Presto Pressure Canner Pressure Regulator as suggested by other reviewers for ease of use. This is a must-have for any low-acid food storage!",
        "This item was opened a week ago.. this pressure cooker never held pressure. Water came out from top. Pressure knob melted in the second day of use. Unfortunately bought to keep it on stand by and missed return date through amazon. Very unhappy customer",
        "After only 2 uses, the part that says “top” leaks pressure and the cooker no longer holds anything over 10 psi.",
        "Had this just under 1 year and noticed the other day when I took it out to start canning beans that it had holes worn through the bottom and these are like defect holes in the metal! This is ridiculous! I'm very sad because reviews were great on this just be aware that this may be one time thing but it could happen so I would get the protection next time :(",
        "First canner, it was easy to use. Suggest you buy the after market regulator 5-10-15 weights that screw together, otherwise pull up a chair to the range to keep an eye on the psi (turn it up, turn; it down, up, down). Not that you can completely forget about anything on a range, but there is a comfort in hearing the gentle rock and that the psi won't go over 10.",
        "Learning how to use the pressure canner was really simple thanks to the enclosed how to manual. Manual also included easy to follow recipes that allowed me to play around with the canner and learn the ins and outs of what needs to be done to properly preserve food. Being a new canner I really appreciate all the safety features that are included in this model. If you can get your hands on one I would highly recommend this brand as a great canner for beginners, as well as those with more experience.",
        "Plastic cover on the pressure gauge melted after one single day of canning and deformed enough to pop off of the unit.",
        "Wow....I saved and saved and saved to be able to order this canner so that I'd be committed to learning this essential pantry-building skill. (Pressure Canning.) It really made me appreciate the gravity of proper preparation and use of a pressure canner for pantry food storage. I have been so pleased with this canner and the ease-of-use of it! I love that the optional replacement pieces for it are so easily purchased, it really makes this a worthwhile long-term investment. Be sure to purchase the optional second-tier rack...you will be so glad!",
        "This has saved me more than the cost of the canner. I’ve done stock 4 times, chicken 3 times, corn and beef stew. What I save over commercial stuff isn’t just money. It’s so much healthier. I have removed all the sodium, chemicals, artificial flavors and colors from my diet. Health conscience, this is a must.",
        "My mom was afraid of pressure canning so I hadn't learned how. A neighbor set my mind at ease and I bought this canner so I could can beets and beans. I thought I would alternate between water bath canning and pressure canning but I like this canner so much I use it for pretty much everything. I'm glad I got the larger size so I can process 14 pints at a time. The salsa recipe included in the instruction book is really good.",
        "I never used a pressure canner before this. I stuck to canning things that had a higher acid content. I have been reading about canning meats and stews in addition to low-acid vegetables, and I am excited to give it a try. The pressure canner as well built and sturdy. It's too bad that it's made of aluminum because it discolors inside as soon as you boil water in it. That being said, I suspect the stainless steel version would cost just less than the space shuttle. My first batch of pressure canned peppers came out very nicely. I give this pressure cooker top rating.",
        "This is a nice, sturdy canner. It's easy to figure out and use. I gave a ceramic top electric stove, so there was a bit of a learning curve on how to regulate the burners without having the pressure remain too high or too low. I did figure it out, but having a gas stove would be much easier. But that is neither here nor there on how the canner performs. I canned quite a few vegetables and spaghetti sauce, etc., this past summer, and I was pleased with the results. It's easy to clean and maintain as well.",
        "Ordered several months ago and just now using for first time and I love, Holds a lot of jars and operates very quietly. Have a smaller version of the Presto pressure canner but it only hod 5 jars, requiring several batches if i am putting up a lot. My smaller presto is also very noisy, hissing sputtering and jiggling the entire time. Will cont to use both but wish I had purchase the larger presto much sooner'!!",
        "My first canner and I really like it. It's easy to use, disassemble and store away. I have had the inside of the pot change colors, not sure if this due to the hard water where I live. I find the locking mechanism can be a tricky/scary when doing pressure canning just because it is so tight. Definitely would recommend as a basic beginner pressure canner. I even use as a water bath canner but not locking the lid.",
        "I've been canning for over 30 years and have found this canner a pleasure to use. It's relatively quiet as canners go, and I find it easy to regulate the pressure. It's well made and the best canner for the price. We're planning to purchase another very soon.",
        "So far I’m loving this pressure canner/cooker! I bought it for canning and I‘ve only used it a handful of times but I’m already so pleased with the purchase. I was hesitant because of the size (but needed the height for water bath canning quart jars) and although it is a little cumbersome it’s not as heavy as I expected it to be. Simple to use too.",
        "Obviously I don't use this item very frequemtly. However. the gauge on the lid is already defective! There seems to be a small screw sticking out at the zero symbol on the gauge, which prevents the arrow from moving past the zero. I don't know how this happened.or how to remedy the problem! Any ideas?",
        "Ok, for real, I was so afraid this thing would blow up my house. I am new to canning and you hear all the horror stories. Needless to say it works great. I did have to google a YouTube video though because the instructions weren't real clear. Once I saw the video I felt so much better about the whole thing and my canned chili was delicious!",
        "Found out gauge was broken as I tried to can for the first time. Complete waste.",
        "We've canned lots of food with this and it worked great. We've canned beef brisket, turkey and chicken broth, and vegetables in it, and it has been great. I recommend getting the adjustable pressure regulator, so you can use it at 5, 10, or 15 psi. Every time the gauge pressure matches the pressure when the regulator starts rocking. The canner feels very solid, and I like the fact that the lid locks securely whenever there is pressure inside, so you can't open it when there is still steam. I also like the fact that it includes a recipe book with times and pressures for lots of common foods.",
        "I like the weight over the expensive old fashion ones. Not that you move it, but getting it on the stove and putting it away is easier. Does the job.",
        "I have really enjoyed my Presto canner. With how large it is, I can often get my canning done in 1-2 rounds. Really like the slight notches on the interior to indicate how much water to add. My one issue that I have is the pressure seal valve which often needs a little extra coaxing to pop up so that it’ll start building pressure. Water also pools around that valve and needs to soaked up. Would highly suggest getting the pressure regulator weight that allows you to adjust the pounds of pressure in increments of 5.",
        "We had two of these before for canning our tunafish. We can other items as well but this is a big event where we have multiple burners and multiple canners going at the same time. We own four of these now and they hold up really well and are completely safe. I get a seal every time! Excellent product",
        "I can't get it to 15psi. Only 5psi. Not sure if it's broken or...? I followed diearctions and watched videos thinking I was doing something wrong.. I dunno. I can't use it.",
        "I made 3 gallons of chicken stock and soup base the first weekend I had it. For what I paid I'm very happy with it. Pointers? Make sure you read the manual. Chicken stop fir example is 11 lbs or higher so get familiar with the manual.",
        "I think it was over-priced when we bought it, but it was the only one we could find in the midst of the canning season. Heavy duty, excellent quality, should last us for years!",
        "I have used this several times since purchase. I mostly use for making beef or chicken stock. Since I hadn't used a canner in a very long time took me a few times to understand the heating up but once I got the handle on that the pressure canner is great. Would recommend to anyone wanting to make their own canned good. What else is great is when you use pint jars you can double stack them. I have used this feature a few times and it works great.",
        "This is the easiest pressure cooker I have ever owned! No excuses on why you can't be canning! Super Safe..and super easy to operate. I don't know what I was so afraid of before!",
        "so far so good, i almost want to take a point off for the bottom rack i was expecting the one with the side handles, i have to go back and check description and image, i am pretty sure the image showed it on the options i got. but it works as expected. it is very tricky keeping it at an exact pressure reading though. the weights are probably much easier, but this is QUIET, ,which i love.",
        "Pot warped after 1 use, completely unusable now DONT BUY. Spend the money on a good one. Will remove review if Amazon refunds me or sends a new one",
        "These cookers just are what they are. For the money and what you are able to do with them, they are hard to beat. I prefer other than a twist lock, but this unit works just fine, is light enough to move around easily when needed, and is indispensable for the job it is intended to do. If you need a good budget unit it is hard to beat this one.",
        "I use a glass-top range and found it extremely difficult to bring water to temp. in fact- without the lid secured, could not even boil water. that may be by design, so if you desire to use as a boiling canner- you might think twice. BTW- glass range surface was spotless. I resisted the urge to move outside to the propane fired cooker- I'm sure I'd have found the BTUs to boil water, but instructions explicitly say not to do this. Overall construction and safety features work fine and I was able to process tomatoes with ease, just took much longer than expected.",
        "Easy to use, good construction. Canned peppers, squash, beets so far. Going to can chicken and beef soon. Watch pressure guage closely, pressure rises gradually but you need to turn heat down the longer it's operating. I like it because I can adjust pressure for my altitude.",
        "I'm a first time canner. I've used this twice with no problems. The directions are clear and it's easy to use. All my jars sealed. There were no explosions so I'm happy with it.",
        "Bought this about two months ago. Canning some beets for the first tome today and discover the pressure gauge doesn’t work. Not happy that I will have to guess the pressure and cook time.",
        "I bought this Canning Pressure Cooker for my husband A while ago he is the canning man 😂 wow he loves using it! no doubts and their customer service is awesome!. Recommending to anyone we love it!. Recently we bought a book about canning with pressure cooker.",
        "The trial run was very hard and didn't turn out, couldn't keep the psi regulated with the given weight. I'm glad I bought the -Presto 50332 Canner Pressure Regulator-. The second time was perfect. I need 11 lb psi and the 10 lb psi weight held fast. This regulator comes in 3 pieces 5 lb, 10 lb with 1 ring added and 15 lb with 2 rings. Wish Presto would include the 50332 with the canner. I gave it a 5 star because it wasn't the canner it is my lack of experience canning.",
        "This canner did fantastic!, got the job done. We have a glass top stove and no problems but you can't slide this on it, you have to pick it up to move it, learned that from my neighbor!. The weight that comes with it is a 15 lb weight, so I had to order one from the company if you want a 10lb, real nice people. Would I recommend...yes I would",
        "It was everything and more then I expected. ..because it's quiet nature ..while canning.. recently installed lp gas stove... with the pressure gage... im.able to can with precision. ..and double stack pints..if I want...the extra capacity is a bonus...",
        "I too believed the lid did not close when I opened the box and examined the contents and tried to close the lid. But you must line up the V on the lid with the V on the handle to get a good seal for the pot. I did. As for the canning, (I can only give the pot four stars for now) I have not used the pot yet and it is my first time canning, although I have watched relatives (a long time ago). I have nothing to say about the pot's value in terms of the canning process for now. I will watch a lot of Youtube and alike to refresh my memory.",
        "This canner has worked as well as it's reputation led me to believe it would. Amazing food (first time trying to cook with a pressure cooker) and the real reason we got it, to can food. Great capacity, but generally too large for our glass cook top. That is why we bought a gas burner which has worked well with this on low heat.",
        "As a small farmer, we can our own home grown foods and others. The size of Canner is awesome. We were able to increase our quantity per set and with ease. The locking lead is very user friendly. We have really put it to the test with over 100 canned jars of many varieties. It working out much better than I had anticipated.",
        "I spent a whole summer canning with this, now I only used water bath canning so I have no experience with pressure canning but it's great that I can use it either way. It fits a good amount of cans. But I do suggest something that you can pick up the cans with when you get them out of the water to make it easier. Over all a fantastic buy.",
        "Easy to use and clean. I did have to replace the o ring around the pressure gauge pretty quickly which they do not sell as it’s own part. I had to get a different type of gasket but it’s fine. Really easy to use and keep clean. I use this like once a week now and it hasn’t let me down at all",
        "I used the pressure cooker and the dial gauge did not work. the dial gauge is unnecessary just a second safety feature as long as you have the proper weights. I called the presto company for a replacement dial gauge but since my purchase was less than 30 days I was referred to Amazon as per their policies. spoke to customer service and the only options I was given was return product or replace. the pressure cooker worked fine the dial gauge didn't. all I need is a gauge not a whole new unit. how much $ would be wasted in shipping?",
        "Its not a toy, a person needs to pay attention while using by following the directions",
        "I love this thing. Been using it for about 6 months, a couple times a month. It works perfectly, and all the replaceable parts seem to be lasting well. Read the whole manual w/ it, and take care of it right and it will do you great. Never use a pressure cooker without reading the manual. First pressure cooker that has worked for me and it is easy to use. 5/5 would buy forever if poor",
        "good product for the price. Not sure why but if I was canning hundreds of jars, may consider the more expensive one, but not dissapointed in this one. I just like the heavy duty USA product. ....but I am keeping this one for sure",
        "Works great. I just sort of wish it wold have a larger diameter base so I could use my larger diameter electric burner. I want to also be able to use this for a boiling bot, but I cannot get enough heat with the smaller burner and the small diameter on the bottom of the canner. It is probably not an issue on gas ranges.",
        "What I do not like is the customer service from Presto. They were extremely unhelpful and vague in answering questions. I was unable to get them to even give me replacement part numbers. My pressure relief valve blew, although the gauge said I was at 13lbs pressure. The regulator did not start rocking and that starts at 15lbs. So, I needed a part number for the relief valve. I don't believe it was over pressured, I think the overpressure valve just needed to be replaced. I will never purchase another Presto product again. I have now purchased an All American Pressure Canner. The person who helped me was Kresly.",
        "Really solid product. Like most people I was hesitant to buy a pressure cooker having never used one before. The manual is very thorough, and I've had no issues whatsoever using it so far. Incredibly sturdy from what I can see.",
        "I was a little worried that it would damage my stove but it worked as it should. I used the method that would be the least processing time. I did get a little scratch on the burner when I turned it for the gauge to be in a different position. I learned to set the pot straight down and pick it up for any repositioning. I'm happy to be able to can and still have my glass cooktop.",
        "First time I used it yesterday and instructions were complete and easy to understand. Everything worked perfect. And yes, you can't just \"wing it\" when you open the box. You must read the directions and follow them. No complaints from me.",
        "I'm so happy I finally treated myself to this canner. Works exactly as it should. One thing to keep in mind if you're new to canning is the height of the 23 qt. canner. With my over the range microwave, if the canner was any taller I couldn't have used it on my stove top. Works great for me but just want others to be aware.",
        "Working out great on my glass top stove. Have used several times already. Well worth the money.",
        "Do not buy this. Does not come with pressure gage and won't allow returns. I will dispute with my credit card company",
        "I have been canning salsa and chili base with this pressure cooker for the entire tomato season this year with this cooker. In the neighborhood of 8 - 10 large batches. This cooker has worked flawlessly. Great purchase. I am glad I purchased the larger size because I have done 2 layers of pints with it numerous times and it's a real time saver.",
        "I know there are some PC's that are built to last (AA), but this one does the job just fine. I don't think it would last a life time, and if you do you use it a lot, you'll need to replace the gasket, but overall..... this is a damn fine Pressure Cooker.",
        "Product is wonderful and I really love it, but just a fair warning to those reading reviews to buy: do not choose the option where you spend $10 on the canning rack. I did and low and behold, there was already one included with the canner. Granted Amazon refunded immediately which was nice, but if you wanna save yourself the trouble... excellent product otherwise.",
        "I received my Presto 23 quart pressure canners last Saturday and I love this item. I have used it (3) times since I received it and it has worked just as it was described it would. One of the features it has that I especially like is the gauge that I can keep up with the pressure numbers and not guess at it. I would recommend this to anyone looking for a pressure canner for their gardens produce.",
        "Pressure cooker has a rubber ring on it, as opposed to the more expensive models which do not have a seam ring. The ring will probably wear out over time, depending on use. However i looked it up and the rings are pretty cheap to replace. For using the canner a few times a year, this model would be good. If you are going to do canning more frequently, maybe invest the money and get the expensive models that don't have a seal ring.",
        "I had never used a pressure cooker for canning before, mainly because I was scared of them. But I kept reading that the water bath method, which I have always done, was not as safe as we thought. Have canned green beans with it so far and they are delicious. We just take them out of the jar and microwave them. Also, looking forward to canning tomatoes with it. These are my main 2 items to can. Love this pressure cooker and would highly recommend it. Just follow instructions.",
        "You can fit a lot in the canner and when I’m not canning I can cook an entire meal in it in under an hour. I’d recommend it over an instapot because of its size, cost and the fact that you can pressure can in it",
        "....and this thing worked exactly as advertised. When I first got it, the lid didn't seem to fit super good. One of the notches was catching just a little bit that wouldn't allow the lid to open or close smoothly. I hit it lightly with a file to knock down a small burr and viola! AS ADVERTISED! I'm extremely happy with it, and it looks like I should get a lot of use out of this in the future. Very good product!!!!!",
        "The lid was a little hard to get on the first time as i did not know how it fit on exactly, i figured it out tho, the only issue i have is that the lid can fit on 2 ways, and one of the 2 ways leads to the lock feature not engaging, making this a safety risk, i did not notice this the first time and had the lid on the wrong way which could have been bad. Also, let this thing cool down enough after using it, i was impatient and hot steam came out when i opened the lid, not hot enough to burn me, but still hot enough to give me a shock.",
        "I love the results I get with this canner...but - on the very first use, steam entered the pressure gauge, steamed the glass so as to almost unreadable while processing, and became trapped. This result in the screws rusting on the pressure gauge.",
        "Works great on my glasstop stove. Only thing I noticed is it will scratch the top if you slide it so be careful. After I learned what psi I needed and how much water to put in it, it works fantastic.",
        "I haven't had this a whole year and ive only used it a few times to pressure cook 7 quart jars at 15 psi and the bottoms bent out and the pressure isnt building up. I need to Know why this happened and if i can return this for a replacement?",
        "Love it. Use it all the time as an homage to my great grandmother that canned her garden every year. Thanks for allowing me to carry on her legacy. Works great on glass cooktops.",
        "I received this and the first time I used it condensation filled the pressure gauge and I couldn’t read it to ensure my food would be safe. Then when I tried to return it, I was one day late in trying to return this defective product. I only had 30 days to return and if you purchase this, the product works well but inspect the washers and seals very carefully before the 30 days are up.",
        "So I ordered this for my mom as a gift and it was so huge she wanted to return it. It looked very sturdy to me though. I liked the quality, but honestly it was way too big for us to use.",
        "This product will scratch a ceramic stove top. Used it once and now my top is really scratched up. They should warn the user about this before they waste their money. Another thing is that the washer for the pressure gauge is cheap. It broke and there is no washer for the gap. Maybe would be good for a gas. :(",
        "I am a beginner canner and may i just say I LOVE THIS PRESTO CANNER!! Very easy to use and it comes with a simple very easy to read manual. I search the internet for recipes and watch tons and tons of YOUTUBE videos for recipes. I tweek them to my liking and well i just can't stop canning Now. The Best Christmas Present :)",
        "Warped after only using a few times in 8 months. No refund. Unhappy. No more Presto for me.",
        "This canner works great for canning-I don’t cook in it BUT the 15# only weight makes pressure canning tedious as you have to constantly monitor and fiddle with the burner. I purchased the adjustable jiggles here on Amazon and now am very happy.",
        "This is the second one I bought. Can't find the first one. My daughter came and cleaned my house when I was sick, I might find it someday! It works great and need it for canning.",
        "I am very sad about the way this product has worked. I have a glass top stove which isn't leaving many options and I have not been able to find one of these that doesn't arrive damaged even though the box is perfectly intact. I've tried twice so far consists only friend that is able to be used on a glass top stove I met before asset attempted against third or fourth time until I get one that is it broken on arrival.",
        "Very nice pressure cooker for the price. Holds up to 10 quarts jars. I feel very safe using this cooker. Easily assembly and always locks when building any pressure. Would buy again.",
        "Takes forever to reach pressures needed. Can't achieve a good boil on the electric stove because the pot is too big, so I can't use it for hot water canning (only pressure canning/cooking). Says not to use on a propane burner, so I don't, but it's annoying.",
        "This product is very sturdy, easy to use and clean, and takes the place of my smaller boiling canner, stock pot, and steamer. Price wasn't really a deterrent in my decision but this has to be the best deal for the price. If you are looking for a simplistic, no frills, pressure canner/cooker then you would be remiss not to strongly consider this product.",
        "This is so much faster than my little canner and easy to use. Buy it and save time. Happy Canning.",
        "Don’t need an All American for my infrequent use. Used it about three times for 90 minute cycles and hasn’t warped. The dial seemed slightly uncalibrated but it’s nit like you need it.",
        "I would reccommend this pressure cooker to anybody wanting to can large amounts of food. If you are using the pint jars, and want to use it to full capacity, you will need to purchase an additional rack to stack the jars on top of each other. I think that rack should have come with it. One thing I was disappointed about is that I cannot use it on my propane burner (aka turkey or fish fryer). So I pulled out the old Coleman camping stove! The gauge was not reading accurately, and Presto promptly replaced it with a new one at no charge and prepaid the shipping to return the other one. NICE!"
    ]
}