{
    "entity": "Pressure Cookers",
    "text": [
        "Bought one for myself in a lightning deal and waited more than a year for another \"good deal\" to get one for my daughter. Hope I don't have to wait another year to get one for my daughter in law! I did a lot of internet research before purchasing and this one was highly recommended. I use if regularly and LOVE it. For me, it is far superior to the Instant Pot for the type of cooking that I do. I even use it on my (wood) cookstove!",
        "Very easy to use with several good features. Did not want one made in China because I wanted better quality stainless steel and better quality of the other components. Very happy with this unit.",
        "This has quickly become one of my favorite kitchen tools. It is super easy to use. I am used to pressure cooker canning. I'm shocked at how quickly it cools off.",
        "I ordered this cooker 3 months ago for my mother and I even tried it a lot pros 1- easy to use from the first time 2- short time in cooking 3- durable with fine steel material 4- quite and soft sound when cooking 5- practical for ones with no time for cooking 6- excellent in cleaning after use 7- highly safety measures .... so safe for old ones cons none till now ..............and I even planing to buy another one",
        "I've been using this pressure cooker at least once a week since I bought it a few months ago. Love it! Easy to clean and simple to use.",
        "I am very impressed with this pressure cooker. I have 2 big canning pressure cookers that I use for canning, but this is the first one for cooking regular meals. It reaches pressure quickly, and the pressure releases quickly when through cooking. The beets are the greatest ever, as the beet flavor is more intense compared to boiling in water. Have cooked chicken and pot roast so far and both came out well.",
        "2nd Kuhn Rikon after my last one after 20 years wore out....rocks!",
        "This cooker makes everything so easy! Once the pressure comes up, there's no rattling of the pressure gauge and things get done in time they're supposed to. I've been using mine for over eight or nine years and don't think any other pressure cooker can beat it. GloriaG",
        "I did the product review on this item and am happy with the product. It cooks like it indicates and much quicker with a better flavor.",
        "I bought this as a replacement for one stolen from me by an ex. Same quality and good results as the original one that was lost.",
        "You can't go wrong with a Swiss product. Quality, simplicity, price, everything right. Easy and simple to use. Good product.",
        "It's a safe and easy way to shorten cooking times and save money. A pressure is no place to cut corners... buy the best.",
        "I intend to use this cooker quite often this winter, I have only cooked one thing in it. The instructions are very thorough and easy to follow. The cooker made an easy and fast meal.",
        "This is an excellent pressure cooker. This is my second one, replacing one lost in a fire.",
        "Easy to clean, very durable, sleek design looks like something from a martian future. Also you can tell how well engineered it is because when the pot builds pressure you can lower the flame to near none and it still keeps consistent psi,",
        "I have found this pressure cooker easy to use, clean, and quiet to operate. Excellent quality steel makes it easy to clean. Good for beginners as you cannot open it when under pressure, even accidently.",
        "very easy to use and clean. Cooks foods very fast. Large beets in 10 min and large artichokes in 15",
        "Love, love, love this pressure cooker! Look at the old Jacques Pepin videos on netflix and you will see him using this, and deliciously so. Happy cooking!",
        "This is the best kitchen appliance that I have purchased in a very long time. The Kuhn Rikon pressure cooker is quality through and through.",
        "I've always been afraid of pressure cookers. But I decided to try this product because of it's safety features. I love it! And I'm fascinated by the variety of foods (i.e. cheesecakes) that turn out beautifully. So far, it works exactly the way it was advertised. I have purchased two different sizes now so I can use more than one for a meal.",
        "Excellent product - especially for a beginner, like me. Started cooking right away, first day, for the whole family, with great (and tasty) success. Would highly recommend!",
        "Is kind of to mmodern to me, but you know what, is faster and not to difficult to use, I super recomended, it was a gift for my boyfriend ho likes to cook a lot, so, I hope its usefull! And also the size, I think it was to big, butttt!!! you never know if you need to cook for a big visit, or party, the material is great to clean, so dont think a lot, and if you really needed, you will not regret",
        "I think this is going to become a kitchen favorite. Money well spent!",
        "I haven't cooked with this presure cooker yet, but I found know it's a really good one",
        "I can't deny that it's a good quality product but I regret purchasing such a small canner for so much money. It holds so few jars that it's not worth my time to can any goods. It is only good for pressure cooking a roast for dinner.",
        "Seal was missing. A waste of time as it was not useable.",
        "Very dangerous. Bottom two layers of pot bottom separated and melted aluminium flowed behind the pot out of my site As always I watched the whole time. The pressure gauge didn't move Fortunately I had cooked three other times in this pot. Removed it to a cool burner. Now pot and stove element unusable. CAUTION unusable War aunt my denied",
        "the only inconvenient thing with this item was the nonexistence of an automatic release of the steam , you have to press and wait until the steam is done so you can open it. other than that it was goo. ,,,,,,,,,,,,, Update ==== very desapointed, after only 5 months and only very few times of use the black plastic ring on the top broke , I will try to get in touch with customer service in order to get a replacement of the part , if they answer me I will right away new review",
        "This is my first pressure cooker and I am VERY HAPPY with it. Everything I've cooked so far has turned out wonderful. It is quiet and easy to control the temperature to achieve the 15lbs of pressure. I really like cooking things so much faster than normal and the meat is fully cooked all the way through. It is also easy to clean. I'm sure that I will continue to use this pressure cooker all the time.",
        "King of all Pressure Cookers! Have had it for over a year and I love it! Expensive for a worthy investment! Keep the gasket cleaned each time as that is my only observation...it can be touchy with it's wonderful safety features.",
        "Not your grandma’s pressure cooker! You’ll be glad to have it.",
        "Obviously, I am no expert on pressure cookers, but this has got to be the easiest way of cooking I have ever used. The Kuhn Rikon construction is solid and durable. The operation is very simple and the valve construction allows for easy quick release. I am completely sold on using this cooker. I have made complete, tasty, hardy soups/chilis from scratch to the dinner table in less than 30 minutes. And with the flavor of a soup/chili that has been simmered for hours. I cook without oils and minimal salt and I find that the foods I make are still very tasty and extremely satisfying.",
        "If you make your own soup stock this little number will help you make it faster with less electricity/fuel. No rattling tumbler and the unique spring valve (be careful with other brands' spring valves; they vent regardless) locking in the essential oils of your ingredients for a more enjoyable stew. High quality construction that will surely last a lifetime. This is not a purchase but an investment.",
        "This is an awesome pot. Anal engineering person here. No complaints. Fit and finish is superb. Ease of use is great. Seems to be even heating and quality of stainless is great.",
        "For cooking and cooking in a third of the time.",
        "I bought this pressure cooker because Miss Vickie recommended it. This brand is one of the two top brands. I can say, it was worth the money spent. We've made quite a few batches of beans in this cooker, and it's terrific. Highly recommend if you need a simple pressure cooker for regular daily needs. Perfect size for a family of four.",
        "I've never used a pressure cooker before. I decided to try it because I've heard good things about it, and as a working mother of 2, sometimes it's hard for me to plan ahead to use the crockpot. This pressure cooker was easy to use and big enough to feed my family. I've cooked stews, pork roast, whole chicken, and roast beef so far, all with great results. I will use this product at least every week. It is worth the investment to buy a good quality.",
        "I love this pressure pot. Next time I will buy a Fissler, because it reaches a slightly higher pressure. But I have no complaints about this cooker. It is one of the best kitchen purchases I've made.",
        "Very happy with product. Easy to use and clean. Everything comes apart so you can completely clean it. Great size for a small family.",
        "This is a great tool although I think I got one a couple of sizes to big. Still works wonderful though. Mostly I cook vegetables but have done a whole 6lb chicken in 40 minutes, chicken breast, corn on the cob and beans and beans and beans fresh from the garden.. DEVINE!",
        "I have two other sizes and I love cooking with the Kuhn Rikon",
        "The Kuhn Rikon is an excellent pressure cooker that works without guesswork or mess. This one works so well that I want a smaller one that I'll use all the time. The safety features and the precision pressure valve show off Swiss precision! If you're thinking about buying a Kuhn Rikon, you have to treat yourself, the craftmanship and ease of use will impress.",
        "I wish I had bought this pressure cooker years ago. I had used Presto for a very long time until now. This product is very quiet. The two times that I have used it have turned out wonderful meals.",
        "this is my first pressure cooker and I'm still figuring out all of the benefits. Thus far it has been working really well.",
        "I am very pleased with this product. It is well engineered and cooks perfectly. My only complaint is that hand cleaning the lid can be a little difficult. But I'm not sure if there is a better \"dishwasher safe\" way to design the lid. So, I can't really hold this against them. I highly recommend this pressure cooker.",
        "I had never used a pressure cooker before - was afraid of them. This pressure cooker is so easy to use and I'm not afraid of using it. Throw everything in and it pretty much takes care of itself.",
        "If you don't have time to cook, it is your best friend/helper to make a meal less than 30 minutes.",
        "This is a useful piece of kitchen tool that can save cooking time. It is very quiet when cooking. I like it.",
        "This looks acceptable and functions well based on my initial uses. It's thin material and does not necessary look like it will last a lifetime. Who knows. Good job though."
    ]
}