{
    "entity": "Ice Cream Scoops",
    "text": [
        "Had this ice cream scooper for just over a month and always hand washed it, hand dried it, etc. as I do with more delicate dishes. The scooper became very pitted (small holes all over it) and basically fell apart in tiny chips, making it unusable. After reading more about this scooper on other websites, it seems that this is a known problem! This scooper is a waste of money. Avoid the Zeroll scooper. To replace it, I recently purchased the OXO Good Grips Solid Stainless Steel Ice Cream Scoop and it is a much better product!",
        "The two on the left I got them from Amazon, sell by Amazon too. On the right, the bigger scooper, I got it from other store. Clearly, there are some kind of weird coating builds up on the left. Also, it doesn’t say ZEROLLS on the handle.",
        "This worked great, but then it turned a dull dark grey and the grey came off on to the ice cream. I checked with family members told therm not to put in dishwasher, I don't think it did, but can't explain what happened. Is there anyway to clean it? It is unusable the way it is now.",
        "Used one of these at a friends house, liked it so much, came home and ordered one that night. Warm it up in my hand before using, ice cream scoops right out. The instructions say it's not dishwwasher safe, so I immediately rinse it off with hot water and dry it with a towel. Edit - December 7, 2017. I took a pic of this scoop today (it's been two years, since I've purchased it). Pretty much looks as good as the day I bought it and believe me, it has been through some serious use. If this review was helpful, please click 'Helpful' below (lets me know that I'm not wasting my time, by doing these). Thank you!",
        "This is a great ice cream scoop. It’s expensive and honestly I don’t know that it’s worth it given how much ice cream we consume (not much), but my husband had been talking about having a scoop like this for years so I got it for him this past Christmas. He is very happy, and I don’t regret purchasing it because it is indeed a very high quality ice cream scoop. If you eat ice cream a lot or have pain/weakness in your wrists, this is an excellent choice. Or if you just really appreciate a smooth easy scoop and a well made kitchen tool.",
        "The liquid started leaking out about a month after I bought it. Now it's just a 'regular' ice cream scoop without the heat conductive fluid inside the handle.",
        "This thing sucks. The liquid in the handle leaked out when it was sitting in the drawer (after being hand washed). I assume these were made sturdier back in the day, but now they just suck. Save your money and buy a simple aluminum ice cream scoop or spade, heat it before scooping by running under warm or hot water, and you’re golden just like Ponyboy Curtis.",
        "OMG, how did we ever have ice cream without this scooper, I absolutely love this scooper. Once in a while you come across a kitchen gadget that you know you will love for years to come and this was definitely one!! Zeroll has made this scooper very easy to handle, the ice cream just rolls into it and slides off of it in the bowls. The feel of it is just right and the material is sturdy. I honestly recommend this to any ice cream lover out there, look no more as this is definitely the best scooper yet!!🍨",
        "I ruined mine with my dishwasher and now I really want another one when it goes on sale again. Wink Wink amazon, wink wink. The grey residue people have mentioned in other reviews is from the dishwasher. I know this because I ran this through the dishwasher and suddenly had the same issue. :(",
        "Metal finish is very poor. When washing, the material gets nasty and starts shedding metal in the water. Once 'clean' and dry, vanilla icream will have a silver hue as the metal erodes into it. I had high hopes previously owning one similar, but this is a cheap knock off.",
        "I’ve had this for 2 months went to use it today and it turned my ice cream GREY!!! Sooooo disgusting I will be throwing it away. And not to mention ruined my ice cream!",
        "You cannot put this scoop in the dishwasher. Doing so causes the surface of the scoop to pick up some sort of gray residue which coats anything it touches, hands, ice cream etc. This really is just not a practical product for a household as it will inevitably end up in the dishwasher which ruins the scoop. I would avoid and just purchase a stainless steel scoop that can handle the dishwasher",
        "When my daughter serves ice cream at her house the scoops are always so perfectly formed so I attempted to order the scoop she uses. First I ordered the blue tipped one, but it was too large to use in pint containers. I exchanged that one for the gold tipped one, which works great. If I ever order another one, I will order the silver model because I think it's smaller size makes it perfect to make butter balls for topping pancakes or cookie dough balls.",
        "It didn't even have the Zeroll imprint on the handle even though it showed in the photo. Other who bought it and tried to use it found it left streaks in the ice cream and they had to throw it away. I knew the minute I open it - it was a a fake.",
        "Hand down, this is the best ice cream scoop in the world. Seriously. I didn't think it was possible to scoop ice cream right when it came out of the freezer but with this scoop it totally is! Just give it a good shake to warm up the magic stuff inside and boom, perfectly scooped ice cream. Just don't put it in the dishwasher. You'll be very sad if you do that. The 2 ounce scoop is perfect for normal sized ice cream scoops. I also use it if I am scooping larger balls of cookie dough. Zeroll scoops are the best! Totally worth the price",
        "This is not a real Zeroll. This is a fake- a knock off which cleverly has a Zeroll insert in with it. There is no name imprinted on the handle and it feels much cheaper than other Zerolls I've used. Very disappointing! Hope someone can report this such that it is no longer an option on Amazon. Mine will be returned and I'll search out a genuine Zeroll as they are amazing!",
        "This product is not what is advertised. I own an ice cream business and have purchased Zeroll scoops before (directly from their website). They are the best scoop on the market. What is advertised here as Zeroll brand is not that. It does not have the Zeroll logo on the handle, and the metal immediately began to deteriorate after two uses. I am concerned that the interior gel is not the non-toxic gel that Zeroll uses. This is extremely concerning. Do not buy.",
        "Received a non-branded scoop in a plain white box. We have a smaller Zeroll scoop that we've been using for years and the item we received is nowhere close to the quality of our current Zeroll scoop. Unless the Zeroll lowered its standards, this is a counterfeit - we will be going through the hassle of returning.",
        "Loved it for first few months however now releases gray on my hands and worse on my ice cream. Always washed it by hand however this occurred after using just about a dozen times.",
        "I've tried many scoops. Bottom line - Get this Zeroll scoop. It has a slightly angled edge that cuts through ice cream and makes perfect sized round scoops. The interior of the scoop that contacts the ice cream is textured in a way that allows you to easily drop the ice cream out of the scoop into the bowl. Rinse it when you're done and leave it to dry. I haven't put it in the dishwasher so I don't know about that, but you never need to. Do yourself a favor if you're searching for a scoop and get this one. Problem sovled.",
        "I had one as long as remembered. Until, someone thought it needed to go in Dishwasher! OMG! Of coarse it CAN NOT ! Also,it only needs rinsing,in luke warm water! Unless of coarse you have some very skicky,syrupy Ice cream. But still, NO DISHWASHER! Just set it down in the sink, till later, if need be. (Till after you finish your Delirious ice cream!) I Highly Recommend getting this You wont be sorry!",
        "Works perfectly. This is the real thing, I have had it for a while now and had zero issues. Hand washbit and you won't have issues. Treat it well and it will last forever. I rince it with water after use and set it aside. Then I hand wash it later whenever I get it it. II HAVE NO IDEA what the other reviewers did to destroy theirs and I'm 99 percent sure the fake was return fraud, not the company. Don't put it in the dishwasher",
        "I was using this horrible purple plastic scoop that is shaped just like this one and I hated it. So I did my research and literally all of the internet states this is the best scooper ever. I was a bit skeptical and not to keen on $20 for a scooper, but let me tell you. This was the best purchase, and it is worth every cent. Do yourself a favor - stop struggling with your cheap scooper and buy this one right now!",
        "Bought this a few months ago. I put this in the dishwasher to wash and it turned BLACK! Some sort of weird oxidation all over it. I never even used it once. Total garbage!",
        "Its FaKE. Box packaging NOT nice at all, the scooper doesnt have the ZEROLL brand. Entirely different from the product description posted on the website",
        "The cutting edge of this ice cream server is so sharp that it actually rate the shavings of plastic off my plastic ice cream containers. There is nothing like shadings of plastic in your homemade ice cream! Not to mention the damage it did to my containers.",
        "The scoop came in a tattered white box and did not have the word Zeroll embossed on the handle. totally different from the picture. Not sure if the product is authentic.",
        "There was no branding on the product itself. I hand washed it once and then later found it had become gray with a thick layer of oxide powder on the entire surface. I threw it recycling.",
        "Best ice cream scoop I have ever owned, and I have several. Solid, one-piece design. Contoured scoop design works even in thick, over-frozen ice cream. Ice cream rarely sticks to the scoop, and can be readily removed when it does. Note that there is an internal fluid that aids in thermal management. This makes for a more effective product at the expense of being handwash only.",
        "Yes, the thing immediately turns into a dull gray color. Look at any ice cream shop in the land and they look the same way. Don't expect this thing to stay shiny and you won't be disappointed. What it does is scoop ice cream. And it does that really well. It feels like you've softened the ice cream, it's so easy to scoop out. I'm sure I eat 25% more ice cream because I no longer dread scooping. This thing rocks.",
        "Used once hand washed and dried next day was tarnished and green and plastic handle cap was discolored",
        "All one piece stainless steel, Closed ended and a full size ice cream scoop. This is not a melon ball scooper! The last one I had like this lasted over 25 years! Divide that by the cost over time, definitely will outlast me. Definitely worth the cost! Enjoy",
        "Works great on cheap ice cream. Also, if u dont have toasty hot hands the conduction does nothing. However, this is better then using a spoon. I tried leaving it in hot water for a couple minuets and it worked for a scoop or two.",
        "This scoop is sturdy and looks like it should last a long time. It's great for portion control, but the only downside is I find my kids trying to get more than 1 scoop so not sure how well that part of it works.",
        "Good price, easy to use and clean. Do Not put in the dishwasher, it will turn black and unusable. After a party, a guest helped with clean up and put it in the dishwasher. I had to buy a new one. Luckily, it is not expensive.",
        "Warning - bought one of these and an ice cream scoop showed up, but was not a Zeroll. I bought the same one from Amazon about five years ago and loved it! Finally had to replace it because of a dishwasher mishap and the one that arrived had no Zeroll branding on it and no identifying marks. Just returned it and opted for the 2.5 oz size instead. Hoping for better results...",
        "I saw this on an episode of Cook's Country and decided to give it a try. I have A Lot of ice cream scoops, but this is truly the best. The show talked about the heat in your hand helping it go through firm ice cream. That might be true, but it is also EXCELLENT simply because the edge is very thin so there is a lot less resistance. I didn't think any scooper would out do the one with 2 pointed front corners, but this one does - by leaps and bounds!",
        "Slices right through the ice cream with no problems. Easy to wash as long as you know to hand wash it. The size was perfect for normal use. I kept going back and forth between which size to get and this seemed to be the most popular. So, the 1020 ended up being the final vote. Works great!",
        "Why oh why did it take me so long to buy one of these? I've broken something like 4 other cheap 2 piece ice cream scoops in my day and finally realized I needed something professional strength. Now I feel content in having a scoop that will perfectly measure scoops for the rest of my ice cream eating life. Just be sure to hand wash and take care of it properly and it will take care of you.",
        "I was so excited to try out this ice cream scoop. The photo is my first use. I was under the impression that I’d be able to get a full scoop without having to let my ice cream sit out and thaw, or put it in the microwave. Unfortunately, even using as directions state, I’m only getting tiny slivers. It is sturdy, so that’s a plus.. but I’m disappointed that I paid $20 for a scoop that doesn’t actually do what it’s supposed to. I still have to let my ice cream sit out in order to get a full scoop.",
        "Works great. Bought due to the great review on thewirecutter.com. If you want to check out their thorough review on ice cream scoopers. The only reason it lost a star is due to the fact you have to hand wash. That isn’t a big deal but I know a lot of people like to just put things in the dishwasher",
        "We had a Zeroll spade that we use for filling bowls with ice cream, but it just wasn't the right tool for scooping ice cream into/onto cones. It has the same great design that allows for easy release and cutting. It's not miraculous, just noticably easier. In order to justify this to myself I compared what I would save if I skipped two ice cream stand trips and instead made perfect beautiful scoops at home. Checkout! The 2 ounce scoop looked just a bit large compared to what I remembered seeing ice cream scooped with as a kid, but the result is near perfect scoops for ice cream cones comparable to our local ice cream stand.",
        "I would not recommend ordering this item as I don’t believe it is an authentic Zeroll. After 1 use the coating has been wearing off onto hands and ice cream.",
        "This ice cream scoop is worthless - why would you make such a scoop that you cannot dishwash. What is this the 1940s. Stay away - one dishwash and you scoop is ruined forever.",
        "This is the greatest ice cream scoop I have ever owned. Every other ice cream scoop is only a temporary piece of garbage. Someone tried to sell me one of these about 15 years ago for 20 bucks and I thought that was ridiculous. We'll I counted and I've spent more than 20 dollars on replacement scoops since then. Glides through like....like a warm scoop through ice cream. Solid construction won't snap in half when you scoop. No arm or lever that tries to scrapes or pushes ice cream out, it uses the heat of your hand to do all that. Easy clean just give it a quick rinse to wash off already melted ice cream and let dry.",
        "The polish or something started coming off. Only used once before. I don’t recommended this product. If it was a darker color ice cream I would have never saw this.",
        "THe ice cream scoop arrived without the embossed aluminum name logo \"ZEROLL\" that is shown in the photo of the product on Amazon listing. I returned the item; otherwise i would have kept the item and probably ordered more.",
        "It's an okey scoop, not particularly better than others. It's vintage, I give that. Fun for vintage people like myself",
        "Works like no other I’ve ever used. Going to buy some as gifts. No more letting ice cream soften up beforehand because this scoop cuts through hard frozen effortlessly.",
        "I have gone through a few ice cream scoopers and this is by far the best. It really works well. I don't use a dishwasher and I dry my knives and this as soon as I wash them. So hopefully this last a long time. The 2oz scoop is smaller than I am used to, but it works anyway. I just make 2 small scoops instead of 1 large one.",
        "left is the one I got from amazon the right is one i bought i store afterwards. The on Amazon sent me worked really badly didn't scoop well at all. The amazon one wasn't as well polished as the one bought at the store. Also it had liquid that made a lot of sloshing noise the real one you can barely hear the conductive liquid.",
        "I had an old Pampered Chef scoop like this one and needed another. Can't find any like these anymore by P.C. So - this one turned up to be the best reviewed replacement I could find both on this site and other industrial kitchenware sites. I've used it daily for a week now and am impressed. I haven't put it in the dishwasher per the instructions and it works like a champ. I'd recommend it to anyone.",
        "The worst aspect of this scoop is waiting to get the scoop slightly warm. I place it in a tall mug with warm water and wait a few minutes. Perfect scoops every time! And, if you prefer thin slivers of ice cream, this scoop delivers!",
        "Mine started leaking about a month after I got it. It leaked all through the drawer it was in. I tried to seal it with clear adhesive, but that didn't work. It still looks brand new, but it's just an over-priced ice cream scoop as far as I am concerned. I would not recommend it to any of my friends.",
        "This scoop glides effortlessly through the hardest ice cream and delivers a perfect sized ball - about two ounces when packed really tight. It feels great in the hand, too - nice grip. I used to be a professional \"scoop\" and scooped thousands of gallons of ice cream over the years. We used these scoops at work, so I bought this one for home use. Perfect!",
        "Kept finding oily stuff on utensils it was in the drawer with. Turns out it was leaking. Very messy. Poor quality. It was always hand washed.",
        "We eat a lot of ice cream. We've been through many scoops. Our latest was the Oxo scoop, which lasted maybe a year. This scoop is by far the best scoop I have ever used. It cuts though solid ice cream with very little effort and appears indestructible. It doesn't look particularly slick or modern, but the other reviewers aren't lying. This thing's great.",
        "I used these as a high school student in Sacramento Ca working at Ferril's Ice Cream. I loved it back then and bought one for myself. I wanted another just to have on on hand. Make sure you only hand wash these though. They have a liquid inside of them that heats up to your body temperature as you hold it and scoop. It makes it so the ice cream comes out of the scooper into the bowl really easily. If you stick them in the dishwasher it gets too hot and then that function won't work any longer. Still a great scooper without that function.",
        "This scoop is great. Hand wash only, though!! I received one for a gift and it got put in dishwasher and ruined. I immediately ordered a new one. It really works great!!",
        "I recommended this scoop to everyone I know. It's a game changer. So easy to scoop and clean.",
        "I am disappointed in this. My neighbor has a pampered chef one with liquid in handle and it scoops SO easily. This one does melt a piece of ice faster than my old plastic one, but does not seem to be any easier to scoop our ice cream. My wrists still get sore from trying to dig so hard. Would not recommend and am hoping to get a refund on this purchase.",
        "Scoops the perfect round scoops for ice cream cones. Ice cream does not stick to the inside",
        "This ice cream scoop is the best one I have ever owned. One solid piece, with something in the handle that warms the scoop just enough to cut throug the hardest ice cream. The edges seem almost sharp. Plus, you can control the size of the ball when it rolls. I love it! Just make sure you wash it by hand and put it away as soon as you're done. Even hard water will leave permanent spots.",
        "This was horribly disappointing! I washed it and when it was wet, it made my hands absolutely black! No matter how much I washed it, it still let off blackish residue. No way I would EVER use this on food! This is definitely not food safe.",
        "This is the quintessential Ice Cream Scoop. It has fluid inside to help keep it from freezing up while scooping the ice cream so the ice cream scoops relatively easily and it releases easily as well.",
        "I use this at home and others reviews were helpful. I wash it in luke warm water and it seems to be holding up well. We've had it now for about month. We only use it about twice a week but it works great for us. It cuts through the hard ice cream much better than our other one without the liquid. I would buy it again.",
        "One solid piece of metal that is easy to clean and will not bend. This will scoop even the hardest ice cream.",
        "This is my favorite scoop. I've purchased three in the last year and this is the one. It's heavy enough to make light work of the scooping and the edge is just sharp enough to really cut through the ice cream. It really makes the scooping process so much easier. I love it when properly designed utensils work.",
        "If you haven't had one of these Zeroll, you don't know what you have been missing. Hands down the best ice cream scooper-yes, you probably think they are all the same but you are wrong. It's difficult to explain so just spend the $12 and use it. This is the 2nd that I have bought as I bought one for my mother in law after seeing her struggle with an oxo scooper. She too thought there wouldn't be much different until she tried the Zeroll I bought her, now she loves it.",
        "Ordered this as a gift. It appears that since it is not stamped with a “do not dish wash” stamp that it was accidentally placed in the dishwasher. Now it will not stop bleeding gray.",
        "Best ice cream scoop EVER! Easily runs through frozen ice cream and makes a perfect ball. I just rinse and dry after use.",
        "Great product, nice and sturdy in the hand. The handle is big enough so you can really get a good grip even when scooping really frozen ice cream. I have actually bent some cheaper ice cream scoops but no chance with this one. Not dishwasher washable because of the antifreeze in the handle but it's easy enough to wash it manually.",
        "I bought 3 of these for serving ice cream at National Night Out. We served 1100 cones in 2 1/2 hours and these scoops worked great! They cut into the ice cream and released it quickly and thoroughly.",
        "I love this scoop more than a person should love an ice cream scoop. So much better than every other scoop I've ever had. It cuts through hard ice cream, makes perfect scoops with little effort, and releases easily. I just wish that it was dishwasher safe.",
        "Very poorly made outside coating. It was partially chipping after first use. I've only cleaned the thing with cold water, by hand, yet somehow the coating is already chipping off and there is no way to return the product. I would be super weary when ordering this scoop as it seems to have a lot of lemons looking at the other reviews. Outside of the chipping, the scoop actually works really well so the positive reviews make sense.",
        "We love ice cream at my house but hate trying to dig it out. I've tried plastic scoops, lever scoops and so on. I thought I'd try one more thing and I am thrilled!",
        "Very easy to roll smallish (~2 in.), good-looking balls. I might get one of the larger sizes next time though since I'm a pig. The brushed texture of the inner surface is surprisingly grippy. Like, you have to wash along the grain when cleaning.",
        "Does not work as described. We followed included instructions, but it did not work on frozen ice cream. Note: This item was not eligible for return nor was refund option available. Waiting for email response from Amazon.",
        "I should have put more effort into finding out if it was dishwasher safe, but who would have thought an ice cream scoop wasn't dishwasher safe?! Not satisfied with this product. I had to throw it out. The scoop only got one use, and it wasn't even by me! I'd suggest looking at an alternate.",
        "The dishwasher will completely ruin this. I feel like that should be line 1 in bold letters on the product page. I ruined mine after one use this way.",
        "The scoop I received appears to be a counterfeit. It’s missing the logo on the end and the finish is super dull, definitely does not match the product photos.",
        "These scoops are the best! I had an old one of these for over 10 years, but it recently got lost in a move. They new ones are designed the same and just as awesome! They scoop a perfect little ball of ice cream with minimal effort and the ice cream doesn't get stuck to the scooper. What more could you ask for?",
        "This thing is fantastic. I bought one for my grandmother too. JUST DO NOT PUT IT IN THE DISHWASHER! It will be ruined.",
        "It rusted up immediately out of the box. It's dark gray with white spots. Wish it would let me upload a picture. It looks unfit to use with food.",
        "I love this scoop. I did a lot of research and everyone said this one was the best. And it is! It has a little bit of an edge so it can cut through extremely frozen ice cream. Has to be hand washed but that is a minor issue.",
        "I tried many.. this tops them all. Don't put in dishwasher. Otherwise very durable.",
        "After breaking a few scoops on hard ice cream I decided to spend the money on a solid metal scoop. This one doesn't disappoint. And it really does conduct your body heat to cut through still frozen ice creams.",
        "It can't be put in a dishwasher. The metal reacts and it's ruined. Of course, someone put it in the dishwasher and now our hands are black when we scoop ice cream. Ick",
        "This worked great, but then it turned a dull dark grey and the grey came off on to the ice cream within 6-8 months of purchase. I always hand washed it and never put it in Dishwasher. Is there anyway to clean it? It is unusable the way it is now.",
        "Either counterfeit or just a terrible product. Metal bled onto ice cream after a week of use. Never seen anything like this, stay away.",
        "I did not expect to want to write a review about an ice cream scoop, but this one is great. Very sturdy, cuts through the ice cream well, and makes the perfect size scoops. Really easy to clean up after each use too.",
        "Works so well. Make sure you realize how much you are eating. Make sure ice cream is tempered though. Still hard to scoop of it’s rock solid.",
        "Was looking for a good quality heavy duty ice cream scoop that would withstand the test of time and to replace another brand that was falling apart. The Zeroll is worth every penny and highly recommend it. The fluid inside the handle is not a gimmick and actually transfers the heat from your hand to the scoop. It's all metal and you could probably drive a truck over it with how well it's built. 5 Stars",
        "Scoops very easily. The heat transfer from my hand is better than any other scoop I have used. Basic no frills makes it easy to clean and small to store. Great scoop.",
        "I think this is the best scoop I have ever worked with. I scoop at least 200 scoops (I am a sampler ) a day and it is easy on my hand, wrist and it doesn't require dipping the scoop in water to make it non stick. I ordered two of these and the box they came in showed that you can get them in different end colors. I wish that I had the choice to order different end colors. I don't remember seeing that option. When I am serving two different flavors,that would have come in handy.",
        "I've been using this brand for years. Works great on that frozen ice cream. Just warm up the handle in your hands for a few seconds. Don't forget to just rinse the scoop off , after use, with lukewarm water. That way the liquid in the handle continues to work to soften the ice cream just enough.",
        "When you are trying to scoop out ice cream from a pint- it does not work well. It may work with plain ice cream without ingredients such as chocolate or cookie dough pieces.",
        "We were very disappointed in this product. The scoop leaves an aluminum residue in the ice cream. We threw it away.",
        "I can’t tell you how many Ice cream scoops we have gone through. They break or start flaking. This one is as perfect as the day we got it! And the warming part of the scoop works perfectly too!",
        "I have an old Zeroll scoop at home and wanted one in our winter home here in FL. I love this scoop, it makes it so much easier to scoop up solid ice cream and with my RA it's a winner for me. BE sure to hand wash this scoop!!"
    ]
}