{
    "entity": "Ice Cream Scoops",
    "text": [
        "This is not a Vollrath product, it is Thunder Group, made in China and very cheap and flimsy. This broke the 3rd time I used it. I will be calling Amazon for replacement.",
        "It is very light weight and wobbly and doesn’t scoop ice cream hardly at all. It has the ability of a plastic toy",
        "High quality ice cream scooper. Right-handed lever. Easy to clean. Easy to use even though, it’s huge. Perfect portion for ice cream, burger patties, rice, mashed potatoes and baking use. I would purchase this again if needed and recommend this to family or friends.",
        "I really like this ice cream scoop. I saw a lot of other options online and in stores that had negative reviews because the triggers are flimsy and break, but this one is very sturdy and strong. It’s a large scoop (4 oz), which is nice. I use it with ice cream straight out of the freezer and as long as you have the strength to push it in, the scoop seems ready and able to get the job done. I also like the deep dome shape. The ice cream presents nicely to company, and it doubles as an egg scoop when I have to drop them into boiling water without cracking them.",
        "I work in a care facility, and we use scoops like this to do portion control. This is great for home use to because it lets you scoop out a 1/2 cup serving of anything. This is especially great if you're on a diet and tracking your calories. I cook a big batch of quinoa to last me all week, but I only eat 1/2 cup for breakfast. I can scoop out 1/2 cup servings into one storage container, and they are ready to be transferred to my breakfast bowl each morning.",
        "This is an excellent ice cream/food scoop! Very well made, and looks great also! I use it not just to scoop ice cream...but I also use it to scoop mashed potatoes, potato salad, macaroni salad, and even individual meatloaf scoops. This would also make a great gift! Wrap a ribbon around the handle, and attach it to a container of cold salad (macaroni, potato, tuna) or ice cream. They will love it!",
        "Works ok, great for the price but a little difficult to scoop ice cream when taken out of freezer. I’m not an ice cream expert so this may be the same with any ice cream scooper. However, it is durable as it has not broke or had any pieces fall off as I’ve had happen with similar products.",
        "This disher is amazing and works right out of the box. Perfect portions every time and extremely easy to clean. Color coded handles make it easy to determine if you are using the correct size. Highly recommend getting these and will continue to purchase for the foreseeable future. Very happy and positively recommend.",
        "I got this 1/2 cup scoop for a meal I was serving to 200 people. I was looking for a specific size scoop when I got online and was really excited to see this company had various sizes that were color coded. It worked perfectly to scoop potato salad and I like the color coded idea so well and the quality of the scoop that I will like be buying other scoops from them in the future.",
        "I was really looking forward to this scoop and unfortunately it wasn't the same one advertised. I really like the Vollrath brand and quality so I returned this one which is a cheaper 'knock-off'. Beware of who you buy from because there are those who'll sell the fakes and put a sticker on the box saying 'Vollrath'. It was disappointing to say the least. Thank you.",
        "this is a really big scoop, so if you want alot of ice cream it will work. def not for use for cookies unless u want giant thin cookies.",
        "Just received it a week or so ago and haven't had a chance to use it. Looks like it will be a sturdy tool for dipping ice cream, although the size 8 is larger than I would have purchased for an ice cream scoop had I seen the actual tool. no problems with the seller and delivery was prompt.",
        "This has instantly become one of my favorite baking tools. I baked cookies using this tool and I must say the cookies came out looking like what you would find in a bakery/cookie shop. Easy to use and very easy to clean.",
        "We got this for portioning dog food which it's been very good for, and then I wanted other sizes for baking. These have made a huge difference with cookies and muffins. I am getting consistently even portions that are very easy to separate from the disher rather than needed to use my fingers or another utensil. The mechanism has been very reliable and it's easy to clean. We had tried a different brand as well, but the Vollrath is superior (works every time without getting stuck).",
        "Wanted this for ice cream, but it's too big! (the grey is not an attractive color, either. At all.) Kept it anyway--sometimes, it's just too much time & trouble to return things. Hoping we'll use it to shape hamburgers.",
        "Seems to be of very good quality. MUCH bigger than expected. My fault for not reading description properly. 4 oz sounded small but its large even for an ice cream scoop!",
        "When I was a kid we used one exactly like this for ice cream. It did not work very well. It is perfect for portion control. We use it for muffins and drop biscuits. Sometimes for rice. Makes a neat round stack on the serving plate.",
        "Commercial duty. Will usually last a lifetime. I use it To make meatballs and hamburger patties. So easy to use and clean",
        "This is a fantastic ice cream scoop. However, the size I got is definitely larger than I thought it would be. That's on me, though.",
        "I purchased this to use for making muffins. Instead of using a large spoon to move batter into muffin tins i just scoop now. Much easier, and accomplished in a single scoop.",
        "I use this for scooping cookie dough and it has held up well. Easy to clean. The handle and button are slightly uncomfortable to use but other than that I am happy with this purchase!",
        "This scoop means business. It's sturdy, easy to use. It seems like it going to stand the test of time. Very happy with it.",
        "I got this to scoop up perfect quarter pound of hamburger meat to make smashed burgers! Will of course use for other dishes, but I got it to make perfect smashed burgers.",
        "Great feel, haven’t used it yet!! But def worth the money, better than our last one.",
        "I used this all season scooping ice cream for making Milkshakes at my Biergarten. No signs of wearing out or breaking as of yet!",
        "I'm a bit worried about the plastic handle cracking in time if we use it for heavy stuff like ice cream, but as a disher - it is lightweight, fits well in hand , functions VERY smoothly and easy to clean.",
        "Came out of the box with a chip or defect. When the trigger is squeezed the mechanism is a little gravely and the spring sometimes catches and arrests in place.",
        "Works great, I love the vintage look and feel. Feels sturdy enough to last a long time.",
        "The scooper doesn't work. The ice cream doesn't come out of the scooper. It's hard to use. Used it 2 times and gave it up for a plastic one",
        "Unfortunately, this scoop is very difficult to use if you are left handed.",
        "Couldn’t find a sturdy scooper, we are pleased with this item. Seems like it will last , would recommend",
        "This is a very good scooper. It is much larger than I expected (larger than a normal scoop).",
        "I use this to pack my 8 oz gelato containers works perfectly",
        "I bought a cheap one before and it broke when I tried to scooped up the cookie batter. This is seems much stronger.",
        "I love this! I struggled with anorexia and so my dietitian recommended I use this so that I do not \"under\" plate myself. Great way to make sure you are taking an appropriate portion.",
        "It hasn't broken yet, but I feel that day is not long off.",
        "Well-constructed but too large for my purposes. My error in ordering, though, not a flaw.",
        "Works well. Good that it was sold with oz measurement.",
        "We've been through about five of similar dishers in the past two years. The ones made by Update were the worst, one of them lasted about a week. These Vollraths, however, are built to last substantial abuse. We won't settle for less again! The reason for the 4-star is because the ergonomic of the pusher is not very well design, but still better than most.",
        "Have had it for a year, it works fine for everything I use it for.",
        "I own three sizes. The number 6 is huge. The 4 0z. seems like the one that will get the most use. I am satisfied. Did not really expect it to be what I wanted, but these are quality products.",
        "American Legion kitchen. This was purchased to help home cooks learn portion control.",
        "Needed a half cup serving scoop. Has worked well and lasted.",
        "This was not what I wanted. Scoop size is way too big and the scooper is light and flimsy. Feels cheap, like it will break. We are not satisfied and I will have to buy a better scooper soon.",
        "very nice large scoop! easy smooth release. I make my own dog food and use this for portions. i am very happy with this purchase.",
        "This is a very well made scoop, like the one I have from my grandmother. I didn't realize this was such a large scoop, however, so I will be ordering a couple much smaller ones to fit my needs. What I really wanted was a cookie scoop, and this one is bigger than the average ice cream scoop, just for your own size reference.",
        "Nothing life changing, it's an ice cream scoop. Nonetheless, it's a great alternative to a plastic scoop and provides \"Daddy Sized\" quantities.",
        "I use this to measure out 4 ozs of my turkey meatloaf. I scoop it then place it in my muffin pan. This makes the job so very easy. I then can freeze them in my food saver bags for future meals.",
        "This my second. First went to my sisters church for dinners. This one for me:) So I can measure out yogurt.",
        "It was just a bit to large. Not good for Ice Cream scoops, but maybe for mashed potatoes.",
        "I bought this because I wanted a quick way to measure food portions. This item is perfect in that it is of the correct half-cup size, works smoothly, and expels the food completely from the scoop. Recommended for anyone who is seriously controlling the amount of food being consumed.",
        "It’s to flimsy to really scoop any ice cream out, but useful for portioning cake batter :) do not buy this for ice cream!!",
        "It's a perfect size amount for ice cream, making meat balls or perparing cookie dough to bake. Many uses! A must have for your kitchen tools.",
        "Works great, releases its contents with little effort and makes portioning things like frosting quick and with no mess.",
        "I use it mostly to dip cookie dough. It works great",
        "Works well as adver tised. Took me awhile read ing the instruction, in the end it pays off. Effective and easy to use, prefectly unit for a purchase. I would highly recommend.",
        "It worked well while it worked, but it broke within the first month or so. I'm ordering a second one to see if I got a lemon the first time.",
        "This worked like a charm scooping up even amounts of goodies!",
        "Love this scoop, I use it most of the time for ice cream.",
        "I bought this scoop to make hamburger patties. It is the perfect size. It works great and cleans easily.",
        "Great quality. Don’t waste your money on cheap product, get this first and have exactly what you need.",
        "Sturdy. Works great. Heavy duty, stainless gears. Don't settle for inferior products especially those with plastic parts as they fail under stress.",
        "Great tool. Can be used for ice cream and cupcake or muffin batter so the items are portion controlled for a better end product. Would use this seller again.",
        "I purchased these scoopers for water ice, it broke after my third use. Too pricey to break so easily.",
        "This is the Only Professional DISHER you should buy ! Thx. Chef,dc on Mixcrate.com",
        "excellent product, very sturdy and washes easily. will be buying more",
        "It seemed like it was used. The material was rusted",
        "I wanted a little larger scoop for ice cream to save time in serving. This filled the bill nicely and is very well built. I will use it a lot for other things also !",
        "We like our scoops jumbo-sized and this product is perfect for us. Also works great for some side dishes.",
        "Good quality scoop, especially the size choices, definitley buy again.",
        "the scoop isn't the best for ice cream but great for portion control. Very tough built and feels like it will last.",
        "Bought it for the restaurant I work at,it didn’t last a week,a definition of a piece of crap.",
        "Quick delivery, item was as expected. I wanted to use it for 4 oz cookies, but when scooped they actually were more like 6 oz, which is too big. But it works great for muffins. I'm sure I'll find other good uses for it too.",
        "Make big big cookies I love it and I the best and will be buying more very very very soon",
        "Still not sturdy as promised. I have been on the search for a sturdy scoop...still searching",
        "A bit flimsy. Fine for portion control and dishing up potatoes, and cold salads but not great for ice cream.",
        "Ordered this twice and was sent the incorrect scoop. A black size 30 scoop was inside the box for a size 8. Nice quality control",
        "I initially bought this scoop for ice cream, but realized that I had no concept of what 4 oz. was. It's much too big for an ice cream scoop (have since ordered the 2 oz. version). We now use this for scooping other things like potato salad, etc. For that it works well.",
        "I am a little disappointed in the quality of the stainless on this product. I have an older 1 oz. version of this and it is really nice. The stainless looks like it is about to get rusty at any time if I don't dry it immediately and thoroughly after every use. Compared to my little one, the shine factor is just not even there. I regret not buying one of these about 15 years ago when I got my small one.",
        "Release handle bent, scoop bar out of place. Does not push out entire scoop",
        "Searching for the perfect ice-cream scoop, like this one quite a bit but it's a heavy-duty piece of hardware, so it's maybe a bit large and awkward to operate even though I'm a guy with larger than average hands. A slimmer or contoured handgrip might improve the ergonomics. All the mechanical aspects are very nicely and solidly engineered.",
        "That's what she said! I used to get 3-5 scoops per meal, I mean desert, and now with this scooper I can cut down to 2-3 scoops and still pig out. I run it under hot water for a second so it cuts into the ice cream easier. Even the hard ice cream you gotta put your body weight into it doesn't break or bend. (Will update if that changes). The lever pushes the ice cream out with ease. then just rinse it under hot water for a second and then throw it back in the drawer, because I'm a bachelor, why wash it?",
        "This is a high quality ice cream cone size scoop. The maker has nine sizes, color coded plastic handles. The grey handle is size 2 13/16, next to the largest size scoop. The box says \"USA MADE\" but does not indicate the state. It appears to be made to last a long time, and at a good price. MAT in Sun City Center, FL",
        "Hamburger scoop! I purchased this to measure my hamburgers. I got the Aluminum Burger Press by 5 Star. It is hard to judge how much hamburger to use each time. Overfill a press and you have a mess. Not enough and you keep adding. The #8 makes 1/4 pound patty and the #6 makes 1/3 pound patty. Pack them level full. I also have the larger Blackstone Grill. I take the #6 and put a scoop on the grill. I then press it to my thickness with a Lodge Bacon weight. Never touch the hamburger at all. I use 85% lean and never press the burger after it hits the pan",
        "We suffered with a cheap ice cream scooper for years. I finally decided that enough was enough and that it was time for another one. After skimming through pages of ice cream scoopers and reading reviews, we decided to try this one out. We love it! Sturdy and easy to use! Perfect for our ice cream needs.",
        "I use these in my restaurant. This my third replacement. They tend to break at the point the scoop meets the handle and the metal rod that extends in to the plastic handle does not extend far enough and the plastic handle eventually breaks off under hard use. Not the quality I would expect from a Volrath labeled product. As a follow up, the third scoop broke at the same spot after a few months restaurant use.",
        "Very sturdy. No problems scooping. Now I can buy the larger tubs of ice cream and mix fruit in a bowl to match the scoop size. Very easy to rinse off.",
        "I bought it to scoop the ice cream. I used to work in restaurants and recognized the Vollrath name, which is what most restaurants use for portioners/scoopers, so I bought it. It's as quality as what restaurants use, and those things last years with constant daily abuse. Very happy with my purchase.",
        "These are worth the money. Tried a cheaper brand and several broke way too easily. These have held up very well!",
        "I bought this to help portion ground beef for Burgers. I suppose I could have just used a Ramekin or something but this works and will come in handy for other food stuff. No regrets to date.",
        "Exactly what I was looking for. Great price, restaurant quality and dishwasher safe.",
        "When I ordered this I was not sure of the sizing to choose. It is definitely bigger then I expected it to be (more ice cream for me then). It works great. Seems to be made out of quality materials.",
        "I was expecting a more robust product. The gears are definitely not smooth moving. I have purchased better products of this type that don't carry the Vollrath name and the are much better. I like that they are color coded, but I won't buy another one by this brand. It gets the job done but that's about it.",
        "I bought this for my daughter's birthday party and it's very handy and easy to use! It is very durable! I love this new scoop!",
        "Honestly, for the price I was expecting something kind of shoddy, but this is a great scooper (easy to use and very durable.). I would recommend it ot anyone who bus ice cream on even a semi regular basis.",
        "A good sturdy scooper. I use it a lot for my dogs food, it’s holding up well",
        "I needed a way to get an exact portion for a meal fundraiser. I bought three of these and they worked very well. One-half cup portion of potato salad, coleslaw, and beans!",
        "Wow. It’s huge. Makes HUGE ice cream scoops. It’s nice, no doubt, but large and bulky in my drawer.",
        "Works well. Food easily drops from scooper. Great size for making hamburger patties. I no longer have to guesstimate how big to make my hamburger/meatloaf patties.",
        "Very sturdy but boy does it have a big portion in that one scoop."
    ]
}