{
    "entity": "Random-Orbit Sanders",
    "text": [
        "Great product, but be careful, requires a big compressor with a high continuous air flow to run it. My current compressor (about a 400 dollar 110v dual stage compressor) does not produce great enough quantity of air to run this tool. Still, it is a good tool............. I will have to think about a bigger compressor.",
        "Well built, but deducted 2 stars as this is my second one. The first one was used to sand an old front porch over several weekends. Not an average job as the floor boards were in tough shape. Also had to sand a good amount of paint and wood filler. For some reason the sander ceased up after the project. Could have been the condensation build up that was not cleared out, but no real way around it unless you take the whole unit apart. Happy enough with this sander though to purchase another one for other projects. Cuts through wood filler with no issues and leaves professional like results.",
        "This will be a fine tool for home use or the hobbest, not for a body shop. Four dead or broken last year (purchased within the last 16 months). I'm sorry sir, but not built anywhere as good as American made National Detroit 900 @ $450.00 each. However, most of you may not need the bodyman's workhorse.",
        "I guess Ingersoll Rand has a 38 year life cycle. I bought my first one of these in 1981 along with my first Ingersoll Rand long board and they both went out within about a month or two of each other. While I was only a processional body man for around 8 years I have used both tools extensively for side jobs and personal restoration projects since then. I would say they have paid for themselves many times over.",
        "This works much quicker than my Festool random orbit sander. There is no way to attach a vacuum, so I use a fan to blow the dust away from the work (and me). If you put the compressor in a separate room, it makes for very quick and very quiet sanding.",
        "I have a new log home that I am using this sander on and the internal counterweight snapped off and will not work. I was able to fix it but the sander as soon as it touches the wood ceases to function. what a waste of money.",
        "This is s must in the work I do! My 20 year old is still good, But for the price I could not go wrong on buying a new one at a cheaper price then what I paid 20 years ago !",
        "Had it connected to a 60 gal compressor. Just didn't have the power. I had it up to 110, lbs of air. I sent it back.. GO WITH ELEC..",
        "This sander is smooth powerful and a joy to use on large areas. I was stripping paint from a large boat bottom and used it with 80 grit and a hookit pad all from Amazon. Works fantastic !!!",
        "This tools are workhorse no doubt. A very nice addition to my sanders.",
        "This is an exellent 8 inch da. I am a collision technician and use it almost daily.its smooth pretty quiet. Most or all an excellent price for this type of tool. Thumbs up!",
        "I have been using this type of sander for at least 30 years + and havent had any problems, with the brand I was using, this is my first I-R sander like this, and so far its as good as the other brand, and alot less expensive, which in my books makes it better, no problems so fsr if any should arise I will for sure get back to the ratings, I would not at this time hesitate to buy another one, I have told all my frinds about AMAZON, and the prices. Thanks for being there when we need some help in America. J. W. Jones",
        "Makes long panels,and Hoods....FLAT. Excellent machine. You need an 80 gallon or larger compressor to run this for long periods of time. This machine is a money maker.",
        "Love it, I use it for shaping body filler fast. Works great on flat panels such as hoods and roofs then I go over it with a long block.",
        "i have been using this sander IR sander for body work over 35 years ,they are very well made and this new one i just got is my new best friend",
        "This is a must have tool for the body man. Used like an orbital (GEARED) air file. Removes excessive body filler. Saves lots of time. Also bought paper for this tool on Amazon. Great deal.",
        "Great sander. Definitely can take a beating. Works great !",
        "Good product IF you have a big enough compressor to use it. I have a 20 gal 4 scfm @90 psi and it couldn't keep up.",
        "great tool for the money/ its identicle to the blue point one I bought from Snap On",
        "Awesome Sander and what a deal ! This 8” gear drives are well over 400dollars elsewhere",
        "it's no National Detroit, but it's still excellent quality for the price.",
        "The term mud hog fits this orbital extremely well. my husband didn't think it would great... but the day he used it he was extremely pleased.",
        "Please realize that this is NOT a National Detroit hog. Read the specifications and you will see that the RPM and air requirements are not the same at all. That being said, I think this is a good little machine. I had an ND for over 20 years and only needed to replace it when someone borrowed it and did not return it. My criticism of this would be the high air requirement (even with a big 5 HP and 60G industrial). It won't really spin much under 90 psi. It will do a nice job however and I do like it. Great deal for the cost.",
        "Love this da! My old one died after 10 years or so and this was a perfect replacement!",
        "I used National Det at work for years . I had to get an 8 inch da for my house. I bought this one . Beautiful working tool !! Can't ask anything more from a DA . Carl . N.Y.",
        "not as good quality as say 15 yrs ago, but then what is",
        "just what I was looking for and a very good price.",
        "This is a great tool. Plenty of power and I am very satisfied with it.",
        "Love these things. My go to tool in my shop almost all the time. Can knock off filler quick and evenly. Get used to em, and you don't have a whole lot of blocking to do. Gear drive has some umph. Last forever too if you take care of them. Only replaced my last because I dropped it from top of a semi and bent it too bad.",
        "This is precisely the tool that I needed for a major fiberglass refinishing project-- it is easy to use and works excellently",
        "This thing paired up with some 36G discs will strip anything quickly and flush sand like a champ.",
        "Had a Ingersoll mud hog for years until the handle broke in a fall. Could not find parts to fix it and could not find one anywhere around where I live (rural East Texas). Largest parts store could not even find one in their Ingersoll catalog. Went to Amazon and found several sources and bought mine for a great price, much lower than I expected. I just hope it last as many years as my last one.",
        "This sander is terrific and a great value. I find Ingersol Rand products to be great in general and this 8\" sander is no exception.",
        "been wanting one for years, good quality and works better than I expected, del. time was great",
        "Not bad for the money. Doesn't compare to National Detroit if you are a bogyman for a living."
    ]
}