{
    "entity": "Random-Orbit Sanders",
    "text": [
        "I thought the pad was a good density, not too hard or soft. The unit operates very smooth and it is not too bad on air consumption if you dial back the pressure and control the flow for the task at hand. Granted, if you need the full power, it will consume air. I'm mostly sanding primer or filler, so throttling the air helps reduce compressor cycling and gets the job done.",
        "Working in a higher end shop where we do Porsche & Audi for 90% of our work. I have two other DA sanders (Hutchins & Snap-On), that are finishing DA’s that I sue majority of the time. When is comes to cutting and stripping of bumpers and hoods, this beast gets the job done a lot quicker. When we stripping a bumper job with the finishing sanders, it would take 1.5-2 hours, where as with this one it takes 30 tops. Well worth the price!. Plan on using this to strip down my 72 Nova",
        "I was really surprised that the DA sander failed after 20 hours of use. While it was working, it did a great job sanding. I actually had to slow it down, and use a higher grit sandpaper to slow down how much material it would take off. I gave it 3 stars because it failed so quickly. This was replacing a DA sander that i had used for years in a wood shop.",
        "We are using this in a commercial sign shop, in place of a $275 unit of very similar design. For sanding aluminum sheets and awning frames -- this works great. We'll see how long it lasts, but if it lasts a year then it's far cheaper to buy this unit than the comparable \"industrial brand\" that is so much higher-priced. Uses the same sanding disks. The guys using it are picky -- and they are impressed. I haven't told them the price! :-) UPDATE 12/8/2018... Not only has this lasted, but the guys in the shop like them so much, we've bought three more. Bargain price for the value.",
        "Tom quality air tool. Lots of power. I have a commercial compressor so I don't know how well a small compressor would handle it under heavy usage. Tom",
        "This is an older design but works flawlessly. Works as a straight sander or an orbital. Use it to remove paint on large surfaces.",
        "I haven't got to use this yet but I've hooked it up and it works. I cant wait to use this when I restore my truck. Very well built.",
        "really good DA sander. I just need to get a more powerful compressor",
        "Excellent quality for the money , plenty of savings from Amazon , my favourite go to for a great price and product . This is one of if not the best DA on the market , great ergonomic handle , easy to hold and very versatile .",
        "This is a great little da that I use for auto body repair",
        "All the people that said this thing didn't work didn't adjust the air control knob that looks like a bolt, or didn't have a big enough tank. Think the cfm is wrong on the description. If you have a big job you're going to need a good size compressor. I have a 5' tall Craftsman compressor and it was working hard the whole time I was doing my boat. Had to stop here and there to let it catch up. But this thing is a beast. And it's really good quality. You will not be disappointed getting this one. The trigger is a little annoying but you learn to deal with it.",
        "This product is great, saves time easy to use, powerful, handles nice. Great seller, delivered fast. Will buy from seller again.",
        "Your usual CP quality. They've never let me down before.",
        "High quality, works great, and reasonably priced. Goes great with my Dad's 40 year old Chicago Pneumatic impact wrench.",
        "Bad A$$ and blows away the harbor freight one I burned up before I bought this one. Pro grade tool",
        "Cover split in the first 10 minutes. Still usable but had to wrap cover with tape.",
        "It's cheap made and it doesn't have much power save your money and buy ingersoll d.a",
        "I like it very much. And is very quiet and smooth. I use it on a daily basis.",
        "Worked well the price is great I owned a Hutcherson for years however i don't use on that often this is not near as expensive and suits my needs just fine",
        "I likes this one cause it seems to me it is built better.",
        "Works as required for the job I used it on. Smooth steady spinning action.",
        "Works great, make sure you have an air compressor big enough to drive it.",
        "Grat product to buy, if your trying to fit your car yourself or for someone els.",
        "The pad is a piece of junk,didn't get through the first job before it was coming apart .",
        "Bought this work for about a week, started to jam up !! Must be old stock jump",
        "As the title states, it worked well the first 2 times I used it. After that it began to slow down and eventually freeze up. Brought it into my local tool repair shop to have it fixed & they said it would cost more to fix than to buy a new one. Took it apart myself and could see it was pretty cheaply made. Greased everything up and can get it to spin at idle, but won't turn with any pressure applied. I would recommend spending more on something that will work more than twice.",
        "Exactly what I expected. A good working quality DA sander",
        "Once you start and put a load to it ...it slows down quick. Not from RPM just sluggish. The more of lower number grit number like 60 or 80 grit the worse it gets.",
        "I own a small bodyshop and have always used national detroit, but their 6\" d/a is twice the price of this one so I thought I'd give this one a try. after 6 months of use I find this to be a better tool. to bad it's not american made.",
        "Bought one off of here to replace another that was at least 8 years old. Very little goes wrong with them, the other would have lasted longer with better maintenance I'm sure. Would recommend it to anyone.",
        "I received my CP870 sander today, put 2-3 drops of oil in it and it doesn't have any power. I run on 90# plus and if I put any weight on it I can stop it. If I don't lift it up off metal to start it, it won't start. Runs fine if just free spinning but as soon as you put it to work its a dog. Very Very disappointed. Maybe I got a bad one.. I have a older one, not same brand, that I can put pressure on and not stop it",
        "I have used CP's tools before and this one is know different works well great for autobody but occasional users may find it a bit heavy",
        "this part was poor in quity. no power to spin sander.",
        "Nice product but NO instructions on how to install sanding pad onto machine. Comes with a straight shaft on disk while the machine has a screw input.",
        "I ran this on a honda 5.5hp gas, wheel barrow compressor , 9gal. and i have to consistantly wait to build pressure. i would run it on more like a 30 gallon with a bigger engine like 9hp",
        "Planning on returning it, heavy then expected handle is some what difficult to operate",
        "Overseas contractor. Purchased to perform my job. Bought these for the affordable price tag, but did not anticipate the large size and weight of the sander. If you are planning on doing a lot of sanding, I would recommend a lighter and more compact product.",
        "Honestly I haven't used it yet, but I expect it works well. just be warned, it looks like a generic piece of junk when you take it out of the box. not like a normal cp tool. there is not even rubber on the lever. the deWalt and Ingersoll appear much better fit and finish. BUT I'm just talking about appearance. which is terrible imo. update: used it a fee times and it already quit. from the get go it acted like it didn't want to start towards the end, it wouldn't even spin against your hand. garbage. go with ir. maybe I used a little bit too much pressure, but it lasted a week. come on. threw it away."
    ]
}