{
    "entity": "Refractors",
    "text": [
        "I'm a beginner. I knew nothing at all about telescopes. The manual and c d that came with this one made it easy for me.",
        "Bought this as a first telescope, came in a nice retail box that works great for storage. Got out the quick start guide and quickly had it up and running. The tripod was larger than expected. Once it got dark it we were looking at craters of the Moon, Jupiter, and Saturn within minutes. It's a smaller telescope so planets don't have great detail, but it picks up Saturn's rings and the four Galilean moons of Jupiter with the lowest magnification. Love the slow motion altitude adjustment, which isn't available on lower models. If you are brand new to telescopes, invest some time reading the manual and expect some learning curve, but this is a great place to start.",
        "All around ok scope for getting a child interested. Finders scope is awful and the full 60x magnification is not nearly as well focused as I was hoping for. You get what you pay for. Also I had to re order it as my first order was missing the screws to attach the scope to the tripod.",
        "beginner scopes usualy require patience and some knowledge of where to look in order to see anything . this will just about do it, i can see almost every thing thier is to see and im old with failing eyesight, id like to know what a kid with some guidence could see. sure biger is better but this is inexpensive and highly mobile",
        "I bought it for my son's birthday. Didn't open the package for 1 year. Then when tried to put together, noticed that one part was missing. So I am stuck with this product. Very disappointing. I can't return because time passed by and can't use it.",
        "This is exactly the same telescope I had in 1986 to view Halley's comet. I took it outside to acclimate it to the temps and within 20 minutes I saw stars. Many stars and I was looking just southwest.",
        "Of course with the smaller objective lens there is a noticeable difference from my larger 80EQ in terms of light gathering, but the resolution or clarity of a distant terrestrial object during finder scope alignment was very good for the price. I was actually quite happy for that as the telescope, the Powerseeker 60AZ was a gift for a good friend to give to his young daughter, hoping to inspire the youngster to greater goals through the spark of light. Make the Universe a goal to inspire young people.",
        "my kid loves this thing! we've had lots of fun looking at the moon and stars. it is light and can be easily knocked over, but it is not flimsy. the included cd guide is much, much better than the paper instructions. we'll probably upgrade to a more powerful celestron next year.",
        "Bought this as a gift for my 57 year old Mom who has always wanted a telescope and she absolutely loves it, she says the picture quality is great but she also loves deep in the country without any light pollution. It comes with a full size tripod and it looks great when it’s set up. Very high quality look to it.",
        "We get this for my daughter when she was 11. Easy for her to use and both our kids loved checking out the stars and making up story's.",
        "Have not been able to focus on the night sky, kind of a bummer for an 8 year who was super excited.",
        "Easy to set up. Kids and parents love learning about the stars.",
        "My grandson loves this. This was the first thing he wanted set up on Christmas Day.",
        "Got this for my adult daughter she was real excited and loves it.she uses it with her kids and it has plenty of powerful lenses",
        "I bought this for my teenage daughter as a Christmas gift. It's her first telescope. We tried it out on the \" blue moon\" and the telescope gave us sights we never saw before! Very clear lenses and great views of the moon so much so you could actually see the crater lines perfectly clear.",
        "Decent Telescope for Beginners. You will definitely like watching the moon through this. If you really want to see stars and constellations with precision I would suggest you buy a better telescope than this one. The higher magnifier lens is of no use.",
        "Great, easy 2 setup, stand extends bout 4' or so. The telescope just as good expensive 1.That small viewer excellent, it locks in on target which makes it easy to find your target. Could see the craters on moon very clearly.",
        "I have a small pond behind the house and several pipes keep the ice from freezing this time of year. It suits the ducks and geese just fine and that suits me as I watch them from my warm living room. When the weather warms a bit, I'll try it out on the stars but it does what I wanted now.",
        "Very shaky, unstable, hard to operate for kids and adults. Poor lenses, poor star diffraction rings. Get what you pay. Get a better unit and pay more money to see the beauty of the stars, and planets.",
        "We looked at the instructions to assemble it but it doesn’t even work",
        "This scope comes with a tripod and an eye attachment. Very good accessories and scope for the price. I have used this scope to look at stars and the moon, very pleased!",
        "For what it's worth it deserves 5 starts but you don't be any space explorer with telescope.",
        "I had purchased this as a christmas present for my boys. This telescope is awesome. The only problem with mine (which may be a fluke) is the scope cover wont stay on. Which means dust collects on the lens.",
        "My Grandson is truely loveing his new telescope. This was a the perfect Christmas gift for a small star gazier. He is 5 and told me that he is going to see his Grandpa in Heaven with his new telescope He said its a keeper. Thank You",
        "I like my new telescope when I got it I was able to see jupiter and saturn",
        "Easy to put together with quite nice quality pieces and with a good price. Works well too, now I can watch ships pass by our waterfront farmhouse. I have not tried to watch the sky yet, current weather is mostly cloudy.",
        "Our (now) 7 year old grandson was really into planets two years ago and this was the perfect gift for him at the perfect time. The family still enjoys it to this day. They live in UT and can visually explore the mountains surrounding them also.",
        "Nice starter telescope. Gets you into the hobby of astronomy at a great price. Make you want a larger telescope so you can see even more. Easy to set up and use.",
        "I was surprised by what a sharp image this produces because of the great price. We bought this for our 3 year old son to look at the moon...a great purchase",
        "Very nice telescope, I got it as a gift for my daughter in law and she's very happy with it! Has 2 dvds included for information. Packed well, Fast shipping.",
        "My nephew will love looking at the moon and stars!",
        "We read the reviews before we committed to this purchase, some people say its not good enough, well after finally having a clear night where we could go out and look at the stars, this telescope proved to be a great buy. While it is not the most powerful or the most high-tech item it has been a great addition to our son's life. He loves going outside and looking at the stars and the moon.",
        "Excellent product, I recommended this product, I hope everything’s are the same. I used every day and it is fine. I continues to buy.",
        "Good telescope, good quality its not defenly for the pro guys, but very good for beginners...",
        "I purchased this as a Christmas gift for my nephews. I have received pkone calls from them in regard to the use of the telescope. They were impressed with the construction & the instructions for the use of it. As a family they have been using it since Christmas & are impressed with what they seeing as the are star gazing.",
        "bought it for my 9 year old nephew. He likes it.",
        "Bought for my Dad, he loved it, great to look at the moon with, but planets are a different story, seems like a great one to start out with",
        "The smaller eyepiece for finding the object you want is easier to use than the larger for detailed viewing, but this is a very nice starter telescope for your kids.",
        "Great telescope. My grand son will have a ball with it this summer.",
        "Yes, I love my telescope, I was surprised by how well you could see, I definitely would recommend this telescope to anyone!",
        "If it gathered more light and the barlow lens worked... it'd be okay. only jupiter is visible. Moon is perfect. dont buy... save $300 more and get a much brighter system F4.5 this is F12 and is dim as hell... nearly useless for all the deep space objects....!!!! Barlow lens claims to triple the power but it messes up the focusing of the whole system and it thus doesnt work! Dodge this product like the Zombie Plague!!!",
        "Not even strong enough to see the moon clearly. Also the quality of the item is a little frail.",
        "An excellent Telescope for this price, has a very good optic, and is very sturdy and elegant",
        "My son and I have had hours of fun using this telescope. Great for beginners like us. We love stargazing with this one.",
        "Pretty cheesy, but what could I expect for this price",
        "I purchased this for my nephew's 8th birthday. He is loving it! As well as my brother and sister-in-law!",
        "Bought as a gift for my science-minded son for his birthday. It does the job, able to view the moon or focus on things in the distance, but it's connection to the tripod is extremely wobbly. With all that wobble, it's hard to actually look at anything. Merely touch your eye socket to the eye piece and it causes enough movement to lose what you're looking at. If it had a more stable tripod, it would have been perfect, but, you get what you pay for.",
        "Gave this to my daughter for her birthday. She really enjoys it. Good entry level scope for kids that's not too expensive.",
        "Very complete system for the price, and the addition of the software is a great addition. This telescope obviously doesn't have the high-end mount needed for tracking or finding objects, but it's a GREAT beginners telescope. Has everything you need.",
        "Very good item, great buy. Does a very good job for what I wanted.",
        "If your looking at the moon and not really wanting to see other planets close up then this will do just fine. This is not suppose to be some high end pro telescope by any means. I bought this for my special needs 8 year old and he loves it. Beware that if you take this telescope outside DO NOT leave it out and do not use it when it is muggy or damp. The water drops will form on the lens and that is all that you will see.",
        "Item was as described. Very good for a beginner telescope. The viewfinder is very helpful for my 7 year old. Easy enough to use to get him quickly interested. Very good value for the price.",
        "Delivery quick. It was a Christmas present for my grandson. My son set it up, however, took a little time as there were no written instructions inside the box.",
        "Great for the price! Bought for my 4 year old who wanted to learn about the stars! Will have to upgrade to a better one if this is something he gets into when he is older but excellent starter telescope!",
        "It's nice quality, however there are missing parts (parts that are crucial in order to use it, I might add). But I guess that's what you get for buying a telescope that's normally over $200 for real cheap..",
        "Was a gift for my 12 year old & she absolutely loves it. Great & affordable item for those adventurers inspired by the stars.",
        "Purchased for my eight-year old last year for his birthday. Obviously, I didn't want to spend too much, in case he knocked it over or something. For the price, the clarity is AMAZING!! We were able to see quite a few stars and a planet or two in our own backyard. Now, we just have to wait for some clear nights! :)",
        "Good starting scope, but not the most stable for viewing smallest and furthest stars",
        "I bought this telescope for my husband for Father's Day, but ended up giving it to him early. He was always out on the back porch looking at the night sky. After receiving this telescope, I'm not sure he even comes in at night anymore. He loves it.",
        "I love it, I can see the moon in a different perspective",
        "It has been too cold to go outside and view the new moon. Temps in the minus but it is great quality especially for the price. Grandson loves it!!!",
        "I sent this gift to a close friend who doesnt seem to have had any issues with itm pretty good so far",
        "I love using this telescope but cannot wait to get into a location where I can see the stars better. I live near Chicago and with all the lights it doesn't get dark enough to see the stars. I love all the extras that come with this telescope. I am a beginner with star gazing with a telescope but found this easy to put together only because I love putting things together. If you are not a person who enjoys putting together things then this would be a bit more challenging for you.",
        "Nice telescope, but the mount could be better. It is ok for adult use, as once it is set on a target (moon, planet, etc) it CAN NOT be touched at all. We tried to use this with the kids next door, but they would always grab, touch, bump or even breath on the eye piece, moving the scope well off the intended target. Views are clear, but mount does not lock in very well.",
        "powerful for a beginner yet easy to use. Assembles rapidly. The fine adjustments work well and are easy to reach.",
        "It was a birthday gift for our grandson. He was thrilled with it. He said it was just what he wanted. We were pleased with the way it was packaged and shipped. We couldn't have been happier.",
        "Birthday for 8 year old grand daughter. She will grow into the science of the product.",
        "Delivered on time. Found everything in the box as described. working good. very satisfied with this item. It is for my personal use.",
        "When I ordered Celestron Powerseeker 60az I was a bit sceptical because of the reviews, but because of the price, I ordered it amyways. Best spend of money I have ever made. The telescopes optics are just amazing, crystal clear and very easy to focus. It came yesterday, and I was up at 2am looking at the moon and Jupiter. I was able to see the details of the moon easily and saw 4 of Jupiters moons. I live just outside seattle, so there is light pollution, but that didnt matter. The only con is the stand is study, but a bit shakey at the same time. This was my first telescope, definatley buy it.",
        "I bought this for terrestrial viewing. First, this is a $40 scope. Don't expect the Hubble here... For my purposes this works fairly well. Seems well constructed, tripod is nice. As others have mentioned, you won't get anywhere near the max mag specified. Best images are using the 20mm eyepiece. I get decent, if dark, images using the 4mm piece. The Barlow lens is worthless, even using the 20mm (though i'm not sure why--should be less magnification with Barlow + 20mm than with 4mm alone). All in all, pretty good for the money.",
        "Great quality, nice size. The zoom could be better but it was a great first experience. I would like to recommend it.",
        "Birthday present for my eight year old. She loved it. Works great. This is a fairly rugged unit that should stand up to some abuse.",
        "Just very surprised at the durability to it . easy to use, viewing is great, bought for my 7 year old granddaughter and this will be good for her for many years.",
        "it works okay, the construction is good and the quality is fine, but this thing isn't much more powerful than my binoculars. it's on a tripod which helps to find the images and it makes it more stable and less shaky, but the power level leaves much to be desiered...",
        "I bought this telescope for my son as a birthday present. He had been asking for one for a while. So far we used it only once and had no problems. I am looking forward to using with him again soon.",
        "This scope comes with a tripod and an eye attachment. Very good accessories and scope for the price. I have used this scope to look at stars and the moon, very pleased!",
        "I bought this as a present for a young boy aged 6. Definitely not for that age group. Okay as entry point for an adult.",
        "We had a several college students even try to come and help my daughter use this telescope and was still very disapointed in what you could see, we could see the same amount of items with the naked eye if we stood in our back yard, I wished I could of gotten a full refund on this item , what a bad choice for an Christmas present, never again! Brenda Sue",
        "Though the product looked good. But was defective that i recieved and i finally returned it. No clear view not user friendly. Published as beginners but doesnt see like.",
        "I like it because it is cheap and easy to carry. I got it less than 20 days ago, and I have seen Saturn rings, moons, Jupiter and its moons. However, I cannot get clear image when I add the 3X barlow lense. That is my probem. I am pretty sure that I used barlow lense correctly because I have used in the elementary school.",
        "You get what you pay for. This just sat uselessly in the corner of my daughter's room for years, as it never functioned properly or as expected.",
        "Highly recommended. They replaced a broken lens immediately. Grandchildren Loving it! Thanks :)",
        "Grandson loves this telescope. He is interested in the stars and now has a tool to see them closer.",
        "I bought this Telescope for my son, expecting to be able to see the stars... These are a couple of problems related to telescopes in general, this one in particular is not an exception: * Telescopes are difficult to use, locating stars/planets is quite difficult, and requires a lot of patience (not all kids come with this!) * When you get to, say, the Moon, what you see is a bit disappointing... It is only a bit bigger, you see more detail, but nothing else.",
        "We purchased this telescope for our son as an 8th birthday present. We were a little skeptical due to the scope being so inexpensive. Not wanting to spend a fortune on a telescope if our son was not interesed, this one had the right price. We definitely make the right choice. We are thrilled with the quality! We can see the moon so clear and in great detail. We and our son love using it. I would highly recommend this scope as first.",
        "have not taken it out of the box as it will be a Christmas Gift, but all the pieces are there, it is in excellent condition, the price was right and it arrived as promised.",
        "My Grandson really likes this and was shipped to his home real quick.",
        "Not what he asked for but just what he needed. Loves the fact he can see onto the moon not just at the moon close up.",
        "This is a horrible beginner telescope. I guess this is why the price was so cheap. We got it for our 11 year old daughter for Christmas and she was so disappointed with it. We could not even see the moon with it. We followed all the instructions and could not spot a single object. What a disappointment.",
        "My husband has been wanting something better than his binoculars to see the moon and stars. He is satisified with this purchase. Not amazing but good enough for basics.",
        "VERY SATISFIED WITH THIS PURCHASE AT A VERY GOOD PRICE, I HIGHLY RECOMMEND IT. I AM VERY PLEASED AND CONTINUE BUYING",
        "The telescope arrived in a timely manner. My husband and daughter enjoy looking at the stars and the moon. It is a great telescope for the price.",
        "WOW, my 5 year old great-grandson is thrilled. took it to the beach, could see men on oil rigs. thanks.",
        "Unfortunately there was missing parts which I had sent to me. I just found out that the thing is broken as well. The telescope attachment to the tripod is broken off inside. We couldn't figure out why it kept falling off. The box was damaged and this is a problem. I didn't know it was broken till now and I cannot return it!",
        "Cheaply made and not worth the money. The moon is the only object you can see. Not worth the money.",
        "It was for my son birthday anda he loves it!! Perfect for a firts telescophe",
        "It was an easy assemble process and I have used it during the day and it works just fine but for some reason (manufacture error or my own) at night you cant see a thing weither the sky is totally clear or not. Since the sole purpose of purchasing this product was to look at stars and planets I consider this a waste of money...",
        "I brought for my 11 year old son it was too complicated and we tried to star gaze couldn't see anything... WASTE OF MONEY!!",
        "Cheap, wiggly, plastic, terrible instructions. Can't use it at all.",
        "My wife and I both have Masters degrees and found this difficult to figure out!"
    ]
}