{
    "entity": "Refractors",
    "text": [
        "My daughter has been begging for a telescope for months, so I found a really good deal on a used Celestron Astromaster 90AZ to surprise her for her birthday. Unfortunately the surprise wasn't a pleasant one, as half of the objective lens was shattered and in a Ziploc bag. It appears to be a good telescope for the money, but unfortunately someone returned it damaged without indicating such. The manufacturer wouldn't have packaged a telescope lens in a sandwich bag, and surely Amazon wouldn't have sold it if the damage was known so I can't blame either. Things happen. I'm hoping the replacement that's on the way is useable and that my daughter will understand.",
        "The consensus about the tripod being cheap is absolutely right. I only bought it for the telescope so I don't have to deal with this tripod. If you are expecting to put the highest magnification eye piece on and try to frame what you expect then get ready for lots of frustration. The telescope itself is pretty sharp but has quite a bit of chromatic aberration (you get what you pay for).",
        "The star pointer telescope was not even on it missing. It came with absolutely no telescope lenses. The telescope Mount is not sturdy like others have stated it also is missing a screw. I did buy this used it did say the box would be damaged but the product would have everything in it and it did not so that was very disappointing as this was for my son's birthday in his first telescope.",
        "Love the telescope, hate the customer service. Trying to get the telescope realigned after it fell over and keep getting the run around. Seller needs to honor their word and the three year warranty and fix or replace it",
        "Product was sent defective. The inner cylinder was inserted past the appropriate level not allowing ability to focus. Completely useless if you can't operate focus feature.",
        "I bought this as a birthday gift for my husband because he's been wanting a telescope since I met him, but never felt confident in buying one because he wasn't sure what to look for. He couldn't have been more excited when he opened it, and uses it every chance he gets. He loves it and acts like a little kid getting a new toy every time he sets it up. He couldn't love it more; I'm thrilled I decided to get it for him.",
        "Would recommend this telescope --- My wife and I purchased this telescope as an intro into backyard astronomy. After much research, we decided on the refractor style scope due to its ease of portability. We are very pleased with this telescope, and views of the moon, Jupiter, and Saturn have been amazing.",
        "Very pleased with this. A substantial piece of kit for the price and can be set up from the box in a few minutes. I ordered it in the UK for delivery to my family in the USA so Amazon are very useful in this respect. I chose the simpler altitude/azimuth mount (which simply means it it can be aimed where you want like a camera on a tripod) because the equatorial tracking mount is heavier and needs significant setting up. Images are very good and would only be improved by spending many hundreds or thousands of dollars more.",
        "Works good but seems a little cheap for the price if I’m being honest.",
        "I bought this telescope as a gift to my boyfriend. At first, I had no idea how to choose a telescope, so I did some research. I am extremely happy with my purchase. The telescope is easy to assemble and relatively light. It took my boyfriend about 20 minutes to zoom correctly and view defined objects and planets. Definitely a telescope I would recommend to beginners!!",
        "Great telescope for beginners, easy to assemble with no calibrations. I’m still learning and once I’m comfortable I will upgrade to a better telescope.",
        "returned and refunded. terrible mounting. while tripod is solid the scope mounting system is the worst I've ever touched.",
        "I love the telescope, no doubt about it, but it arrived broken. Part of the tripod assembly was totally twisted and broken. Had to duct tape. Went everywhere online looking for replacement part, but at the end of the day, Celestron is based UK and their parts are only sold in UK. No one would send to the US.",
        "Person who received it enjoyed it came in good condition and on time",
        "Never had a telescope before. Opened this one up and it was easy to set up. Found the moon and some stars right away. Moon to bright to observe at night, but during the day, wow! Need to study the dvd's, but having to much fun on our own right now.",
        "Frustrating experience using this. The tripod/mount has a lot of slop in it. Barely touching it moves the moon / target out of the eyepiece’s view. With patience and a lot fiddling I could make it work and the optics were satisfying. But for my 12-year old it was too much bother. A magical teaching moment derailed...",
        "Is good if you can get it for a good deal. If not the AstroMaster 130EQ is better.",
        "It's easy to put together really enjoy looking at the stars. I would recommend it to anyone.",
        "This telescope is awesome...very powerful..I bought two of them for each of my grandkids...I had to laugh, they set them up on the deck in their neighborhood...and they were amazed at what they could see with them...they are for land and sky views...so clear and up close..I am very pleased with these and the cost was excellent...heavy , well made of great quality...would recommend this telescope..",
        "Not able to view from the lens and unable to find something on Youtube to help",
        "I bought this telescope for the telescope and not the mount. I transferred this telescope to an equitorial mount. The equitorial mount also has a motor drive with slow motion controls for the R.A axis. This makes this a very good scope for astronomy, and astrophotography. I am very happy with it.",
        "Bought this for my son's 5th birthday, he absolutely loves it. It is very easy to setup out of the box, it took me about 5 minutes. The quality so far seems very good. With the two lenses that it comes with we have looked at ships and airplanes from about 10-15 miles. We have also used it to look at the Moon, Jupiter and its 4 brightest moons, as well as Saturn and its rings.",
        "Great starter telescope for the price. Once I start learning all the constellations​ and where they are/should be, I'll probably upgrade.",
        "This is a good telescope for beginners. Do not expect to see many planets and galaxies with it though lol. You can see great views of the moon. You can also see Saturn and Jupiter (however both of those will be tiny if in focus).",
        "One of the lense broke when I got the package",
        "I am giving these 3 stars purely due to the Tripod stand that I received. Unable to keep the focus in place and keeps on shaking and moving from the target. If you intend to buy these telescope, do check for other type of Tripod Stand.",
        "my husband & son cannot figure out how to use it even with the instructions.",
        "I purchased the celestron 21063 for my husband as a Christmas gift. It was easy to assemble and on the first clear night we were able to view several constellations and planets. Great for the beginner backyard astronomer.",
        "It came with minor details like it was slightly used. It does not have the best tripod.",
        "Telescope itself is decent by the AZ mount simply doesn't hold the telescope in place. What a pity.",
        "This is an excellent telescope for the beginner or amatuer who wants a good quality scope. Much better resolution than the typical department store scopes. The guides used with it are very helpful for stargazing. Also fun to view distant targets on the ground.",
        "I bought it for a Christmas gift. It was a big hit, my son loves it.",
        "Searching the sky for celestrial object in our solar system",
        "Very good quality, meets all that it described. A great start for anyone starting out in astronomy. Arrived in good condition in the time stated.",
        "This was a gift for my wife who is extremely pleased with the telescope. It replaces and surpasses another telescope. She has used it to introduce our grandson to astronomy. I was impressed with the price comparing it to shops in our vicinity that were charging quite a bit more.",
        "Fantastic to me, I can see SAturn, the moon and the last night I can see the ISS (it was a challenge but I can do it).",
        "I bought this for my kids for christmas. I didn't want a cheap one so I went with a middle of the road model. We love it! The first night we had it out only took us a couple of tries and we were looking at the moon! My son and husband were able to find some stars. We bought some books to go along and we will start using those to see more in the sky! We are very happy with this telescope. We are beginners just to let you know.",
        "This is my first telescope and was expecting spend all day to put all items together. But finished everything in 15 min. Now can enjoy the night sky. Recommend for everyone.",
        "With the exception that the tripod mount for the telescope was a little unstable.... if the telescope is touched even lightly the field of view is changes... this was a very goot puchase.",
        "The optics on this scope are very good, as are the eyepieces provided, but the AZ tripod's mount is not sturdy enough. The mount needs slow motion controls for both altitude and azimuth. I would buy the EQ mounted 90mm Astromaster refractor over the AZ mount, but even then, the OTA will probably be undermounted, as this is a long tube of 1000mm length. The finderscope is not good either. In fact, it is useless...I will be buying the CG-4 tripod and mount from Celestron, which will provide a stable platform for this OTA. One good thing about the tripod is that it does have steel legs, but the mount is the problem here...",
        "I've owned it for a few months now and I've been able to see some amazing things. Stars, birds, the moon — it's an amazing little telescope that does a fantastic job.",
        "The plastic pieces attached to the eyepiece and body are extremely cheap and fastened by little screws. It came worn out of the box and won't screw tightly enough.",
        "For the price and the size, I don't think this telescope delivers what is expected. The star pointer is incomprehensible. The motion of adjusting the telescope's view is not smooth. You must over adjust to get the telescope to return to the view you want. I was not impressed with the magnification. Viewing the moon, planets or items on land were not as I hoped.",
        "We are having a hard time getting it to focus correctly. There is definitely a learning curve.",
        "I like it but I wish I'd bought a more powerful one and one that would just program to a planet or star. I'm a beginner and just want to look at celestial stuff. Spend the money on better scopes with more abilities.",
        "Satisfied with product. Item came in as described. All parts included. A good bang for your buck. It gets the job done.",
        "use all time. love it when my grandson says he uses it all the time. Great pass time for him",
        "i havent used it but i look good, if u want a cheap and good telescope this is ur option",
        "Unless you want to use this for a beach house looking at the ocean, I would strongly recommend against it. It is IMPOSSIBLE to find anything in the night sky with this type of mount. I returned and bought a telescope with an equatorial mount. MUCH better.",
        "I don't like this one that much, top reasons: size too big, moon watching too bright without filter, yet to find Saturn. Pros: easy to use.",
        "I do not know if this is being used or not. I will check with my grandson on this and see if he likes it.",
        "This was a gift. It ended up being way to large and too strong for beginners. When they tried to exchange it, they were informed that the 14-day return period had expired. (We were unaware of this policy.) When my daughter-in-law asked what their options were, the answer was \"keep it.\" Now they are stuck with a telescope that is too large.",
        "the optic lens are NOT clear. after hours of getting the focus I realized this is a piece of junk",
        "Sorry but this one didn't make the grade for us, we did return it as it wasn't exactly as described..The good news is Amazon is great to deal with even on returns",
        "I wanted to thank Amazon for the assistance they provided with my purchase. Originally it got linked to a 3rd party and was backordered and I wasn't notified. I called Amazon - they walked me through the steps I needed to do -- within TWO days I received my refund and the order I placed on Thursday was received Friday. The other company gave me headaches for almost an entire month. We haven't been able to use the telescope very much yet - foggy skies - but look forward to learning more about it ! THANK YOU AMAZON !!"
    ]
}