{
    "entity": "Floor Fans",
    "text": [
        "Poorest quality fan I have ever bought. The box was hardly shut so dirt and debris were able to enter the package during shipping. Once I opened the box I immediately noticed chunks of the plastic around the top of the fan were missing and nowhere to be found within the box. The fan's power was very underwhelming. I quickly returned it and got a different Lasko fan called the \"Cyclone\" of much higher quality. It even included a remote and timer! Highly recommend their Cyclone as opposed to this fan. For only $10 more, the difference in quality is incredible. Their Wind Machine should be taken off the market.",
        "If you’re searching for the perfect fan that moves air and provides the white noise of a whirring fan without the obnoxious hum of a motor look no further! I’ve slept like a baby since buying this. We also use the Dohm white noise machine which sits next to bed, and that provides white noise but wasn’t making enough noise to fill the room and block out noise outside of bedroom. (Like that of a noisy teenager!) so we added fan and it’s perfrct!",
        "I am extremely frugal (tight budget) and almost bought another traditional box fan at around 20 bucks. It was hard for me to spend double what I planned to take a risk and purchase this fan, but I am happy to write that it was worth every extra penny. This thing moves air! If you are like me and reading reviews, comparing, wondering if you should consider this or stick with a box fan... buy this one and smile... you will be as pleased with your purchase as I am.",
        "This fan really moves the air. To give you an idea how good this fan works, do you know those 20\" box fans they sell for 15 or 20 bucks, well this Lasko 3300 fan on low blows as hard as the 20\" box fan on high. No kidding. I think this is by far the best fan I've ever owned. Will post a couple pictures for you to get a better look at it. I would recommend this to anyone in need of a fan. Don't hesitate, buy it.",
        "Great fan! Hugh increase in volume compared to the old box fan. Worked last season flawlessly. Plugged in last week and nothing, no buzz, hum, nothing. I had stored this indoors after cleaning it over the winter. The boss (wife) called Lasko and explained the problem. The fan was getting power down to the switch and when rotating the switch on, there was power going to the motor. So, I don't know what happened? We were 2 months outside the warranty and Lasko sent a new fan which arrived in 5 days. No hassle, great service!",
        "This is the second Lasko fan I have tried. The first one was the $25 box fan. That came cracked and made a loud clicking noise every time the blade spun around. I figured I would give them one more chance and order a better model, but it too is made very poorly. It makes a loud grinding noise unless I tilt the fan aiming almost completely up. Do not waste your money on this very cheaply made product. Bite the bullet and order one of the all metal fans (and probably not a Lasko). At least this one didn't arrive cracked.",
        "Though new out of the box and apparently undamaged, the fan barely functioned. The fan blade rattles and vibrates and barely moves any air. I have to bang on it repeatedly to get it to spin freely and move the air, which it only does for a while. Then it goes back to vibrating. Something is wrong with the bearings on the blade or the motor I guess. Could I open it and tinker around and fix it? Maybe, but why should I? Their poor quality control is not worth my time. Returned it for a refund.",
        "This fan arrives already set up . You just take it out of the box , plug it in and turn it to one or the three speeds. It circulates air so well that we don't need an air conditioner in the TV room. Love it!",
        "This fan is poorly made. We use a fan while we sleep. So approximately 7 hours a day. With in a month the blade came loose, nearly falling off. I took it apart to see what was happening only to find that it is just very poor craftsmanship. i had a lasko fan before this and absolutely loved it. It lasted for nearly 7 years. I’m sad to see laskos quality has significantly decreased! I do not recommend buying this product!",
        "It does not get much worse than this. Take a nearly all plastic design, literally throw it together, with very little quality control, and Viola! You have a loud and rattly fan. We tried two of these and they both had similar issues. Even at low speed this is just too noisy.",
        "Makes a horrible noise at all speeds unless I point it downward. It seems out of balance and just rattles, shakes, and makes a scraping noise. Possibly powered by cicadas.",
        "I've had the Wind Tunnel, also by Lasko, for YEARS, and I ran it almost 24/7. Over probably 10 years I only had to replace the fan once. But it has gotten very expensive, so I tried this one. It seems just the same except for no remote or timer, and I used neither anyway. I need some white noise and a strong wind as I am hot natured, and this has them both. If you want those \"whisper quiet\" fans, this is probably not for you except it is pretty quiet on low, which I never use. Highly recommend this fan if you're like me and like some noise to cover up nighttime sounds and help you sleep!",
        "Despite other reviews this fan is not better than a dollar store fan. In fact it’s not as good as the 3 other $20 fans I have.. “Wind machine “ is not an accurate description.",
        "Brought one and returned it when the house started to fill up with a strong chemical (grease? burnt plastic?) smell that hurt my upper chest. Exchanged for a second one - same thing. Returned both. Won't buy another Lasko. However both were really quiet, really good at distributing the air well and very easy to maneuver to the area you want to ventilate. Also the plastic makes them incredibly light and easy to move around",
        "As soon as I pulled this out of the box, it was evident that I received a used model. There were nicks and cuts, smudges and dirty spots all over it. The bent plug should have been a pretty good indicator as well. I am a \"fan\" (no pun intended) of Lasko floor fans and I am sure this one would have suited our needs perfectly, but with as often as we use them, I would have liked to started with a new, fresh model in order to get as many years from it as possible.",
        "some people can't sleep with noise, and I can't sleep without a super fan like this one, yea the highest setting is loud but this thing is the best performing fan I've ever bought, i have 3 of these in my house. For summer, it definitely pushes lots of air, and for people who sleep with fans, this is the one. Just be careful if you sleep with it on high like me, you might not hear your alarm clock lmao",
        "The only fan I use in my bedroom ! I have always used fans at night to sleep . This one is a powerful fan to keep air circulating (I like my room to be cold as well) and the noise is minimal. More powerful than a box or fan on a stand My fan just broke after many years and I came right to amazon and ordered another . Those two nights with out it were miserable . It’s also easy to take apart to clean . My children use them except one who likes their bedroom warmer . They say it makes their room too cold because it if definitely a wind machine .",
        "Really impressed with this fan...excuse me, wind machine. It's large, but fits in on a window ledge perfectly. The main reason I got it was for the noise reviews. I really wanted a fan that would keep my bedroom cool, and also provide some good white noise to sleep too. The fan is excellent on both counts! It's mostly plastic parts, so no rattling/metal vibration sounds. Would purchase again.",
        "Love this fan. Seller got it to us quickly and man o' man it moves the air. I don't even mind that it hums a bit loud, I wanted something to help disperse the cool air from a portable AC unit, in this 112 degree Texas heat, and this tough guy does the job. 3 speeds and the fan can be tilted to aim the airflow where you need it. Liked the first one so much I bought 2 more. Extremely pleased with this Lasko product. Have purchased similar products and they just didn't last.",
        "Disappointed, the blades were unbalanced. Very loud at all speeds -- so much for a quality check after assembly. The fan does move plenty of air. Too much trouble to return, gave it away to a friend to use in their barn - the horses have yet to complain.",
        "Let me start by saying i had a vintage\"ish\" 90's version and it was a beast!!!! Loved it!!!!!! So i purposely order the same one with high hopes of the similar quality. All plastic and it puts out half the air power as the older version. Very cheap and low quality.",
        "I have to have a fan on at night so it runs every night from 11:00 pm to 8 am. So far it has held up. The tilt is still tight and the different controls still work. The only thing that I deducted a star for is the noise. The fan is making a noise that it shouldn't be doing. On the upper speed it is very noticeable. It's no problem for me because I always use the lower speed. I'm sure I'll buy another one whenever this one gives out because of the price.",
        "Brillliant. I bought this along with a similar one here on Amazon. It replaced a metal Workforce fan I bought at Home Depot a few years ago. I love that these are made from plastic and they are made in America. This is lightweight, uses less wattage than those three-prong plug metal fans, and it moves as much air. It helps circulate the cool air from my air conditioner and spreads the cool all over my apartment. It's also quieter than a metal fan and very sturdy and doesn't tip over if you bump it like the metal fans do. I highly recommend this.",
        "Oh yeah, this is the one you want to cut thru the humidity. The sound it creates I do not find annoying. Most of the time im unaware of it. To me it sounds like the wind sounds at the beach with the waves coming to meet the shore. A very good product. Thanks. My cat cara walked around it trying to figure out how it could serve her. And she figured it out. She lays behind it and gets the first air being pulled into it. Cats astound me how it's all about them. Wonderful....",
        "I have purchased Lasko fans and space heaters for years, Made in America and long life dependable products. Due to extreme heat this summer I needed a heavy duty fan, Lasko, came through again with the Wind Machine. It is noisy due to the fact that it is a heavy duty fan, although the fan is not heavy. The noise does not bother me as I preferr to read rather than watch TV. Place a heaping bowl of ice in front of this fan and your entire room will be chilled down in no time. After I send off this product review, I going to order another one for upstairs!",
        "Love it, it’s very powerful. I love the price also. I LOVE THAT THE PRICE JUST JUMPED UP $10.00. Wow! Update: The one that I bought was $28, when I went online to buy a second one it jumped up by $10.00. So I started looking around didn’t find one cheaper, so I came back on to look at it tonight to order another one and now it’s up to $50. I don’t understand, that’s a HUGE price jump. I absolutely won’t buy another one simply for that reason.",
        "I purchased two of these fans to circulate the cool air from our window a/c units. The fan cools off the upstairs of my house which usually gets really hot in the summertime and this fan pushes the cool air from the first floor up the stairs to the second floor and has cooled it down a lot. We also have one in front of our bedroom door to push the cool air that is in our bedroom out into our kitchen and it has helped to keep our kitchen a lot cooler on the hot and humid days.",
        "This is the second time I bought this fan and had the same problem. The knob on the back gets loose almost immediately. It has now come off completely less than 2 months after I received it. Now I cannot turn the knob to turn it on or off or adjust the speed. Disappointing because it is a really good fan other than that.",
        "We run these fans a lot so we've had a few over the years. They blow a lot of air for not too much money. I've had noisier fans that don't blow as much but you can hear it. There isn't a rattle. They run in the garage all summer long and we take them camping to blow the mosquitoes off of us. I got mine on an Amazon Prime day and the price cannot be beat so we're real happy to have a fresh supply.",
        "This is a floor fan for my front window and has 3 speeds:Blow, go time, and Whoa. I wish the lowest setting were quieter and would accept less airflow as a result, but that is not what this is for. If you want to dry large floors it'd take you no time at all with this. If you are looking to move air through the house it is lightweight to stand on a rickety card table. I'm not unhappy other than its not quieter, but I am ready to eat my words come Summer.",
        "Worked for a few months. Then died in the middle of the night. Then I noticed the writing on the tag attached to the cord, which says, essentially, \"Hey dummy who bought this: There's a fuse in the plug (insert cool \"Safety-Bust Technology\" or whatever they call it) that goes out whenever the junk motor creates a slight jump in current. No, you can't replace the fuse. Throw this fan out and we'll happily send you another!\" I decided to get another fan, just as they recommended. From Vornado, which is a stellar company that makes quality fans with—oh yeah!—replaceable fuses.",
        "This fan worked well while it worked, I’ve had it just over a year and it seems to have burned out. While it was working it was easy to move around the house and it is a high powered fan, I didn’t even need my AC most of the hottest days in summer. It is loud but as stated it has burned out in just a years time. I purchased it on 6/28/2019 today is 8/21/2020 and the fan seems to have died. It started making a loud noise with a burning smell before it completely stopped working. I spent $40 purchasing directly from amazon so I’m a little Disappointed that this didn’t last longer",
        "Level 3, you can not sleep with vibration sound and mechanical sound. It is actually shaking. The box was broken and crushed so much that the contents could be seen in a miserable state. Scratches and equipment gaps, miscellaneous making. \"White\" completely different from the guide picture. The way of cutting all the plastics is also miscellaneous. This place is not a factory, here’s my home, it becomes an obstacle to the interior. Do work that matches more price, transportation can not trust USPS. terrible!!!!! I’m decided return this Item.",
        "This is my 2nd Wind Machine. first one lasted 5 years. this one only lasted 13 months with very limited use. the new ones seem to be poorly made, and no customer service available. after posting this initial review, I heard from Laasko customer service who said they would replace it even after warranty expired. much happier, we will see how #3 holds up",
        "Powerful breeze for this 20\" Fan. The housing and controls are all made of plastic. However, it appears to be a stable, powerful Fan. We are using it outdoors on our screened porch as there is not much breeze there. We like that the fan can be tilted up or down to blow comfortable air where we want it. It blows a very quiet, comfortable air on the low setting. I gave it 4 stars since it is a fan, and some noise is expected. We Ordered this on a Thursday, but it did not arrive until Monday although we were assured one-day​ shipping.",
        "Great fan with a lot of power. I have two of these Wind Machines and can attest to their efficiency, quality, relatively quiet operation, and sturdy base. For the price, it is hard to beat these Lasko Wind Machines. I have one that is two years old and runs for six months of the year day and night with no problems. Fan is easy to clean. I got my last one in two days. This fan can easily cool well over 300 square feet of my condo and I have 12' ceilings.",
        "This has been running 24/7 now, except for about 5 minutes when I moved its location. It is a very quiet fan (as most of the newer models are), though I actually miss the white-noise generated by the older fans. This pushes a lot of air, and I've been happy so far with its performance. Honestly, though, I have no idea if it will last (I've recently had two HW fans die at around 14 to 18 months, so I'm trying this Lasko brand instead).",
        "I'd give this TEN stars if I could!!! They aren't kidding with calling this a 'wind machine' vs a regular fan. This puppy moves some serious air!!! My first one got lost in the shuffle of moving and HAD to replace it :) This is better than any standing fan - buy it and be amazed!!!!",
        "The only problem is because of asking the 'community'. One reply said it rotates 360 degrees. it does not. It rotates 180. Whomever replied to that question was incorrect. ~~~~ UPDATE~~~~ I have a very high ceiling, this building was built in the 1800's. I use this to circulate heat from baseboard electric heaters. It's better than a ceiling fan, my heat goes on in 1/2 the time by using it to blow the heat downward. Without doubt this is saving much electric usage.",
        "I bought this to use outside when it's really hot as well as to help blow the bugs away. This thing has helped make sitting outside during the hottest months bearable. It has three speed settings and it's very light and easy to move around. We're now even using it to circulate air inside the house when needed. It's at a normal fan noise level but it's also a consistent soft noise that's not bothersome at all to anyone. It is well worth the price I paid.",
        "Package arrived partially opened (one of the top flaps exposed). There were two scuff marks on the top of the product itself. My guess is that the package had been open long before it was left on my doorstep. The fan itself is of cheap construction. You can see unfinished bits from the blow molding process that formed the plastic components. You get what you pay for, I suppose. I'm happy with the airflow, but pretty mediocre product overall.",
        "This is the cheapest fan you could possibly buy. It replaced another Wind Tunnel Machine that gave up the ghost after years of service. This just is nowhere near the quality of the old fan. Clunky, chunky, and no longer fits in our window because it’s pivot points are so wide. The cheap rotary button axillary to the fan is vague in it’s pointing at the correct speed you want. It’s loud. It’s big plastic components probably block the most efficient air movement possible. It has a short cord to it. So disappointing. It does fan air though.",
        "It produces a good amount of air flow but that’s really the only positive. It’s light. Too light as it’s made of cheap plastic that isn’t even well put together. Within 30 minutes of running (on low or medium) it added an almost thwump type sound. Then it became a nice buzz. Not sturdy at all. Not particularly quiet to begin with but with the annoying additional sounds (how long til it just plain falls apart - not long from the sound and feel) it’s going back. Bummed because Lasko- including this one - fans are generally well rated. I’ve had $20 fans that are sturdier.",
        "Pension really move air and it doesn’t sound that bad. The only two problems I really don’t like with it is that the two locks on the side to tighten the fan into a certain direction would loosen up on their own lots of the fan usually turns back to its original vertical position and that when you turn it on with the knob it’s starts on the highest setting all the way to the lowest we have to cycle through all of them to get to the lower setting",
        "This thing can move lots of air and isn't too loud. It has a handle making it easy to move around. One criticism is that sometimes the fan can have an odd scraping sound. It's not loud but it's noticeable when it's quiet. But this is a lot better than the loud rattling of traditional box fans.",
        "Soy family opened a gym and on opening day we in packaged these fans. One did not work it did not even turn on so I don’t know if it was electrical. Very stressful and disappointing as some clients were complaint of heat. We had to go buy another fan, because of this one being a complete loss! Very disappointing will not buy nor tell people anything positive about this transaction. Items should be tested!!",
        "I’ve had several of these over the years and currently have 2 in my house. The air flow is really strong and feels great, and circulates the air wonderfully. It also provides a really nice ambiant white noise, which is the reason I bought it. I literally can’t sleep without it running now. It helps me sleep soundly without paying attention to small noises. I got one from the same seller before that had a defect (made a loud and obnoxious buzzing noise), but the product was replaced promptly and I was very happy with my purchase.",
        "For the price I was expecting much more air flow. I think the 20\" box fans out out the same, maybe more air than this. For double the price, can't say it's worth it. The only reason I didn't but the 20$ common box fan is because they always splat over. You know what I mean.... I don't see that being a problem with this, but not worth 40$. I think it would be a nice white noise for sleeping. I would probably buy 2 box fans instead of this.",
        "It gets the job done. However its loud and there was no remote control included. Shipping date was unclear and seller has not replied with any specific feedback on whether they can replaced a knob I requested on a fan previously purchased. They just keep disregarding my questions and saying they’ll get back to me. This has been going on for about two weeks. Box was not half opened when receiving it and still says it’s in route.",
        "Okay, so it asked me to rate for noise level. I marked it high, because I LIKE the white noise. If you want a quiet fan, this isn't the one for you. On the lowest level it isn't very loud, but when we sleep we crank it up on high, and it really blows! High is high enough to ruffle the blankets on the bed 5 ft away. It's absolutely brilliant!! Vendor delivered in a timely fashion and in good condition.",
        "Good fan for the money. Moves a lot of air, lightweight, easy to move. Good for circulating in a living room or patio room etc. Loud though. Too loud to have in my bedroom. I like the vornado 6600 even more, moves more air and is quieter and seems heavier, so probably longer lasting, but costs 3 times is much. If you have the money, I would by the vornado. If budget is a concern, this is a solid choice, IMO.",
        "I’ve had it for about a week with no issues. I wish it had a remote but I do like that when you move the fans setting or position, it doesn’t click or have that ticking noise. Also I don’t like the fact the output setting is a small knob on the back of the fan, so if you’re not in as length of the fan, you have to move the fan around to turn it up or down. (Just a small pet peeve of mine) Other than that this fan is good quality for the price it is listed. If a problem arises I will update",
        "It's quiet and adjust positions wonderfully but I was expecting better from a fan called a \"wind machine\". If your goal is to have a quiet fan, this is the one for you. If you are looking for air circulation, not so much. You can get a cheap box fan that circulates better than this.",
        "This is the only large fan I like. When ours stopped working, I ordered the same one. It would probably last longer if you bothered to clean it, but even without doing so it lasted probably 5+ years. Provides the background noise I need and keeps me cool. Very dependable fan.",
        "Excellent fan well worth every penny. Wish I bought much earlier on rather then other type of fans that eventually broke and did not work as well; would have saved myself a lot of money. This fan is very durable, strong air flow, quiet, lightweight and what I love most is adjustable to help circulate air flow cooling rooms even on those hot days. Highly recommend.",
        "Really very quiet on low. Several people have remarked on how quiet it is. No distraction during TV or conversations at all. Very pleased.",
        "Yes it is a bit noisy but it's no big deal because this fan really brings on the cool air. Right out of the box, I plugged it in and immediately it worked beautifully. One of the rating questions was regarding a remote control which there is none. I probably would not use it anyway. Shipping was FANTASTIC, I received fan in less than 48 hours. Impressive during this Covid-19 slowdown. I strongly recommend this fan.",
        "As stated in the headline, the control knob for this fan comes off too easily. When adjusting the fan speed it takes almost no effort to accidentally turn the knob the wrong way or too far which results in the knob no longer being able to control the fan's speed or coming off completely. When this happens, its easy enough to pop the knob back on but its annoying nonetheless. I purchased this fan for background white noise and it serves its purpose well for that need.",
        "A bit loud when set at the highest level. The fan is powerful that we only needed to set it at the lowest level. Well constructed, would recommend.",
        "This fan packs quite the punch. Sure it makes noise, but not as much as I'd expect given the amount of wind it blows. The dial is a bit flimsy and skips levels if you don't push it down as you turn. The fan tilts, but it you tilt is at a high angle it slowly drops as it blows. Not a huge deal to readjust, but it is a bit annoying. Great deal for the price paid though.",
        "I have another fan like this and it's upstairs. We have air but I like the feel of a fan on me and this one does not disappoint. It's wonderful it's got 3 good levels and I always have it on high b/c I like being comfortable. Today I took it into the den while I ironed. It was wonderful. I may buy another one next year. If you want a fan with some oomph, forget the box fans. This one beats them all.",
        "This is the third Lasko fan of similar size and design that I've owned. They usually last about 5-6 years. This one is a little lighter than its predecessors which may seem like a benefit but it might also indicate less durable parts. Not sure... I will have to wait and see. Adjusts like a nodding head, so you can place it on the floor and blow air upwards if needed. Three speeds.",
        "After 10 days without AC post-hurricane, my mood was deteriorating rapidly. It was 90-degrees in every room and my 9-inch fans weren't making any difference. This fan just arrived and it's a beast. The AC is working again, but with the fan's help I can probably use less of it to lower the electric bill. This fan will be well-used outside (to blow those blasted 2-pound mosquitoes away) and out in the garage where Carolina people sometimes drown in their own sweat. I've read reviews that say this fan is too noisy, but it's unobtrusive white noise to me. And for something that moves this much air, it's not bad at all. Handsome devil, too.",
        "It can be tilted in the base unlike those unstable box fans and is more powerful than typical box fans. I bought this to replace an old one of the same that I wore out over several years and finally broke by accidentally crushing it under a portable table saw. Over the years I've had numerous fans and this is the best of them all. It's also reasonably quiet considering how powerful it is.",
        "I think this is the best fan out there. You can tilt it to get air exactly where you want it, and it has different speeds. I recommend it to everyone who uses a fan. This is not my first Wind Machine. This was a replacement for my old one that I have had so many years that I don't remember when I bought it. This is the only fan that I will buy from now on.",
        "I actually bought this fan for the white noise and it does a good job at that. It is surprisingly efficient!! In fact it blows so much air so powerfully that I turn it toward the ceiling to get the direct airflow out of my walking path, which is a great feature. The only thing that would be a nice change is where the on/off/power level knob is located. It’s on the back of the fan near the middle. If it were located on the top or side I could keep the fan pointed upward instead of having to change the direction of it in order to turn it off and off each time.",
        "Rated product as 3 star because it's made of cheap plastic, there are numerous gaps where parts should fit snuggly, and it has only three speeds-- low, medium, and high. Does not include remote so if you want to change speeds you have to call your kid to change it or get up and change it yourself. Fan does circulates air well without a lot of noise. Hoping it will hold up through at least one long, hot Texas summer. Would not recommend if you're looking for a fan that will last.",
        "Southern CA gets pretty hot in the summer and I needed something to cool my room. The product arrived on time, and was easy to setup. It runs like a charm and seems powerful. Adequate for my work space. It is not as quite as a tower fan but not loud in anyway. I plan play music from the laptop or be listening to things and the fan noise does not drown out the music or audio in any way. Happy with my purchase!",
        "I have had wind machines for 9 years, I just replace one after 9 years,and bought a back up., The old one just stopped working, I did use it a lot, I got my monies worth out of it. The new fans I just opened and plugged them in, they are half the velocity of my old 9 year old fan. Yes its exactly the same fan. Low on the old one, is high on the new one. Your company ruined and really good machine, what did you save 30 cents in production, I brought last year or I would return this inferior product.",
        "Proving to be a useful fan. I'm a fan of this fan. Reasonably quiet and windy. For us, it's a great buy.",
        "Bought this after having had a leak in my apartment. Maintenance left one of the industrial blower fans in my apartment for weeks and I loved the noise it made because it drowned out all other ambient noise including snoring from the other room, and I slept like a rock. I looked for one but they're huge and outrageously expensive, but reviews of this fan said it is loud on the high setting so I bought it. I was not disappointed. I can sleep happily with it on medium or high. It moves air well, is light weight, and love that it pivots.",
        "This fan does an excellent job. We have been using it since we got it with no problems. It is certainly worth the money. It is light weight and has an adjustable setting. It is very quiet at the lowest setting, but makes more noise of course at the higher setting. I actually do not like the noise so usually have it set on the lowest setting.",
        "Wow wow wow. What can I saw I didn’t realize how big 20’ actually is until I put the fan in my room. This fan is the best thing I have ever purchased. Living with a roommate who doesn’t believe in AC can be pretty tough and while baby sitting puppies is fun and all but they can be pretty loud at the worst times, like, when you’re going to sleep. So I needed to be cold with a comfortable sound to help distract me from everything else in the house and it works! I slept for the first time comfortably in months. I highly recommend this fan.",
        "White noise, that’s what I wanted. I used box fans for years but they’re beyond cheaply made any more. I have good AC so don’t need the cooling effects from a fan. If you do though, this will be great. The noise it makes is purely from it pushing air. No mechanical noise at all. Looks solid so should last a lot longer than the box fans, may they Rest In Peace.",
        "I received a broken fan. The fan did work so I kept it. I can’t wait to get another because I feel the weather may change drastically in the next two weeks",
        "Got a window unit that you wish would cool the entire apartment instead of a room? These are your answer. Or just need that air flow to keep cool? Yep these will do it. Holding off putting the ac in until it hits a steady 85+ without dropping below 60s at night. I have a feeling I will need to not turn the ac down as low with these babies.",
        "This fan was $40. I expected to get a ton of air. Not much more than a regular fan. Very expensive and not worth the price. After about 3 days the strength of the air was just a regular fan. Would never buy it again.",
        "You want to buy a fan, what you get is a WIND MACHINE. They aren’t kidding about the name of this thing!!! The wind generated by this machine is both forceful and constant, which not being overpowering or noisy. It’s no hurricane force wind, but the noise a hurricane machine would make is something I dare not imagine. I was just looking to cool off a medium sized area and I think this machine generates the right amount of wind for the job.",
        "My fan arrived with a damaged box and a chunk of plastic missing from the back. Unfortunately, despite repeated attempts to contact customer service to remedy the issue, I haven't heard anything back. I even called the support number in the manual. Overall the fan is functional, very powerful, and pretty loud. But the quality is subpar, obviously, the plastic isn't durable. If you're looking for a safe fan without any issues, I wouldn't buy this one. Invest in a fan with better reviews for customer service. With a product like this, it can be dangerous to use the fan anyways (little fingers etc.) so it's a big waste of money.",
        "I got this over this last summer (2018). It's been in operation ever since (I live in Florida). It is quiet and easy to operate. It is light weight so it's easy to move around, but it is very powerful; I usually have it on low except in the late afternoon when it is extra warm; then I turn it up. This seems to be a very reliable product and so far I can recommend it. (Also, it is reasonably priced which helps.)",
        "I wanted the fan for a little air movement and white noise in the bedroom. Way too loud on Level 3 and level 2 in my opinion level one is easily two times louder than any box fan I've ever used before. It does move air nicely but again way too loud to be anywhere near a TV and or conversation type room or area.",
        "I still like it for the angling and it's more powerful than a normal box fan, but this current model's high power is closer to the old model's low power.",
        "Love this lightweight powerhouse of a fan. I have 3 and two have lasted over 8 years. I run them every night all year round for white noise, and day and night in the hot, humid Michigan summers. Have tried others and they don't compare. This is a powerful air blower! It's like a wind tunnel in here and I love it! Peace",
        "I have purchased box fans, window fans, pedestal fans and nothing works as well as my Lasko fans. The fans are amazing and are made in the USA. Buying from this company is a win win for the consumer. Also, reasonably priced for this workhorse fan. Thewhite noise level can be adjusted by changing the fan speed.",
        "I use this fan for both air circulation and to add some white noise when sleeping. This is not a quiet fan, so i wouldn't recommend it if you're looking for something you can't hear. I bought it specifically for the noise. It's easy to move around and on the low setting you are getting a good, strong breeze. I sleep like a baby with this thing!",
        "I searched \"large battery operated fan\" for direct delivery to Puerto Rico after the devastation of Hurricane Maria. I was given the option to purchase the batteries at the same time, so I did. Due to the situation over there, communication has been limited. My mother informed me that this is NOT battery operated. She's had no benefit. What a waste of hard earned $$$.",
        "I use fans 24/7 365 days a year. I dont care how cold it is, I need the fan blowing. In the last 2 years, I’ve gone through 4 fans. My cousin told me about this brand, so I splurged and got one. This fan is amazing. Reminds me of my dad’s large shop fans. It’s bulky, but sturdy and actually cools off a room. It’s lasted longer than 2 of my previous fans so far, so I’m ecstatic.",
        "I need a fan for white noise while sleeping, so this fits the bill and we needed a replacement for an old, box fan. This has three settings as well as a pivoting head to adjust the angle. In terms of noise level, I'd say it's average, and doesn't make any random clicks that a standing fan would make. Highly recommend.",
        "This fan looked big in the box at 1st but once i took it out it was perfect size. It moves up and down so smoothly and isnt heavy at all. I use it for personal use not for drying paint and i think it does a great job! Not too loud and sometimes the lowest setting is a bit strong for me but its great on hot summer days.",
        "When I first got this fan I loved it. A tad on the noisy side, but I wanted a fan noise to sleep to. This fan moved a ton of air on high and would lower the ambient temp of my Texas room a smidge when used to channel AC from other areas of the house. Now it lasted two years, and at $40 bucks I would say I don't feel robbed. I am however an old school Texan who values longevity in my purchases. So a dead motor after two years won't cut it for me.",
        "These are good fans but they only last about 9,000 hours. That's about a year if you ran it 24/7. A relative has a similar fan, but metal, bought in 1955. It's still going strong.",
        "Have had 2 of these fans for just over a year. One was never taken out of the box until just the other day. When opening it from the box the rear of the plastic surrounding the blades was in pieces. The vents broke away from the body of the fan. Today I took a closer look at the first one I opened and the same thing has happened. Do not buy these fans as the plastic body is inferior and will break making them unusable. I can only believe that temps in the area where one was used for a short period of time caused this breakage. They are unusable.",
        "The fan works pretty good, it is louder than my other Lasko fan. It only has 3 speeds, my other Lasko has 4. And the controls are on the back of the motor, which doesn’t make it easy to get to when the fan is in the widow. It would be nice the have the controls on top of the fan like other models. Over all this is a good fan, but I wouldn’t buy it again just because of the speed controls being on the back.",
        "Thought I understand that moving air comes at the cost of being louder. Would have been nice to have a setting that is a bit quieter than the options that it gives, since it does get fairly loud to be constantly on while sleeping, though it is \"white noise\" so it's not a huge issue. I'm giving it 4 stars because it does move air very well, what its supposed to do.",
        "This is a great fan but I underestimated its strength when it practically blew my cat off the bed LOL but honestly I can't afford to pay half of what I paid for it to start with to mail it back I think that is wrong especially for a Prime customer that spends most of my income on Amazon",
        "Love prime!!! My box fan sparked and blew up. Ordered this late Thursday got it early Sat morning!!! My box fan was noisier so I'm not sure why reviews are saying its loud. Its perfect and I can point it up, down, in between! For the price and function it can't be beat. Get you one...or two...or.......",
        "This fan works great, except for one minor issue. Power is controlled via a turn knob (back of fan). I would have expected the switch to go \"Off -> Low -> Med -> High.\" Instead, the switch goes \"Off -> High -> Med -> Low\" Excellent fan otherwise.",
        "I've had 3 burn out and customer service was no help",
        "It's noisier than another one we have but still better than the metal fan we have that sounds like an aircraft taxiing down the runaway.",
        "Please purchase this windmill aka fan it delivers the most delishes hearty zephyr like blast you ever find and with the temperature growing steadily humid, toxic and fiery in the pseudo summer you will kick yourself for not purchasing it sooner. You will never go wrong with this investment, in addition, to it saving you money on Air Conditioning."
    ]
}