{
    "entity": "Floor Fans",
    "text": [
        "This fan blows!! Literally, it is great!! We have a couple other box fans that do not blow half the amount of air on the “high” setting as this does on the “low” setting. Even though it is loud it outs out a fantastic amiunt of air! Huband says it sounds like a small plane!",
        "We bought this fan for use in stables. In one of these, the owner required a 3-prong plug for fire safety. While deeper, heavier, and more costly than standard box fans, it performs extremely well, puts out very high volumes of air. Worth the price for more demanding applications.",
        "I was happy it arrived so soon. Then, checking it out, I found I was cheated. The specifications I bought from had an eight foot cord, two electrical outlets, permanently lubricated bearings, quiet running, weight 12.8 pounds. The fan only weighs 9.4 pounds, is noisy as hell, has a six foot cord and no outlets, and I doubt very much it has the bearings they claimed were permanently lubricated. The only permanently lubricated bearings are sealed ball bearing type.",
        "The lowest setting is too high on this fan. Even on the lowest setting, the fan is loud. On the highest setting, the fan moves a lot of air. The build quality seems very good and it has a deep frame We had to return it but would have kept it if it had a lower speed.",
        "A-holes put the power cord under the handle probably to save on shipping. Its Impossible to get out. Took over 20min trying to get it out without any success.. Finally said F it! and returned it! Who ever thought it was a good idea to put the power cord under the handle should be fired. Fans need to be plug and play!",
        "The cover on the fan is defective. One of the screws doesn't align with the whole and it can't be secured. The cord is wrapped through the handle and can't be removed so it can't be plugged it. It is totally unusable. In addition, to return it I need to be able to print a shipping label and I have no access to a printer so the UPS store wouldn't take it. I just paid over $50 for a huge hassle. And I have no fan.",
        "Loud. So loud I can’t leave it on anywhere in the house at night. I bought this fan for that purpose so I’m disappointed. It’s great when you don’t care about the howl and moves a lot of air but even on the lowest setting it is overwhelming to try and read in the same room as it. The high setting is like being near an airplane.",
        "Pros - great blowing power and sits stably (vs the $20 Lasko/Walmart, which aren't that powerful and also tend to travel backwards, even with the plastic feet on) Cons - the plug IS stuck under the handle and is difficult to remove. Needs a better idea. Mineral oil worked for me. Also, as soon as it came out of the box, the fan blades had come off the spindle. I had to remove the plastic grill to fix.",
        "I researched fans before buying this and found that the cheapo Lasko's are the ones to stay away from. So I see this fan picture and guess what? The blades are NOT the same as the one in the picture. They are like little rabbit ears, which totally reduce air flow. I feel like I've been duped. Not cool at all.",
        "This is a noisy fan and that's exactly what I wanted so far so good",
        "This is a workhorse fan that moves a lot of air. It’s too loud for sleeping, but great when you want ventilation. Also, it is built much better than cheaper fans I’ve owned: I dropped it on th floor and was afraid I had broken it. But unlike my other fans, I unscrewed the grille and was pleased to find that the blade unit only had to be slid back onto the peg it is on. ALL FIXED! And in the process I finally achieved my dream of being able to clean the inside of the grille, housing, and blades on a fan before putting the outer grille back on. AWESOME!",
        "This fan really moves a lot of air, too bad it has to be in another county to have a comfortable noise level. Even low is not really low, and still really noisy. The fan came with one side dented in. The outer box and the inner box were not damaged, so it had to be picked that way. I'd return it but I really need it. Really a shame, as it is really sturdy, but it comes pre-dented? I guess the main thing is it moves a lot of air, and for that it's better than any box fan I've ever had.",
        "I'm really glad I picked this one up. It's not too big for my bedroom window but it's nice and deep compared to another box fan that I have. It moves a lot of air. It is kinda loud but I feel like all box fans are pretty loud so there's nothing shocking there. If I could change one thing, I'd have an extra speed that's below the current lowest setting. Truthfully, I've always wished for a lower speed on all the box fans I've ever used. Overall, a great box fan.",
        "My last box fan fell over and the blades broke. It was a Lasko, though I don't know the model number. I replaced it with this one but now I wish I had simply ordered a new blade to replace the broken one. This fan is built well and moves the air but it has the sound of a jet plane revving up. The Lasko moved the air too, but I barely heard it. I keep this on low since above that it's annoying to me.",
        "If you want a loud fan for white noise, this is the fan for you. I usually have two box fans on high going at night. For this fan, I generally leave it on medium speed, because it's legitimately that much louder. I do agree with other that the packaging of the cord is just downright stupid, but not enough for me to bump it down a star. I was able to get the cord free of the handle after a few minutes without detaching the handle, but I did have to use some basic tools.",
        "It is a very strong fan. It moves a lot of air. There are no extra plug ins. The long cord is great. It is VERY noisy, but I use it in a back bedroom to pull air through my house. It is great for this purpose.",
        "Just got the fan today, to replace a 40 year-old K-Mart fan in my home office. Mounted it in the old K-Mart fan stand quite easily. It moves a lot of air, but as many have said it's very LOUD. I'll use it for now, but may eventually move it to the garage. It's just too loud for an office environment. Note to manufacturer: maybe a lower speed would be better, or use only 3 blades??",
        "Moves a LOT of air, even at the lowest setting, but it is really loud. Really, really loud.",
        "My husband likes loud old fan noise to sleep with. Been looking for one like this a long time. Build extremely well.",
        "I bought this to replace a box fan made by Polarwind. I was expecting it to be about the same, but boy was I wrong! This Air King has a lot more power, and it seems to be much higher quality. I had the Polarwind for about 8 1/2 years. I hope the Air king lasts at least that long. Only time will tell.",
        "Moves lots of air and is very sturdy. It is also very stable because it is not as thin as the fans available in retail stores. The only thing that could be improved is for it to have a metal handle instead of the plastic handle.",
        "I thought that the reviews of this fan being noisy were exaggerated. But this thing, even on the slowest speed is incredibly noisy. DO NOT BUY THIS FAN.",
        "This is made by Lasko, for those that didn't see that on the box. This blows a lot of air, but is am air king. I seldom put it on 2 or 3. 1 is like an airplane. It's thick, loud, durable, and takes filters.",
        "It is pretty loud but it's better than those other fans similar it's awesome 👏✊👍",
        "like the fan, but it appears to be used or previously opened",
        "This box fan is the real deal. I call it the hurricane/typhoon because the amount of air it circulates is akin to that of a hurricane. But be prepared, it’s loud!",
        "Plug wedged under handle. Took two of us to pry plug free.",
        "These fan is heavy duty and well built. worth the extra bucks, you wont be disappointed",
        "I am so happy with this fan. The speed and power to it can be felt at least 20 feet away (pushing all the hot air out) It's not that loud on the high speed, wasn't expecting that, instead it sounds soothing. I love this fan so much i purchased another one to replace older fans.",
        "It actually circulates the air. Very powerful in comparison to Walmart fans! But, don’t waste your money on the stand like I did!",
        "If you want to move air, this will do it. If you want a quiet fan, this is not it. Even on the lowest setting, it’s crazy loud. It seems like good quality, just too loud. We bought three, but we don’t use the third because it’s too loud to sleep with.",
        "This fan is not safe around children. For the price, I expected something higher quality that would last for a few years. The cage that is supposed to prevent children from sticking their fingers into the fan broke after 1 month.",
        "Moves more air on low speed than other fans do on high, 4 star because they are much noisier.",
        "This fan works well! The only reason I put four stars is because it is very, very loud. I don’t turn it on past level one because the noise is too loud for the room.",
        "I wanted a box fan for my horses stall that had more power than the standard fan, it works great and definitely more powerful!!!",
        "This fan is very powerful. It cools down a room very fast. I use it in the kids room and the hallway.",
        "Even level 1 provides power. Fan is loud but my family and I don’t care, as long as we are kept cool. Sturdy too!",
        "Provide strong flow of air and are powerful. Good buy.",
        "Works great with more power than basic box fan. Sturdy, well made, and I love the soft sound it makes. Soothing. There's nothing I don't like about this fan, I have 2 now and will eventually have 1 for every room in my house.",
        "It is a bit loud but it can blow some air",
        "Love it I usually have to use two fans but this one on low does the white noise job perfect",
        "This is the most distractingly loud fan I have ever encountered. Blows air fine--but SO noisy. Really annoying.",
        "This is an great fan! We bought it for white noise while sleeping and it delivers! It also produces a lot of air which keeps the air circulating in our bedroom with 4 dogs!",
        "- White noise effectively drowns out any other noises - good for sleep - fan is strong enough to blow your skirt up (even room across the room) - essential if you live in a deep south coastal area like Louisiana",
        "Opened the box; took it out; plugged it in. It is still running all the time. Fairly quiet for a large fan.",
        "This product is great and really cools the room. The only issue is that is extremely loud. The tv will need to be to loud if the fan is in the same room. Overall is works and keeps the place cool.",
        "Great quality Keeps room cool on low setting Just enough noise that it helps me sleep Would definitely recommend and buy again",
        "can't give a review as thebone I received was used and broken",
        "Our fan arrived damaged but I honestly don’t care. It works perfect! I want another!",
        "Loudest fan I've ever paid $50 dollars for. Can't be used in a bedroom - too loud. Not appropriate for a study or library. The engineers who designed and built this fan must be deaf.",
        "This fan is very powerful and puts off a lot of wind very happy with this purchase, plus it is permanently lubricated and I expect this to last for a while",
        "Extremely loud and came with the plug somehow tucked under handle, making it impossible to unravel without denting frame of the fan.",
        "Wire was sticking out between fan box and back cover and handle was half off. =very sloppy assembling",
        "You need air moved? With this fan, you will GET air MOVED! Works as advertised. Shipped promptly, arrived quickly. Would buy again.",
        "Good buy great box fan. Plenty of power. Moves slot of air.",
        "Noisy. Virtually no difference in the three speed switch. Returned for refund.",
        "Great fan. Slightly louder than expected but so powerful. Highly recommended.",
        "One blade broke off after second use. Light weight and not durable.",
        "Specs called for 8' cord and a receptacle on fan. It came with 6' cord and no receptacle well over priced.",
        "Has good air flow when it's blowing towards you. However, it is pretty loud. I have right by my tv and I have to turn up the volume on my tv so I can hear it. I wish it was a hair cheaper than the 45 bucks I paid for it but whatever. I needed a fan for my room so this will have to do.",
        "It’s loud but it moves air so good! Cools off an entire floor fast!",
        "I don't use this at all. It is so loud it drowns out the television",
        "The handle broke off immediately as I was pulling it out of the box.",
        "the handle broke the first day. the fan blade came off the motor within a week. the fan is overly loud, particularly on the high setting. would not recommend.",
        "Obviously moves more air than the standard 20\" fans from Walmart. A little wider in depth, but able to install it in a window, for evening and morning, exhausting air from the home.",
        "Before shipping, I received a call telling me that there was only one left and it was \"unused\", but \"out of the box\". It arrived completely filthy. It took me over an hour to clean up all the \"soot\" that covered the fan. I did call to see if I could get a refund, but was told I would lose my $13 in shipping charges, no matter what. Since it did work, I kept it. It DOES NOT have the advertised black cord with two extra outlets. It had a filthy white cord that looked like it had been run over by the fork-lifts that supposedly caused the \"dust\" to be on the fan. (From the brakes).",
        "This is the worlds greatest box fan that I have. I use it near our hallway to bring the cool air in our rooms. I thought when I first got it that it was going to be loud but it is very quiet for a metal bladed fan. It is like the older fans from the 60s. It took a little bit to ship it so I was impatient before I got it. It is a wonderful noise it makes. The noise is great for sleeping. THIS IS A BLLIZARD!",
        "I looked at allot of fans. I needed a fan that was loud. My husband works midnights and he needs noise to sleep. I bought fan after fan and had to take them back. This one on speed 3 is loud and its exactly what I needed, and if you want quiet 1 0r 2 speed is quiet and it give a nice amount of wind.......Thanks King.....",
        "Apparently UPS handles goods like the gorilla handled baggage in the old \"Samsonite\" commercial. It arrived slightly damaged but I kept it. I bought it because I needed it and I didn't want the hassel of a return and re-ship. The product is very good. It moves much more air than the cheap box fans that you can buy in the \"Big Box\" stores. It also has a three wire grounded cord.",
        "This fan had only worked for one season then it sparked and I can smell smoke the next summer. I was very disappointed that it broke and almost started a fire. I bought it because it looked like the old fans. I have the Haier box fan that also looks like the old ones. This fan used to work really well but it wasn't worth it.",
        "I use the to make a room filter after my Lasko died (I run them 24/7). This is much louder at the lowest setting than the Lasko but moved more air. I would not buy this for a bedroom where you will run it while sleeping for for all other purposes, get it. I looked long and hard for a deep metal framed bod fan before I purchased this one. The weight will keep it put and the high angle pitch will move tons of air. It's just not quiet.",
        "I've used this fan all summer and it is still going strong. I have a split level house, and the upper level is always warmer in the summertime. I use the fan at the top of the stairs to help circulate the air evenly throughout the house. I have run the fan on low speed all night and the fan noise did not disrupt my sleep.",
        "This thing moves air and is built well. Will be buying another one next season.",
        "Even at the low sees this thing is a beast. Great fan.",
        "The air flow is great on this fan but the third prong on the plug broke only after a couple weeks. Be careful unplugging .",
        "blade goes around, air is pushed, IT'S A FAN FOR CHRIS SAKE!",
        "This is my second one of these fans. They're far better than any box fan I've bought at home depot or target. Very loud which is a huge plus for me. I use it as white noise to block out a noisy neighbor. The first fan is still going strong and I have no complaints. This fan however, was put together kinda crappy. The screws holding thre back grate on were installed all crooked. The fan still works great but I'll have to take the screws out and replace them properly. If not I'm afraid the plastic grate will crack.",
        "Twice as wide, twice as loud and twice as expensive as a Lasko but appears to move the same amount of air. Also arrived with a perfect box but had a huge dent in it. The way the cord was wrapped up makes me think it was already returned once. Don't waste your money and but a $20 Lasko.",
        "Good news: This is a heavy, impressively built fan that moves a lot of air. However, I did not find it acceptable for domestic use. Even on the lowest setting, the one I received was deafeningly loud. I wanted one to replace the kitchen exhaust window fan for my apartment. However, with it in the window while cooking, it wasn't possible to socialize etc without turning the fan off. It's a dominating propwash sound. It's listed as being insulated and quiet-running. It is not. Again, this is a quality fan. Just way too loud to have in my home, easily 4x louder than my current window fan.",
        "My son was suddenly sent home from college because of Covid. He is super easy to live with but as empty nesters this was an adjustment for us. When he asked for a fan for his room, I leaned toward this ones because the reviews described it as \"very loud.\" I thought we might get some \"privacy\" back. After checking with my son that a loud fan was alright, he said he didn't care. THIS FAN IS SO LOUD. we love it. It drowns out all the sounds. Our son stays nice and cool (yes the fan is cooling and effective) and my husband and I enjoy the sound barrier.",
        "Hmmm....bought four of these and I will assume the fan blade is molded to be a press fit on the motor shaft. Imagine my surprise when I turned on the 1st fan and it was \"whisper quiet\" because the blade fell off. Opened the fan and was able to slide the blade on and off the motor effortlessly. A fluke...Nooooo the other three were identical. Hey, how about a little QC? I wouldn't brag about made in America either.",
        "Aside from it arriving looking like it barely survived a war it’s very loud. However it moves quite a bit of air which is what it was bought for. After repairing it myself rather than dealing with the hassles of shipping, it’s been rock solid and has been running nonstop for weeks.",
        "The fan is alright, but it doesn't match the advertised specifications (it is lighter duty). The blades are definitely not powder coated steel and it is only 105 watts on high. The frame is steel, but guards and blades are plastic. Not particularly loud (60dB on high). Probably a lot quiter than one with steel blades. The people that complained about the plug going under the handle must not have realized the plug and motor connection are on the same side (plug wasn't put under the handle, just a fold of cord).",
        "I had to replace my old box fan, which literally disintegrated after years of use in the sun. Plastic just doesn't last forever. This one does the job, but the fan speed is an issue. I use it to suck cool air from one end of the house to the other, but even on the low speed, it's still too noisy to do anything but sit there in the noise. When I really don't want to listen to it, I will leave and come back later, usually to a cooler house.",
        "The exterior box was perfectly intact but the interior box from the manufacturer was banged up (see photo). The cord was all but impossible to pull from under the handle. The fan was damaged in the area of the box dents/holes. The worst part is the unstable glow of air potentially signally an electrical issue. It is a string fan and blows hard on 1, 2 and 3, but I wouldn't buy from this company again.",
        "This moves a lot of air, but even at the lowest speed setting, it is louder than my other box fans on their fastest settings. Also not very well balanced. Ancient box fan was quieter and moved as much air until a plastic blade broke after *only* 42 years. If your neighbors aren't okay with loud noise on hot nights, don't put this in your window.",
        "About what I expected, except a little noisier. I opted for one that was a touch more expensive than the really cheap models hope'in for a little less noise, but this one still makes a lot of noise on all power levels. Probably has to do with pointed blade design.",
        "Arrived on time. As the other reviews stated yes they package the fan with the plug in cord under the handle so I unscrewed the pilips screws from the fan cover to pop off the handle to free the cord. Overall works great cycles cool air around my room & the hall after 10mins after start up.",
        "It's a typical box fan. I bought this one because it has the mounting holes for a stand on the side. However the fan blades are severely off balance. On low it's ok, on medium it bounces around a bit and on high it bounces around enough to move slowly across the floor.",
        "This fan was delivered today. Looks great, but the power plug in and cord comes jammed up under the carry handle. No way that the plug end is budging from under the carry handle. It simply won’t fit to get it out from under the handle so no way to plug it in.",
        "Very good box fan. Made in the USA. I will buy more.",
        "This fan is very noisy. It definitely moves air and is powerful. It's louder than white noise.",
        "It is noisy but in this heat, who cares. I have it on the lowest speed and I am surprised that it's almost cold where I sit. Wonderful It's sturdy, not a light weight plastic type fan. I hope it lasts. I'm glad I bought this.",
        "After I bought this, I saw so many great fans for a lot less. This fan makes so much noise. I have it on a covered porch. It is so loud, I can hear it with the doors and windows closed. Mistake...",
        "Metal box, heavy, made in the USA. One star taken away because it could be quieter and the low speed should be slower.",
        "Beats the heck out of the $20 box fans. Moves tons of air. Very noisy, but if you need 4 times the air volume this fan is great. Sturdy. For my use it is a winner. You get what you pay for.",
        "Well built, very sturdy. Certainly moves air, BUT it is also quite loud, way too loud to use in a t.v. room.",
        "I use these box fans as poor-man's air filters by taping a 20x20 filter to the pull side. I this capacity they run 24-7-365. I have one that's done this for about two years now. Amazing! The cheaper fans will quit in a few days, and I threw three of those away before I tried one of these. The air kings move a noticeably larger amount of air, too. They are larger than a cheapo box fan but still much more efficiently shaped and easily to deal with (logistically speaking) than a fan with a separate base. Do yourself a favor and splurge on a decent box fan.",
        "If you like white noise, this is a loud fan. But it's significantly more powerful than any of our other fans. I'm glad we bought this one!",
        "Even on lowest setting, this fan is way too loud for bedroom. It does move lots of air---would be good for drying out a basement after flooding but not good for sleeping. Back to shopping for something quieter."
    ]
}