{
    "entity": "Pizza Cutters",
    "text": [
        "This pizza cutter is perfect for thick pizza as well as thin pizza. It is well made and easy to clean. The thick handle makes using the cutter comfortable. Unfortunately, I didn't realize that the cover the cutter came in can be used for storing the pizza cutter. The cover is a protector of the blade. I kind of ripped off the packaging and had to tape it all back together to use the cover as a protector. So keep that in mind if you choose to buy this pizza cutter!.",
        "I just bought this pizza cutter and it seemed like it would be really good quality because every oxo product i have bought in the past has lasted for years, but not this one. After just one run through the dishwasher the pizza cutter already has rust around the center.",
        "I am not very pleased with this purchase as it seems like I have to \"saw\" the pizza to get it to cut through completely. And when I say \"saw\" I mean \"saw.\" I previously had a free pizza cutter that the local grocer was giving away and it worked much better than this pricey Oxo cutter. It had a plastic edge that after many years of use--it became dull so I needed a new one and this Oxo one was very highly rated so I thought I would give it a try. I have many Oxo products that I am very happy with--this just isn't one of them.",
        "I bought this pizza cutter because my old one was trashed. I tried 2 other cutters prior to this one only to be disappointed. This cutter is AWESOME! I am able to cut through even frozen pizzas when I want to make half. The price is well worth it because I believe this can be used for many years without issue. I highly recommend this pizza cutter.",
        "Oxo usually has good products and good comfortable design. This pizza cutter is just 'ok' to me as there are several other ones I have that are better. In terms of performance, the blade is sharp, and it is bigger. The blade is made from stainless steel attached to a non-stainless steel neck/holder (this being just polished or chromed steel). I would have preferred the neck to also be made of SS. Handle is comfortable but not ergonomic. Having a blade guard would be another nice add-on. I host pizza parties where we serve between 4 and 12 full size 16\" pizzas .",
        "Well made. The one thing that stood out when I first looked at this was that it was noticeably larger than all other cutters I've owned... I don't know if that's a plus or a minus... either way, this is a good, solid pizza cutter. It has weight to it and the disc doesn't wobble like many other cutters... so we're happy!",
        "OXO as usual surpasses my expectations. This cutter cuts smoothly, it well made, and best of all is incredibly easy to clean. I’m always weary of kitchen tools that make life easier until it’s time to clean up and suddenly all the time those tools saved you is wasted trying to clean them. The way that the wheel is attached to the handle makes it easy to clean up and most of the food and greasy rinses off immediately.",
        "We’ve bought several OXO products and loved them. This cutter looked the part. Beautiful, well balanced, sharp but 1 and done!! I literally used it one time and thought I’d found the pizza cutter I’d been dreaming of. On the second use the fastener attaching the wheel to handle came apart. I see no way of repairing it and will be returning it as defective.",
        "I was replacing a wheel we had forever that went missing, and it is hard to tell size just looking at the writeups (ok, I did not read the specs). I was quite surprised, pleasantly so, when this arrived -- it is a big, solid, heavy cutter. Nicely sharp, rolls easily. A massive upgrade from the little cutter I had before, and I suspect compared to most of what you see advertised, yet not that expensive.",
        "Materials seem to be very good however upon receipt, the pin that secures the cutting wheel to the handle sprocket had worked its way loose and the pin, wheel and two plastic washers were all loose in the shipping soft-sided envelope. I reset everything so we will see if this lasts. If not, I will ask for a refund.",
        "Ranked the best pizza wheel by America's Test Kitchen! Nice and heavy so it adds oomf to make slicing thin/hard crust pizza easy. Feels solid in the hand unlike all the other flimsy cheap models on the market. A must have for anyone who eats pizza, whether it's from your local pizza shop or you make it yourself.",
        "Excellent kitchen tool. No messing around with this tool: it is slick, efficient, and SHARP. Appears to be industrial size. Probably more than we need in our household, but nice to have, nevertheless. Highly recommend for those wanting a STURDY and SHARP pizza cutter.",
        "I guess I need to pay better attention to sizes. This pizza cutter is HUGE. I'm a petite person and this thing is too big for my hands. However, it is well made like all OXO products. It cleans well in the dishwasher. I have very few complaints. It's just... big. Maybe I'm better suited to the cheap small ones.",
        "OXO makes such great items at affordable prices. This feels \"heavy duty\" and capable of cutting up any pizzas you may make at home on a date night or for the kids. Doesn't at all feel like some of the \"cheaper\" ones you may pick up in the utensil aisle at your local grocery store. Made to last for sure.",
        "This is a heavy duty baby, well made. I hope it lasts longer than the last one we bought. The only reason I didn't give it a 4 was because there is no cover to protect it. I tried using the plastic one it came with but that was a royal pain in the rear to put on & take off. I just ended up throwing it away. I'm sure the cutter will be fine in the kitchen drawer with all the other utensils.",
        "If I could give this pizza cutter a zero rating I would. The wheel on this cutter isn't sharp enough to cut through cheap air bread let alone a pizza crust. Unfortunately, I'm not able to return it for a refund because of time constraints. So now it's going into the Salvation Army box. Thanks good grips.",
        "I bought this to replace an OXO pizza wheel that spontaneously broke—the wheel just fell off mid-slice. Needless to say I was hesitant to buy another OXO product, but Cook's Illustrated said this was the best and I generally trust their reviews. I just received this one and it feels much more solid and durable than my previous model. Nice weight, sharp, rolls smoothly.",
        "My husband and I (unknowingly) both ordered a new pizza cutter from Amazon upon realizing ours must have gotten thrown out with an empty pizza box. Upon comparison, I realized how HEAVY the OXO pizza cutter is. Would I have noticed if I didn't have a different one in my other hand? Perhaps not. It does the job, but if you are someone who has trouble with your hands or wants something easier to hold onto, choose a different one.",
        "What I’ve come to expect from OXO — a superior quality product. Heavy weight which makes it easy to cut through even a frozen pizza (I only use half of it at a time). Easy to wash....but it is sharp so be careful. Can throw it into the dishwasher which I decided was safer.",
        "Purchased this to replace a small/flimsy pizza cutter where the wheel was starting to come loose. This one is significantly heavier and sturdier. It cuts pizza as well as any other cutter and has held up well so far in the dish washer on the top rack. Would purchase again.",
        "Good pizza wheel, much better than what I have used previously, only complaint I have is that the protective cover used for storage tore apart the first time I removed it to wash the pizza cutter. Curious as to how I can purchase another one.",
        "Our last one broke...small, cheap. This thing showed up and holy cow is it huge. This will be around for a long time. Very well built and perfect for the man hands that will be using it too regularly. :D",
        "It feels having total control while cutting thin, regular crust pizza, good comfortable grip. Recommended, tested by Test Kitchen, Amazon buyer/user reviews. Reasonable price compared to other vendors.",
        "it cuts through pizza crust well. It's a pizza/dough wheel but not a knife--just to clarify some misguided expectations here. I like the weight (it's quite heavy) and how easy it is to clean.",
        "Bigger than I thought it would be, and very sharp, but my fingers were shielded from the blade and the pizza was cut through with an almost surgical cut on the first push! WOW! We make homemade pizzas here several times a week and this is a great cutter!! Just don't let the kids get ahold of it! Not a toy. But if you want a cleaner than clean pizza slice, this is for you.",
        "WOW! That's what I said when I opened the box! The size shocked me lol. I love this pizza cutter! I made pizza last night so I could try this cutter as soon as I got it. It worked fantastic on cold pizza and reheated! Don't let the size intimidate you. It's perfect and really easy to clean. I will buy this one for gifts too.",
        "Nice, big and heavy but not as sharp as I expected. Not sure if this is a defect or just the way they are made. I really had to press down and make several passes to cut a thin crust pizza.",
        "Works fantastically! The cutter has a good weight to it . The blade is sharper than it looks. It cuts pizza with ease. I was upset when my old one broke. After using this one, I wish it had broken sooner",
        "I was disappointed and returned the item without using it. I really like the OXO brand kitchen tools, but this pizza cutter was much larger than what I had expected. I had been trying to replace an old one which was just wearing out. I guess I assumed that the OXO pizza cutter would be of similar size.",
        "and so weighty. I love it. the blade seems so very well secured. My old blade (another brand) was only riveted on and was going all wonky. This one is very secure.",
        "I make homemade pizza with a very thick crust. This cutter blade is big enough to go through, and cuts great. Shipped fast, price good, and would definitely recommend.",
        "I bought this pizza cutter on the recommendation of America's Test Kitchen. I love it. I eat gluten-free, and gf pizza crusts can be impossibly tough to cut. In fact, cutting one broke my last cutter! This one glides through the hard crusts with ease, without needing a lot of extra pressure. Plus, the handle is nice and comfy, great for my hands that like to cramp and lose strength.",
        "Other reviews prompted me to buy this pizza wheel as well as the Oxo brand that is usually pretty good. It's a hefty weight but I don't think the blade is any better than the run-of-the-mill. What works better for me is my Chinese cleaver. Who would have thought?",
        "I was surprised at it's size...I guess I didn't read the description...but it's awesome! Love it...cuts right through the pizza! Would buy again!",
        "Does the job. don't cut on the metal tray and it will last. Durable easy to use and fairly easy to clean. deep pizzas throw a little more sauce around. Don't let it dry and it will come off easy",
        "I have used 2 inch or 3 inch wheels for the past 20 years—I should have used a 4 inch wheel the whole time—it’s the best. This particular pizza wheel has some nice weight to it, ensuring the wheel isn’t top heavy. Cuts beautifully with one pass—no need to go back and forth.",
        "This is the biggest pizza cutter I've ever seen, and if I knew it was so big, I wouldn't have purchased it. It is bulky, heavy and hard to use. I've had much smaller ones work better without all of trouble.",
        "This cuts pizza. I'm not certain what else I'm supposed to write about. It's a circular blade with a handle. I suppose I can go on at length about comfort, but if it takes you long enough to cut a pizza where you have to worry about comfort, you're doing it wrong. If you're cutting a zillion pizzas, you'll need a professional cutter with a larger blade. Recommend!",
        "I was surprised at the weight this carried. Very nice and sturdy pizza cutter. It does the job well and has rust proof runner ends (very important to me). Love this.",
        "I had no issues with this product. Nice big handle. Sharp. Had no issues cutting the pizza and i found it easy to clean as I cleaned it off right away.",
        "Heavy duty, high quality. Usually, I don't care enough about the products I buy enough to write a review but this one I had to.",
        "Here in New Jersey we eat a lot of pie (we don't call it pizza, fuhgeddaboudit, it's pie!) and a nice, big, sturdy slicer like this is just the ticket. Nice and sharp for slicing that pie. Washes up fine in the dishwasher too.",
        "Never knew what I was missing-- this works great. However, I want to see what happens over time... does the edge need to be sharpened? If so, how do you do that?",
        "This pizza cutter is very dull. Don’t waste your money. It’s also too big. It doesn’t do the job. Disappointed ☹️ Couldn’t even cut through a thin pizza.",
        "We've had the pizza cutter for about 6 months now and would say that we're totally satisfied with it. Seems like it'll hold up for a good long time. Would recomend it to anyone.",
        "Enough said. It's OXO. Great quality and moves with ease. Large cutting radius is really nice and the handle is comfortable.",
        "This pizza cutter is truly ergonomic and is very comfortable to hold and use. It cuts very well and is easy to clean. It is a solid and well made pizza cutter.",
        "This thing works great. I did not read the size of it and it is MASSIVE. So if you are looking for a regular sized pizza cutter that will not take up half your drawer space, this might not be for you.",
        "A very Handy to Handle Pizza Cutter. Its a Big Pizza Cutter, but sometimes Bigger is Better, compared to the smaller options available. Its easy to use, just go back and forth, In order to ensure the pizza doesnt move, I usually Hold the Pizza and use the other hand to do the back and forth option. No regrets, my only annoyance is cleaning it, since its a wheel, I usually hold the wheel and clean it with a rag or wipe, since the wheel will get dirty from the Pizza with Cheese and tomatoe sauce, but its great for what it is",
        "We eat a lot of frozen pizzas at my house. This is a heavy duty, durable pizza cutter. Wheel doesn’t wobble like cheaper ones. I’m probably going to buy another one.",
        "Its heavy and seems like it will last a long while. Hopefully it is better than the last two I bought on here that broke.",
        "Who knew a pizza cutter could make such a difference? Compared to our old pizza cutter, this one is the ultimate! Pizza pieces cut with one swipe, perfectly clean and accurate, all the way through.",
        "Too big for us! We just need one that half the diameter. This is too professional for my family, lol!",
        "I have tried many other brands and sizes and this one is the best. I am gluten free so we make on own pies at home and I needed a good one. I highly recommend this one.",
        "Good, heavy, quality pizza cutter. I have yet to find an Oxo product that has disappointed me!",
        "Good weight, large wheel and feels good in the hand. We are very happy with our purchase.",
        "It is a pizza cutter. Heavy and feels substantial in your hand. If you are familiar with OXO stuff you'll know this is on par with their other offerings. Not absolute top quality but well above the dollar store cutter it replaced in my kitchen drawer.",
        "I have arthritis so things like this are usually difficult. This has great grip, great balance (it looks like it should be off but it's not). Super cutting edge - one pass cuts even thin crispy crusts - which my old cutter took several passes to accomplish. It's heavy but really well balanced so I think that combination might be what helps it to cut so well. Would buy it again & highly recommend it. Note - it is big - think they said 4\". Most pizza wheels that I've seen are much smaller. I had to find a new storage space for it but totally worth it.",
        "This is a large pizza roller so it works well even with a deep dish or stuffed crust pizza. Every time I've used it, the blade has been nice and sharp so it cuts with just a little pressure. I can use it for slicing all sorts of things, even garlic bread.",
        "This pizza cutter lives up to the OXO brand name: it works well and is comfortable to use! Washing the pizza cutter is easy. I love how easy this cutter glides through cutting pizza!",
        "Was looking for an easy to clean pizza wheel, found it with this. Very simple to run under the sink, no weird nooks or crannies for food to get stuck in. Construction feels solid, feels comfortable in hand. Would recommend.",
        "This pizza cutter is very well balanced and ergonomic designed. I mistakenly throw out with trash and had to repurchase the same. Very nice!",
        "I love the solid feel, it's very heavy with a comfortable large grip. I wish it was all metal.",
        "OXO is known for its ergonomics, but the pizza wheel is bigger than I expected -- 4\" in diameter -- and heavier than I expected -- 10 oz -- so it feels awkward for me.",
        "This is an absolutely perfect tool from my viewpoint. It is comfortable to grip and use. I can think of no candidate improvements to this product. It's terrific!",
        "Cuts pizzas, tortillas, and a variety of other food very well. I didn't realize howe big in the drawer it would be, otherwise it is perfect.",
        "This pizza wheel is very substantial. It is well-made and very sharp. I am a small woman and I appreciate the heft of this valuable kitchen tool. A must-have if you love pizza as much as I do!",
        "Nice big pizza cutter. Easy to clean and hold and use.",
        "Much bigger and heavier than expected. I guess I did not review carefully. If I would have seen this in a live store I would not have bought it. Need a lot of pressure to get it tomorrow cut.",
        "I bought this (along with a couple of nice pizza pans) as a gift for my wife, who makes pizzas for family dinners every few weeks. Not the most elegant or romantic of presents, for sure, but she was definitely pleased. Like all of OXO's kitchen tools, it is well designed, very reasonably priced, and seems sturdy, though it hasn't been given much of a stress test so far. I've never been unhappy any time I've purchased something from OXO.",
        "Love this product. The best pizza cutter I ever had",
        "Does just what it's supposed to and does it well. Good feeling in your hand, good weight and easy to clean.",
        "It is definitely on the large size, and heavier than most cutters, but it cuts pizza very well. I have had mine for over a year and it still like new. It's very durable, made from high quality materials.",
        "So I read review after review of all sorts of Pizza cutters; practically had to close my eyes and pick one at random! And got a great one! Large wheel, sturdy shaft and very nice rubber grip. Easy to clean.",
        "Homemade pizza is a weekly staple at our house, and we love this pizza cutter! The big wheel and comfortable, sturdy handle make cutting pizza a breeze. I'm not afraid of breaking this thing like I have been other cheap cutters in the past. Price is very fair for what you get. Would definitely buy this one again, but I don't see us needing another pizza cutter for a long time!",
        "My husband used it tonight for homemade pizza and said it worked so much better than our old one!",
        "This is the most durable & hefty pizza cutter I've ever seen! It's a hefty 11 o.z & can cut a pizza up to 1 3/4\"!! I've had dozens of pizza cutters. This will likely be my last!",
        "Easy to use. Make me feel like I’m a pro! Highly recommend!",
        "This pizza cutter is AWFUL! First use and it couldn't cut through the pizza. It couldn't cut a sliver of bread!",
        "Easy to use and cuts quickly / easily. This is the best pizza cutter I’ve used.",
        "This cuts almost like a power tool, and like a power tool, access to it should be limited. The grip might only get slippery with axle grease, but I wish the hilt were a bit longer.",
        "I love that I can throw this in the dishwasher and it doesn’t rust.",
        "Love this big pizza slicer! It tackles the job of slicing thru thick crusts.",
        "Update: After about 6 months I noticed the pin it rotates on is rusting. Maybe it isn’t stainless? It’s not rusting bad but it does squeak when I use it. I guess I need to find some light oil to put on the pivot point? Anyway I’m changing my rating to 3 stars. Nice weight to it and very sharp! Slices pizza with ease.",
        "Like all our OXO Good Grips items we are completely satisfied. The large size is easy to handle and cuts right through toppings and pizza crust. Cuts flat bread, frittatas and more....",
        "Cuts so easily! This is a hefty tool, not a piece of junk like those one sees in the grocery stores. It cuts easily through thin crispy, regular, or deep dish pizzas with little effort. It's weightier than most, so it does much of the cutting for you. No need to bear down hard. The handle is very comfortable and has a great, no-stick surface. Highly recommended.",
        "Works great. It is heavier than my last pizza cutter.",
        "Large cutting blade with solid grip handle. I recommend this pizza cutter.",
        "A really good pizza slicer which sits very well in the hand and cuts easily.",
        "Yeah, it's like the monster truck of pizza wheels, but it works very well. We have had an old, much smaller pizza wheel for years, and when I bit the bullet and ordered a pizza stone for the oven, I added this to the order. It has great heft, nicely padded handle, and the wheel just makes slicing up a pizza effortless. The blade rolls smoothly and it has enough height to cut through thick crusted sicilian style crusts with ease.",
        "Great cutter! Easy to use, clean and comfortable to hold.",
        "Easily cuts through even the hardest crust. Clean cut slices and easy clean-up. They nailed it for pizza cutters.",
        "Great sturdy pizza wheel. Cuts easily, and is easy to clean. Now if we can keep from accidentally throwing it away with the pizza boxes, like we did with our last one, I'll be happy. :-)",
        "LOVE this for cutting pizza! We make a lot of homemade pizza and this cuts smooth, quick and all the way through dough. It's comfortable to hold and rolls very smoothly. Highly recommend!",
        "This is a giant-size cutter. It's sturdy and looks like it will hold up well.",
        "I don't know what I expected but this pizza wheel is large! But it is also the best we've owned in the past 25 years. It rolls easily and with the sharpness of the wheels blade it'll cut through just about any kind of pizza you want it to. The grip (like on all of the OXO Good Grip items) is excellent, and it is made to last. High quality construction, great blade, and grate grip, and great price. What else can I say. I would recommend it to anyone.",
        "Much easier to use than a sharp knife. Makes quick work of cutting a pizza.",
        "Used mine for a while and love it. Sharp and easy to clean.",
        "Have had this product in the past and am always pleased with quality and comfortable to use.",
        "Good pizza cutter, works great. Unfortunately my naughty dog chewed the handle before I ever even used it so it has ugly teeth marks. Of course that's not the pizza cutter' s problem"
    ]
}