{
    "entity": "Pizza Cutters",
    "text": [
        "I had very high expectations for this product. I have been a longtime KitchenAid customer and am generally used to their high quality products. However, I was very disappointed when the center bolt and nut began to rust on this item. While the quality of this cutter is otherwise very good, the rust in the center ruins this for me. I am not sure if this is a one off problem or a common problem to the design but in any event, definetly is a deal breaker for me.",
        "I LOVE this pizza cutter! It is sharp, it is sturdy, it works! It doesn’t wiggle and jiggle and threaten to break or otherwise harm you or your pizza while cutting. It simply cuts smoothly and cleanly as if it knows what it is supposed to be doing. I don’t dread cutting pizza anymore and I love the blade protector on it. Others complain that it rusts. I mean really. . . DON’T PUT IT IN THE DISHWASHER! Simply wash it and dry it (as recommended). If that is too much work for you to buy this fabulous pizza cutter, I don’t even want to taste your pizza.",
        "This is a heavy, solidly made unit and the cutting wheel is sharp and securely mounted. The grip is large and comfortable. The snap on blade guard is a nice feature as well. There is one major flaw in this product - the diameter of the cutting wheel is too small. This unit works extremely well on thin crust pizza, but on any thick crust pizza, especially one that you have added toppings to, the spindle of the cutting wheel will drag through the pizza toppings and make an awful mess.",
        "This pizza cutter is the best I’ve had...and I’ve had quite a few! It is not too big or too heavy for me. I am 70 years old and my hands are small, but this pizza cutter fits beautifully in my hand and it’s not too heavy. As with all pizza cutters, it is easy to clean. The trick is: Clean the pizza cutter immediately after you use it with hot soapy water. Don’t let the cheese get cold on the cutter...this takes less than 2 minutes! I’m buying more for my family members... I like this one that much.",
        "Hello, this piece of gastronomy is really very strong, as soon as you have it in your hands you realize that this is great, very robust, well built, very firm materials, I think it will be one of those things that last a lifetime, it is also very beautiful, it has great brightness, I did not give the 5 stars that it rocks, just because it is made in China, even so, it is a magnificent piece, it catches my attention that this brand manufactures pieces in China, but anyway it is worth its value , my cat \"Valentino\" regalon liked me immediately.",
        "I have had this product for a few months now and it works great. The weight of it helps slice through items and pizza. We have used this to slice into veggies along with dough. I would say the guard the cutter comes with is a waste as you never know where you put the darn thing. They should have colored it rather than make it clear. But your not really buying this for the guard. I was tired of handles breaking off on other cutters so I decided to spend a little more and get a quality product. I don't plan on returning this anytime soon.",
        "We loved this for about a week, then the nut and screw that holds the blade to the fork began to rust so badly that we had to stop using it. Total ripoff. Stay far away.......",
        "Rugged and sturdy... this is exactly the right tool to invest in for years of successfully slicing pizza. I make a thick topping with lots of vegetables atop a thinner crust. This tools carves right through without tearing -- or, dragging -- anything. It's worth every cent I paid... I highly recommend it.",
        "I have never seen a pizza wheel like this. It is easy to hold and very sturdy. It is also very sharp and cuts with ease. This is definitely revolutionary in comparison to the flimsy ones that I have used in the past that are not very sturdy and sharp. It easily cuts pizza on the first try.",
        "I have had my old kitchenAid pizza cutter for many years so the blade got dull. I found out that this model was being replaced by a much cheaper looking version. If you like this version of the kitchenAid pizza cutter better get it before it disappears. Some other sites were asking nearly twice the price.",
        "Very good product but if I had been able to hold it in a store before buying I would have kept looking. It is just insanely heavy and built like a tank. This thing will last a lifetime when I would have been happy if I got 5 years out of it. I know that sounds counterintuitive but this thing is overkill. Now what I really like about it. The wheel is removable, presumably for sharpening and/or replacement. All in all it was one hell of a buy.",
        "Very heavy duty - high quality pizza cutter. works great and feels great in hand cutting a pie. one downside, to remove the wheel you have to unscrew the blade, no 'quick release'. comes with the territory i suppose. high quality, no wiggle, long last blade or quick release mechanism that may fail over time. this should be the last pizza cutter i ever have to buy.",
        "If you ever need to use this as a weapon, you will win 100%. Wanna cut a pizza? But also that burglar that has just broken in? Check. This is the most durable pizza cutter ever. Maybe not for someone with weak grip as it is heavy in your hand. But it won’t break no matter how many times your kids use it.",
        "We make homemade pizza once a week and I can't tell you how many pizza cutters I've gone through. This one cuts better, feels better, and seems like it will last longer than all of the others that I've ever owned. I would definitely recommend it.",
        "This thing is very well built and very heavy. It cuts pizza quite well and I like that it comes with a guard to protect the blade while it is in the drawer. If you want it to, I think it would cut the pizza, the box, the table, and anything else that might happen to be in the way.",
        "This thing is heavy and I have never, EVER seen, held or used a better one! This thing will probably last me the rest of my life and then get handed down to my kids and then grandkids. Yes, it's that amazing! Don't think it will ever need replacing!",
        "We started making pizzas recently and were using a large stainless blade style cutter that had to be rocked back and forth for 35 minutes in order to cut the pizza. Hated it. This is so much nicer! It's heavy, and well made. Cleans easily.",
        "This thing is built very well. I've never seen a pizza cutter this good. Heavy duty with a comfortable feel to it. I'm glad I paid a little more to get something that will last a long time and work great all the time.",
        "Thing that makes an impression is that it is sturdy and well built. Set to carve many pizzas over the coming years. Some may say expensive but just think of it as the cost for 3 mid range pizzas. Highly recommend.",
        "I really like the feel and heft of the cutter and it works great to slice through many pizzas in the last several months. I don't really have any issue with rust on it that some review mentioned. It's pretty easy to clean as well.",
        "Beautiful construction and design. Very durable. I think this Kitchen Aid will be the last pizza cutter I’ll ever need to buy. The last one we bought was a well known brand distinguished by its large black handles.",
        "we eat frozen pizza roughly 1-2X per week, and since our 2nd pizza wheel broke we were looking for a sturdy well-made product this time around and decided to pay the extra for this kitchen aid product. It feels heavy-duty and sturdy, much more so than our prior pizza cutters, however, it doesn't seem to cut the pizza nearly as well. It seems to be roughly half as sharp because we need to push down roughly twice as hard to cut the pizza.",
        "You can never get the cover back on to protect the blade super difficult",
        "My husband LOVES this thing. It’s perfect for large hands, it rolls easily, it’s unbelievably heavy, and it cuts through the pizza complex, the first time, every time.",
        "This is the real deal. A fine, solid, piece of kitchen toolery that looks like you can pass it on to the grandkids. And yes, it slices pizza.",
        "I am a homemade pizza freak. Super heavy duty quality, will last forever. Pizza wheel could be a little bigger for deep dish but for most pizzas and wood fired margherita style it rocks. Keep the blade edge protected when storing.",
        "This is by far and away the best pizza cutter. Makes cutting pizzas easy. All others we have had did not cut well and required multiple passes to cut out a wedge of pizza",
        "We like this pizza cutter very much. There was a little flaw in the stainless steel part but it has not affected the way it cuts its more of a cosmetic thing,",
        "I have bought other pizza cutters and they never work right, these are great. They cut through the cheese and give even cuts. Love it.",
        "This is by far the best pizza cutter I've ever used. It's very sturdy, unlike many other designs you find in the stores. The wheel is sturdy and does not wobble or bend. It's sharp and cuts through thick pizza with ease.",
        "Solid, heavy, for it's size. The added weight and wide hand grip make it easier to cut through anything. The blade guard is an nice feature, allowing the cutter to be stored safely, without a chance of nicks or cuts or unnecessarily dulling the blade.",
        "I’ve had mine for many years. I just bought this for my son who moved out of the house - he loves pizza. Whenever he comes home, he compares his cheap pizza cutter to this one. There really is no comparison- this one has a great weight to it. It has also been through the dishwasher countless times and still slices perfectly.",
        "Solid pizza cutter! I'm not afraid of this breaking in my hand. Safety first ! I've been cut many times by pizza cutters breaking in my hand. Cuts through a thick crust just fine.",
        "Best pizza cutter I've found so far. Well worth it's price, not like those other cheap brands on Amazon. This one cuts well, don't have to struggle with cutting the pizza. Clean slices every time.",
        "This an exceptionally solid and well-designed product - professional grade in every way.",
        "Very sharp and easy to use, makes quick work of thin or thick crust. Comes with a cutter protector so blade doesn't dull. Be sure to take off before use and put back on after. The handle ergonomics are great.",
        "I've been using this wheel for 2 years and counting. It's heavy and works perfectly, even after years of at-least-weekly use. There is a light amount of rust on the screw (in the outer groove) but my dishwasher doesn't dry the dishes-it has sat wet on more than one occasion. I was looking at buying a second one as a gift, and I notice that kitchenaid makes a cheaper version. That wheel may work fine, but just FYI I picked it up in a local store and it's noticeably lighter than this one. I recommend the chef/professional version. Its weight is a big part of its success in my mind.",
        "Has some weight to it. Very well made. Love it",
        "This is the best pizza cutter I've used and was a necessity when I got a place of my own. It's weighted nicely to help cut through thick pizzas.",
        "This is the most comfortable pizza cutter I’ve used. It slices through pizza easily and the handle makes it easy to apply enough pressure for the crust. Cleanup is about the same as any circular pizza cutter.",
        "I am happy with this pizza cutter. It is quality and a nice weight cuts with ease.",
        "WOW!! Not much more i can say about this! Its very heavy and it cuts through pizza like there is no tomorrow, its well worth its high price!! I love it and it is an essential for my kitchen from now on since we are big pizza fans!! Pros great edge (i love the design as well so unique) and perfect weight for cutting any pizza Cons it took forever to get shipped and by the time it got here i had almost forgot i ordered it!",
        "This is the best pizza cutter I’ve ever had! It is heavy duty quality! I love it!!",
        "Really good quality and nice a sharp blade. Cuts well and I like the safety so nobody gets cut when it is stored in the drawer",
        "Sharp and heavy enough to do the job quickly and easily!",
        "Love this pizza cutter if you order one you will never wear it out. thanks",
        "It is a nice and balanced cutter and I like that it is a bit heavy for a pizza cutter",
        "Substantial feel in your hand Easy to grip Blade is sharp enough to get the job done nicely, but not sharp enough to damage pizza pans, etc. Very well made, very well thought out kitchen tool I read a few reports of the bolt rusting but I haven't had that happen, yet.",
        "Substantial feel in your hand Easy to grip Blade is sharp enough to get the job done nicely, but not sharp enough to damage pizza pans, etc. Very well made, very well thought out kitchen tool I read a few reports of the bolt rusting but I haven't had that happen, yet.",
        "This is a major league pizza cutter. I love the way it feels in my hand. It is heavy and solid and the blade cuts well.",
        "This is a professional cutter... no mistaken it. It’s heavy, but does a great job. Won’t use any of your cheap store bought cutters anymore.",
        "I was shopping for pizza scissors when I decided to but this traditional pizza cutter - it is made very well - is nice and heavy with good sharpness - cleans up easily - hopefully this is the last pizza cutter that I ever need to buy",
        "Very nice heavy duty quality. Great feel and cuts great. What would you expect from KitchenAid.",
        "I like it a lot although it is a bit heavy",
        "Wife loves it. I think it could be a little sharper",
        "Great!. it cut just like the product say cut perfect for pizza. i Love it will buy again. Doris",
        "This pizza cutter feels very sturdy. Allows you to do a nice even cut across your delicious dinner. Haven't had any trouble yet throwing this guy into the dishwasher.",
        "Excellent pizza cutter. This blade is very sturdy and feels well made. The blade is also quite sharp and cut pizza slices up quite easily.",
        "Top of the line, the best pizza cutter that I had .",
        "The first thing you notice when you get this cutter is the weight. Very well made and perfect angle for cutting pizza.",
        "its a pizza cutter, does what its supposed to do and that's cut pizza. Grip is comfortable and color matches picture. Seems sturdy",
        "I love this pizza wheel, however after washing in the dishwasher for several months the screw has rusted causing the blade not to turn...disappointed as I just purchased summer 2019 and it's Nov 2019.",
        "Very heavy-duty...cuts extremely well. Ergonomic, good heft, easy to grip.",
        "My friend had one of these and it was awesome! I had to have one and now I do! Fantastic kitchen accessory!",
        "Super sharp nice design but the bolt and nut started to rust almost immediately.",
        "I've bought several of these over the years as gifts. My original one that I've had for years is as good as new.",
        "Slices with ease! Makes my New Year goals extremely difficult with all the pizza slices I eat... though they are perfectly sliced!",
        "I noticed this great kitchen item while visiting my son. Couldn't get on-line fast enough to order one, from Amazon (of course)! It is weighted perfectly and is heavy duty. The KitenAid cutter does the work for you effortlessly. I think this may be the item that eveyone gets for a holiday gift this year. Highly recommended.",
        "I like this but it is very heavy. I'm not sure why it has to be so heavy because my old one was a lot lighter but very sharp so it worked well until I lost it.",
        "This is a no joke pizza cutter nice and heavy and cuts really great",
        "Quality and weight shows this item to be made well. I like the fact that it is stainless steel and has a rubber blade protector.",
        "This cutter is perfect. Its built very sturdy and worth every penny. This was the last one I will ever need to buy.",
        "Worked great on a quesadilla but we have yet to use it on a pizza. Great heavy duty cutter!",
        "As far as pizza cutters go, this is the top of the line. High quality, well made and a great price too.",
        "This is the highest quality construction of any pizza wheel I've ever found. It has a heavy cast, polished, and chromed one piece handle and wheel support. A pleasure to use, with a hefty feel in the hand. This is the small (3\") pizza wheel. Unfortunately, the large (4\") wheel has been discontinued. I have one 4\" wheel but have been unable to locate another from any source. This smaller wheel cutter is still a good substitute.",
        "This is the best pizza wheel we have found and believe me, we have tried several. The Kitchen Aid Pizza Wheel is sturdy, makes cutting easy with its sharp wheel and is easy to clean. We are very pleased with this product and would highly recommend it.",
        "Better than the $40 Williams-Sonoma one I received fro Christmas that broke after a few months of use. It works great!",
        "This pizza cutter is the mother of all cutters. I did not know they made them this industrial. It is awesome.",
        "I have only used this product once so far, but it was fabulous. It’s easy to hold and clean. The best part was it cut the pizza perfectly with one swipe!",
        "Heavy duty,high quality.I doubt 'll need to buy another in my lifetime.",
        "Everything is good except the cutter wheel could have been larger",
        "This is a great quality. Nice and heavy and cuts very well. Super pleased with this purchase.",
        "This is an awesome pizza cutter, exceptionally well engineered, highest quality - you will never wear this one out nor will you ever want or need another one!",
        "Delivery was quick and this is the best pizza cutter ever invented!",
        "You can't go wrong with kitchenaide! Love my heavy duty pizza cutter. It truly cuts with ease.",
        "If there is ever a Zombie Apocalypse... I'm taking this with me...lol. Awesome Pizza Weapon.",
        "This pizza cutter is heavy in a good way and works very well.",
        "Best cutter I ever used, sharp (with cover), and solid.",
        "I worked at a pizza place for a few years and I wish they had cutters this nice. This has a nice heft to it, and best of all is the finger cover, which helps prevent you from slicing your index finger and spinning hot sauce onto your knuckles.",
        "So many pizza cutters rattle and break after limited use. This thing appears ready to cut titanium pizza. Its very sharp, comes with a protective sleeve for the blade (keep it, it was not just for shipping). We love it. Sturdy stuff built to last.",
        "Super heavy duty. Pizza cutter and brass knuckles all in one. This is my kind of pizza cutter!",
        "Probably the best pizza cutter you can buy, and it is not that much more money than your average pizza slicer.",
        "Love this thing! Needed a good pizza cutter and this thing is heavy duty! I think this thing would probably cut through a cardboard box LOL!",
        "The heft to the pizza wheel is wonderful and helps with cutting. I'm very happy with this wheel.",
        "If your looking at it buy it. You will not be disappointed.",
        "HEAVY duty pizza cutter here. Cuts pizza like a boss.",
        "Great pizza cutter so we bought one for our son, he loves it also",
        "So far so good. We don't eat pizza that often but I imagine that this can also be used for other pies.",
        "I just love this pizza cutter. Very well know brand that I have other applinances from. It is very sturdy and washes up well. The wheel doesn't wobble when you use it. I dont just use it as a pizza cutter. If I'm making home made noodles, I use it to cut the noodles, I use it to cut fudge, and I'm sure there are many more uses that I have not come across yet. Buy this pizza cutter and you will not go wrong!! I love mine!!!!",
        "Sharp and easy to cut. Make sure you take off cover. It worked but not as well LOL"
    ]
}