{
    "entity": "Carpentry Squares",
    "text": [
        "I purchased this to replace an old Johnson that had rusted out just hanging in the garage and the square was plastic. I didn’t even realize how much of an upgrade this turned out to be. The ruler is stainless steel, the square is zinc and has a hardened scribe built into it. On top of all that it’s made in the USA. What a pleasant surprise.",
        "Great U.S. made product, well constructed and durable in my use over the past few weeks in various household repairs. For the price, I characterize the value as excellent. The only downside is that I find the bubble level to be pretty much useless and I don't see why it's even included. The axis upon which the level works is based on the length of the black handle attachment...only 3-4 inches. It's difficult to determine levelness of anything substantial when the reference edge is so small. Just get rid of it!",
        "1st thing I did was check it for square and it is. fit and finish is good and tight. All the moving parts move easily enough with out being to easy. the measurements line up with other rulers I have.",
        "I bought this as a back-up to my old Stanley which has become hard to read due to a lot of use. For some reason the new Johnson Combination Square refuses to lock down when the locking screw is tightened. All so sliding the handle up and down the ruler is not as smooth as it should be. I’ve tried polishing the rule as well as lubricating the locking mechanism, but without improvement. It’s too late to return it, so I’m simply stuck with a defective Johnson combination square.",
        "I know, why are you leaving a review for a Combination Square? Sure, the straight, 90 degree, and 45 degree lines are straight, 90 degrees, and 45 degrees. Well, here it is, the amazing quality and outstanding price warrant a review!",
        "Checked it with Japanese Mitutoyo for accuracy and confirmed it is 90 degrees. Very sturdy as well. Had it for couple of days so cannot say anything regarding durability Made in U.S.A.!!! AND cheaper then Chinese ones.",
        "The square i received is different from the one pictured. The one I got has both metric and inches. For the way I work, I need only inches on both sides of the ruler like the one shown in the picture. Also feels cheap. Should have bought a good one.",
        "The combo square worked out for some quick simple jobs in a pinch but it was not even 75% accurate. The level was not reliable and the square has play. If you are looking for professional grade, spend the extra $ and get a good combo square.",
        "I use this thing every day for imprecise work. But, if I want it to be perfectly square, I have to hold another square up to it while tightening. Still, it's taken my abuse and it still gets used. There are likely better tools out there, but I like beating up cheap ones.",
        "Works great and holds measurements very well i would say that my favorite part is the scribe that comes inbeded makes it easy to mark your line",
        "Accurate and sturdy feeling, definitely good value for money. However, the machining on the locking mechanism was a little wonky, and it doesn't like to lock up all the way. It will lock up tight enough to not move around too much, but just not as strong as I would prefer. Good value for money.",
        "I am a contractor, and I did not expect this to be of as high quality as it really is. Very sturdy, very clean and accurate, and readable and fine lines on the ruler.",
        "Out of the box, I checked the 90 degrees angle against a square and using the lines on a flat surface. It was spot on. I also tested the cm/mm graduations against a digital caliper. Spot on again. It seems sturdy and well built. I’m happy with it.",
        "A basic combination square for a budget price. Well-made and durable. Great square to hang in your workworking shop.",
        "No Wobble, it is tight and any square that will do that and is accurate gets five stars from me. I like it very much only wish I had bought the longer one.",
        "Nice tool to have handy. Quality built and will get plenty of use. Happy to be able to support an American made product too.",
        "Works pretty well. Edges are kinda sharp. Had some manufacturing burr but nothing, too, serious.",
        "The one I received was not at a true 90, it was off about 1 degree.",
        "tool is of high quality. feels great in the hand is is smooth to work with and adjust.",
        "I really like this level tool it is made very sturdy it's very easy to use and it is very accurate",
        "Mine was pretty much perfect out of the box. Slide was true. Square was square as I can detect. Great value.",
        "This is a well-made, sturdy tool, and is very accurate. It is also USA made, which is nice for a change.",
        "Bought two of these and couldn't be happier. Much better than the plastic one I was using and couldn't read anymore. Found both to be square and accurate",
        "Well, its cheap price is what you get. The screw tightened all the way and the square still wobbled. I returned it.",
        "The knob is hard to turn. It looks like it has over spray in the threads",
        "I had one of these types of squares, but it was becoming very shaky, so I decided to buy one of these. The quality of this product superseded all expectations! Good buy!",
        "This is very sturdy and high quality. I love it!",
        "I was surprised by the quality of this tool.heavy duty construction make this tool a bargain.",
        "If you do any sort of wood work, you need this square/ruler. I can't believe I spent to many years trying to make precise measurements with a huge tape measure.",
        "I had an old square that I could barely read so I got this one to replace it. I like it.",
        "Works great. It's accurate when measured with my micrometer. Easy to flip around for metric use",
        "Made in USA! This product is well made & performs quite well. I recommend this product.",
        "use it everyday since i purchased it. Stays in my hands!",
        "Stainless steel, can't beat it. The old one I have has rusted out in the garage. That's why I chose this one for the workshop.",
        "Fairly ordinary, not made with pin point precision but certainly good enough for the price. This is one of the most useful measuring tools you can have.",
        "Slide doesn't even lock in place. Poorly built. Don't buy. I returned it on the spot.",
        "90 and 45 degrees are accurate, item feels strong and sturdy! Didn't give 5 stars only because scriber arrived broken (see image) so it cannot be used :(",
        "As advertised. The engraving on the ruler is a bit light for my tastes.",
        "The ruler was bent so I can't even use it. Returning it!",
        "Great Stainless Steel square at a very good price. Complete with Bubble Level and Scribe in handle.",
        "The product is sold and well made, but it is lacking finishing. The edges of the scale are very sharp and uncomfortable to hold and one has to be careful not to hurt himself.",
        "Good square. Nice and accurate. Sturdy as hell. Definitely worth the money. You won’t be disappointed. Just buy it.",
        "Perfect, well made and durable. Unfortunately mine came up missing at work but I do plan to replace it with this same one.",
        "Come precise right out of the box. His square has some sharp edges though and it heavy for what it is.",
        "Works just fine. I found it to be square and accurate to other calibrated tools.",
        "This product is ok but there are other brands that are better. I'd rate this middle of the road."
    ]
}