{
    "entity": "Carpentry Squares",
    "text": [
        "I am a professional furniture builder. I have always used a cheep try-square (combination square). I bid on a Starrett try-square from e-bay but was always out bid. After doing research I decided to buy this one because my old one had been dropped so many times, it was not square anymore. Wow!! I didn't know what I had been missing. This try-square is well worth the money. If you are a professional builder, you want be unhappy with this one. I most likely will never need another one but if I do, it will be another Starrett.",
        "A mid priced Combination square that is pretty nice it's square and the ruler moves smoothly and locks well however after having this tool for 2 years the level has lost it's liquid it has never been abused or dropped. I have a cheaper square that I have had 10 years and the level is still fine. At this price point I expected better.",
        "Finally I bought a good combination square, love it! It was dirty with grime and grease when I got it, I had to clean in thoroughly including the scriber hole with q tips. Remember it can rust so take care of that. I gave it a coat of oil before storing since I don't use it that often.",
        "I do a lot of woodworking. Woodworking requires a high level of precision. I have tried other squares but unfortunately they are not precise enough for making cabinets, boxes, and other woodworking projects. Are Starrett squares expensive? They sure are in comparison to other squares. But when precision is a requirement then you are going to pay for it. When you are working with wood that goes as high as $8+ a foot, then spending a little extra cash to ensure that your equipment cuts straight, that your cabinets are square is well worth the money.",
        "Starrett squares are the Very Best!! The carpenters square is the most important tool a woodworker can have, and with this square all of your projects will come out properly measured. If you take care of it, it will last you a lifetime!",
        "I love this tool... with one caveat... I bought it to replace my satin-bladed version which was stolen. The satin finish picks up marks (only to a degree, but not horribly), but is great for the fact that it doesn't reflect so much light into your eyes when trying to read very fine measurements precisely. The more polished blade reflects quite a bit of light, making reading a bit more difficult in good light... ironic isn't it?",
        "All around great product. If you are looking for Starrett you know what it is and the quality that comes with it. Buy once, cry once. The caliber of tool you can pass down from generation to generation.",
        "There just isn't anything like a Starret. There is just no other tri square that works this good. This is the kind of quality you would have expected in the fifties. If something was to happen to mine tomorrow, I would buy another in a split second.",
        "Excellent price for a starrett square But still expensive. Very accurate. Threw my 2 other similar squares away. Just handle with care. Etched ruler markings are helpful.",
        "Nice square but not sure it's worth the money nor am I sure it is any better than any other well made square. It is nice and heavy and works fine.",
        "I purchased this about a month ago and I can't believe I waited so long to do so. I was using a $15 combo square for years and I never realized how inaccurate it was. This was certainly worth the investment. The weight is so much better, the markings are crystal clear and the blade feels solid. You never have to worry about it being out of square and that alone makes it worth the price. This is the last combo square you will ever have to buy (unless you want two!)",
        "This thing is awesome. I've always heard starrett was the best and they weren't kidding. As a metal fabricator I use my square all day everyday and this one not only makes my job easier, its built to last. You can tell by the weight alone how strong this thing is. The measurements are all etched in so they won't rub off like those cheap knock offs. Bottom line if you have any type of job that requires a combination square. Starrett is the ONLY option. You'll save yourself a lot of headaches. You absolutely get what you pay for with this one. Thanks starrett.",
        "I am a hobbyist woodworker. I like to be very precise in my work. I already had the Starrett 6\" combination square and loved it so I decided to invest in the 12\" version. The quality is outstanding and it is another outstanding tool to add to my tool box. I recommend this tool for anyone who want (need) accurate measurements.",
        "This is my first Starrett. I've only used box store squares my whole life. When you get the box, you know you have a good tool. Just the feel in your hand is different. Then the first time I used it was like night and day. This is a lifetime tool that I will always be proud of when I use it.",
        "My old combination square was a Starrett. It was over 40yrs in use. It was my fathers. I still have it but decided to get a new one because it was getting hard to read. Of course I bought another Starrett!",
        "They don't make them any better than this to me, but i already heve it. am returning since i ordered the 6\".",
        "Went back and forth about this one. Just couldn't justify the price. After getting a little bonus money decided to splurge! Based on reputation, reviews, etc. should be a life-long investment. We'll see.",
        "This is a quality precision product. Very sturdy and well made. Worth the price.",
        "Starret is the obvious choice for unquestionable accuracy and quality.",
        "When you break you father in laws fancy Combo Square... not cheap, good buy",
        "I use it for all my project. I rely on this thing like crazy. It's very precise and sturdy. No problem, it does what it says it would do. I calibrated all my machines with this. They're now perfect.",
        "Very high quality product. Hardened steel. (not aluminium like some Chinese stuff). Very sturdy. Square to the dot. Only drawback is that the scale is in inches(expected from an American product).. but gets the job done.",
        "I had my first one given to me by the US Navy while in SWA in 2002, a year after 911. I just lost it last year, and I was going nuts this winter without it. So glad I was able to find another. These are great and stand up to the test of time...just don't lose track of it...",
        "This is now the best tool I own. Very clear and easy to read markings. Incredibly precise fit of head to blade. Just generally perfect in every way. Not sure why I'd move up to the more expensive models, this thing seems just fine.",
        "I'm a little disappointed in this square. The ruler has accumulated rust after just a few uses. Being in FL with a very humid garage, I assume that's where it's coming from. I take care of my tools but with the rust and stuff sticking to the ruler, it's very hard to read. That being said it's very accurate and I feel like it will last a while but I think I may look for a replacement because of the difficulty of reading the ruler. Another reviewer mentioned it before me but I ignored it and wished I hadn't. The other version with the easier-to-read ruler is more expensive. Wouldn't buy this again.",
        "I've been looking for a combination square that is of high quality. I've tried just about all of them. This one is truly a wonder to use. It's smooth, precise and easy to read. More importantly, it is in fact, square. It is a bit pricey to say the least, but if you want a precision tool, you're going to have to pony up a few extra greenbacks to get it.",
        "Don't know how one is supposed to write very much about such a simple tool, but here goes: I like it. Starrett makes good, solid, workmanlike tools, and you can't go wrong with one. Simple.",
        "I love this square. It has been and stayed true through all kinds of punishment an multiple falls. The measurements are perfectly accurate and I'd trust it for any jobs. The lock works great and it stays nice and tight, yet it's easy to release when needed.",
        "I've had cheaper combo squares that were way cheaper. I finally decided to get a good one. This is sooo nice. It slides really smoothly and just feels like a quality tool. Because it slides easier, I find myself using it more frequently.",
        "This was true with no wiggle or play when set screw is tightened. A nice solid piece.",
        "Great product. Arrived quickly. Having just returned to my hobby of woodworking, this square will be used frequently and help achieve good quality projects.",
        "getting a less expensive tool can sometimes lead to problems if it doesn't function as it should. this combi square is very well made and will last a lifetime. is worth the investment.",
        "Not a lot to say about the purchase of anything Starrett, other than \"you get what you pay for\". If you want accuracy buy a Starrett.",
        "Dang it. Now returning my second 11H-12-4R because of stains or scratches on the blade right out of the box. Couldn't clean this off and didn't want to start getting into abrasives and make things worse. Is it me, or does it make sense to expect a tool this expensive to be in better shape? Not a fan of shelling out more cash for the C33H-12-4R model in case it's somehow cleaner, but I've read it's got a slightly different finish on it.",
        "Like others viewing this tool, I hated the idea of spending this much on a combination square to replace an old non-functioning square. I figured a combo square from the home center would be adequate, so I first purchased one there. It was out about 1/8\" over the length of the blade, so i promptly returned it. This new Starrett square is absolutely dead square out of the box, and it includes a signiture of a Starrett employee putting his hame behind the quality. American made tool, by the way. Overall, it was difficult to spend this much on the tool, but it will indeed last for years and years providing perfectly square results. It really is worth the $$",
        "I bought this square to set up my woodworking tools. I am an engineer by profession and work with tolerances in the millionths of an inch. I got this knowing that Starrett is a name brand and has a long established history for quality. Overall I am pretty happy with this square and it appears to be quite accurate. If I were to find a gripe with it is the fact that the ruler has a flatness that is just over .010\" along its entire length, I checked with feeler gauges and almost sent it back but then convinced myself that this should be acceptable for setting up my saws etc.",
        "Great build quality. If you were in a prison fight and had to choose between a shiv and this combination square, you choose the combination square everytime. This thing could take out an entire cell block.",
        "As a wood worker I have found this product to superior to any other I have used. Very accurate, easy to read and take apart and put back together.",
        "Union sheet metal worker here. Use it everyday! Very Professional! No more Empire square from home depot",
        "No comparison between Starrett and cheaper squares. My old combination square had too much play in the slide and lock. Now I feel confident when laying out projects.",
        "Sure, it's expensive. It's the MADE in USA, dead nuts perfect, example of this type of tool. Buy it and get it right the first time.",
        "HEAD IS GOOD WRONG SCALE> COULDN\"T TELL FROM THE PICTURE",
        "Amazing. If your a woodworker, you need to own this...",
        "Tis Starret square is just what my husband has been looking for. I is accurate and he can read all the numbers and measurements.",
        "I have been a furniture maker for 35 years. My life is about tools. Every time I pick up this square it puts a smile on my face. Generations of experience went into the details of this instrument, from the weight to the finish, to the engraving of the blade, It is simply perfect. I have become frustrated with and have thrown away several Stanley and Empire squares. Insubstantial and inadequate. I will pass my Starrett on to my son. There are two sons though and only one square. This will be interesting.",
        "Excellent square. Good quality with easy to read letters. The fit and finish is really nice.really is the gold standard in squares for a reason.",
        "A highly-rated square that lives up to it ratings. A lifetime square with a little care. Keep a coat of WD-40 on it to control the rust.",
        "Exceptional quality is what you expect for Starrett and this square didn't let me down. A beautiful tool.",
        "Smooth action, sturdy construction all around well build tool. As a novice woodworker I quickly realized the importance of accurate measuring and marking tools. So, I have set out to buy the best that I can afford. In every review Starrett tools are the brand that others are measured by so when I saw this combination square for the great price here I jumped on it. I have owned the cheap combination squares and found them useless after a day or two. The rules wobble and become impossible to keep square. That is not the case with this tool. I know the price difference is great but it's worth every penny.",
        "Love it, if you would use this everyday then get it",
        "Waited years to get this combination square. Used a cheap plastic one for a while, then an old but cheap Stanley. Finally shelled out the money for the real thing. Now I wonder why I waited so long. You are reading these reviews so you already know this is the best combination square available. Just buy it. You won't regret it.",
        "Works just as it should, not a single flaw, very accurate. I would recommend to anyone looking for a good square.",
        "Some how my last one walked away on me. Glad it is still available as I had the other parts of the set in my tool box. Its nice there are still high quality tools made in the good old USA.",
        "Build quality is excellent. There is so much low cost junk out there it is refreshing to see a quality tool still on the market. I gave it as a gift to a beginning woodworker now I want one for my shop.",
        "This is a quality item, when you hold it in your hand you realize this is a precision piece of equipment. Numbers are easy to read and precise. Love the black wrikle finish. You won't be disappionted. It's a shame it so expensive, but quality in any product does not come cheap. Probley the last square I will need for years.",
        "What can be said about Starrett stuff? It all has a feel of substance and uncompromising quality. I already had a big, old, Starrett combination square that still tested dead accurate, but I wanted a new, more maneuverable tool (can anyone really blame me?)... so I got it. Crisp.",
        "It is square and slides smoothly. However, it is very hard to read the measurements on the rule.",
        "Im a contractor and use this tool almost every day. When receiving it I was a little surprised how heavy it was and it quickly developed some surface rust from using it outdoors. I take care of my tools and always wipe them down after use in the rain but this one must have a sub par coating on it. I may try wiping it down with some bees wax to help protect it better. The other prob I found with it was that the rule's edges are very sharp and need a bit of dulling with some emery cloth.",
        "I bought a Starrett 11H-12-4R Combination Square with Cast Iron Head and Black Wrinkle Finish, and it's stained and a bit of patina/rust on the blade. The head it's in excellent condition. I think this was for improper handling/storage. I'm from Mexico, so, return the square ts not an option because it's cheaper to buy another one.",
        "Very good product except for the fact that this model comes with a regular finish on the blade which is difficult for and old guy like me to read in the wood shop......so I exchanged it for model number C33H-12-4R which comes with a satin chrome finish which is much easier to read under artificial light. Having compared the two the 11H-12-4R is just as well made as C33H-12-4R.",
        "Blade rusted IN MY TRUCK! Didn't even leave it out in the rain. Not once. Do not buy this model, get a Stainless Steele blade.",
        "After using it to create a straight cut at 90 degrees, I found the cut to be off by about 2 degrees. I tested the squareness of the device and found it was not square at all."
    ]
}