{
    "entity": "Battery Packs",
    "text": [
        "This item looked like it was sitting on a warehouse shelf for years. The plastic wrapping was covered with dust and grime that had to be washed and wiped down. Also, there was a bar code label on it that someone tried to eliminate by using a magic marker to put a big dark circle in the middle of it. Basically, this is a disgusting looking package that I wanted to give as a gift.",
        "Perfect replacement for the original , the ONLY reason that I gave 4 stars on battery life is that I push my drill hard during work , and after almost an hour ; the 1st battery needs recharging . So I'm glad that my order consisted of 2 batteries. I swap out the drained one , with the fresh one , and keep working while the first one recharges.",
        "Battery is clearly years and years old as it did not hold charge very long and now it is as bad as the one I was replacing which was years and years old this was a waste of money. These can't be stored on the shelf for 8 years and sold as new",
        "When my husband put the DEWALT BATTERY on the charger, with in 30 minutes it had gotten too hot and lost it's shape where it wouln't even fit the drill.",
        "This is a perfect fit for my DeWalt DW996 power driver. It fits the tool like a glove in the drill motor and the charger. I charged it when I received it and used it once. Six months later it still had a good charge when I needed to use it again. Forget the after market referbs; this is the real deal and worth the extra cost.",
        "Haven't used it much so I can't speak on the run time. However I can confirm it is an original DeWalt battery in the original unopened package. Charged up just fine. When I bought this it was the cheapest price on line for an original battery brand new.",
        "Sick and tired of batteries that don't last. Finally broke down and bought this DeWalt battery. Pricey compared to other but, this one really lasts and holds it's charge much longer then these other bargain brands. Takes awhile for hard heads to learn.",
        "I don't remember buying these, but we have two DeWALT battery drills, and they are absolutely one of the best hard-working tools I've ever owned. They've done a TON of work for us, without the slightest hint of trouble. We've switched to using screws for almost everything -- because they're easy to drive AND easily removable. And oh yes, both drills are on their second set of rechargeable battery-packs -- guess I musta got them from from Amazon for price and delivery, and vendor reliability. Battery life is good -- though you should have the charger with you on every job, just in case.",
        "Better build quality than the aftermarket battery I bought 3 years ago. Works fine in my DW991, battery life much better but too soon to know how long that will last.",
        "My husband is very happy with his 2 new batteries. He had his drills for his vet 25 years!! So far no problems and don’t anticipate any. Dewalt has been a trusted name.",
        "I'm done with Dewalt cordless tools. When I t's cheaper to buy new tools just to get batteries there is something wrong. Finally threw my pile of Dewalt drills away and bought Rigid with lifetime warranty.",
        "Fits the equipment it says it is designed for. Charges fine - have used it once since purchase. Cannot comment on battery life as have not had it long enough.",
        "These are for an \"older\" drill. Not everyone carries them anymore. Amazon has the best price, by a lot. Charged them up, lock and load. Back in business.",
        "After calling the company to ensure that this battery would fit my charger (the model number changed), it fit perfectly in the charger and seems to be holding the charge well. Glad I went with the name brand instead of a knock-off.",
        "Could have bought new drill and batteries for the same price but this battery kept my 22 year old Dewalt going as well as ever. Rebuilt the drill twice myself and once professionally so this purchase saved me from junking a perfectly good tool.",
        "I have a Dewalt 14.4V cordless finishing nailgun that rocks!!! Found this new OEM battery at a great price. Very grateful.",
        "Even when I fully charged it, it would only run for a few seconds. My thinking is that I got a factory defect, but these things happen.",
        "Still the best battery for the money. These last a very long time and are worth the price.",
        "Fit my dewakt dril perfectly. Item exactly as described. Packed well and shipped quickly. A+ seller. Would recommend.",
        "Cost effective, works so much better compared to the wore out ones I had",
        "This battery was exactly what I needed for my DeWalt drill. My old battery lost the ability to hold a charge. This new battery gave new life to my old and trusty drill.",
        "I did not want to toss out the old XRP Drill. It's one of Dewalt's best drills. One of the original batteries did not hold a long charge after a short use of the drill. Like the other reviewers have said, this battery is compatible with the XRP 14.4v drill and holds its charge very long before needing a re-charge. Better than the original battery that came with the drill. It fits the original charger perfectly. Very good product!",
        "First go-round I had my original DeWalts re-powered by an independent battery rebuilder and was disappointed. Second go-round was a set of black and yellow knock-offs...what junk. Third go-round was back to the genuine OEM batteries...happy at last. Quit trying to save money and poney up the cash for the name brand batteries and be done with it!!",
        "Item as described and price was good. would purchase again.",
        "Much better than the cheap knockoffs I bought and have tossed after a few months because they fail to charge after a short while.",
        "Ok Everyone, Like many of you I own Dewalt AND Black & Decker tools, These batteries work very well , I bought 2 to replace my older ones.. They came blister packed , fast shipped, & New.. They work like a charm.. MY Only Complaint is they are Outrageously PRICED !!!!!! But if you want a quality battery, This is what you want... THE PRICE is WHY I don't Give it 5 Stars !!!!!!!!!!!!! Enjoy, Buy one today, you'll be please what Long Lasting power it brings to your tools !!!",
        "My husband needed a replacement battery, he seems happy with it.",
        "I can't say that DeWalt is better than other lines of tools, I haven't sued them. But I can say that the several DeWalt electric tools I own have exceeded my expectations. Most of my tools are 18V and I have used 18 Volt XP batteries for some time. But I do have a 14 V. drill which has shared a battery with a flash light for some time. This new battery is not a replacement, the several year old battery works okay but sharing had become a nuisance. The new battery (XP) holds more charge than the old one (not XP).",
        "I had a dewalt cordless drill which wouldn't hold a charge for more than about 5 minutes. Being as it's a dewalt and fairly spendy I wanted to keep it in service so this was the solution. After reading the reviews of the the china-copy's on here and elsewhere I decided it was probably best to fork over the money for an OEM style. Glad I did almost a year later and still charging great.",
        "the price is right and the batteries gave new life to all my old Dewalt cordless tools ... FYI for those who might not know it the battery base is pretty interchangable for all different size Dewalt tools so these 14.4 V batteries work just fine in not just my old 14.4 V cordless drill and finish saw, but also my 9.6 V drill and 12 V drill and boy do they ever hum with the larger capacity battery ... they run faster and stronger ... even the the light 9.6 V drill has some real brute force now :)",
        "Nobody can beat this price battery is a little bigger than original one that's ok it still fits in hard case update still running strong as day I purchased",
        "Works just like the DeWalt battery I had originally. I always have two batteries so one can be charging when the other is in use. So far no problems.",
        "Seems like the manufacturers change the battery voltage every few years to force you to buy a new tool. Thankfully this was available on amazon",
        "Bought DEWALT 14.4 drill years ago with 2 batteries. Was so pleased that now I have several other pieces of equipment which use the 14.4. Lost one, bought housebrand replacement from local battery warehouse, 1 year latter this junk died. Checked around for a DEWALT replacement. Saw this one and the price was very good. Bought it. WOW! This thing has got plenty of juice and staying power! Am buying more right now! If you like the original 14.4's, you'll like this one even better.",
        "Just what I needed. I cannot comment on Longevity. The battery life seems to be good so far.",
        "I researched the generic batteries on Amazon.com but decided on the original equipment batteries, (2), and am glad I did. The XRP batteris are a tweek larger and heavier than the original but seem to have longer run time than the original DeWalt batteries that came with the drill. I may have paid just a little more for these but so far I am very pleased with the result. I would certainly recommend these batteries!",
        "Good price . Dewalt batteries suck compared to other brands. They work fine when new, but go downhill quickly. I have 3 of the 14.4 drills, and a small circular saw. The saw just sucks the juice out of these batteries in a few minutes. The actual battery life , before being replaced is disappointing. I use them as a back up drill, one drill for driving and one for drilling so I don't have to keep going back and forth changing bits.",
        "Had to buy a replacement battery after the old ones just wouldn't hold a charge any more. After reading the reviews on the knock-offs, I decided to pay the difference for a DeWalt battery. It's worth it as far as I'm concerned. The brand name ones that I bought initially lasted 10 years with not daily, but steady use.",
        "I've had a 14.4v DeWalt drill for about a decade now. After the original batteries finally died, I had them rebuilt. When they died again a few years later, I looked into having them rebuilt again, but then I discovered that it's actually cheaper to replace them with these new ones. I could not be happier with them. They work great and they were MUCH cheaper here than from Home Depot or other local stores.",
        "This is a lot better battery than came with the drill. This last me about 4 years, pretty strong, and as a backup for another year or 2. after about 4 yrs it will start to loose charge even in the case. I am a retired contractor and use it mostly around home.",
        "I purchased one of these to replace an original XR 14.4 volt battery that came with a drill/driver. Have only charged and used it once so far. The only drawback is that the XRP is a little fatter than the XR so that the carrying case does not close with the battery attached to the drill. I priced them at Home Depot and couple of other online sources. The Amazon combination of price and free shipping beats all the rest.",
        "This battery lasted a lot longer than the original battery that came with my DW928. I purchased it in 2010 and it just died last month (May 2015). I didn't use it every day, but I did use it a lot. I've already purchased another.",
        "My battery’s we’re getting old and what a difference with this new one!",
        "Well this works. But its been sitting on a shelf for 10 years.",
        "Although it doesn't last forever, DeWalt makes an awesome battery pack, able to drive through dense materials with high torque. Unfortunately, DeWalt also wants a high price for it. Here I got the exact same product at about 1/2 DeWalt's price -- and that pleases me greatly!",
        "Works just like the original battery that came with the tools that I purchased 10 years ago.",
        "Boy, I'm glad I opted for the XRP DeWalt version of this replacement battery rather than cheaping out on an aftermarket replacement. Worked right out of the box, REALLY lasts longer, fit both the drill and the original charger perfectly. I recommend and would buy again.",
        "My husband likes DE Walt products, so after having his drill with only one battery, a project came up that couldn't be delayed. Needless to say the project took way longer than it needed to because he had to keep charging his one battery!! After that he came in and ordered his spare!!!",
        "Yesterday I was charging this product up fully for the first time and it totally did a melt down I`m glad it did not burn down my shop! I`v only used my drill a few times and this is the first time I was using for a big project-I`am glad that nothing serious happened but I would appreciate it very much if you would replace this product with a new one or a refund my money.",
        "Can't say I am crazy about the batteries having, to me a relatively short life, but dewalt battery tools have worked for me. Three drills, a small circular saw, and some others they are great tools. This battery got me up and running again and reminded me of the continuing cost of wireless tools....a cursing and a blessing",
        "I bought it as a replacement for one of the two that came with the Dewalt kit . It was bigger than the original & would not fit in case right . And it started loosing its charge sooner than the original one that care with the kit .",
        "Bought as a repalcement battery for drill, adivce for those needing batteries.... buy a new drill, it's actually cheaper and you get two batteries for the price of one replacement battery.",
        "This battery pack was purchased for a portable xray unit (which accepts the original dewalt battery). Based on the good reviews I decided to try it. Some slight modifications had to be made for the pack to seat properly (there were some extra plastic tabs that had to be ground away). Otherwise... works like a charm so far. Time will tell for how long, but considering the price, its value cannot be beat",
        "the product arrived in plenty of time for my Deck project. My old batteries would not hold a charge. I believe the 14.4 has as much torque as 18v but it is lighter, for all day use.+ has a 1/2in chuck. I was an Industrial Mechanic for several years,and used the Drill every day on most projects...",
        "I purchased my DeWalt cordless drill some years ago with 2 batteries. I had one go out and purchased a cheap refirb. The old saying you get what you pay for held true - I think it lasted about 18 mths. I pick this one up and it seems solid. Hopefully with the brand name - it will last as well as the originals.",
        "The battery pack works great..!! I was unsure about the purchase initially thinking the battery packs might be substandard, but they are great",
        "These Dewalt batteries work great. Easy to install and remove. The battery has a fairly long run time as well.",
        "This item was unavailable for purchase where I live and I was not about to shell out for a new set of power tools that worked perfectly well and just needed new batteries.",
        "Save yourself the trauma of crappy Chinese knockoffs. Works like the original. Holds charge until it’s done, unlike the copies which fade fast.",
        "This battery is great. I have been using the standard battery for a while and watching it die to quickly. This XRP has made that a memory.",
        "I had not used my Dewalt drill for about 2 years because the original batteries had died. So rather than buy a new drill I decided to give these replacement a try. They arrived ready charged, both worked well. I have recharged one of them and it seems fine. So far so good. I'm hoping they last longer than the originals.",
        "Using the XR and XRP battery side by side in a real world construction and carpentry enviornment reveals that the XRP does indeed exceed measurably over the XR battery. I am happy with the battery life and power in the XR battery, and thus I am overjoyed with the added life I find in the XRP battery. Also, in the few lag times my batteries get, I find that the XRP is superior in charge retention over a period of days if inactivity in comparison to the XR. Overall, Dewalt has made a good product in the XR series even better in the XRP. Upgrade when you can!",
        "This battery works better than the old one, new tech I guess. The only thing was that my drill case didn't close when the battery was left in the drill, you have to remove the battery to fit it in the drill case. Small give back to endure but well worth it for a better battery. Great buy, makes my drill last 40% longer before charging again.",
        "works like original and at a price lower than Lowes, which had to order.",
        "Good replacement. No mAh specs are included with the battery but it performs like a new DeWalt battery should. $64 seems pricey but it is infinatly better than the off-brands that I have tried. You get what you pay for.",
        "The battery fit my dewalt drill perfectly. Fully chargers and ready to go.",
        "This battery is not holding a charge, Don't know if it was damaged in shipping. The air bubble wrap was deflated in box, so there was no protection of item.Or maybe battery is just defected. Will have to contact Amazon to see what they will do. Not Happy with this item",
        "I purchased a DeWalt 14.4 volt battery replacement for my DeWalt drill and flashlight. The replacement was nearly impossible to remove from the drill or flashlight when pressing the release buttons. You basically had to use two screwdrivers to pry the battery from the drill or flashlight. I brought this to the attention of Rock Sales, who promptly contacted me via email and instructed me to send the battery back to them along with a copy of the email. Within a week or so, I received not only one replacement battery, but two and both fit the drill and flashlight perfectly. Now is that customer service or what. Rock Sales rocks!",
        "Batteries - they are expensive, but you've got to have them. And it cost just as much to have them rebuilt as it does to buy them new. I appreciated the quick delivery and will probably have to be replacing my back up battery soon.",
        "Bought two, one is still kicking 5 years later, the other died after 2 years.",
        "Needed replacement of older XR 14.4V batteries, and could not find locally. Home Depot would special order for twice what I paid for them. Only issue is that XRP is thicker in some spots than the old XR type, so had to whittle the partitions in drill case in order to get lid closed. Better life per charge than the original XR type. I only own DeWalt power tools, after trying several other brands.",
        "This is a genuine Dewalt Factory battery, no fit or power capacity issues. And it has more anps than original battery. Dont rely on those cheapie knock-offs, this battery fit perfectly in my drill and charger.",
        "I've had my DeWalt for over a decade, and it didn't come with XRP packs. These replacements are awesome. The only drawback is that with their slighter taller profile, the spare doesn't fit in my drill case, however the drill with pack inserted still fits.",
        "Altho I read the reviews,& the price was good, I thought that maybe I would not have the problem the reviewers had. That problem being that the new battery is too LARGE for the storage unit. Of course it works on the drill very well but you can't close the case. I would still make the purchase because of the amount I saved.",
        "The XRP battery gives a much longer useful run time. I like the 14.4 volt system as it seems to give more torque than the 18 volt models. However, the 14.4 volt system is pricier so you will have to consider the price difference and your expected amount of use before committing to this line of products.",
        "Price was great. By the time you buy two batteries you could usually buy the gun, batteries and battery charger for the same price or less. I had just purchased a battery at a local store for over 81 dollars, including tax, when I came home I went to Amazon and found this product for just under 50 dollars with postage included. If I hadn't marked the other battery with my name and date I would have returned to the store and purchased another one through Amazon. I feel I finally paid the appropriate price for a tool battery. Also arrived in a few days.",
        "I received the batteries as promised and immediately put them on my charger. They both got an A+ for performance. The down side is they are not made in America. We will have to see the long term performance on these imported batteries. My original Dewalt batteries lasted over 10 years and one is still ok.",
        "so far it is a lot more powerful. time will tell how much longer a charge will last. the standard 14.4 battery was pretty poor and only lasted about one year and only held a charge for one to two weeks when sitting",
        "Purchased two of these and they loose there charge from just sitting in my truck, don't have this problem with all of the 18 volt batteries that I have that are the same dewalt XRP items. I would blame it on myself for infrequent use except the 18 volt batteries don't have the problem.",
        "Works just like the original battery. Cheaper than buying a whole new drill set. Works Great",
        "Awesome due to easier to remove from the drill than the old batteries. Works as expected and no problems fitting in the drill",
        "Perfect replacement for my DeWalt xrp drill. Fit great, charged fast and has already worked many jobs on the farm. Amazon had the best price, period.",
        "Saved at least $10 compared with Big-Box store cost. Was delivered a few days earlier than originally forecast. Solid performance. Agree with others who like that manipulation of the release lock tabs is easier than with the original design battery due to the modified shape. Haven't yet \"modified\" the case to accomodate the new shape.",
        "Not a whole lot you can say about a battery. It either works or it don't. The DeWalt battery is well made and gives good service. I have been using them for several years and they have a good service life.",
        "I bought the two-pack. Each of these batteries has more power and lasts longer than both of the original batteries when new. They are slightly larger than the original batteries but fit in my drill and skill saw case without modifying the case. I highly recommend them.",
        "Great price for one of these. Usually I end up buying a whole new drill with a battery included almost for the same price.",
        "Hi, I recently purchased the 14.4 Dewalt battery because i needed one, really two, but the two pack deal was gone, dog gone it. Anyway, the battery works great and saved me 25 bucks too. The free delivery clinched the deal. Happy with my purchase.",
        "These XRP batteries are a lot better than the original battery if your drill was made after about 1999. My original batteries only lasted about 3-4 years on my new drill (purchased 2004). I have a Dewalt 14.4V I bought in 1994 and still use the original batteries. One word of caution, the XRP batteries will not fit in the older drill case whether on or off the drill because they are larger. The older case has a more molded appearance on the inside and is double wall plastic.",
        "This replacement battery worked right out of the box. After soome use and a fresh recharge it's still going strong. It seems to have a longer charge life then the original Dewalt. I looked into replacing the actual battery pack after reading some how-to's on the web. But after seeing what it entailed the price of this replacement was too good to pass up. The OEM battery lasted almost 6 years so if this battery lasts that long I will be happy.",
        "Did not hold charge and it might be a copy of the real thing.",
        "Nice to be able to find the older 14.4V battery at a price that doesn't make me just want to buy a new drill and save money. Looks the same, fits the same, works better than the old one. No problems charging it up or using it in the drill.",
        "The brand new battery pack is slightly taller, thicker and heavier than the standard pack. The drill runs much stronger than with my 8 year old packs and it lasts a long time. I didn't realize just how bad my old packs were until I got this one. This is a great deal.",
        "OE part; you pay the price for original dewalt parts",
        "One of my 2 batteries died quite a while ago and the other has been fading, but I put off buying new ones because of the cost. Made my purchase here as Amazon has the best price and made it less painful. Charged both new packs and now have done quite a bit of drilling/screwing without even switching to the second one yet. Loving it. A fantastic difference with a new battery and the fact that it's an XRP, too.",
        "These are simply the best batteries for use with your Dewalt drills or whatever you have that runs on 14.4 volt. The battery charges in one hour giving you the power to complete almost any project and when you set your tool down the battery stays, it dosen't discharge like most all cheap batteries,these are simply the best batteries you can buy period. They hold a charge while not being used so that your ready to go when the next project comes up.",
        "Brought new life to an old drill, and saved me from having to spend much more for an entire new setup.",
        "Good battery for my right angle drill - works great!",
        "My 14.4v DC728 DeWalt drill (3 years old) has outlasted 2 other ones, Royobi and Hitachi, still going strong and with the power needed far exceeding the competitors. I have just ordered another drill and battery for my back up. DeWalt may cost a bit more, but as the old saying goes, \" you get what you pay for\"!",
        "My DeWalt drill is at least 10 years old. You get used to dying batteries until you reach the point they're unusable. This new battery is stunning--great power, holds it's charge while in the drill and on the shelf, and I feel good about not having to dump the old drill. I don't think I'll ever need a second battery, and I wonder if I was not shortening the life of the old ones by constantly having one of the two in the charger all the time.",
        "I just purchased two batteries before heading off to long island to gut my mother's basement post Huricane Sandy. I needed only one battery in my circular saw to cut away 3 rooms of sheet rock."
    ]
}