{
    "entity": "Battery Packs",
    "text": [
        "This is the 3rd set of batteries for the awesome Dewalt 7.2 cordless screwdriver. First set of 2 batteries lasted about 6 years. The next 2 batteries lasted 4 years. Hopefully these last a while. The 1 cordless drill is 10 years old and 4 years ago we just bought a whole new drill kit so we had a spare drill and extra charger. We use these in business to work on computers, light drilling duties, furniture assembly, etc.",
        "This was purchased to replace a failing battery. I knew that I wanted an OEM battery (setting aside both sides of the conversation on OEM vs. other manufacturers) but given the reviews where people were sometimes (too often) getting \"fakes\", I was worried. This was an original and is working well. Only reason for marking it down was the \"belief\" on my part that the price of batteries is too high.",
        "First was my surprise that these batteries are still in production. My battery powered screwdriver has to be about 20 years old, and still going! Package was well padded and arrived faster than I expected; battery charged with no problems; and except for the date of manufacture looked exactly like the last one I bought in 2009!",
        "Harder to find these batteries and will really be bummed when they quit making them as my little drill is my main use drill since it is light and easy to use but still has the strength to general use stuff around the house. My original batteries have lasted 5 years.",
        "I have purchased these batteries as well as the Powerextra 12v 3000mAh Replacement Batteries, both from Amazon. These batteries are twice the price of the Powerextra batteries and last more than twice as long. These batteries lasted well over 6 years. The Powerextra batteries barely lasted 3 years. Moral of the story: You get what you pay for.",
        "My DeWalt electric screwdriver DW920 needs these nicad batteries. There are no LiON replacements, not yet, anyway. I charged them both and have been using them for several weeks on a project. They're OEM just like the originals, no problems. Happy with the purchase.",
        "It was nice to positively find genuine OEM Dewalt 7.2V batteries at a reasonable price. I have been looking at a lot of them online, but it often seems difficult to determine whether I would be buying the real thing, refurbished batteries or generics, which I wasn't interested in. Thankfully, these are exactly the same DW9057 1.7 Ampere-Hour rated batteries as the ones that originally came with my Dewalt DW920 cordless screwdriver. They are working just as well as the old batteries did when new, so overall I'm very happy with them.",
        "Purchased 2 of these batteries as a replacement for my original that finally died and I am not impressed with the quality. I don't know what the difference is between the battery that came with the tool verses these replacement batteries but they don't last long at all after a full charge. Definitely not worth buying.",
        "I have a Dewalt 7.2 volt screwdriver that uses these batteries. The tool is extremely useful because of how light these batteries are. They also have a great capacity and had plenty of charge for any project I have attempted. We use Amazon for most of our purchases and I update my reviews if anything changes with the products. I do this so other Amazon users can get a real feel for the life of the product. I am not associated with any company and all opinions are my very own.",
        "We had purchased cheaper, third-party replacement batteries that did not last more than a day or two between recharges. Fed up, we purchased a pair of DeWalt batteries a few months ago. The DeWalt batteries are far superior to the others. They last for weeks before needing to recharge. We use them daily and have no complaints about them at all.",
        "This worked great! What else is there to say? (I think when I purchased this back in 2013, the price was several dollars less).",
        "Genuine Dewalt product in factory packing. Works great in my electric screwdriver. No reason to buy the knockoff, many of which get poor reviews, when you can buy the real thing at this price.",
        "I was glad to see I could buy a replacement battery for my Dewalt power screw driver. The new battery works great and my electric screw driver is back in working order.",
        "this is just a replacement battery for the 7.2 volt power screwdriver made by Dewalt. This is a solid power source and seems to hold discharge for A fair amount of time. This particular model by Dewalt is one of the most powerful units I have ever used. I have had mine over 8 years and it's still will do everything I want with a huge amount of torque.",
        "True DEWALT Battery not fake as others reviewd as such",
        "I bought this 7.2 volt Dewalt cordless driver on e-bay and the batteries would not hold a charge. The Dewalt rep advised me when I called that the batteries were six years old when I bought it, so I ordered a new one from Amazon and it works fine and does a lot of work before needing a charge. It has changed my mind about this tool. It really is a workhorse and powerful enough for most projects that I do. I don't even need a second battery to do most of the jobs that require a drill.",
        "I am now able to use an old DeWalt driver that I thought would be lost to this world! New batteries just gave it a new life!",
        "It’s a battery to run a tool To soon to rate life.",
        "The pictures and product description(s) are possibly misleading. It shows 2 (two) batteries in the photos and in the product description at the end states there are 2 (two) batteries for basically $62. I did receive 1 (one) authentic DW9057 battery but would like the other battery or my money back so I can purchase 2 batteries for basically the same price $65 from the DEWALT factory outlet store. 1 (one) battery for $62 is very overpriced and not worth it.",
        "This battery fits one of my most used tools, the dewalt screw driver. I use it every weekend, some week days, and have been using it for about three years. Battery life is very good, usually an hour or two of steady use. The unit comes with two rechargeable batteries, that charge quickly. I purchased a new battery because one of the two originals after three years of steady use has started to loose its ability to hold a charge very long. The new one works great.",
        "I bought this as a second battery to use with my power screwdriver. The DeWalt has more power than the B&D and generics that I've had in the past, and this battery helps keep me going all day. Amazon/DeWalt had a deal on DeWalt products, so I got this with a vac, free shipping, and saved a bunch! Good service and FAST shipping! I received my Super Saver shipment faster than another product I ordered the same day and PAID for shipping!",
        "I use these batteries for my screwdriver I purchased almost 10 years ago. I use it in electrical construction daily and battery lasts for 2 days under normal usage. If you can get the old Dewalt 7.2v screwdrivers (no longer at my local Home Dee-pot) grab it while you can. These are great for electricians and low-voltage contractors alike!",
        "Only had for about two months. We will see how long it last.",
        "They charge up pretty fast and last a pretty long time, depending upon your task. They can last for years depending upon your demands.",
        "the electric screwdriver is my favorite tool. don't know what happened to the last battery, but it's gone. this is a great replacement at a fraction of the cost. works like a charm.",
        "The original batteries for my DeWalt drill would no longer hold a charge, so I purchased two of these at what I felt like was an extremely good price. The first one charged right up using my original charger, and works flawlessly with the drill. Haven't charged the second one yet, but I expect it to perform just as well.",
        "This is not a real DeWalt product but an aftermarket replacement battery. After using it for several months, and properly draining and charging it every time, it just does not hold a charge for long. I haven't gotten nearly the time between charges with it as I did with the real DeWalt battery. It drains very quickly.",
        "Used for an older 7.2 v screw driver. plan to get some more life out of it.",
        "I bought this battery as a replacement for a dead work tool battery. It works well and as expected. I say \"as expected\" because one of my primary job functions is to supply 8-10 commercial field plumbers with tools/material and over the years we have noticed a decline in the quality of Dewalt brand power tools.",
        "fast shipping, these are hard to find in most stores, theses are orginal dewalt not an aftermarket battery. i have had problems with the cheap rebuilds and foreign exchange batteries in the past. Being orginal dewalt they work fine and are new. Also saved about $20.00 for the pair versus in retail store Plus no tax and free shipping right to the door.",
        "Shipped fast and holding good charge. Works with my charging unit.",
        "DEWALT does not make the drill that uses these batteries, but it is such a good drill, they still make batteries to fit it.",
        "Hard to find these batteries in our city. As usual if I cannot find things here local I know I can find them on the internet and Amazon is usually the first place I start. The batteries are new and have the power and lasting power they should have. I am very pleased with the purchase and the speed in which they arrived. Thank You!",
        "Battery is Factory replacement , Bought one From DEWALT and came in same packaging same label on Battery , Holds good charge.",
        "This battery is better than the cheaper battery I bought 6 months ago.",
        "congratulations DeWall is my favorite tool brand. I would like to receive promotional products to decorate my professional and hooby workshop. excellent product Good quality, works great I am satisfied. meet delivery time. the vendor is serious negotiation.",
        "Unbelievable! Battery price is a few bucks more than aftermarket. With this small difference dollar difference, why bother saving a few bucks with aftermarket batteries and hope it doesn't blow up or ruin your charger? Not worth it! DeWalt did the right thing and made this battery very competitive!",
        "If you use the tool that requires this battery, its a good bargain for a hard to find battery!",
        "They seem to work just fine and seem to be holding a charge.",
        "It only took a couple of days for my new replacement battery to arrive and it is exactly as advertised. I put it on the charger until the charging light said it was done, then put it to work. There is no difference between this battery and the one I'm retiring, except this one actually holds a charge.",
        "I bought a couple of third party batteries like these a couple of years ago and neither lasted very long. This time I bought these Dewalt batteries and I feel they will last a long time like the original Dewalt batteries did. Guess you get what you pay for.",
        "Holds a great charge to replace 2 that didn't anymore because I left them sitting in the garage a few summers here, (gets to 110), which kills batteries, very happy with this one",
        "was so glad to be able to find a replacement battery. It arrived quickly and fits the screwdriver great.",
        "Great, Replaced some old ones that I had.These works great. Thanks.",
        "I haven't been a fan of the Dewalt products but this battery seems to be working well. Recharge is good and I have no complaints.",
        "for my cordless screwdriver. appear to be authentic dewalt batteries. with moderate use, the original batteries lasted almost 5 years. i am happy to get 3 years from batteries like these. the best price i could find was here on amazon.",
        "Was a replacement for a much older one that died. Charged and worked well.",
        "Not sure how people are thinking these are real Dewalt batteries... they are NOT. I have attached 3 pictures. Not only are these not real batteries they are knock off chinese garbage batteries. I put them in my charger and they squeal like someone is getting pinched. The charger doesn't want to charge them either... Tried three different charges. Do yourself a favor and do NOT purchase these from this seller and get the REAL dewalt batteries from Amazon that are sold in a single pack! -Nigel",
        "[...] These batteries are perfect for my Dewalt Drill Driver. I use this tool every day and spare batteries are a must. As the batteries will sit without use some times for days and they still hold their charge makes me very happy.",
        "Good quality battery. Don't buy any aftermarket batteries. Expend a little bit more.",
        "We had a very hard time finding this battery in any store, even the battery specialty stores. The price here seemed reasonable and so far, works perfectly. So glad we found it, the tool would have been useless without a battery.",
        "have three of these screw drivers because the battery were to expensive so I would just buy the whole kit. There great for my work and just powerful enough for a screw gun. Now I can get the battery at a cheaper price.",
        "Ordered another battery for my husbands battery screwdriver and 1 had gone bad and would not stay charged...this one works great!",
        "I love my few years old DeWalt screw driver and rejoiced when I found that replacement batteries are available. The new battery was delivered on schedule and works as well as the batteries with the device when it was new. Thanks.",
        "My headline says it all. Because well that's all that I can say being that I bought the wrong damn size. I thank god I was treated well and fairly on my return.",
        "I was given a small DEWALT power hammer screw driver kit by a friend. When I went to use it the original battery was bad. So I purchased this replacement battery and now all is good.",
        "I bought this as a replacement for a battery that came with the original DEWALT product and I find it very reliable.",
        "Its a battery and it works. Although I gave 4 stars because I wish they would last longer (cycles not battery time.)and the cost is a little spendy considering the price of the drill 2 batteries and a charger really isnt that much more.",
        "Charges quickly in a Dewalt charger. Always good to have additional backup batteries so you don't run out of power when there's no time to wait for a recharge.",
        "As good as the batteries that came with the original (power screwdriver). The only drawback... not much more and you can buy the whole screwdriver kit new with new batteries.",
        "They work well, I just hope they last longer than the other six before them.",
        "Charges well, holds a charge as expected and is a perfect match for the OEM battery I replaces.",
        "I use battery operated tools almost exclusively. The DeWalt drill-driver that uses this battery is amazingly powerful. I keep several back-up batteries charged and ready to go at all times.",
        "Great!! Holds the charge. My husband is very happy with the charger - he was able to complete projects without having to stop and recharge.",
        "The spare DeWalt 7.2 volt NiCd battery makes completing the job easier allowing for continuous power after the original batteries run down on the job site.",
        "Purchased this battery to replace the one that powers my cordless screwdriver. You just can't beat the price and it's the same product found a big box home improvement stores for around $15-20 more.",
        "This is a genuine DeWalt battery, and at an excellent price. Be aware that many of the batteries offered here and elsewhere under the DeWalt product number are from other manufacturers -- maybe equal or better, or maybe not.",
        "After putting up with batteries on the edge of their life, this replacement came as a godsend. It keeps it's power and charge through long use, re-charges quickly, and over-all is a great value for consistent performance.",
        "Able to get a very useful tool back in service. The 7.2 volt battery size is hard to find, but Amazon came through. It was cheaper to buy a new battery than have the old ones rebuilt!",
        "This Dewalt NiCad battery that I purchased through Amazon.com is in all appearences an exact duplicate of the battery that I am replacing it with. So far the battery has worked as good as the original battery.",
        "What my husband was looking for and less expensive then buying through Home Depot or Lowes",
        "works as expected and less money than Home De Pot or Lowe grade stores",
        "Too bad its a Ni Cad. Doesn't appear they ever upgraded to Lithium. Use on DeWalt Screwdriver",
        "No issues. Slightly more snug than original, but works fine with no problems.",
        "The DeWalt 7.2 volt drivers get used all day in a compressor warranty analysis lab. These DeWalt batteries hold up much better than the clone batteries we have tried. Price at AMAZON is best I could find.",
        "There's not much to say about a battery! This little guy does his job and keeps our tools humming, buzzing, and getting the job done!",
        "These are great batteries and a great valve for the cost. They are dependable and I use them a lot.",
        "The old batteries for my DeWalt power screw driver died after many years, and this one replaced...well, one of them. It works as advertised, although a bit steep in price.",
        "Not much to say here! The battery arrived relatively drained as expected, threw a full charge on it and now my DeWalt cordless screwdriver/drill is alive, alive, once again...tackling all of those jobs the tool is perfect for! The old/original battery lived for 5 years before I finally had to spring for this replacement, so I guess I should be good to go until, what? 2015???",
        "I have several drills that use these batteries and they hold up as good if not better than the original. A good price for a good product.",
        "Great replacement battery. Save me much money versus buying at local store. Works great after 1 year. Good value for Dewalt.",
        "I didn't realize how bad the old batteries were until I started using the new ones. The screw driver always worked well, but when the batteries died, that was it. Big box stores can't be bothered with reasonably priced replacement parts - the guy at L...'s didn't even know there was a 7.2 volt battery!!!",
        "Battery out of the package had a good charge, which is was a good sign. I fully charged it and am very happy with how it performed.",
        "The purchase through Amazon was quick as I had the tiem within two days. Perfect replacement and i'm back to work. Since switching to DeWalt tools, I've had very little trouble at all.",
        "Good price for replacement on my DeWalt screwdriver, which is an excellent product. One battery is easily enough for most casual uses.",
        "I used this to power my space ship to Mars. It is working remarkably well considering.",
        "i bought this battery for an extra one to have on charge while using the other batteries. a very good value, the price was right",
        "I was glad I could still buy it. I have had the screw driver for a few years.",
        "As usual with AMZN, all aspects of the purchasing & fulfillment processes were first class; thank you! Our negative comments are reserved for the batteries themselves. We've spend too much money on replacements. We'd really believe in the batteries if overcharging could be avoided.",
        "These work just like the original ones that came with the screw driver. They are doing a good job now.",
        "I purchased 2 of these for the best price and got them from amazon. My old ones had finally wore out and wouldnt charge up. These new ones got my dewalt screwgun back to 100 percent and running screws like the unit was doing when I bought it brand new. Thanks amazon for the best price I could find anywhere.",
        "I GOT THESE BATTERIES FOR MY 7.2 POWER SCREWDRIVER. THEY GET HEAVY USE IN MY HANDYMAN BUSINESS, AND PERFORM VERY WELL. I RECOMMEND THEM TO ANYONE WHO NEEDS SUCH A TOOL. JOHN",
        "I bought the cordless screwdriver while working in the Los Angeles area. The tool was a life saver on the work I was performing. You have to have the battery to make it work. The previous batteries were great and lasted a long while. I only wish the dewalt battery had the same fuel gauge as the Milwaukee batteries",
        "My screwdriver drill is back in operation. In use for about 6 months now. Very happy. Would buy this again. Recommended.",
        "It is good to finely find a battery for the old screwdriver of De Walt. Works well and took a charge right away.",
        "I use my compact screwdriver every day and having extra rechargeble batteries in my garage and truck keeps me going and going and.....",
        "This battery is an exact manufacturer's replacement and works as good as an original new battery and is identical in appearance. My original battery lasted about 5 years.",
        "What can you say, DeWalt is a Great Product. Only wish the batteries would last longer but all manufactures have the same problem. Amazon's service is outstanding.",
        "It was what I needed and not able to find any where in Miami. I have ordered batteries from Amazon for my Nikon camera. And they were from China and luckey for them to last for 25 pictures. This battery was from the manufacture and is fine.",
        "These are OEM batteries, they work very well, They hold their charge for a long time and the run time is excellent."
    ]
}