{
    "entity": "Hand Trucks",
    "text": [
        "It's not a bad light weight folding cart. It's easy to fold up, the wheels roll smoothly and it has a nice size load plate, deeper than most full size dollies. I loaded three, 40 lb bags on it and never completely tilted it back, as soon as I saw that it was bending, I stopped trying to tip it back to roll the bags to the cash register. I just assumed it would lift 120# since it's rated up to 150#",
        "We used this as a car seat carrier in the airport during a trip with a long layover. It worked perfectly! We used an S-carabiner and the latch straps to secure it, had our toddler ride in it, and then folded it down to put in the overhead bins on the airplane itself. Way better (and less expensive) than the official \"carseat carriers\" on the market!",
        "Terrible design. The wheels are too far back to act as a decent fulcrum, so if you have any weight on the platform, you have to keep a lot of pressure on the handle (pressing DOWN) to keep it balanced. Decent carts are designed so when the load is tipped back, there is at least some weight required to be held by hand...but this works opposite and makes pulling the cart troublesome.",
        "Unsteady cart, it will not hold not even 50 lbs of weight on that fragile base. It's false what the seller claims that it holds 150 lbs. I'm very unsatisfied with this item, a real rip-off. Do NOT buy it, folks",
        "This worked for about a year then the wheels would not push out all the way. This resulted in the card wiggle when pushed and actually collapsed once with me pushing a 60 lb load and I tumbled forward. Maybe it is just my cart but after a while the cart became dangerous to use.",
        "Be very careful loading this cart with heavy objects. I am awaiting a CT scan but may have a fractured jaw from a blow to the face from the cart handle. I was loading a 50lb bag of sand onto the cart and the handle quickly flew forward into my teeth, splitting my lip. I will see a maxillary facial surgeon in the morning for further treatment. My mother was injured by the same model cart when she loaded a case of water onto it, it flung forward into the top of her head. The cart is flimsy and tips over otherwise when carrying boxes of cat litter so I would not recommend this for anything over 30-40lbs.",
        "Handle extended and retracted about 15 times now it is stuck open cheap junk",
        "Everyone who works with me knows how much I love product modeling, today was no exception! This afternoon, I received my amazing 30 dollar hot pink Magnacart from Amazon. (Earlier this week, the Amazon Primenow dude had one and had like 8 cases of water and 4 packs of soda on it. Apparently, this fingerlight baby has a 150 lb weight limit on it! I was colored impressed!) I knew that I needed a quality cart for toting all my physical things between offices and around the office, stat! I was even more stoked when the hot pink model was 3 bucks less!",
        "I use this cart 5 days a week for work. I move about 15 loads a day with it. Nothing terribly heavy, but it is so handy because it folds up and fits in a vehicle very easily. I'm on my second one. I get about a year out of them. They don't last forever because the gears inside break. The wheels eventually don't fold out easily and you have to force the cart and wheels to unfold. Its a pain but they don't make these to last forever. I'll probably try another brand next time to see if they last longer. Decent product but it won't last forever.",
        "I am leaving this review four years after purchase. I wouldn't buy it again if I had to do it over. The handle is too short so I have to bend over when moving something. The aluminum shelf and wheels do not operate smoothly when folding up or opening, I have tried oiling them. I have to force it to open by standing on it. If you are moving three cartons all the same size, they won't fall off the shelf, but anything that isn't a rectangle will need to be tied on. I think this cart, even with all its good reviews is junk. It has never worked for me.",
        "Initially it appeared as a great concept because it's compact and foldable, but the quality of execution and materials were lacking which led to a wear/tear around one wheel such that it does do not unfold to a strait position rending the whole thing unusable after 5 weeks of light use carrying 15 pounds, see pictures.",
        "This thing lasted about 2 weeks before it broke at the base. Wasn't hauling anything really heavy. Just didn't last. Great concept because it's conpact and foldable, but just can't stand up to even light amounts of weight",
        "I had hoped to use this cart to transport a large cooler of food from my car to the house. But even with bungee cords I couldn't attach the cooler securely enough and the load platform was too small to simply balance the cooler on. Moving through snow was extremely difficult because the wheels weren't big enough. And the handle wasn't quite long enough for me to stand upright even though I'm only 5'3\". Maybe I just expected too much from a cart that was small enough to fold into my car. My poor choice, not necessarily the fault of the cart manufacturer.",
        "Bought one of these and then bought a 2nd for another person. Super useful. I've been using this for 2 years at least once a week and it has held up and saved my back to boot. Four stars instead of 5 because a low load doesn't balance well;; it takes 2 hands to lean the cart back for transport.. For a Costco run, or similar, I use a plastic egg crate down low and then stack a flat on top of the egg crate. Getting a little weight up higher makes this cart a little more balanced in real use. Highly recommend this cart if you need to move things from the car to home.",
        "I had the old model for about five years and it was great. I loaned it to a friend who must have totally overloaded it and the wheel mechanism failed. The new one is great and easier to open. The only thing I had to do was drill two holes in it for a bungy cord to hold items in place. However they had little round circles showing where to drill. That is the only reason I gave it 4 stars. If they were predrilled it would have gotten 5 stars...but I would highly recommend this product",
        "Used this as a car seat carrier with my son in his car seat as we made our way through the airport. I attached his car seat using a tight bungee cord. It worked great, and was easily stowed in the overhead bin on the plane! It's much cheaper than the carts that are dedicated to carrying car seats.",
        "Got it for moving my groceries to my apartment in the 3rd floor. It has been a life saver for me. It is light and compact but build quality is not good. It's rated to 150 lbs but I would never put that much weight. It is not sturdy enough to handle it without tearing apart. At half the weight it feels very flimsy specially when fully extended. Overall I'm satisfied but expected something sturdier. As long as you are not putting too much weight or going through stairs frequently it should be fine.",
        "This is not a substitute for a real handcart. This is only good if you have to move a stack of lightweight boxes. It's just not sturdy enough to handle anything heavy. It does fold up very flat, though. The handle is also a little short, which is annoying. Get this if you need to move office file boxes that are light. Don't get this if you need to move anything else. It advertises a 150 lb capacity. You're not moving anything 150 lbs with this. Maybe 40 lbs at best. But that would still be awkward.",
        "I bought this one in July 2013, and I am not using it that often, so far for about 10-12 times only. But currently one of the wheels won't open automatically when the support plate is swung down from its towed position. I had taken some pictures showing that the \"spring/cam-locking\" mechanism had failed (this company should make this part out of metal instead of the current plastic material). Unfortunately this Amazon feedback tool does not let me load up files, so you can't see the failed part for yourself. For this problem. I would not recommend buying this item as it does not last very long.",
        "Remember that this is a \"hand\" cart and not to be used for extremely heavy stuff. It will surely bend out of shape if you use it past the limit. This is a great product for items that are too awkward to carry and a little too heavy. Good for small boxes or those Target purchases that come in ridiculous packaging. Also recommend buying some bungee cords to accompany your hand truck. This helps secure boxes to the cart and not fall off when moving over door frames and humps",
        "I like that it folds up compactly and is easy to store and carry. It won't hold anything that overhands the load tray as there is no leverage to tilt the cart back. I took a chance - hoping it would help me with a heavy cat in a carrier. Nope. However, it is OK for some smaller stuff. I knew it wasn't designed for more. Hoped it would also work for luggage but it doesn't do that either.",
        "I travel extensively with a Medical Alert Service dog and must take dog food for 28 day trips. This cart is incredible on cobble stones, stairs, cement surfaces, dirt roads. It does fit down an airline isle, and also European Train Isles . The cart is excellent but you DO NEED BUNGEE CORDS to hold items on. We have 4 of them and use them extensively for transporting donated medical supplies for projects as well as 50 pound double dish-crate U-haul boxes when we travel on international projects. I also just used mine to move a washer and dryer when painting the kitchen area. HIGHLY RECOMMENDED. Do not buy a cheap folding luggage cart as they quickly break.",
        "This dolly is probably shorter than most, but since I am just 5'2\", it's a good size for me. Being elderly and arthritic, I have trouble lifting. I am currently packing to get ready for a flooring crew to install new flooring throughout my home. I put the empty box on the dolly platform, pack the box, tape it, and it's ready to roll. When I get it where i want it, instead of lifting it, I just tip the dolly forward and the box slides off and right into place. Wow! What a great help! It will get a lot of use, so thanks for making this item.",
        "I'm a teacher and needed a cart for hauling my supplies, papers, and projects back and forth. Most of the carts marketed specifically to teachers seem pretty flimsy, but this one looked like it would do the job. I have a small bungee cord and a milk crate, and this cart is so smooth-rolling! I ended up having to use it to move all of my boxes and rugs in at the beginning of the year, and it handled like a champ! I was also able to help out a teacher down the hall who needed to move some furniture down a few rooms. I love how it folds up so small when you're not using it.",
        "I know there’s many more uses for this, in which I’m confident it would apply for your purpose, but here’s why I bought it. A very easy to tool for my 78yo mom. She can no longer carry items from the car into the house. This has and will help moving cat litter and heavy grocery bags. It offers a huge value her independence to continue living unassisted. Know if I can only get her to pay the gas and electric bill on time....if your in the same boat I’m in you’ll understand what I’m talking about.",
        "Pros: compact; lightweight; no hassle open and close; rolls nicely on hard level ground. Cons: may be a problem loading a box that is deeper than the platform; I don't see this cart carrying anything near 150# without bending the handle; an issue carrying about 60lbs over a curb, and probably major destruction trying to drag it up a home stairway; not very bungee friendly.",
        "I am a Pilot and have used a Magna Cart for all my trips. It have traveled the world with me for over 15 years and never failed until recently. It has been a good friend and never asked why all the heavy stuff and moving around so much. I was glad to find they were still made. I purchased another one without hesitation and it was actually made a little different (to the better) and will last me I am sure until my career ends. I would recommend this to anyone, anywhere and for most purposes. All I can say is that it worked for me whenever it need to, rain, snow hot and cold.",
        "I deliver car parts. I have a weak back. This really helps when i need to move car batteries and large brake rotors. It has a couple faults. 1. As others have mentioned, if you are 6' or taller you have to bend down to use it as the handle is too short. The frame is a bit too fat making it hard to make bungee cords attach. The area right behind the lifting piece has a large gap. I had to get some rope and fashion a woven fence so small items would not fall through. Even with these issues I give it 5 stars.",
        "Why didn't I buy a dolly sooner? We've always seemed to need one - moving offices, moving houses, moving storage units, taking loads of donation items - there was always a need and for some reason it didn't occur to me to buy a dolly/cart. This thing is super awesome. I love the way it folds down and is compact. It's carried TONS of boxes of heavy law books that I'm pretty sure weighed more than 150 lbs, but don't take my word for it. The only thing I'd change is making the platform a TINY bit longer.",
        "This light and collapsible hand truck is so handy and tough. I use it so much in my daily weekly life now that I don't know why I didn't buy one years ago. I carry it with me to pickup large heavy parcels and boxes, a case of wine I take from my car and wheel up to my apartment. A large unwieldy box comes in from an internet order and I take it downstairs load it on and wheel it upstairs. No strained muscles, dropping or stopping frequently. I recommend this product very highly.",
        "Using this, dozens and dozens of plastic totes, and rolls upon rolls of 3M shipping tape, I was able to get more than half of my belongings from my old apartment onto the New York City bus, then subway, to my new home over the course of a month. Worked just fine and still does. Only complaint is when it's folded, it doesn't lean very well. It's like a weeble; it prefers to be upright even when the wheels and shelf thingie are folded in. Which would be fine, but it doesn't stay up. One slight push or bump and it falls over. Highly recommend storing wedged between two things. Like, say, heavily packed plastic tote boxes.",
        "I am female and, I rarely strength train like I should, so I have an upper body strength level that would probably allow a 1st grader to beat me at arm wrestling. Magna Cart enabled me to move a huge,heavy, old fashioned TV that I literally could not budge from the ground more than half an inch of one corner into another room in my house. I did it with relative ease and--all by myself (Independence!! YES!).Then it folds up and stores like it's barely there. Probably one of my top 50 best purchases EVER!",
        "I have mobility and balance issues and was seeking something that didn't take up a lot of space, like a full-size hand truck, to help with moving bulky items around my house. This little gadget perfectly fits my needs: collapsible, strong, and easy to use. I have used this type of hand truck before and there is one caveat: don't overload it! It isn't an appliance or furniture dolly. Respect it's limits and you are sure to enjoy years of service from this handy little hand truck.",
        "I purchased this for our Carnival cruise to help us carry our sodas aboard. This is exactly what I was looking for. Something strong enough to carry 5 cases of sodas while being compact enough to fit into my suitcase to bring back home. I purchased some adjustable bungee cords to go along with this and it worked perfect. The base of this is wide enough that 2x12 pack cans of sodas can sit side by side instead of having to stack them in just a single stack. Awesome hand truck!",
        "Purchased to help move somebody into an apartment. It folds up and collapses nicely and is easy to fit into the trunk (or even a large suit case). It worked great moving boxes, end tables, etc. The support for the wheels is plastic, so don't overload. I think the 150 lb capacity is probably accurate, but did not come close to testing those limits with what I was moving. For what it is (a easily to transport and use hand truck), it worked great. I am very happy with it.",
        "Not the biggest on the planet but for most needs up to 150 lbs this little baby is strong! Much better than the piece of junk offered at the big box stores! While you're not going to move the refrigerator with this unit, it will handle that 3 drawer file cabinet as well as some of those heavy boxes! Around the house and everyday projects this unit is very dependable and we love how easily it unfolds and folds back up. Well engineered! I would buy it again!",
        "I have had 2 of these for many years. Other colors. Very handy. Great for 5 gallons of water, 5 gallons of Paint, etc. Small stacks of boxes etc. I got this one for Mom as she kept \"forgetting\" to return mine. Pink color insures my brothers will return it to Mom, unlike other tools that just disappear.",
        "This cart is awesome! I bought it in advance of a move where I knew I would do the heavy lifting and unloading by myself. I've moved several objects close to 100 pounds with this cart, and it makes them feel weightless. The cart itself is light and easy to store in my small apartment. The platform is small, but even massive objects (a queen-sized foam mattress!) will stay put if you hold the cart at the right angle. One minor downside is that the handle doesn't extend further. I'm 5'8 and sometimes have to crouch when attempting the afore-mentioned proper angle for bigger objects.",
        "Purchased the Magna Cart Personal (150-lb. Capacity) Aluminum Folding Hand Truck (black) in July 2018 for shuttling boxes/plastic-tubs of art/craft supplies across a university campus. This little hand-truck is a true workhorse! Throughout the week-long Children's Fine Arts Day Camp this hand-truck functioned flawlessly and handled with ease whatever I stacked on its wide base. The telescoping handle was a dream; it seamlessly expanded/collapsed upon command and never faltered. Thanks to this wonderful light-weight hand-truck, I was able to participate fully in our week-long children's camp even though I was nursing a painful shoulder injury! Can't say enough about this great hand-truck! I'm purchasing two more to give as Christmas gifts to the teachers in our family.",
        "I use this to schlep my bass guitar amplifier and associated stuff. It works great for that task as these don't weigh more than the rated amounts. It also folds flat so it is easy to pack in the vehicle(s). The hand truck is not made for super massive items, but as long as your needs match the specs, it serves well. Suggest you add a pack strap to keep items on the truck when tipping back, which is the only inconvenience of the device, and an understandable one. Some people use bungees, but a pack strap will always be more secure.",
        "This is an excellent cart for baggage or whatever. I knew an audio/video producer who used one of these to move his equipment on location and I wanted one. As I recall they were running over 100 bucks then. When I found I could get one for under 40 bucks, I jumped on it. They work great for many things around the house or on the road. Going to the home center for something big? Throw it in your trunk. I even move heavy flower pots and planters around when I am mowing. The fact that the base plate sits flat on the ground is a major advantage over the cheaper luggage carts. What a back saver!",
        "I use this at work to schlep bulky materials around after getting tired of hand carrying them through doorways and down long halls. Just about right for carrying a ream of printing paper, proposal boards or similar office duties. Folds up very compactly. A certain coworker who never saw a problem asking people to struggle to move things by hand was quite surprised by this superior (and frankly more professional) counter solution. Opening the cart one-handed with a push from your foot is possible, altho it can require a little force to get the wheels to swing open. Not intended for moving heavy or large items. Hire movers or use a solid steel hand truck for that.",
        "This 2 wheeler is just what I needed. My husband gets home dialysis and the boxes are heavy. We get a monthly delievery of boxes and they are put in dining room. Every night when I hook hubby up, I have to carry one of those heavy boxes to other end of house. I have a bad back so some nights I had a really hard time. This 2 wheeler makes it so much easier and then I quickly fold it back up and lay on top of the hill of boxes.",
        "I give multimedia presentations and lectures, and I always have a lot of gear I have to truck in and out of a variety of venues. This is a very elegant solution: light and easily foldable to fit in a niche in my car's trunk. You'll want bungees and/or adjustable straps to stabilize your load, and you should keep in mind that this is not a refrigerator dolly. The handles probably wouldn't like to take a really heavy load over rock-strewn ground. This is more of an urban solution (asphalt and cement) than an all-terrain vehicle. But it's just about perfect for light applications.",
        "Absolutely LOVE LOVE LOVE this handcart! We had one already, discovered a friend had a great need of one on a regular basis (except he didn't know it). We gave him ours -- he is extremely pleased -- and we bought a new one for ourselves. Might I say the one we gave away, though a few years old, is in just as good condition as a brand new one. The best part is the fold-in tires so this takes very little space in your trunk or van. High quality too -- others may be a little cheaper (or even a little more) but none have as high a quality as the Magna Cart in our opinion.",
        "I bought this eight years ago to carry items that I should not lift due to a bad back. For me, it has been a lifesaver and I would not want to be without it. It folds and unfolds quickly and effortlessly. It is lightweight and easily stores in tight places, such as my car trunk. I use it almost daily, and it still works as well as the day I bought it. I don’t think you could beat it for the price and I highly recommend it.",
        "The handle wouldn't extend all the way up, no matter how hard I tried to make it work. A pain in the neck to return it. I found another one (Milwaukee brand) at Ace Hardware for $10 cheaper, which is a miracle, since Ace is usually so expensive. I wanted to like this thing, but it was defective, and the company never contacted me to replace it. So I bought another brand.",
        "Had a cart much like this that I left behind as I was hauling around classroom materials. Thenold cart was less than half the price of this new cart, but there are a few differences in quality. First, this Magna Cart has an easier release for opening. My old cart had a button at the top of the handle that would stick at times. The Magna Cart has a smooth bar release that is pinch free. Next, the Magna Cart has a heavier load carrying capacity. Lastly, this cart is pink...PINK. I think that alone is worth the price lol. My old cart was purple and green. OK, but this one is PINK! :)",
        "This is a very nice, easy to use and cheap solution. With it holding 150lbs of weight, it took more number of rounds, than it would have taken with a dolly holding 300lbs, but I am happy with how useful it was during the move. Moreover, it also useful while moving some big items for household purpose. So it is also useful apart of move. Loved it!, Great product.",
        "this item came in handy, i had a broken hand and had to move so i wasn't able to lift or carry boxes. Compacts nicely, wheels are good, extends handle. reading other reviews people stated the frame broke, and i agree. if you have heavy load and try to lift backwards, i don't think frame can support weight. i was assisting tilting back so wheels can support the load. for $35 its good, but don't use it for heavy lifting, i doubt it can support 150lbs, maybe on wheels but not lifting back. now i used it for groceries or a trip back from costco.",
        "I had one before which I got it from Costco. I dont remember who took it and never returned back to me. Costco is no longer carries it. I can not wait for Costco. Then I bought this one. It is more expensive than Costco, But it is good quality too. I wanted to clean up my house since the quarantine. Now I started to move my stuff around the house. It is very easy to fold and open. It is strong enough for daily use.",
        "This. At my first use it became considered as essential in my life. How many times have I needed a box moved, asked politely, and the w a i t e d for days for someone to move it for me. No more. I am 66 years old, have osteopenia in my neck. What. A blessing to find this on Amazon. Changed my life! Great for moving contents of Subscribe and Save boxes to their storage places. Just great!",
        "This is a nice lightweight hand truck. The stated capacity of 150lbs is somewhat optimistic, probably 100lbs is more realistic. We use it around the house to move large boxes and to carry large boxes to and from the airport, much better than a rolling suitcase when moving large items. We especially like that it is light weight and compact size, it will fit in an overhead compartment on a plane. Highly recommended for the $, but get a heavy duty hand truck for really heavy (greater than 100lbs) items/boxes.",
        "This thing lives in the car 24x7. It has been used for two home moves, countless super heavy and large IKEA boxes, and a mini-fridge or two. It is a back saver and cuts the amount of trips to the car to load or unload. Have used on 80-90lb boxes with no issues. Wheels have no issues over door plates but might need an extra push if you have a heavy load. Would buy another one if I could operate two at a time.",
        "The big advantage with this product is that it folds to very small dimensions. Even the wheels fold in. It opens quickly and easily. But tilting it back with a full load of boxes makes the handle bend somewhat precariously. So I lower the handle to tilt it back then raise it when it is tilted back. I realize that it is a tradeoff between storage size and overall strength. If I had to do it over again, I would choose the 4 wheel cart that can be converted to a hand truck for boxes. But if you don't plan on using it that often, then this products small folded size would be preferable.",
        "Good product for what it is. But I can really only handle a couple of boxes at a time because the stack unds up taller than what this dolly can hold. I would recommend getting bungee straps, if you want it to hold more. I have a feeling that a large heavy, loads, would make this break. Only for small items. Otherwise, it does fold up nicely for the trunk, and the wheels roll smoothly.",
        "Bought this for my wife to do her counseling events. It's sturdy, good-looking, clever design. solid components and easy for even my wife to open and close and put in her car without breaking a nail and calling me to come rescue her. JUST remember to buy some bungle cords since this doesn't come with any and you will need them to hold stuff to the cart when you load it up to unruly merchandise. 4 would be perfect. 2-3 foot length maybe a 4 foot also. Good hand truck.",
        "This is a smaller kind of dolly that I got while living in an apartment complex. I sometimes order things that are a bit awkward in size to carry all the way back to my unit, or its much too heavy for me to carry back to my unit. This dolly folds up into a small rectangle. it doesnt take up much space at all and is highly functional. Many of my neighbors kept asking me where I got this and how nice it looked. Its going to be a great help when I move out.",
        "The hand cart is not meant for heavy duty use like a construction site or heavy warehouses hauling; but it can not be beat for home or office uses. it feels solid and well made for the purpose of moving 150 lb or less. It easily carts filled file boxes, cases of bottled water, or any other office or home item with in it's weight capacity. It's operation of collapsing or opening up is so simple and easy you would not believe it. The only negative is it is not made for stairs, but still manageable.",
        "I love this cart. One of the places I work (a wine shop) has one of these and it has always worked great and held up to the weight. I bought a different cart from Walmart that broke on me within the first 3 months of having it so that's why I got this one. I love how easy it is to lengthen the handle and how smoothly it rolls and folds up. For the price, you can't beat this one!",
        "This is a must have in your possession. I moved 2 kids to college and this little giant carried 2 large Uhaul boxes plus something smaller on top. It rolls easy, turns easy and literally folds up its tires and base into a reducible flat item. Lightweight but strong and durable. Extends its handle to accommodate a tall person using it. Highly recommend as a graduation gift!",
        "Got this for my dad. He is a USPS carrier. Sometimes packages and mails get heavy. Wanted to help him out. Got this for him. He used it daily. Unfortunately, someone stole it when he was working. He ask if I can order him another one. So.. Totally worth it.",
        "This cart was perfect to move my big clay pot potted plants around outside and even up steps (with help) to bring them in for the winter. I have used it for a number of other items when I needed an extra hand and didn't want to wait :) I do wish Magna would make the wheels a little bigger to move easier on gravel or uneven pavement. Also, with the bigger wheels have them set a little lower so when moving certain things you don't have to tilt it so far down. For $30 purchase this handy dolly is beyond my expectations! A must have!!",
        "Having damaged my shoulder, I can no longer lift heavy items, yet every month I receive 44lb boxes of juice and of cat products which are left by my door, or worse, by my mailbox. The hand truck allows me to get them into my house with easy, and then take the items out from there. It folds nearly flat and fits easily into my utility closet when not in use.",
        "Used this to get through airports at 3AM with a car seat strapped to it - with my son in the seat, with another car seat strapped to my backpack our little one in the stroller, with our other bags and luggage. Needless to say I never wish this experience of going through an airport with kids on anyone witbut I am grateful that I had this. This is a definate must have!",
        "This is a wonderful product. The one limitation, noted by other reviewers, is that the arm does not extend far enough for people over six-feet to use easily. Hopefully the company is reading these reviews and will offer a model that works for the ever-increasing numbers of people in that height range. Other than that, this is truly an outstanding product that I would strongly recommend to anyone. It's efficient in the use of space, strong in being able to hold relatively heavy items, and appears to be durable. It comes fully assembled, so you can start putting it to use immediately. It easily fits in the trunks of medium- and larger-sized motor vehicles.",
        "This is pretty useful for small, lightweight things. I bought this to move car parts around the garage and it doesn't seem to meet the weight rating it is advertising. Its maxes out at around 80lbs. Past that, the plastic starts to creek and looks as though will buckle when I try to move it. Not for heavy objects",
        "I've used this to move almost all my furniture and heavy items into my apartment. I'm talking Ikea furniture, a huge chest, storage bins full of paper and kitchenware, large mirrors, etc. Sometimes you have to be careful about making sure the item stays balanced on the hand truck, but the portability of this product outweighs the negatives. And closing the hand truck is really satisfying because it packs up so small and nicely. I've had this for almost 2 years and it's still great.",
        "This thing was a real life-saver during my solo move, sped things up dramatically and probably stopped me injuring myself. I'll probably find uses for it down the line. I find the 150 lb load rating somewhat dubious. The retractable frame was already flexing significantly well below that level, and it's only made from lightweight tubular aluminum after all. I also wish the wheels were a little bigger or there were stair-climbing features built in. These small wheels (~5\" diameter) did catch on stairs with extended overhangs. 2020 update: still holding up just fine after another apartment move.",
        "This is our second one. It folds down easily. It is not very heavy. Easy to store. Holds a lot of stuff. we added bungie cords to hold stuff on better. We used our first one for two years. It got weekly use. Everything from walking to the grocery store to moving furniture. This cart held up great. The only reason we bought a new one is because we live in a salt air climate (Florida). We have rust around the wheels that was making it hard to open and close the wheels but they still worked.pressure. We were afraid we were going to break it so we got a backup just in case.",
        "I bought this as recommended by a fellow small market vendor. It's a fantastic little tool for hauling boxes of merchandise and supplies from the car to the market venue. It folds up very small and flat so it takes up almost no room in the car, which is important to me. Most of my car space is taken up by merch and supplies, but I slide this in on top or on the side in the tiny space left over. It's also very light and easy to handle and fold/unfold. It's easily one of the best things I've bought for my little shop!",
        "Bought this to haul around a tool bag I use for repairing equipment. This is really a nice hand cart. Folds away easily a d doesn't take up much room at all. The wheels roll smooth and are quiet. Lifting the cart tongue automatically folds the wheels. No issues with it after about a month of daily use! It's been almost a year now and this cart has held up great! I have even started using it to take into stores when I am on a dog/cat food run. No cart to have to return!",
        "Used this little gem for move in weekend at my sons college. So glad we had it. No issues what so ever. I felt like the smart parent. We didn’t use it to go up the stairs, which I probably would not recommend. As long as you don’t overload it, this should work for you just as good as it did for us. Since it’s compact, it’s a nice little addition to our “tools” at home.",
        "This is compact and easily tucks away in your car! I LOVE IT and use it almost daily! I have to haul things back and forth a lot (for my job) - and this makes my life soooo much easier! Plus its very handy to have it in your car! It's extremely compact - very easy to open and close - and does what you need it to do, when you need it to do it! Great purchase! Very durable - great quality. Really glad I bought it!",
        "I bought one of these a few years ago for myself and recently bought another one for work. I keep one of these in my car as it folds flat to about 2\" thick and comes in handy whenever I stock up on beverages. It is sturdy and easy to use on flat surfaces. I use the second one at work to transfer supplies around my workplace. When I am done, It folds flat and stores out of the way.",
        "I ordered this to strap my car seat onto to make getting through the airport with my toddler alone easier. It is very sturdy and I was able to use the latch straps of the car seat to secure it to the hand cart. I rolled my son in his car seat onto the plane and through the aisle, making it much easier than taking him out and trying to carry the seat, the carry on and direct him to his seat. It folded up quickly and was very easy to operate. Much more reasonable than buying the car seat-specific cart for $50 more!",
        "This is a really nice cart and perfect for modest loads of 50-60 lbs, NOT suited for 150lbs as rated by MFR in my opinion. This is a great size for personal/occasional use, but we wanted it to carry camera equipment cases in the 50-60lb range and while it will carry them, the wheelbase is a bit narrow, the wheels are too small and the overall frame is too flexible in my opinion to safely do so. Could you move 150 lbs on it, I'm sure you could. Could you transition over curbs, door jambs and uneven ground, I say no. Again, very nice cart but for light duty only. We returned ours and ordered the next size up.",
        "well made, strong and the bottom plate is very large. There are plenty of places to hook bungee cords and that is excellent. Holds multiple stacked items of different sizes and the items could be mixed boxes, packages, baskets. an excellent buy",
        "Again, I wish the handle was several inches higher. Also, I wish there was some sort of cord that could go around the item you're hauling to keep it in place. Items fall off easily.",
        "I love this cart! I am under 5' tall and over 65 years old. Despite these two facts, I am able to unfold the cart bottom and wheels with one hand, extend the handle, then load it up and tilt it back with no problem. On the other side, I can fold it up, collapse the fpgandle and carry it easily eith one hand and store it. It is unobtrusive everywhere I have thought to store it. Thinking of giving it as wedding presents from now on.",
        "I keep this under the cargo area of my SUV. I get large deliveries of dog food shipped to my office, and this made it a breeze to move the boxes from the loading dock to my car. Each box weighs close to 40 lbs, and I can load two boxes on this cart at a time. It maneuvers easily through the shop and office. Saves a lot of strain on my back!",
        "I just moved into an apartment and I live alone. We have a package locker system, so all my packages have to be brought in my car to my apartment. This little cart has been a lifesaver, and a back saver!! It is so light, easy to fold up and fits perfectly in my car. I have used it to move many awkward sized packages, including lightweight furniture. I can stack smaller boxes and get them in one trip. Love this cart, can't say enough good things!!! I do live on the ground floor, so I have never used this on stairs. Great little cart!!",
        "I keep this cart in the barn primarily for moving around 50-80 lb. bales of hay. It's perfect for that! I've had it for nearly a year. The wheels and platform are heavy duty and have held up well despite what I have put them through. The Magna Cart folds up compactly and opens in seconds. I love how the wheels fold flat and don't stick out. It's out of the way until I need it, and then I'm quite glad that it's there.",
        "I bought this to haul my ~35lb guitar amp on the way subway for gigs. I've only used it twice so far, but my first impressions are positive. It is a simple, compact design that is easy to fold up when not in use. While the wheels looked flimsy in the pictures, I actually found them to be pretty robust in person. They handled city streets fine. It remains to be seen how it holds up over time, but it handled my first couple of trips well. I will update this review if I start experiencing issues.",
        "I used this cart to transfer boxes of books from my car to display tables several hundred feet away. The cart worked, but the handle was too short (granted, I'm tall) and the bottom platform not quite wide enough, even for standard-size boxes.",
        "We are musicians. We have a light rock trio. Our PA system is the Bose LII, for example. Everything we have is light, even the bass amp. But the handle of this cart bent and cannot retract anymore. The package on it at the time was maybe 80 pounds. I will not buy this product again. Yes, it is affordable, but still, a waste of money.",
        "Based on another person's review and the outrageous price for items dedicated to wheeling around a car seat, I picked up this collapsible hand truck. It worked perfect for my Britax Marathon car seat. I purchased a luggage strap and strapped it to the hand truck. It worked well both with and without my 21 month old 25 lb toddler in the seat. It easily fit in a luggage compartment aboard the plane. This was an awesome deal and worked very well for me. The only problem is that even when fully extended the handle is on the short side. At 5'10\" with heels on, I had to bend my knees a bit to pull/push it along.",
        "I’m not a super tall person (only 5’7”), but I have to walk kind of bent over with this dolly to keep it from flipping upright if something is on it. Yes, even with the handle fully extended. I moved a 30 lbs mini fridge and 20 lbs printer with it. My back was hurting about as much as if I had just carried them.",
        "It is very practical. I really liked how easily it folded back to its smaller position & it seemed to go right onto your shoulders like a purse or easy to carry in your hand. I did not like that the metal part of the base that holds the items broke & split right in the middle after only a month or so. I can still use it & will just weld it back but I never put more than 150lbs onto it. It’s a nice inexpensive tool for what it’s worth but I’d invest in something more durable for long term use. Otherwise, it gets the job done. I used it for transporting boxes around 50-80lbs",
        "Y'know, this thing has a low weight capacity, but that's not the worst part: the worst part is how damnably short the thing is. Combined with the obscenely shallow truck platform, this set of \"features\" created the perfect storm recently of inability to stack any normal-sized boxes on it whatsoever plus inability to tip back whatever I *had managed* to cobble together atop this paltry transport. I'm not a tall man by any standard, but the low height of the truck handle is the last straw. Note it's time to find a sucker to donate this to!",
        "We live in a loft and our u it is far away from the garage and the elevators. Bringing in groceries or Amazon boxes is challenging. We've used this guy for everything. We bought a set of bungy cords with it to help with loading it up and hauling. My husband keeps it in his trunk so we have it when we need it. It folds down so easily and quite small. Light enough to easily carry",
        "This is a perfect helper. My back is not the best, so carrying heavy items is not going to happen. But I prefer to be independent about things rather than getting my husband to do it. I used this to bring our heavy ceramic outside plant pots over to our shed for winter storage. And I use it weekly to bring our heavy yard waste bags down to the curb for pickup. Folds up nicely to be compact for storage or transport. It strained a bit with the heavy pots full of dirt, so I would say it is not for items over 100 pounds.",
        "I purchased this item to make it easier to haul cases of bottled water, etc. up to my daughter's 25th floor dorm. Despite some of the reviews indicating that this was a flimsy cart, I found it to be quite sturdy. We have used it numerous times without it failing. We have had zero issues with it and are very pleased with its performance. It folds down nicely for storage, too. We keep ours in the trunk of the car. I'd highly recommend purchasing this!",
        "I bought this for my shipping store to help customers bring in their heavier packages. Claims to be rated for 150 lbs, but a 64 lb box was too much for it. The handle literally bent backwards when I tried to lift the box. Utterly useless. I will be looking for one without the collapsible handle.",
        "Made of durable good quality materials, very good easy design and works very well. I like the large bottom plate to help with larger size boxes or whatever material you place on it. The wheels roll very easy and feel of durable high grade wheels. Folds up easily and takes up very little space, I like it a lot.",
        "This is a super lightweight & compact hand truck that I purchased so that I could use it when I show my horses on the road. There is a lot of heavy items to move from the trailer to the stalls when we travel from show to show but not a lot of room to store a heavy duty hand truck but this one has really done the job! I am so happy with how it folds down & is so light weight. I think I have sold a few for you just from people asking me about them when they see me using them at the shows.",
        "Tried using this while moving and it was essentially useless. Two stars because while it does flat-pack, when trying to move 18\" x 18\" boxes (easily less than the 150lb limit), the metal lift bent and the box fell off the cart. If you're going to be moving things with it, I recommend buying cords to keep it in place. It also doesn't turn easily, so if you're looking for something easy to maneuver with heavy boxes, look somewhere else. You also don't have a foot petal to angle the cart while carrying items. Invest more money for something better.",
        "I was honestly skeptical about buying this at first because of the amount of bad reviews and the fact that a lot of the reviews stated the lip bent with to much weight. This is rated for 150 lbs. I pushed it a little and carried a 200 lb washer with ease. It was great for the move I had. I would definitely buy again. If there was any complaint I had about the Magna Cart it would be that the handle could be a little longer. I am 5'6\" and it was still a little short for me. Maybe only by a couple of inches.",
        "I bought one of these last year and was pretty happy with it, but I gave it to a friend who needed something like this on a daily basis (I didn't at the time). Recently I found it would be good to have one again, so I ordered one. This one seems different, not as well-built as the one from last year. Different source/supplier? I don't know, but there's an awful lot of flex in this one even when moving only half its rated capacity. Not nearly as satisfied this time.",
        "It seems to work well, and seems well designed, but I just don't trust its construction. There's a lot of play in the components, resulting from the folding aspects. I'd like a truck that's solid and robust. I don't know that my dislike is the manufacturer's fault. If you MUST have a folding truck..."
    ]
}