{
    "entity": "Hand Trucks",
    "text": [
        "I wasn't sure about a plastic hand truck, but it's as strong as any light duty steel cart I've ever used. Moved a few hundred pounds of machinery down stairs without issue thanks to the stair climbers. Rolls well on grass and gravel. It's a little difficult to convert from the vertical to horizontal configuration, but pounding on it with your fists a few times should do the job. Only complaint is the smell. Had to let it air out in the garage for a week or two, but whatever.",
        "I wasn't sure about ordering a nylon hand truck at first, but after using it I'm very happing with it. It feels just as rigid as my previous truck, which was very similar style to this one only made of steel tube. The only time i notice less strength is when going over uneven surfaces, there is a little more frame flex with the nylon. The real advantage for me is not worrying about it rusting like the steel truck.",
        "Product recalled - Bad plastic rims. Wheels need to be replaced. I would return it if I could. I thought it was a sturdy product. It came with a label that stated not to use it on heavy items.",
        "AMAZING. For the money, you can not get any better. The bearings and pneumatic tires are better than you think. Smooth as glass. Effortlessly goes up and down stairs sometimes without even using the rails! The 10\" tires are enough to roll the stairs. CONS: Holy heck this thing smells. It stinks like gasoline and will rapidly smell up your entire house. I'm leaving mine out in the sun to bake for a few days. Maybe the UV and heat will lower the awful smell. -1 star for the O-DARE.",
        "I choose this hand truck for the large second set of wheels. I haul cement bags to tile installation locations and have to roll over thresholds and in and out of elevators. I also have to get tiles to jobs where the delivery forklift cannot reach, like high rise condos in Miami. This hand truck is light and makes my job easier. I prefer it over the drywall cart that I was using because it is easier to steer.",
        "Holy cow, this thing STINKS! It's definitely the rubber wheels that have the overwhelming petroleum distillate odor and it is really bad. After a 20-minute ride home, I was having an allergy attack... I'll comment back on the usability, but suffice to say that this is not something that can be placed indoors - prepare to use it for what it's supposed to be used for and leave it outside. If you don't have somewhere to stick it outside of your place, don't buy it - you cannot avoid the smell.",
        "This hand truck is a good buy. It is lightweight, but sturdy. Others reported a bad smell with it, but there was no odor with mine. Amazon did kind of a poor job of packaging it in a large box with not enough tape on it. It kind of rattled around in the box. The Fed Ex driver complained about that. I found the conversion to four-wheel mode not too tricky, but I did have to tap out the spring pins with a hammer the first time. The shoe is 7 inches deep, which isn't too bad. Over all, I am very satisfied.",
        "I love this truck. 3 years later and the only damage on it is from some morons from 1 800 junk that can not figure out how to properly use a hand truck. Other than that, and pretty regular refilling of the tires, it is still amazing.",
        "I rated this with three stars, only because receiving it was missing hardware on the caster assembly where it attaches to the handtruck for the use of when using in the horizontal position using all four wheels - otherwise I'm quite pleased with my order this is a very good hand truck!",
        "Great hand truck put it through it's paces already and it held up well , stacked dj speakers, amps, lights etc.. back and fourth to the trailer and it did great in the \"cart mode\" also hauled a full sized dresser up the stairs in our house and it did great as well. Tires are nice and seem to be holding pressure , haven't really found any negatives with this. Great purchase.",
        "I bought it for some arts and crafts shows I do but used it right away. I had a new table saw which weighed close to 400 lbs. Two of us were able to get it right down to the basement with little trouble. Heavy is heavy but the pneumatic wheels make a big difference. One complaint, there was a small piece broken off the fiberglass handle when it arrived but I needed it so didn't bother exchanging it.",
        "Not a bad product. But could use some improvement. The shoe plate in front of the wheels should be wider, so moving blankets and other materials don't get caught up in the wheels. The stair skid also seemed a bit useless. I bought this cart for that feature and ended up just using the wheels when pulling furniture up stairs. Other than that, the product is lightweight yet very strong. I would recommend.",
        "Give it less than one star if I could. Didn't even get to lift anything heavy. I moved a nightstand down the stairs...fairly carefully with this and it snapped. Why isn't it reinforced with metal down the full length of the load bearing structure?",
        "Making any kind of work so much easier. What’s even more convenient is that it can be a flat dolly too!",
        "Great handtruck. It converts very easily to a 4 wheel platform cart. Very sturdy construction, unlike other convertible handtrucks that I have tried. Most of the other convertible hand trucks have flimsy handle conversions. I used this hand truck as a 4 wheel cart, to move boxed into my daughter's one bedroom rental. It handled all of the boxes with ease. As others have indicated, the nylon polymer has a strong industrial smell, so this hand truck needs to be stored in the garage. For the price, I am very happy with this handy convertible cart.",
        "This does exactly what I wanted. It is VERY light weight and the wheels roll over any terrain. Some mentioned a chemical smell. This is indeed true. It takes about 30 days for the odor to disappear. Conversion is a little inconvenient since you have to pull out 2 pins to change the handle position. BUT, I will happily deal with that given the weight and price.",
        "I have owned two hand trucks in the past that were similar to this, but extremely heavy. This one is lightweight and works great! Tires move smoothly and glide easily over surfaces. I have used both the upright position as well as the dolly position and have had no issues at all.",
        "I’ve had this for a while now and I’m happy with it",
        "Milwaukee’s name is no where to be found hard to believe it’s is a Milwaukee tool.",
        "I would not ask my husband to choose between this and me, lol. I'm being serious :). He uses it for everything.... take the garbage can or recylclables to the curb, moving furniture, etc. It is a great hand truck. I just asked my husband what his favorite thing is about this truck and he answered, \"everything.\" So, there you go!",
        "Best hand truck for the Business Shows. Works well across parking lots, Into and out of elevators, on carpeting and is very easy to hold all display items for transport. Would recommend also for use around home, especially easy to change from hand truck to dolly.",
        "This hand truck is light weight and very sturdy!! Yes - there is a plastic smell at the beginning that was not fun but after leaving the hand-truck outside for a few days the odor went away... My wife and I make wine and are always hauling cases around. We can get 16 cases on this dolly which is about 480 pounds with no problem! We have 1 at home and 1 at the winery - a must have at a great price!!",
        "I bought this for my husband and it is a real back saver. I am happy with the quality. It arrived fully assembled and wrapped in shrinkwrap only so I wasn't able to keep it a surprise when he found it on the carport.",
        "Great hand truck light and easy to toss in the truck and go but yet durable to do the job works good on stairs and changes easily into a cart used it to move my mom into a high rise pulled easily onto and off the elevator.",
        "I bought this because I had to move some furniture and I suddenly had no friends. Funny how that can happen when heavy furniture comes into the mix, isn't it? I know this might sound like I'm joking, but after I got this hand truck the amount of moving I did, the speed at which I moved those items, and the pure weight of the items I moved has essentially made me a legend. I owe it all to this hand truck. I moved a hutch that was the size of a small garage, and this thing made it as easy as pushing a wheelbarrow. I owe it my life.",
        "Got this for my husband as a Christmas gift to replace the old standard metal variety. He reports liking the ability to change it from a hand truck to a dolly and loves that it is so light, making it easier to maneuver.",
        "Nice hand truck. Tires suck over time maintaining air pressure then flat out won't hold air pressure.",
        "The dolly is good for lighter stuff, but the stair climbers just don't do the trick for anything super heavy -- Trying to remove a refrigerator up just a single step is impossible. I'd recommend buying something a grade up if you plan on ever moving anything that heavy.",
        "Very well made truck! Wish I'd have found it years ago. My neighbor thinks I've abandoned him since I bought the truck. Now I have to call and have him over just for coffee once a week. Don't loan it to just anyone. You may never see it again.",
        "It seems to work great. I wish it came with instructions as I couldn't figure out how to adjust the handle so I could use it like a wagon. I was able to make the handle longer but didn't see the holes to change it to wagon. Not until I took the handle out completely did I see the holes. I do like it.",
        "flimsy materials, fasteners not tightened in several places...definitely NOT for hvy duty moving",
        "I bought this to help when we moved. I couldn't have moved without it. Super easy to stack boxes on and shuttle out to the truck or van. Made of nylon so extremely light and QUIET! No rattling or jingling with this hand truck. Tires have stayed inflated. No issues with frame flexing. Plenty stiff. Converts easily except that the pins are in rather tight. Still can convert with bare hands. Perfect for my move, and is great for helping me haul music gear around too.",
        "This hand truck is pricey, but extremely well made and versatile. We use these for work every day to carry heavy crates and they're really durable. The big wheels make it easy to move over, especially when you're on uneven terrain. Now, this is the only one we'll use.",
        "Except for the tires, everything else is great. The tires dry rotted and went flat in less than 6 months.",
        "Sturdy and well built, lighter than other dollys and sturdy blade. It's compact and just the right size. Concur about the smell but has mostly gone away after allowing it to breathe in my garage.",
        "Only had it two weeks & it has already paid for itself in time & effort saved! Bottom plate could be a little deeper, but has worked great so far. Plenty rigid for hauling all my tool kits & materials from the trailer to the job site.",
        "Great hand truck! Love the versatility of it. Can use it the way it's pictured or down and roll it.",
        "Awesome for moving and everyday lifting if you like to rearrange your house often! The built in stairs are awesome! Very sturdy and description is accurate.",
        "A good balance between sturdiness and weight. The polymer frame is strong but lighter than metal. Big rubber wheels help it ride up and over steps and curbs. I used it for a big cleanout job and it saved time, energy and my back. I would have rated it 5 stars if the blade was somewhat deeper.",
        "I don't know how I got by living in NYC without this thing. It's incredibly strong and better quality than the ones that the professional delivery services use. I LOVE it.",
        "We use it for heavy use and it's strong, and lightweight. I would recommend this to anyone. Great Price too",
        "excellent for a warehouse use, strong tem, no problems at all",
        "Very strong and easy to use. If you want a hand truck to use around the house or small business, this will easily get the job done.",
        "I used it to haul heavy cabinets into the house, using it like a dolly. It worked great and felt stronger than I would have imagined.",
        "These are great hand trucks / dollies. My first one got stolen after a year, I did not hesitate to replace it with same.",
        "The hand truck arrived with its one side completely cracked open and detached. I didn't have time to unpack it due to leaving on a business trip and when I got to it, it was too late to return. In any case, I don't recommend buying it.",
        "This is one of the most useful tools in the garage. It works for everything and can handle moving a 400lbs generator.",
        "Great hand truck. My husband picked it out and was not disappointed when he used it.",
        "Love the light weight, about 25 lbs (I'm old). I used it the first day it was in my home.",
        "Great product - it's a real work horse. My husband loves it. Great value. Will be around a long time.",
        "Great hand truck. Came in handy a the perfect time...",
        "Worked well but just like previous reviews...those tires smelled up the garage.",
        "it has come in handy with moving furniture to paint a room and remodel. every family should have one. very sturdy",
        "Love this hand truck, especially the stair climbing feature. Used it to move a large item up and down a flight of stairs with no problem.",
        "Well built pretty lite and works great at a fair price..",
        "Great product. The only things I would change are: 1) Make the pneumatic tires just a bit bigger diameter. Would make negotiating stairs easier. 2) Make the steel lift \"tongue\" an inch or so longer for better leverage and more secure carrying.",
        "The hand truck was exactly what I was looking for and met my need perfectly. It worked better than what I hoped for.",
        "This handtruck is on the heavy side, but is very sturdy when I use it as a flatbed it's light and moves smoothly. I love it.",
        "Actually exceeded my expectations - heavier and more substantial. Perfect for my uses of moving heavy objects from place to place. A real back saver.",
        "excellent Dolly for home use. very sturdy and well built",
        "It is just a good and sturdy hand truck. It does have a pungent plastic smell but that goes away.",
        "This is a great hand truck, it is very durable and sturdy. The convertible feature makes it a great option for moving large quantities of items.",
        "this handtruck can be little heavy for some people, but is easy to handle, is solid & versatile, I totally recommended 100%",
        "Needed a better stair rider. This is tough on the back. That said , it worked fine for our first adventure.",
        "Use for trade shows. Larger than I originally wanted, but works great for lots of weight and Its the best I've had.",
        "highly recommend, fast delivery, great price, good quality, have already used it 3 times, my back is thankful I purchased this item",
        "Out of the box this hand truck had a very strong odor to the point I removed it from the main level of my home. It was giving me a headache. But after a couple of weeks the smell has subsided so nothing to worry about long-term. Otherwise, the cart looks like it will work well. I've used it once now to move a new dishwasher into place. I do wish it had wheel guards but I couldn't find one with the other features this one has. I would buy it again.",
        "Good value for the money, especially for light duty. Switching between handtruck and dolly mode is a bit of a pain, though -- the two pins holding the handle in place are the main problem.",
        "Moved out of an apartment on the third floor. Can't see myself doing that with out this sturdy hand truck!",
        "This is a very good hand truck. Solid and easy to use. Very light too! The convertible feature is very convenient and handy.",
        "It did the job that I needed it for and works great --Its light strong the cart feature is just what I needed",
        "Great product and delivery. Moved to my new house with this truck.",
        "is are recall item, who has time for this b.s.",
        "It has made my job easier and quicker to get in and out of the places I deliver several packages.",
        "Great hand truck, transports my tools and such for commercial building work. True about the smell, but WTF, it's construction. Well built and should last beyond my career",
        "I would give this a five star rating BUT... there is a horrible synthetic odor to it. It shipped wrapped in plastic that was torn, and smelled to high heaven! I've had it for about 6 weeks and whenever I go into my garage (multiple times daily) that is the first thing that hits me. I'm hoping it isn't toxic! As far as function this is great except a bit on the heavy side. Hope this helps you!",
        "This hand truck is a great buy! We bought it for moving into our first home after looking at how expensive movers were. For our purposes in helped move a lot of heavy furniture and appliances. We moved a lateral filing cabinet, a washer and dryer with this and it held up with no problems. The lateral filing cabinet was close to 400 lbs, so this hand truck is pretty tough. If you're looking for a good buy, this one will not be a bad choice.",
        "The tires do smell, but I left it outside for a week and that has subsided.",
        "The Plastic On the Entire Dolly is very sharp and I had to hand sand down the entire Dolly....",
        "I just got this and this is what happened to the tires after I used it just once I don't know how will I get the money back now stay away"
    ]
}