{
    "entity": "Hand Trucks",
    "text": [
        "This has been a great addition to my gardening tools. I use it to move heavy pots and soil bags. The wheels are large and sturdy and I've had no trouble going up and down the deck steps with it.",
        "This hand truck is very heavy and a little awkward to maneuver. The bottom plate could be larger as the item on the cart tips off when you lift the handles back. Must use bungee cords to lift most items—that’s time consuming when I bought this to move boxes faster. Having said that this truck is incredibly sturdy and made in the USA, and those are the reasons I bought it. I’d buy it again but I wish it was made of sturdy hollow tubes which would make it much easier to maneuver.",
        "Used this to help my cousin move. It got the job done well and no one got injured thanks to all the heavy stuff being well handled by this. It is heavy but it is also sturdy and works well.",
        "This is a really nice Hand Truck. Very solidly built, nice solid rubber wheels, rolls very smooth. I actually ended up buying two because the first one got stolen from my work. I used the first one for a full year and it held up really well. Another Made in the USA quality product.",
        "This was the perfect purchase for our move. We have used it to move medium sized boxes of weights between 20 and 40 pounds stacked. It is pretty heavy and very sturdy. We have wheeled the hand truck back and forth a little over a mile each way from our old apartment to our new one over old craggy sidewalks, and it is holding up beautifully. I'm very happy that it has solid tires and not inflatable ones. It also does not take up too much space in our tiny closet. I would highly recommend this hand truck.",
        "Absolutely love this relatively light weight, solid tire hand truck. Convenient, very well constructed and really carries a load.",
        "The bottom plate is a bit too short so when you try to tilt it, the boxes/items tend to tip over to the opposite side (away from you). The bottom plate should have been 3 inches longer at least. The large rubber casters are a plus. Made in Taiwan and very robust.",
        "This cheap handtruck was the hero of my move when the dollies failed me haha. I wish the tires was a tad bigger or it was able to go up stairs better, but with those \"flaws\", it made moving a lil bit more tolerable.",
        "Overall I'm very satisfied but sometimes I wish I had bought one with a wider base plate. Next time I will if this one ever wears out but I think it should last a lifetime of non-commercial use.",
        "As noted by many other reviewers this is a great hand truck at a good price. The large solid rubber wheels are a must based on my past experience trying to keep pneumatic tires inflated.",
        "I love this hand truck because it is curved in the back which is essential for moving around potted plants and trees in the yard and home I couldn't do without one!",
        "Dolly is a nice size in terms of height. It has a solid construction. I am using the dolly to move a large propane tank that weighs 50 lbs when full for my back up generator. Works great!",
        "I was looking for one of these and compared numerous other models and types. This one is affordable, rated for 400 lbs, and rock solid. Other models I looked at that were multi functional just looked flimsy and are often more expensive. Highly recommend this product - just get it.",
        "To carry cases of water. Dorable, light weight and efficient. Also American made.",
        "Very pleased, easy to manuver, perfect size, high quality , wheels are not blow up type, solid. Priced right too...Glad I went with a Made in America product. Happy with my purchase....",
        "Works great in business with kegs and cases of beer.",
        "It's inexpensive and compact. Really good for simple moving jobs. The wheels are solid rubber - you NEVER should buy inflatable wheels.",
        "Sturdy and easy to use. The platform on the bottom is smaller than I had hoped making it difficult to move bigger items. Worked really well for boxes and items that were more narrow though.",
        "This handtruck is extremely sturdy. I can't believe we lived without it for so long. I thought that a tool that well made would be really expensive- but it wasn't. Since I'm a member of Amazon Prime I got free shipping and the total price was under $50. It has paid for itself several times over in the amount of time it has saved us unloading merchandise for craft sales.",
        "Wheel base width didn't work for my application so I returned it. Had to pay $30 in shipping just to return it in. Looked well built. I wish I would've seen the wheel base dimensions before ordering. Don't know if it wasn't posted or I missed it.",
        "A little shorter than a normal truck, sharp edges that need to be filed/ground down. Good tires.",
        "Great product to haul heavy stuff from your garage, car or anywhere you need to move a heavy item from point A to point B. Sturdy.",
        "It is a good sturdy and basic hand truck. Nothing fancy about it and pretty inexpensive. Wish the lip was a little longer (have some heavy planters I move around, but using some bungee cord helps with getting things moved around).",
        "for the price this is a great tool. Because it said Utility Dolly I mistakenly thought we could move our refrigerator with it. But boxes and other stuff are great! The wheels are big and it is good quality.",
        "What a great and sturdy hand truck for a low price. If you are looking at different ones and comparing reviews, buy this one. It is inexpensive so you might be weary but it is an excellent product. Only thing I wish is that the bottom was a little longer to get under boxes better.",
        "Would have preferred larger wheels but for the price it was more than adequate and good value.",
        "Good - wouldn't want to be without it. Female 62 y.o. moving myself. With what little I have left, it's good for moving even boxes, tubs etc. from point A to B. The rubber wheels smelled quite a bit when left in the house. And make sure you shop around where you live. I found something very similar at Harb. Freight for 30 something, after I'd ordered it and it was shipped.",
        "Excellent item! This has been an excellent friend during my recent move! Sturdy and extremely well designed!",
        "I have bought cheap carts from local hardware stores/marts. They did ok before breaking. This, for the price, holds up for what I do. I have moved UC fridge and freezers with it, plus hundreds of pounds of coffee in 150+ lb bags. If you want a SOLID shop handtruck or for a small business to move around boxes I would think this fits the bill perfectly.",
        "Showed up in very big box and in perfect condition. Very capable hand cart.",
        "A handy tool to have for me. I keep it in my garage and have used it to hoist things like bags of concrete. Works great! It's light weight but strong.",
        "Have used this hand truck many times since purchase. Very satisfied. Stronger, more sturdy metal than you can usually find in the \"big box stores\". Very reasonable price for this kind of quality.",
        "Super two wheeler! Welded, sturdy, uncomplaining. Perfect for those if a with stuff to move around!",
        "Good solid hand truck, however after a few uses the plastic on one of the wheels cracked causing the wheel to wobble. The company responded to my complaint by immediately sending out two free replacement wheels.",
        "Use this often, even if for hauling boxes in and out or for transporting Christmas decoration boxes in from garage! Great quality, sturdy and big stable wheels!",
        "Seems to be a solid dolly. Use it to haul boxes of alcohol and wine around at the restaurant I work at. Strong and good quality",
        "I wish I could review Amazon's shipping service on here, because USPS is the absolute worst option for this item. They wouldn't even bring it to my door because it was \"too large\" of an item. However, this item is totally worth the money. I was able to successfully move my washer/dryer, dressers, boxes, and everything else it could carry onto the truck. It's a baby monster. If you're looking for industrial handcart, I couldn't tell you how well it would hold up. But for home moving, I'm so happy I found this item.",
        "For the price, I did not expect a super heave duty hand truck, but that is exactly what I got. I use it to move my home made kiln (which weighs about 150 lbs) and it handles the job with ease.",
        "I had one before and the tires went flat and bad because it wasn't used a lot. I wanted one with solid rubber wheels which this one has.",
        "This hand truck worked fine for my purposes, but if doing it over I'd spend a bit more and get a larger/heavier duty one. I've moved a water heater and gas range with this, but it isn't ideal due to the smaller size.",
        "For the price I paid for this I can't believe how good it is!",
        "Extremely durable. The hard tires hold more weight and maneuver easily. Great purchase and wonderful price.",
        "This is the best and easiest to use product!! I'm so happy with the quality and price.",
        "My husband just loves this. Very sturdy and of good workmanship.",
        "I do! It so helps in tidying the garage and basement - how handy when someone needs assistance with their move. This is well made and really sturdy. Wish I had bought one long ago.",
        "Strong,solid tires, I use this truck to haul groceries from truck to house. Ex. Cases of water,soda,can goods and bags of food items. I attached a recycle tub to bottom of truck and now I make one trip from truck to house.",
        "Very fast shipment and just the right size for my needs around the house. The size of the wheels will easily navigate my stairs for moving items and furniture from up to down.",
        "The Amazon descriptive photo shows 4 horizontal support bars. The product received has only 3 - see photo.",
        "Really heavy duty. I can move my huge plants with it.",
        "What can you say, it gets the job done and is nice and sturdy. This one is nice and tall, so my boyfriend doesn't have to hunch over to haul stuff around.",
        "PROS: RAPID SHIPMENT FR AMAZON.COM & GOOD PRICE. SAFCO TUFF TRUCK IS HIGH QUALITY PRODUCT WITH GOOD WELDS & EASY ROLLING WHEELS. I LIVE ON A 2 ACREAGE HOMESITE & USE PRODUCT FOR COMPLETING GENERAL HOME MAINTENANCE, E.G., HAULING BAGS OF CEMENT, FERTIZER, MULTI BAGGED GROCERY ITEMS,WATER MELONS AUTO BATTERIES, ETC. CONS: ARRIVED WRAPPED ONLY IN PLASTIC COVER, WHICH WAS TORNED VERY BADLY. PACKAGING WAS POOR; HOWEVER, EXCEPT FOR A FEW PAINT SCRAPES, ITEM ARRIVED UNDAMAGED. GOOD QUALITY AMERICAN PRODUCED PRODUCT.",
        "Sturdy and works fine. Wish webbing on back had padding or used different material. Barreled back has pros and cons.",
        "This is a good hand truck for moving around boxes. It has very durable.",
        "PERFECT SIZED HAND TRUCK FOR AROUND THE HOUSE. NOT TOO BIG OR TOO SMALL BUT SMALL ENOUGH FOR THE HOUSE.",
        "Yeah. Very robust. The bottom platform would be better if it was a few inches longer though.",
        "Very strong and durable hand truck. this thing takes a beating and still performs like new.",
        "I bought this not too long ago and based on the reviews I thought I'd give it a try. Works as advertised.",
        "Fairly priced (including shipping) delivered right to your doorstep. Seem sturdy enough. Not attractive but gets the job done. We'll see how the tires hold up. Turns and handles well. So far so I'm pleased. Lots of stuff in the garage that is now a whole lot easier to move.",
        "It's a hand truck. It's made well, and it does what I bought it to do, and for the money I'm quite happy.",
        "this hand truck is simple and functional. I wish it had larger diameter tires.",
        "Great handtruck. Old one had air-filled wheels and kept going flat. This one will never have that issue. Well built and shipped fast.",
        "It was probably used to construct the death star. Seriously though it's a great dolley at a low price and I haven't had any issues with the tires.",
        "Great product and value. fast delivery. Just what I needed for my move ....",
        "I've only used this truck a couple of times. So far it meets my expectations.",
        "just the right sturdy solid one. no fancy add ons.",
        "Arrived on time and undamaged. The description says it is twenty pounds and it feels like that much. But, it's not really an issue for use because it is on wheels. I can't imagine anything I would try to move that would be too heavy. One thing you might want to consider. If you want a truck with this kind of capability, take a look at some models that have four wheels. The other wheels don't look like they would be a bother for regular two wheel use and you can lay it over on all four wheels to use it like a cart.",
        "And it's sturdy. It is better made than I expected. The unit will stand up to the heaviest things in my house. It is a pleasant surprise.",
        "I used this to move a washer and drier out of my garage while I was doing some patching on my floor. It worked with several support straps holding it against the dolly. It did the job, and worked well. I probably could have used a slightly larger one, but it worked!",
        "Bought for our move and it paid for its self with in the first couple of trips up and down the budget truck.",
        "I bought this hand truck for our department to take deliveries between buildings. It is sturdy and easy to push. Works great for our needs!",
        "Does exactly what it needs to do. Great to have around the house to move items large and small to save your back.",
        "I have already used it once and worked well. Good product for the price.Would purchase it again and can recommend it.",
        "The Tuff handle truck is a great help when moving objects around our home. The handle truck is well constructed as preivous customers have stated. There is a oder from the tires but we store in the garage and have found that after time it has disapated.",
        "strudy and very well built. great for the money. seems to be able to hold up to anything I will put it through.",
        "This hand truck is for a toy store. If you plan to use for small items, it should be fine. But if you want a real hand truck, keep looking.",
        "All good, very solid, strong wheels. My only complaint is that the load plate is a tad small which means some loads become a little awkward.",
        "i got it , was on time in great shape ...don't know how i've lived without it it's just great easy to use hand truck......tyvm",
        "Just what we were looking for and at a good price",
        "Great truck but didn't have the soft wheels and wasn't as tall as we needed so returned it and bought wheels to repair the handcart we had already since that was much bigger and more useful for us.",
        "Like this one a lot. Just what I wanted. Simple and sturdy. Doesn't have a lot of extra pieces that will eventually break. This should last a very long time. Had air-filled tires on last hand-truck, and while they provided a great \"ride\" when the air stayed in the tires, the air just didn't stay in the tires long enough. Just get this, it will last forever. Well, except when a friend borrows it. I had it for maybe a week, and it's been loaned out for about 3 now :/",
        "i love this thing. i make my employees roll me around like i am Hanibal Lector while i talk about eating their livers",
        "it's sturdy, so far at this date and time 10/2014 I have not had any problems. It is a great help, keeps me from lifting a lot",
        "The wheels are hard and I fear they won't hold up to barrels that are full.",
        "Not useful for bringing things up stairs. Get one with a stair climber if you need this capability. My own fault for not knowing anything about hand trucks, but still.",
        "Misleading picture of product. Model number is the same but what I received is not the same as pictured. I'm not sure which is newer but the current product and picture are not the same.",
        "It is more worth going to Home Depot or Menards to get a better one for a little more. If I could send this back at no cost I would for sure."
    ]
}