{
    "entity": "Monitors",
    "text": [
        "This monitor lasted 1 month before the capacitors on the power board went bad. I am glad I did not pay much for it but I was expecting more time before it crapped out...",
        "Very good brightness and clarity, but occasionally it gets stuck in a mode with the wrong aspect ratio and the only way to fix is pull up the Intel graphics card settings GUI to reset it -- maybe that's just my graphics card. The other complaint is that with the large speaker boxes at the bottom of the frame, the appearance of the monitor is more clunky than I would like for a flat LCD screen.",
        "This is a great widescreen monitor, response time is great even for the fastest FPS gamer. Crystal clear colors and low luminescence for those after hours gaming experience. Also great for movies and photoshop.",
        "Returned first one. Got replacement in two days. Good monitor",
        "Very impressed with this product. This is my third View Sonic monitor and each one just gets better and better. Can't beat the price, either. Got here quickly and easy to set up.",
        "This refurbished monitor is nice quality all around, with only some minor cosmetic blemishes, and the price was good. I would have given it five stars, except that it was two weeks late in delivery, with no explanation from either the supplier or Amazon. When I queried Amazon after the expected delivery date was passed by several days, they said they would check on it. No more communication, and the monitor appeared a week or so after that. Disappointing. But I like the monitor.",
        "Seller is very professional. There was an error on item and the seller communicated well and I am satisfied with my purchase. Thank you.",
        "The stupidest thing about this monitor is the base has this stupid lip on it that prevents you from positioning the keyboard close in front of the monitor. I have this monitor at work and I wanna smack the guy that invented the base. The picture is OK but not great.",
        "Love it!! Great price, I didnt think I could get a monitor this large that looks and works so great for this price. I play a lot of games and I started replaying them just to see graffics like I have never seen,I have a radeon x1300 256 meg pci express card and not one problem,set up was simple , the only thing no dvi cord.",
        "The monitor is a delight to look at and use - 5 star. The sound is almost useless - 1 star. This monitor is used with a Macbook, Apple wireless keyboard Apple wireless mouse and Logitech speakers. The combo is cheaper than the Macbook Pro. It works like a desktop computer and I can take the laptop with me."
    ]
}