{
    "entity": "Monitors",
    "text": [
        "I ordered 2 of these to go with my current monitor (same exact model). I’m disappointed with this purchase as the power button on one does not work and is turned side ways in the bezel. Neither monitor came with the correct stand. The stands it came with are for a much smaller dell monitor. Because of this it will not hold the weight of the monitor. You can not adjust the monitors up or down. One came with the bezel falling off. Very dissatisfied with this purchase. Seller said these are in “very good condition” which is clearly not the case. Stay away from this seller!",
        "I was shipped the WFP-HC instead of the regular WFP. Kind of annoying with the true white next to the off white, but I have gotten used to it and use one for videos and the other for everything else. The monitor itself is very nice. Decently sized, the dell mound is very sturdy and offers both portrait and landscape viewing. The build in USB and SD reader are nice. What can I say, its a solid monitor for a great price. If you are looking for a well build not break the bank 24\" display then this is a good buy.",
        "These monitors are perfect. Great refresh rate and incredible picture quality. Since this model has now been replaced and is no longer available I'm hoping to upgrade to the latest and greatest when I can. I've never had a problem with any of the DELL 24\" monitors I've had. I wasn't impressed at all with how the seller packaged and sent. Not Amazon but an Amazon seller. Even though the stand was not the origanal and the packaging was horrendous the monitor itself was working and a nice adition to the one I already had.",
        "I bought eight of these in 2006 when they were at a higher price and they are good (on one machine in two Chief monitor holders [hard to position perfectly] on a Dell 690 using NVIDA 285/295 cards). I use them six (sometimes seven) days a week 8 to 10 hours a day and they are still clear and sharp (exactly six years later, 2012) with at 1960x1200 resolution with brightness of 1000. I no longer look at any other monitors except Dell Ultra Sharp or better. Used ones at 200-300 are a bargain if you want quality images on a monitor that lasts. But, that's just me :).",
        "The corner of the display flickers. The power button is intermittent. The screen is a putrid yellow and colors are washed out. Not worth buyibg.",
        "Always a good monitor. Nice clear and fast videos or graphics.",
        "I have two of these now and love them. A bit heavier than the newer ones but very sturdy and display is beautiful. Buy.",
        "This replaced an identical but older monitor, that finally quit working after 9 years... I was not pleased with any of the monitors I looked at, and only became happy, when I found this!",
        "Great monitor! Have been looking for a replacement for one that finally died after 8 years!",
        "Monitor came and is working perfectly. Mirror to my other monitor that I have had for years looking forward to getting back to two monitors.",
        "This is the best monitor I ever had. I have two of them at work and also bough one for my home office. It's not produced anymore but the refurbished once are also doing their job.",
        "I have been using this monitor at work for almost ten years and this monitor never seems to hurt my eyes. So i bought this for my home use. Little tough to adjust the position but i really like this monitor",
        "I got this monitor with my XPS 410 back in 2005, so this monitor is currently 15 years old and is still working great on my new system as a second monitor. The image quality is very good, the only reason I docked it a couple of stars for gaming is the speed, its a 60Hz max panel and has a 6ms response time. So on modern games it wont be able to deliver the quality available with modern graphics cards, but for a second monitor or watching videos and work related tasks its a very reliable good monitor. I would recommend buying a used one, no questions asked. It will most likely work great for years to come.",
        "I am LIVID, I spent almost 150 dollars on one of these because the monitor I was going to replace has a dying LED. I have to constantly reset it and wait for it to cool down because it will shut itself off when a certain amount of activity is on it, or if I leave it on sleep mode. Now, this new monitor has begun doing the same exact issue I have!",
        "My wife and I are professional photographers and do a lot of wedding business. We bought a Dell XPS computer in December with this monitor and I'm deeply and profoundly in love with it. At last, I can have a huge display for Photoshop and still have enough screen real estate for the tool palettes on either side. The monitor also has a built-in memory card reader for all of the popular formats and a bunch of USB ports. The add-on stereo speakers are surprisingly good. This is a terrific monitor for the money and makes photo editing a pleasure.",
        "The monitor is great I'm using it for 12 years and it is as sharp bright and no dead pixel . Just the power switch is stuck",
        "I have had this monitor for five years. As long as I was using it with a computer running Windows XP up through SP3, it was a fabulous monitor - really great: color resolution, inputs, sharing, you-name-it. However, if you're upgrading to Windows 7, beware! There are no Windows 7 drivers at all, and trying to install the Vista 64 bit drivers doesn't work. Dell chose, for whatever reasons, not to provide Windows 7 support for this otherwise outstanding monitor. If you've got an XP machine you're not upgrading and can get a good one of these used for a reasonable price, you'll be thrilled with it!",
        "Best monitor for money period. I have owned this monitor for 7 years now. It sits beside a cnet \"editors choice\" asus-pa248q and the picture blows the asus of the desk. I wish dell still made this I would probably have 3 of them.",
        "The Dell 2407WFP has a bad power button, which appears to be an inherent design flaw in the product. Note that even under pretty light usage, it went bad. Do a google search for \"2407WFP power button\" and you'll gets lots of results showing others having the same problem. Otherwise, it has been a nice display, love the 24\" size and 1920x1200 capability.",
        "I bought mine when they first came out and it still works like a charm. Contemplating getting either a second one or another in the ultrasharp line.",
        "Purchased a computer and 24\" monitor direct from Dell. Got the computer in a week, the monitor never showed. A couple dozen emails, phone calls - one customer service rep actually asked me to call back when their systems came back online - and no monitor. Fed Ex finally admitted it was stolen off their truck - informed Dell, no monitor. They are the worst - online and offline - so if you have a problem you are on your own."
    ]
}