{
    "entity": "Hole Punches",
    "text": [
        "I’ve been using this 2-hole punch for a few months now. I’d say I average about a ream of paper a day. If you keep the tray empty, and don’t try to do too many at once, this machine works great. I regularly punch 15+ sheets at a time and it has yet to jam on me. It definitely sounds like it’s working harder with a thick stack of paper, but it always gets the job done. It’s such an improvement over the manual punch I was using.",
        "This helps ensure pages are consistently punched in the same location, time after time. I have never counted the number of pages I put in the device, but have never come near the advertised capacity; I would rather punch 16 to 20 sheets, which are easily aligned within the device, than trying to align 28 sheets before running the device at capacity. Having recently used this to punch holes in over 120 sheets of quality paper that were put into a binder for presentation, the end result was a professional look with consistently aligned holes.",
        "I love that the entire setup is plug it in. Works perfectly for me but I noticed that with even 5 pages I with get some holes not fully punched. I can't image it doing the listed 28 sheets at once smoothly. My paper is a heavier weight - 60 - so it may be able to do 15 sheets of 20 weight okay. Not a problem for me since I just reduce the # of sheets I punch at once and would never do that many sheets. But if you truly expect or need it to punch 28 sheets at once you may want to purchase a higher level machine.",
        "I normally love Swingline electric hole punchers; this is the third one I've bought for my small business. But after a few months the left punch stopped retracting the paper after the punch. So the paper just stays in the machine instead of going into the waste compartment. I've tried to look up manuals to see how to fix the jam with no success. Waste of $129.",
        "This unit works exactly as you want it to, and the only complaint I had was that it needs a little more solid edge catch when you are getting close to max sheets. I keep it to about 20 sheets and it works great. Very clean and easy to empty.",
        "I wanted one of these for years and my boss of three years has one in our office. I finally had a little exra money to buy this particular one. It works great. Saves me so much time and effort from the old hand held hole punch. Can punch 100 pages very quickly and putting documents into a binder is now a breeze and all these years I've used a hand punch 3 hole puncher and the holes tended to move so they were not uniformly punched and made presentation binders look sloppy. Not anymore. This product is worth every penny! Thank you Swingline.",
        "Exactly what I needed. I do moderate size jobs, but this makes it easier and more efficient to get the product packaged and in the binders quickly for my presentations and customers. I'm overall pleased with this and would only recommend something that can whole punch larger chunks of paper if you have huge jobs. But, most people will buy already punched paper in that case. this is great for all medium sized jobs.",
        "What we got was not what is advertised. We returned it after looking up the model number and noticing it was not a real swing line hole puncher.",
        "So far this product works as expected. The holes are always punched through, and they line up perfectly. It's quick and easy to use. I'm not sure how many sheets you can hole punch at one time because I don't need it for large projects. I'm very happy with this product.",
        "I have purchased 2 of these hole punches for the office and they have been very popular. We have large manual hole punches for large jobs but they can be difficult to operate at times, an electric punch is definitely preferable. This Swingline punch will punch 20 pages with ease over and over.",
        "I had used this machine at our school and found it to be a blessing when I had to prepare papers for my students, their portfolios and my person records as well as organizing my resources in binders. I purchased this machine and was thrilled with the delivery time. I plugged the machine in and have already punched 1100 pages. I LOVE IT!! The price was very reasonable and, when having to chose between a cheaper, smaller unit and this one, it was priced low enough for me, a teacher, to be able to buy the bigger and better of the two units. I recommend this product to every teacher.",
        "I don't know what took me so long to get one of these, but I am glad I did. It punches a great deal of sheets quickly. It's not silent, but very effective. I had my children punching holes in TONS of sheets one workday and it was getting tedious. I also had a lot of mess to clean. After borrowing a fellow teacher's electric hole punch, I had to have one. I don't regret this buy one bit. I got a good deal on a like new hole punch for $84.43. It seemed brand new to me.",
        "This is a great machine if it's working properly. The one I tried to save money on by getting it through Amazon Warehouse deals was dead on arrival and I had to return it. The reviews on this are very good so I'm going to purchase a new one and not take a chance on getting a second-hand problem. The new price is fair and includes a warranty that insures that you got a good one. That's why even though I had back luck on a second-hand one, I still believe it's a great choice and product if purchased new -- a worth 5 stars.",
        "I was overcharged for this product as the condition was supposed to be very good but if while it works perfectly the hole puncher itself looks beat up. I will use this and not return but be careful on buying used. Make sure you get what you pay for.",
        "This has been a helpful addition to my personal office space! It is not the primary hole punch that gets used the most, so I've not experienced the problems that others have re: weak hole punches, etc. However, we have a duplicate model in the main paper area. That model receives tremendous use, and has the missing/weak third hole punch every time. Appears that replacement is the only option once that begins to occur.",
        "This was a big time saver. I had to punch holes in about 2000 sheets of paper and our manual punch wasn’t cutting it. This made the job work by quick.",
        "We replaced our old Swingline with this new one, hoping for some relief, and we are have serious problems ever since getting the machine to release the paper after drilling, especially on the left side. This is true well under the 28 paper limit, as in even with just 10 sheets. I pulled out the debris stuck in the punch hole and that finally released this last jam, but it's never worked as it should. To top it off, the reverse button doesn't work at all. Not happy! At least I see that many people are, so maybe it's just this particular machine.",
        "My paralegal was out sick last week so I had to put together my own motion and exhibits using the manual punch we had in the office. I assure you that will be the last time I use it as I detest physical labor, and while a two hole punch may not sound like \"labor\" but after punching holes in 500 pages of exhibits, I assure you it is. this gets the job done quickly and easily saving my delicate wrists.",
        "This is a great punch. I have it set up next to my printer and use it all the time. It is easy to use and you don't have to worry about the punch holes begin off. It is easy to empty since the tray is in the front and just slides out. Everyone should have one of these and get rid of that awkward manual punch. It will pay for its self by saving paper and frustrations when the holes are off. I recommend this to to everyone.",
        "I've tried many manual hole punch gadgets. By far, I like this one. This electric paper hole punch works great for my classroom use. I've inserted anywhere from 1 to 25 sheets at a time. The three holes punched on the sheets of papers are Very Accurate and clean... However, the back panel to support the pile of papers to be punched can be better secured.",
        "I have had the 3 hole version of this punch for a couple of years. It has performed admirably. This replaces an older 2 hole model of another brand that was very slow and cumbersome to use. This Swingline is much faster and processes more sheets per punch. We have a small law pratice and there is a lot of paper to punch. This is a pain saver for hands and wrists that are becoming a bit arthritic.",
        "Beats the heck out of a manual hole punch. :-) Works like you would expect it to. No problems at all. Used it quite heavily while doing graduate research and creating binder after binder of material. Never let me down. That gets 5 stars in my book.",
        "I bought this hole punch to replace an identical one that has lasted well over a decade. After a little over a month and limited use, this hole punch sounds like it's dying. It struggles to punch through 13 sheets but is supposed to handle up to 25. It is also leaving oil spots on the paper around the holes that it punches. It's 8 days past the return deadline...",
        "I like how quickly I received my 3 hole punch. I do a lot of hole punching for binders and my job. It is great. No more fighting with the manual hole punchers to get the extra sheet of paper you tried to hold punch! Very satisfied customer!!!!",
        "Our choir uses an electric hole punch to put holes in the music. The old one we had finally gave out. This Paper Punch does an excellent job. It has a strong motor, it's heavy enough to stay in place, and it punches holes so fast, it's hard to believe. I'm expecting this commercial strength hole punch to last a very long time.",
        "We had one in our middle school office that was probably 10+ years old and it finally succumbed to a paper jam. We ordered this one as a replacement and it's working just fine.",
        "I had one almost exactly like this for over 15 years....as soon as it died I purchased another. We work on a lot of volunteer events and keep notebooks so this is a must. Love it.",
        "I have received the hole-punch, plugged it in and it does not work. Tried numerous outlets and nothing.",
        "Ok, this is the first electric hole punch I have used, so I can only compare it to the manual type. This thing is great! We had been killing our hands and arms punching holes in stacks and stacks of paper. And it also took so long. This electric hole punch takes more paper at one time and is so simple. If you punch lots of holes, this is well worth it!",
        "As a blind person, both in my church work, and my piano service company, I not only use printed material for my customers, but I also braille out materials needed for my church work in braille. This paper punch is _one awesome machine! It punches 28 sheets of heavy braille paper so I can pop it in my note book. If you need a reliable commercial heavy duty electric paper punch that keeps on groovin while the paper keeps movin, by all means! ya gots ta get this here bad boy. Lookie here, :-) I'd recommend this machine in a heartbeat. And Amazon? you make this even better with your low price. I _looooooooove buying from Amazon!",
        "I love this machine. I use it every day. Easy to use. Easy to clean. Good value for the money.",
        "This 3 hole punch is fantastic! I bought it and hole punched over 15,000 pages in just over 3 months with no issues and it's still going strong. Definitely worth the money! I like it so much I plan to buy my daughter's teacher one for her classroom next year!",
        "Bought this for the office. Great hole puncher. Reliable. Punches many sheets of paper at once.",
        "I am very pleased. I haven't used it to full capacity yet but I do know that it will punch the holes in 20 copies at a time",
        "Works great so far. A bit expensive, but if it holds up it will be worth it.",
        "Use this for work, and it is well worth it. I punch easily a ream of paper a week and every hole is properly punched, and I can do so many sheets at once. A real time saver.",
        "I buy this product every time I'm transferred to a new location. Pays for itself with increased productivity alone. Just remember to empty the tray in front every so often.",
        "Amazing hole punch. I went through four others before I finally found this one.",
        "I love this electric hole punch. I was the best purchase for my classroom.",
        "I love this machine. I use it everyday and it never misses. It works way better than the manual kind and is easier to use.",
        "Perfect for my office, and it gets a lot of use!! Worth the purchase and highly recommend!",
        "heavy duty. Price was much less than the exact same product on other sites.",
        "Love this hole puncher! I use it every day in my classroom. The school has this exact hole puncher in our workrooms, but I wanted my own for my room. My students use it on a consistent basis and it works very well.",
        "So handy, plug in and ready to use. Easy to use.",
        "I did not get the item pictured ., I received a black punch .. works great but not one I ordered",
        "For personal of for office work, it is a must have if you want to organize your paper work with less effort. I really love being able to just push the button and wallah, done, clean cut holes.",
        "I love this electric hole puncher for handling many pages at once with ease. Once you try it, you are never going back to punching by hand.",
        "i bought this because the two regular hole punchers made holes that were too small for practical use and flipping pages was impossible. this is not as fast or quiet as the one we use at my work but it does the job.",
        "After buying several paper punches, none of which were cheap, I bought this one. Pros: There is no more frustration with jammed paper, mis-punches, annoying paper punch devices. This thing works every time, all the time. I am familiar with it from a library where I spend a lot of my time. I figured if it were good enough to handle high volume use in a library, certainly it would hold up at home. This is the case, and I recommend the product to anyone. Cons: None You won't regret the purchase.",
        "I LOVE this machine--fast, efficient, and quiet. Wish I'd bought it years ago.",
        "I'm very disappointed. Didn't even punch through 10 pages. SUPER noisy. Returning immediately.",
        "The 3 hold punch works fantastically. This was replace another unit purchased 3 years ago and I hope this one works just as long.",
        "It totally lived up to expectations. It punches the holes quickly and precisely. It is very easy to use. It is small enough so that it does not take up much room. What is there not to like?",
        "This hole punch work great, but it tends to collect chads in the center hole punch, that you have to clean out occasionally. that why it only got a 4 rating.",
        "It is the best hole puncher I have ever used. I bought this for my classroom and students I don't even know will ask to come use it.",
        "My wife used this model electric hole punch at her office and after she retired wanted one at home to sort out and file her papers, newsletter, etc., in binders. This device works perfectly and the price was much lower than other sources.",
        "Excellently made. This one is replacing a Swingline just like it purchased 5-yrs ago.",
        "Love this punch! Helps me get my work done faster!",
        "paper sometimes sticks because of the tubes that punch the hole does not release.",
        "Excellent product! I use it in the classroom daily, and it is reliable. Just don't overfill it",
        "I love my three hole punch! The only problem I had was that it arrived two days later than what was promised through prime shipping.",
        "Works efficiently, used multiple times a day. Minimal sound. Paper guide great, holes are clean, size fits in smaller spaces well. Very pleased with purchase.",
        "I bought this hole punch to use in my classroom. It easily punches an entire class's handouts at once and saves me lots of time and hassle.",
        "after shoulder surgery requested this from owner to do manuals-of course he said yes and we couldn't be happier smoothe, efficient and OSHA should have a look at it",
        "Great machine. My secretary loves it. It has worked flawlessly so far.",
        "Works great. Perfect for an office. Other reviews say it is loud, which it kind of is, but nothing that is annoying.",
        "Does a great job in hole punching and I would finish my work when using this much quicker",
        "It just works great. Be st product ever made. A little large, but it works fantastic.",
        "I purchased this because we have a lot of paperwork that needs to be filed in notebooks. This makes the job so much easier than manual punches.",
        "OK, now can you make a swingline that punches 2 top of the page holes electrically.",
        "this is my second one for another office, have used it for years with no problems",
        "I volunteer at an elementary school in my town and there is a Swingline Paper Punch in the main office. I mostly work with a Literacy Coach on the second floor and I decided to donate a paper punch for her office. There is an abundance of copying tests, etc. for the students. We love it and the teachers on that floor are very happy we have a paper punch on that floor. I would STRONGLY recommend this item. Thank you, Sallie Luchese",
        "It works good if not better then the ratings say It has not prob. with 30 sheets at once. The only flaw I would change is the start button could be on the right side instead of left. It would make it easier and faster load paper then instead of reaching over paper u just move down on the left side. P. S. none could come close to the price I received the nears price was $25 moreRoy DeSetto",
        "Love it! I needed this for my classroom because we are using binders this year. Everything we do needs to be 3-hole punched. This makes it simpler for me.",
        "This electric hole punch is easy and accurate. I especially appreciate that it handles quite a few pages at once.",
        "Purchased this for school classroom - holding up to 5th graders well! The kids love it & the teacher is happy!",
        "Works as described. It performs as stated and is what I expected for the job. I have no complaints about this product.",
        "The hole punch is great and I would recommend it. ACCO is a different story. The site is not user friendly so checking on the status of an order is very frustrating. Not to mention the fact that they seem to take a long time in fulfilling their orders.",
        "Heavy duty. It gets a lot of use in our library. Students of all shapes and sizes use it. We have pounders, pressers and light toughers and It has held up really well.",
        "I use this in my classroom. Love it!! Great time saver.",
        "Works great with up to 28 pages to 2 hole punch! Use this at work place and we love it!",
        "I'm a student and this punches holes in several papers at once. Easy to use.",
        "Wife has used it at work for a while now. Lots of use in a production environment. No problems whatsoever!",
        "Had one before lasted for over ten years - real workhorse",
        "This is used many times a day. It's a reliable time saver bar none.",
        "We had one already in our office that we love and wanted to get another one. Works just as great as the original one.",
        "Swingline makes excellent products. They are made to last. Easy to operate and easy access to discarded chad.The unit is quiet and performs exactly as stated.",
        "this is a great little machine to have in the busy classroom",
        "I really liked this whole punch. The fact that you can punch holes in up to 28 sheets of paper at a time is very convenient. I despise manual whole punches as they generally punch the holes poorly and can only punch holes through about 5 sheets of paper at a time. I develop training materials and this device is very helpful!",
        "I had used this paper punch in a previous office, Now that I'm working from home, I wanted one of my own.",
        "Great product Rarely doesn’t punch typically pushing 20-25 pages through at a time Swingline great old school company",
        "I love this hole puncher and so do my students. Very durable",
        "Our office purchased this particular item because we heard such good feedback from another department that already had one. So far it is working great. The hole punches come out clean and it hasn't jammed once. I also like that the instructions on how to operate are displayed right on the front of the machine.",
        "I have been using a manual hole punch for years and was so tired of it! When the last one started jamming all of the time I decided to try an electric one. I love it! It will save my arm and my peace of mind. I punch a lot of holes for my work and am so glad to have that part of my job easier and less frustrating. A great purchase!",
        "The best hole punch for a busy office. Very sturdy and works great!",
        "Bought two one for each office they are so good",
        "This product works well, but is loud. It sounds as though there's a gear loose. However, it works well and I love the efficiency of the amount this can hold. Overall, I'd recommend wholeheartedly!",
        "It gives a clean punch. Able to do more sheets of paper.",
        "Received as described. Works great. Easier than using a hand-operated punch. Worth the cost if you have weak hands or lots of paper to punch,.",
        "Works with the ease of a single finger. Great investment."
    ]
}