{
    "entity": "Hole Punches",
    "text": [
        "I know I used to have one of these handy items but could not find it. I needed to punch holes in a leather belt and this worked well. It made a nice clean cut and I liked that there are multiple sizes you can use. The only complaint is that I needed to use pliers to turn the wheel. Perhaps it will loosen up with use but so far it is very stiff.",
        "I was going to send this back but I think it is way past the time and I kind of forgot about it as I left for a trip just after receiving it. It requires a lot of force to punch holes in any leather regardless of the thickness/oz. much more than any hole punch I’ve ever used. Garbage, I certainly DO NOT recommend this.",
        "I spent twice as much for a leather punch to support old-school American manufacturing, but I was disappointed with the quality control. The tool does what it needs to do but the punch just barely lands on the cutting pad. The back edge of the punch is right where the pad’s radius starts. There is also a lever intended to lock the tool closed, but the rivet that it pivots on is mis-located so that feature doesn’t work. It’s a shame that the Chinese can do it tight for half the price, but that’s what has happened to American manufacturing.",
        "This model is not usable for me. The tubes are misaligned and not at all sharp. I called the company about this and was told I should have ordered the more expensive model. Go figure!!!",
        "Maybe 3.5 stars. It's made in the US and it is not expensive, but it was a little hard to use, especially since it does not have padded handles, and it was tough cutting through some of the thicker (padded) belts. I recommend using some backing material to keep from dulling the hardened cone against the brass anvil. I won't use it often, but can't imagine this is what you'd want for regular use around the farm or crafting.",
        "Good product. I bought this for some hobby leather projects, and it has been very effective. It requires a good bit of squeezing strength for thicker leather, but it gets the job done. Disappointed in the sturdiness/durability, though. One of the punch settings chipped after maybe 40 holes punched when I was clearing the leather dots out. It broke surprisingly easily. I think it will still get the job done, but it’s going to take two punches per hole on that setting now..",
        "My dad had one of these when I was younger. So when I recently lost a bunch of weight, instead of throwing out my current belts and buying all new ones, I thought of searching for one of these. There were several options and this one seemed to be the best value. When I got it, it worked as advertised. Another reviewer suggested putting a piece of denim under the belt. I think that is a good suggestion. It makes it easier to punch through the leather and will probably prolong the life of the punch. The cost of this tool is about half of what I spend on a single belt. I was able to save 7-8 belts. Nice!",
        "I bought this tool to punch holes in some leather - but it also gets used to perforate rubber, plastic and cardboard. it works well, and just keeps on going, with no sign of getting weak or dull.",
        "It's hard to go wrong with Osborne tools for leather and being made in the US is just a bonus. I've been using Osborne tools both professionally and as a hobby for the past 30+ years and it's just not worth saving a few bucks to buy punches from \"Horrid Fright\"",
        "Only giving it four stars because one of the punches had a little chip missing out of it. Doesn't seem to impact it's performance though. I thought this was a good value.",
        "Sharp pins and doesn’t take a lot of force to make the holes. Sturdy tool. Used it to add hole to leather sandals. Worked well. Wish there was one smaller pin that would be a better fit for women’s sandals. That’s the only thing it’s missing.",
        "Well made tool, and easy to use. I have sized several very thick western style belt with it with no problem. The anvil is brass and does not dull the steel punches when used, and the punches are easily cleaned with a piece of wire or similar from the center of the revolving punch wheel. Handle catch is convenient for storage.",
        "Just got it today. It seems like decent quality but it’s extremely difficult to punch the larger holes. It really requires to you “wrench” it on the larger sizes. Two handed grips and presses are needed. You also really do need a piece scrap leather behind your project leather to make it work. I’m not sure it’s a great option for leather work.",
        "The wheel is hard to turn (a touch of arthritis in the thumbs) but all the holes I punch are for a standard men's belt so It doesn't really bother me.",
        "Had 2 nice belts which needed extra holes, but was not going to go out and buy another belt, so after reading the reviews, I decided to go with this product. I have been happy overall. Biggest help was Jeffery A's comment of using a thick piece of cloth (I used old jeans) to help with the punching. Only other thing I recommend is to be sure your hole lines up with the other ones; take the time to measure and place the hole approximate to the other holes in line(on my 2 belts, they were 2.5 cm/1 inch apart). Product has already paid for itself.",
        "Can't make a hole with the biggest punch. And that was the size that I needed for my immediate project. The leather that I am using is a bit on the thing size. And that's most likely why I can't make the punch. Good thing the next biggest size is not that much of a difference (at least for my project). It works with that one pretty well. I am satisfied with the product, just wish that it could have been better (sharper maybe?).",
        "Would be nice if this could actually punch holes in things. Could not get through any of my belts because the punches are dull. Makes a great dent!! UPDATE: After filing the punch a little it cut right through. Thanks for a dull tool!",
        "Did not work at all. Waste of money. Tried to put another hole in a belt that is too big now, woukd Not make a hole at all.",
        "After having many skinny belts with not enough holes in them to wear the belt I finally have a resolution. Once I received this Leather Hole Puncher it took me less then 10 minutes to create enough holes in almost 10 belts. I have followed precise instructions to place a piece of denim underneath the \"gold\" plate to prolong the puncher and it has worked like a charm. I went over each hole twice, once from bottom and then top to get a uniform belt hole. This little mechanism is my new best friend.",
        "Great! Better than the Harbor Freight version (which only costs a couple of bucks less). Glad to see this tool is still made in the USA!",
        "I purchased this leather hole punch to use on a leather belt that is part of my TIE costume for the 501st Legion. The punch is fairly easy, and pretty straight forward to use. This is not something that I will use often. It definitely got the job done. For my use this was perfect, and the more expensive models would just have been a waste of money.",
        "I buy nothing but top grain leather belts. And I always have this in my bag to punch a hole for when my weight fluctuates or the belt stretches just a bit, which leather will always do. This whole puncher is built for professional use and and every time I grab it I feel like I'll be handed down to my kids for sure.",
        "When it comes to leather tools Osborne is one of the best in the market. You can not go wrong buying Osborne tools, pricy but well worth it for the craftsmanship and material used.",
        "Very limited use and didn't work with what I wanted to use based on description.",
        "Easy to use, i donrecommend using a small piece of cardboard behind the area you want to punch on the belt.",
        "I received this punch today and the punch varies slightly from the image pictured. I tested the different size punches on various thicknesses of leather, and It was really difficult for me to punch through even the thinnest leather. Maybe I am just a weakling, since I had to use both hands, but I have used other hole punches in the past and they weren't as difficult as this one. I am really disappointed and am returning them for this very reason.",
        "It's a good, solid product which works exactly like it's supposed to.",
        "I caveat this buy saying I have never used any others to compare but I did not love it, the tool could use being sharpe, you had to press over and over again and sort of jiggle back and forth.",
        "Good sharp tool which punches wholes with ease. I use it for leather bridles, halter and other horse tack.",
        "Works great and has a solid construction. You will need some strength to punch through thicker leather and works best if you put some thin cardboard on the bottom to allow the metal to go completely through.",
        "Product arrived quickly and was easily used as I put it right to work. If you need a leather punch, this will do the job. Beats take a large nail or a center punch trying to do the same thing. Should have bought this a long time ago.",
        "This belt hole puncher works like a charm. The only complaint I have is that I'm unable to tell when the punch goes all the way through the belt. It does take quite a bit of strength to allow the punch to puncture all of the way through. But it's leather and that's what you'd expect.",
        "This name brand was recommended to me by my dad, who purchased his years ago. It feels steardy & works great so far!",
        "I am frequently making large numbers of holes in leather - I run a summer camp for kids and create pre-holed projects, as many as 15 or 20 at a time. This tool is a lifesaver. The kids do not have the hand strength to make the holes so I am still doing all the hole-making myself, but with this tool I can do it quite quickly. I have had better success with stiffer leathers. Surprisingly, the soft, supple, thin leathers do not cut well with this tool.",
        "I really like this hole punch, I can use it for making holes in shoes or belts. I read somewhere that you can keep it sharp by adding a piece of jean fabric behind the leather you are hole punching so it doesn't get dull, and I'm doing that",
        "lost some weight.. needed new holes in a belt... this did the trick.... and seems sturdy and well made... and a plus to be made in the usa",
        "Very solid. I've now finished my first pair of shoes using this punch, and it was a lot easier to use than the hammer punch.",
        "This cuts awesome! It's my first leather punch, so I can't really compare, but the performance I'm getting is right on the money.",
        "VERY USEFUL, SINCE I HAD LOST A SIGNIFICANT AMOUNT OF WEIGHT, I NEEDED AN ITEM LIKE THIS FOR THE BELTS THAT I DIDN'T WNAT TO GO THRU THE TROUBLE OF REPLACING.",
        "Losing weight and the belt is getting loose, I tried to drill out a hole which worked but was ugly. This put in beautiful holes very easily. And it'll be handy for other things in the future, good tool to have around.",
        "Works great!!! I have used it multiple times on different items (i.e. Purses, belts)",
        "I sue this anytime I need a new whole in my belt. Presto! No more messy homeade belt holes!",
        "I thought at first that I would return until I started to actually use it. SUre, it might look like a crazy medieval device for torture and scared the crap out of my family memebers. However, when I started to punch holes into belts and handbags to shorten the length of everything we began to save more stuff especially those fashionable belts.",
        "My husband loves this leather hole puncher. He says it's easy to use and doesn't hurt his hands.",
        "I read reviews for this product and was not disappointed. As another reviewer stated though, I would out a small piece of cloth or something on the flat area for protection and if possible use the floor or a sturdy tabletop to brace against to protect the punch.",
        "I got it from another vendor. The C.S. Osbourne punch works as well as any punch I've been mooching at leather shops. If you need to punch a hole in a belt, this is what you need.",
        "This one was priced a few dollars higher than some other basic models, but I was willing to pay a little more to get a hole punch not made in china, and I think it was worth it. It was easy enough to punch a hole in a real leather belt, and the hole is perfectly round and looks completely natural on the belt. I highly recommend this one.",
        "It does it's job with no issues. I made new holes in my leather purse strap and they look great!",
        "Exactly what I needed! Well-made & easily punched holes in the straps of my leather sandals so that they FINALLY fit!",
        "Only had it a short time, but doesn't seem to flex & warp like cheaper models. Will have to see how it lasts, but looks good so far.",
        "This is easy to use, punches neat holes wherever you need them in a variety of sizes. There's nothing worse than a belt that hangs loose...or one hole makes it too tight, the next not tight enough...this is the solution!",
        "I punched perfect holes in my belt and birkenstock sandals in a few minutes with this device. It could not be easier and for the price, it's worth having in any household. When you need it, you want it now!",
        "It's simply and easy to use, it allows you to make different sizes of holes.It might take a bit more of work to more a hole on thicker leather belt, but it worked well on mine.",
        "I was kind of leary purchasing the rotary style punches. This is better than some of those cheap ones, a little better quality. I only use it for leather crafting and serves it purpose.",
        "my life is now complete, now that i can repurpose so much belts into my size",
        "This is the only leather punch I have ever had that didn't buckle under heavy pressure. This is the one to buy",
        "Fabulous little tool. I bought a belt that was too big and cut it shorter, the problem, the holes were gone. So I got this little gadget and had rather low expectations of it getting through the thick leather. Super easy and nice clean punches.",
        "This leather hole punch does exactly what it advertises to do. Perfect for belts!",
        "I bought this because I bought a belt that was way to big for me and I didn't want to return it. It will also come in handy when my husband wants to buy a new belt because it has gotten too small, hehe. I'm no Wonder Woman so I was worried I wouldn't have enough muscle to actually punch a hole in a leather belt, and luckily I was wrong. If I can use it so can you!! I like how it has different sizes for the belt holes. I am very satisfied with my purchase.",
        "Had a few belts that needed a few notches, so I picked up this heavy-duty bad boy. I like how it has different sized punches, which because I had a few belts with different-sized holes. Recommended.",
        "Not much to say about this. Leather punches have not changed for longer than I've been alive. Haven't used it much yet but it seems rugged.",
        "How much can I say about a leather hole punch other than it works! There are fancier units out there but how much does one need to spend to put a few extra holes in a belt.",
        "Had one years ago and got this one because I knew it was so well made. Good hole punch that never sems to wear out.",
        "This thing works great! Use it on all kinds of belts, bags, etc!",
        "Used it on a leather belt that needed holes added. Followed advice in comments by doubling a washcloth as backing so the cutter wouldn't hit the metal stop plate. I have a pretty good grip so it punched through quick and easily. Would recommend and would buy again. Erik",
        "easy to use, does the job. measure, mark, point, click and you are done.",
        "I'm rather petite and most belts don't have holes small enough for me. This little gadget has changed my life and wardrobe. It is simple to use and now all of my belts fit! I wish I had bought this years ago!",
        "Seems like a good tool. I ahve used it a few times and been pleased. A handy \"Must Have\" tool for house and barn. Fair price for a fair quality item.",
        "This comes in handy more than youd think. I add holes to everything now. Its saved some shows and belts from being tossed away.",
        "This is a quality leather working tool. I am only an occasional user and purchased it for adding holes to the leather strap for my daughter's shoes and a similar purpose for adding holes in my wife's belts. The small punch size fit the narrow shoe strap and the tool works very well. Before I purchased this tool, I was using a drill bit and hammer and nail combination which I found too tedious. I don't know enough about leather tools to judge how an experienced leather worker would enjoy using it, however, I can definitely recommend it for anyone who occasionally needs to punch leather.",
        "Needed to punch some holes in belts and this did the job. Takes a lot of pressure to punch holes in a thick belt but the handles held up and will live to punch another day.",
        "Cuts right through any leather belt or any belt for that matter and has all the size holes you would most likely ever need for common belts.",
        "Punches would not go thru 6oz leather. One punch was not even sharpened. Returned it and will buy something else.",
        "Not sure what project I am going to need this for. Maybe punch holes in leather to crochet an edge or attach beadwork.",
        "Received the package ahead of schedule and the hole punch was packed very well to assure no damage came to it.",
        "This is old school quality. You might never have to replace this. Sturdy like a good old fashioned American tool should feel.",
        "I barely use it since I don't buy belt every month or every week. The tool does the job nicely. You do have to squeeze a bit harder but I think it's the way it should work. It may not be the best tool in its class. Yet I am satisfied what it does to my average leather belts.",
        "The quality of this punch far exceeded the quality of the punch I purchased and returned to Home Depot. I would recommend this product.",
        "Really......Zero stars, but I had to star. The punch will not punch holes. And one of the punches is chipped. Rendered useless. Money lost. To return would cost as much. Bummed.",
        "This item is working well for me as a hole puncher for my belts, and it's fairly inexpensive.",
        "This punch does the job very well, and seems to be a work of fine craftsmanship.",
        "seems ok so far better than the last onei bought",
        "Good solid punch, cuts through leather pretty well, although tool could be sharper for easier use. Frame stands up to heavy loads and doesn't twist or bend. Worth a buy and a try..",
        "I lost a bit of weight and need to use belts to hold up my pants, the only problem was that all my belts were too big as well. For less than the price of a single smaller belt I have been able to adjust the sizing on all my belts with this tool. Depending on the thickness of the leather it might take a bit of work to create the hole - I needed a pretty strong grip in some cases - but the end result was very satisfactory.",
        "If you need to punch holes in leather it doesn't get better than this tool. Great product, made to last forever.",
        "worked, but extra pressure was required, not sure if it was the leather or the punch not being sharp enough",
        "This punch works great and is made in the USA- I saw no issues with the quality of this punch.",
        "I purchased this to add some holes to my belts and it did its job well. It has now been taken over for multiple craft projects.",
        "This is a very good hole punch, but need a lot of force to punch a hole on leather. It can provide different size holes.",
        "This leather hole punch is of marginal quality. Mine shipped with the punch edges slightly deformed. It still works, but considering it's supposedly made in the USA, I would expect slightly better. For the price on these things, you might as well buy a really cheap pair, or spend more money, depending on your purpose. Aside from the mediocre quality punch heads, the tool itself seems reasonably well built.",
        "I have had this hole punch for a couple of months now and have had no issues with it. The construction seems solid. Punches holes as advertised. Rotating the drive tubes takes a small amount of effort, and they snap into place. I would recommend this product if you are looking for a leather hold punch.",
        "This revolving punch is good for punching holes in leather belts or anything else that need to have holes punched in it. One of the reasons why I bought it was I was in 4-H for a while in my mom's leathercraft club. I used various leathercraft tools to make various kinds of things out of leather and I got the state fair ribbons to attest to that fact. If anyone wants to call me on that I have the leather bound scrapbook with positive proof without a shadow of doubt that I have the ribbons.",
        "like everything about this tool, handles just right for good grip, easy to change punch, good quality and it made it USA",
        "I bought this punch to replace one I had for many years. The punch part had moved back into the revolving head. The new one looks a lot stronger, has a few unexpected features. It is very easy to change hole size.",
        "This punch is the single best tool of its kind that I've found.. I've used it to punch clean holes in heavy leather belts up to 1/4\" thick with little effort. The rotary head indexes positively and the size range afforded by the multiple punches will cover most needs.",
        "The hole punches are not sharp enough to punch through leather. It looks identical to one my mother had 5 years ago so I though it would perform as well. Even a male's hand strength was not sufficient to make a hole in 2 ordinary thicknesses of leather - a strap on a special shoe. The design is like the old models, but the quality of the hole punches is lacking.",
        "This hole punch is easy to use, and makes holes in a variety of materials. The hole punch needs to be cleaned out periodically or it does not make a clean hole. I've been using a very small screwdriver to clear out the excess material from the punch. It doesn't take much force to use, and works like it should. I accidentally broke one of the punches when it hit metal instead of the plastic I was trying to cut. I'm not bothered though, because there are several more sizes that can still be used.",
        "This is a very good quality hole punch. It cuts cleanly and leaves no frayed edges. The metals used are strong. It's not cheap, but you get what you pay for with tools.",
        "I bought this as my two year old dog was beginning to outgrow a rather expensive leather collar. It worked very well even though I don't have a lot of strength in my hands and I'm glad to add it in my tool box. It's well constructed, the hole punch knobs are sharp and hey, even my puppy is happy with the results!",
        "Works with all types of hole sizes. Good for the price"
    ]
}