{
    "entity": "Stovetop Espresso & Moka Pots",
    "text": [
        "This product does what it says -- HOWEVER, I am not about that plastic upper compartment. After multiple runs, I got the feeling that the difference in taste from a traditional moka pot wasn't going away any time soon (-1 star for you, Delonghi. Plastic bad). SO, I took the top compartment from my stove-top moka pot (Bialetti) and used it instead of the plastic one: works perfectly! NOT that I'm recommending this hack: I can't guarantee your pot won't explode and turn your kitchen into a mini-Chernobyl. It works great for me, though.",
        "Followed directions and made 3 pots of espresso before actual use. First 2 pots smelled like plastic, after that espresso was great. Makes wonderful espresso, tastes great , very easy to make and clean up after. So disappointed it is leaking from the bottom on the second day of use. I suppose tomorrow morning I will be back to my French press. Was very excited to get this and put away The French press. Can’t tell you how disappointed I am. I will update if anything changes",
        "I read the instructions, watched how to videos online, used filtered water, and used different ground beans (at different grind settings) with this espresso maker. No matter what I did, the unit would make the coffee taste burnt. I ended up returning the unit. It was disappointing because the unit had a small footprint and made a decent amount of coffee. They probably need a better temperature controller. I would recommend an Aeropress - it makes great coffee, easy to use, and easy to clean.",
        "First, the thing comes with a cancer warning. That was enough to run me off. Secondly, it is not made of stainless steel as the listing states. It is plastic and either aluminum or pot metal. I have had other units that didn’t make that false claim and were exactly the same construction. They corroded and we’re unsanitary, regardless of how you try to clean them.",
        "I love this pot, but this is the second one I have owned and unfortunately the rubber rings on the inside have come apart on both, and it's really difficult to find replacement parts for this. I wish the inside was more durable so the pot could last longer, otherwise this would be a 5 star product for sure.",
        "I purchased this machine because I would like to save money, I order espressos 3-4 times a week. This machine does not make strong espressos and it often smelled/tasted burnt. I wanted an electric machine to bring to work, but now it's collecting dust. I'm still searching for a machine to replace Dunkin Donuts. :(",
        "It makes a decent cup of coffee but the pot was assembled incorrectly causing a seal between the two aluminum pieces and plastic pot to become pinched. I wouldn't even have known there was a seal there except for the fact that the miss-assembly caused the seal to stick out a bit in one spot. The pinched seal is causing the pot to leak and a loss of pressure when brewing the coffee. The two aluminum pieces cannot be separated to correct this problem (the lower half is punched at several places to keep them from separating). I give it two stars as it still manages to make a decent cup.",
        "It says 3 or 6 cups, more like 1 or 2 cups, it’s a little smaller than I thought. In oz is 10oz to 11oz Times 3 to 4 minutes to start and like 30 to 40 seconds to finish The automatic off work perfect. When you take it from the cradle turn off and when you lived in 25 to 26 minutes later turns off automatically Construction feels very good and the plastic part is thick and hard. I prefer a cup mark and a closed lid for the top part and more volume. A 4 cups coffee machine is like 20oz",
        "I have had this for a while and an uncle of mine purchased his after enjoying what mine had to offer. The coffee is really enjoyable. Initially I had issue with flavor and it was in part due to the water at my job. At home it's great. I have found that two tablespoons and a \"smidgen\" of Bustello provide me with the flavor I like. It's much faster than its stove based homologue.",
        "I just got this yesterday but i've made two cups of espresso already and LOVE the taste. Some people say they taste \"plastic\" in the coffee. They must have a much more refined palate than I do cause all I taste is GOOD coffee. I like that the Moka pot is electric so I don't have to worry about burning the coffee on the stove like I do with my traditional stove top moka pot. This electric Moka pot coffee tastes better than the stove top pot I've been using as well. So far I'm a happy camper.",
        "The coffee is good, and I was impressed by how quickly the coffee is done. It’s a lot more efficient than a stovetop coffee maker. It’s very easy to clean, and it’s adaptable to make either more or less coffee. Recommended for good espresso. However, it has a flaw when it comes to making less than six cups. When using the filter adapter to make three cups, coffee grounds filters through. I mention this fact because perhaps with a better filter adapter this could e improved.",
        "I love this machine, it makes the best tasting coffee I've had in a while in my home. This little machine completely replaced my k-cup machine that cost me $200... With this machine you will get the complete flavor of the coffee you're using. My only issue is at times water leaks from the midbase. It doesn't happen all the time, but it does happen. Other than that, I am more than happy with this... Love it",
        "I use this to make Cuban coffee at work. I needed the plugin one , because being at work I can’t use a stovetop one obviously. I’ve had it a couple of months now and it has been working flawlessly. As long as you clean it right away, it cleans easily. I work the graveyard shift so this thing has been a lifesaver for me. Will update on the longevity of the product in a few more months",
        "All the heat is directed at the brewer, rather than my stovetop espresso makers which waste all that heat and are very slow to effuse the coffee. So, while the stovetop ones labor away at the 2nd and 3rd cups, this one stands ready. And a note about the seller: some sellers, like this go out of their way to make it work. The first one sent didn't work properly and a replacement arrived before I even asked for one.",
        "This is my first moka espresso, and I really enjoy it. It's rich, strong, and the perfect temperature. Because there's no filter, there is more fine sediment than the aeropress. Both are good, I think it's a matter of preference. This is easier than a stovetop moka pot. You it's easier to handle when hot, you don't have to monitor it for overboiling. I do wonder if I've traded of quality for ease. But so far so good. My preferred method: 1. Fill bottom with HOT WATER - this way the coffee grounds aren't getting cooked by the boiling process 2. Gently fill the basket with finely (espresso) grounds; pack lightly 3. Turn the pot on - and enjoy!",
        "Makes delicious coffee everytime. I've had it for two years and it runs like new. It's got a lot of nooks and crannies so it's a bit annoying to clean, but the delicious espresso is worth it. I recommend getting something to heat/froth your milk with as it really completes the experience, but you can make a nice americano or just have the plain espresso.",
        "I really like this Moka pot and I've had it for two years. I never had a problem until I decided it needed a dishwasher cleaning. Huge mistake on my part. Now the aluminum resevoir gets the white rust on the inside, which it didn't get before I put it in the dishwasher. My non-electric Moka pots all get the white rust, which is why I tried this one. Again, this one was fine until the dishwasher washing. An internet search has proven fruitless on how to rid or stop the white rust. DeLonghi - any suggestions?",
        "This electric greca is awesome so far I have no complaints no leaks or anything negative and it's actually faster then a stove top greca.. my advice would be to make some espresso 4 times before actually drinking it and let it sit a while because it first it will have a weird flavor so I just made 4 espressos and let it sit a while I even poured it in the bottom part also just to season the bottom metal.",
        "I am very happy with this moka pot. I needed one that could work independent of a stove top, and this one has the same heating mechanics as a cordless kettle. I did initially have some problems with the gasket leaking, but either from diligence of the gaskets \"breaking in\" I don't have a problem with it anymore.",
        "I’ve had this for years now and it still works beautifully. I use it 1-3 daily too so it’s definitely a strong little machine. What I did do was change the top plastic piece with a traditional Bialetti 6 cup stove top one. Not sure why they didn’t make it that way to begin with but my little hack works great!",
        "Works just fine. Base stays cool so you can put the pot on the counter or table without burns. Allows you to place it back on the unit and turn back on for 30 minutes to keep warm. Replacement parts are interchangeable with comparable espresso pots found at kitchen/bath stores. Despite the Italian name, it's made in China. Stove-top models are made in Italy.",
        "I did not want a single bit of plastic to be touching my espresso. So I opted to couple it with Bialetti 6-Cup Stovetop Espresso Maker, which gives this a metal top. This works nicely, but it's not quite 'auto-stop' That's only if you lift it off the electric part. The bottom is insulated, which helps so much when cleaning right after use.",
        "had a Bialettti Easy Moka electric which unfortunately was destroyed when someone put it in the stove and burned to a crisp. The Bialetti electric is no longer available but this one is almost as good. Part compatible with the 6 cup Bialetti stovetop or electric, though it's capacity is slightly less - say 1-2 oz less finished coffee. Only complaint is that it doesn't have a bell or beeper to tell you when the brew has finished. But it still beats the stovetop manual ones that i keep forgetting to turn off....",
        "It is a great coffee maker, makes tasty coffee (if you use good quality coffee). I ordered it on amazon and it was supposed to come on a certain day, nothing, waited several other days, no show. After over a week of waiting I cancelled the order and ordered it from another distributor, but the machine is good.",
        "Purchased on recommendation of a friend. Made one great cup of coffee but I am now unable to unscrew the plastic pot from the metal base - it is 100% stuck. I have tried everything to unscrew the two pieces, but no tactic had worked thus far. Will be contacting the supplier to request a replacement, as the one cup of coffee I was able to make with this pot was quite good.",
        "I've had this moka pot for a month. It works perfectly fine and makes the coffee faster than a traditional moka pot. I haven't noticed any plastic taste. I just wish it held 4 ounces more coffee, I like one big cup in the morning.",
        "I've had this for almost 2 years and use it often. It's more convenient than a stovetop pot that has to be watched, and the 'keep warm' function is a nice bonus. It's very easy to use and I've had no issues with it at all since purchasing it. I'd prefer the top pot to be stainless, but that is the only shortcoming I see in this pot.",
        "Espresso time at 2 during work. This is a wonderful machine. Word of caution, the machine will make the entire office smell of coffee if using it at work. I consider this a plus, others might not. One thing is that it took 3 tries to get a working one from amazon. I think I just got unlucky, but the first one leaked on top, the second one didn't start, and the third worked! Thank you amazon's return policy. Now that I got a working one, the product is amazing tho.",
        "Love this espresso maker! My friend introduced me to Italian coffee and I was hooked. I had to get my own to add to my coffee bar. This automatic one allows me to have it placed on my coffee bar table and not have to go back and forth from the stove!",
        "This is the second time we purchased this. Initially we had one while living overseas between the Mid East and Asia. Years have passed, we tried three or four other electric espresso makers - this one was the best of the lot if you love that original \"Italian\" flavor.",
        "Purchased June 2018, stopped working Feb 2019, just when it started making better tasting coffee. So disappointing.",
        "Saving money for a vacation next year. Was looking for an inexpensive way to make espresso. Was surprised to find this baby at $40 when most others were at least $100. Thought it was too good to be true but ordered anyway. Ha...I was wrong. It is excellent for my needs! I've only had this for a week but already enjoying my morning shot. Also great in the afternoon, I make from foamy milk and presto, I have cappuccino. I will update this information if anything changes due to product use and wear and tear. As with any other electric device and made of plastic, light on handling the plastic and keep the electric outlet away from water.",
        "Exploded. Get burned. Everything has been messed up. Have to clean whole day. When I used it first time; it was leaked. Second time, burned itself. Third time, boomed. I disposed it without no regret. If I keep this, I believe I will be in serious injure. Rather than this I am going to buy instant coffee. No different in taste.",
        "It makes coffee unlike my stove top Moka that produces a good cream. The directions say to use only ground coffee and do not use expresso or tamper. Very disappointed. Using expresso, bent up the sides of the 3 cup devider, and there was coffee grounds in my cup and the pot.",
        "Follow the directions - do not overfill with coffee grounds and DO NOT tamp the grounds! If your unit leaks, it's because you used too much grounds and/or tamped the grounds. Great quality for the cost, but for me, the brewed espresso isn't quite as strong as I typically like.",
        "I love this! Have had it at least 3 years. It works great! I love that it keeps it warm too. I kept leaving my manual Bialetti on the stove.... I burnt a few handles and caused some unsafe situations... AH! This is literally a lifesaver. They must train the Italians young... I bet they don't forget about it on the stoves.",
        "This coffee maker is a must! Easy to travel with if you need to. We take it on our trips because I can’t start my day without coffee. Easy to use and great material. Coffe comes out tasting fantastic and so quickly. Love it!",
        "This is a GREAT little espresso maker...elegant and electric so it even travels well. I take it with me on business trips for my morning jolt of sweet Cuban java (one of the strongest and richest of coffees mixed with heaps of azucar.) It's a ton of caffeine for one, for sure...and other customers have been clear - the pot serves SIX. Or one of me. I highly recommend the Alicia model as well...it's compact, light, and the clear top lets you see exactly when your cafecito and such is ready. Enjoy.",
        "This is my first moka pot and I'm very pleased thus far. The flavor is great and not all that hard to clean. I'm happy to have a little taste of italy in my home. The 3 cup adapter has started to bend but I find better results without it. I have a glass top stove so having an alternative but getting what I want has been fantastico. It's worth the purchase.",
        "I bought this because the heading of the listing says \"stainless steel.\" But the boiler is aluminum. I went back and yes, the listing says the boiler is aluminum, so shame on me for not reading the print instead of relying on the heading. I am returning it.",
        "This coffee maker works very well and very fast. It makes a nice cup of coffee in about three minutes or so, and it allows to adjust the concentration of the coffee.",
        "For waaaaaaaay too long I've been using a stovetop moka pot to brew the best damned coffee you can put your lips on. Oh how wrong it turns out I've been for not using an electric pot to get the same rich, bold, smooth taste in about half the time it takes to make on the stove. Wowza! Great purchase for my office!",
        "Where have you been all my life? I'm a teacher, which means I get up BFE and can barely function as I stumble through my morning routine. There is no way I'd have the mental capacity to operate a traditional espresso maker and regular drip coffee just doesn't do it anymore. With this beauty, I fill it with my coffee and water the night before and then hit the start button before I hop in the shower. Pure bliss percolates and before I know it, delicious, rich espresso and all it's caffenated glory is pumping through my veins. It's the methadone to my Starbucks addiction. Thank you.",
        "Out of the box, the item leaked. Tried it 3x, tightening it more each time. Was not overfilled. Didn't have it long enough to test other parts of it, but that handle seems useless. Nothing to really grab onto the open and close the item. Needs redesigning starting with the gasket.",
        "Makes delicious Cafe Cubano or Espresso. So glad I bought this. Easy to use, easy to clean. Used a similar type but different brand maker while visiting Cuba. This surpasses & I’m so glad we bought it! Much easier then a stovetop.",
        "Every time I use this product to brew, no matter what I do, the lid bends out of shape and grounds get in my coffee. I follow all the directions to a T and have also tried different grinder settings as well. I wish this actually worked because I love the concept and ease of use",
        "I became hooked on these little espresso makers when we were staying in Rome. As we have an induction cooktop, I needed something that plugged in. Now, if I can just find an inexpensive way to foam milk.",
        "Oh my! I wish I knew about this little gem years ago! I wish it held 2 more ounces so I could split the delicious result between two espresso drinks - if completely full, It produces between 6 and 6.5 ounces, but of the most delicious coffee ever. Seriously - I'm getting AT least 3 times the strength of what I got with the K-cup coffee maker and twice what I get from the French Press using the same amount of coffee. This is a wonderful machine! I've only had it a month, though! Here's to a long an beautiful life (*crosses fingers*).",
        "Love this coffee expression maker. It makes the best expressions. This is my third one. They don’t last forever but since I use it twice a day and I always know I going to have a great latte I don’t mind .",
        "Just got this and tried it out immediately. I have to say this works just as I expected (and wanted) it to work. Very easy setup and the coffee is just as good as the stove top version (even makes the free coffee beans I got from Starbucks taste good).",
        "I've owned a stovetop version for years, but wanted to enjoy this type of coffee at work. This makes it practical. I agree with a previous reviewer that the plastic section is sub-par and has a seriously funky smell/taste. I imagine this diminishes after several runs as the manual indicates. Also, kudos to the vendor for immediately replacing the defective unit I initially received.",
        "First review I have written for a product and this is because this works great. Per the other reviews, there is no plastic taste from the upper chamber. Very fast at 4 1/2 minutes from start to finish brewing. About 8 oz total brewed coffee for the large serving. I have a very small 2 server stove top Bialetti I love but wanted more coffee at one time. I bought several larger stovetop Bialettis to fill that gap (since my small one works so well) and returned them all as they burned the coffee before finished brewing. So far so good with this.",
        "So disappointed! Worked fine for only 4 month. Yesterday I put the carafe on the base and the on button did not stay on. This is the reason why I just gave it 1 start",
        "To me, it has a very close taste to espresso. I use mild grinded beans. I tried med dark and the flavor was wayyyyy too bitter. Be careful not to wash the bottom like the instructions says. Easy to clean once it cools.",
        "I use this on my sailboat all summer as well as when I travel in the winter. Uses less than one watt hour of electricity",
        "Handy machine for when all the stoves at work are unavailable. I think you could use it anywhere there was an electrical outlet and water. I used to have to brew the stovetop espresso at home and put it in a thermos, which was OK as long as I knew ahead of time whether I was going to want more coffee. But now I just keep the Delonghi Italian espresso maker at work and it's there for me when the day gets too long.",
        "Loved the item of this item but it didn’t work and when I used it the coffee had all the grounds don’t know it item was broken but not worth the price Item was return",
        "Compared to the Keurig machine, this is the bomb! I like STRONG coffee so very happy with this purchase.",
        "This is the 2nd one I’ve purchased. The machine starts off great but in just a few months (2) it starts burning the coffee. All of a sudden you get this weird taste then it just gets worse each day. Won’t buy again.",
        "I tend to forget i have my stovetop version cooking so with auto shutoff on this i dont have to worry.",
        "Hello Amazon. I received the product and it was in good condition. However, after the 4th use, the water will not heat anymore. The light on the dock is on but the water is not boiling. I am in Malaysia and what do I need to do?",
        "I am in love with it more each day. You can keep the coffee warm by turning on the switch after you have served yourself. It takes a couple of weeks to get the amount of coffee just right.",
        "Received product and for a day it worked great. On the second day I went to empty the filter (the cup into which you place the coffee grounds) and the funnel portion snapped off. No real force was applied; it just is made of a really cheap thin aluminum. I requested a replacement part and hope it was just a fluke but if it continues it will go back, despite working otherwise.",
        "I have used a pot like this for years. But not electric. I love to set it and forget it. And when it;s done just go and pour it.",
        "This is a great and easy way to make my morning brew. I have owned 2 of these. The first one lasted for several years before it stopped working and I replaced it in December of 2017. One of the reasons I like it is because of the auto-shut off. This 2nd one I have purchased makes good expresso except the auto-shut off no longer functions.",
        "I use it when I travel because I'm difficult to please when it comes to coffee",
        "LOVE this moka pot! Easy to use and clean, and makes the perfect cup in mere minutes. I've been using this for awhile before posting a review, and it's not let me down one single time.",
        "Amazing product, very quick and convenient. I get better coffee than I’d was getting with my other coffee maker, and with fewer coffee grounds! I make two “pots” each time I fill the filter. First pot is strong and sort of like an espresso. Second pot using the same grounds actually makes a decent cup of regular coffee.",
        "Not the best to clean since the bottom can not be submerged in water but with that default I would still buy it again espresso comes out quickly and hot",
        "We use it every day. Super simple to use. But it can be a little messy putting in coffee, especially if espresso grind. Still totally worth it.",
        "Makes coffee fast, the taste is great & I like how it keeps the coffee warm . Features I would like differently would be to have the lid be glass instead of plastic. I would prefer for the lid to be removable. I’m afraid the lid could break easily for those two reasons I mentioned above.",
        "Great quality. Fast shipping. Very happy with product. I had same one before,used for 10 years and this one is perfect. Thank you",
        "I've had one of these before. If you use it correctly, and use the metal areas to screw together, it makes a very good cup of espresso.",
        "This makes the most delicious coffee and never burns it. I wish it was even larger for more cups. This was an amazing purchase!",
        "Great product. my only complaint is that if left for even a minute after its done brewing, the coffee will burn!",
        "just like the old stoce model but automatic! great coffee, easy to clean up. Great product by a great company!!",
        "Very easy to use however EVERY pot is full of grounds.",
        "This is a great coffee maker.... I hated the stove top espresso pots because you have to lift the lid to see if it's finished and the coffee splatters...this is easy, fast and the espresso comes out great.",
        "Made 1/2 a pot first day. On my second day will not heat up. Will have to return. Very very disappointing.",
        "First time I tried to use this the pitcher would not unscrew from the base. I had to return it with grounds still in it because I was scared it would shatter and cut me if I pushed any harder to release the pitcher!",
        "Took a 100 year old design and revamped it with plastic. Lasted 3 months before breaking while unscrewing. Do. Not. Buy. Many other people have had the exact same experience.",
        "I purchased one for my office but after a few months co-workers enjoy my espresso so much that I had to buy another.",
        "I have had my Alicia espresso machine for a year now and love it -its the most efficient, compact machine for making a great brew -and I had gone through quite a few esspresso machines before Alicia. I've never had any trouble with any of the parts on this one and still use the original gasket with no leaks or problems. I started drinking espresso for the low acid process and coffee from Alicia has never let me down. I've even taken this on travel and plan to get a second one for that purpose.",
        "Easy to have my latte at work! I use this and it makes a very strong coffee that I add frothed milk (microwaved and frothed with a frother) to and it’s very much like a real latte!",
        "The top is made of plastic that contains BPA. Heated liquids are known to release BPA from plastics. There is a massive warning label on the box.",
        "I love this pot but I found a few issues: 1. Difficult to clean specially the plastic top part which gets dark due to the coffee really quickly 2. The outside gets super hot so be careful don’t get burnt 3. It’s difficult to know how much water to put",
        "I use this almost everyday in the office. Its great",
        "Love this! Received it as a gift because I wanted to try cafecitos and it makes really strong espresso.",
        "Since the bottom heating element can't/shouldn't be filled under running water, we set it up at night and hit start when we're still bleary eyed. The automatic turn off makes me happy as I've tossed TWO moka's in the last two years after they sat too long on the fire and were damaged by some melting issues. So far - love it.",
        "Exceeded my espresso expectations coming from someone who used to use the Jura F9. Decent espresso for a bargain.",
        "The best coffee maker. Cheap. Works. Depending on what you put in - makes great coffee with deep and pronounces taste.",
        "Excellent! Works perfectly in our energy limited environment (on a boat operating this off of a 2KW inverter from a 610 aH 12VDC battery bank). After over a year with daily use the gasket is starting to look like it will be needing replacement but continues to work fine.",
        "very easy to use and works great. I use it almost every day now",
        "Works great. I have been using for a few weeks and have not had any problems. SOOO much better than watching the stove top version on Moka pot. Brews faster it seems, and very easy to use to get good coffee.",
        "Even if many people told me I couldn't use this machine with a smart plug, I use it every day with a smart plug (not included) and it works perfectly. I just need to prepare the moka before going to bed, press the button, and when the plug goes on after 5 min I have hot coffee ready.",
        "I have two of these little gems - one for home and one for work. I have used them almost every day for about 6 months. I had leaking problems with them both until I figured out that I had to be sure there were ZERO coffee particles caught in the gasket. since I figured that out, zero leaking and all good coffee. I highly recommend this coffee maker!!",
        "Bought this for the office, where the coffee is weak and the beans are stale. I roast my own at home and use a Zass knee mill to grind for my DeLonghi EMK6 electric moka pot. I could wish it brewed just a little more slowly but the coffee it puts out is a heck of a lot better than the swill from the community dripper. Replace the rubber gasket with a silicone gasket, and keep it clean.",
        "Love this thing! So close to espresso if not better some times. Depends on the coffee you use of course determines the outcome of flavor etc. Perfect for daily home use or on the go!",
        "It's great! It's easy to go from six cups to three, by excluding or including extra screen in the filter. The machine turns off when you lift the caffettiera off the base. If they start selling the model with the timer in the US, I'll buy that one, too.",
        "Works great....we have owned this model for years now. Replacement just as good as original."
    ]
}