{
    "entity": "Stovetop Espresso & Moka Pots",
    "text": [
        "I lived in Europe for 12 years and used this pot every morning before my run to make perfect espresso. Unfortunately my original pot was lost in the move back to the states and the new one I bought from Amazon was not at all the same. The coffee has a metallic taste and the pot has not been able to stop shedding a residue that not only tastes awful but coats my fingers when handling it. you can see the dark material on one of the photos as it stained my finger. Not sure whats up but suspect a knockoff or material change. As you can see this item does not have the Bialetti logo or configuration.",
        "Theres no way this is an authentic Bialetti. My first bialetti I found in a thrift store for $3. Its much smaller than the 6 cup one i ordered from here. I wanted a bigger one to be able to make more at once. This one that came in was shiny fake looking, cheaply made, and literally weighed less than my little tiny bialetti. My original bialetti is seriously have the size and is heavier and the quality does NOT compare. I tried it once and the espresso also does NOT compare to my little real one. Theres No way this amazon one is real.",
        "Went for the 6 cups as so many reviews say it is the one Made in Italy and the rest are not. I don't know about that as I don't have personal experience with this pod prior to this purchase like the experience of the genuine ones to compare with. but this 6 cup model looks and worked great. love it. by the way, it came with a sample ground coffee pack in it and the coffee was great. Recommend it.",
        "I bought the 6 cups size and also i read most of the reviews before buying but against of those bad reviews i wanted to give a shot and I'm so happy none of those things that people complaining about happen to mine. it works awesome solid product and good quality and good flavor the only thing that i can say is, the gasket is not stainless steel and it's a rubber so in future you'll need to renew it or either buy the stainless steel as i did. Also i'm gonna order another one for my camping package so i can use that one for using on direct firewood.",
        "This is my first time making anything but regular drip coffee. The Moka was recommended by a friend and I'm glad I went with it. I read all the reviews and found one about the different sizes sold here on Amazon being mostly made in China but that the 6 cup was made in Italy so that's the one I chose.... It states on the box and is stamped in the metal that it is made in Italy. It seems well built and I'm quite happy with it so far.",
        "Maybe I'm just used to the 3-cup Bialetti, but this thing operates slightly differently, probably just due to physics. It takes longer than the 3-cup even using a bigger burner, and the sound is different and actually a bit quieter. So I had to get used to the different sound, which is traditionally how I knew my 3-cup was done. It also seemed to leak a bit where you screw in the top, but that problem seemed to go away after maybe 10 uses. Maybe the O-ring seated itself better through use. Other than those minor issues, I have no regrets.",
        "I only bought this brand because it was recommended by consumers report magazine. The problem is the shape it’s very hard to clean specially if you use milk products definitely you will end up with bacteria in your body!! Why they did it this shape? No idea. What happened to the Italian brain who designed it( maybe to much chicken nuggets)LOL . And the other problem that it will crrodite within the first week of use .",
        "I've been using Bialetti Mokas ever since I have memory. This was about to be my first own Moka, but it burned. The handle melted as well as the rubber inside of the filter. The engraving at the bottom of the water container was sort of funny looking and the machine was considerably lighter in weight than the ones I am familiar with. No pictures attached since this happened months ago.",
        "I love my Bialetti! I tried replacing my very old espresso machine with newer versions and none of them came close to making espresso as well as this stovetop version. Plus, the Bialetti is a tenth of the price! I ended up buying one for my brother and friend as well. It's pretty much all I use, and the 6-cup seems to be the perfect size. I fill it halfway if it's just for me, or all the way if I'm sharing. It's great quality, too. I tried another brand first and it started getting this really bad, black residue which was unsettling. No issues at all with my Bialetti and I've had it almost a year now.",
        "We got to learn to use Moka pots in Italy. Trying to relive the experience, we looked online and glad to find the \"original\" Moka pot being available on Amazon. We love it and have been using it since. I know there's a lot of other brands, many made in China. We opted for the authentic one. Although we have an induction over, we did not buy the variation that's specifically for induction over, rather a tradition cook top. Until we bring back an induction hob (an adapter plate) from Italy (the last time I checked, the ones available in the US are big and ugly), we just use an old stainless steel cooking pot as an adapter.",
        "This was my first stab at using a Mocha pot so wasn’t well versed on what to buy and how to clean up. Looked over the instructions and outside of the box, hand washed it and got out my recipe. For clean up I wiped everything and placed the pot in the dishwasher to further sterilization, removed from dishwasher and the shiny finish was now a dull powdery finish which I was able to clean off. On a second review of the box I was able to find an X through ( at my age ) required magnifying glass to figure out it was a Dishwasher. I guess it is a good product just beware of the dishwasher.",
        "These work great. Many reviewers complain of breaking the plastic handle. Here is how to prevent this when unscrewing it to clean it. There is no reason to put any pressure on the plastic handle. Hold the bottom of the pot in your palm of your right hand with the spout pointing at you. Put the fingers of your left hand between the handle and the body of the pot. Press your thumb against the spout while untwisting the bottom.",
        "After a recent trip to Italy where these were in all of our Airbnb’s, we decided we needed to get one for ourselves. There was a short learning curve making coffee on our ceramic cooktop but we now enjoy using it at least 4 times a week. Only reason I don’t use everyday is in consideration for the use of steamed whole milk to make a cappuccino which feels A tad decadent on a daily basis. This Bialetti is the brand sold in Italy so those that wrote reviews disputing that are incorrect. The bottom is stamped “made in Italy” and if you get one that isn’t I would send it back. I’m very happy with my purchase!",
        "I have owned this item, for 4+ years. I use this item occasionally on the weekends to make espresso. It seems to do what I want. It concentrates the coffee well, is easy to assemble, and takes my abuse. I have left it on the stove to the point where the pressure valve popped and it was able to function well after that. My little sister, who lived in Europe for 2+years, swears by this thing, saying that every household has one. I don't know about the validity of that, but it does what it says it should and is built well, so I think it is money well spent.",
        "After going back and forth on an actual espresso machine or pot, I decided to purchase the Moka pot. I have to say I'm happy with my decision. Instead of spending hundreds on a machine that could potentially break, this product has saved me money with out sacrificing quality. I read that technically it doesn't make an espresso but a hybrid of something between coffee and espresso, my expectations were exceeded. At first I was a little intimidated by the overall process, after watch you-tube videos, I made me first cup with ease. I definitely recommend this product!",
        "I have my old 3 cup pot for years now, and had another one in the past. wanted a 6 cup one for hosting, but it's a completely diffferent quality. the metal is super thin, the pot looks like someone painted it with metalic color, there is a chunk of paint that got loose and is floating in the water tank. No thanks, if i wanted a cheap moka pot, i would just buy a cheap one. thought that i'm buying bialetti.",
        "As a Cuban I love this type of “cafetera”. I got excited and got two of these for home, 3 and 6 cups. I got really disappointed by how this material changes the flavor of the coffee. You can taste the metal (aluminium) in it :(. Just two months after I got them I discovered corrosion on both of them. I’m very meticulous and careful when I clean them after using them and never ever let them wet. I’m guessing the quality of the material is very bag... anyway, very dissapointwd with it.",
        "The \"dimensions\" are better than the smaller 3-cup version and you have no doubt that it is made in Italy. By dimensions, I mean the \"pipes\" inside as well as the base. The base of the 6-cup covers nicely the small burner of the gas oven range whereas with the small 3-cup version you have to place the moka pot even on the small burner more carefully. The larger pipes also mean they get cleaned better. The \"downside\" is that you will prepare coffee for two persons with the larger 6-cup machine. You can always pour one extra cup and microwave it in the afternoon.",
        "It leaks at the gasket right out of the box. Cleaned to make sure it wasn’t something in the screw part. Nope, just leaks all over the stove. Coffee tasted good though. Wish I hadn’t thrown the box away. I would have returned it.",
        "First off, meant to take a picture before I drank the coffee, but it was so good I couldn't resist finishing it off. Secondly, It is easy to use, and makes the 6 espresso shots in under 10 minutes. I prefer iced coffee drinks, so I brewed it, poured it into a ball jar and put it into the fridge. And finally, I do recommend using a coarser grind of coffee beans, the Moka Maker did come with a sample size of coffee, it was a very fine grind and it had a hard time percolating.",
        "I absolutely love this little pot! I have all kinds of coffee makers but I really wanted to try this one. I read most of the reviews so I knew I needed to buy the six cup one. So easy to use and clean and very fast! One thing I learnt was to be sure to tighten the top and bottom or it will leak. I would recommend this little pot and the vender who sent it",
        "I almost puked when I tasted the nauseatingly bitter result produced by this gadget even after following instructions such as using a short brew time, grounding coarsely, and using hot water out of a kettle rather than warming up cold water. Nonetheless, I know that it's possible to produce a good cup of coffee with this gadget and I'm aware that it's in popular use in Italy. But this is just an inconvenient, messy hassle for the average person looking for a reasonably palatable cup of coffee. I would strongly suggest any alternative including pour-over, Aeropress, french press - they all are more convenient and produce a better tasting cup.",
        "This is a great product for the price. Have to stress price because many reviews are complaining about quality on a product that cost less than a week's worth of Starbucks. I own two of these. One has been rinsed and air dried forever and looks brand new. The other was put in the dishwasher and looks like a WW2 relic. They both work just fine. If you want something more expensive, get something more expensive. This is a great product for the price.",
        "When your dish towel looks like this after wiping dry the inside of your coffee maker then it's probably not a healthy brew. This thing apparently is galvanized, which is not recommended (if not prohibited) for many culinary application, especially with hot food, where stainless steel should be used instead. I just threw my coffee maker away.",
        "Wonderful!!! My family has been using bialetti products since the mid 90s. So when I moved out I knew I needed to get one too. The espresso is absolutely the best. Great brand. These last forever. Make sure to take good care of the seal though, that's where it might start going bad. If you do ruin the seal, there are plenty of cheap seals that you can buy as replacements at home Depot, they're gonna be for a different purpose, but they do work. Or you can just buy another one from bialetti. Overall I'm very happy with my purchase and even happier that the quality had not changed in decades!!! Still top quality product.",
        "We have been spoiled. Our beloved roommates had one of these in the 6-Cup size. We loved being able to make coffee with an incredibly easy clean up process and minimal counter space used. After our roommates had to relocate for work, we were at a loss as a traditional coffee pot could not compare. I finally searched online and was delighted to find the same one at an affordable price. We all use it every morning with LavAzza Caffé Espresso. The 6-cup is usually divided between 2 coffee cups and diluted with either ice or hot water. This is perfect and does not taste watered down at all.",
        "Replaced a very old one and now I am so disappointed....it leaks! I bought new seals, a new screen, and yet it continues to spit and sputter all over the stove (hot steaming water!) resulting in half the amount of coffee. Not to mention, when loosing water, it makes the coffee BEYOND strong....like I can probably dissolve paint. Looks cute on the counter....that's about it.",
        "I have been using it for a while!I like it very much. Note please use that the water is drinking water . Unfiltered tap water is likely to be the killer of aluminum coffee pots. The fire should not be too high, medium heat.Do not need any dishwashing liquid, only clean water.",
        "Makes good coffee when it works. I’m not sure if these are knock offs but half the time coffee never makes it to the top chamber. I’ve been using these types of brewers all my life so it’s not something I’m doing wrong. For the price, I’d expect better from this name brand. Actual knock offs you get at your local Chinese shops are more reliable. When you need your coffee, last thing you need is having to brew it two or three times.",
        "I have a 3 cup one that is like over 25 years old and I replaced the gasket. This one is brand new and while the water is boiling up and into the upper chamber, water comes out of the threads. I'm too lazy to send it back and I am not buying a new gasket for a new moka pot. I'm disappointed considering that this is a high quality brand. I guess I got a bad one. Makes a good cup of espresso but of course not like you get with a $600 machine",
        "Bialetti brand is precision made. This our second maker by them (smaller one). We are extremely happy with both espresso makers. High quality crafted pieces. Guaranteed exceptional. Coffee comes out consistently delicious and strong. (Of course we use very high quality beans we grind fresh for each pot). Easy to use and to clean. Highly recommend these espresso makers.",
        "I had to return the first one I ordered and it's replacement both for the same reason; the coating on the inside was beginning to crack or fog and wasn't smooth all around like it was clearly intended to be. I switched to the stainless model which doesn't seem to have that problem but also arrived damaged. They brew a good pot of coffee but the quality control is severely lacking.",
        "I generally make a cup of coffee when I get home from work. I use a full pot and one scoop of coffee. When I am sharing, I put in two+ scoops and dilute the coffee with hot water (an Americano) or sometimes mix it with regular drip coffee for an extra kick. (Some people call that a Mad Max.) This is my second Bialetti, I foolishly gave away my first one when I moved 2 years ago. It got me through grad school, hopefully it's help its new owner similarly. :-) They improved the handle; I no longer burn myself taking it off the stove.",
        "This is the coffee maker that has been used for over a century to brew Cuban, Spanish,Italian coffee . With the advent of all the fancy electric espresso machines with all the bells and whistles, the company is closing down. This coffee maker will last literally for a lifetime. My dad is 87 yrs old and still has his original stove top coffee maker.",
        "While the Italians invented it, the stove-top espresso maker is also extremely popular among most of Latin America and the Caribbean. This is very simple to use, just be careful not burn the espresso by leaving it too long on the heating element. Bialetti is the only brand you should trust to make this correctly without metal tarnishing or a cheap build quality. I was given a smaller version that makes only half the servings and while decades old, is still going strong.",
        "Have owned three sizes of these over the last years. Have also given as gifts. There are a lot of copies available that are crap which I tried and learned my lesson. The non-genuine Bialetti leak, seal is weak, threads are loose. The Bialeti brand are very high quality. Not only that, they have replaement part available. I use mine daily and change the rubber seal every 18 months or so. Dont be tempted by cheap imiatations if you want an espresso maker that will literally last a lifetime, this is it. If you give as a gift consider including a replacement part kit.....",
        "Coffee & Bed Linens. My two things I think you should never skimp on. I love this coffee maker. It’s very easy to use (I use espresso in mine) and it’s fast, creating a clean crisp flavor. The 6 cup? That’s one cup of coffee as far as I can tell. ***Use safety w/this on stove. Recommend using on smallest burner only to minimize heat going on handle. Remember if you use espresso, you are making several shots worth.",
        "I really liked the size and quality of this product. It allowed me to make around 2 cups of coffee, and it was simple and easy to use. The aluminum body was easy to clean, I rinsed it in water and that was enough. Overall, I highly recommend it as an alternative to a regular coffee maker without the commitment of the expensive espresso machines. The coffee itself is great and I dilute it for Americanos, make lattes, or drink it as is.",
        "Reading through the positive reviews on this product gave me the reassurance in buying it and that it wasn't going to look used. I received the Moka Express on time and fairly quickly. Opened it to find what looked like a used product with unnatural looking blemishes and scratches, also the logo is faded both front and bottom. On top of that they over greased it leaving little globs of grease on the edges of where you screw the bottom on, was a little disgusting knowing I may be ingesting that lol. Also the wrapping was just loosely thrown in not even holding the product properly. Not expecting perfection, just excepting it to look presentable and at least new.",
        "This can not be the real version, since we have had great luck with the coffee makers made in Italy. This one says it was made in Italy, but the handle is melting, the seal between the top and the bottom doesn't work, and it does not yield the full amount of coffee each time it is used. Don't buy this one, but instead go to a local cooking shop and try to find a real version.",
        "Makes grood, strong, espresso-like coffee. Instructions were not the clearest about how to know when the pot is done perking. And not quite sure what the pressure valve's purpose is since it doesnt seem to pop put when the coffee is done. But overall Im happy with the product. It was what I was expecting.",
        "It is a proper Italian-made Italian coffeemaker. If you ever want good coffee from the same tool, at home, or in the back of your Jeep or Land Rover or a rental Suburban, this is IT. It takes less than five minutes at 24 degrees Fahrenheit and 9500 ft to make a full mug of crazy good coffee (the coffeemaker is ambitiously rated as a six-cup deal, but those are espresso cups). As a bonus point, it fits perfectly on top of a burner of common-as-dirt butane stove. Buy it and enjoy!",
        "This makes the cup of coffee I have been searching for! Strong, thick, rich coffee! I have used both espresso blend and regular ground coffee in this, with varying amounts of coffee grounds and water to tailor the type of coffee strength/taste I was looking for and so far all results have been positive! No leaks from the pot, it’s easy to clean, and makes a damn good cuppa coffee or espresso. I have owned or used a lot of different types of coffee makers. If you really love thick, rich Italian style coffee this is the one!",
        "I work at starbucks and although this isnt \"actually\" espresso it tastes just about exactly like it! (while using the right coffee). Also, this product is really easy to use, you dont really need to measure out coffee just fill the little middle piece until its full then level it (without tamping it) using your finger, fill water till right below the safety valve and put over the stove and watch the beauty of this product. cleaning is pretty easy too. All around a great product :)",
        "I've had a Bialetti before, but this one for some reason no matter how tightly I close it it always leaks all over my stove top. Also, the lid doesn't keep in contact with the cup, so sometimes it leaks from the top as well. Still makes good espresso/coffee but I have to take care to watch it!! Edit: it's because I've been filling it too high, too closely to the vent hole. It's missing the embossed fill line.",
        "This is perfect for me because I don't drink a ton of coffee each morning and I actually enjoy the coffee-making process. I don't want to just push a button and get coffee 30 seconds or 10 minutes later. What you get is one regular-sized mug of pretty strong coffee. I drink from a 3-ounce mug and I get 2 to 3 servings depending on how high I fill the mug. If you really like the taste of real coffee and enjoy being involved in the coffee-making process, this is great.",
        "Made 1000 coffees or more in this thing. Still going strong, and would probably last me decades, but the aluminum oxidization freaks me out. If I don't wipe dry the water container part of this bialetti, after 10 hours or so it starts oxidizing into the compartment. I don't want to drink aluminum. Maybe I'm ignorant. I switched to a stainless steel one.",
        "I took the advice of another user and bought the 6 cup maker that's made in Italy. My box did say made in Italy, and everything seems solid and is working as expected. This is the perfect size for my one mug of coffee.",
        "I have a leaker...mine spews water (not brewed coffee) from the threads where the top portion screws onto the bottom canister. Yes, I have tried tightening it...very tight to the point where if any tighter, I will damage the threads. I still use it but I do lose some water, which means I lose potential coffee (booo) in the brewing process. Coffee tastes great and it's easy to use and clean. I'm hoping that a new gasket might help with the problem but the problem has been there since day one.",
        "Moka coffee has its own taste. Use a GOOD quality coffee. There is a learning curve foer getting to know when to take it off the heat. But it makes really good tasting coffee.",
        "Since we bought this, we have talked friends into buying it and bought it as gifts. This is amazing, and if you are ever thinking about buying an expensive espresso maker, think again. Save yourself tons of money, and counter space, and spend less than $30 on this. Buy good coffee to go with it (we buy the Lavazza Espresso ground coffee) and you will love making all sorts of fancy or non-fancy coffee. I literally stopped going to Starbucks every week because I could make my espresso drinks exactly the way I wanted them. Again, more money to save without sacrificing taste.",
        "I have been using this Moka pot by Bialetti for many years. The one I was using (Probably I bought it like 15 years ago) broke off the handle. So I decided to buy a new one. Still the same and works great. I have seen some customers asking about if it's made in Italy or China, mine (6 cup) version says \"Made in Italy\". Well, as long as it works and lasts, that's all I care!",
        "Quality of materials is not at all satisfactory. The upper part started to leave gray dust after washing. Same as response here: \"Don't put it in the dishwasher! The metal has a weird reaction and leaves black soot-like powder on everything. Good size, but I wouldn't recommend it if you don't like to hand wash dishes\". I am not sure that it is healthy to use at all given such a reaction. I do not use it any more.",
        "Some advice if you've never used one: --top and bottom half of pot need to be screwed together VERY tight or it will leak. --like other buyers, I've used this on a glass top stove with no problems. Just keep the handle off to the side so it's not over the heating element. --you don't have to use a special \"espresso\" blend. People who tell you this probably own stock in a coffee company. Your current favorite brand of beans is a good place to start. --Much more important is your grind. You're looking for a coarseness between powder and regular \"table\" sugar. --Not sure what you're doing? Plenty of info online. I'd recommend",
        "I have an esspresso machine buy this is way less maintenance. I also feel like it makes a better esspresso than my Mr coffee esspresso machine. The bialetti is very sturdy and you can feel it's quality when just picking it up. I followed the directions and made a cup of esspresso pretty easily. It took longer than expected to heat up. Once it did reach the right temperature it didn't take much longer to finish brewing. The handle stayed cool enough to handle. I used bustelo esspresso grinds with this bialetti and the end result was delicious. Overall I would recommend this product to others and may even order more for my other esspresso loving friends as a gift.",
        "The closest to espresso we can get without getting a full machine. We read some reviews to get the Italy version and I think we made a good choice. It has a very thick bottom and is easy to use. Some sites have reported a metallic taste, but we have never had that happen to ours. We boil water in a kettle, add to the moka pot, then put the pot on heat to brew. We rinse it out right after brewing and have had no staining or residue.",
        "After first wash, the \"color\" started running. It left black ink on my hands and the pot lost its sheen. It was the 6 cup model. The box had made in Italy label.",
        "Used this happily for 8 months. Today the handle and top melted. Very disappointed in the product. We never turn the heat full on and certainly never apply direct heat to the handle. A cooking device should be safe to use on a stove on medium heat without fear of melting.",
        "Once you take the time and learn to use this correctly, it makes some great coffee. Definitely not espresso strength, but it is stronger than the average cup of coffee. Great for making a single cup when I don't want to use my french press. Also great for making Affogato, even though it's not espresso it still works great",
        "Love the product and we’ve bought it a few times over many years. The only downside is that it’s hard to clean the bottom part. We live in California where there is hard water so the mineral build up comes quickly and hard to get rid of (even with daily cleaning and occasional cleaning solvents meant for it).",
        "So far this is really nice, but it did arrive dirty, and for the first couple days the lid was squeaky/scratchy. It's better now, and works well! Good price for the quality, and saves money over time as it replaces expensive cafe espresso. (Although you should know that stove-top machines make something in between the strength of coffee and espresso- only a true machine can make espresso at maximum pressure/density)",
        "Believe the reviews about the silver fading! I had mine for a month and took immaculate care of it. I only used purified water and cleaned it exactly following the instructions. I did absolutely everything I could to make this last long. But now, it's all oxidized and gross. Wouldn't trust coffee coming from it. In addition, the piece holding the filter just...broke off. I unscrewed it and the cheap little filter lining came unglued, rendering the entire pot worthless. TOTAL waste of money. Don't buy this!!!!",
        "I previously owned the Bialetti Moka 3 cup and loved it. But after 15 years and snapping off the handle, I decided to replace it with a larger version. I gave this two stars, because I like the brand but this version is terrible. It works correctly about 30% of the time. The other 70% makes a mess all over my stove and when the coffee finally percolates it tastes burnt. I buy decent coffee, so it pains me to have to toss it out. Sorry Bialetti, this one is a total fail.",
        "For years I had been using a pour over and wanted stronger coffee. This is a real game changer for my coffee! I now am able to make my perfect cup of coffee whenever I want! I don’t believe in throwing away good money for overpriced fancy coffees and I love that this moka pot will last me forever!",
        "I threw this item out recently, I've had the most horrible time making espresso. I have the same product, but in a 3 cup and it still works flawlessly. The 6-cup kept overflowing at the part where the water container and the coffee container meet. And I used a ton of force to twist the coffee maker into a sealed position. Not sure if I got a damaged item, or if something is wrong with the design.",
        "I had one of these for years, but must have gotten rid of it when I moved a year ago. It was time for a new one and I'm glad I chose this model. Everything is as I remember it. It looks and feels great and it's high quality. The pieces fit together well, and using it couldn't be easier. Add water to the bottom, put in your coffee, screw the pieces together and then put it on the stove and wait a few minutes for freshly brewed espresso. Cleanup is just as easy. If you like good coffee or espresso, I don't think you'll be disappointed. Works and looks great!",
        "This my friends is the real deal. No more $6 Cappuccinos, no more $3 espresso. This original Bialetti Moka is my EVERYDAY go-to. And I'd say has saved me a significant amount of money. This holds up to 12 ounces of fluid ( 2 oz/per shot). I grind organic whole beans (that's right, whole beans) for my espresso. TIPS: 1) Make sure you make at least 3 batches to \"season\" the Moka and dispose of each batch 2) Do not use dish soap, rinse after each use and air dry 3) Do not put in the dishwasher 4) Allow the grind to sit loosely in the filter, resist your temptation to press it down. Enjoy!",
        "I just received this over the weekend. It came a day early. I bought MOKA coffee as well. It works and tastes amazing! I am not sure how I have gone this long without making my coffee this way. It takes less than 5min to make. It's a prefect cup of espresso. I bought the 6 cups size. And it's the perfect size for me for daily consumption. If it's too much for you, store the extra in the fridge and add boiling water to it the next day, you'll have a Cafe Americano.",
        "I have a Nespresso maker that i purchased in Dec 2018 from Bed Bath. IT works great but i cant use a espresso bean from Whole Foods that i love. This little thing is so easy to use and clean. Only take about 3 minutes to make the espresso on the stove. Use the small burner on the gas stove when you use it, otherwise the handle will get hot and yea ouch! LOL . I am very pleased with this purchase. It's my new go to in the mornings. If i have extra i usually use it later in the evening in pre-workout shake.",
        "I loveeee this product. It took me a few times to find the right temp and burner to make it but once i got it down it has been awesome. The coffee tastes nice and strong, so delicious. The best coffee i ever had was in spain and this moka pot comes pretty close to tasting similar to that which i feel deserves 5 stars",
        "If you want a cup of coffee that taste just like your local coffee shop, but this now! Disclaimer: do not put this in the dishwasher or use liquid soap to wash it! My husband threw mine in the dishwasher causing it to oxidize. So sad! I was able to salvage it by rubbing oil in the inside chamber, but I plan on getting a new one.",
        "The specs on this is much better than the SS versions. This allows move forgiveness in grind thus less burnt tasting coffee. Works on glasstop as well.",
        "It seems to work OK but no better than pour over coffee or a Mr. Coffee as far as I can tell. It can make a stronger cup of coffee than pour over. The pot is very small and a bit of a pain to clean. I fear leaving it on the burner and forgetting about it and having the water boil away.",
        "This makes a GREAT cup of gloriously strong, strong coffee! I put the french press & the pour-over nonsense away in the cupboard immediately following my first cup from the 6-Cup Bialetti Express Moka Pot. For anyone wondering, the 6-cup model is made in Italy, not chYna:) Seriously. This makes tasty coffee. Happiness CAN be found in a cup of coffee!",
        "The coffee is amazing. Everything is amazing. I love how it tastes, how it brews. It's awesome. But they sent me a used pot. It smelled like burnt coffee grounds right out of the package, and there was clear coffee residue on the pot. The smell was extremely hard to get out, to the point where I had to soak it in bleach overnight. I did not elect for a used product. I bought a new one and expected a new one. Normally, I would have returned it, but I decided not to and just leave a bad review instead. Getting a clearly used product when you've ordered new is not okay.",
        "Beautiful! I've wanted a moka pot since I studied abroad in Spain, but I didn't buy one in Italy due to suitcase room. Luckily, we live in a global era, so it was one click away! Coffee tastes like the coffee I was making in Europe, strong and flavorful. Easy to use and clean. I've had no fading or dulling so far, after about a month of use. Keep in mind, one coworker recommended a steel moka pot, as aluminum cookware leeches into food/drink, and thus into your system. If this is a concern for you (it's not really for me at this point), you might want to consider a different moka pot.",
        "Simple and straightforward. Easy to use and makes great coffee. Enough for one American coffee cup or can be split in two for small cup. Assembly and disassembly is quite easy and you can be sure you’ve got thoroughly clean. Haven’t had it long enough to comment on durability but seems very solid. I marked the versatility as one star because it only does one thing — makes coffee.",
        "This is my 2nd Bialetti purchase via Amazon and this maker is horrible. Not sure if it's a bad model or just as counterfeit but the espresso doesn't brew properly, despite following steps correctly and screwing the top on perfectly. Water boils and spills out from the sides, resulting in waste. I'm lucky if I can get 1/2 pot to brew and it has a burned taste. I'm asking for a refund or replacement. What a joke!",
        "I had a cheap imitation of this unit for a few years that disappointed me greatly because it would only brew a full pot maybe once in four or five tries. Otherwise, it would just sputter out a few spoonfuls of espresso and then quit. This genuine Bialetti, on the other hand, quietly and efficiently produced a perfect full pot from day one and has not let me down since. Accept no imitations: get the real thing and you won't be disappointed. Oh, also: Read and follow the full instructions once before using the unit. You really don't want to drink the first three batches of espresso from a brand-new unit. :-P",
        "I had to return it because at the first wash it lost its color and had a \"dusty\" gray residue... the replacement arrived broken and had to return it again... finally, got my money back.",
        "What an awesome buy! I just bought this after having my daughter as a must have at our house. I couples it with a set for 4 expresso cups and saucers and a frothing machine. It was so affordable and works so quick and makes awesome coffee. I have saved my husband so much money by having this at our home. No more trips to the coffee shop. This is the perfect gift too. When friends and family come over ... they are in love with it. It's a great gift for others. I give it 5 stars!",
        "A little intimidating at first if you're used to simple on/off drop coffeemakers but really easy to use and delicious once you get a feel for what to expect. I actually love the (simple) ritual of assembling and making the coffee. For something so inexpensive, it looks great and feels like it will last forever. Especially if you have already invested in a coffee grinder that can make finer grounds, this is a no-brainer addition to your coffee apparatus collection.",
        "More water came out of the seal than through the top. I have used a variety of these brewers, most lasting 5+ years, and this is the first time water leaked through the seal. I won't buy another, and I certainly don't recommend, Bialetti.",
        "It's been a year since i brought this and it still works perfectly fine. this pot is the best. Expresso Flavor?? for expresso? Woahh... Awesome. Over the year, I find it useful in many other thing. Check it on youtube, you'll find a lot. Love it.",
        "When I first made a pot of coffee it made one cup (mug) and that was fine. It was strrong and delicious coffee. But now after two or three pots, it only makes a small half mug and it horribly strong. I think I have cleaned it according to directions but I no longer like it, I'll give it a few more tries and is no improvement it's going back. I'm really sorry because the first two pots were great.",
        "Love this so far! I bought the 6 cup, which I'm now realizing is a little too big for us...but thats the only issue I've had! Brews super fast, the flavor is hands down the best espresso I've had outside of a coffee shop! The handle is plastic, so I just keep my burner on a very low setting while brewing, so far we haven't had any issues!",
        "This makes the best coffee I've ever had! Like being in Italy! The only draw back is that when I pour the coffee into my cup, it drips or leaks a little onto the counter. I can't find out where the leak is coming from, so I have to pour my coffee over the sink. This six cup maker actually makes only one american size cup of coffee. Excellent product besides the leaking. This product needs a link as to which replacement gaskette to buy!!",
        "Product functions as intended, but I’m not sure why it needs to be painted on the inside? The paint appeared to be bubbling after only a few uses and has me concerned it’ll flake off.",
        "I love it. I use it everyday, multiple times a day. It’s very durable and easy to clean. Makes the perfect cup of Bustelo. When cleaning or loading with espresso, be sure to twist open from the top and bottom sections instead of the plastic handle or else you’ll snap the handle.",
        "This coffee maker didn't hold up very well, I'd given it as a gift to my mother-in-law and after a few days the bottom of the coffee maker got completely discolored, no amount of cleaning with soap or vinegar got it out. Not a very good product.",
        "I absolutely love this little coffee pot! I am a person who prefers my coffee to be quite strong and this does the trick. It is very easy to use on the stovetop and I believe it will allow me to enjoy a better brew when I'm camping (fits perfectly on my portable backpacker stove). Very happy with this purchase!",
        "It works awesome! clean up is sooo easy too! I was worried that I wouldn't get enough out of the 3 cup size, 6 cup is perfect for making my morning \"starbucks knockoff\" drink. Looks cute and pretty just sitting on the stove, I read some complaints about it rusting on the inside, I think its because those people aren't letting it dry fully before they put it back together. I also learned that this is what people in Italy use for their home made espresso, and also Martha Stewart, if you need more selling points than that... I'm sorry for you. lol buy it! buy it now! you wont regret it.",
        "I always wanted this Italian classic expresso maker. I was watching the price sometimes and almost bought 9 Cup one since the price was about same as 6-cup one. Then one day I saw the price went down on this 6-cup one. I had to buy it since it was just about $22, which was amazing price! I saw same product at local Target and it's about $35. I was just so happy with my purchase price and quality of this product. I don't brew it everyday but a few times in a week. I get great a cup of espresso for my DH and a cup of cappuccino for myself every time I use it!",
        "I broke my french press so tried this out. I've used it 5 times and think I may give up on it, maybe I just don't like strong coffee. I watched a lot of videos on how to use it properly and still much prefer the press coffee over this. Just ordered a new press",
        "Used these alot in various hostels whilst travelling and just had to buy one when I got home. I love it. The size I bought makes enough coffee for one person, though you can make it very strong and water it down to serve two. Easy to use and easy to clean. Remember to never clean the bottom part - that's where the taste comes from!",
        "This is the second mocha pot I have found. The first one I bought was a cheap one. It didn’t work at all. This works great and I have delicious coffee in a short time. Makes great bold coffee!",
        "The review IS NOT for the product,but for the company that sells the product. They are HORRIBLE and unbusiness like. Their business ethics is REDICULUS AND NOT WORTH BUYING FRIM THEN EVER. PLEASE DO NOT APPTEMP TO PURCHASE ANYTHING",
        "I love this product so much. It makes the best coffee/espresso ever. Make sure to read the instructions fully before using as it has some interesting tips. Ie. Before using you have to run 3 batches of coffee through it before drinking, also don't use soap to clean it. It takes about 5-8 minutes to prepare 2 big cups of espresso, or add water to mak err about 4 cups of coffee. Me a d my husband save some in a glass jug in the fridge and have ice coffee later with half and half --- so delicious!",
        "This espresso pot works great! Its easy to operate and clean. All that's required is water, coffee beans, a grinder, heat source, and a cup.The pot is built fairly sturdy, although the handle could be more securely fixed to the pot. As far a cleaning goes, the components come apart fairly easily with the exception of the sieve that filters the percolating coffee. I have yet to figure out how to remove this part along with the rubber gasket around it that creates the seal around between the reservoir and the top of the pot. Over all a great product. 5 stars!!",
        "After experimenting with the tightness of packing the coffee, I found the taste I like best. I use a frother with the hot milk to make dry cappuccino and a little Mexican chocolate on top and my wife goes bonkers. Better than some coffee shops, not as good as others. Just pick the right coffee for it and your taste and it works very well. Easy to use and cleanup."
    ]
}