{
    "entity": "Food Storage",
    "text": [
        "As many other reviewers have stated, the lids are hard to get on and off. I can do it--fairly easily, I might add--but my kids can't. They can't get the lids on and they can only usually get them off. While this works out great if I'm the one using it, it's nearly useless if I'm packing it in a school lunch, which is what its primary purpose was. I will give it 100% credit for being leak-proof, though. I filled all 6 up with water and left them in a bowl and various angles of upside down and sideways and in the morning, not a single drop had leaked out.",
        "Tupperware is just Tupperware -nothing special. I use the midgets to take salad dressings to go, and the smidgets for pills. I bought a whole bunch so that hopefully I won't have to buy more any time soon. I usually end up losing the lid. This set is for traveling with ointments and creams. I remember using these when my girls were babies to always have diaper rash ointment with me.",
        "This have their purpose and my sister uses hers almost everyday. I find the lids hard to put on, which would probably get better with more use. Enjoy.",
        "I use these to pack my coconut oil, and other stuff I don’t want to leak, when I travel. They are small enough to fit in my carry on but hold enough to last for a weeks worth of travel. The lids are a little tight but I think that is what keeps them from leaking. Perfect for what I was looking for!",
        "These are great for taking pills for a trip, or taking salad dressing or dip for chips at lunch. I love these, as they are the perfect size for applications where nothing else really works.",
        "These are perfect for carrying a few ibuprofen, acetaminophen, or such in your purse. They are small, light weight, durable, and most importantly, stay closed. Very handy for any small item you want to keep protected.",
        "These are awesome for dressing, peanut butter and even salsa. They are small but a good size",
        "Poorly made (some of the lids wouldn't seal on the containers). I just tossed them in the trash.",
        "my original smidget container is 35 years old and recently got chewed on by one of my dogs. Otherwise it was very durable",
        "I have had ONE of these for decades, and was always looking for another. Finally found them here. I love them for daily dosage of pills at dinner. Very convenient for me to use.",
        "There are 100's of uses for this product however I use to hold my daily medication, so I can carry it in my pocket. This product is well made and lasts for years.",
        "I love these little containers and I continue to find so many uses for them. I originally bought 5 but ended up ordering 10 more!",
        "These containers are exactly what I expected. They are difficult to open and close when new. I followed previous recommendations to boil the containers and lids (apart) for 1 minute, remove them, drain the water and apply the lids while still hot and cool completely. They open and close perfectly and have a secure seal.",
        "Indispensable! These are so handy and they last forever. I've carried one in my purse as a pill box for over 15 years.",
        "I love their small size bc they tuck so nicely into a larger container, but I was disappointed in how hard it is to put the lid on and take it off. I was hoping to send them in my preschooler's lunch, but that is not possible. On the plus side, I can tell they are well-made and should hold up for many years. They are classic Tupperware quality. So I will give them a 1 star for my intended use (kid's lunch) and a 5 star for quality.",
        "I've bought several sets, because I keep needing more and more.",
        "Like the size because they are perfect for tablespoon size serving of mayo, peanut butter, dressing, etc. Had some trouble with lids fitting on correctly and closing all the way.",
        "Nothing to say- I've always liked the Smidgets and they're hard to get on their own. Usually dealers have them as prizes. I used them for pills.",
        "I use them for my vitamin's they are fantastic will purchase some more for my children very impressed.",
        "I do not think this is an authentic Tupperware product. None of the lids fit. They are unusable. I contacted Amazon and they are refunding the cost. Now just a waste of plastic.",
        "I bought these for my infant grandson to play with, as well as to put Cheerios in. He loves taking off the lid to find the \"treasure\" inside!",
        "The lid is very difficult to put back on. The size is perfect but there are definitely better containers out there. I had a lot of trouble putting the lid back on each and everyone of those little suckers.",
        "As others have mentioned, not all the caps fit upon arrival so you may have to boil them in hot water to loosen before they are useable.",
        "Few containers this size are watertight, but these are. Hold just barely 2 TB. You may need to boil them initially to get the tops to fit. I did si in the microwave.",
        "Some seem to complain that the lids are too tight. These are for sauces and liquids; they need to be tight! You just need to press the lip in when closing them. I can understand a young child having some trouble, but any adult should have the minimal dexterity and mental capacity.",
        "Perfect for when you need some asprins on the go etc....",
        "These containers are ideal for sauces or small items in a lunch. Because of the small circumference of the lids, they are a little stiff, but I was able to put them on with no problem. A plastic bottle opener opened them easily. I would purchase these again.",
        "I apparently didn't pay attention to the part that said 1oz because I was expecting these to be bigger. But they are good for the small size. The only problem I have had is that the lids occasionally pop off - which is a problem when you are using them for salad dressing! But most of the time these are a great help with packing lunches.",
        "Tops did not fit on the bottoms. Could not use these items at all. Very disappointed because usually Tupperware is of high quality.",
        "Love the small size, Although the lids are a struggle to put on, I am hoping the lids stretch with use.",
        "A must have for carrying anything small that you don't want to get lost. I keep asprin in mine. I received my first one as a hostess party gift more than twenty years ago and it's what I carry my asprin in. They are just awesome. I definately recommend these.",
        "These are great little containers, but the tops went on super tightly and they were almost too small. One set actually was so mismatched that the top and bottom didn't fit so I really only got 4 sets. Other than that they are just as advertised.",
        "the lids are a little difficult to get on. once you do, they do not leak.",
        "It doesn't seal air tight like my old ones. I was very disappointed",
        "Exactly what I was looking for at the right price.",
        "Are 1oz. Good for carrying your low cal alternatives to restaurants",
        "Do not buy these. $15 for this product is a total rip off. DO NOT BUY!",
        "These are perfect size to carry a small amount of condiments or spices. Maybe enough salad dressing for a side salad. The lids fit tight enough that they appear they won't leak. My plan is to carry my own spices and condiments for use at restaurants which commonly serve a hefty dose of MSG in their dressings and spices. I will try to order something that is least likely to contain MSG...like a unseasoned steak, baked potato, veggies or dry salad. A bit extreme, but after 2 trips to the hospital with severe swollen face and hives after eating at restaurants, I think I need to be extreme.",
        "The covers onthese are very hard to put on. If I could have returned them I would have.",
        "Terrible. It took 10 minutes to get the lid on because they don't fit properly. Ridiculous.",
        "The lids are pretty hard to get on and off.",
        "The lids are impossible to get on and off. I bought them for my kids' lunchboxes, but there is no way a child can get them on and off. Do Not buy them!",
        "They're great little containers for pills. Unfortunately, the lids are too tight.",
        "They work exactly as I had hoped. Small leak free containers for my lunch salad dressing.",
        "These are great! And, the price can't be beat! We love them!",
        "Love this cutter!!! You can make everything cut to the same measurements!! Much faster than a cheese cutter with the wire that I had before",
        "works great. Takes effort to get lids on and off.",
        "DO NOT BUY THIS PRODUCT!!!!!!!! The lids do not fit at all and cannot be returned. Bummer!!!",
        "Very hard to put lids on, my 5 year old can't do it, I had purchased them to put in his lunch for school, an adult would not have too much trouble.",
        "The tops do not fit!!! Extremely hard to put on!!! Very disappointing since the bottoms are the perfect size I am looking for :(",
        "They are a little small but perfect for my husbands celery sticks at lunch. He just uses two when he needs more. So far they are holding up well.",
        "A few of the lids are hard to get on.",
        "This product is awful. DO NOT BUY IT. I wanted small containers for my son's lunchbox. The tops DO NOT fit on the bottoms they come with. I tried every which way and could not get them on. The tops are too small. Annoying and frustrating. They are going in the garbage.",
        "My package came very fast and as perfect as was told they would be!!",
        "I'm happy that I have been able to find Tupperware products that I've been wanting.",
        "I ordered 2 sets of 5 containers and received 8 lids.",
        "Perfect size for condiments to take in your lunch. The only problem is getting the lids off and on . It is not an easy task. Which is why I only gave it 2 stars.",
        "Do not buy this product. I ordered them because I have older Tupperware brand containers just like these and I love them. I needed more but these are not the same. They feel \"cheap\" and there's no way possible to get the lid on. This is the first time I have ever ordered from a third party seller on Amazon and have been disappointed. Fortunately it wasn't a big ticket item.",
        "They haven't leaked but as previously stated they are hard to get the lids on. Which in my opinion is typical of Tupperware products",
        "Super tiny it only fits like one pill. Not for food. Will not fit snacks",
        "Item can't be returned. Way too small to use for much of anything. I bought them specifically for a one oz serving of almonds. Because of the way they are designed, with the cap pushing into the container, you may be able to fit 6 almonds. Won't order again and won't use this seller.",
        "Dear people of Amazon who can't get the lid on: I made you a video. The lids fit fine! They're so tight because that's the only way to keep them water tight so you can use them for salad dressings and things. You just need to use a little finger trick to get it on.",
        "These are ok. They are the right size for what I wanted (sauce containers for lunchboxes), but the lids have to be resized by heating them and then putting them on the cup part otherwise they are way too tight. Even after resizing though my kids still struggle to use them at school and it's just not worth the risk of salad dressing being splashed everywhere when they try to open these up.",
        "ok so these are just cute. I wasn't sure what size i needed and while these are smaller than I needed, they are great for other little items. I use one as a portable pill container that i can just throw in my purse or my pocket and the lid isn't going anywhere. An added plus is that the lids are the same size for this one and the 2 oz size. So I'm not going to run out of lids any time soon. They also work great for treats for my niece and nephew age 2 and 4, they love opening and closing them",
        "These little containers stay air tight even when jostled around in a lunch bag or suitcase. Great for condiments and for personal care products when traveling.",
        "These were a great buy and will probably order more down the road. They are perfect for anything I want to keep fresh, dry, or sealed. Fresh garlic that's minced, breath mints, vitamins or supplements that I don't want to take the whole bottle. And perfect for camping to keep seasonings dry in the damp mornings. Definitely recommend them to anyone that has asked about them.",
        "I had a small yellow smidget and used it for medicine in my purse. I always said if I found another one I'd buy it. I was tickled to see this pack of 5. I shared a few with my daughter. Love the color. And you can't go wrong with Tupperware.",
        "These are awesome little containers. We use them for holding sauces and dips for Bento boxes. We had to keep their lids on them, though, to help them loosen up. They're actually so tight it's hard to get the lids on and off. Having used them a while now, the lids are not quite so crazily tight. However, tight is a good thing, which is why we bought these over the eco-friendly metal containers. We value them not leaking EVER no matter what they are put through.",
        "I was worried, since some reviews said that the lids were too stiff to get on the container. They are very firm, but will most likely limber up with a bit of use AND I was able to get them on fine. The hold 2 Tablespoons of peanut butter (a serving) really well and I can get apple slices into them just fine.",
        "Who doesn't love smidgets? I bought these and then the salt shakers and am using the top of the salt shaker on these to carry salt substitute. These are so terrific you can find hundreds of uses for them. My wish list for these would only be this: make them in sets of varying colors so when there are 3 in my purse I can tell what is what more easily :)",
        "They cost more than they should: Limited availability on Amazon -- I'll be d4mned if I'll go to a 'party' to get them -- but they're a pretty solid solution for dressings and other small condiments for lunch bags. I've used two sets of them over the last 5-6 years. Other then 'losing' them to school lunches, they haven't failed yet.",
        "The lids are kind of hard to get on and off. I bought to put with sauces and dips in my daughters lunchbox but she can't put the lids back on so it ends up spilling everywhere. Be careful of warping in super hot dishwashers. A few of our lids won't work anymore.",
        "These were just what I wanted. Ideal for packing dressing, sauce, toppings, or a small portion of candy.",
        "These containers are great! I haven't had any trouble getting the tops on and off, and they have a good tight seal to them. Perfect size for single serving of add-ons and condiments.",
        "Smaller than I'd expected but that's my fault. I really want (and will end up getting) the old 2 oz Classic Midgets. Cleaned them and soaked in hot tap water, put lids on when hot and no problems. Works for salad dressing in lunch box, but I often need to use 2 rather than just one.",
        "Love these little things! The lids fit so snug and for those who left a review saying the lids are too small....they are not! They are made to fit super snug so yes, it can be difficult to get them on but they stay on and keep anything inside of them safe and secure! I will be buying more of these!",
        "I love these! They have so many uses. I travel a lot and I don't like to have so much stuff to carry. It great for cleansing cream or moisturizer. I also put just enough tylenol for a few days in one. My daughter uses them for her lunch to carry salad dressing or toppings. they don't leak.",
        "Love the size - it's exactly what I was looking for there, however it takes an act of God to get the top on. They don't fit. I have already broken a couple of nails trying, and I don't have long nails. That should say something. So far, I have managed to get one top on to one container. Luckily said container was empty at the time, or it would have been pretty messy with what I had to go through in order to make it happen. Very poorly made; I'm disappointed.",
        "Perfect size for camping condiments (oil, butter, jelly, mustard, etc.). Buying packs of condiments was way to expensive. 25 for $12.00. The lids are a pain to get on the first time, but after a couple of uses they are no problem.",
        "They were cute, and the perfecr size for what I wanted them for. However, the lids were darn near impossible to put on or take off. If you have arthritis in your hands, these will not be good for you.",
        "I haven't purchased Tupperware in 15 years but needed a leak proof dressing container and saw these. They're great quality, fits peanut butter for on the go and any dressing- leak proof!!",
        "When I got these, I could not get the caps on the container - they were slightly too small. I think this is buy design so they stay tight. I put the caps and containers in some boiling water to soften them up, put the tops on and let them cool. They work great now. And, they continue to break in to be easier to open and close, but always keeps a tight fit. We've gotten long use out of these containers - this was a second batch I've purchased.",
        "Wow these are small. I wish they had one of those pictures showing how small they really are. I will probably use these for dressing for to go salads and that's about it. Too tiny for anything else.",
        "These are excellent little containers for traveling with liquids or oils. I take olive oil and dressing everyday and never had a spill. Also easy to clean.",
        "These are perfect for holding salad dressing or other liquids and they fit conveniently inside the top compartment of my Bentgo lunch container. No issue with the fit of the lids.",
        "I love these Tupperware tiny containers. I use them as pill holders for my purse and they work great!",
        "I bought these for my boys to take condiments in their lunch boxes. They are perfect for caramel dip for apples, ranch for veggies, etc.. Just the right amount, spill proof and nothing to throw away. The only down side is that they are a bit difficult for the kids to remove the top by themselves. Overall, they are great!",
        "Needed a few more of theses to take meds with me, when traveling, all I needed was a removable label and I was all set to go.",
        "Love them! Perfect for my 1 tbsp of PB or of Butter for my toast on those mornings I make breakfast at work! Tips are difficult to get on sometimes, but nothing I can't handle",
        "don't know what everyone is talking about. these containers snap on easily all you need is some elbow grease. if not you could just put a little bit of olive oil on the lid.",
        "These are the best little containers ever - so perfect for salad dressing, toppings, earrings and jewelry when traveling. So many great uses!!! and the quality of Tupperware.",
        "Great Tupperware product! We use these for some of our toiletries and such when travelling.",
        "Excellent for transporting liquids. Since it holds an ounce, it is small and caution\\patience must be used when sealing and unsealing the container. Besides that can't ask for more.",
        "Super cute and small. The lids definitely prevent spilling. They're kind of hard to open but I don't mind it because I at least know my dressings won't get spilled. Great quality too for the price.",
        "Lids BARELY fit. It's a struggle for me to get them on, let alone my kids. Makes them practically useless. Bummer.",
        "I love these little containers. They are great for carrying small items like pills, vitamins, etc....",
        "Great little containers. I use them to out bbq sauce in for packed lunches.",
        "Love these little things. I use them to keep my medications I have to take at different times of the day.",
        "Lids are tight and just the right size for salad dressing",
        "I've worked with Tupperware products before and know there is a trick to closing the lids but that didn't work on this set."
    ]
}