{
    "entity": "Food Storage",
    "text": [
        "The marinated catastrophically imploded while marinating dinner, ruining dinner and sending plastic shrapnel onto the floor. My shirt, face and glasses were covered in olive oil as well since I was standing right next to the unit. Some of the pieces of plastic were quit lethal looking. What a mess.",
        "Ive had no problems. It's very well made. I think people are not reading the instructions and using these improperly. Common sense says if you over suction these they will break or implode. The instructions are quite clear.",
        "I bought two of these in 2012 despite the negative reviews. I am so glad I did. I use them 4-5 times a week to infuse whatever is for dinner with extra flavor. I wash them in the dishwasher every time I use them. They are still going strong. I even use them to brine meats when the recipe calls for it. Just a great addition to your FoodSaver. I love them! Prior to purchasing these I was using and tossing so many bags to get the same result. I did the math, assuming 4 quart size bags a week for 5 years, means I’ve saved $307. Can’t wait to tell my husband that one.",
        "I've had this Marinator since 2013 and have used it a couple times a month since then. Today it gave up the ghost and exploded on me (implosion is probably the correct term.) I know it was set at the right setting so I can only assume that it developed stress fractures which finally caused it to fail. It sounded like a gun going off at close range and of course caused the marinade to spray all over the kitchen. If you're going to use this unit, and I do think it does a great job for its intended purpose, you should plan on replacing it every year or so.",
        "Does anyone know if the manufacturer will replace the item? If so, I'd be willing to give it a better review. I have seen a couple of people post that their container imploded. Fortunately, mine only cracked. We use it probably once a month-ish to marinate. Had it on the right settings, and after one cycle, my wife noticed the marinade starting to bubble. It was from the crack that formed on the bottom of the container and she immediately stopped. This was purchased on Christmas Day 2017 when I received a vacuum sealer. Love using it, but looks like it doesn't really last, and could be dangerous.",
        "Do not purchase. Worked wonderfully the first couple of times. Now won't hold a seal. The gasket is fine, and will hold the seal as long as my sealer is connected to it. Once I remove the tube, even if I have the valve closed, it loses vacuum immediately. Of course Amazon referred me to FoodSaver, and FoodSaver customer support was beyond useless. Biggest Amazon regret.",
        "I’ve had one of these for years and we absolutely love it. My first one quit working after a few years but we bought another. Well tonight it imploded!! Thankfully no one was in the kitchen!! My husband was in the attic so thought maybe he dropped something down to the ground but no, my marinader was in pieces, my chicken on the counter/floor and marinade was everywhere. I don’t even know what to say as we use this weekly and love it but now I’m afraid to buy another since this could seriously hurt someone!!",
        "I made the mistake of placing the Quick Marinator in a Vacmaster210 chamber suction machine. Filled w salad, I put it in the fridge. 45 min later it exploded, very loud like a bomb, sharp plastic pieces tore thru milk and broth cartons. Beware.",
        "This is my second one of these I've owned and both have had the same issue: they won't hold a vacuum seal for more than a couple of hours (if that). At this point I'm convinced it's a design problem as the previous version of this item would hold a seal for days.",
        "Works great! It has more volume that I thought - I was able to marinate a “family pack” of chicken drumsticks (about 15pcs) in one shot. Chicken tasted great. I simply re-sealed the container with remaining, (uncooked) drumsticks in the marinade and placed it back in the refrigerator. I think that vacuum marinating & sealing also reduces the rate at which marinated, refrigerated food gets spoiled ... although I don’t have a way to measure this. Works well with my Foodsaver vacuum sealer with the “Accessory/Marinate” attachment. The bottom container is dishwasher-safe, hand-washing is recommended for the top-lid (probably because the gaskets could get damaged in a dishwasher).",
        "This product did not last. In my opinion it just wasn’t worth the purchase price. And I expected more from a food saver product.",
        "Bought last March, 17 months ago. First one lasted 5 years when I started noticing little spider cracks, so I ordered 2 more to replace it. The other night, I was marinating chicken legs, when I started hearing this loud cracking sound. I turned off the Seal a Meal, took out the chicken, and found all these cracks on the bottom of the container! Now, I don't know what the warranty is, but I do know that 17 months is a far cry from over 5 years! I'll let you know what I find out...",
        "I love that this product is so easy to use and seals the air out. It helps speed up my marinading process when I decide to spontaneously buy something to marinade for dinner. It does say to leave a generous amount of space above your food and marinade I’m guessing to extract the air out without the liquid shooting out through your vacuum hose. But that only allows you to put a minimum amount of food/marinade in at a time. I’ve used it to marinade chicken and kalbi so far, and if I’m trying to make enough for 2 people to have dinner and pack leftovers for lunch, it’s safer to have to do two separate batches in the container.",
        "If you have a vacuum sealer that can work with this attachment, BUY IT NOW!!! Take the cheapest steaks you can find and vacuum marinate them with your preferred sauce. Since it's a Vacuum Marinator, the vacuum seal separates meat fibers and lets all the marinade in to create a tender juicy piece of meat. Harvest an old tough deer? Marinate it. Cheap chuck steak? Marinate it and cut it into kabobs. Tired of dry white chicken meat? Marinate it.",
        "I use this allot for marinating meats for my wife's Asian cuisine, some dishes take up to 24hrs and I can get the same flavor in about 4hrs. Great for doing quick marinating on thin slice flank steak for stir fry usually only takes about 2 hours to fully penetrate the meat. It's also nice that I can put in not just the marinate sauce but I can include all the spices and vegetables like snap peas, green onion, shallots, ginger etc.... and enhance the complete flavor of the dish in just hours instead of overnight.",
        "Developed crack diagonally corner to corner on third use. Marinade all over refrigerator. Hopefully this one is just a dud. I really like the results. Amazon replacement was here in two days so I'm willing to give this another chance. I'll upgrade the review after a few months more of usage or this one failing.",
        "Probably a function of the sealer rather than this Marinator. But I found that the meats prepared were no better than simply rubbing seasoning into the meat and sit for a while. What I do is season, vacuum seal in a bag, then freeze until ready to use. Fantastic! I wouldn't waste my money on this type of kitchen gadget unless it were of higher quality (which means higher price.) So, if MY method is good enough. I'll use the money for the cost of this marinator and buy a couple of Ribeyes!",
        "Simply a piece of garbage that broke after being used twice. When I went to return it for replacement it said that it was past its return period. Here's what you do... If you're a food saver fan these are excellent devices, go to the BIG box retailer (you know what I'm talking about) and pick them up there for less money and a no hassle return policy.",
        "I had another one of these but after a few years, it stopped keeping the vacuum. I 86'ed it. Now I see this one again and remembered how wonderful the vacuum marinated food was.... The marinade really gets inside the meat. So, for $18.00, I'll give it another go. When you think of how many times I use it vs. the cost, I guess it comes out to 20 cents per use, which is probably less than the cost of a ziploc bag. I kinda sorta wish it was bigger though...",
        "This thing is AMAZING. So amazing we wanted two. We make fresh salsa all the time, cut jalapeños, tomatoes, onions and cilantro. Normally that would last maybe two days. In this its insanely fresh, like you just made it for at least a week. At least. It’s great for marinating of course which is why we got another one since our other one is used constantly. I don’t think ours is in the cabinet for more than a day ever and we have had it for a year at least. This is one of those buys that has made our life easier and better, it’s the little things for sure.",
        "used it 3 or 4 times and now it wont seal. very unhappy wouldnt buy it again. i would not recommend anyone else buy it either. dont waster your money like i did. Cant give any lower than one star but should be lower.",
        "I ordered the marinator to use w/ a v3240 Food saver. There are 2 marinade settings; one for the v3200 series, and one for all other Foodsaver models. I used both, the v3200 series setting did not work w/ my v3240, the other setting worked great, thus the 4 star rating on ease of use. I have both the rectangular (white base) and the square (clear base) models. They both work well.",
        "I marinate beef for jerky, and I'm always making jerky. After about the 12th time I used it, I thought there was something wrong with my FoodSaver unit because it would take a little longer than usual to vacuum, and when I turned dial to \"closed\", and removed the hose, it would just allow air back in. I never put it in the dishwasher, and I never submerged it in water (like directed). It's good for the price...I guess.",
        "Like it very much at the beginning as it looks good and seal pretty well, we use it to store food most of the time, and never wash it with dishwasher. But after half year of careful use, the container begins to crack on the bottom, and may leak air soon and can't be used to seal food anymore.",
        "We love brined/marinated pork chops and this unit does a great job of accelerating that process. I use it with an old Foodsaver Vac 5500 model sealer. Occasionally I have trouble getting it to hold a vacuum, but I think this is more an issue with the sealer than the container. I've used it several times and so far it seems durable.",
        "Loved it since the last week of January. But today my potatoes won't be as tasty. The screw seal does not hold any more. I have never put it in the dishwasher and I hand dry it all immediately. But now it won't hold a seal.",
        "Works as promised. Lid fits precisely. Nice design. Bonus: silicon seal can easily be removed for cleaning and is easy to reinsert as well. Just works.",
        "This is made of very thick plastic. I'm pretty new to the vacuum sealer. This works so well, that I overdid it. Connect the hose and press the marinate button on the food saver. It will vacuum, hold for a couple minutes, release, and repeat. this opens up the pores in the meat so it sponges up the marinade. I didn't have enough marinade to totally cover the chicken, so I flipped them and repeated the cycle. That was a mistake. The citrus in the marinade dried out thinner parts of the chicken, like if I had let is soak all night! I really look forward to trying this beef and pork, and different marinades.",
        "it's big and spacious I used it to put my leftovers in or my sushi when need be and its rally great for those purposes. I have not used it to do marinating in which I believe it was the intended purpose and I plan to get a few more due to the spacious interior. Get yourself one it's worth it.",
        "This container has been a life saver. It takes out so much of the wait time for marinating things. Just wish I had found it sooner.",
        "DO NOT BUY!!! Bottom of pan cracked on first use. Same thing happened on replacement order on very first use! Already have an old Foodsaver marinater container. It's made out of a darker clear brown plastic and is obviously a better heavier sturdier product. It is wonderful and works like a charm. I marinate for up to days and steaks just melt in your mouth... Too bad this new one is an INFERIORLY designed cheap replacement. You are missing out on what otherwise would have been a miracle worker,",
        "I've used this three times. The verdict is still out on this product. Chicken breasts marinated for about 30 minutes came off the grill juicy and quite the taste treat. The steaks I marinated for about the same amount of time really didn't impress us or our guests. They were cooked to the right temperature but there really wasn't a difference, from what we could tell, to just throwing them on the grill. We'll keep trying.",
        "This is exactly as advertised. Marinates food very quickly. My only complaint so far is that if you marinate over night, it will in my opinion over marinate..... if that's even a thing. Nice addition to food saver style machines.... and I believe it is compatible to most non food saver branded machines. Mine is a Crenova and works fine even without a dedicated marinate function that is included on some machines. Time will tell as far as build and durability go, so I didnt rate that.",
        "3rd time using it it cracked across the whole bottom just pulling it out of the fridge.",
        "This was actually a replacement for the one I already had. After 10 years of use a drop created a crack so it wouldn't hold a vacuum anymore, but that was my fault for dropping it. I use it all the time, works awesome.",
        "It is so awesome that with this product you only need to marinate your meat for only 15 minutes before cooking it. It is very easy to use.Well worth the money. Cause sometimes we forget to marinate something we plan on cooking the next day. With this it doesn't matter at all and therefore you feel like such a smarter cook.",
        "Used this to marinate chicken breasts. Usually I would marinate at least overnight. Using the exact same recipe, I used this FoodSaver marinator as instructed, placed the container in the fridge for about 15 minutes and the results were better than soaking overnight. the chicken breast literally melted in mouth after grilling like we normally do. Fantastic!",
        "Bought this for my son not understanding why he wanted it so badly. One pork roast dinner later, I now have total clarity!!",
        "Ive used this twice so far for marinating roasts. I made a roast with beef broth just to test it and then pressure cooked it. When I pulled it out, it was falling apart and very juicy. It's easy to use with the accessory hose attachment. Next I'm going to make beef jerky with it and see if it does as good a job with that as a roast. Would highly recommend it.",
        "The vacuum is what holds the lid on securely, I don’t believe it makes as big of a difference in marinade time as advertised. It would be nice if it at least could double as a Tupperware when not under vacuum but it can not",
        "I can never remember to marinate my steaks overnight so this works perfectly. There are 3 settings on the lid and two are labeled for marinating. MAKE SURE TO READ YOUR OWNERS MANUAL. If you select the wrong setting the unit can break. Some food savers will let air in and out through the cycle so the top seal needs to be set to open. I like to use a tenderizer that pokes into the steak before adding the marinade. This seems to help draw in the flavor even more. The entire process is done by the time the grill is preheated.​",
        "I love my foodsaver for freezing stuff, but this does not work better than any other container. If anything, the vacuum pulls the juices OUT of the meat so that they mingle freely with the marinade. I do not find that it works better than a gallon sized baggie.",
        "I do a lot of gourmet cooking, almost always marinate chicken, sometimes steaks, pork chops, etc. I used to have to start marinading the night before, or early in the day, to get the flavor into the meat. This really does work in a short time, although I still leave a full hour. The first time I used it, I wasn't sure if it was really vacuumed and sealed, thus I think I let some of the air out. The second time I knew better and the results were wonderful. I marinated chicken with salt brine, soy sauce, white wine vinegar, garlic, lemon pepper, thyme, rosemary and a couple fresh basil leaves. It was fabulous, meat juicy and so flavorful!",
        "I bought these for food storage in the fridge. I have bought 4 of these thing already and will probably buy a few more. Very happy customer. Update 8/30/2016: Not so happy with this product now. If you use it to store things in the fridge, eventually the pressure and cold temp will cause the bottom to crack and it will no longer hold a seal. I can store things outside the fridge no problem. I changed my rating from a 5 star to a 2 star because of this. will not purchase again.",
        "Replaced the original version when it stopped functioning and there were no replacement seals. I use it to marinate meat and chicken for Asian dishes. If you own a FoodSaver you should get one",
        "I have been eyeing this item for a while now. Finally I said I am buying it. Good decision. The marinade is sucked right into the meat. I have used this on steaks and ribs and it helps to keep them incredibly moist and flavorful. This thing is amazing!",
        "I almost never marinate anything by waiting for a long period of time anymore! The changing of vacuum and atmospheric pressure pushes the marinade deep into the chosen protein in a short period of time! I love it!",
        "This is advertised as a FoodSaver Vacuum seal dish to marinate meat. I actually use mine to keep lettuce fresh for many more days than when placed in any other container. A great bonus use for this handy container.",
        "Does a great job of marinating meat. I have 2 of these now so I can marinate large amounts of food. They hold the vacuum very well until you release it.",
        "So far this is working great. It has good suction and cuts down on marinading time. I hand wash it just to be safe but I do believe it’s dishwasher safe",
        "The check valve stopped working the second time I used it. FoodSaver support was of absolutely no value in resolving the issue. If I use it now I have to leave the vacuum hose attached.",
        "This. Is. Amazing. I have definitely put on some weight that I attribute directly to the purchase of this product. The marinate setting on our The FoodSaver V3440 Vacuum Sealer works perfectly with this, and it takes about 12 minutes to achieve amazing results. We now marinade far more often than we probably should. Also really handy for a large amount of leftovers.",
        "The hose connector pictured on box is not included. It probably expects you to buy a foodsaver vacuum just to connect it even if you have your own.",
        "I had one of these a couple years ago, and I noticed this newer version is slightly different, in a good way. Somehow it seems sturdier and seals better than the prior version. It works well. The only thing I will say is be careful when cleaning it. Somehow I managed to dislodge the tiny little \"gasket\" and it wouldn't seal. I managed to unscrew the port on the lid and get it re-seated again. It has worked on three different occasions since then.",
        "Must have for anyone with a Food Saver! Really gets the marinade in there, for meats or veggies! Just be careful when cleaning...wife lost the little check ball in the top and we had to buy another Bc I couldn’t find a replacement :/",
        "I have not yet used it, but the instructions are simple and easy to follow. I am sure that it will be handy to marinate a few steaks or chicken breast when outdoor grilling season starts again. I have a larger VacuVin marinator and have been using it for quite some time and will continue to use it when I need to marinate larger pieces or portions because the FoodSaver Marinator is very shallow and one has to allow an inch of head space between the food and the bottom of the lid. Therefore it is better suited for use with flat pieces of meat or fish.",
        "I enjoy the fresh food for day's, especially meat (refrigerated foods) etc., just make sure food is cooled off prior to sealing. Otherwise it will crack.",
        "My last one cracked while using a foodsaver vacuum sealer and their attachment hose. It was less than a year old and probably used 6-8 times. I hope this one lasts longer. I'll probably stop the vacuum early?",
        "We use this regularly and it really does seem to help marinade foods faster. Easy to use and the base is dishwasher safe. The lid is handwash only and somewhat of a pain to wash due to taking off the edge gasket as well as getting the turning knob on the top clean. But well worth the investment overall.",
        "Good seal, works well. Wish it was bigger. A small tri tip steak was a tight fit. Just a suggestion that works well for me. Put meat and marinate in a ziplock bag and then a paper towel on top of the bag so the bag doesn't block the vent.",
        "Food Savor for the WIN !!! love this marinate container, it's amazing! Dont submerge in water, wash lighting and you wont have any issues.",
        "I have a hard time making my husband happy for dinner. He is a picky eater. Used the marinator with a simple weber packet marinade on chicken. The flavor was throughout the chicken and my husband LOVED it. Even went back to eat an extra chicken breast.",
        "I use this all the time with my FoodSaver FM5200 to marinade chicken and steaks. I love the ease of use and truly enjoying the better tasting food.",
        "Just used it for the first time. Excellent product. Cannot wait to marinate meat for grilling next!",
        "It's large, it works well ... it's fun to watch food marinate (and so quickly). Makes cooking more complicated meals a little more within reach on a weekday. We also use it simply as a storage container as the deli containers are a little too small. Not sure how well it will hold up - have some concerns ... but we're quite happy with it for now.",
        "Great accessory for the food sealer. Cuts marinading time to 15+ minutes. I cook on the grill or smoker 4+ times a week. Now, all I have to do with most items is begin my marinading process shortly before cooking.",
        "These would be great, if the bottom of the container didn't crack. I've had two of these, and within 1 week one of them imploded (the bowl cracked into two pieces). The other one developed serious cracks in the same place (on the bottom) a day later. I recommend not pulling the maximum vacuum to possibly avoid this issue. But, one would assume that these would be designed to handle the level of vacuum the Foodsaver vacuum pump is capable of- but apparently that is not the case. If they would build them stronger I would buy them again.",
        "I used this product to marinate Salmon and to marinate Imported Australian Lamb Loin Chops. The Food Saver Marinator did exactly what the ad said. It infused the marinade in both the Salmon and in a separate meal it infused the Lamb easily and within a few hours before grilling. I used to do this overnight to get a similar quality taste in the meats. Now I can do the marinade and expect great tasting food a few hours before grilling instead of overnight.",
        "Great for marinating meat and vegetables. Is medium size. You can't marinate already skewered meat as some of the pictures show unless they are small skewers. I do use it frequently.",
        "This thing is great. It marinates meat like a dream with the food processor. It's awesome to save plastic and it does such a great job.",
        "I had an original foodsaver vacuum marinator and loved it but it imploded after about 3 years of use. I bought this unit and it also imploded however only after about 4 uses. Plastic debris was found across the room and I would not use any container for marinating like this again for obvious safety reasons and absolutely do not recommend this container.",
        "After a few months heard a bang in fridge and come to find out it shattered. Luckly I had it in drawer. I really loved this when it worked. Might have been the hot food under pressure and going into fridge.",
        "Tried to purchase at local stores, none carried. Really great on steaks. Saves over night in frig. Seasoned my steaks in 30 minutes. Love this product and highly recommend",
        "I use this to marinate my steaks. I use a meat tenderizer to poke a bunch of holes in the steak. What I do is use some tin foil to make a little boat around the steak so it can be completely covered in marinade. Then I use this with the vacuum sealer and watch the air bubbles come out and the marinade go it when the sealer does its cycle.",
        "I was skeptical but we have pulled a number of steaks out of the freezer and they have been the best marinated steaks I have had in a long time. I didn't believe it at first but the marinated seemed to be pulled through the meats.",
        "This item is great for marinating. Saves money on using plastic, and allows more liquid to be added to the meat. Easy to clean as well. Works with the Foodsaver machine",
        "I just tried the Fresh Save marinator. It worked so quickly and cleanly.",
        "This unit became in operable after 4 uses. The white knob that activates the unit became defective. Spoke with the company and they do not have a replacement knob. The unit is now deemed useless. The option I was given was to purchase a new unit. Very disappointed with the product and customer support. I would look for another marinator.",
        "Love having this in my kitchen arsenal, have used it several times.",
        "This was so easy to use I thought at first I was doing something wrong that there must be something else I had to do, but I just marinated lamb, closed the lid, concected the tube (not included with this) to the unit then the top of this marinator and turned on my unit. after it was done I put the lamb in the oven to cook. My husband said it was by far the best lamb he ever has had! Thanks! ;) It helped make me look good. I have so many idea's of things to marinate now I can't wait! :0)",
        "I love this thing. Works great. Seems solid. I've read that people have occurrences of it imploding... Til that happens I plan on having a quite close relationship with this thing. Most of my relationships implode though so I'll let you know of that happens.",
        "Great unit is great for freezing soups or sauces use it frequently",
        "Absolutely love it! Been making much better jerky since I started using it.",
        "We just bought the latest Foodsaver model and I saw a port for this marinator and read that it cut marinating time down from hours to minutes. I've tried it twice and it does work. Many times I'm starting a recipe only to find the meat needs marinating for an hour to overnight. I think this works by creating a vacuum which pushes and circulates the marinade through the meat. I recommend buying it and using it with the Foodsaver.",
        "I use this to marinate chicken. It makes short work on that process. Instead of over night, it just takes a couple of hours. Works for me.",
        "Nothing like a good marinated steak. And now we can have them in about a third of the normal marinating wait time. And it really seems to soak up the flavour.",
        "Bought this in 2015 It Imploded on me tonight. I cannot leave a bad review I ordered another one I really love this thing Hopeing this one is thicker or better made but probably not could even be worse if someone makes one better I would really love to have one that last more than 5 years.",
        "We have used this twice since getting it. We marinaded chicken and pork. It worked well both times. It comes with directions on how to use it with different food saver machines. Our food saver is about 5 years old and it still worked just fine. I would recommend this product to anyone who marinades often.",
        "It’s already not functioning. Used about 5 times and the vacuum knob on the top quit working. Contacted FoodSaver and they pretty much blew me off. Liked it while it worked",
        "Marinated sirloin steaks in this and they tasted great! This works good and is easy to clean so I'll be using this method all the time now.",
        "Great product love using it for chicken and pork! Finally winter is gone so can't wait to get even more use out of it. Gonna try it with veggies and fish/seafood. Does exactly what it's supposed to, wish the lid was dishwasher safe, but I get it, and it's easy enough to wipe down.",
        "Make your steaks better with this! I absolutely lovethis thing. Works as it says it does. I cook with a convection oven and use this to marinade steaks, pork chops, chicken, etc. and I believe it truly helps with flavor and keeps the meat more moist.",
        "Easy to use. I quickly marinated some meat for jerky.",
        "Very good for marinade, don't put lid in dishwasher, you may lose silicone seal and unit will not hold vacuum",
        "This works great for marinading. It was a little hard to use with my food saver though and the nob on the lid came off right away. I was able to screw it back on and it still works.",
        "I really like the easy way it closes . The leaver is a big help for arthritic hands.",
        "My son in law is a self titled grill master and he LOVES this marinade box. Infuses flavor and juices amazingly well. He marinated steak and chicken for fajitas the other night. Best I have ever had!!!!",
        "I've only used it twice, so it may not be as robustly designed as necessary, but so far it is awesome. Easy to use, works as advertised. It's a procrastinator's dream, too! In the time it takes to make the salad and set the table, the meat is ready to cook. Delish! If it breaks, I'll buy another one. It's NOT made of super durable throw-at-your-hubby plastic, so treat it accordingly and I'll bet it'll last. If it doesn't, I'll do an updated review.",
        "This canister does not hold a vacuum after the evacuation shuts down. The instructions are difficult to read and understand. I would not recommend purchasing this canister.",
        "I like it. Not necessarily happy at the way my food saver has to be disassembled to use the accessory line to make this work, but that's my food saver and not this marinator. It does seal. It does as described. I like it. And I have been smoking and grilling for almost 40 years, so I know marinades."
    ]
}