{
    "entity": "Kitchen Trash Cans",
    "text": [
        "So, I've been eyeing one of these for a while, we'd been using brown paper bags for recylcing along with a cheapo Rubbermaid plastic garbage can. I'm very glad I got this one, it's been a week or so and it's been perfect. It did come with a very slight dent, but it's a garbage can... I'd rather just keep it. Taking the buckets out is easy, and I like that I can continue to use normal tall kitchen bags with this. The step function is smooth, no issues or noises there (don't forget to take the packing foam out from beneath the buckets, that will make noise if you don't).",
        "I love this dual garbage can. One side recycle the other side garbage. Goes beautifully in my new kitchen. I'm now very organized. Always in its place. I love how it slowly closes. Called soft close. Love it. I went from a battery operated motion can to this one. I was tired of the battery operated one not closing when it was suppose to. I love this manual one. It will last a lot longer I'm sure of that!",
        "Got tired of the cheap office type of trash can we had where the lids would always break. This has been great and my only complaint is that I should had bought the larger one. I haven't an issue with smell or anything.",
        "We had touchless garbage can that had motion lid. My husband hated it. Then it got broken when someone else didn't know how to get the lid to open apparently. So.we replaced with this one. No smells so far and we've had it a few months. Good quality looking can.",
        "I’ve had this trash can for approx. 1 month. So far, so good. It looks good in my kitchen. The cans are easy to remove from the bin. The foot peddles and lids work without issue.",
        "I originally ordered the iTouchless 16 Gallon Dual Step Trash Can & Recycle Bin and was so disappointed when I first received it because when you stepped on the left pedal, the left lid stuck in the open position. I contacted Amazon who immediately sent out a replacement receptacle. I got the new bin today and it is exactly what I hoped for. I have a micro apartment in NYC and it fits perfectly in the space I had envisioned for it. See attached photo. I am happy it all worked out.",
        "I have had this trash can for a month now and it’s awesome. No digs or dents and the deodorizer works as advertised, check my dog out, he doesn’t even realize there’s goodies starring him in the face, just waiting to be devoured! Having an open canister makes the “dump & go” process an ease.",
        "Very well constructed and the deodorizer filters work wonderfully. I wanted a trash can without a lid because the lids always get stuff on them and keeping them clean is very time consuming. But without a lid you have more odors in your kitchen. This trash can solved both problems and even saves me time because the locking lid keeps the trash bag from falling down everytime and the larger size makes it where I am not running to the trash bin outside as often. Highly highly recommend this one to anyone wanting to simplify their life a little more and have a superior product for less money.",
        "Was looking for an open top for our recyclables, but didn't want blue plastic. This looks very nice next to regular trash can. The manufacturers write up seems to imply that it is more for industrial use, but I would definitely recommend for home use, too.",
        "I purchased the 16 gallon size as a black Friday deal. I like the height of this can. I still use 13 gallon white kitchen bags. I like how you can fill the whole bag since the height of the can doesn't allow for it to drag on the bottom of the can. It came nicely boxed and not damaged, as other reviews have stated.",
        "I was looking for a dual trash can that would not take up a lot of space but would be big enough to not change bags frequently and this one is perfect. It is easy to clean, easy to use and having both trash and recycling right next to each other is very convenient. If I had a use for another one, I would definitely by this again.",
        "First of all, the trash cans look great. 2nd, the deodorizers actually work - we've had food trash left in the cans for a week at this point and no bad smell! And one of the best things for me is that the trash bags stay well in the can and don't slip in. If anyone has ever had to deal with that then you know how annoying that can be. Thanks to Itouchless, that's not a problem!",
        "This can arrived dented. That wasn’t a huge deal to me. Then, the lid to one side quit working within months of getting it. I bought a new part which didn’t fix it. I contacted the seller with no response. We’ve propped the broken side open for over a year now, which is gross. I requested a refund but never got a response. Overall more dissatisfied with this purchase than any of my Amazon purchases in the past (which says a lot!)",
        "I really loved and in-tune to my new \"iTouchless 16 Gallon Dual Step Stainless Steel Trash Can & Recycle\". Its a great addition to my kitchen gadgets. It is really easy to clean and what's make it so ideal is the dual step for each lid (department)",
        "This is a good product for the price. It fits our space and our needs. No failure on their part but the unit is fairly lightweight and can dent easily. I use a Stainless cleaner spray to keep it looking nice, but I gave it 4 stars as it takes some maneuvering to get the full plastic bags out of the bins.",
        "This trash can is exactly as advertised. It came wrapped and packaged well, but there was a minor ding in it that doesn't bother me. The lids open and shut smoothly. Other reviewers complain that the lid flies open and hits the cabinet, but you can just not slam your foot down. It looks nice in our kitchen and I'm not afraid to have it prominently displayed. No complaints so far. I'm sure that a $250 trash can would be nicer, but this is a perfect in-between option. Still feels sturdy, not cheap, well made. I would recommend it!",
        "the trash can has worked well. it does have wide openings to fit plates and other kitchen trash. occassionally when changing the bag the filter container comes unclipped and you have to clip it back but that is not easy (just have to make sure it does not get in with the trash and accidentally thrown away). it is sturdy and looks good where we have placed it. this is the 2nd one we have bought since the first worked well and they are placed side by side at our kitchen in the breakroom at work",
        "I was hesitant to purchase because it is an open top trashcan. We all know trash can smell horrible but you cannot smell a thing! Ours is in a pretty high traffic area of the dinning-room/kitchen, I even tested it out the first few days by putting really smelly things in and there is no odor whatsoever! I am happy I took the chance and got this trashcan! The size is amazing (16 gallons) and it’s easy to pull trash out, even a heavy load.",
        "My kitchen looks organized and clean. I love my trash can.",
        "So far this is exactly what I was looking for!",
        "These trashcans are wonderful in every way. We chose the open top because we were tired of cleaning yukky tops where trash was disposed. The easy access makes it easy to use, easy to remove the bag and easy to clean when necessary. Because of the lid design, the trash bag is held firmly in place and tedices the numbers of times the inside of the can has to be cleaned. These are good-looking and a great value.",
        "Good looking, silent lid, easy to remove containers. I am very pleased with the unit. It did arrive with a dent in one side, which fortunately is on a side that makes it less noticeable where I have it situated.",
        "This waste can works as you would expect. It's solid and well made so the doors drop firmly into place and keep a tight control on odors. The plastic liners are easy to keep clean because there are drain holes and a steel handle across the top. Also, this takes standard bags that I can get at Costco, so I'm not stuck paying for the \"simple human\" bags every few months.",
        "When I order this item, I was a little nervous because of people's comments of receiving item with dents/damage. Well, there were not dents or damages to it. I received faster than expected. better than pictured. fits perfectly in our kitchen",
        "I thought it had a lid since it said touch less but it is so tall we love it anyway. The dog's cannot reach it and it holds more trash.",
        "Who would have thought I would be writing a review about a ‘garbage can’! Lol I have to say this can was a great buy! I love that it looks great in my kitchen; doesn’t look like cheap trash. Lol. It’s the perfect slim size for a kitchen that doesn’t have a good area to put a big can. The can has two charcoal holders, can holds a lot of trash for my big family & the full bags slide easily out to throw away. It’s amazing!!",
        "This product is what I was truly looking for. It is beautiful in appearance has a wide mouth opening for easy disposal and is stainless steel for easy cleaning. Friends who see it ask me what brand is it and where did I get it? Great product!",
        "With the rimless top and bottom vent It's super easy to pull out full bags. I love the open-top. I hate waving my hand to try and get the lid to open like my last one.",
        "After a few months in a commercial building's ladies room, this can looks great. No dents, rust, visible scratches. I haven't replaced the deodorizer, but I can see how it could be useful if it were used in a kitchen. Came packaged well with no issues. Good experience.",
        "We purchased two of these for a training conference room. They have worked great so far with little complaint. They look good and have performed without issue. What I didn't notice when we purchased was the handy carrying handle on the backside. This has was a very convenient surprise! Overall we would purchase these again if we had more need for this large of a wastebasket.",
        "I wanted a trash can that I could have out in my kitchen that didn't look horrible, but I also wanted one with an open top. I hate trash cans that have a lid of any kind because they tend to get yucky from being touched all the time. This little guy met both requirements. I keep it on the far side of my island and it is hardly noticeable. I haven't smelled anything from the trash can so far, so I assume the deodorizing is effective. The only assembly required was putting the deodorizing packets in their compartments in the trash can.",
        "Got these for our new church’s restrooms. Classy and easy to change trash bags, light, and best price in the market!",
        "Awesome trash and recycling can. Quite close. Be sure to get stickers to identify trash and recyclables.",
        "The iTouchless is a fantastic trash can. I have bought them for years, both for myself and my family and friends. I have had or bought more than 8 of them. However, for the first time with my last iTouchless purchase, the can did not work. I tried all kinds of ways to get it to work but it wouldn't. I almost didn't order a new one but my history with this trash can has really been stellar, so I did order this one and I am glad I did. it works brilliantly and I highly recommend anyone purchase these trash cans. It makes life so much easier!",
        "Best trash can for restaurants bathrooms Bought 3 of them",
        "Really nice trash can that I will use at home; one for recycling and one for trash. I would have given 5 stars, but the lid on one of my trash cans arrived scratched up. I had to replace it. The quality of the lid is not as good as the can itself. I would still recommend buying, though.",
        "We ordered two of these for our brand new restaurant. We have the oval editions. They are excellent quality and come packaged very well. The Stainless Steel is very high quality and the overall build exceeded expectations. We especially like the round open top as it makes for easy disposal of hand towels. The deodorizer compartments are a nice feature as is the Fingerprint-proof stainless steel finish. The lids lifts off easily and the air vents make for effortless bag removal. The carry handles are a very useful touch and make picking up the cans a breeze. Great product!",
        "Replaced two separate cans. Wish it would have come with precise fit bags. Overall happy with quality and function. Quiet close. Adds style to the kitchen. One side is recycling and the other is used for trash. Love, love, love it!",
        "I purchased this trash can in November for a Christmas gift which we plan on opening our present early as some of the family were leaving town to visit with family. They were wanting a sensor trash can which I made the mistake of associating touchless with sensor equipped. Now I cannot return it because the returning dated is dated December 1st. I will order from Amazon the sensor trash as the gift they want. Now I am stuck with a trash can that I do not need. Can you not make available to me in allowing me to return the Touchless Trash Can?",
        "This trash can is a Godsend. Absolutely love it. Simple. Easy to use. No parts that are vulnerable to breaking. Only change I would make is for the top cover to be metal like the base. Thanks itouchless!",
        "Compact yet still holds as much as the old cans. Easy to empty the trash and recycled bin. Easy to open hands free, no odor when lid is closed. Outside cleans easily and looks great.",
        "Save your time and look elsewhere, especially at this price point. While unboxing we noticed black plastic shards. The black plastic trim at the bottom right hand side was shattered. I'm not sure what the root cause really is, but I feel it's possibly some combination of cheap materials, poor packaging, problematic product design, etc. Given the price I would have expected better. And now everyone lost time because we have to follow the return process.",
        "I don’t usually write reviews but I felt like this trashcan gets a bad rap and I want to share my experience. It arrived in perfect condition! No bangs or scratches or cracks. I’ve only used it for a few days but I like it. The bins are a little small but I don’t mind that. I live in an apartment where they take our trash several times a week so it’s not an issue for me.",
        "This trashcan gives a touch of luxe to my kitchen. I love how slowly the lid falls after opening it with the foot pedal. Creates a much better trash disposal experience than my former cheap, plastic, white trashcan. Highly recommend!",
        "Nice looking, has been working well so far. Does seem to dent easily. We have one small one on the side that doesn't really show on that side. Like the ventilation hole near the bottom to let the air out when you put the bag in.",
        "Love it!! Dog can’t reach the trash anymore, YAY!! Also, we have town trash bags and they fit perfectly! The charcoal filters didn’t last though, must have come loose and ended up getting thrown away.",
        "This is a great garbage can! I bought this 5 years ago and it’s still working great! I lost the adapter to just plug it in so I use batteries and have only replaced them 3 times in 5 years.",
        "We love these trash cans. Very sturdy and they look nice and clean. No batteries to worry about switching out. Makes it easy to recycle in one can and the other for waste. I would definitely recommend!",
        "This is a great trash can. I was concerned that the trash would smell since there is an open top, but with the trash can deodorizer filters it does not smell at all. I would recommend if this to anyone looking for a big trash can that is stylish.",
        "This is a solid, well-built, attractive, and very functional garbage and recycling container. I have zero complaints. I’m still shocked at how much this type of thing apparently costs, but this was the most affordable one I could find—and the quality is very high. Definitely no need to spend more on a different product.",
        "Nice addition to kitchen. Clean, easy to remove trash, love the separate compartments (probably not made for a family larger than 3 - size wise), bags can fall down if you don't put in right but it's pretty simple.",
        "I recieved my trash can yesterday and I love it. Fits perfectly in my kitchen and it's very sturdy just what I need for my family of 6. I will definitely buy a 2nd one.",
        "I never write reviews but I have to say that this was a terrible mistake. First the item packaging arrived destroy but once I was able to get it out of the box it seemed fine. This product is extremely uncomfortable it slams when you open the compartment and the bags a very hard to put in. I regret buying this trash can.",
        "From someone who bought this almost a year ago, this is a piece of junk and not worth the money. One of the removable bins has broken and is nearly impossible to remove from the trash can. One of the pressure valves that slowly closes the lid broke on its own and now only slams shut. Save yourself time and money and don’t buy this piece of trash.",
        "We love this hands free garbage/recycle can! It is also cat proof if you have a crazy cat like ours! Item is as described. Thanks!",
        "It’s very nice looking and fits well. It doesn’t look cheap",
        "Looks great in building café area and keeps smells down with the built-in deodorizer areas.",
        "Just received our new iTouchless Trash Can. Very impressed with the sturdiness and operation of the lids. This was a perfect solution for a space problem that we were experiencing. Great product?",
        "I was so excited and couldn't wait to receive this product . but to my surprise it has 2 huge dents . I am unable to return the product because my son never checked the product before throwing away the box. This is unacceptable $154.00+ for a damaged product .. .. I believe this company is selling SCRATCH AND DENT products and without the customer's knowledge... ... If the dents were not present the item would be exactly what i was looking for to place in my small kitchen .. the product is very sleek and stainless steel seems to be easy to clean and polish. Will never order from them again ...",
        "This is great for big families. I don’t have to worry about my little ones touching the lid. The size is great. We can go a whole day before throwing out the trash as opposed to throwing it out twice a day (family of six). And there are no smells!!",
        "The can looks very nice. The pedals seem sturdy and the top doesn’t slam down. The can came with slight dents on the top and the side despite being well packed. It’s too much trouble to return it for the small dents, but it’s dissapointing to spend this much money on a can with dents on day one. The real disappointment is how hard it is to set the garbage bags properly. There is a hole to use to pull the bag through, but not a easy way to put the bag over the top and close the can.",
        "My husband and I like the sleek stylish look. It REALLY IS iTOUCHLESS!!! It is accessible and user friendly with our daily trash and recycle use. Maneuvering the independent inserts in and out have been great! Smooth soft close works very nice. Each insert does have holes. We are not allowed to recycle with waste bags in our community. We covered each lower side hole of the recycle bin with Black Gorilla Duct Tape over the inside and outside hole. We rinse our recycle. We wanted to add additional protection from potential leaks. Overall this a fantastic space saver and very well made. for the price!!",
        "Awful, every bad review I read before purchasing this was true with my order. The trash can arrived with a huge dent in the side (even though the box it arrived in was in perfect condition), a crack in the top black plastic, and the lid made an AWFUL slow squeaking noise every time it closed. It was was much smaller than I had expected and way over priced for the quality. Ended up buying a different one from BedBathand Beyond for half the cost which works perfectly instead.",
        "I wish there were trash bags specifically for these cans. Have to get tall trash can bags, and they are just too big as those are for wider trash cans. Luckily, they were smart enough to add a notch in the bins for keeping the trash bags tight. There are handles you can use, but they just got in the way so I removed them entirely. Also, I had to get some decals for the lid so people know which side is recycling. You would think the blue bin would give it away, but nope. Very easy to clean and look nice.",
        "This product has been wonderful so far. I love the dual compartments, and they are easy to clean and remove! The touchless open/close mechanism is gentle and slow. Great product!",
        "Love the fact that it has two different compartments: one for trash and the other for recycling. I added stickers to distinguish the two. It’s also a decent size so it’d probably fit in any style kitchen.",
        "This is a great trash can! With our old one we were taking the garbage out all the time and the can took up too much space. With this can being tall and slim it saves on space and holds a lot of garbage because it's 16 gallons. The fit and finish are good and it fits perfectly in the space that we have. This is a definite \"must buy\"!",
        "The itouchless deodorize trash can This trash can is huge, I love it, just got my kitchen re-done. It’s easy to use, fingerprint resistant. The bonus is its deodorize, so it doesn’t smell at all. Its perfect for the kitchen and it holds so much more than a standard 16gal trash can.",
        "I thought this would have a top to it, so I was disappointed at first. Then I noticed it comes with charcoal filters to hide smells. I have had it 3 weeks now and am quite impressed! No smells and not a single ant has entered or has been on the can! Glad I bought this!",
        "I was nervous about buying this product because other similar cans that were more expensive had reviews that mentioned dents and ineffective foot pedals. This product is AWESOME. The foot pedals are great, and the bin came looking spotless, carefully packed with foam. There is still definitely some secret technique I have to learn for lining the bin with a bag, but it is otherwise exactly what I wanted. Worth the money for my newfound convenience. Not sure yet what the long-term maintenance will look like.",
        "Came very dented. Two big dents in the back. Really like the design and size. I really needed this for an open house at my office. Therefore it’s very difficult for me to send it back and have it replaced. Couldn’t figure out a way to get a hold of the seller to see if they could do something to make it right. I really feel that with this price, it should be at a higher quality. Only received today so I will update my review based on if I hear from the seller.",
        "Disappointing durability. I purchased this trash receptacle a few months ago to use exclusively for recycling. Today, after emptying the blue bi into my local recycling dumpster, it slipped out of my hand and I dropped it. It fell about two feet, empty, and landed upright on its bottom. There is now a large crack in it. For its high cost, I expect the construction to be a little more rugged and durable. The handles on the two interior bins are also inconveniently placed, especially when they are full.",
        "This is the perfect trash can. I love the open top, no messy lid to bother with. It cleans easily and lid fits snugly.",
        "Didn’t know trashcans can be so expensive but it does make my kitchen looks much nicer. I thought the cans would be too small but I like it. It makes me more conscious of how often it is emptied and the dual cans makes it even easier to recycle. Only thing is after a few weeks there is already a small dent near the bottle",
        "Using these at the office and they are stylish without being a hassle. Very nice.",
        "Loving this garbage can because I can just throw things away without getting a “top” dirty or having to open it. Hoping the charcoal filters keep the smell out and so far so good. I got the 13 gallon oval can. It’s a step up from my plastic white can, for sure. Worth the money so far.",
        "Very good dual garbage/recycling makes it easier to keep your kitchen organized. The foot pedal works great and operates smoothly. The stainless has a nice shine and only time will tell how well it holds up after a few years. It has two long narrow bins on each side, if you use up alot of garbage this might be cumbersome to constantly change. It is a bit pricey for just a can to hold garbage but if it lasts for a long time it will be worth the money.",
        "its what i wanted, but have two thoughts - the handle to remove them makes it hard to get the bag out, it grabs the stuff in the bag. I also didn't realize that the divided can made each side smaller than I had expected. we go through a lot of bags. Not sure there is any motion detection - I have to step on the pedal to open it. there is not sensor to open if that what the MOTION\" is supposed to be - \"I\" am the only motion,",
        "Loved this trash! So much easier to separate recyclable from compostable. The size is also perfect, I fits my itches very well. It is also easy to clean since the garbage cans are removable.",
        "Very well packed and a nice trash can. Just what I needed. There was another one that was less expensive by another manufacturer, but I didn't want to chance it. Sometimes it's not worth the hassle. This had a nice Styrofoam buffer around it, arrived in perfect condition.",
        "If I have done this review before I would’ve said that this product was great, very easy to use, big enough to not have to change the bag every single day, but not to big to get a to heavy bag. This is not a motion detection trash can. 8 months down the road and the step To open the gate got broken. Not harsh used just regular use. Now, what do I do with this?? Edited to add: I contacted customer service and they replace the complete unit free of charge, only paying the delivery ($20), I was within the warranty period though",
        "I consolidated for trash and recycling. This works and does not take up the space as two cans. I look for convenience and having both handy in my kitchen works.",
        "Overall I do like this trash can. It has worked out really well in the space AND was lucky enough to catch it on sale! It's great to have both recycle and trash in the same can. However, it did come with a small dent and box showed no sign of damage. Fortunately, the dent is in a spot where no one will see it because of where I have it sitting, so decided to keep it.",
        "I purchased two of these. One for regular trash and one for recycling. They are sturdy and a great size. I definitely would recommend. They were packaged so well with molded styrofoam that I didn’t have any issues with dents like other posters had. I’m very happy with their performance. So far even with the open top, there is no offensive smells coming from them. I would definitely recommend",
        "This item came in dented and I could barely take the inner cans out because it was pressed underleath the flap and had broken pieces inside.",
        "It’s a two lid trash can. Received the first one dented, started the replacement process, second one arrived dented up worse than the first. Still haven’t decided if I’m going to give them a third shot, it’s a pain in the ass having to repack the damn thing and drive it to the UPS Store. Take the bin handles out, install the trash bags, then replace the bin handles by poking them through the bag. Problem solved. As to the dented body...don’t know what to say.",
        "Very sturdy, soft close. Looks amazing. You won't be disappointed!",
        "iTouchless is the great use of space, stays clean and easy to replace bags.",
        "This is a really nice product. It fits into a rectangular space quite nicely. It is easy to clean, but the cans themselves are smaller, so we need to take out the recycling more often.",
        "I love this Trash Can. It is more convenient in the space I have yet larger than my old can. It's exactly as nice looking as the photo on line. And I tested the finger prints. It's the bomb. I love it!",
        "It fits in the space we have for it and has more room to hold paper towels than a small trash can.",
        "Nice looking trash can, has dual sides for landfill and recycling. Tall trash bags work the best. Foot operated lid, slow closing.",
        "The product does have nice clean lines. It will class up our kitchen!",
        "Love the 2 compartments. They are large enough to last a day or 2 in a busy household with 5 people. No need to buy special bags, standard 13 gallon bags are not a perfect fit but work well enough if you hold them tight around the removable containers as you drop them in. Easy to clean. The lid closes flush/recessed with the trim so my dog can't get it open. The charcoal filter in the lid is a nice feature and seems to help with odor. I didn't use the filter on the recycling side, I saved it as a replacement for the trash side.",
        "I like the convenience of a touches trash can in my kitchen, but am truly impressed with the odor control. It as been in the 90's in northeastern Ohio recently and my kitchen has no air conditioning. My trash can currently contains packaging from chicken, pork chops, ground beef, and assorted other food trash. No offensive smells what so ever! I highly recommend this trash can for its odor control feature alone, not to mention its size and good looks.",
        "This was a great trash can, until it broke. We’ve had it for a little under a year and it’s already broken. The foot peddle on the right side does not lift the lid anymore. Our last trash can was much less expensive and lasted for almost ten years!",
        "I cannot attest to the durability just yet but the overall look and feel of the can is great. The lid fits tight which is great. It holds the bag well and looks great. The dirtiest part of the garbage can is always the lid and I love that this can takes that away. It's nice to be able to drop stuff in when your hands are filthy. Mine was shipped fast, had no dents or dings and looks great. I would definitely recommend this to anyone looking for a new can.",
        "I like it better than my first one. This one has a black lid that doesn’t show fingerprints... I found myself constantly using spray cleaners to remove an smudges and fingerprints. This one is also virtually silent when the lid opens and closes... Unlike my first one... Holds the same amount of trash, has a slender design and takes up less space",
        "I really love this can. It's sturdy, pretty and doesn't have a lid or peddle which I can't stand. The bag fits snug under the lid. The only reason I didn't rate it 5 stars is I don't like the idea that the deodorizers are very expensive to replace. Is this where the company makes its money. The can was around $80. You're supposed to change the two deodorizers taht snap into the lid, every few months and they're like $20 something for 3. It's proprietary to say the least because nothing else on line fits in the holders. I need to figure out another way to do this.",
        "Love the hands free! Nice to have it closed off yet when I'm cooking I don't have to get my hands dirty by opening it."
    ]
}