{
    "entity": "Kitchen Trash Cans",
    "text": [
        "WE were looking for something sturdy and stainless to use in our bathroom as a laundry hamper but did not want to spend $200-$400 for a stainless laundry hamper. We found this and it works great! We just took our the blue bin inside, added a cotton canvas laundry bag to the insight and we now have an elegant addition to our bathroom at a fraction of the cost.",
        "This is a big trash can! I like it very much as it keeps out odors and there is no peddal to press. My husband though, does not like the fact that ad the can fills up close to the top, the lid really wont swing open so he can cram more garbage in there. That means it needs to be emptied!",
        "You’ll never need another kitchen trash can. Best money you’ll ever spend.",
        "ts hard to get anything inside it fills up too quick can't put empty gallon of milk in it",
        "I bought 5 of these trash cans to be used in common areas in the lobby of my hotel. One came in damaged with the ding in the lid that is the size of a quarter. My real disappointment is trying to keep them clean. The finish does not clean well, always spotty and discolored. There are many spots that look like rust around the bottom of two of them that I can not remove. The rust spots happened within 2 weeks. They are sturdy enough and look contemporary. We clean constantly in my hotel and they just don't look clean.",
        "Top of the can gets hung up on the liner and gets dirty.",
        "Very sturdy, good looking can,=. Simplehuman is pricey, otherwise 5 stars",
        "Bought this can to replace a similar one that we had for so many years that I forgot it might be under warranty. On well the new can has clean lines, looks great, and is easy to clean. Swing-top make it real convenient to dispose things in the can quickly and quiety.",
        "A Little High priced, but is built very good. I bought it for my daughter for Christmas, and it looks very nice in her kitchen. I like the idea that it has a liner.",
        "I absolutely love my garbage can. It looks more like a piece of Furniture.I will definitely purchase again",
        "Love my trash can, but I wish the top would allow for you to fit more trash in the can.",
        "Good quality can but you can only fill it 3/4 before the lid will hit all your garbage, so you take out nearly half empty bags. With the replacement bags being horribly expensive, it's totally not worth it. We bought a cheap one and quit using this because it was so annoying.",
        "Nice quality, but the revolving lid is an awful design. We bought one for our office. It looks nice, but the lid limits how full it can be, and it's always getting soiled with food debris. Skip this.",
        "I love this trashcan so much I purchased one for my brother’s new house. The swivel top keeps smells at bay and looks great on display in my stainless steel kitchen",
        "I need it a nice garbage can for my son coffee shop, so I decided to buy this trash can, I thought it was really expensive but the reviews were good. I received it in a big heavy box and I never open it until the coffee shop was ready for the big opening ( 1 month after received it ), for my surprise the trash can was damage, Full of dents , it was to complicated to returned ( to heavy) . My recommendation for buyers make sure you check the product as soon as arrives and for the manufacturers you have to make sure your product its well packaged .",
        "It's a good thing it's easy to clean because the lid will get all kinds of nasty on it.",
        "I ordered 14 of these trash cans last year. The overall look and quality is outstanding. The lid closes every time and the liner make removing bags a snap. Order 2 more this week and need another 16 for another location. I did receive one that was damaged. Due to the size of the boxes I feel it was the carriers fault. They are double boxed in a heavy box. I would recommend for home or office.",
        "Pricey, but stunning looking trash cans and nicely designed. The inside of the lids are convex, as they have a weight to make sure they flip back into the right position, so this can be an issue if the bin gets too full. Other than that, I don't have any trouble removing the top, cleaning is easy and and the finish is great.",
        "Just bought our second can of this type. The first has held up perfectly for over 13 years. This new one arrived with the swing top lid assembled incorrectly but called SimpleHuman's customer service and they shipped a brand new lid ASAP. We are very happy with their customer service and with the product!",
        "We wanted a trash can with a swing top lid. We had difficulty finding any that fit with our decor. The stainless steel looks institutional, but at least it isn't plastic. The can works well. It is easy to keep clean. This is recommended until someone comes up with a quality product that doesn't look so institutional.",
        "Pricey but excellent. would love those specific garbage bags to be a bit cheaper by the manufacture but will work with regular bags as well.",
        "Not only are the trash can great they are very well made and sturdy. Plus they were shipped to Alaska in only a few days!!! I will be back to buy more . Thanks",
        "Bought these for our foyers at work and they look beautiful!!",
        "Excellent. Is pretty, holds enough, and I like the swing top.",
        "Nice large trash can for the kitchen . And keeps oders in the can and not in the kitchen great deal",
        "Great trashcan with little ones around! Very sturdy and easy to put trash into.",
        "I purchased two of these, one for trash the other for recyclables. I found them to be just what I needed. A little bit hard to keep clean looking, but when they are they look sharp.",
        "We have just replaced this less than a year after buying. Swinging lid broke off a few months in. Trash bag is hard to get out even when moderately full.",
        "Great trash can. 12 gallon bags fit . . . however they fill up quick and the swinging lid hits garbage quicker. Siimple human offers a 15 gallon bag (you get 3 with this can) - they allow you to use the entire capacity of the can. We like it a lot - nice and solid. Bought one on amazon (it was damaged), returned it and bought it from simplehuman.com.",
        "Not the most practical of garbages, but it is stylish and once you get in the habit of emptying before it overflows, it performs great. In addition, Simplehuman have amazing customer service."
    ]
}