{
    "entity": "Belt Sanders",
    "text": [
        "The sander Amazon sent me was used! Not a lot of use, but it has a belt on it, and it’s been used to sand wood. Whoever used it didn’t clean the dust off the casing. It may be a great sander, but I paid for new! Amazon Customer service seems to be unavailable....",
        "That's a quote from my woodworker BF after using this for a month. When his old belt sander fell off the table and bent the rollers, it was panic time as he needs a belt sander every single day. We considered a battery powered unit but opted for the plug in for more power and reliability. He says the cord is extra long so not a problem in the shop. Bottom line this is highly recommended tool from a high quality Japanese company, do not hesitate.",
        "This sander is amazing. No vibration of note, quite enough I use it without earplugs, sanding belts stay on even when if you sand side-to-side or put more pressure on one side than another, the motor is strong, unit is fairly light-weight, and it works really fast. If I have any gripe it's that the included belt didn't last very long, but you can buy sandpaper from anyone you want.",
        "When I first fired it up, the sanding belt busted. The key is to keep the variable speed on low, and adjust the tracking adjustment accordingly. After going through two torn belts, I finally was able to keep the belt on track, but noticed that after just very little use, the sanding belt was off track again. For an item this expensive, and coming from Makita, I guess I expected too much. I have a $65.00 craftsman belt sander that does a much better in keeping the sanding belt aligned. If you happen to have the same experience I did, I'd recommend you return, and look for a better product...I wish I did.",
        "This is not a commercial product but it is not a cheap tool either. Its well made and represents the superior quality of tools Makita is known for. It's relatively quiet for a belt sander. Solid but maneuverable. It has a nice long power cord. The sander operates smoothly. I love the self adjusting belt. Ergonomically it's okay maybe not the very best but still good. I expect to use this sander for years and years. If I find an issue I will update the review.",
        "Hey, don't waste your money on cheap tools. This one cost a little outside my comfort range, but it will last me decades. At my age, that means until I'm long gone. This is easy to hold, the belt tracks very well on the motor rollers and you can get really close to the edge of your sanding project with this tool. The dust bag catches enough of the debris to make it worthwhile. The variable speed is a nice touch. I would highly recommend this sander. Do your research and compare. I think you will agree with me that this is one fantastic tool for your workbench or work site.",
        "This thing is heavy and will get the job done quick. Use a light touch. If you let this sander get away from you, it will gobble up your wood and take your arm off with it. But it's nice to get away from the plastic-bodied sanders that are light as a feather and wear out quickly. If you want fast, thorough sanding, get this. If you want fast, light sanding, this guy is a bit much for the job.",
        "I'm a bosch guy. When I can't have bosch, I go with makita. I know it's probably dumb to have tool allegiance but I do. This is a great sander, probably one of the best time saving tool purchases I've ever bought. Took it out of the box and ran it about 2 hours straight without a hiccup. The only reason I'm leaving 4 stars instead of 5 is due to the lack of a plastic tool storage box that I've come to expect from to name tools. Papa likes to tuck his tools in after a hard day's work. The eff Makita?",
        "The only complaint we have about this item is that it was not sold as used but clearly the sander had been used. the belt on it had some wear and there was fine sawdust on the belt and inside the bottom of the sander when it was taken out of the box. The instructions and all parts were there. It was in the original box and the box had been taped for shipping. It should have been sold as \"used\" in good condition.",
        "I have used this sander on extreme hard wood \"Osage Orange\" This sander is the best I have ever owned. Not only does it adjust the belt on center it also has variable speed and the dust collector works terrific. The long electric cord gives plenty of room to work. I would highly recommend this unit over all the others. r",
        "This sander is a Beast! Shame I wasted my money on cheap crap like Craftsman most of my life. This sander is so quite and performs like no belt sander I’ve ever used. The variable speed is amazing for the serious wood worker. I do slab table and bar tops and this sander just became my new best friend. Seriously 5 stars on this one. And great pricing to boot.",
        "Quieter lighter and holds the belts far better than my old brand X industrial unit that had been dropped too many times. Quieter too. But the dust collector can get in the way some times in tight areas and has come off a couple times. I haven't had it long enough or used it enough to speak to durability but with my experience with other Makita products I am hoping for a very long life.",
        "What a great sander. My father dropped off his 1970s craftsman sander to use but it was such a pain changing belts that I ended up ordering this one. It has plenty of power and really does a great job. Used it to pull poly off a bowling aly slab. Made short work of the sanding part of the project.",
        "its decent, not too heavy or light, reasonably quiet, very long cord which is a bonus!, paper tracks fine with no constant adjustments - the only negative thing i can say is the motor exhaust ( not the dust exhaust- which i plugged up ) blows towards the operator which is very annoying, but easily resolved with a small piece of cardboard and a piece of duct tape. good speed control settings, the dust bag is pretty worthless as with any model/maker all in all good value for the money",
        "I had to sand some decking and I had a cheap belt sander. It didn't have much power and the belt was always going out of adjustment. I wanted something more heavy duty. This thing is a tank. While you don't have to push down as it is heavy enough if you do it doesn't bog. The BEST thing is that belts automatically stay centered. Put the sanding belt on and you don't have to adjust or think about it. It sands right to the edge as well.",
        "Bought this to sand down some reclaimed bowling alley wood (1950’s heart maple). Works like a champ. Easy to use. Paper stays on track. My only wish is that it came with a hard case for storage; it just came in a cardboard box. Other than that, I have no complaints.",
        "Replaced a DeWalt that is older than I like to think about. This is spectacularly better than my admittedly ancient previous sander. I wanted a 3x21 for weight and maneuverability, and because I have a ton of belts in that size. Power is excellent, it has a realistically sized cord (long), and the dust collection is amazing. The dust bag is easy to empty. Really no complaints.",
        "I use my tool frequently and hard and must say this is a well thought out design. Much better than the Porter Cable 352. The Makita has a center mounted motor that allows for better balance and the belt tracks perfectly. The top side of the sander is flat so you can lay it on its back and do some hand sanding of smaller pieces. Dust collection works really well. And it's made in Japan. Fantastic tool.",
        "I love this sander. It is great quality and is exactly what I hoped. I've done many projects already. Like all belt sanders, you need to make sure the belt is adjusted correctly. I also place it down on a table upside down so I can put small pieces of wood. A wonderful product from Makita.",
        "Great tool. Very easy to change out sandpaper rolls. Not too heavy (I used it to sand some ceiling beams). Easy to maintain (because I was holding it upside down I got the cord caught in the rollers at one point. Had to partially dismantle the machine to get it out but I was successful). Not much more to say other than I am very happy with this tool.",
        "Excellent tool. Bought it for a specific project and now I'm thinking why didn't I get one sooner. The variable speed is great and provide improved control. The tool is the proper weight so that you can let the tool do the work and you can focus on the task.",
        "Appears to be well made. Easy to use and powerful. Love the long cord. Dust collection bag doesn’t work very well. Need to hook it up to a vacuum if using indoors. Tracks nicely. Head and shoulders above my B&D.",
        "Easy to use it low because this tool has a lot of power I will need to practice a lot more! The three stars is because I need more practice. I would say this is one of the best models to buy and it will last for many years in my home work shop! Don't forget to clamp down your work!",
        "Used it all day today on a deck. Good product. It did clog up bad once so all the dust was dumping on the deck. The bag was empty. Needed my air compressor to blow out and get working again. Other than that, it seems to be a workhorse so far.",
        "This belt sander has plenty of power , is smooth and seems to be well made. The cord is very long which comes in handy. It tracks well and the belt stays in place. It’s a little pricey but well worth the money",
        "I replaced an older Makita of the same size that cut itself apart due to unnoticed poor tracking (it was manual). The old one was a good unit and supplied years of use but the new unit is much more heavily built and the auto tracking works perfectly. Another feature I enjoy is the speed control. You can slow it to a crawl whereas the old unit even at the slowest setting was spinning rather fast. This gives much better material removal control.",
        "My old belt sander finally went away. I chose this because it has automatic belt centering. I was not prepared for how quiet this sander is. The vacuum bag actually picks up dust--surprise! Will use the big flat top to place it upside down for hand-held sanding, but there is no built in mechanism to anchor it upside down. The grips will work left or right handed. Has a two prong plug on a generously long cord. Happy.",
        "Unit has done the job so far. The vacuum to the bag is nothing to brag about but I never have found them to work well on any unit. Belts are an easy on/off which is great. Nice long cord to work around the project. It is a heavy unit which works for a belt sander.",
        "I love this sander! It feels solid and is reminiscent of professional grade tools sold years ago! The belt tracks perfectly and is easy to adjust. It comes with a bag and can be used with a vacuum. I threw away the cheap belt sander I had and will never go back.",
        "I don’t usually write reviews but I was so impressed with this sander I felt obligated. It’s exactly what I’ve been looking for. I bought a craftsman and porter cable just to have them break. This Makita is miles beyond them in quality. Just the fact it has like an 10ft cord compared to a 4ft on a cheep brand says a lot. If your debating, stop. I’m not a computer or generated review. I don’t know how anybody could be dissatisfied with this sander in any way. Buy it!",
        "Works great so far. The only down fall is it gets a bit heavy if using for long periods of time or trying to use with 1 hand while holding your work piece with the other hand.",
        "I bought a Rockwell 3x24 sander from Menards. What a waste of money. Would not keep track and would only use about 1\" of the belt to sand. Rockwell wanted me to drive 100 miles round trip to \"have it looked at.\" Menards would not take it back nor would Rockwell let me send it to them. Threw it in the trash, did the research and bought the 3x21 Makita. Best buy and great sander. Gets close to corners and sides. Good dust collection-not perfect-but good. Easy to clean and change belts. Keeps on track. You can't go wrong here.",
        "I love the Makita 9903. I spent a bit more money on this than i'd planned because i'd read that the belt doesn't slip (like on EVERY belt sander i've ever used). It's true. I used this to sand a table i built last weekend. Went through a lot of belts and didn't have one slip. It's a really nice machine - you get what you pay for. I wanted to spend $150 on a belt sander but i'll be thanking myself the rest of my life for spending the extra $ not to have to deal with any issues. This thing is just solid.",
        "Well built. Reasonable noise level and low vibration. Comfortable to handle. The dust bag collection is excellent and easy to remove the dust. The bag does not have zipper. Nice design easy to open and clean. Belt is easy to replace and adjust. Well worth the money.",
        "sands amazingly this thing has so much power on the full speed you will have trouble holding it in place it feels like it was made back in the 80s and 90s when they cared about the product not making it cheaper. Very durable feeling plastic is thick and picks up most the dust",
        "Sander arrived in perfect condition. The belt that comes with the sander should go straight into the garbage can! Once I put a good belt on, it was very simple to adjust the tracking, and it has held that adjustment with no issues so far. The dust bag is OK, but it can get in the way on some projects. The long cord is terrific, but be careful not to let it get in the way while you're sanding. Noise level is pretty decent. The sander performs very well, with no tendency to gouge the workpiece. All in all, I'm totally pleased so far.",
        "I own a million tools. This one is the best 3 inch sander ever I used. Be happy with your purchase. No case and only one load of paper. I bought the Makita soft bag too. Perfect combo.",
        "Great tool for what it is. One of the advantages over this design vs the competition is the flat top. You can rest it on the bench with the belt up and gingerly use it hands free. Brilliant, if not intentioned.",
        "Best belt sander I ever had even though its only 3 inch. The machine is heavy which adds to its efficiency.",
        "My husband used this sander for a new deck he attachd to the house. He said it was a good buy, did a great job and was a dependable tool.",
        "Great sander fits the hand perfectly and works great. Not to heavy and easy to control.Used with the proper grit belts It has all the power necessary for the projects I do.",
        "Fresh out of the box, it made short work of a job that might have taken hours of effort using a hand-held rotary sander. Still pretty new but so far, it looks to be a good addition for my shop.",
        "Very impressed overall with this sander. After reading many reviews on other sanders, I decided to go with model. Very powerful and easy handling. Dust collecting bag works well but I like the fact that my shopvac hooks right up to it...perfect! I always believe you get what you pay for, and in this case it was worth it.",
        "Would have been 5 stars but stopped working after one week. Amazon got replacement to me next day. So far replacement is working fine. Amazon gets 5 starts for customer service!",
        "Just got it today. I borrowed a friend's $100 Rigid belt sander before buying this and my first use of this was a significantly better experience. Im pretty happy i spent the extra money on this Makita. Should I find things I dislike, I'll update this review but so far, so good.",
        "Great tool. I've made a base for it (see you tube) and use it primarily as a shaper. So the belt is always up or horizontal. It's a bit too aggressive for me when I hold it by the handle. But that's an indication of my lack of woodworking skill, not of the tool's quality. The belt tracking system is flawless. I did recommend it to a friend who does use it as intended. Handle up, belt down.",
        "Still in the honeymoon stage but the new Makita Sander is all i'd hoped for.",
        "Bought this to replace a 20 year old craftsman sander that stopped working . My goal was to find a sander that had power, but didn’t weigh a lot. So far, it was done a good job",
        "About half of the time I use a belt sander downside up in the bench vise. Most belt sanders are not made for a vise so they are little use to me. This sander works wonderfully in the bench vise and even allows the use of the dust bag when clamped. It is much quieter than my old sander but it is still quite noisy. It has plenty of power and does not overheat when on for a while. I rarely have to adjust the tracking and it comes with a 16 foot cord that is much longer than normal.",
        "This is the third 3\" belt sander I've owned and it is by far the best. The 9903 is fairly light and the handles allow good control. It is indeed very quiet considering the power. I was very pleased at the 16' power cord. Belt changes are not a problem. And boy does this thing suck - I mean excellent dust collection. Sanding belt tracking is good and easy to adjust. This is a very nice sander. I wish all of my purchased tools did what they were supposed to do.",
        "Great belt sander! I was a little worried paying the price for it considering it was about $100 more than other sanders. But it was worth it, its heavy duty for sure. I have sanded a 1,400 square foot deck and about 800 square foot of concrete that had carpet adhesive on it and i haven't had any problems at all. Dust collection on this sander is great. I have a home improvement business and have used this tool alot since I purchased it. I would recommend this tool to anybody looking for a good quality tool.",
        "After searching for various belt sanders on the Webb, I chose the Makita 9903. Using it was relatively easy, on hands and knees, but with 3M belts, the job (900 ft2) was not difficult. The sander worked very well, has good weight, and did not hardly slow up at all with lots of pressure over knots and irregularities in the wood. Long cord is overrated, ext. chords needed anyway. But the sand bag is well designed, large enough, and easy to empty and reinstall. I don't think there is a better belt sander available at this time..7/15/10 It would be nice if there was a case for it included though.",
        "Don't waste your time with Harbor Freight stuff when it comes to a sander. Other brands are SUPER loud and they sort of wander around because they don't weigh anything. This tool will be able to be handed down to your Grandkids. You can feel comfortable stepping up to the plate and paying the difference in price and KNOW you got the best.",
        "I choose this belt sander as I was looking for one to replace a sander that broke and is no longer made. My new sander had to be constructed so that is could be set on its back to be used for sanding small items. This Mikita belt sander can be used on it's back and on the side, which makes it convenient for sanding small items. It is a little heavy for one-handed sanding (holding the machine with one hand) but it can be done for short periods of time. The sander has plenty of power and the dust collection system works well. I have used several different belts and the tracking has been excellent each time.",
        "I bought this sander about a month ago and am very pleased with it. I bought the Dewalt about three years ago and am throwing it away to use the Makita. Belt tracks smoothly, dust collection is best I've ever seen on a belt sander. It's well balanced, lighter than the DeWalt and a great value for the price. The DeWalt didn't pick up dust well, belt wouldn't track right and dust collection bag kept falling off. I'm staying with Makita from now on.",
        "This is a quality sander does not bog down even with 24 grit paper and heavy pressure Dust collector works as well as can be expected Collects at least 85% of the dust Auto- belt tracking works great after initial adjustment",
        "This particular sander is a champ! Just try to wear one out! Well balanced, terrific belt tracking, quiet, tough, powerful, great dust porting that can be connected to a vac, and incredible durability. Doesn't get any better for most uses.",
        "Still the best belt sander to date and I have played with them all,easy to use ,easy to find belts for and can run all day everyday for years.,work won't kill this belter.",
        "Great belt sander, 1000% better than the POS Dewalt I had previously. This one doesn't eat belts, easy to adjust the tracking, and has plenty of power to run even very coarse belts like 24 grit. And as an added bonus the dust collection/dust bag actually works very well, probably catches 95% or better of the dust.",
        "Was a little heavy for my job but cut my sanding down by half on my deck",
        "Love it, doesn’t dig in. Super easy to control. I’ve recommended this to many people. Great belt sander",
        "This is my first belt sander and I bought it because I needed to refinish some walnut paneling. It makes stripping old finishes a breeze! I've even used it to edge plane some rough cut cherry face frame stock with good success (using a Klingspor planer belt). Changing belts is easy, and the auto-tracking mechanism works well. I also find the speed control to be really useful. Like others I find the dust port to be on the wrong side of the tool, and it has been difficult trying to find an adapter to my vaccum that works well.",
        "Very well built and offers precise control. Surprising for a belt sander. The speed control allows you to be in charge. Flat sides allow me to clamp it on its side and make a sanding station out of it. I plan to make a nice sanding station that has a nice work support table and mounting mechanism for the sander.",
        "I run a small professional woodworking shop and have owned many belt sanders. I've had mixed results over the years. But I love this machine. While it isn't cheap, it does present great value. It's powerful, well balanced, and has good dust control, even when using the supplied bag. Overall, a nice machine.",
        "This thing is a beast - very little plastic anywhere and seems overbuilt. Should last for years.",
        "Having tried 2 refurbished Porter Cable sanders, both of which were returned as the belt tracking did not work and the belts worked their way off the sander in seconds, I was happy to buy this new Makita. It tracks perfectly, is much quieter and the dust bag placement works well. This is a nice tool that does not require downward pressure to work . . . just the weight of the tool allows material to be removed.",
        "Expensive but worth the extra money. Installing new belts is beyond easy. I have used it for 3 projects with 0’issues.’",
        "Best sander ever, we use these in our glass shop daily and they hold up very well, very little dust.",
        "Super powerful, purchased to redo my deck. Worked like a champ",
        "had an old craftsman for many years and it finally gave up the ghost while refinishing an old deck. this sander is very powerful, well made and easy to use. belt changes are easier and controlling the belt is much better. less mess with bag and the metal housing should last a long time!",
        "This is a powerful sander, quieter than most. Well built, nice long cord.",
        "Bought this sander 1 year ago to back up my Porter-Cable 352vs (I have since grown so tired of repairing the Porter-Cable that the last time it needed repair I just threw it away). It runs so quietly for a belt sander that the first time I used it I thought the speed control was set on low (it was on high). It's well balanced, has plenty of power, and the dust bag actually collects a lot of dust, a huge plus when I have to scribe cabinets inside a customers house. Also, the shape of the sander makes it easy to clamp to a workbench for sanding small items, an impossibility with the Porter-Cable.",
        "Makita Makes good tools, I haven't had any problems with any of there tools yet and this one is no exception. I have had this one for a over a year now and it works great. I am a contractor so it gets used regularly.",
        "I bought this for my dad to replace his ancient belt sander with its constantly drifting belt. He hasn't had any complaints about it so far and it has been extensively used since its purchase. Update: 11/2018. With my dad's woodworking projects and our home remodeling, this belt sander has been used A LOT. No problems with it since its purchase. Worth every penny.",
        "This machine is a robust heavy duty hand held sander. The dust catcher really works. It is heavy but it is well made also. Good machine!",
        "Excellent as expected. Have completed three projects already. It’s lighter than the 24” tool by 5 lbs (10lbs vs 15lbs).",
        "I used the Makita 9903 to sand down 2 loft beds that I built and it worked just fine. Very easy to use freehand or clamped down to be used as table sander. Changing the belt sandpaper is a snap. Adjusting the belt tracker is easy and once set, it stayed without drifting off. Variable speed is simple to use and effective. The release on the saw dust collection bag is not a zipper but a slide device which works nicely.",
        "This tool is awesome. If you need to sand a large flat wood surface this is the only tool you should use. It will get the job done in a fraction of the time of a smaller hand sander. It is not a precision device and should not be used on or around trim or molding. Only downside is it is very powerful and can be a little physically demanding to use. I used it for about four hours and was very sore in my arm muscles the next day. Overall this is an awesome power tool. Highly recommended.",
        "Had to replace my Craftsman sander of twenty plus years and find this one at least as good and probably better! At my age it will probably last me for the duration. Well build and the automatic tracking is fabulous. Much quieter than my departed sander",
        "It's quiet, smooth, and well-built. Runs like a champ. No comparison to the Craftsman I had before, and then couldn't get replacement parts for. Plenty of power and a great tool to have in the shop.",
        "I have found the makitas are very good at dust collection. This is no exception. It also tracks perfectly. Hope it lasts",
        "So, I got mine and the first thing I said to myself is Amazon sent a used sander. I called Amazon and they immediately said they would send a return label and overnight me a new one. (Awesome Customer Service) Then, while I was on hold, I looked closer. Makita ships it with a belt, and what actually happens is the belt rubs on the cardboard making the belt look worn and makes dust that is all over the tool. Before you say it Is used, look inside the dust collection unit and bag, I bet you won't find dust indicating a used tool. Awesome tool, awesome customer service!",
        "Works great. Has just enough weight to feel sturdy, but still reasonably easy to use.",
        "This belt sander is awesome. Belt tracks very good plenty of power. Pay attention or it'll sand a hole right through your project before you can say shoot! Only thing I didn't like 5 stars worth is the dust bag. But I brought this to rough sand glue ups and dirty rough sawn boards before I run them through my planner. So the dust bag doesn't bother me for that.",
        "Love that it has variable speed...my last sander was just all out full speed",
        "This Makita sander is a real work horse , tracks fine, belt changing a cinch, with only one negative comment. Makita you folks really need to relocate the dust bag ! At first I liked the location, and it felt pretty comfortable . But when I use the sander its like an extension of my hand, in other words I'm all over the place and the dust bag keeps falling off! Better yet instead of relocating the bag find a better way to secure it that's all thanks",
        "Used this item to finish-sand some wide and uneven chestnut floor boards. Did great with a wide variety of grit paper. Easy to adjust tracking. I do wish there was a better way to attach to a vacuum to help collect dust but the bag did work well enough. When I kill this one...(I have more floors to do) I will get another one.",
        "I got this because I needed to refinish a gazebo. The old finish was peeling off and I wasn't going to get it done with my finishing sander. This unit is solid, powerful and easy to use. Another good Makita power tool.",
        "No problems at all with this sander. It's a little heavy, but I guess that's to be expected. There was no problem with drift, which seems to be the main problem with belt sanders.",
        "Likes to gouge the wood. Not sure how it gets the good reviews. Not at all what I used to expect of Makita, but I am lowering my expectations.",
        "Seems to be solidly built. I'm hoping that it lasts as long as my last 3X21 Makita sander - a little over 35 years of commercial use!",
        "My only complaint about this belt sander is that the dust outlet doesn't fit a standard hose; but rather is exactly the same size as the hose (I have to pipe the two together).",
        "After owning a Black and Decker sander, the MAKITA sander was a welcomed relief. It sands quickly and evenly throughout any project. I can also clamp it in a vise for stationary work and the extra long cord is handy for larger projects. The belt STAYS tracked once its set. This a a great sander!",
        "I read lots of helpful reviews on line before ordering this model and have not been disappointed in this purchase. My experienced neighbor likes mine better than his. The weight is pretty good and the sandpaper stays on track, just like others said. I'm using my sander to refinish old pine patio furniture. So much better than trying to do it by hand. I recommend it.",
        "Bought this belt sander to sand top rail on my deck and eventually resurface my kitchen table. It made fairly quick work of smoothing and rounding edges of deck rail. Dust bag works well and it's somewhat heavy, which to me indicates a heavy duty well made product. Home Depot has 3x21 replacement belts in various grits. Another quality Makita tool.",
        "Nice quality but not as powerful as my old sander",
        "Great Sander, powerful and removes wood fast; rather heavy but all belt sanders are heavy tools. The attached bag works well and has to be emptied often. If used on fast speed sometimes it tips and will gouge the wood irreparably so one must be careful to keep it flat at all times, no matter the speed. I used it on a huge teak swim platform and did a good job; With any other sander I would still be there sanding !! not a happy thought in freezing weather !!",
        "Best sander I've every owned. Powerful, so be cautious when sanding wood with a 50 Grit belt. It is a bit heavy for one-handed sanding (on a ladder), but otherwise just great!",
        "Very pleased with the construction and performance so far. Purchased after my porter cable gave it up like so many others I read about on here. The only thing I would change is I would like the rear handle to tilt up a little more to improve the balance while operating. Will just take a little getting used to like any other new tool.",
        "Stays on track, easy to install the belt, great variable speed, 10’ cord.very high quality compared to porter cable."
    ]
}