{
    "entity": "Belt Sanders",
    "text": [
        "We purchased a few of these for our rental company to sell. I never had a chance to try one myself though I am very familiar with power tool quality. Eventually we put one out into rental service just for the acid test. If you want to see equipment abuse and misuse, work for a rental company. It was surprisingly successful. This is not a professional wood working sander but a handy homeowner tool for many jobs. Treat it for what it is and its' worth every penny. I've since used it myself and was please what it could do.",
        "I am using this sander to remove built up paint on my Deck that my pressure washer would not remove. I had some really tough areas that this sander is doing a great job on. It has plenty of power for the job. It does tend to slow down a bit when worked too hard generating too much heat but this was on some really tough baked on paint I was removing. I paused it for short periods when it showed signs of slowing. I combined this with coceca aluminum oxide sanding belts which fit this sander perfectly and are really tough belts.",
        "We love this sander; it is light weight and innovative with several handle positions and the ability to flip the guard up and sand in-between rails and right up to the edge of a wall. Gone are the days of extreme muscle fatigue and needing an orbital sander to finish the tight spots! My handyman was totally impressed with it (when his gave out and I let him use mine to finish the job).",
        "I've had good experiences with Black & Decker power tools over the last several years, so when I finally decided to purchase a belt sander - I went with this model. The one really nice design feature this belt sander has compared to almost all comparable belt sanders is the nifty small front belt pulley. This feature makes it ideal for getting into small crevices - something that most other belt sanders are just not able to do. This sander seems pretty sturdy and can run for quite some time before it seems to be getting even close to overheating the motor. Generally, the weight and other ergonomics, relative to the price - makes this a pretty safe purchase.",
        "I was hoping that I would like this 3\" wide B&D belt sander, needing to sand square railing uprights for a new coat of paint,, but I should have heeded all the reports / reviews of others. I have owned belt sanders for 30 years, and I know how to adjust / true the tracking for best sanding results. My experience with this sander is that I can adjust the tracking successfully, but within one or two passes, it has \"wandered\" again, and must be adjusted again. This was unacceptable and I am returning for refund.",
        "I was very disappointed with this sander. I was trying to sand plywood and the removal rate was really slow even with heavy duty 40 grit belts. The feed requires constant adjustment. After about 5 minutes of use the adjustment for the front handle snapped off the first time I tried to adjust it.",
        "This is a cheap tool. It does remove material, but requires constant adjustments. Also, does not have a vacuum port! Huge flaw-makes a massive mess. Not worth it, unless you buy cheap like I did and rarely use.",
        "My 20 year old 21\" belt sander wore out and after a bit of searching settled on the B&D Dragster. What a bargain this sander is. I was very impressed with the power and ease of control and eas of material removal. The narrow front end wheels allowed for more precise control then Ive ever had. It comes with a low grit belt so I could use it out of the box. The belt release mechanism was easy to use",
        "bought this to sand my deck and it worked fantastic. The one thing you need to do is occasionally tip it sideway while running and shake out any build up from the rear once I figured this out it allowed me to extend the duration of my sanding belts well beyond what I was experiencing before.",
        "I was worried about buying such a cheap sander after reading the reviews about the belt going off track. I had 0 problems with mine. I pulled it out of the box and used it to prep the wood railings of my porch for repainting. Only issue might be that i had more dust on me than in the dust bag, but i was outdoors and i expected that already.",
        "I confirm the other bad reviews for this product. I own many Black and Decker power tools, drills. saws, weed eaters never had an issue with the brand. I used this sander for all of 5 seconds before the belt started creeping off. Tried another belt to confirm and yes this sander will not hold a belt while sanding or just running without being in contact with a surface. Pretty much garbage in 5 seconds or less. My advice spend a little more for something that might work.",
        "great product and easy to use -- highly recommend. I don't know what it is -- I was raised thinking black and decker was for folks who didn't really know tools. But I keep finding myself returning other tools and buying their brand -- and being so much happier.",
        "I live in a 110 year old house with hardwood floors. The floor beams have sunk in areas so the floor is not flat and, thus, the flat sander we rented did not work. This worked really well, although it is hard on the knees. Did the job really nicely. It is a bit too powerful for me to use though so my handyman did most of the sanding. Make sure to buy extra belts as they don't last long.",
        "This is a workhorse for an entry level sander. Unless you need an industrial model this sander will move a lot of wood and do a great job. Belts are very reasonable price and you will get a lot of work done fast. The front nose design allows you to get up in a corner closer than any other design. My first one of these was stolen, and I couldn't do without one. I love this sander!",
        "This sander has thrown the belt off several times, the adjustment knob on it is maxed to just keep it on while sanding. It also is limited to right hand coverage of areas being sanded....cannot get to left hand cornered needs. I've had it awhile before using and just now finding all this out. Had I used it immediately I would request a return/refund.",
        "Belts slip off constantly. Looked online for solutions. One solution involved drilling with a dremel tool. Very aggravating. Wish it just worked. Called B & D phone support. On hold for 45 minutes. Finally gave up and wrote a bad review instead.",
        "Had it only 10 months. The bearing went bad which allowed the armature to go bad. Took it to get fixed & they are not honoring the 2 year warranty by manufacturer!! Black & decker has not helped. I keep getting put on hold for hours with no avail. Finally got ahold of them. Got no where so buying a new one from their competitor.",
        "I don't know how I have gone all these years of home maintenance without a belt sander. But I had to replace a board in the middle of our kitchen floor that got severely warped from a leak in a supply line, other boards around it were slightly raised as well. This sander not only took down the high spots, but completely level to the rest of the surrounding area.",
        "Sand paper kept sliding off.No matter how I adjust the tracking.",
        "For occasional use, this is the belt sander you should buy. Changing belts was easy, mostly made of plastic, and I hate the color but the price is right. My only recommendation is buy quality sanding belts, to avoid belt tracking issues. I personally have not had issues but cheap belts might make this thing a pain. If you are stickler for better quality; then look else where. This is a basic unit, it will get the job done but don't expect a heavy duty tool that will stand up to years of hard use at this price.",
        "the dragster is designed with a thin roller on the front of the unit. this roller helps to get in to corners and other tight spaces with ease. my first unit lasted me more than 5 years of hard use before i burnt up the motor. i went right out and purchased a new one just like the old one. i recommend this product.",
        "It is light and arrived fast. However, it is difficult to use as the 21 inch paper roll keeps moving off the rollers by about 1.5 inches. You have to keep stopping every 5 minutes to readjust.",
        "Easily the best belt sander I've ever used. I was skeptical of this small unit with its tiny-diameter front roller. I've always used larger 4x24 industrial sanders with full-diameter wheels. This unit has lots of power and has my support. Much easier to maneuver than a much bigger, heavier sander.",
        "I've had a black and decker 3x18 sander for years, so when my craftsman 3x21 sander died it was a no brainer and i ordered a black and decker to replace it. These sanders are light weight and reliable and at at great price.",
        "My first sander failed after just a few minutes use. I arranged for a replacement and it works like a charm. Exactly as I expected from a Black and Decker product. I like the design, features and quality of the outcome.",
        "This sander is a total piece of junk! No matter what you do or how many times you adjust the track the sandpaper slips. It will look like you have it perfect but as soon as you start sanding the paper moves. I did not expect the best sander for $60 but I did expect it to at least be functional.",
        "A great product, does the job that I want, I got the return 5 times of What I paid for so excellent machine in the first use, amazing. Very professional vendor, Thanks.",
        "Finally replaced my old sander that I purchased in 1979 with this one. This is a lot lighter and easier to change the sanding belts. Works good. Happy with it.",
        "I bought to hold me over until the brushhes for my commercial sander arrived. Has worked great! This is the second one I bought (two different locations) to be used while parts for my main sander arrived. I would buy it AGAIN (third if necessary)",
        "This was the second unit I've purchased. Adjustable handle makes for comfortable ease of use. Narrow nose and lift up flap is great for getting in tight spaces.",
        "I have a deck which is too uneven to finish with a floor sander. We used mainly 80 grit belts and ran the Dragster for 5 hours yesterday. We set the belt drift once at the beginning and never needed to again. I am online now to purchase a second one for further renovation so that we can have two guys sanding at once. The dust bag filled several times and kept the dust down to a dull roar.",
        "The sander ran really hot. The release lever felt like it might break before it released when I changed belts. It worked ok but was not the upgrade from my old belt sander that I hoped for.",
        "Much better than my old black & decker that was 35 plus years ago. The flip up front guard is awesome to get into tight places.",
        "This is my second one, the other I had for more than 35 years. I could probably still fix the other one too and I know it would work and be a great backup!!!! It's the best one out there, the front lid lifts up to reach tight places which makes this one the greatest!!!!",
        "My old one broke down and I bought a new one here because they no longer offer this at Home Depot. I like how you can get in tight spots in the front of this sander.",
        "Bought and right out of the box it wouldn’t even turn on, I needed the item to build some counter tops and I wasn’t even able to use it and I wasn’t able to return it. Stay away from this sander.",
        "It's fine by me....I got no real problem with the sander feels good in your hands you have to be careful with it though it will sand down on some wood now...it burned out on me after only a few hours of sanding so it only gets one star",
        "Reworking Kitchen floor and purchased this to be able to reach under our kitchen counters. Requires constant adjustment of belt but works well. Not a high end commercial unit but great for general use by handyman. If floor boards run parallel along cabinets, not helpful. But if they are perpendicular and end under the cabinets, it works great. Wish I had found this sooner. Good value for the price.",
        "This is my first time using a rotating sander and I found this VERY easy to use. The sandpaper that comes with this is coarse so bear that in mind.",
        "What complete garbage. Bought it but couldn’t use it for a while due to medical condition. Used it today, and it literally quit working 30 minutes into the job. I had reservations about buying a Black & Decker; looks like they were well founded.",
        "Very loud and belt tracking needs constant adjustment. Only good for light work as it is a bit underpowered.",
        "Spring load for the belt failed. It should have lasted longer, I was only sanding the floors of the decks",
        "Pretty good quality and a good price for it. The size isn't too bad, it's pretty easy to hold and change the belt, but I wouldn't say it's a great high quality item. The dust bag can be a pain to get on/off sometimes and the zipper on it to empty seems almost unnecessary because it opens just as far as the hole to fill the bag. But for a cheap little sander this works well.",
        "good quality, easy to use, used for sanding deck seats, edges and under seats. works like a charm",
        "This is a good belt sander for the price. You can get more powerful ones, but you'll spend way more. This one works great for most applications.",
        "In order for the sandpaper belt to track, I had to tighten the adjustment to the max... very thigh!",
        "The sander has a great grip and therefore easy to control. The belt stays in place through rough sanding. That was a problem with my old belt sander.",
        "This is just what I needed as a home owner that takes in a few projects a year. Worked great and is easy to use.",
        "Liked tge \"dragster\" profile for close sanding. Priced the same Craftsman and Stanley models (all made by Stanley) and the B&D was 40% less expensive.",
        "Worked extremely well for the project I purchased it for. Great belt sander for the price. I have only used it once as of now so we'll see if it stands the test of time.",
        "Would give 5 stars but I have to constantly adjust paper with the small knob. Worked great on the two projects I used it on. Pine and black walnut projects.",
        "Great price for a useful product. Please note, I don't use this product personally, but the person who does likes it and asked to keep it when the project is over. We haven't experienced any of the belt complaints others have, but from my understanding the belts being eaten is too much pressure on the sander. The person who uses this has sanding experience, and that may be why they don't have this problem. Delivery was prompt. Packaging had no problems.",
        "Bought this for a small table sanding project, and the belt immediately starts to slip off the rollers. There’s no way to adjust the tension to fix this problem, and I tried a belt I purchased from Lowe’s and had the same problem. Completely unusable piece of junk.",
        "This thing is a beast. We remodeled our kitchen, started with a rotary sander and it wasn't cutting it. Got this and the job went by 10 times faster.",
        "The rear roller came off the first time I used it. I pulled this out of its box today to finally get onto a dresser project. I sanded one side of the dresser when the rear roller came right off. I put it back on, but each time it comes off again immediately. Had to do the rest by hand and will throw this in the trash.",
        "Only got a couple days out of it of sanding down some wood poles at my house. Great idea with the narrow front and the ability to sand flush is actually a huge time saver. Just wish it would have lasted more then a couple days.",
        "I like the feel of the unit and it handles real professional. I use it on my deck for preparing for painting.",
        "Bought this sander for edging an oak floor I am refinishing. The small front roller allows sanding to within 1/4\". The sander feels solid. Changing belts is easy and the tracking adjustment works well. Sanding belts hold up well even with the small nose roller",
        "Bought the sander to finish a table top for a dining room table. After about 6 hours use over the course of 2 weeks it caught on fire and burned out. I was using 50-80 grit paper and cleaning the paper regularly. Maybe I had a lemon, but it was very disappointing.",
        "Finally a sander I can handle, I love it, I would diffently recommend to all my family and friends",
        "Very Disappointed. I purchased this as a Christmas gift for my husband. He's only used it a few times to do some very minor sanding. It suddenly stopped working a few days ago and we have no idea why. Unfortunately the return window closed on January 31st, so I am out of luck. Really expected a Black and Decker product to perform much better than this.",
        "Great weight and balance. Nose of sander makes it possible to get in tight places. Only pro models perform better, but for those not in the Trades, it is agile and performs to expectations. The average home user would not be disappointed at this price point and ability to complete it's task. As for durability, it has yet to fail me as it is only used occasionally.",
        "I bought this sander for my husband who is renovating our hardwood floor. He wanted an inexpensive sander, but also does its job great. And he settled for this one from Black & Decker. This sander is lightweight, easy to use and is performing well. My husband is happy with this product.",
        "used on one deck project .. plastic belt rollers already starting to show wear ... I would advise buying the extended warranty if you plan on using in a lot . Otherwise it worked good .",
        "At the price point of these, it is incredible. I put tons of time on mine shaping the new stringers/ floor etc I put in my boat. Using very corse belts (obviously) the sander was able to remove a lot of material very quickly. It is fairly loud but it's a power tool.",
        "I am very happy with this tool. It performed better than I expected on a number of different woodworking projects I am working on.",
        "Been in the cabinet business for 40 years best sander I ever owned for the size it's the only dust bag that catches 90% of the dust it also sands very flat compared to the ones that I've spent a lot of money on",
        "Light weight and great for sanding the edges of shutters that we just cut with a saw",
        "Its ok for small jobs but don't get in a hurry give it time to perform",
        "Sanded 600 sq. Ft of deck and it never let up. Only issue is that you have to watch the belt tracking. Easily comes loose, easy to adjust back though.",
        "This Sander has all the necessary features that helps provide me for many upcoming projects!",
        "This is a solid power tool. It works well and appears well made. For the price, you can't beat it, but whether it would stand up in commercial, or professional use is hard to evaluate. For the home handyman and occasional wood worker, as am i, it's great.",
        "Very convenient in usage but unfortunately did not last more than half a year ( furniture shop). Would recommend only for home usage (on occasions)",
        "I own several Black & Decker power tools, and this one is another great one. Being able to reposition the handle and front cover allows me to sand inside curves. I've always trusted Black & Decker products because they are built so well. I have a circular saw that is 28 years old.",
        "Works great. My previous sander died, this arrived 2 days later so I could continue my project.",
        "Worked well for about 3 hours. Then an internal part broke for which you cannot get a replacement (we really tried) and we attempted to fix with JB Weld, but that didn't work. Huge bummer.",
        "Awkward to use took a few minutes to get the hang of. Belt slips and tears if not on securely on or if you move in any direction other than straight. Sanded a table that folds into a bench. Haven't used it since. Will probably purchase a palm/orbital sander.",
        "Good value for the money, not a Dailey go to but fir the occasional product very decent",
        "For $50 this works fine. I bought it because of the folding front handle and low profile to get underneath my porch banister. the bag catches maybe 2% of the dust. I have used it for maybe a total of 2 hours now. No issues with the belt tracking as other's have mentioned.",
        "Made very easy work of a deck sanding project we had. Had been using a palm sander. was taking forever. get this thing and it took minutes.",
        "Stay away! I used the sander for about 15 min at which point it started smoking badly and stopped working. Your best to get something else!",
        "On my second, first was replaced under warranty and is doing the same as the first. Stretching belts with in less than 5 minutes of use and the adjustment is crazy stupid!! The squealing noise from the small front wheel never stops and over heats with in the first 3 to 4 minutes of using it. Do not waist your money. Spend a few extra bucks and buy a good one!!!",
        "lousy designer and no QA on the product - not worthy of the brandname - please send the designer back to school.",
        "Good for the price. I have had to use hand tools to get the tracker to track properly. Other than that, no real issues.",
        "This is exactly what we needed to sand the walls and get them ready for painting. Its easy to use and easy to load! love it",
        "Although I am not a huge B&D fan. This sander worked very well. I used it solid for 3 weeks and used 24 belts. The only down side is the belts do seem to get out of align. The thin nose is great for sanding under the cabinets, along the toe kick.",
        "This sander rips through old paint layers. Will last for the whole job. Sanded much of the outside of my house with this tool. Can also be flipped over to create a stable platform to sand hand held pieces.",
        "Works better than expected . Like it a lot for fast removal of top surface irregularities.",
        "Can't stand up on its own like my old Craftsman. Small diameter front is a good feature",
        "It works, but it tends to kickback and move side to side when in use. Overall it’s a good value for occasional use.",
        "Works very well, came with one sanding belt and I ordered more. I use it for sanding pallet wood on furniture I make.",
        "I purchased this Dragster to sand down the coves on eight inch cedar siding. The small front area of the sander made short work of removing the weathered paint. The Dragster worked perfect on a 4100 sf garage.",
        "Unique design in that the front roller can cover difficult areas including using the top portion. I like the smaller, lighter design and adjustable handle making the sander much easier to handle.",
        "Had to return it. Could not get the sanding belt to stay on the sander. I actually cut into the sander.",
        "Decent little lightweight belt sander however lock lever for the adjustable handle is easy to break if you are not careful not to worry it is easy to fix and upgrade to correct problem",
        "Owned for nearly three years light use ok. Had to change belts and the belt rolls off. Call tech support no help. Come to find out the belt issue is common and unfixable. Mines is useless. There is no fix for this issue",
        "Ordered this for my brother, he likes it for his free lance projects",
        "The belt would stay on. Looks like the guides are worn or shaped in such a way that a belt could never go straight. Couldn’t even get 5 min of use without the belt coming off. Worthless.",
        "The product had broken parts and the belt would not stay on. I would like to know how to return this sander. It is useless to me.",
        "This is sander the biggest waste of money and time. After about an hour of use, the belt started sliding off the sander making it useless. If I could have given this zero stars I would. Don’t waste your money. This is GARBAGE!"
    ]
}