{
    "entity": "Woks & Stir-Fry Pans",
    "text": [
        "had the same pan that I bought 2 years ago and worked great on a gas stovetop. We moved and now have an electric stove top and it got all scratched up. Decided to get a new one. After a month of use the new one looked as beat up as the first one! Don't know what the problem is? maybe the material is not meant for an electric stovetop!?",
        "Non-stick coating started to peel after less than a year of use. It started happening suddenly one day during normal use. It got on to the food.",
        "This is not a good product. For a pan over 20$, I do expect to get what is promised and have a durable product. I have been super careful when using this pan (using wooden spatula etc. ) and have been taking extra care when cleaning but this pan still developed cracks and scratches within 5-6 months. Moreover, recently I have also seen carbon like material develop on the pan within the first 5 min of usage and hence I have thrown this out. I do own other utensils build using hard anodized material and have gad very different experience ( for good!). This pan definitely is not hard anodized as marketed. Please don’t waste your money and effort.",
        "Great little griddle for eggs, crepes, pancakes and grilled cheese sandwiches. I use my 10\" circle on the stove instead of the ususl 6\" to prevent warping in the middle and never, never go beyond medium as any pan this thin will warp. The non-stick surface seems okay, probably not as tough as my All Clad pans because even with a rubber spatula, it gets micro scratches from salt grains. The double-studded hand is very good. It stays cool to the touch and since it's double-studded, you don't suffer the loose-handle problem with cheap pans that use a single screw.",
        "A must for making buckwheat crepes. Heats evently, haven't burnt anything unlike the crepe pan purchased from a bakers catalogue. I spray surface even though it's non stick, a must for gluten free cooking. It's versatile pan, have cooked pancakes, hamburgers, eggs on it even warmed up pizza slices. Got rid of my 8\" frypan and use this instead. Only use plastic utensils so scratches.",
        "I have been making crepes for 30 years, but I never had a special pan for crepes. I've watched videos on how to make them and people say you don't really have to have a special crepe pan. Technically, they are correct, BUT my crepes have never been this good. The pan is perfect for crepes. The handle doesn't get hot, the heat is distributed evenly, it is each to clean. I love it. I make crepes everyday. Well worth the money.",
        "Do not buy unless you want scratches in the “non-stick” cook surface. Used only olive wood spatula on it. Bought a month ago - used a dozen times or so - and it’s all scratched up! I thought they had better quality. I should have read the reviews more closely.",
        "I have 2 of these pans and they are the perfect size for crepes. Not as large as the kind they use in France for 'street' crepes but those are really big and are usually served folded into quarters with a napkin. We have crepes for family breakfast on most Saturdays and with two of these pans going I can produce a dozen crapes in about 15 min. Then we serve them at the table sou you can build your own, with sugar, lemon juice, jam, or butter. The size is just perfect about the size of a flower tortilla, but much lighter and heavenly. Get ato flip the crepes. Best breakfast ever.",
        "I have now had this pan over a year and can’t imagine how I got by without. I use this to heat up my corn tortillas. Heat the pan over medium heat and then dip the corn tortilla in water briefly (both sides) and put it on the hot pan. Fry briefly on each side. No oil needed and the corn tortilla doesn’t turn to mush when you put meat/veggies on it. I refuse to eat steamed corn tortillas😜",
        "I love this pan. It has a nice weight but not to heavy. I had never done crepes before and they came out perfect. My receipe for crepes is easy..... 2 cups of all purpose flour 1 & 1/2 cups of milk (or almond milk) 1 egg 1 tbs vanilla extract 2 tbs melted butter 2 tbsp sugar 1 pinch of salt Just mix everything together and start making crepes :) enjoy! **mix must be runny not thick, you can add more milk if needed",
        "LOVE LOVE LOVE this pan. Not only does it make fantastic crepes but like other reviewers I find myself making tons of other goodies in it as well. I like that I only have to add oil if I'm looking for taste. Otherwise everything just slides out ... fried eggs without breaking the yolks is the best. And don't use high heat as others have said. It cleans up well with no scrubbing.",
        "I got Cuisinart non-stick pan because of the brand. I use it very carefully, cooking only stuff like ommellete and dosa (Indian pancakes). Also I wash it either using soft sponge or by hand to avoid any scratches due to rough items. And yet I see so many scratches and it's been only 2 months since I bought this pan. I won't recommend Cuisinart.",
        "Have been using this product for a while now... we absolutely love the crepe pan as it caters to our indian needs where I use it to make roti's, Dosa's and omelette. Best part of this pan is it doesn't stick while cooking and can take out the item in just a sec. Only negative is it does loose its non stick property over use of time ( after 7 months ) and we end up ordering it again. I do wish crepe pan would come in slightly bigger size than the one which is currently available. But definitely worth the buy for $25 !",
        "Love it! Made my crêpe making so much easier, and I was able to flip them the traditional was quite nicely. I have a bag over it for storage, per another customer's recommendation, to help prevent scratching. The handle is nice and sturdy and the pan is a good weight.",
        "I bought two of these excellent pans as I teach family members how to make crepes (mostly my younger kids, but some parents and friends as well). The even heating and nice handles with the scratch-proof non-stick surface wins my * * * * * rating! Very, very pleased with the product, shipping and seller. Thanks much.",
        "Worst cuisinart pan I have ever used. Didnt even last 3 months, even with gentle use and hand washing. Coating coming off from ist week of use",
        "I just received my pan. It is NOT 10 inches. From rim to rim, it measures only 9.5\". The internal pan measurement (flat bottom and not the sides) is only 8.5\". I was looking to replace a pan which has 10.0\" internal. This is a loss of 28% of the surface area of the pan. Unacceptable.",
        "This pan heats up very fast. On the flip side, it cools down fast too. The heat distribution is good. The coating is not very scratch resistant. However, in my experience, I have not seen any non stick pan last longer than a year or 15 months anyways.",
        "This is my second one and it is a great crepe pan I gave it a 4 star because they glued some stupid label in the middle of this one and I put a small scratch right in the middle trying to get it off. Makes me mad brand new and already scratched and all because of some dumb sticker. It wasn't on the first one.",
        "I use Greenpans for ALMOST everything. The exception is eggs. In my experience, if you make eggs in any of the ceramic non-stick pans they start to loose their non-stick properties. I use my Cuisinart crepe pan everyday for eggs since I couldn't find the omelet pan I previously purchased. It makes a wonderful omelet and I also use it for scramble eggs, as long as I'm making five or less. The sides aren't very deep since it is an crepe pan so more than five scrambled eggs becomes a mess. I always thought I was horrible at making omelets until I discovered this pan. Now I can get my omelets out without them breaking apart. Wonderful!",
        "The pan isn’t scratch resistant as much you would expect. The top layer of the non stick cane peeling off after few uses. See the attached pic.",
        "Started making crapes for family. Saw this pan. Decided to get it. Its a nice pan. Easy to use. Easy to clean. Crapes don't stick to it. My daughter cooking teacher said he has same and loves it",
        "Perfect crepe pan. Needs no oil or butter, matter of fact I tested crepes with and without and they were better without! Makes it super easy to crepe it up. :) Have another Cuisinart if the same line which has lasted me for years and this one will no doubt do the same.",
        "I love my crepe pan. I've had it for a few months now, and this thing makes all my crepes cook perfectly, it heats up quickly, and I don't even have to use butter or oil before pouring the batter. I'm no chef, but this pan has made my favorite breakfast food super easy to make and even easier to clean up. I will caution to not go over medium heat with this though. On low heat everything still cooks quickly, and any higher makes the batter slide around and the end product look terrible.",
        "I wanted a 12 inch hard anodized pan to make Dosa, a south indian crepe. Having exhausted my searches for one, I settled for a 10 inch pan. But look at the photo, this pan is tiny. The cooking surface is barely 8 inches. I thought maybe the measurements in the product description is of the rim, but even that falls half inch short of 10”. Disappointed in Cuisinart for misleading. Sadly, I have to return and continue searching for the right crepe pan.",
        "It gets scratched up really easily, I've had it stored in it's own little area since I have gotten it and still a ton of scratches and it's only been a week. As of right now it does seen to be non stick which is why I gave it five stars.",
        "I use this crepe pan to warm tortillas and he coating is slick and works well. However, the pan warped, slightly, on the very first use. I did not have it in a blast furnace but simply put it on a gas stove at medium heat. It now rocks a bit. Not enough to return unless the warping gets worse.",
        "All Cuisinart products seem good to me, all I have bought are good quality.",
        "I have a very expensive electric crepe maker than works great, however, it's a space hog and I have to drag it out, set it up, find counter space, sometimes I just want ease of use, and that's what the Cuisinart crepe maker gives. Anodized so I can use metal utensils if I wish (I don't wish but others might) and dishwasher sage this crepe pan works great for crepes, omelets, a fast pancake, tortillas, Naan, chapti, pretty much any flat item you want. It is solidly constructed with no hot spots and it really is non stick. An excellent choice for a crepe and much more.",
        "Got this pan about a year ago, and the coating is already wearing off. Have used wooden utensils and washed by hand. Also, light use. Totally dissapointed!",
        "I've had a great experience making crepes with these pans. After a couple of weeks, they began to start scratching, but putting canola oil fixes the issue. I've had a great experience with it and even ordered another one.",
        "I am a crazy fan of Cuisinart and pancakes!!! Very comfortable to use,no high edges of the pan,nothing sticks!",
        "I love crepes and the pan is perfect. Easy to make in this pan. I feel like a chef when is finished. If you haven’t tried to make a crepe, you need to try this pan. It’s perfect.",
        "The heat distribution is nice and I am really enjoying it. However, I am noticing slight chipping on the metal on the edges. I've handled it very softly, so it does irk me but not enough to change my rating.",
        "This is the best pan in my cupboard. It makes awesome omelets. Pan just wraps clean; but of course, it does require oil.",
        "This pan is a lot thicker than the pan I replaced, which buckled from the heat after a lot of use. It is a nice size and is great for making breakfast. I've used it to cook bacon, pancakes, French toast. It's also good for grilled sandwiches.",
        "Been making crepes for several weeks now with this pan. They come out perfect every time. Cleanup is a breeze. Grand kids are very happy with my purchase. Would recommend this to anyone.",
        "I use it almost daily, it's just after washing, I can see some scratches, but still works for me as it is one of the best pan I ever use.",
        "I'm sooo in love with these pans (I got two for my restaurant). They are heavy weight, non-stick, smooth curved edge - perfect for making crepes. They are exactly the right size, well-balanced and the handle doesn't ever get hot. The handle is also long enough for every maneuver needed to made the perfect crepe. Loooove!!",
        "A good, sturdy pan, with a great non- stick finish. An adventurous soul could easily flip the Crepe, rather than turn it with a spatula. According to the box metal tools can be used, but I used a wooden set. The 10 inch size makes a good size crepe which can be filled & rolled or folded. Very easy to clean!",
        "This pan is perfect for homemade crepes. I used just a touch of oil spray before first use and wiped it away and the crepes released easily on both sides. I used just shy of 1/3 cup batter for each crepe and they were the perfect size/thickness for this pan.",
        "Good value for money , very useful for making crepes or it’s more delicious indian version . It’s non stick , doesn’t seem to scratch but would recommend using bamboo or plastic based utensils instead of stainless steel to get stuff on and off . Dishwasher safe and very little wear and tear with a few months of regular use.",
        "This is not the pan for every day use as the surface of the pan began flaking after 4 months of use. We discarded it immediately after it started to flake as we did not want to take the risk of consuming any of those particles with our cooked food. I am assuming it would last longer if it was not used on a regular basis but I was very disappointed with the quality of the product.",
        "Have been using this pan at least 2 times a month for a few years and still happy with its performance and durability.",
        "It worked just fine. The nonstick surface was very good. I haven't tested its scratch resistance. I read somewhere to treat it carefully, so I am not about to test it except accidentally.",
        "Good quality pan but was chipped when it was delivered to me.",
        "Nice quality. Thick and durable, but not too heavy. Good even heat conduction. Good size.",
        "Great pan, very good heat distribution! Not very heavy, it make it easy to work and receiving great results of cooking. Very easy to clean, and maintain.",
        "Okay, maybe not so dramatic, but damn near close. French person here, and this pan makes crepes to perfection. All you need is a decent recipe, and you'll be a crepe-master-chef in no time.",
        "I bought this after reading other reviews so I knew to baby it right out of the box. By being cautious I have had no issues with the cook surface, but a few oops scratches on the bottom. I've been really careful not to overheat it and have had no issues. Worth the extra care for the price.",
        "I have been using it for a few months and happy with it. Easy to wash and it is scratch resistant",
        "Gets too hot and burns food, even on low/medium heat. The non-stick only lasted for a couple of weeks of light cooking. Not worth the money.",
        "We love this pan...bought two...BUT after about 2 months the nonstick value is going fast and dosas stick all the time...so we cannot use it. Seems the surface is breaking down or disappearing somehow. Be nice to know the problem.",
        "Totally worth the price. Makes crepe making easy and no need to use nonstick spray.",
        "Crepes are our go-to meal , sweet or savory. Have 3 of these pans due to large family and nobody wants to wait for another crepe. Highly recommended",
        "I use 2 of these crepe pans at the same time to make my hungry family crepes for breakfast on the weekends. They are the perfect size and the pans aren't too heavy. I like the length of the handle too because my hands don't get too close to the heat.",
        "Absolutely fabulous griddles. I use it to make Indian Dosas and this is just great; i could give more starts if possible.",
        "I used it once and can’t comment on the durability. But I was impressed with the heat distribution when I was heating up tortillas. The handle is comfortable too.",
        "I love to cook, but I have never made a crepe before (how is that possible considering how old I am?) This , however, made crepe making child's play. It performed admirably; I used Alton Brown's crepe recipe, making sure to put the batter in the fridge for at least an hour, and the crepes came out perfectly. Hint: I used more liquid to thin the batter out a bit for easier spreading. I would highly recommend this product!!!",
        "I've been making crepes for over 10 years. My wife and kids love them. The last pan finally gave out by way of the non-stick coating starting to peel. This pan is good to go from the very first crepe to the last. It has a great non-stick coating and a quality feel and look. It would be tough to find a better crepe pan for any price.",
        "This pan is quite thick and very good in heat distribution, but I feel it gets too over-heated. Non-stickiness is not very good, it is very average. And the coating is coming off after just using 4-5 times. I would not recommend it for long term use.",
        "Great item! I have used it for crepes, grilled cheese, omelets, vegan sausage and pancakes. It heats evenly and is extremely easy to clean. I bought it specifically for crepes and it makes amazing ones, but it can cook a variety of other things too.",
        "It's my favorite non stick pan. I use it to cook just about everything. I have purchased 3 of them to use for different items, meat, veggies, and eggs. The non stick coating lasts for a long time. Wash it by hand.",
        "Haven’t used it yet because it’s so small. I think it’s a 10”. Can’t get more than two medium-sized pancakes on it.",
        "I tried lot calphalon, allclad and ceramic, we couldn’t able to breath those smells, this one first time no smelly fumes, it covers perfect in big burner round.",
        "After having tried to make crepes in a skillet I ordered this pan. Now, making crepes is so easy. It's as if I'd been making them all my life. The pan is sturdy, the non-stick surface works well, and the handle designed to always stay cool. The only flaw is a minor one: the outer covering is very thin and scratches easily. That, however, is not enough to keep me from loving this pan. I'm very happy I decided to buy it.",
        "I bought this product looking at its great reviews but I guess I was fooled. The product is not at all durable. The non stick coating came off barely after one month usage. To add no sharp objects were used on the pan. I just used a wooden spatula and the non stick coating came off. I am highly disappointed with the product. I though it would be durable, but I guess I was fooled. I would not recommend this product to anyone who is looking for something durable. Save your money!",
        "This replaced a blue steel crepe pan that became unbearable to use. This one on the other hand, is a joy to use. From the first to the last crepe made, they all came out perfect. Cleanup was easy. I would recommend this pan over the blue steel to anyone who enjoys making crepes without the headaches associated with the other pan.",
        "The nonstick works fairly well but please still do lightly oil the pan! It has a nice weight and seems to be a good quality. Good heat distribution. No problem with nonstick coating flaking and crepes come out great. I recommend using it with a thin plastic crepe spatula.",
        "Perfect pan for crepe cake, the size is perfect, highly recommended!",
        "My favorite pan for omelets and pancakes I had one for few years and when it start loosing its nonstick cover (like they all do eventually ) I got this one which still works strong",
        "you can only cook on low heat. Crepes burned on medium. Food sticks to the Surface.",
        "Developed scratches within the first month. I think they are decent for the price when compared to similar product from other companies.",
        "It's non-stick, and working fine for over a year now. It came with few scratches. And it scratches way too much compared to my other hard anodized cookwares despite the fact that I use only silicon spatula. Plus i think one side gets more heat than the other, i have to rotate the pan to get even cooking.",
        "I love this product! I was really worried the handle would get hot but it really doesn’t. I am amazed with the quality and would recommend it to anybody!",
        "I have been making crepes for years and this this the first pan I have purchased made specifically for crepes. I love it!!! It's just the perfect size...not too big nor too small. The weight is good and it cooks the crepes with an even browning. I am very happy with my purchase...I spent hours looking for just the right one..and I found it!",
        "I use this for crepes only. Non stick. Sturdy and doesn’t warp. I had one I ordered several years ago.",
        "I had to break this new one in right away. Lost my last one due to break up with GF. Oh well, the new one just needs more usage. Still it makes very nice crepes.",
        "I just received it... I already have the set of pots from cuisinart, so I understand how this material work. So now I also got the flat crepe pan too... I’m excited. Hopefully it works as good as the others.",
        "My Crepe pan works great. Had to find the right temperature for it, but now am a Crepe Making Machine. Great Purchase.",
        "Feels sturdy and is heavy for good heat transfer. Does a really good job with pancakes. Scratches VERY easily, though - I've made marks on it with just a plastic spatula.",
        "Great pan for crepes and everyday use. But don't ever put it to dishwasher, the whole bottom coat will be washed out at once, didn't affect cooking quality but the bottom became rusty and looked really ugly after that. I ordered a new pan and going to be more careful this time as overall I like it.",
        "Scratched immediately. It works fine but it’s disappointing to see those scratches on first use. Those scratches are kind of deep.",
        "I bought this to replace a much more expensive pan that did not hold up. It heats evenly an I have made crepes with ease. I've also used it for eggs and toasted cheese sandwiches. It is holding up well, I only has a few small scratches that have not effected its performance. I hand wash and only use medium heat.",
        "I enjoy using the pan and it's very easy to clean Too",
        "The quality is excellant. It’s quite a nice crepe pan. But it’s pretty limited in use to griddle like uses. Still high quality.",
        "ABSOLUTELY love this pan. Now i got to find a larger one",
        "I purchased this pan to make a Hungarian dish called Palacsinta. They are a thin, crepe like dish that can be served sweet or savory. This pan was fantastic. I used very little fat and the crepes did not stick at all. The pan cleaned easily. The heat transfer was very even when used on a gas range. I am very very happy with the quality of this pan!",
        "We are a french American household and this is a very good crepe pan. On the smaller side but at least we can make normal sized crepes",
        "I’m a terrible cook but making crepes with this pan is so easy - even I didn’t mess it up :) it’s easy to clean but I do think that it has a couple of scratches already even though I only used it twice.",
        "I bought this pan because I needed a light pan and the description claimed that it weighs only 1 pound. It seems heavier than the 1.3 pond pans that I have. It seems sturdy though I have only used it intermittently for a month or so.",
        "love this pan! Highly recommend getting it. Was looking for a while for this type of pan!",
        "Great pans, but after first use had visible surface scratches. Nothing down to the base, but no longer completely visibly smooth. Only used soft plastic utensils. However, it doesn’t seem to affect the non-stick ability. And handwash only.",
        "I have one of these and bought this one as a gift for my sister-in-law. She loves it. My brother comes to my house to have something other than crepes. lol. Highly recommend.",
        "Good quality for good price. Been using it for 3 months now. So far so good.",
        "It's a Cuisinart product!! Great quality. Love it - non-stick, cold-to-touch handle, can use metal spatula, easy to clean.",
        "After looking online for a good pan at a great price, we decided on this one... and it was a GREAT decision! This pan makes great crepes and feels of very good quality. I anticipate getting many years of cooking from this pan. My only criticism is that it's only 10inches. I would have loved to have found a larger pan...",
        "Don’t let the inexpensive price deter you. This is a perfect pan.",
        "Just perfect for our home made crepes. We use it every Saturday night, for after dinner desert.",
        "I bought it to warm tortilla's and it works perfect after I had to throw out my old cast iron one I had for 30 years from Mexico."
    ]
}