{
    "entity": "Woks & Stir-Fry Pans",
    "text": [
        "Great wok! It seasoned very well and the metal is very even, so it heats evenly. The handle is sturdy and the hand-hammered effect makes steaming and cooking gravies much easier. The sides really hold things up and out of the center.",
        "Been using it for past few months. It is dented (despite handling it pretty carefully) and does not seal properly (as a wok-lid). Looking for something better... to match the awesome wok ('Lodge Pro-Logic 14-Inch Cast-Iron Wok with Loop Handles') I use this with.",
        "It does what it's supposed to do. Not much to say about a lid! The only thing I wish was different in the design is that an arch-shaped handle instead of a knob would be nicer.",
        "using it outdoor as the cover of my DIY tandoor oven outdoors. Still good after summer.",
        "I purchased this for a purpose other than what it is designed for - as a wifi dish. Look on the web and you'll find all sorts of DIY solutions for using a parabola plus a USB wifi adapter to make an amplified antenna. This performed really well with my 300mw alfa adapter.",
        "It appears well made and fits the new walk as it should, the shipment was timely and it arrived undamaged, I’m looking forward to using it.",
        "The knob came separately, with a small wood screw for attaching it to the lid. But the hole in the lid was almost as big as the screw head, so the attachment would not be very secure and the knob could pull off. I solved it by using a larger screw (#10 x 3/4\" washer head) and drilling out the small hole in the knob to accommodate the larger screw body (I'd risk splitting the hard wooden knob otherwise).",
        "It is the best lid for my wok, previous lid was of a softer metal and wrapped from handling, this one is of a thicker metal and much more sturdy,",
        "High quality product with excellent, fast shipping and a fair price. Not a piece of junk, should last for many years.",
        "The top knob already started to come off and hard to keep clean under the dome ...grease build up ok",
        "We have used it for over a year now. The wooden cap kept on getting loose. We just used a different screw and it works great now!",
        "Exactly what I wanted. I have used it at least once a week when cooking for six or more. If you have a smaller house hold, as maller size might be right for you.",
        "This is an excellent lid for the wok for when steaming your dishes or just keeping your food warm. It is rather high though.",
        "We ordered this separately to use with my wife's new wok. Works fine - it is sturdy & easy to clean. Two minor complaints: 1) The handle wasn't screwed on tight enough upon arrival, and 2) the rounded lip makes it a little harder to balance over some 12\" cookware. Hope that helps. - Greg",
        "What can I say? It's a lid for a Wok - it works fine.",
        "this does the trick but i have to be careful with it due to how thin it is",
        "I ordered them from my wok it ends up being 11 and three quarters inches I wanted to send it back and get a larger one contacted Amazon I'm not heard back from them yet so I would not recommend buying from this company againit has been 5 days.",
        "Not as show in the picture. The lid I received it's very thin and NOT made in the US.",
        "This top is sturdy and is a good fit for an 18 inch wok",
        "This is exactly as depicted, but we discovered that all of our WOCing is done without the cover. word word",
        "Fits wok well. Was well packed with plenty of protective paper and a box large enough to prevent shipping damage.",
        "Nice quality wok, easy to use, easy to clean. Just don't buy it with the metal spatula amazon is pairing it with, it will damage it. Stick with wood.",
        "This is one product that I use all the time. I have had no issues. I use it at least 4 times a week.",
        "This is a very nice wok lid, It has suited my needs for making stir fry and anything else suitable for this type cooking. Fits wok perfectly.",
        "this is satisfactory for my needs for a lid for my wok.I am not sure about the dimensions or the shape.",
        "It's fine. No surprises either way. Arrived quickly. Fits my wok. The wooden knob is kinda nice but otherwise...it's a wok lid. What can be said.",
        "This lid arrived today with the rim seriously folded in due to the fact that the box had zero packing material, along with rough handling somewhere along the line. The material is one step up from heavy aluminum foil in thickness. I would send it back even if it was not damaged.",
        "The lid is extremely thin. Therefore, will be hot in minutes. The knob cannot be installed properly. Don't buy this. Amazon, you should not recommend and tolerate this type of poor quality product.",
        "I have two 14\" wok / frypans. I wanted a lid that would cover the whole pan. I purchased this lid based on it being a \"Lid for 14\" wok\". Imagine my surprise when I received it and it was only 13\" in diameter! When placed into my wok, it drops significantly below the rim. I am very disappointed.",
        "you are taking a gamble ordering from this vendor. The wok lid we bought arrived bent so as to fit in the box. Sorry, but I couldn't get it round again. I called the shop and they offered a discount but, what a drag. A bent wok lid.",
        "The wok heats up quickly. Very easy to clean. No soap needed. Done in minutes. Weight is very good because it keeps the wok very stable.",
        "This was my very first order from The Wok Shop. Superb wok (with seasoning instructions included) and a very large lid that fits the wok well. As a bonus, a stirring spoon, set of 4 chopsticks, and a recipe book were included. The wok I mentioned is sold separately. Remember, since this is a carbon steel wok, it must be seasoned. Below is the link to the wok for this lid. 16 inch Carbon Steel Wok w/ 2 Wood Handles (round bottom):  I highly recommend The Wok Shop for your Wok cooking needs.",
        "The lid does the job but I replaced the screw holding in the handle with one that was more secure. The one that it comes with allows the handle to spin no matter how tight it got. Replaced it with a better screw that allowed for a righter grip so the handle doesnt spin.",
        "Good lid, but the handle remains loose when attached to lid. I will need to get a larger screw to make it tight, but still not enough to rate below a 4-star rating.",
        "For some reason the 14\" isn't really 14 inch. But the problem is the thinness of the lid. It's not even acceptable thinness .. never known a lid to be made so thinly that it caves in at pressure point if you even lightly press your finger on it. I have the toughest time storing it. It won't hang unless you keep it in a closed closet because the slightest breeze sets it flying, so to speak. I would definitely like to see this made heftier.",
        "I really love this wok. I've had it for sometime now, but before I ordered it I had an electric wok but I never liked it. I still own it but haven't used it since receiving this one. I cook everything from stirfry, vegetables, meats, and etc. in it. Now that I live alone, I don't use it like I use to except when we are having family dinners. It's a great wok.",
        "It is bad quality, totally changed color after a few times in dishwasher, and there nail is rusted after a few months. Not worth the money.",
        "works like a charm and I have had no trouble with the handle on the lid. Fits inside my wok with around an Inch from wok top with a tight seal. I would recommend this to a friend.",
        "Lightweight, easy store, wok lid. Fits in any 14\" wok and is easy to clean. Stores upside down in wok after cleaning.",
        "Lid measures 12 3/4\" in diameter. NOT 14 inches. Handle stays on fine. If you want that small of a product, its fine. aluminum seems thick but some how got a small dent with regular use.",
        "This lid is just OK. It is a little flimsy, but if you are not rough with it, it is fine. It arrived reasonably packaged.",
        "The lid is well made and it works perfect with the WOK that I bought. I'll use it for years, plus it's great product.",
        "Serviceable lid. The knob handle remains a bit wobbly after screwing it in securely but what can you expect for a low price like this?",
        "Other than being made out of aluminum it is well made with a good size knob for a handle. If you need a wok lid I highly recommend it.",
        "Shipping was good, and overall product is acceptable. I do have a problem with the screw that was included to attach the wooden handle to the top, but I addressed that myself.",
        "Arrived timely, no damage and serves its purpose. Fits my 14 inch wok with no issues and cleans up easily.",
        "MY DAD COOKS ALL THE TIME SINCE MY MOM'S BEEN ILL WITH CANCER BUT NOW SHE GETS TO USE IT ON OCCASSION AND THEY HAVE A GREAT STOVE WITH A BURNER THAT IS MADE FOR HIGH HEAT AND BEFORE I LEFT MY PARENTS HOME HE MADE HIS FIRST BATCH OF STIRFRY IN THE WOK AND IT WAS GREAT IT CAME WITH ALL THE INSTRUCTIONS ON HOW TO SEASON AND CLEAN IT, IS WELL MADE AND WE BOUGHT ALL THE ACCESSORIES THAT GO WITH IT!!!!!",
        "This lid is perfect for the twelve inch Wok I bought. It performs exactly as expected each and every time I use it.",
        "Keeps the steam in for cooking dim sum! I wouldn't have a wok without a lid.",
        "The key might be to buy the Wok and Dome at the same time. I bought from 2 sources and the fit is not perfect, but still works just fine!",
        "Good product. It was actually larger than what I needed & the company exchanged it for a smaller one without any hassles, quick delivery.",
        "It's just a lid. i either does what it's supposed to or it doesn't. This one does what it's supposed to.",
        "I love this wok and use it often but you must take care of it well.",
        "The item is fine but it's way too big and I've used it once then I gave it away. Thanks anyway."
    ]
}