{
    "entity": "Woks & Stir-Fry Pans",
    "text": [
        "My first cast iron pan was the standard Lodge 10.25\", which quickly became my go to pan for most things. However, for many meals, it is just too small. I wasn't thrilled about buying, maintaining, and storing multiple cast iron pans (12\", 14\", 16\" skillets and/or various Dutch pots), so this wok is the catch all for anything that doesn't fit in the 10.25\" skillet, and it works as awesome as the lodge cast iron skillet. I paid for this product and wasn't compensated in any way. If you found this review helpful, please click on the Helpful button below.",
        "The quality is good, but it's too heavy for me. Therefore I would like to return it. However, the website says I CAN'T return this item. You should warn us about this when we are purchasing it. Now I am really disappointed.",
        "Love it and use it often! It's a little heavy so be mindful when hand washing in metal sinks or handling on any surface that might dent or crack.",
        "Compared to standard woks, the wok is insanely heavy, but it does the job. It arrived well seasoned with no rust or blemishes. It retains its heat and is great for stir-frying, deep frying, or even making popcorn (tall lid recommended). The higher temperature is located toward the lower center of the wok, which allows for quicker cooking. Once done, you can push the food out towards the sides. As for cleaning, this thing is a beast. A large sink and some upper body strength recommended. All in all, this is a great item that will last many many years.",
        "The wok does not sit flat on a cooktop when heated. As it heats, the bottom distorts and the entire wok wobbles. Even worse, returns are not permitted on this item. Amazon just forces you to Lodge's website to fill out their contact form, and there is no option to return or exchange.",
        "I have only used the pan once, the color of at the inside bottom of the pan changed as you can see in the picture. Then I submit return request. It guide me to customer service for submit ticket. After a week, one one contact me. If I can give 0 start, I will do that",
        "If you cook a lot of stir-frys, this is an essential piece of kitchen equipment you shouldn't be without. It's heavy and holds head better than any steel wok I've ever owned. I do recommend getting a chain-mail cast iron cleaning \"cloth\" for cleaning and maintenance. Those work great without removing the \"seasoning\". This also comes in handy for deep-frying. My only regret is not buying this sooner.",
        "Love this American made wok! I've been cooking in it non-stop since purchasing it. (Which is comical, bc I bought it for my husband to use on campfires, lol). Highly recommend this item!",
        "The bottom of this Lodge wok is not completely smooth. It has three concentric rings that are about 3/4\" across that create ridges on the bottom. These ridges are incompatible with my GE glass top range. Hats off to Amazon for resolving this issue for me.",
        "Just open the package and there are rust on it :)",
        "It's a piece of Lodge cast iron, so my expectations for quality and functionality were indeed met. I use this on a gas stovetop, and it works very well. As expected, heating is even which, in this case, means that it is hottest at the bottom and cooler up on the edges, which is exactly what you want. Remember to oil it up after you wash it, or you'll get some light rust from the raw cast iron. This is perfectly normal and is NOT a defect. If it happens, just wipe the areas really well with an olive-oil-soaked paper towel and it will be fine.",
        "There is no padding in the product box to protect the Wok and it wasn't shipped inside another box to protect it. There is a small crack near one of the handles that (from past experience with cast iron) is going to eventually spread. At first, I thought it was maybe just a scratch in the seasoning, but it goes the whole way through. I shouldn't have to warranty an item out of the box. But \"No Returns\" or exchange on this one. Last item I purchase from Lodge on Amazon. Update: Amazon did make it right. You'll want to go to the \"Chat\" option to discuss any issues you have with the item if it arrives damaged.",
        "I got it a year ago and still like it. It’s fairly large/big. It’s heavy, it’s cast iron therefore expected. Can’t be cleaned in dishwasher or it will have rust spots. Again, this is expected for all cast iron products. I can see passing it to my child and then her passing it to her future children. The only thing i’d wish it had would be a lid. Not the thin one you can get on Amazon but a good quality, that would match the wok, either glass or cast iron or thick metal. Right now I use aluminum foil when I need a lid.",
        "After getting over the initial shock of how large and heavy this cast iron wok was, I came to realize it is an excellent addition to my cooking arsenal. It has given me a whole new look on stir frying with ample space to create the healthiest stir fry possible. Since this product cannot be returned (not eligible), I would recommend anyone considering buying this specific wok to think carefully about its size and weight. My small kitchen makes it challenging to store the wok in a cabinet or on a cooking rack when not in use. I would recommend this wok for anyone who loves to stir fry and wants to take it to a whole new level.",
        "It's a good quality pan. HOWEVER, if you aren't 100% sure you want to keep it DO NOT BUY. Upon receiving it realized that it was heavier than I thought I could hold. I ended up finding a lighter and cheaper one somewhere else and got that instead. Came on to Amazon to create a return slip and IT DID NOT LET ME. NO WHERE ON THIS PAGE does it mention the return policy. I have never had an issue like this. It's totally ok if a company doesn't accept returns however there needs to be a visible warning. This is unprofessional. UPDATE: Called customer service and Amazon was able to refund the amount.",
        "This has to be the best wok I've seen since I hit the local Chinese restaurant. It's huge, heavy (in a sturdy way), and has a flat bottom for cooking in a glass-topped oven. (It will work on an electric or gas top too.) Heats quickly and cooks like a wok should: hot in the center and cooler on the sides. This one will last me the rest of my life, and possibly get handed down. That's how well made it is. Tremendous value for the money. Get it now, who knows how long they'll be available. Oh-this would be the perfect gift for a foodie who hasn't found their perfect wok.",
        "It’s my first time to buy lodge. I always feel it’s my grandma’s stuff. After trying it for some time, I start to understand why it’s classic. The wok is much heavier than modern woks, but it gives good contact with any source of heat. It’s stable when stir frying. Both features allow quick heating especially if you want to try Chinese style of cooking. It’s spacious so I’ll never have to worry about stirring out ingredients. As a gentle reminder, lodge wok takes muscle strength to move it around and it takes some efforts of seasoning after each use to prevent rusts from building up.",
        "Product has a manufacturer's defect. Cracked near handle, not typical Lodge quality! Of course, it's past the date of return!!",
        "it oxidized quickly. bad product. want to return it but they do not accept return.",
        "Once my beloved wok was lost in my last overland trip, I went ahead and have this Lodge Cast Iron in 14 inches. This is heavier sturdier and thicker than my past wok. Feel free to cook on open fire, right on blazing coals or at home in any kind of stove, this wok is a versatile piece. I got a heavy duty burner stand that will hold this heavier wok without hassle in my next hunting season, what else could I ask for to cook my meals in magnificent outdoors!!!",
        "I've used an expensive teflon coated wok for years and liked it. It started to degrade so I took a chance and ordered this cast iron wok. Far superior to my old one. Cooks evenly and I can cook at a higher heat. If you're large busted or have a belly you will need to stand further away from the stove. It's easier to clean, and I love the handles. It's also lighter in weight than I thought it would be and it's much easier to handle than my last one.",
        "This wok is amazing. I had an aluminum one before and the coating started to flake off after just two uses. That is why I upgraded to this cast iron one. It’s much bigger than my first one, so I’m able to prepare a meal for the entire family. And the clean up is easy. It does take a few minutes to heat up; however, I start the fire when I start cutting the veggies, so this isn’t an issue. I have already recommended this to friends. One other comment - since it’s 14” and cast iron, it does have some weight to it. Overall, I’m very happy with this wok!!",
        "In the past, I have purchased many woks.They all end up being stored and never used.This wok is a different story. Lodge made it beautifully! Lodge makes everything beautiful. When I received it, I thought that I bought one that was too big. I found out after using it several times that it is a great size. It gives you lots of room to stir fry vegetables. I am glad I bought the big size. I cook for 2 and it's just right. Love this wok!",
        "The Lodge cast iron wok is heavy (11 pounds) and a solid performer. I use the wok primarily for stir frying and curries. The shape of the wok (wider slope) is more efficient for small, medium and large quantities of food than the usual design form both non-stick and carbon steel woks. The benefits of cast iron include being able to cook at medium-high stove top settings rather than high -- energy saving and better control of the cooking. The Lodge seasoning meant non-stick cooking from the start. The wok is easy to clean and maintain, The glass cover fits perfectly. I recommend the Lodge silicone handles for safety in moving the pot when hot.",
        "Not pre-seasoned as advertised. Arrived with rust spots on handle and the bottom platform. It steams food rather than searing as a wok is designed. I have been using a carbon steel wok for decades that works better then this one. I was hopeful that this wok would distribute heat at a higher temp. Not the case. 1.Steams food (even in small quantities) 2.Not pre-seasoned as advertised. 3.Arrived with rust spots on handle and the bottom platform. 4.Difficult to clean. Waiting for our refund. Will update if/when we receive our refund. Update. Amazon refunded for the wok. Though the wok is not returnable. They suggested to donate it or throw away.",
        "It did not come with the perfect quality but it’s ok I can fix it This is beautiful easy to clean and PLEASE !! For all those people who says that it get rust helloooooo of course it get rusts because you didn’t take the time to read the instructions, that is why i leave a picture of it It says you HAVE TO WASH and DRY PROMPTLY but even do if it get rust you just clean it don’t post a IGNORANT review please",
        "Bought this for my college-aged daughter because her house has an electric stove top (not gas like mine) so I couldn't purchase a traditional steel wok like use. It works perfectly! In fact, I made a mistake of having the burner on \"high\" which was too much - would have burned the veggies. It's definitely heavy when you are washing it - even more than my cast iron pans but less than my cast iron dutch oven. For a gas stove, I'd probably stick with a traditional wok, but for an electric stove, this is the perfect choice!",
        "Great for stir frying and deep frying. Holds a lot of food. Buy and matching lid to put the wok in the oven to keep food warm. I have been using the wok about once a week since I purchased it as a replacement for my old one made of carbon steel with wooden handles. The handles got so hot that they caught on fire. The Lodge cast iron wok will never catch on fire and should last a lifetime.",
        "the first order got lost. I received the replacement after 2 weeks only to find out that this wok sticks worse than my 5 bucks walmart skillet. I racked my brain and figured maybe it was not seasoned as it was advertised by mistake? I followed the instructions to season it in the oven at 375 degrees with canola oil. I really really hoped it would work after that, but no. Sticks horribly as before. I'm so disappointed and frankly dumbfounded that a product with this kind of great reviews, thousands of them, can be such a let down.",
        "I had been looking for a wok that would work on my inductive stove top. I never expected to find a Cast Iron one. This has all the features and benefits of a regular work, but it's even better because it's cast iron. Better heat transfer and retention. I love cooking with cast iron. Once seasoned properly, it is as non-stick as the dreaded PTFE.",
        "Okay. This wok isn’t for the meek. It is heavy. It is cast iron. You could make stir fry for a dozen with this . It is big and pre-seasoned. It heats wonderfully evenly and cleans easily. To boot, it will probably outlast the owner, so make sure your heirs know how to cook. Absolutely the best thing I have ever bought to cook with. Love Lodge cookware.",
        "I have now purchased 4 of these, 1 for me and 3 for gifts. They are wonderful woks. They heat perfectly and work so much better than electric. Put on burner. Add oil. Add food. Stir. Perfect. They also clean up nicely using standard cast iron cleaning techniques. Heavy and big. Can use on counter to store the mail in between cooking if you are short on kitchen space, but seriously, worth making the room for this versatile pot. Can use it for many other uses beside traditional wok. It's an excellent all around cooking pot. I only buy Lodge Cast Iron, for many reason, but quality is the primary reason. This has no hot spots.",
        "Over the past year, I’ve transitioned to cast iron cooking and recently added this wok to my collection. I am LOVING it! We actually have a glass cook top so for those of you wondering if you can use it on electric and or glass top- you totally can! Just be patient during the pre-heat process. Just be sure to follow the maintenance as with all cast iron...no soap, just hot water and a good scrub. We occasionally clean with a baking soda and vinegar mix. Flaxseed oil works wonderfully on cast iron to preserve its seasoning.",
        "easy to cook with once heated properly (give it a good 7-10 min) to heat up. This has become a workhorse in my kitchen and it gets daily use. Cleaning it just gets easier and easier and the weight of the wok allows me to toss the contents inside with a wok spatula without having to move the actual wok itself (like a traditional wok).",
        "Dislike the product and I felt deceived 1- it took longer to receive the order 2- product rested after 1st use 3- when I tried to return its not eligible for return, which was not mentioned before I bought Now I'm stock with it Unsafe and unhealthy to cook in a rusted wok basically i through my money in the trash 🗑",
        "Bought this wok for my husband as he loves to do stir fries. Every other wok he has ever used ends up warped from the high heat, food sticks and hard to clean. This wok takes the high heat and as long as you follow directions on taking care of cast iron and season after each use it just gets better every time you use it. I think this wok will outlast both of us and will be passed down thru the family. Because it is cast iron it is heavy and I would recommend buying the Lodge handgrips to go with it as the handles do get hot.",
        "I have used this several times now. I love it! Gone are the days when I am trying to cook and the food falls out of the pan as I am stirring it. This is Cast Iron and big, so it is HEAVY! It would have been nice if it came with a lid, but I will look around and see what I can find.",
        "Large and in charge of my kitchen! Big enough to take on commercial sized orders. Quality enough for the best cuts of steak. Great value and will last you multiple lifetimes. Wondering how I've gone so long without using cast iron cookware?....Might be because I've only recently had the pleasure of using a nice, gas stove. I'd imagine if your stove doesn't provide adequate heat, these thick cast iron materials won't be as good for you.",
        "Very nice wok. The cast iron holds heat really well and can get really hot if you need it for high temp stir frying. I've also used it for a variety of curries and even some deep fat frying. Pretty easy to clean, just heat and use some hot water. Just season with a little oil each time it's used once it's been clean, and it's pretty non-stick unless you are using sweet sauces or maybe shrimp. Only downside is it's definitely a little heavy -- i've cracked a sink with a heavy wok in the past so be careful. Overall, highly recommended, get's used at least once or twice a week for us.",
        "best 'deep fryer'...little or no splatter...stuff in oil floats to the side can be removed with a paper towel...use it on an induction burner...its cast iron construction great heat holding...interior rounded bottom...the ring construction on the outside is perfect for the induction burner as well...can't beat the vernacular designs that have been in use for eons in various cultures...i do use it with the stainless steel dome lid...easy cleanup too...just drain and wipe out most of the oil...leaving a residue for seasoning purposes...",
        "I spend all day in the kitchen and this thing has no business being inside of the house. Maybe a camping gadget at best? It’s horribly heavy and just not fun. I’m looking for a replacement",
        "If you don't mind the upkeep of cast iron and want a wok, get this one. It makes meal prepping soooo much easier because I'm able to stir fry all of of vegetables at the same time without making a giant mess. Because of the shape of the bottom, it does seem to take a good while for the heat to creep up the sides. I would recommend heating this up pretty good before adding any ingredients.",
        "I loved this thing. It made searing so much easier than a more traditional wok. Heat distribution was amazing and it was pretty non stick after I got it seasoned a little more. Going to pick up another one.",
        "Heats well, works great, even on my lousy smooth-top electric stove. It arrived well seasoned, and has only gotten better with use. Personally, I like the heft of the cast iron but, if you are looking for something easy to toss around, be warned: this thing is heavy! I would strongly recommend a set of Lodge's silicone-rubber handle covers to protect from burns. The wok is a quality, American-made product. Unfortunately, it seems that everything other that their cast iron, while still good quality, is made in Asia.",
        "I have a Lodge brand walk and this one, they really are both equally good. This one is slightly less heavy and sits lower to the flames , great for an electric stove. Also it's a bit wider and for some reason the handles do not get as hot. The lodge brand is alot more pricy, has a small \"stand\" on the bottom that is good for sitting on the table but not as good for cooking on. I feel like the size is the same , only this one is slightly wider . Over all I'm super impressed with the quality for the price.!!",
        "Beautiful cast-iron wok. We are using it on an induction stovetop. The only downside is that the base is a little too small to use on the largest induction stovetop burner. We also burned some food in it at one point, causing some rust, but we were able to fix it by re-seasoning it. We store this wok by hanging it on a hook -- the handles are certainly strong enough to support its weight.",
        "Absolutely one of the most solid pieces of cookware I have ever purchased! The pre-seasoning that comes with it is spot on and as long as you ae good about cleaning it after you cook right away it really should never be an issue. I have had mine a few months now and I use it probably about once a week or so and it has held up fantastically well and already I am starting to taste the flavor it adds to my dishes!",
        "It is cast iron so cleaning is a little difficult at first, it is getting easier each time I use the wok. Never use soap to clean cast iron cookware. I really like the large size. Plenty of space for a meal to feed a family of four. I believe the Lodge cast iron is far superior to other thin steel woks when it comes to searing meat. Wok does come preseason, still needs oil work and regular cast iron care.",
        "We love all our lodge cast iron and this is no exception. The textured surface is perfect for holding things up on the sides while you thicken your sauce in the middle or if you need to slow down the cooking rate. It's huge, it's heavy, and it's great quality. Absolutely recommend.",
        "This is a heavy cast iron wok with a flat bottom that fits nicely on top of a gas burner. Because of the flat bottom and the weight of the wok, it is extremely stable, much more so than thin metal woks. Also, because of the mass of the wok, it heats evenly and holds heat well when ingredients are added to a stir fry. The seasoning also gives it a good stick resistant surface, but one that will not scratch or damage like non-stick coated woks. It cleans up easily with soap and water and a sponge. I am very impressed with this piece of cookware.",
        "I’m neutral about this wok. The base stand is narrower than I would have liked. The heat seems to conduct only at the very bottom of the wok, not up the sides as much. Although it comes pre-seasoned, the bottom of the wok still needs to be significantly oiled the first few times following use, and cleaning it is a task. In the future, I would purchase one without the bottom lip, one that sits truly flat on the range.",
        "This wok cooks everything really well. I really enjoy cooking stir fries with it. But my one major problem with it is that good sticks to the bottom of the pan. I wash it in warm water with a steel brush (as recommended) and dry it right away and brush veg or rapeseed oil on. Before I use it I heat up the oil before cooking. So I have no idea why food sticks to it every time! Makes it annoying to clean but at least my food tastes good!",
        "L.O.V.E. It’s big & smooth, but very heavy. Cooks literally everything perfectly. Very even heat distribution & non stick surface. I know it says pre seasoned, but I wash with soap, re-season & bake all my new cast iron. It’s made in the USA too, which is great. I’ve wanted this for over 2 years & finally got it. If you’re a cast iron lover, buy it. Great for just about every dish.",
        "Have not had this pan very long, but have been using it exclusively since it arrived. Even washing it with soap (gasp!), using metal utensils and the basic drying off on the stove at high heat and rubbing a light layer of oil on, with a rag. Nothing has stuck to it a single time and food has cooked quickly and easily. Have been cooking up a storm of Asian food and have not been disappointed yet! Today I decided to try frying an egg. It was perfect! Highly recommend!",
        "Great size, but it is on the very heavy side. You wouldn't be tossing this wok! I'm disappointed because the heat doesn't really make it all the way up the sides (we have an electric stove). Often times, it makes the food stick, but maybe it's because it doesn't heat up well or I'm not putting enough oil. Anyway, it don't really work for my situation.",
        "Really dig this wok. Such a workhorse. Have used it straight out of the box with no additional seasoning from my side yet and it works solid. Heat it enough and the surface is almost non stick. Have cooked scrambled eggs on it to fried rice to other noodle stir fry’s and the food comes out delicious. Retains heat nicely so got to have all ingredients at hand once you start going on those high heat stir frys. Very versatile so far. Quality is excellent.",
        "I keep showing this to my friends and family, because it's that great. The iron is thick and holds heat well. After using it for a while, I really don't need much oil to keep eggs from sticking either. It's heavy, but that's good exercise for my arms haha! I cook all kinds of things in it, so I find the perfectly parabolic shape super versatile! Hands down, this is the best wok that I've used, and I grew up around many woks.",
        "I think this is the only wok that would get hot enough for stir fry on my glass top stove. It is a little heavy and bulky but it needs to be big in order to cook what I want to cook and needs to be heavy in order to conduct enough heat so I'm not counting those things against it. Like all cast iron cookware it is a little harder to clean than something non-stick but after finding the Blilsstime Cast Iron Cleaner Premium Stainless Steel Chainmail Scrubber it is a lot easier.",
        "Lodge always makes quality stuff. This wok is heavy duty, should last generations. Far greater quality than anything else out there. Inexpensive, especially considering size, the fact that it is made in the USA of domestically sourced iron and compared to the prices competitors charge for much lower quality woks. This is a lifetime tool that will last for generations!",
        "It’s a beautiful wok! Ive used it a dozen times and it’s my favorite piece of cookware. I use it in a gas cooktop and it is big enough to not make a mess as I stir things around.",
        "awesome quality you expect from lodge cast iron flat bottom for secure cooking surface high sides for heat displacement",
        "Bought this wok and am very happy with it. All cast iron seems to take extra time to clean and this is no exception. Food can tend to burn in or stick to the bottom requiring extra elbow grease to clean vs a traditional metal wok. Looks great and we are happy with it.",
        "Although it arrived ready to use;I went ahead and quickly washed with mild liquid detergent、wiped dry、seasoned withVeg oil、quickly ran through heat(caution this is bit heavy;Please use hand protector as handles get extremely hot;I should'vebought this instead of other cheaper brands;Love the results。",
        "Have this one since Nov. 2018. Used it once; it does not work well on induction cooktop. Could not make the bott0om hot enough. Also, it is heavy. Anyway. We have it in our coffee table in the living room. With apples etc. inside. It looks beautiful. Amazing shape.",
        "I will say that I was sorry or surprised how dimpled it was. Seems like they are off the mark at this point. I bought a Chinese brand here and it really did seem the same, as far as quality, and a need to season. Don't get me wrong, I love the size, but it did take me some time to get it to the point of non-stick.",
        "As a real fan of fusion cooking, I believe every cook should have a Wok in his or her kitchen. Cooking versatility inside the Wok allows several things to cook at the same time since the internal temperature allows, say, shrimp and broccoli to arrive at doneness at the same time. thus saving time for both cook and hungry person. Try a Wok. You won't be disappointed.!!!",
        "I was very excited to receive this product a few days after I ordered it. I was preparing to show off my cooking skill with this new wok. Unfortunately, when I opened up the box. I was very disappointed with the product quality. The surface of the wok was really rough with holes, blister, and chip. See pic for details.",
        "I have only used it a few times, but it works great on my Ceramic Glass range. It's heavy, which is great for staying where I want it and not sliding around my stove! Cast Iron is great and of course it comes well seasoned from Lodge. Nuttin' Sticks! Works great with the Bamboo Handled metal Wok Spatula I bought here too and love it. many more uses that just stir fry, but that goes very well on this too!",
        "Honestly the most favorite thing in my kitchen. As a vegan I cook mainly vegetables and this wok cooks them perfectly! Very easy to clean and maintain! Even dishes like tofu scramble had very minimal sticking and again, it's easy to clean. I cook in this for most meals. Highly recommended!!!!",
        "I have never had a wok and received this as a gift. It's really big and heavy so make sure the size is what you want. It's perfect for cooking for my family of 5 and plenty of room if I needed to cook for more. It does a nice job of cooking food evenly. It has a flat bottom so balances nicely on my cooktop.",
        "I'm using this on an induction hotplate. It takes a couple of minutes to heat up, but once hot, it's significant cast iron mass allows it to retain heat for bao cooking and produces excellent results. Since it's heavy, I tilt it and quickly spoon out the food when done and I don't find the weight to be a problem at all. I added a few layers of seasoning when I received it, and it's become very non-stick and easy to clean.",
        "I bought this for my husband for Christmas. He wanted a heavy wok to use for stir-fry (our old one would move around too much & was too hot to hold onto). I decided on this one. He LOVES it!!! It's heavy like all Lodge products. What he likes about the Lodge wok is that it cooks evenly, food doesn't stick, & it cleans up easily. I also bought the silicone handles that fit perfectly on this wok.",
        "I am a big fan of Lodge. They make excellent cast-iron cookware, and this wok is no exception. You can make a huge amount of stir-fry with this thing. One of the greatest benefits to cooking with cast-iron is that it does add a little trace iron into your food. My boyfriend and I are vegans, and that's a big plus for us. We really did feel the difference when we switched over. Just remember, tomatoes are no good in cast-iron; they will create an acrid taste. Cook them separately.",
        "It is a bit heavy for washing, but so very pleased with it. I love cooking with cast iron. It stays on my range and we use it almost every single day. We eat a very healthy lifestyle and this wok helps us do so, great for stir frying veggies in quickly!!!",
        "I love this wok. Even though the wok is preseasoned, I still performed my own seasoning to before putting the wok into service. It works great either on my glasstop stove or my grill's side burner.",
        "We love this wok. We is it on our stove and on the grill for stir fry. Very easy to clean. I always passed on cast iron because I thought it was a pain to use & wash but I was wrong. It's not even fully seasoned yet and no issues.",
        "Love this wok because of the cast iron. Gets hot and holds the heat to allow succession frying as expected rather than saute like thinner woks out there. Had a number of woks both stove top and electric. This is by far my favorite.",
        "What can you say. As long as you season the cast iron and treat them well this thing is going to last the test of time. Each seasoning makes it easier to clean and food cooks faster. I thought I would use it here and there but it has become my go-to to cook now. I have other Lodge pans and never was disappointed.",
        "This Wok is a flawless beauty. It's a cast iron wok, so of course it's heavy. So know that before you buy. If you don't know how to use and care for a cast iron wok, learn about it before you purchase. It will rust if you leave water in it. The rust doesn't ruin it and can be cleaned, but it can also be prevented by properly cleaning, drying and seasoning it with oil. I bought a chain mail scrubber to clean the wok. Never clean it with soap. With proper care this wok will last a lifetime.",
        "I've been using Black Friday bargain woks for years and thought I was happy with them... Then there is this. Awesome. Great heat distribution. Excellent cooking. It almost makes me a better cook than I really am. If you like cooking with a wok, step up to this one. It's just that good.",
        "Received item as described in a timely manner. I love this wok! Lodge makes fantastic products. It is heavy, but on my glasstop stove it doesn't slide around when you're working the stir fry which is what you want. Great product!",
        "The only Lodge pan I can’t stand. If you cook with proteins, they will stick. I own several Lodge pans and they are brilliant non-stick tools in my kitchen. This wok, which I was super excited to get, is useless if you are cooking anything other than vegetables. A waste of money for a wok. Buy a traditional black steel one instead.",
        "Good heavy wok. Wish it came with a decent lid. I use on stove and on bbq outside. 4/19/2020 update: I really like this wok but used it today and got a big crack running down one side. Not sure what to do ....I thought lodge was a good brand.",
        "The one I recieved had some blemishes on the inside casting (more than the standard texture).. I sanded them out and seasoned the pan.. Working great the times I have used it so far. holds heat well.",
        "I've had Lodge cast iron skillets for years and after messing around with cheap, thin woks for years I decided to give this a try. Heats very evenly, is well seasoned, and cleans up easily with some boiled water and a clean brush. I'm really pleased so far. Other thoughts: It's definitely worth getting the 15\" lid that's made for this and the Lodge 15\" skillet.",
        "This wok is heavy and extremely awesome! I use it on my gas stove in my house, on my camper gas stove, and over the campfire. It has worked great in every instance. I have not used it on an electric stove so I cannot comment on how that works. But over a flame, it works GREAT!!!",
        "I love this cast iron wok. After using it, I got rid of the other three I had. I set the stove on low while I'm preparing food then turn it up to a little below the highest temperature when I'm close to ready to cook. It's sturdy and well seasoned, works like a charm and is the only one you'll ever need unless you are doing commercial cooking I suppose. Bonus: regular use will make your arms stronger!",
        "I am never disappointed with Lodge Cast Iron, and this wok is no exception. Gets nice and hot. Stays nice and hot. Cooks evenly. Pretty sure it's gonna last me the rest of my life. Then my children will fight over who inherits the wok after I die. That's how good this wok is. Adults will fight over it sixty years from now. Five Stars!",
        "Fabulous Wok. Heavy. Stays put. Cleans easily. Will last through generations just like my other cast iron pans from my great grandmother.",
        "Knowing the Lodge brand from skillets from my grannie to my mom to me, you just can’t go wrong with Lodge! Yea, it weighs a good bit, but it does not move on my stove so I am never afraid of splashing oil. Great find!",
        "If you are familiar with caring for cast iron and you want to cook on a wok, this pan is for you. This is huge a heavy- easily my largest cast iron pan. I love it. I would recommend letting it dry upside down on a warm stove to get the moisture out so it doesn’t rust.",
        "If you like to stir fry...this is the pan for you. If you could say a cooking utensil is beautiful, this is it. The casting is perfect. It heats, cooks and cleans up well. I am VERY happy I bought this. It now belongs with the rest of my Lodge pans. Good job Lodge!!!!",
        "What can I say other than Lodge makes all excellent products, the wok included. Absolutely flawlessly made that will last many lifetimes with basic care. The wok is heavy so be prepared for a solid large weighty iron pot. Purchased the silicone handles with the wok for added grip. They fit perfectly. Absolutely recommend this for anyone who likes wok cooking.",
        "It’s cast iron and I should have thought of that before I bought it . The quality is excellent I just can’t use it as much for stir frying bec it’s too heavy for me to manipulate the pan while cooking ,Cast iron is excellent but it’s not meant for wok.",
        "After my PC one died on me and everyone I knew recommended cast iron. After getting this for Christmas (thanks honey!) I have to admit this is the best thing I've done. I keep the pan well oiled and nothing sticks to it. It heats evenly and quickly. It is very heavy, and if you have problems lifting heavy things.",
        "#1. Made in USA. #2. Cast iron = heat retention and even distribution. It is heavier than a carbon steel wok but it is not impossible to move and use. Purchase bamboo wok brush and the wok is a snap to clean.",
        "Perfect for cooking. I love it and it's durable. I hate that the handles get super hot, it's my fault I should have understood the heat distribution before I brought. Just make sure you use towels to pick up.",
        "Heat distribution is great. 1st cast iron cookware. Had this product for 6 months. It is difficult to maintain the seasoning layer, it strips every time after cooking food with non acidic liquid even with 6 months of attempting to maintain and reseason the wok every time it is used. Food is still sticking to the bottom. In the end, it is just good to deep fry stuff in for now. It is also rather heavy. And because it is not a very large wok, to make big batches of fried rice is not always successful without scorching the bottom.",
        "I'm conflicted about this purchase. On the one hand: What's not to love about a cast iron Lodge? On the other hand: Where is the Wok hei? Does that come in a separate package? Mine didn't come with Wok hei I don't think.",
        "Love it! It’s not traditional, but it’s smooth and round on the inside and has a flat bottom base which is great if you have a flat top stove. Comes preseasoned and ready to use. Would definitely purchase again."
    ]
}