{
    "entity": "Manual Grinders",
    "text": [
        "Sigh. I guess you get what you pay for. The motors in these things have a way of dying and hobbling the grinder. Not exactly dying; the grinder still works, but it's not at all well. It whines, and the grind is uneven. I use a french press, so as long as the grind isn't too fine, I don't mind the uneven sized grounds. But my next grinder will be a different brand. This is my fourth Proctor Silex, and they've all done the same thing. This one wins the prize for earliest half-demise.",
        "Time for an update at about 15 months. The switch has mostly quit working. It takes multiple tries, and \"slapping\" to make it turn on. At $20.00 what could I expect? I'll try a different one next time and spend a little more. This unit is much quieter than our old grinder. I especially like the fact that the cord winds up in the unit after use. However it will only hold enough beans for about 32 oz of coffee. So, it's great for 2 or 3 people. If one needs coffee for a group, it would take 2 or 3 grindings for enough coffee to serve everyone.",
        "If you ground your own flaxseed than this is perfect for you. That is the only this I use it for other than grounding oats to add to protein shakes. This grinder will turn flaxseed into a powder which is just what you want to be able to absorb the nutrients it provodes. You can try using a mortar and pestle but this will ground the seeds in about only 10 seconds compared to however long other ways would take. I gave it four starts only because it is difficult to clean. What I found that works from another reviewer was to place a small chunk of bread in the grinder and it will clean almost everything out.",
        "I bought this as my first coffee grinder to use with my first coffee pot in my first apartment, and it does the job. It grinds the beans as fine as you want, just grind short for coarse or long for fine. Easy. It has a stainless steel bowl so it's easy to wipe clean, and I throw the cap in the dishwasher. The retractable cord is nice but I use this too often to retract it. I would recommend this to anyone looking for a coffee grinder on a budget, works as advertised.",
        "Love this product. I l like to eat fresh ground flax seed every morning, it lowers my cholesterol. The cord is easy to store so since it rolls right up inside. Also the button is easier to use than another top selling brand. The button is on the side. The other I used and broke had a button on the top. I like to turn the product upside down and tap in on the counter to make sure I have all the product out. Since the button was on the top of the other brand it broke. I do t have the problem with this one. Also I like the white color option. Great value.",
        "It was a good product compared to amount you spend. But after couple of time used suddenly it stopped working. so i had to retutn it. I believe electric item no guarantee. I got my money back right way even seller paid for ups pickup from my home which was great. I didn't bother to go outside for dropoff.",
        "Great little machine. It works every time without any problems. I use it not only to ground coffee but also my garden herbs. The cord winds directly into the base by just spinning the top. This makes storing it much easier. Simply drop in beans, put on top, and press the black button, holding it down while it grounds. When you release the button the grinder stops grinding. Easy to see thru top makes it easy to see if ground fine enough without having to open the grinder. Want it finer? Press the black button again. Why spend more when this one does the job well and consistently?",
        "this is really good for a casual coffee drinker. it is a bit messy, hard to open without it getting everywhere, but you figure it out. I would like for this to come with it's own soft bristle cleaning brush. Luckily I had my own. Will update if it does not last long enough.",
        "This little coffee grinder is just awesome!! I cannot get over how well it works for such a low price!! It's just amazing!! As the saying goes, \"you get what you pay for\", only this time I mean it the OPPOSITE.. because it's just way too low priced to work as well as it does!! It's also extremely easy to clean!! I don't have a clue as to WHY some reviews I read said it was hard to clean?? I just take a damp cloth and wipe it down inside and out and just rinse out the clear, plastic bubble top. It's THAT EASY!! I highly recommend this little grinder to anyone looking to buy a small grinder.",
        "I've been using these for a very long time. Unfortunately, in recent years the quality has dropped somewhat. One of the nice things about these is that the cord is retractable and you only pull out as much as you need. The newer ones do not have as much cord length as the older ones by almost a foot. In addition, newer ones tend to suffer from easy burnout. If you overload the chamber the unit will quit and never run again.",
        "So far, so good. I haven't used it for anything besides coffee beans so I can't comment on other spices. However, it does the job and it's easy to transfer the grounds via the grinder lid. I would just be mindful about not overfilling the grinder and you won't run into many issues. Clean up is also fairly simple ranging from a damp cloth or just a dry towel wipe (depending on the bean you're using). * I don't constantly retract the cord, but I have seen the user reviews on how the cord is getting damaged. I've just opted to keep it unraveled, since I use the grinder daily *",
        "I use it every day, and it works, everyday. Only issue was the plastic piece attached to the lid that you push on to turn it on came off. However it has a hook that still holds it in place, and I could glue it if that eventually breaks. Either way it's been functioning despite that break for a year+ so no big deal. For the price I can't complain.",
        "Used only for grinding coffee, which works perfectly. Cleans in seconds wiping with a paper towel. The black button detached from the lid after several washes, but it slides back on and does not affect the ability to use the grinder.",
        "I owned the E160BY Coffee Grinder for more than 2 years and it's still working. I ordered one as a gift for a friend that lives overseas and I received the E160BYR one. They look the same, I didn't realized that and gave it to her. I just learned that after using it 3 times, it stopped working. It will be to expensive for her to send it back and too late to bring it back to her in 6 month. I do not recommend this product and it's not fair at all to misrepresent a product or to send a different one to a customer. I do not recommend at all this product.",
        "Avoid this grinder: the lid is difficult to remove and replace after you've used it once. Once you've started grinding, if any coffee grounds get under the lid seal, when you try to remove the lid to add more beans, the lid gets stuck. Then the little push mechanism that you have to hold in to grind the beans popped off on the first use! Difficult at best! The cord is also extremely difficult to pull out and remove. WASTE of money!",
        "The button that activates is a detachable tab that detaches way to easily. It wound up missing after a couple of weeks. I have to jam a plastic knife through the slot to grind. They should have seen that coming.",
        "I got a new one because small plastic part under the blade broke off and was part of the blending but no more parts have broken off. So I continue to use the old one that I have had for many many years. The new one appears to be identical to the old one. Easy to use and love the cable that wraps around the base inside the casing.",
        "It's fine. I've had mine for use though have used it lightly. I wish the capacity were a little larger and that you didn't have to manually press in the button while grinding, but it's not bad for the ten dollars I paid for it.",
        "the capacity is very small, smaller than that of other coffee grinders of similar size. Therefore, to grind enough coffee beans for our 12-cup coffee maker, I need to grind 3 loads, which is annoying. The electric cord is super short, only 16\" long, which makes it hard for me to find an easy to access electric outlet without having to use an extension cord. Also, as some reviewers pointed out, it has a tiny, seemingly fragile plastic pin, which engages the motor switch. You need to be very careful while removing the clear plastic cover and putting it back on to avoid breaking the pin off.",
        "Pros: - Price - The cord, while short, winds back up into the grinder for easy storage. Great idea. Cons: - Coffee grains easily get on the outside of the grinder making it awkward to operate without thoroughly cleaning it after every use. - For some reason, as opposed to other grinders I've used, an excessive amount of grains remain in the grinder after pouring into press. Have to use a finger or spoon to get the remnants. A good idea would be to integrate some kind of spoon into the safety press switch.",
        "I’ve had this for 6 months and it still works perfectly. I use it at least once a week and I’d definitely buy again!",
        "Coffee from fresh ground beans became my luxurious item. I got a second grinder for whole spices. Still working good after many years of daily use. I recommend it!",
        "First: note that I have given this grinder four stars. For the price, it does a great job. However, after years of use, the insulating cord casing did eventually crack and expose the copper wire in many places. Be prepared -- at some point, this appliance WILL become a shock/fire hazard. I decided to replace the cord today, and it continues to grind like a champ, because other than the lifespan of the cord, the rest of the grinder is built to last.",
        "This little grinder does one thing well - it grinds coffee beans - beautifully! It takes 30 to 40-seconds to make fresh, fine ground coffee. The design is compact, construction tough and operation simple. It's easy to wipe out with a damp cloth after use (if necessary), but unplug first, and mind the cutting blade - it's razor sharp. The cord retracting feature is a great bonus feature, making storage simple and neat without an unruly wire to accommodate. My wife and I are delighted with it. I give it an unreserved 5-stars.",
        "I use it as a spice grinder. It doesn’t have He most powerful motor, is doesn’t have th most pulverizing blades, but it is small enough that the spices don’t just while around avoiding the blades. Your arms don’t get fatigued holding down the power button, and the interior is very easy to clean (wipe out the access and grind some rice if you used some really pungent spices).",
        "As someone who consumes flaxseeds daily, I am kicking myself that I did not think to purchase a coffee grinder sooner since milled flaxseeds bought at the store are not as nutrient rich as freshly ground flaxseeds. I have been using this daily for more than a month to grind up my flaxseeds and could not be happier. Don't use it for coffee since I am a tea drinker solely. I love this so much that if it broke down today after only using it for about a month now, I would have no problem buying another one immediately. HIGHLY RECOMMEND!",
        "Piece of crap. I had an older coffee grinder that finally bit the dust, so I replaced it with this, thinking that it's just a coffee grinder? They all work the same, right? Plus the reviews were good. It barely grinds enough, the coffee gets stuck in it, the cord winder gets stuck, it's obviously cheaply made, and two months into having it, it broke completely. Won't turn on. Total waste of money, and I'm puzzled by all the good reviews. Maybe I was spoiled by my older coffee grinder, but this one stinks in comparison. Very disappointed.",
        "i thought it would be a heap of...due to economic pricing, however it just continues to work, i waited to write this review for several months, i had purchased two, and had little confidence initially ...i use them for SPICE grinding, and making chai tea etc, one of them seems to have a little plastic-y smell when i run it hard, however it has not givin in yet..just keeps working. even if they joined the other side today...i'd buy another just like it...but i think u will like it, note...not large capacity. i would be looking for a larger one if i ground my coffee perhaps. hope this review helps. j",
        "Very small container so that making 10 cups of strong Peetś like coffee (2 Tbs per 5 oz) takes filling the grinder 3 times . . . yes fill it, grind them, dump into filter, fill again and grind, dump into filter and then do it a third time. My Krupp can do enough for a 10 cup machine in one fill. This cost me $8, so I will keep it and use it to grind spices.",
        "Loved it, I wish it crushed a little more at one time, still worth it",
        "I am pleased with this product. It is small, equipped with retractable cord for compactness, safety on/off button for better control and the stainless blades that grinds spices well. I use this in my kitchen for grinding black pepper and it works very well. I have not tried with other spices but looking at the comments of other reviewers, it looks like it could be used for many other spices. This machine is easy to use, just plug and go. Easy to clean with a cloth and it is reasonably priced. I have rated five stars for design, quality and overall satisfaction.",
        "I'm replacing it because it doesn't grind coffee fine the way I like it and a part broke inside. It's not the greatest grinder that I have had.",
        "My husband accidentally bought a bag of coffee beans instead of ground. I ordered this and now he prefers it over ground. Easy to use.",
        "The coffee grinder itself works well, but when I fill it with coffee and grind, it holds enough for half a pot of coffee. I have to grind two batches when I want to make a full pot of coffee. I hadn't really thought about the size of the grinder when purchasing. At times, depending on the coffee, I find that the grinds stick to the base and I have to scoop them out with a spoon. Overall, I like it and use it daily!",
        "This grinder does an excellent job with both coffee any sources and isn't too noisy. My main issues are that the lid can be a little difficult to open, which can lead to spills. Also, twisting the entire grinder like a pepper mill to retract the cord is not a great solution. I'd prefer spring loaded or even no wind up. I would definitely recommend this grinder.",
        "My Mr. Coffee grinder died, and I am much happier with this one. I love the retracting cord (all you have to do is twist the top and it fully retracts into the unit). Secondly, the design is better: there is no separate cup to take out and insert -- it is one unit. You simply add coffee beans, press to grind, then turn the unit upside down and remove the cup. Wipe clean with a dry cloth. I only use mine for coffee beans, so I cannot comment on its ease of use with herbs, etc.",
        "I have used the Proctor Silex twice as of now ,works well on such spices as Fennel and seeds of that size. The more grinding ,the finer the product so you need to watch closely . It is very quiet and cleanup is fast ,now need to wash etc. The roll up cord is practical and handy . I would recommend and thanks to Amazon ,people can depend on quality products at a good price. I would a product link .if I could figure out how! !!!",
        "I love this grinder. It works like a charm. For someone who is disabled, this makes it easy to grind coffee. My only qualm is that the cord winds back into the base of the maker when you are done, but if you don't turn it properly it gets stuck. So I took off a star for that, because the design for the cord is a little unwieldy. Other than that, this has been a perfect little grinder.",
        "I've had this coffee grinder for almost a year now and am very happy with it. It's true that it only has one speed, so if you need to vary the grinding time depending on how fine you want your coffee. Also, it helps to tilt it or shake it mildly while grinding to get a uniform grind throughout. People are complaining a lot about this grinder, but I haven't had any problems except the plastic button used to start the grinder came unglued from the cover once. Nothing a little gorilla glue couldn't fix. Wipe it down with a barely-damp cloth after use....",
        "Lots of these on the market. Find that this particular brand is convenient and lasts the longest overall. Does a great job of grinding coffee. Handy fill cup. Handy emptying features. Complimentary to my hand grip, too. Highly recommend this Proctor Silex Coffee Grinder.",
        "This grinds coffee just perfectly for my use. I like to grind fairly fine because I use most often the Aeropress. A couple of scoops of whole bean (using the Aeropress scoop) and this perfectly grinds into fine in about 3 seconds of button-press. It's lasted for nearly daily use so far, and is very easy to clean. One downside, that I won't deduct a star for, is that the motor emits a slight ion/burning oil/mechanical smell. Reminiscent of old drill motors. But I only smell it if I've got my nose near it.",
        "This item is exactly what I wanted - a small capacity grinder that doesn't take up too much counter space. I LOVE the retractable cord...and this retractable won't break because you retract it manually (you twist the two pieces of the grinder. If you had one of those push buttons retractables, then that would be one more piece of equipment that would be prone to failure at some point. The motor is strong, and it works really well. I use it to grind hard cat food for my toothless cat!! I also would recommend this for spices and nuts, and if you are only going to grind enough coffee for one or two people.",
        "A very good coffee chopper. I took off one star because coffee powder accumulates between the lid and the body and makes it more difficult to get the lid off and to put it on all the way. I've learned to tolerate the slight difficulty. Overall a very durable and consistent product.",
        "This coffee grinder is perfect because it grind the perfect amount of coffee for my 4-cup coffee maker. It works in 10 seconds and is so easy to use. I will never go back to buying ground coffee because using the grinder makes each pot taste so fresh. I now love buying the whole bean coffee, its been fun trying different kinds.",
        "It worked very well for the price but has a small volume. Since it is only myself and my wife it works okay, but if we have company over then we need to grind 2-3 rounds to get enough coffee grounds for the group. I do really like the fact that you can retract the cord.",
        "This is being relegated to my be spice grinder, which I don't use every day. I don't know what it is about coffee grinders in general that they tend to \"throw\" grinds when you try to empty them (I'm pretty it's static build-up) but this unit tends to be extra effective at creating a messy counter compared to the other brands, maybe it's the dome shape. The one nice thing I noticed though is that you do see the grounds create a moving swirl pattern and it tends to be able to create a much finer grind than the others.",
        "It gets the job done sufficiently since I'm not picky about having a fine grind for my coffee. Every time I've used it, no matter how little or how much I put in, there were always a few pieces that reminded chunky and didn't grind. But again, I just want my caffeine fix in the morning and it does well enough.",
        "Purchased this as a second one; I've had one for years and it's worked great. We got into grinding spices and so I wanted a second so that my coffee grounds & spices didn't get tainted. I will say, the one I bought does feel a little cheaper as far as build quality compared to the one I've had for several years. The rotating top (which you operate to retract the power cord back into the base) doesn't feel as firm as the other one I have. Apart from that, the actual grinding capability is still the same. It's very easy to clean and does the job.",
        "When new and blades are sharp this grinder does a fine job. Only handles 1/2 of beans to grind w/o problems. Find this grinder easy to use with one hand and not requiring a countertop to steady it. Like how the cord can be stored. Within a year of twice daily+ use the dull blades make for an inconsistent grind and it needs to be tossed.",
        "I use this more for grinding up spices than coffee, but it works great for both! We have a french press, so when I am grinding up beans it is for that, and the grind is perfect for a french press. I was worried it'd be too fine, but there are no grounds in the cup and the press is never clogged. I grind up some rice in it after and it's ready to go for spice or coffee after. It's not too loud and I love the wind up cord for easy storing convenience. It was pretty cheap and still going, so it's great!",
        "Quit working after second use, but after the warranty had expired. Motor just stopped while in use and the unit was warm to the touch. The details of the return options indicate it costs about twice as much to send it back. It's made by Hamilton Beach even though the Proctor Silex name is on the box.",
        "Great little grinder with good power for its size. Since I'm not much of a coffee drinker I got this to grind spices at home instead of using packaged ones. Works really great! One thing to keep in mind is since it's so small, the quantity of stuff you can grind at a time is small. The absolutely major drawback though is that's its hard to clean since the blade doesn't come out and you obviously can't immerse it in water. Oh, last thing, the cap is delicate, mine has a crack in it after one drop :(",
        "I bought this based on others' reviews and because it was cheaper than other brands. My previous grinder, a 'Mr Coffee' stopped working. I use it to grind flax since flax needs to be ground for the body to digest it properly. It works great and I love the fact that the cord rewinds. It is 'bullet-shaped' and is a little sleeker than Mr. Coffee, especially with the cord stored internally. I've only had it a week or two so time will tell how it holds up but so far so good.",
        "I do not like this unit as much as my old one. The top has been changed, and the little catch seems very flimsy. I suspect it won't last the seven years my old PS unit did. It grinds OK, but just OK. For the money, it's a fair deal. UPDATE, 12/17/15: I have added a star to my rating. This unit is doing a very good job of grinding coffee and spices. Still feels flimsy, but we'll see how long it hangs in there. The retractable cord is cool.",
        "I little grinder works great for grinding my spices. I really like that how the cord winds up discreetly in the device. I like it more than the other ones that I have used just because of that... to many cables hanging out in my cabinet gets messy.",
        "Quite, small, fast grinder. No speed selection or timer, and you have to hold the button down. But it takes just seconds to grind. Filling it up entirely gave me enough for about 3 cups of coffee. I love it, I really do. I don't care for speed selection or timer. I can \"pulse\" with my finger, and let go when I choose but I don't have to hold down for more than 10 seconds before it's done anyway. Oh, and you spin the top around to pull in the extra power cord! Very cute. Very quite. Has held up over daily usage. No complaints!",
        "The best thing about this cheap coffee grinder is the retractable cord. The container doesn't hold enough beans to brew a full 12-cup pot of coffee. The trigger to run the blade has already fallen off once. (I was able to put it back.) It is reasonable quiet and chews up the beans in quick order. But I certainly would not recommend it.",
        "I've been using this grinder for 3 years now. I don't use it for coffee, so I can't speak to that. I mostly use it for grinding spices. It is fast, efficient, and fun to use! I actually really love that the cord retracts into the base. It makes storing the grinder much easier. Great product for the price!",
        "This is a great size for personal use. I can try new and different combinations. It's easy to clean. The cord tucks away inside itself. It's not heavy and fits perfect in the cabinet. It takes up no more space than a pub glass. I really like it. I am the only one who drinks coffee in my house until my in-laws all visit and it's nice to have the different coffee for different people. There really isn't anything like the smell of fresh ground coffee coming from the coffee pot.",
        "I decided to start grinding my morning coffee just because of how much better freshly ground coffee tastes. This little grinder is very well made. Just a few taps on the button is all it takes. A couple coworkers have coffee grinders in their sections, and this puts them to shame. You can't grind anything without making some noise, but this is the quietest coffee grinder I ever heard! The retractable cord is a really nice touch for when you're done, and can place it back into a cupboard.",
        "Coffee sticks to the stainless surface unlike the other grinder I own. However, the convenience of the wind up power cable makes it number 1",
        "I like this the LEAST of all the grinders I've used over the years. The design has a weird way of fitting the cover to the bottom of the device. It has a white thingie that's difficult to release when you want to open the top to access the coffee. I struggled with it so many time I finally gave it away and bought a different design, w/o that crazy white plastic \"tab\" thing that keeps it closed. I shouldn't need to fight with it to get it open after grinding the beans. Good luck!",
        "I have two of these. One at work and one at home. Makes the perfect amount of ground coffee for three cups which perfectly matches the amount for most French Press coffee makers. It's extremely efficient and surprisingly quiet. I've been using the one at work 1-2 times a day for 6-8 months now and it's still going strong. I love that the cord wraps into the grinder itself making for really simple storage. I highly recommend and will continue to purchase this product.",
        "I bought this not for spices or coffee, but for cellophane gift wrap to make my own glitter flakes. This puppy works like a dream for that application. Small size allows for storage in my craft drawers and would honestly look good sitting on kitchen counter if I used for consumable items. Decent power to it without being overly noisy. Would recommend.",
        "It's a little odd. It's hard to put my finger on. I think it is the slant of the well that holds the beans. It grinds well but the dust gets all over the lid and my last one had a deepest flatter well and didn't do that. It cleans with a damp cloth well enough though and if you want a nice looking black coffee bean grinder that does the job this fits the bill.",
        "I expected a basic coffee grinder. I am disappointed, I cannot use it for coffee, even if I shake it hard the grinds come out unevenly ground. For spices, it does a decent job. It's just ok. The plastic is weird, it tends to be a magnet for dry spices or coffee grounds, and the grooves that connect the lid to the machine tend to get easily dirty with grinds and jam the lid a bit. I would recommend going with a better one, this is barely acceptable.",
        "I just love this grinder. It's so easy to clean, pulse control lets you grind anywhere between coarse & fine. I love how the cord winds up into the bottom of the unit. After grinding just turn the unit upside down and remove the clear cup which holds the grounds. So simple. Glad I researched and found this one. It's great for grinding flax seeds and spices. Update: I have had this grinder for almost 3 years now and use it daily and it is still a great dependable machine.",
        "I make French press coffee, so I don't grind to fine, just coarse. This little machine works perfectly.",
        "I feel cup size is smaller than expected .. takes kore time to grind small amount of spices",
        "Works just like they said and all the things said about it are true",
        "Grinds coffee beans and makes breadcrumbs effortlessly.... Original one lasted 10 years but something (cant remember what now) brought it to it's knees...",
        "Works great. I would have liked it in black so I could leave it out on my counter but other than that I am very pleased. Gives me finely chopped or chunky coffee. Ive read some reviews where you have to shake it in order to get the finer grounds, but Ive had to do that with every grinder Ive used. Doesnt bother me. Super easy to clean to. I just wipe it out with a dry paper towel.",
        "I got this to grind whole beans for my espresso machine. It works great and is easy to use. Very happy.",
        "I wish I hadn’t given it to my nephew after I’d had it for several years! Now I need to get myself another.",
        "Have had a proctor silex coffee grinder for a long time. They do the job pretty well. No bells and whistles but it will grind the coffee beans for you. I like that the cord twists into the base of the machine. The cord on my last grinder was such a pain because there was no way to secure it and it was unattractive just wrapped around the base.",
        "Per other recommendations, figured this would be OK to grind Orijen puppy food for 4 month old Yorkie for a few months. It worked well 10 times, using the hint of one poster about shaking during the grinding. I ground 1/6 cup at a time. Today, however, one of the blades bent at the circle, and I had to throw out more pet food $wise than I had paid for this grinder. Back to my Krups grinder, which has ground everything nicely, no problems, for over 5 years.",
        "i use this to grind coffee almost every day and it works perfectly. i find coffee has more flavor and tastes a lot better when its freshly ground. it takes about 7 seconds to grind up enough beans for half a pot of coffee. i love that the cord winds back up into the grinder you just twist it up and its a lot easier to store. i paid full price for this item",
        "this little thing is awesome! I picked it for its size, and ironically the only con I have is the amount you can grind. Its about two and a half k-cups worth per grind if you really pack it in there",
        "This product worked well while it lasted. After two years of use it simply stopped turning on. I took it apart and blew out all the coffee dust that had accumulated, and it had started working again briefly, only to die and never be recovered again. I gave this product one star because i'd expect such a simple motor to last if it was made with quality.",
        "This grinder was purchased as a gift for me over 5 years ago. Since then, it has been melted on the bottom, from being too close to the range, and dropped repeatedly on the floor to the point that it is held together with duct tape. Unfortunately, as long as it keeps working I am not allowed to replace it. Maybe in another 5 years.",
        "It grinds very well and I just love the twist and hide A/C cord. If only all appliances were design with it.",
        "Pretty good but the part that you push to start the grinder falls off a lot. It is easy to put back in place, but there is a danger of another family members loosing it. Mine is currently lost for about 2 weeks now. Don’t know if I will find it again or not. The fix is to break a round toothpick in half and use the flat end to start the grinder every time you use it. It will fit in the hole perfectly. A small nail may do the trick too. That saves you form having to buy another grinder.",
        "The amount of beans this grinder can grind at one time is limited because the size of the hold is quite small. I had assumed the size was standard on smaller coffee grinders, so that was my mistake for not reading the description better. If I were looking for a grinder for spices, this machine would work quite well. Pulling the cap off was difficult for me as I have a little stiffness in my hands and there's not much to grip.",
        "The piece of plastic that is used to push start and stop came off.",
        "I use it to grind spices, nuts, and seeds 2-3 times a week. It doesn't grind the spices, nuts, or seeds up evenly. By that I mean that some of whatever I grind will be powder and some will be granules. Despite this I am happy with it. I love the retractable cord. The noise level isn't bad either. It's easy to clean. I use a damp paper towel and sometimes a dry old toothbrush to clean under the blade turner. I feel I got my money's worth.",
        "I really like this for grinding coffee beans. It is small enough yet large enough to grind the amount of beans for the servings we use daily. It is easy to use and easy to store. It also grinds nuts but does so a little to fine for me.",
        "Why haven't I bought this before?! I use mine as a spice grinder! I dry my own spices, and i can have a little or a lot in there and it still works perfect! The cord wraps into the unit, so taking out to grind some spices quickly, and then putting back in the cabinet is so easy! Since the cord goes inside it does not take up much space at all... I keep it in the spice cabinet! I could imagine it would be good for grinding coffee, but probably just enough for 1-2 cups of brewed coffee",
        "Became a spice grinder in our household. Up to this point, I had used a mortar and pestle for many years. Now I wish I could have the time back I could have saved using this grinder.",
        "This helped in a pinch when our coffeemaker with grinder was damaged. it works great, but it's messy - when you take the lid off, ground coffee spills out...so do it over the sink!! It's a totally usable product, but I got spoiled by the coffee maker with grinder, so we ended up re-purchasing that.",
        "Well, it works. I've had it for several months now and it's still functioning. I don't use it every day, but I do use it from time to time to grind coffee beans or flax seed. It works. I mean, the grind isn't always even, and I'm waiting for the day when it decides to just give up on me, because it doesn't give of the most hardy impression. But it's still there, getting its job done.",
        "I'm an avid coffee drinker, and this is used many times per week. I also love to cook, and have been (unsuccessfully) attempting to grind different spices to a finer consistency. It ground my fennel perfectly! I love that it also has a cord that winds nicely up into the base for neater storage. Nothing fancy, but just perfect for us!",
        "This coffee grinder has served me well as a pepper grinder for my dried habaneros. It is nothing fancy, but it does the job well, and is a very fair price. It can be a bit cumbersome to clean, but since it has one purpose and on purpose only (to grind peppers), that doesn't matter much to me. I needed a separate grinder for peppers alone so that I didn't kill my husband with his coffee, and this item works perfectly for me.",
        "I use it primarily for flax seed grinding. Cleanup for flaxseed is best done by wiping the clear top & grinder parts with a tissue. I've tried coffee and it is fine for that also but cleanup is more messy. It also works very well & cleans easily if you need to grind a lot of pepper corns (more than you would want to grind with a pepper mill). The power cord unwinds easily from the bottom of the grinder by pulling and winds back by twisting. It is surprisingly quiet. I've had it for a month and so far I like it.",
        "This is the best grinder I've seen in a long time. I actually purchased this to grind fish food but it works great. The size is nice and compact so it's not another huge gadget to store. It has a cord that can be pulled out from the back and pushed back in for easy storage. Everything comes apart easily and without difficulty. I was able to grind up the fish food in seconds. Definitely reccomend this for pet food care and coffee use.",
        "I kept staring at it to make sure it was working because it operates so quietly! It sounds more like a whisper than a grinder. Love that! The only thing I don't like is the retractable cord, or how you operate it. You can pull it out, but you have to twist the top to wind it back up, and you have to work with it a bit if you pull the cord out too far. I wish it had a pull release, but that's just my preference. Overall, it works perfectly well. Easy to clean, and did I mention how quiet it is? WOW!",
        "This grinder is pretty small so be fore warned, but it is what I expcected. It really is a great item. I really like how you can wind the cord up in the machine by just turned the top of the head. Also we did not have a cheese grater at the time so we put chucks of swiss cheese to see how it would do and I was very impressed. It turned swiss cheese into dust. This thing may be small but has a great deal of power. Very happy with it",
        "This grinder works great! I use it with my new french press (purchased at the same time). It seems really sturdy, and I have had other small kitchen appliances from Proctor Silex and they definitely last! I have no doubt that this will too. It's really easy to clean, and that is always a concern of mine since I don't like to spend a lot of time in the kitchen. The directions are clear and work as written.",
        "We bought this coffee grinder for our office since it got great reviews. It worked well for a few months, but it has since stopped working well, and I suspect it will soon stop working at all. It looks like the grinds accumulate inside the case, and since the screw on the bottom needs some kind of triangle tool to open it, we can't get them out. We have to shake the case into the garbage, roll the cord in and out, and do crazy maneuvers to try to get it to work in the morning. Not recommended for ongoing use.",
        "We just needed something cheap and small to grind our beans every morning. We've had this for almost a year and it still works great! There have been times where it came loose or a bean got stuck under the blade, but it was an easy fix. We are buying a new, bigger/better one in a few months, but this little guy is perfect for two people grinding beans each morning! Super easy and fast too! Only need a few seconds!",
        "This coffee grinder is FANTASTIC! It has a retractable cord, is super small and easy to store, and grinds the coffee beans perfectly in about ten seconds. This is the perfect coffee grinder for me, because I'm the only one in the house that really drinks coffee; with that being said, I wouldn't recommend this to someone looking for a large coffee grinder, as this only grinds half a cup's worth of beans (about six cups of coffee). It is a great coffee grinder, though! I definitely recommend this to anyone looking for a cheap, efficient, space savvy, coffee grinder. :)"
    ]
}