{
    "entity": "Manual Grinders",
    "text": [
        "I used daily, sometimes twice daily. After roughly 2 months of use the plastic grooves that hold the base on cracked. My hands are big and larger than the rubber grip area, not sure if that contributed. Maybe if the base had a different style of attachment it would have lasted longer. I love my Bialetti Mocha pot, but can't recommend this grinder.",
        "What an excellent product! It does take some elbow grease but then, you should expect that from a manual grinder! It is easier after using it daily for a few days. The long handle and large knob make it smooth to use, easy to fill with beans and to remove ground coffee. The grind is even and perfect for my moka pot! It takes me about 1.5 minutes to grind enough for my 6-cup moka. So pleased with the grinder and the value!",
        "You have to mess with the settings to get the grind you want. The instruction for this are also really cryptic. I It took me a bit to figure it out but it's not that hard. Wide open for coarse, fully closed for fine grind...everything in between you have to kind of figure it out. The really good think about this mill is that it is as uniform a grind as I have ever been able to get. I've ground for moka pot and for pour over without any issues. Update: Came to buy a second one for work and they aren't selling it at the moment! :(",
        "I had this exact model, in my office for 6 years. It worked flawlessly until I dropped it, and the bottom would no longer lock in place. The grinder continued to work in spite of my carelessness. I ended up just pulling the trigger and replacing it with a new one, since I had such a good experience with the original. Unit itself has adjustable grind, and can hold more than enough ground coffee to make coffee for 2-4 people. Adjusting the fine/coarse setting is simple and well marked, and the rest of the function is self explanatory. I've bought this unit twice and am considering buying another for my house.",
        "Could not be more disappointed. We have Bialetti Moka coffee pots which are incredibly durable and used every day. This item is very poorly constructed. The plastic threading where the top piece screws into the bottom has cracked after 1.5 months, and the rubber grip slides down over the cylinder while you are trying to use it. I am not able to return it, as it is past the return by date (?) so I have no other recourse than a poor review. Very frustrating. Without a doubt, my least positive experience yet with Amazon.",
        "Our first bialetti hand grinder got dropped and broke the part that the receptacle attaches to, so we purchased a second one. The zip tie around the 'lock' is the perfect fix/ prevention for this! We grind our coffee every morning to use with a French press. I think we've had this style of grinder for about 2 years, and it takes me about a minute to grind enough beans for 32oz of coffee. Which I don't mind at all.",
        "I really wish the middle connection was not plastic. I always have to really make sure to be careful when grinding whole beans. It doesn't feel quite flimsy, but there is more to be desired. Great adjustments for coarse to fine grind.",
        "My second one so far. Tried a different type & was disappointed. The Bialetti grinder is well made. Last years, even with daily grinding. Grind size is consistent. Only drawback is the grind size adjustments. However, that's offset by the micro adjustments it offers.",
        "Easy to use and comfortable to hold. Seems sturdy so far. I've used it to grind coffee for my moka pot (fine) and Turkish coffee (extra fine) with good results - but it can do coarse grind as well and everything in between. Definitely takes a bit of muscle to use, but I guess most hand grinders do. If you're only grinding for one or two cups at a time and you want a grinder that is adjustable and can do a variety of grinds, I would recommend this one.",
        "Seriously, I have very limited hand function and I’m able to use this grinder 100% independently. I love it! And it grinds extremely evenly, unlike my electric burr grinder by Mr. Coffee",
        "Not at all happy with it. It broke and I ended up tossing it. It was too small and hard to grind coffee. I would not repurchase it",
        "Hands down best grinder. You will spend ten times as long turning the lever with any other grinder. And you only need to dial in the adjustment a notch once every couple of months to maintain the same grinding consistency.",
        "I loved it, it's cute. But to hold it so stays put, very difficult, harsh on your hands",
        "Grinds beans for 2 cups in less than a minute. I have purchased a few Coffee Grinders, and this is The Best.",
        "Beans go in the top, coffee comes out the bottom. Can't ask for much more than that.",
        "The grinder works great. I use it almost every day. I set the coarseness by simply turning the adjustment, three pronged wing nut, two thirds of a turn from the closed position. I'm just making stove top espressos, so I never need to grind a lot of beans.",
        "Great way to have fresh coffee. I wish it was glass to not absorb falvor into its plastic shell",
        "Base broke off after only two months of use. I was even holding the grinder by the black section to reduce stress on the thin plastic that attaches the bottom to the top, because I had read another review describing the weakness of the plastic.",
        "This is my 3rd try at a manual grinder, I've been using it daily for about 3 weeks and am pleased. The other grinders that I've tried, if they work, take A LOT longer to grind the beans. I am able to grind enough for one cup in less the 5 minutes. I like that it's clear so I can see how much has been ground. The rubber grip in the center makes it comfortable to use. I've taken it apart one time for cleaning, and it was an easy task. The only con is that I have not been able to get it adjusted tight enough for a Turkish grind.",
        "Only lasted 4 months. As many others have said, the plastic connection between the top and bottom chambers is weak and eventually snaps off and cannot be repaired. I used it about 4-5 times a week for 4 months. A piece broke after about 2 months of use and I super glued it, but ultimately it completely broke off rendering it useless. It's a shame because it does a great job, but I can't recommend it. You'll just be throwing your money away.",
        "the burrs on this are impossible to align and result in uneven grounds. Also the amount of time and muscle this thing requires is completely unnecessary. If I wanted to spend 20 minutes grinding coffee like I lived in the 1200s i'd rather use the Hanground precision grinder or a vintage Zassenhaus (Orphans grinders are for the rich and senseless). Use a blade grinder and save up for a refurb Caspresso Infinity or a Baratza Encore. This is NOT WORTH IT. p.s. I still think moka pots are fantastic though",
        "It works great. The adjustments are easy to do you can make any grind type. Update, after using this for about a month, the lip cracked where the top joins the bottom,, a friend supser glued it back to gather and the glued piece held together but then after another month the nibs that hold the two pieces together are worn away and no longer works I am a two cup a day user. Don't waste your money unless your only going to use this for special occasions.",
        "A burr grinder that works this well for this price is amazing. Sure it's a bit of work as it's manual crank, but grind is even and for my French press it's simple to measure out beans for one pot and grinding them takes about a minute. Love it! As others have said, hold it in the center, don't rely on the threaded bowl connection by holding it at the bottom. Once you set the grind for coarseness you're all set.",
        "I thought the hand-cranking would be fine, but it's AWFUL. Don't waste your money--for just ten dollars more, I eventually got the Cuisnart DBM-8 Supreme Grind Automatic Burr Mill (electric) and it is the most amazing grinder we've ever had! This manual one is awful to use, no place good to hold it, and getting enough coffee for a pot takes forever.",
        "You need to grasp this by the top half to avoid the risk of breaking the bottom. Other than that, good product.",
        "The best manual burr grinder on the market! Works great and highly recommend for those French press lovers.",
        "There isn’t a minimum or maximum grind setting, but it does produce very uniform grinds. Works very well.",
        "This thing is kinda tough to use, but gets the job done. It's easy to adjust the ground size to make espresso or pourover or drip.",
        "My coffee has never tasted better. So handy to take with my French Press anywhere I go. Love it!",
        "This was a great grinder - while it lasted. I had the same problem another reviewer detailed - the small plastic tabs which secure the upper part of the body to the lower reservoir (where the grinds are collected while you're grinding), snapped after six months of use. That doesn't seem like onerous rent for the device, but it's clearly a known issue/design flaw so I'll replace the Bialetti with another model. I was happy with it while it worked, though and it definitely contributed to a better cupa joe...",
        "Love it. Easily adjustable and very consistent. Takes about 1 minute to grind a whole batch.",
        "I really like it... You can have more control of the grind process but I feel they can improve...",
        "I’m lazy so I found an attachment for my drill to fit it. If you go full power you will melt the plastic but if you use common sense it is wonderful. I bought one for my pepper at work and I have had mine for the house for more than three years and the plastic just cracked due to not cleaning the coffee out of the two threads",
        "For a hand grinder, it does a very good job. From a fine grind for moka pot to a coarse grind for french press, it does very well. This is my second grinder; the first I returned due to the connector tabs cracking as mentioned in other reviews. What I think is that if you grind with the grinder resting on the counter or other hard surface, the downward force while grinding will cause the tabs to break. However, after 4+ months of every day use, while holding the grinder in the air in one hand and grinding with the other, I've had no problems.",
        "Been using this burr for over a year now, and I love it. No cracks or stress marks in the plastic. Makes the perfect grinds every time.",
        "Same problem as others have noted - connection that holds bottom section to grinder cracked after about one year of use.",
        "Have used it for several years without an issue. Not sure what people are doing to it to to break it with minimal use as reported in other reviews. Has held up very nicely and is a great companion to my Aeropress.",
        "Pros: Great grinder, nice capacity, quick and easy coffee grinding for my french press. Cons: Locking tabs for the bottom container broke after 6 months of use. No instructions for proper disassembly and cleaning. Edit: the replacement grinder broke after 7 months of daily use.",
        "The plastic clips will crack the base with regular use. Do not recommend. I did not notice any uniformity issues, but expect it to last less than a year.",
        "This product is impossible to use. I'm a pretty strong person and it took me fifteen minutes to grind my coffee. It is very difficult to grind.",
        "Maybe I am just not tuned in to how slow a manual grinder is, but this thing is really time consuming. If you brew more than one or two cups per day, be prepared to spend a while grinding. Also, the blades appear to contact the plastic surface inside of the grinder. I don't know if plastic is getting shaved off or not but the sound makes me think it is possible. I'm returning this to where I purchased it (non Amazon).",
        "Worked great for 6 months until the bottom lock tabs cracked. Just as others have mentioned, the stress on that tiny area is too much. I can still grind with it but it's a pain in the buttocks.",
        "5 STAR the BEST hand grinder. I bought, and stored away, 4 other manual grinders. TOO SLOW. Took forever to grind enough for a cup much less a pot. They had small burr grinders ... crank crank crank etc. This one is great... and brings real joy to handgrinding your roasted beans.",
        "As others have mentioned, the bottom ground coffee receptacle is attached to the grinder with a brittle plastic \"click and twist\" connector. This cracked within two months of light used. I taped it and got a few more months of use, until the plastic flange broke off. There's got to be some daydreaming millenial over at Bialetti headquarters who reads Amazon reviews and can suggest a design change, no? Hey, I'm talkin to you, Lorenzo. Capiche?",
        "I've only had one manual grinder, this one, so I'm unsure how it holds up to others. Though it's made in China, the construction is solid and sound. It works excellent, it's easy to adjust, and it looks handsome on the shelf. I use this grinder for pour-over and the bialetti moca express pot.",
        "It grinds the coffee wonderfully, until it cracks where the bottom attched to the grinder. I would give it a 5 star if it lasted more than a month."
    ]
}