{
    "entity": "Handsaws",
    "text": [
        "Before \"experts\"start complaining about my 5 star rating,I'll admit that there are better Japanese saws out there,..but I,and many others ,can't afford them or dont want to risk the money untill they know what their getting into.If that is the situation (as it is for me) these saws are the perfect starting point. They are extremely thin and sharp.Once you get used to cutting on the pull stroke, very high accuracy is possible with very little waste and cleaner cuts than I've ever seen from a hand saw. The afforably replaceable blades are held firmly in the plastic handle by a large plastic screw that has worked perfectly so far. Would I recommend this to a freind? I already have.",
        "I used this to make a cage for my guinea pigs. I wanted pocket hole joins but needed the surface flush and waterproof-able. This was easy to use on pocket hole plugs and fits in tight spaces.",
        "Very sharp teeth! Great for what ive had to do with it, however, be careful not to bend too much because the teeth are brittle and break easily.",
        "Took me a bit of practice but now that I'm used to using it, I've found it works great for cutting wooden dowels to size for my macrame projects.",
        "I bought this saw to flush-cut about 100 oak plugs in an oak porch swing. Because the teeth are offset to both sides, it's impossible to hold the saw flat for a true flush cut. I ended up making a pretty big mess out of the first 10 or 20 plugs that I cut. Finally worked out a technique that wouldn't tear things up too bad but had to do a lot of sanding when finished to get rid of the gouges and scratch marks. Should have been more patient and ordered the Veritas Flush-Cut Saw elsewhere...",
        "This is no high quality Japanese Style pull saw, but for a low price it is sharp and the blade seems to be of reasonably good quality metal. The plastic handle is a bit on the cheap side but very functional and not surprising for a tool in this price range. Overall I think it is better than average for the price ad since a pull saw is very handy for a wide range of cutting tasks,especially when working without a vise, it is well worth the price for my needs. I even use it for rough pruning of larger bonsai tree branches on my Oak trees and it works well for that.",
        "Huge fan of Japanese pull saws. This is a fantastic pullsaw at a most economical price point. Excellent Value. You wont be sorry.",
        "Smooth cutting little brother to the larger pull saw. The flex of the blade took some getting use to. My usual ham-handed approach of letting the tool do the work does not apply here. Use requires careful attention. Once familiar, I was able to make nice clean cuts on smaller 1/4\" thick stock.",
        "But it IS a little saw. I made some lousy dovetails, but I think that is me and not the saw. It's great for flush trimming, cutting dowels etc",
        "I had one of these a few years ago and loved it, but I lost it somewhere. Finally gave up hope and ordered a new one. Cuts through wood very easily, like no other saw I've used.",
        "Overall, this cuts as I would have expected. Not my favorite saw by any means but, for the price, it does what I would expect it to do. That said, I have noticed that, on occasion, the red plug that tightens against the blade to hold it in check can come loose so be careful that you check that it stays tight from time to time.",
        "You couldn't cut your way out of a cardboard box with this poorly sharpened saw.",
        "I was looking for a saw like this for years. Very good.",
        "Not good for dovetails at all. I'm a novice woodworker, and am learning to do dovetails by hand. I bought this saw, hoping to use it for practice. It's much too flimsy and slow to be of much use when cutting dovetails. I'm sure it has other uses, so I'll hang onto it, but the cuts take forever, and the blade is so bendable that I can't guarantee a straight cut.",
        "A very useful and effective \"pull saw\". I've had one for years, and it has stayed very sharp. Light and easy to handle, the saw takes a very thin slice of wood. It's also easy to get straight cuts. I loaned mine to my son, and needed a replacement. An extremely useful tool.",
        "ok, its sharp. for cutting off small things like dowels it works fine. for trimming off larger peices, like thick edge banding it can be tricky for getting a straight cut because the blade is so flexible. as for cutting dovetails with this... good luck. it will flex too much to get really straight cuts even using your finger or piece of wood to guide it. it would be good for cleaning cuts & corners out though.",
        "Love this saw. so sharp and so useful for trimming dowels flush and doing quick cutting jobs. the pull actions really helps keep things steady.",
        "It is a small blade but it is so very easy to use and works well for small projects but it even cuts larger pieces of lumber if the wood is soft. Great help for small projects where you want a smooth cut. I haven't tried taking it when I am trimming small branches but since it is portable I will likely take it with me one of these days even if I do wear out the blade :-)",
        "The blade seems sharp to get the job done. While it is advertised also as a dovetail & detail saw, it works best for flush cutting dowels. If you plan to do Dovetails and similar work invest in a dedicated dovetail saw because they are reinforced across the top, unlike this one. When I tried cutting a few dovetails with this saw it bent several times resulting in a crooked & crinkled blade.",
        "This is my second one of these to buy. I wanted one inside at my desk and one outside in my shop. It's great for cutting dowels",
        "Good little saw. Would give five stars but I wish the handle was slightly offset to get it out of the way for tight flush cuts. I do like that I can replace the blade when it’s run it’s course.",
        "This my second Shark dowel saw. They work great, cut fast with very few scratches, especially when new. The teeth were still plenty sharp on my old saw but I managed to twist a few teeth so it wasn’t cutting as cleanly as I liked. Operator error not a product defect.",
        "I bought this for my husband for Christmas. It's lightweight and does the job quickly. One night my 2 year old decided to stick her head between our stair rails. My husband was away with the military. I found this saw and was able to saw my rail in half in about 5 seconds....now to find some decent wood glue :(",
        "Works great and fabulous price. I use these for pruning my plumeria. So far this one hasn't rusted as fast as the Irwin saw. Maybe I've just maintained it better.",
        "A flexible pull saw is a real blessing when cutting off plugs, but the extremely thin kerf and easy action makes this saw my go-to for all close cabinet joint work. Easy to learn control and natural motion, it slices through even teak and eucalyptus like butter. At this low price, you'll be amazed you got along without it as long as you did!",
        "If you just need a cheap saw for flush trimming this will do fine. If you are hand cutting dovetails, splurge and get a good Veritas back saw, I would recommend 14 tpi. The kerf on this saw if too fine and the blade is to flexible leaving you frustrated.",
        "This is not a flush cutting knife this put groves in wood. NOT A FLUSH CUT!!!!!!",
        "This is a good saw, but I really don't have too many uses for it. I think someone else said - how often to you need to cut a dowel from a smooth surface? For what it is, it is really excellent though - sharp blade, very flexible, etc. Every time that I do grab for it, I am not disappointed. Cutting on the pull stroke seems to give extra control.",
        "I was replacing the baseboard trim on a wall and sprayed spray foam into the holes under it to act as a better seal to the pet stained odors coming from inside the wall. This worked great for cutting the excess foam flush with the wall such that the new trim went up nicely against the wall.",
        "Modern replacement of a classic saw. Fine enough to cut laminate w/o pulling and splitting the finished edge.",
        "It's not exciting, but you'll never have to worry about it. This saw does a fine job, cuts smoothly enough, and can be thrown away when it dulls. For the price it is a fine addition to the shop. Just don't confuse it with a premium tool. I have used it to clean up several through tenons and dowels and it's still sharp. I'm satisfied.",
        "This saw is hard to beat for the price. It allows you to make very precise, small kerf cuts with surprising speed. I don't think it's an every day kind of tool for most people, but this is so inexpensive, and high enough quality that I would recommend it to anyone that's at all handy.",
        "I own many of the Shark range of saws, and each is an awesome tool. Ultra sharp and hold their edge well. Pull saws are much easier to use than traditional western-style push cutting saws. This saw is equally as good and with a flexible blade is betetr suited for smaller detail cuts. Very happy with saws fast cutting ability which also leaves a nice smooth edge.",
        "Super sharp, flexible blade, and worth every penny. I bought it for my 8yo son because he wanted a dovetail saw. Once I got it, I kept it put up because it's so sharp. It was the perfect saw for flush cutting a door frame with the existing drywall. Would recommend to anyone that looking for a nice and sharp flexible back saw.",
        "Small, light, but incredibly sharp. The flexible blade made even the awkward-angle cutting easy.",
        "Like a hot knife through butter. Needed to do some precision cuts on wood that was already installed in a wine cellar - This is a great saw",
        "Love this thing while working on wood, it's very elastic in changing shape and super sharp, very fun to work with and cuts any shape you want quickly.",
        "This Shark Detail saw is the best hand saw I've found. I use it more than I use any other hand saw, and it has replaced many jobs that used to be held by my jigsaw and reciprocating saw as well. Go ahead and buy a backup blade too, because you'll use it way more than you think, and for the price, this saw and replacement blades are among the best tool values available.",
        "It's not necessarily a flush cut saw, but it's a fine cutting tool and a great price relative to the exceptional quality. I use it for finishing cuts when restoring wooden tool handles and for other detail work.",
        "Very sharp -- don't push it, let the edge do the work. The blade is not stiffened, allowing neat dowel cut-offs and other flush finish cuts. The handle shape looks simple, but is very comfortable. Haven't used it enough to notice dulling, but the blade is replaceable.",
        "This is a great little saw,it can't be beat for cutting dowels flush or cutting a door jam and trim flush to a new floor height. I now have two of these saws because I used my first one so much I've worn it down! Remember to always cut on the pull stroke because the blade is very flexible and will bend and kink if you try to cut in the forward direction.",
        "I've just cut scrap wood to test but seems very well built and razor sharp.",
        "Great saw. I've had mine for over a year and it is my \"go to\" saw for small jobs. Even used it on a few larger pieces and it cuts like going through butter.",
        "Sharp, light and flexible. It works great and makes this beginner's task of cutting dovetails a breeze.",
        "I am happy with this saw so far. Very versatile, and it makes clean cuts easily.",
        "sharp. knid of flimsy, but keeps a very sharp blade and cuts through wood like butter. Seems to hold a edge pretty well too. Won't dull after long use. I am hard on this saw and keeps on cutting.",
        "This is a really good Japanese style saw. Flexible blade to get good flush cuts. Much smaller than a regular Japanese saw, but still large enough to handle cutting off excess dowels and such.",
        "Good flexible alternative to expensive Japanese saws as a secondary tool.",
        "flimsy than I expected or to my liking. The blade bends and twists more easily than I like it to but overall good product for a great price. 4 stars because of the thickness or lack thereof of the blade. Great for fine cutting.",
        "I used this when I installed a wood floor as a DIY project. I used this to cut the trim of doors so that the wood floor would easily slide under. Worked great. Very sharp and did the job well.",
        "I didn't like the fact that it wasn't foldable. That's where it appeared when I made my purchase but it is a good tool",
        "I do not want to go back to my western saws now that I have tried this pull saw. Worth every penny and would not hesitate to buy again.",
        "Very sharp. By the picture, I thought it was a folding saw, it would be nice to have a sheath- blade guard it cheap and difficult to put back on. Otherwise, works great.",
        "Blade is very thin and flexible, not stiff enough for doing fine cuts on tree branches. Might be okay for tiny cuts on small wood parts, but not for longer strokes.",
        "Works great. Cuts as it should, blade flexes a bit more than I would like but it's sharp as hell",
        "This little saw cuts super vine I really like it.",
        "This is a good,basic saw. It is well worth the money and arrived very quickly. As of yet, I have only used it once, but it does a good job, you just better not be heavy handed, or the blade will bend.",
        "I've needed something like this maybe a few times a year, and boy, I wish I'd had it then. Great steel, sharp sharp sharp, and no, I can't imagine trying to sharpen it...",
        "This saw is amazing. It is very sharp so the cutting is easy. It is very easy to control so you can hand cut a tenon without a table saw.",
        "Buy this saw if you do any type of finish carpentry. I use mine all the time. Very thin accurate cut. Blade bends like a piece of paper so you can get it flush to the wood to cut off dowels when pinning a tenon. Plenty of other uses.",
        "I love this. I like it better than the Dewalt. I would recommend buying two that way you don't have to change out blades. This is good for cleaning p cuts and cutting dowels, or any detail item.",
        "Not a the top of the line Japanese saw but, it works good for the average woodworker and the price is good!",
        "This is one damn handy little saw. I use it for dovetails and trimming dowels, mostly. The blade is flexible, the saw is lightwieght and very easy to use. Best of all, the blade is replaceable and affordable. I don't think you can go wrong with one of these.",
        "This item is perfect for all of my small projects",
        "Nice, fine edge makes clean cuts, and the flexible blade allows you to get close to your work in tight spots.",
        "This company make a few saws and they are all a great buy. This saw will cut thru light weight materials with no problems and is great for doing tile work to cut trim.",
        "Handle feels a little lightweight & plasticky, but man this thing is shaaaarp! Chews through hard wood easily & the teeth hold their shape & sharpness forever",
        "I use this saw a lot in furniture construction, especially in making flush cuts of dowels and pocket hole screw applications. I rate this saw #1.",
        "This is the second one of this type of saw that I have. Dovetails and miter cuts are wonderfully easy with it. The pull cut is much easier to control and it leaves a very smooth cut. Now that I have two handles I only wish I could find replacement blades.",
        "This is one of the least expensive tools I have, yet it never leaves my bench and I can't think of a tool I enjoy using more. The blade is extremely sharp, and its thinness and flexibility make cutting mortises easy. It slices through wood effortlessly, and with a laser-like clean line. Just buy it -- it's so cheap that if you don't like it, you aren't out much. And I bet you'll agree with all these other reviewers that this saw is a gem.",
        "This is a great little saw! I use it in my furniture shop all the time, and it is quickly becoming my go to saw!",
        "Love this saw. use it often. Cuts without ant surface scratches.",
        "Worked great for my purposes! The teeth aren't flush, though, so if you want a flush cut you'll be doing a bit of sanding afterwards.",
        "Good quality and delivered quickly. Have not had much cause to use the saw but cuts very nicely and flexible to do a flush cut.",
        "I love my saw so much I bought my son & DIL one.",
        "Wish I could rate this better but teeth started breaking off after 2 uses cutting pine.",
        "Haven't cut for dovetails with this, but have used it for other tough cuts and is holding up pretty good.",
        "This saw works very well.the job I needed it for was done with ease.",
        "This think is so sharp, it's insane. It cuts fast, and is super flexible. Despite it's flexibility, it tracks well where you want to cut.",
        "I was looking for a cheap saw to flush cut dowels, this one is great, works well. Not happy with word count.",
        "This is an easy to use saw. It is lightweight yet strong and cuts wood very easily. It does not require strength to use and thus is great for a woman's needs. Love it.",
        "This is a nice little saw. Very sharp. Cuts well. It will slice your finger open. LOL. Well priced. I recommend",
        "I know it says dowel saw but I used it on solid epoxy putty sculpture as well. It's clean cutting ability allows me to make changes in poses with little reconstruction work with fill in putty. Another great versatile tool.",
        "Great little dowel cut off tool Set on one side for neat finish.",
        "Pro's cuts well easy to use sharp as hell Con's blade bends if not cutting right if you cut things a lot blade will get dull fast. you might lose a finger >_> Overall great buy .",
        "This is just a great little saw. I love it. It gets right through dowels.",
        "they are the best - what more can i say - they seem to last forever , and even after years of service still cut well,",
        "Great little saw that works well for cutting into baseboards or trim.",
        "Amazing tool. Won't even scratch the varnish around the dowel.",
        "This saw is good for rough work - don't try flush cutting",
        "Great for plumbing. Specifically on set outs and smaller pipe. Purchased a cheaper version from lowes and will never go back.",
        "For indoor joinery it's an absolute necessity, cuts even finer than a backsaw, and so thin and flexible enough it can cut the final perfect fit in place. The teeth do rust, however, you have to remember, *as with all saws*, to clean the blade after you're finished, because they're too fine to resharpen. Perfect for cutting PVC pipe/conduit too, although not as cleanly as a shear. Great for deboning poultry and fish! I want one of these in my coffin!!",
        "Wow, this worked great to trim my door jambs when installing my new wood floor. Lightweight and VERY sharp!",
        "Purchased this to cut acrylic lighting panels. It works fantastic. Good price, fast shipping.",
        "Very effective having the two serrated sides. although they appear to be one, upon closer inspection of the blade it has two rows of serrated teeth going in opposite directions, this does allow materials such as soft-medium woods to be cut quite easily, and foam/cardboard is also no match for it. I haven't tried to cut any metal or anything like that as I don't think the teeth would retain their ability to cut as well as they would have otherwise.",
        "The first Shark saw I bought I was a little worried that I weould not get used it. This one is now number 4 and I am as pleased with this as was I with the others.I have just ordered number 5.These are brilliant saws and deserve all the right up's they can get. They do take a little getting used to but don'r give. They are worth every penny.",
        "This saw met and exceeded my expectations. I'm delighted with it.",
        "I have used a larger, stiff-backed Shark saw for many years in my wood turning. Being well satisfied with its performance, I just acquired a Shark flush-cutting detail saw. I've only used it a few times, but it seems to be a fine tool. Maker Dave",
        "Its exactly what I wanted. The Blade is perfect but the handle is a little cheaper than would be ideal",
        "these shark saws cannot be beat, I use them for everything"
    ]
}