{
    "entity": "Handsaws",
    "text": [
        "I love this saw! Very sharp and crosscuts and flushcuts like a demon although care is needed on flushcuts. It labors a bit on ripcuts but you can't have everything I suppose. I recently bought a second one to replace the one I hit a nail with (I'll never forgive myself for that). Surprisingly it still kind of works. I use it for dirty things like plywood and such that I'd rather not use a good saw on. As for replacement blades, they're right here hiding in plain sight. They're $10 - $12 and each one comes with a free handle! Happy woodworking!",
        "Very sharp and very thin kerf. It is very flexible and comes in handy for flush cuts. I have ruined a couple of these when I hit a hidden staple or nail. Other than that they seem to last quite a while. There were a few reviews talking about how Irwin doesn't make replacement blades, but it seems kind of pointless to make a replacement \"blade\". You're just buying a blade and you need the plastic handle to hold it. So, basically consider it a disposable blade and forget about reusing the \"handle\".",
        "11th house project. We have started to use trim that is plastic, some with mdf etc. power tools are overkill for 1” trim. The tooth gaps in our usual Hand saws ripped the plastic apart. This. Wow. I have used this knife multiple times a week for two months. The precision is incredible. The flexibility was nice too - allowed us to cut back foam spray along floors or walls to perfection. The flex can make cutting some things harder so note to work around that at times. It just keeps cutting. Not sure how long it takes for the blade to full but at this price it’s already paid for itself and will absolute get another when it does.",
        "Love this pull saw. The blade is flexible and does flush cuts like no other tool I've used. The find cutting teeth are also incredibly sharp and goes through hardwood dowels without any resistance. The blade is removable from the handle, but the major downside is replacement blades is almost impossible to buy at a price than just replacing the entire saw. Good for small apartments and small projects.",
        "I work on a ton of woodworking and DIY projects. This is my favorite pull saw. It is light, small, convenient, and easy to use. My cub scouts even used it on a woodworking project. Buy one!",
        "This is a great addition to a toolkit. It is a very nice pull saw that works well. Teeth have an aggressive cut, so it gets the job done quickly but requires care to maintain accuracy of the cut. Zero tooth offset makes it great for flush cutting. This is the Irwin replacement of an old Marples saw. The older Marples has a better made and more comfortable handle. Best solution is to put the Irwin blade in the Marples handle.",
        "I was looking for a saw to work with smaller wood projects and this works perfect... easy to use and cuts really well. It is a thinner blade that flexes easily so some cuts have come out a little crooked ... a bit of a learning curve there but overall very happy with this blade.",
        "This is nice to have. It rips through wood quickly and makes straighter cuts than a coping saw. This saw also allows you to make cuts it tight spots. Just make sure you are only cutting wood. I damaged some teeth hitting a nail in the wood.",
        "I was extremely disappointed in this item. There isn't a guard between the handle and the blade, and the blade itself is flimsy. Within a few seconds of trying to get used to the blade on the plywood my hand slipped down the grip. Fortunately, my finger was cut by the non-teeth side of the tool but that is sharp also. I highly recommend that anyone on blood thinner medication such as me DO NOT USE THIS TOOL!",
        "Was looking for a pull saw to cut off plugs and clean up joinery. This saw is small but sturdy and fits into tight places. It provides a clean cut and is easy to use.",
        "I have had one for several years and have been very pleased with it’s cutting. I use them mostly for cutting wood plugs flush to my wood projects. I figure I better get a replacement blade but this costs as much as just the blade. Very happy with it.",
        "Funny how the blade is the main part of this, yet it's the replaceable part. So far so good, still sharp and made to last.",
        "This saw was suggested from a friend to use for scarf cuts. The blade is really too flimsy for what I need it for. But it is sharp, though.",
        "i had this hand saw and loved it - finally got twisted up undercutting door frames. super sharp and a precise hand saw!",
        "This is a great little saw to have handy in the shop. The blade is very sharp and works well in both hard and soft woods. It is very useful for working in tight spaces and makes accurate cuts. Excellent for flush cutting. The handle is simple, but fits in my hand just right. I have already ordered three more!",
        "This is a bit more flimsy that I figured it would be. The blade is replaceable... but why? being such an inexpensive product to replace, that makes no sense to me.",
        "This is a fine saw for simple cuts. Pretty flimsy, I prefer to use it for flush cutting over dove tails.",
        "This tool works fine for soft and hard wood, I found it very easy to cut with the pull stroke and make dovetails for projects since the day I bought it. The original blade hasn't dulled enough for me to consider buying another one, but the option for that is something I can appreciate.",
        "Not sure why everyone complained about hitting the button to release the blade. Cut 24 door jambs with this and didn’t have an issue. Blade still rips through things like butter too.",
        "It cuts. After my first cut I already have a dent in the tip. The blade seems to be more on the flimsy side then what I would like.",
        "Great saw! I bought this to cut scrap off of finished pieces turned on a lathe. Blade is very flexible, if not a little flimsy, but gets the job done well. Cuts quickly and accurately.",
        "Lots of teeth broke off the first day I used it. Now I need a new blade or a new better saw.",
        "I've used these for about 5 years now. Great for cutting shims!! And it doesn't dull cutting against concrete.",
        "This is my second one. First one is staring to get some damage. Grass for flush trimming or cut jams for flooring. Like that handle comes off. Very flexible blade.",
        "I needed to trim some small pieces of brittle plastic. This saw did it perfectly !",
        "Not a sturdy model at all, it's way too flimsy to work properly.",
        "I use this little saw for most jobs at this point. It's a fine detail saw, it's flexible enough to flush cut with, and it came absolutely razor sharp. Unless you need to make unsupported straight cuts through thick stock, this does the job. If you need a resawing rip saw, buy one of those. If you need to cut dovetails and trim, this is your guy.",
        "Use it for bamboo and it saws through in a single stroke.",
        "I love this saw!!! I've been using this thing for door jambs and a so much more. Still sharp and going. Do be careful not to push the button as you're sawing or the blade will detach, oops.",
        "works as intended but it comes across as very cheap and not a long life expectancy, we will see",
        "I was initially skeptical of the whole pull-saw idea, but once I started using this one, it quickly became one of my most-used tools. Highly recommended for any woodworker.",
        "I was looking for a small hand saw that could be used for various craft projects. This is sturdy and well-made, and once you get used to the way it cuts in only one direction, it is great!",
        "IRWIN produces are the best you can do for the garage woodworker.",
        "I use this to cut spaghetti squash. The blade detaches or easy cleaning and has a guard to protect it (and you) when not in use. The handle is lighter weight than my old one, but it performs just fine and I’ve not had any issues.",
        "I absolutely love this knife. I have used it more than I every thought I would and it has allowed me to make crazy cuts, and have such a thin blade is genius. If you are doing any carpentry work you have to have one. I would be amazed if you didn't start reaching for this knife.",
        "I destroyed this thing in 2 months, I was confused by the difference between a dovetail saw and a Japanese pull saw. I went crazy on it though, used it on Pressure Treated, and s4s pine; likely lost so many teeth on it during moments ripping pine.",
        "I had to remove about 2 inches of plywood overhang to install some new window trim in my basement, about 3’ tall... after slowly and carefully sawing a perfectly straight edge with this Irwin saw, the blade was shot after about 1’... I.e. missing/bent teeth. It’s probably great for other purposes, but it just didn’t work for my purpose.",
        "Blade is alittle wide for doing really precision work, but its still a really nice saw.",
        "This little saw cannot be beat for the money. I frequently choose it over my Lee-Nielsen tenon and dovetail saw's for delicate work because I have more control pulling rather than pushing and the ferf is thinner. I only wish replacement blades were available as the saw handle is made to quickly change blades.",
        "This was useful when I wanted to add frets to an instrument. It is nicely sharp, thin and precise. The only con is that it is very flexible and almost floppy. I would recommend using a miter box for precise cutting projects.",
        "Great pull saw for precise work. Hardened tooths. It pro and con simultaneously. Pros: very sharp, precise, stays sharp for a long time. Cons: tooths can be easily broken. I have three of these, you know, just in case.",
        "This saw is pretty flimsy, but did work for a short while. If you need something reliable I wouldn’t get this particular product.",
        "Got this saw to replace one that has worn out. It works well in close spaces; and the cutting teeth are sharp. Keep it in a dry environment and oil the blade when not in use or it will rust and become difficult to use.",
        "This is a great little saw for flush cutting even in tight spaces. Blade stays sharp a loooooooong time. I will say I have had a hard time finding replacement blades for the first one I bought years ago that is why I bought a whole new saw.",
        "Great saw! This is a replacement for one just like it. Had it and used the hell out of it for many years but it finally just wore out. If I get half the service out of this saw as I did with the original, I'll be a very happy camper.",
        "This is a very sharp flexible saw that cuts with a very thin kerf. great for cutting off dowels and any other surface flush cuts as well as hand cutting dovetails",
        "Received this much faster than expected and it meets my needs.",
        "I liked how sharp this saw is and how quickly I could cut through a 1 inch piece of wood. BTW, I am a 67 yr old who loves to do wood crafts.",
        "This is my fourth or fifth saw I buy them for gifts for my friends and for myself. is a very nice tool and if you take care of it it’ll last long time.",
        "A great saw, with a very flexible blade. The blade protector is nice, and helps keep the teeth sharp.",
        "Quality is very good for this price point. The blade is almost razor sharp. Cut through my project like a hot knife through butter. I'm impressed.",
        "Cuts fast. Sharp. Cheap cost. Great tool to had and I got it on amazon cheaper than that blue hardware store.",
        "Great little saw! This is a very handy little saw. As smooth a cut as you can ask for.",
        "I purchased two as I intend to give one as a gift. I am a fan of this saw, though i would appreciate replacement blades, though the price of a new saw is close to the probably cost of a replacement blade. Great value for the price. Surprisingly handier to use than a regular saw in many cases.",
        "Very good saw for Flush cuts / trim work. I installed hardwoods in a room that previously had laminate, and needed to cut the bottom of the doorway trim to fit the hardwood. Without this saw I would have had to remove the trim from the doorway to cut it.",
        "I LOVE this for pruning my plumeria. I also have the Shark brand pull saw but this one cuts smoother.",
        "Great little pull saw. Very sharp teeth, so be careful.",
        "This is not the cleanest cutting Japanese saw that I have used, but it is much better than the flush cut traditional hand saws, and the price is right. I use it for RC plane building.",
        "I needed a pull saw to cut a couple of pocket hole plugs flush with the wood grain. I only needed to cut 4 so I didn't want to spend much. I found this IRWIN Pull Saw and it was perfect for the job. It cut the plugs flush with the wood grain and I only need to do a little sanding to make it look perfect. I recommend this saw for the price.",
        "Works fine as a flush cut or for small fine cuts needed.",
        "I love how easy to use it is. Any quick cuts I need to make, I can always grab this saw and get it done smoothly and efficiently.",
        "Handle is loose where it connects to the blade. I expected better from Irwin. Not the quality I was after.",
        "Nice pull saw, not a flushcut saw (teeth are set on both sides of blade and will scratch surfaces). Thin kerf, easy to control. Replacement blades are not , to my knowledge, available. If anyone knows of a source please let me know.",
        "This saw is excellent for small cuts, especially where precision is an issue. It's always in my tool bag and has saved the day many times. Just don't attempt to use it when a larger saw would be far more suitable or you will bend the blade. I learned that the hard way, hence the need for a new saw. Used properly, this saw is a great performer.",
        "This is a chinese saw which means it cuts when you pull back and much easier to cut than american saws that cut pushing forward",
        "keeps you from bothering with a power saw for little jobs. if you have never used one, you're in for a nice surprise. fast, accurate cuts.",
        "This is one of the main saws in my tool kit. It is great for cutting in close quarters and makes a nice clean cut.",
        "Had to replace the one I'd had for years, and thought the pricing was good.",
        "Best saw.I used it in the past.now just continue using it in best results. Thanks",
        "This thing cuts so well and it's so precise and easy! Like, when I cut wood with this, the wood doesn't even look like it was cut, the finishing is so good, it's crazy.",
        "Purchased as Christmas gift for my ever so talented and handy husband. I wasn't sure what this was but I liked the clean lines, sturdy looking handle and \"wrapability\". Plus I hadn't seen anything like it on his workbench. After reading the description, I thought ownership might inspire him to do some things that sorely need doing. Turns out I was right! He promises to give my sweet little bathroom a complete redo if I'll only get up before 4:00 a couple of days in a row!",
        "I bought one of these saws at Home Depot a few years ago, and they're incredibly useful. However, they're very fragile. I wish I could find someone that sold a pack of blades instead of a single blade + handle set, but no dice. I subtracted a few stars due to it not being exactly what I needed (extra blades, not an extra handle)",
        "This has proven to be just the ticket for accurate, delicate cuts... trimming the shoulders of my tenons/mortice joint is a no brainer now....I can easily take off a 1/16 to zero slice to make my leg shoulder match the bottom of the stool. Sweet! Wish I'd had one years ago. I just wish I could find a replacement blade so I don't have to buy a whole new saw... the blade and handle are made to easily replace the blade... but.. where's the source?",
        "Great little saw, I use it constantly at work. Anything from weird little flush cuts to just cutting off a shim.",
        "My lady bought this for me a few years ago and I eventually wore it out. Best saw ever for lopping off the ends of dowels without scratching the finish. While the blades are replaceable, a company representative told me that they do not sell the blades without the handles. At about $15 or so, this is a must have for anyone that does a lot of dowel work.",
        "Excellent saw met and exceeded all expectations, minimized the number of strokes for cutting a piece of wood",
        "Love the fine teeth and the ease of use and portability, but why oh why oh why does Irwin not make replaceable blades for this tool? It seems so obvious, and yet they don't do it.",
        "Amazing!! Cuts through wood like a hot blade on butter, and it's easy to hold very ergonomic for precision cuts",
        "Arrived fast and use it almost everyday at work. No complaints.",
        "It cuts nice but the blade is so soft, any tension and it tries to bend. The Irwin hand saws like this just feel like cheap knock offs of the Japanese saws. I think someone else pointed out that even though the blade comes out you can't get replacements.",
        "I love these saws, I've owned 4 now. They are razor sharp and cut ridiculously fast, and the blade has just enough give to allow flush cuts but not enough to buckle. They don't last forever, maybe a year or two of use, but for the price it doesn't matter. I even have one with half the teeth gone from hitting nails and it still cuts better than many other saws.",
        "Great product - sometime a pull saw that cuts flush is the only tool that will work.",
        "Easy to use. Takes a bit of muscle, but if you are a DIYer, like myself you can saw the tops off of the toilet screws that are left when installing a new toilet. Recommended. Delivery was fairly fast too.",
        "Loved this saw (knife) for making candy so much I bought one for a friend.",
        "Too thin and flimsy for most of my uses. My biggest complaint thoughts the stupid blade release button built into the handle, right where my thumb hits it... That's not a very bright idea.",
        "great pullsaw had one and i lost it so i purchased another one"
    ]
}