{
    "entity": "Handsaws",
    "text": [
        "This saw was exactly what I needed from a pullsaw. Having a rip and cross saw in one design is perfect for me keeping my toolkit slimmed down. Just one less saw to carry. It's flexible so I can flush cut with it and it is a smooth cutter all around. Very impressed with Vaughn's take on this tool.",
        "Super sharp classic Japanese style wood saw. The pulling cut stroke of this saw produces accurate, sharp and precise rip and cross cuts and minimizes fatigue. I always wanted one of these saws to see how the Japanese craftsmen build complete houses with this simple tool, While not exactly the same as the premium saws that sell for hundreds of dollars in Japan, it does make quick work of any job. It's now my go-to hand saw that cuts as quickly as setting up and using an electric saw. Making accurate cuts are not easy for the novice. It takes some getting used to. Time will tell.",
        "Was looking for a thin cut blade, and wow it was that. To have a working blade this thin is such a joy to work with and the pull saw works so much better that those old style hand saws. Just can not say enough good things about this saw for wood working and craft wood work. The pull saws have taken over my old hand saw station, my hand saws now collect dust from this saw and others like it.",
        "I really like this saw. It is easy to make clean accurate cuts. I find it even quicker than my power saw for many tasks. There is a bit of a learning curve but I think you will learn it very quickly. I think it has me converted to the Japanese style saw. One downside is the narrow kerf in some situations it's better to have a traditional (push) saw that rips out a wider line.",
        "well...japanese pull saw. long stroke for 10 inches. does flushing cut. dont cut the metal. my stupid furniture had a pin inside of wood. who ever made that funiture is so stupid. I broke 23 teeth on saw . I reordered only the blade for $13.",
        "Pros: Many, with a small adjustment to usage, you get more accurate, quick cuts. Cutting action can take place at almost any angle and can get much closer to corners with this saw than traditional push cut wood saws. Cons: sometimes the blade flexes during use more than I can for, I worry it will be warp or bend, but it doesn't, So a pro inside a con.",
        "Pull stroke is superior to push. Better utilization of body strength and control. Comes with 2 teeth configuration (TPI). USA made with replaceable blades",
        "I'm new to Japanese saws. The sharpness is impressive. I bought it for the thin kerf, and it really can do precision work. My only problem is, I won't use it often enough to be skilled at it. The blade does bend quite a bit, and it takes some attention to get a close cut.",
        "I've had 2 of these pull saws and have only one complaint. It's a pull saw and if you push to hard when you're on the push stroke it's to easy to kink the blade. This usually happens when I loan it to someone. Obviously I love these saws because I've bought another one.",
        "This is a well made saw at an accessible price point for any hobbyist or professional woodworker. I’ve used it to crosscut 1x 4 through 1x10 material, and used others similar for a wide variety of other tasks. Small kerf cuts like butter with minimal effort. Seems well made. Good saw at reasonable price",
        "Japanese style saws have pretty much won me over. It cuts smoothly and with a narrow kerf. And that it cuts on the pull means it stays is better alignment as you saw.",
        "One of the most versatile tools in my workshop. It is a great all around saw that sees action in the yard, in my shop and everywhere in between. I even grab this before my power saws. It is handy when there isn’t a lot of room to move, as well.",
        "I have been pleasantly surprised by this saw, and find it a great tool for my shop. Cuts quickly has good size and has a nice thin kerf. It is a pull saw so I did take a little while to wrap my brain around but in the end I found it to be easy to get use to. Flush cuts are bretty easy to pull off too.",
        "This saw has been amazing!!! I have used it for 2 different projects so far, a workbench I am still working on and a decorative peg board project for my wife's sewing room. It cross cuts and rips like a dream. It cut the 45s for the framing of the peg board so precise and clean she needed very little putty at the joints and paint worked for a couple corners.",
        "I have used it from everything to making small trim cuts to cutting landscaping timbers. It goes right through everything with little effort and makes clean cuts. Definitely recommend buying one.",
        "This is a terrific buy for both the casual as well as the serious tool fan. Great saw especially for a women because it cuts quickly, smoothly and easily. It will go though a 2 x 4 with no problem. It works in most situations like a tradition saw and is ideal where a flush cut is needed. Also great where you need a narrow blade. The blade unscrews from the handle so it can be stored in places where a traditional saw can’t. I just passed down my 20-year old V & B to a friend who HAD to have it and immediatley bought a new one for myself.",
        "For those who care about sourcing. Blade is made in Japan, handle is made in china, and it is assembled in US. None of the pictures depict this and it is advertised as the blade being made in Japan (while true is misleading). After going to the manufacturers website you finally see the information.",
        "Just tried out new saw. Rips pine with ease, fast and smooth, crosscut is also rapid and fast. This is worth having in your shop.",
        "This is the second saw I have owned by Vaughan. The blade cuts true and does not walk like other saws I have owned in the past. In fact I like this saw so much I have bought them for my friends as well.",
        "I initially ordered this saw for a specific project, and wondered if I'd ever use it again. Turns out it comes in handy all the time. It is very sharp and has a very narrow kerf - so it removes very little wood and I've never experienced tear-out of any kind. I am impressed enough with this little saw that I recently got one for my brother.",
        "Great saw !!! Everyone should one in their tool arsenal ! Very handy , no doubt it will save the day many times in the future .",
        "This saw is amazing. Thin kerf, sharp teeth and both sides are incredibly useful.",
        "I own a dozen expensive saws. All the best money can buy. Backed joinery saws, dovetail saw, two man cross cut saw, etc., but this is the saw that I use for everything. I use it for cutting plumbing, construction framing, concrete form work and all my fine woodworking. I do woodworking by hand and this will cut a perfect dovetail, tenon, miter, etc. and when the blade is dull (or damaged because I treat it rough) I slap a new blade on and keep on rolling.",
        "Once I retrained myself on how to cut wood correctly with a pull saw, I found this saw cuts very fast, very accurate, with a minimal kerf. Love this saw! The handle has a great comfortable grip and is long enough for two (very large) handed use.",
        "I just love this saw. Easy to start, easy to cut, RIP and crosscut teeth on opposing sides.",
        "This is very sharp and works well. I just hope the handle lasts longer than the previous one I had from a different mfg (not sure of the mfg, it is the black handle, red button one from the TV ads)",
        "It would be perfect but for the blade not locking in place. No matter how tight the lock is screwed, the blade is loose.",
        "This is my first experience with a pull saw, and I'm very happy with it. Cuts much faster than my (admittedly old and dull) handsaw. I love the accuracy of the cut, but it's even good for rough cuts when I don't feel like getting the circular saw out.",
        "This is my first time buying a Japanese style pull saw. This thing has now been my go to saw for rough and fine cuts. Fits nice in the hand, and gives a great cut.",
        "I love this saw! Does a great job of cutting quickly and efficiently. Easy to track a straight cut. Breaks apart for easy storage. I have purchased three over the years.",
        "This V&B saw is my first of the Japanese style saws, so I don't have a whole lot to compare it to, but I am very very pleased with it so far. Both edges are extremely sharp and cut incredibly smooth, I've had zero tearout on any of the cuts I've made. The handle has great grip and feel, would recommend this saw to anyone, especially a great bang for your buck.,",
        "Vaughn hand saws are excellent value for performance. Blades are replaceable, making this a functional tool. I bought it to use as a flush-cut saw. Very flexible blade.",
        "Any woodworker should have one of these saws in their bag. No set to the teeth and is really sharp! Great for cutting off dowels flush to the surface.",
        "This is my \"go to\" saw! I love it. I wish the replacement blades were not almost as expensive as the whole unit.",
        "Lovely product that gets through even hardwoods *fast*. Great value, too. Will always have one in my toolbox!",
        "Great saw- made in US . Flexible for flush cuts and versatile for conventional cuts. Blade is replaceable which is a plus.",
        "I love Vaughn saws, and had been looking for a smaller more delicate saw to cut smaller items. This little guy fits the bill perfectly. It is perfect for cutting small dowels and those types of things.",
        "The product did meet the expected value and ability that was expected. Would have liked a hard plastic case for the blade but that was not an option or the dealers responsibility to provide.",
        "This saw is better than the 70 plus dollar Japanese saws sold in specialty wood working stores. Buy the 4 pack of extra blades, and you are set for a while. It is definitely a good quality saw for the money.",
        "Home Depot no longer sells these, I love working with them, and your stock is from the manufacture, excellent product and good shipping, thank you.",
        "He said he's very happy with the quality and design of this tool. Sorry that I can't give more details since I haven't used it myself!",
        "Trick little saw ... a must for anyone doing intricate wood work ....",
        "The saw is exactly as represented and arrive in good shape and in less time than expected. Perfectly happy customer.",
        "Excellent detail saw. The double blade provides two sizes of teeth for better cutting.",
        "Awesome tool to have. This is my first Japanese flush saw, but I cannot imagine needing a higher quality tool than this unless I decide to get into very fine wood working.",
        "Liked the first one so much I bought another. I'v tried them all and this one is the best.",
        "This is one of my favorite tools. It is a quality item that I use all the time.",
        "Take it slow and this saw won't disappoint! Makes smooth cuts.",
        "It is extremely sharp that it cuts like a hot knife thru butter. And I got a few nicks from being careless with it. Nice saw for detailed work.",
        "Good tool - very handy. Price has gone up recently.",
        "I just received the saw, and it's very sharp. Should be great for a big walk-up bar I'm building. I'm knocking off two stars because it doesn't come with something as simple as a blade guard. They couldn't have included a thin rubber tube split down the middle to 1) keep the blade sharp when not in use (if it's not being hung while stored) and 2) prevent owners from cutting themselves before and after use? Stoopid.",
        "Pretty nice, very sharp. A bit harder to use than I anticipated, mostly due to the extreme flexibility of the saw. It's easy to cut a non-straight hole, then have the saw get stuck. Easy to handle, and VERY sharp. Still razor sharp after completing my project, I expect this to last quite a while before dulling."
    ]
}