{
    "entity": "Handsaws",
    "text": [
        "A lot better than I thought. Cuts small trees fairly easily, some I cut were 5 or 6 inches thick. Small branches a piece of cake. Of course like many I had an issues putting the blade on. Once I figured out I could use a flat head screw driver to \"re-position\" the lock to match the hole on the blade so it will slide on to then move the blade into it's final locking position. \"See photo of this bolt\" Use the flat head to turn it to match the blade hole\" I wasted an hour trying to figure this simple fix out, no where is it mentioned you can turn it.",
        "I recieved the product with pieces of dried grass on it means it was used. But i said i will give it a try look it took dow all the branches of the trees easy breezy. I will keep it. Still give it a 5 *****.",
        "Bought this item for my father. Works well. However, one caveat, when installing the blade for the first time you might need to twist the blade holder head with a regular screw driver before inserting the blade. This is represent by the button you press to eject the blade. It may have to be manually turned The factory default position for the one I ordered was turned 45 degrees (to the 3 o'clock position) when it should have been turned upright (12 o'clock position) It's mentioned in the instructions with only a short sentence so please look out for that when installing the blade.",
        "The blade is a major problem. I managed to slot it into place once, but then removed the blade because I had to take the saw to another location. I haven't been able to get it back in place since. It is just a horribly badly designed tool. I can't imagine why they made it like this. Now I've used it once, I can't in good conscience return it, but I would certainly not advise anyone else to buy one of these,",
        "The blade attachment process on this saw is ridiculous! I worked for over a half hour trying to figure it out (the instructions are useless), then went on YouTube and found some videos on the subject, but still can't get the blade seated correctly. THEN I discovered when I decided to return it that I missed the Amazon return window by five days, so looks like I'm stuck with this turkey, and I'm out 40 bucks. Maybe the good people at Goodwill will find it a home. Moral of the story, be sure to open your Amazon purchase promptly and make sure it is a viable item before the return window closes, or you're sol.",
        "My husband and two of my sons tried to insert the blade into this saw but it would not go in. Obviously something is broken. It's too late to send it back but I was really disappointed. This saw got very good reviews. That's what I go by before purchasing anything. Maybe I just got a dud. Amazon gave me a refund, which was amazing, as they did not have to do it. I waited too long to open it so I didn't realize that the saw was defective.",
        "My first clue something was wrong was when the outer delivery box was fine, but the box the saw was in was badly damaged. Not sure if you can see, but fine pieces of grass and debris were on the saw when I opened the box, and the black part had some gouges. When I order something NEW, I expect it to be NEW unless it specifically says \"refurbished\" -- and most refurbished equipment is cleaned up before it is sent out. I wouldn't order for the next couple months, clearly someone is trying to get rid of returned items.",
        "I'm giving this product a failing grade because of the difficulty installing the blades. The directions are lacking. I usually can assemble items without having to read directions. But have read directions and still can't attach a blade. People I know have tried and also cannot attach the blade. Almost one year after purchasing, I still haven't been able to use the saw because none of us can get the blade installed. Think this part needs to go back to the design group. For me the product when into the garbage without ever being used.",
        "First of all I had to watch a video to get the blade in because some small internal piece was turned the wrong way and apparently this is a common problem but they don't bother to put it in the instructions. I bought it to cut down a small tree. This barely made a dent after 10 mins so I still had to use a handsaw. I'm honestly not sure what this is even good for. Even my reciprocating saw managed to cut down a medium Holly tree.",
        "I just got this yesterday, so I can't speak for it's ease of use or quality of results. But I was disappointed to find the saw I received did NOT look like the photos in this ad! It's very similar, but the item I received has no light on it (white/grey area on the black bump on the saw top). Hard to know how much I'm missing, if anything, from not having that function. But I do wish these ad photos were accurate and reflected the actual item you'll be receiving!!! I'll update this review after I have a chance to use the saw. Also, my blade tab came correctly positioned, so attaching the (large) blade was literally a snap!",
        "I've had this saw for over a year & have used it for: removing tree limbs, renovating furniture, shelving & crafts . it's cut all types of wood, metal & fiberboard. it's even easy to cut very dense wood, just don't apply pressure to the blade, let the saw do the work without leaning on it. after a year, blades are still sharp. it is lightweight & has great safety features. some reviews said it took a long time cutting, I didn't find that so. I'm sure larger saws cut quicker, but this saw doesn't take a lot of time to get the job done. I'm a female in my 60's & find it easy to maneuver & use.",
        "I bought this because I'm not a chainsaw guy. Now, granted Im chasing my 4 year old around but...I cant get the blade in. So I should be done with my lawn work this beautiful Saturday morning, but no. Im sure most handy people can figure this out. But Im looking for some pin that Im supposed to turn and the instructional drawings make it even more confusing. As frustrated as I am at the moment, I wish I listed to others on the reviews. To me, its poor design. If I figure it out, I will update you all.",
        "I purchased this product based on the reviews that it did the job.However I had to take the machine apart,to turn the screw on which the blade sits.Based on the complaints Black and Decker should by this time correct this problem as it is an issue with most customers,but I assume it still sells so why bother.I was able to install the blade after viewing a Youtube video. The machine does the job well.",
        "This is the perfect tool for me, being an elderly woman and living alone and a regular chainsaw is too much for me to handle. I have a lot of sucker trees and this cut them down easily, though anything larger in diameter vibrates like mad!. Also,it will Not cut anything supple. The blade protector is very flimsy and I've already lost it so I made a cardboard one. All in all, a very good buy.",
        "Spent 20 frustrating minutes trying to put the blade on, cut myself, and then it wasn't as powerful or precise as I'd hoped. Sawed through about a 3/4\" piece of wood cabinetry to make a better hole for a fridge in my kitchen. It did the job, but now there's a burn mark on the blade and I'm a bit scared to use it again. Would be great for crafts and small projects, but I might want one that's more of a precision tool for that.",
        "1st, it's mad easy to assemble. Just slide the blade in and lock it into place. 2nd, even though you wouldn't leave it laying around small children, it takes a two button action to start it. 3rd, there are 2 different types of trees. One is like a birch that just gummed up the chainsaw, then I'm back to the hand saw. With this saw it's just one saw and that's what cut down the work time. The only draw backs: it's not good on limbs that you might use a hedge clipper on. If branches are closer together, you have cut one branch at a time. But overall, worked great for me. But it use a storage case, though.",
        "I had a very hard time getting the blade in. So I went to You tube and looked for “how to put the blade in a Black and Decker 3.4 saw” the video was very helpful as for what to look for. But my “pin” was turned, so I had to use a small screwdriver to turn the pin. Well it wouldn’t turn until I pushed the blade release button and then turned the pin. They don’t tell you that part anywhere. It was very easy to put the blade in! I love this saw! It is small and lightweight and powerful! I used it to cut branches, works great!",
        "Extremely poor instructions and blade installation system. Played with it for an hour , finally about to send it back and I saw a detailed review from someone else ( actually many people) with same problem who had finally figured how to install it. there is pin in the body that moves around and if not aligned properly you can not install the blades. you then have to use a screw driver to realign it. I think the lack of detail on instructions on this and time needed to figure it out make this product cumbersome even if it works well after.",
        "I bought this to help cutting items around the house rather than using a hand saw. It is ok to trip tree branches, cut wood and such. I have bushes and the pruning tool is either too small to cut larger branches and my tree trimmer cannot do the job due to its length. This saw fits into that slot. It cuts neat and trims branches close to the main stem. This is no power tool, do not expect a high level of accuracy. It is very good for the purposes I have listed. I love it. So, do not consider this in the league with woodworking tools.",
        "I would give this minus stars! I read the reviews and noted the problems with the blade. I watched YouTube for tips. Not only was the attachment not aligned, I could not align it with a screw driver even when pushing the release. I called customer service, as noted in the instructions FOURTY FIVE minutes and I was still on hold. Lesson learned B and D sell crap. Why in the world would quality control send out a product not properly aligned. Returned immediately!",
        "I've owned circular saws that I was ALWAYS terrified of. I know you can laugh here. I had seen such horrible accidents on work sites, men and their testosterone . I feel much safer with this saw even though it takes more effort to cut and steady your hand. It gets the job done.",
        "Very easy to use. Blade was easy to put in and did quick work of getting rid of some overgrown branches. It seemed a little heavy at first because I don’t have a lot of strength in either of my elbows as I broke both of them few years back but after I used it for a few minutes it was fun to use. So if you are a woman and am not sure if you could use it I’m 64 and had no problem using it. I kept finding excuses to go outside to cut things down because it really did a great job.",
        "This is actually a great little saw. We have lost several large bushes and a couple of trees this summer because of the prolonged heat. We save hundreds of dollars by being able to remove them without having to hire someone. We did use the saw to cut some sections of the trees that were considerably larger than the saw recommends, but with a little patient and special care, we were able to do the job. A very good investment for us.",
        "This has to be the worst set of diagrams and instructions ever! Particularly considering how many times this pin does not come properly installed! I had to go to YouTube to see how to install the blade. As it turns out the inside pin was rotated. Obviously this happens with many of these saws. A simple large diagram showing the rotated pin and a brief description of where to insert a screwdriver while holding the blade release button would have saved a lot of grief. The saw works fine once you get the blade installed. Rated it a 3 star because of instructions.",
        "The site would not let me post a photo. I am 68yr old with not much strength so I wanted a light saw and I found it. I was able to cut through 2-3 in branches but anything thinker than that IDK. The blade was pretty easy to install but i did go on Utube and found a great video. Also the saw came with a nice carry bag. I would recommend the saw for cutting away at branches. Hope the saw lasts. It's light, easy to use, and doesn't vibrate much. Off to Happy Sawing.",
        "I don’t have a big wood shop ( small table and chop saw in the basement), but my hobby is making boxes. I sometimes buy thick pieces of wood ( 9x12x3 inch thick), slice both sides on the table saw and then use this Black and Decker to reach inside and finish cutting them through. It was a relief to to find this saw. It is not as sturdy as a Reciprocating saw, But the price can’t be beat and it gets the job done.",
        "I borrowed a neighbors saw similar to this and cut down 2 small trees (trunk About 4 inch diameter) and was able to cut up all the brush. I liked it so much I bought my own. There always seems to be something to cut up around here. It can be used for cutting PVC and wood and various other things.",
        "Had a small project to do. Opened the box and could not figure out how to get the blade attached. Watched Utube and it seemed simple, still couldn't get it. Took it to HomeDepot and they couldn't figure it out. Took it to a hardware store and they figured it out. For some reason, maybe in shipping, the piece inside was offline which stopped the blade from attaching. The person in the hardware store opened it, lined it up, closed it back and it worked. SO if this happens don't go to Homedepot just open it up, line up the piece inside and it's good to go. Worked well with what I wanted to do.",
        "I can not put the blade in the saw easily .However I did it 2-3 times. Now can not insert blade in it .I bought square Trade warranty for 2 years by paying almost $2. I do not know how to make a claim to reimburse the cost of the item. I almost never used this saw.",
        "I saw a lady (now deceased) on YouTube use and recommend one of these. I bought one for myself & boy was she right! I trimmed all my own shrubbery rather than having to hire someone. And I cut the hollies back LOW! Some of those things were huge. (They’re already coming back out, btw.) If you want a handy, lightweight yet sturdy little saw, this one is great. I bought a second one for son-in-law for Christmas.",
        "This is like a lesser version of a sawsall - lighter weight and easier to handle. I can do most anything with this handy tool when it comes to cutting. Trim wood and/or metal thresholds, trim a tree (2-3” branches), cut through tree roots in the ground and fine cutting that a circular saw can’t do. My handyman was so impressed with it I got him one for Christmas. They typically come with 3 types of blades - wood, metal and all purpose.",
        "Great little hand saw. Love this thing. Giving it 5 stars, BUT, if you have small hands, don't get it. I'm 6'4\" with big hands, and the handle, trigger, design sucks. I need to use too much strength to hold the trigger. Other then that, it's a great tool for the house.",
        "We have had this saw for 3 months, and it has seen a fair amount of use. We have generally been pleased with the performance. Initially there was about 1/2\" play (up and down movement) in the blade, but over time the blade has become much looser, with nearly 2\" of play. As far as I can tell, there is no adjustment for this. We now believe the saw is not safe to use.",
        "I thought I reviewed this already, I purchased this the hardest thing with this was trying to get the blade on the play has to kind of go in on an awkward position and then be pulled down and I found it really difficult to put that blade on to take it off to put another one on it something I won't even contemplate let alone do. How does it work? I don't know I haven't used it yet I turned it on seems to work alright but will the blaze when it hit something hard like a tree branch actually been upward and fly off I don't know",
        "i was truly elated to see the product. Was trying to put together to use and blades would not line up. Then, truly upset that it doesn't even go together to see of it even works! I do like the black and Decker products but this one was heart breaking. Having to return. Sorry to the shipper. They were good on the date promised.",
        "I got this to cut down some unruly small bushes between my patio fence. I was apprehensive at first after reading all the reviews. I bought it I didn't have to read how to put it together I just did it. I used it, it worked for what I needed it for. Ladies don't be afraid. You have to squeeze two places for it to start. So fingers or hands should not come in contact with the moving blade. Safety goggles are a must. Always protect your eyes.",
        "We had a big heavy snow storm and many trees were down and many broken branches that needed to be cut into smaller pieces. I could not deal with this storm for several days, but in the meantime, I ordered this saw. It was perfect for most of my branches except for about 5 minutes work where the branches were much too thick. A neighbor had a chainsaw for that. Those cost hundreds of dollars which I can't afford. This saw was perfect for my fixed income budget. This saw did the job. Get it!",
        "The first order came without the blades. I had to return and order another one. I then received another one the next day....thank you Amazon! The only problem was that the instructions say that in order to install the blades, the inside slit needs to lay flat - Not positioned like this /. In this case, it meant that a screwdriver would have to be used to take the machine apart to adjust. It would be easier, and less time consuming if it would come with the slit already laying flat. Please note that I am not an expert here, and am just sharing my experience.",
        "Had to take a small screwdriver to rotate the blade holder inside the powered unit which was easy. Works like a charm to trim down shed doors where the floor board raised up during the winter. Cuts down trees easy with a little heave ho and then into fours to be sent through a mulcher to give that to plants. Ease of use when changing from the wood cutter to the metal cutter to take off rusty locks that rusted during the winter months to be replaced. So a good piece of powered tool to have to replace trees and locks and trim down doors.",
        "At first I was taken aback by the size of the wood blade. It looked so small. I was then delighted by what I was able to accomplish with it. I cut away palm fronds about 2-3\" wide, then cut down several 2-4\" thick trunks of a multi-trunk scheffelera plant, then severely trimmed back an entire little tree. If I'd have paid someone to do this I'd be out a few hundred dollars, so I'm pleased...",
        "Excellent product. Needed to take out some jasmine bushes that had very thick stalks. I'm a 55 y/o woman who isn't super strong, but I am super determined when it comes to doing things myself. This thing worked amazing! Then I helped my daughter install a cat door in her house with the smaller blade acting as a \"jigsaw\". It isn't exactly that, but it worked great after I drilled 4 starter holes (actually 8, 2 at each corner so the blade would fit in). Worth every penny - and it's not even expensive! If I would have had to hire someone to do either of those jobs it would have been way more than the machine cost.",
        "One of the best tools I ever bought. It really saws and makes it easy. A great inexpensive tool for just about any wood or metal that you need to cut. I used it to cut up some old heavy work benches for disposal. It quickly made several cuts through double thickness 2 x 6's. And it did not show signs of over heating.",
        "This is the second one to buy. It is still in the box but is the same model I am still using, I love this little saw. I have cut down several unwanted trees that have had at least 4 inch trunks. I used it to cut plywood piece. I hope they never quit making this little saw.",
        "I had a saw similar to this years ago, I love it. I am older woman, chain saw too heave & messy with gas, etc. using a hand saw, too hard. I used similar one at farm for cutting small limbs, saplings, etc. I used 7ntil it fell apart. Was looking for something similar for my current property. It worked great, cleaned up new shoots, small limbs very easy. Exactly what I wanted and could not seem to find stores.",
        "The bushes and shrubs around my house were out of control. I'm a senior and had no problems using. A lot of the reviews mentioned that getting the blade on was difficult so I was a bit worried. I found a video on line and was able to get it on in just a few minutes. I am very pleased with my purchase!",
        "I was sooo excited to love this but It’s not powerful enough I had a tough time with my tree branches Update so I decided to put a little more muscle into and not bad see pic so I’ll up it to 4 star cane give 5 cause it shouldn’t be this hard",
        "I bought this back in April and sure enough the blade could not be inserted as many of the reviews stated. I put it on the back burner until I could figure it out. I watched the YouTube video and took it to the tool guys at Lowes and Home Depot. Turns out this thing is defective. The mounting mechanism does not line up with the oval on the saw. Seems like it would be a great little saw if the blade could be inserted, instead, I'm stuck with a useless piece of crap. Very disappointed.",
        "Don’t let its size fool you. This little unit packs a punch. My husband was able to cut the branches and trunk of a small tree (about 15” tall, trunk about 16-20”) which has been pushing on our fence. I’m very satisfied with this purchase. This project took 2 days as we took our time. It took about 2-3 hours to get the job done each day.",
        "Not very powerful, but just what I was looking for. Light, compact, easy to use for small jobs. Wasn't comfortable with climbing a tree with a chainsaw because I'm fat and awkward. Got the job done without accidentally chopping my head off and am grateful for that.",
        "WOW! THIS SAW HAS A KICK. THE VIBRATION WAS SO STRONG AND AS I WAS BENDING DOWN TO CUT A BRANCH OFF AN ANDROMEDA BUSH I COULD HARDLY STAND UP THE NEXT DAY. THIS IS CLEARLY A JOB FOR A MAN WITH MUSCLES, NOT AN EIGHTY YEAR OLD WOMAN. THE SAW DOES A GREAT JOB AND IT CAN BE USED ON THREE INCH BRANCHES AS WELL AS SMALLER ONES. AFTER A PROBLEM WITH DIRECTIONS ON HOW TO PUT THE BLADE IN I FINALLY WATCHED THE VIDEO AND IT WAS SIMPLE TO PUT IN PLACE. THE PRICE WAS VERY GOOD FOR A PRODUCT WHICH DOES A GREAT JOB.",
        "It makes using a hand saw a lot faster. You can cut from ant position just like any hand saw but it cuts faster and easier than a non-powered handsaw.",
        "I purchased this just to cut down the lower portion of a dead Rose of Sharon Bush. I am very disappointed. It will not cut through the branches and does not have a lot of power. I did my research and it does not do what it states that it can do. I would not recommend it.",
        "Black and Decker just didn't know how to market this right, such an awesome tool and part of what makes it awesome are the blades, they last forever. Except there are a limited supply online, however, if you cant find them anywhere else, black and decker still sells them but you have to order them and wait 2 to 4 weeks to get them. The good part is they sell them cheaper than the internet.",
        "I bought this a year ago and used it once. Got the blade in by accident and never got it in again. I hate this saw. I know about tiny hole you can barely see in. Nothing works for me and I am disgusted. Good for you guys who wrote a review that got the blade in. I was able to use it once and loved it. Getting the blade in is ridiciously difficult.",
        "The blade attachment bolt was set in the wrong orientation at the factory and could not be turned and reset as instructed in the manual. Some B&D genius decided to put bars on the opening which accesses the mounting bolt so no screw drivers can reach the bolt to reset. A typical B&D innovation!!!. Returned the same day as I received for a refund!.",
        "I bought this to assist in pruning medium sized limbs that were too small to chainsaw but too big to use loppers. This product works as designed but I was/am a little disappointed in it's \"cutting ability\". It just doesn't cut fast at all. If time is not an issue- get it. If you need something to cut fast, look elsewhere.",
        "I love this little saw! It’s not to heavy and packs a punch. I’m able to cut through the branches I use to create wooden plates for the grill. I normally oil the blade before I use and away. The oil helps maintain the metal blade material. I have cut through branches 4in in diameter with breeze by rotating the wood as I’m cutting. The only con is the vibration—it can get overwhelming on long cuts. The best little saw ever.",
        "I have a small tree on my property. Branches are not that thick at all so I thought this was be perfect. Mistake. It takes forever to cut, and I have about 4 different blades but still cuts horribly. I would suggest getting something else.",
        "Very difficult to insert blade. Two people watched a YouTube video about inserting blade and still had issue. Returned item unused.",
        "I used this once. The unit turned on but the button to stop it gets stuck and won’t power off.....very dangerous. I threw out the box so not sure if I can replace it. UPDATE: Amazon sent me a brand new one and it works fine. Yes, once In awhile you get a lemon BUT the damage control was perfect. I got a return label from them and all is well. I like the saw. One star is now 5.",
        "Serious design flaw. Locking pin is not aligned for saw blade to attach. Not only would that be inconvenient while working, it is also VERY DANGEROUS. The \"protective\" sleeve slips off easily, and if I put in serious effort to put this together (something I should NOT have to do) I'd most likely slice my hand wide open. After being on hold for 30 minutes and never having my call answered via B&D, I decided my time has been wasted enough. I'm returning this product today. This could have been avoided if the product evaluators had checked their product before sending out to the public. If I could give zero stars I would. Bad bad bad.",
        "I purchased this Black & Decker Powered Handsaw a few weeks ago. This saw is quite handy to do odds and ends around the house. So far I have only used it once used it to cut some boards to repair my couch. The 3.4 amp motor is quite powerful and cut through the wood with ease. It’s quite easy to operate and changing the blades is simple. The storage bag is also pretty convenient to store the saw after use. I have no hesitation in recommending this saw.",
        "Order this sometime ago it was the best electric saw that I ever had. We had a we had a rubber tree that got knocked over in a hurricane and we used to cut down the rubber tree probably not the best example of what you should do with this saw. But this is a saw that really packs a lot for its small size. It's a little saw that you can use around your garden to cut small trees or branches quite handily. I recommend this.",
        "It was useful to have read the comments about blade inserting. The saw is delivered with some random position for the driving oval. A srewdriver is needed to place it into the initial position. My objective was to cut metal in an awkward place we could access otherwise with a hacksaw blade on a handle. The saw got well into the space, but the metal cutting blades that came with it were useless, they did not compare with the hacksaw bades, so went back to doing it manually. The saw is likely suitable for other tasks",
        "Years ago I bought my first one of these saws. Just this past winter, I discovered I had worn it out to a point where I could not remove a saw blade. I was surprised but so happy to find out these saw are still being made. I had not seen them in the stores. Received this one quickly and the new design of the top hand hold is very good. Maybe not the tool my husband would use, but great for small handed people.",
        "Once you learn how to hold the saw it cuts very good. If you hold it wrong it makes you feel like it’s not a strong piece. However, it is you have to follow instructions in how to hold it with both hands to cut big branches.",
        "It was easy to figure out how to use and switch blades. I was able to cut through a metal wheelchair railing for front porch (cut into size can fit in truck to recycle). Also great at cutting down trees that have gotten a way from me over last few years. Drawback is very short chord. I had to buy a 100ft chord for the trees.",
        "This saw is so easy to get up and running- and I love the protective bag to store! What I'm disappointed in is that this saw doesn't cut through wider limbs. We're taking down a tree and need something to make the pieces smaller. This is great for 1/3rd of the work we have to do. We're also going to purchase a chain saw.",
        "What a life saver. This little saw is some piece of work. I used this saw to cut branches into mulch. I didn't think it could do it. What a surprise. Not only did it cut all my branches but the blade looked like it asked for seconds. So I used it to take out some stubborn weeds. That was a snap too. I thought I would need a chainsaw for those. Now, I just need a drink.",
        "I highly recommend this B&D electric saw. It will peel my small palm trees like peeling an orange. It will make hard to reach surgical cuts. My manual pruning shears will definitely get less use now that I have this easy to use electric cutter.",
        "I am 71 years old and have found this to be one of my best buys ever. I have a lot of foliage and many \"volunteers\" that are too thick for loppers. I have not needed gloves to use this and have received no blisters as commented by some others. I have cut through limbs as thick as 6 inches around and it is quick and powerful. I was a little wary when ordering after reading some reviewers having difficulty attaching the blade, and I am not mechanical at all, but had no problems, I find this to be a very safe and efficient must have yard tool.",
        "I've always had good luck with Black & Decker tools however this product was the exception. Installing the saw blade was impossible. This experience has taught me to read the negative reviews for all products before purchase. It appears most of the negative reviews had a common theme, blade installation problems. I'm happy to say the return process was much easier than expected. I simply packaged the product and took it to a local Kohl's Amazon return and the credit was provided on the very same day. Thank you Amazon",
        "I just love my saw! I'm 69yo female and I love this saw. Light weight, Easy to handle, I've cut many over grown branches and small tree limbs easily. Including banana trees and small palm trees. I live in Florida. Many things overgrow here, but now I have help!",
        "I use this saw for everything. this is the 2nd one i've purchased. its light weight. blades are easy to change. I used the first one I had and wore it out. thought they didn't make these anymore. so happy to find it on amazon. only thing you need is a very long extension cord. but otherwise I love this tool.",
        "Arrived disassembled with no instruction manual, no metal cutting blade, and no storage bag (all were promised). Attaching standard blade (which was included) was tricky and took searching through online manuals and answered questions. Useless without an extension cord. When that arrives, I'll try cutting something with it.",
        "It is what it is. It is not a chain saw. It will cut through branches and small trees (4\" diameter or so) and is much better than a hand saw, although it is a bit more work than one might first expect. (This thing does not cut through branches like butter.) Fairly light and handy. I think there was a design change concerning the blade installation, a topic of several earlier reviews of the complaint variety. Blade installation was direct and simple. So far, so good. This product does not seem to have much direct competition at its price point.",
        "Piece of junk. Couldn't even get the blade in due to malfunctioning locking pin. Instructions say \"If the locking pin is not parallel to the bottom of the saw\" use a screwdriver to rotate it back into the proper position. The locking pin on my saw was not parallel to the bottom, but after extended effort using multiple size screwdrivers the pin would not be budged. With the pin not in place, the saw is useless. Obviously locking pin positioning is a known problem for the instructions to have to suggest a method to (try and) fix it. Waste of money for sure.",
        "This is a great little saw. I am a 72 year old woman and it was quite easy for me to handle. The one thing I had to learn was you have to move it back and forth as you saw because it won’t saw in place. Maybe everyone else knows that. Glad I bought it .",
        "This is incredibly awesome! I am a female and part of my neighbor's small tree fell into my yard. I was real upset thinking about what I would have to do to cut it down. After researching types if device, I came across this saw. It took 10 min to cut it up. I want to point out there is a trick to the blade. It goes in vertically (bend) like illustration, and \"slightly horizontally\" to catch on the hole on the button/latch inside - once it's in properly you just bend it straight up into place. Hope it helps.",
        "It is always nice to buy something under fifty bucks that performs like this baby. I stood on out porch roof this afternoon and cut easily fifty oak branches, ranging from an inch to around three inches. My wife used this hard last weekend and it just zipped through all kinds of limbs. Also - and I thought this important - it is so light, once can use it as I did today, and not feel the strain one would with a chain saw. My daughter saw her mom using it several weeks ago, and went nuts for it, so I got her one. She just worked the daylights out of it last weekend, with excellent results.",
        "This is a great saw. It was packaged well & very easy to open. The blade was easy to snap into place. The size & weight are perfect for me & the trimming I do. I was able to cut down 2 5\" trees within a few minutes. Cutting the trees into smaller pieces was a breeze. It was much quieter than I expected. I like the lock switch that shuts it off when I am not sawing. The trigger & unlock pin are conveniently located. The carrying bag is a bonus. Well worth the price.",
        "Just received it, just plugged it in, seems to be working fine, haven't used it for cutting yet. I read about the blade insertion problems, didn't read the instructions, just watched some YouTube videos \"how to\", inserted the blade in the saw in 10 seconds, no screwdriver, very simple. Highly recommend to watch YouTube videos. Seems like it will be a very handy saw for smaller projects.",
        "Wanted to cut few scraps of wood I had laying around, all very thin , not even close to a 2x4. Did absolutely nothing, cheap and innefective. Maybe this would work on a tree twig but if you think your going to rip through wood good luck",
        "I bought this saw may 30th due to pandemic I just open the package yesterday it was a used item except new blades Since I past the return period I try to use it but it did not work at all what can I do",
        "I love these. I give them as gifts to every girlfriend who has a yard. Compared to recipicating saws these are more stable with the larger blade. Less shaking and straighter cuts. Use these for cutting branches bushes 2x4s etc. Small grip.",
        "PROS: Great for the home user or weekend handyman Comes with a really nice bag Easy to use CONS: Additional blades are expensive Not battery powered no battery model available Mounting the blade took some figuring out",
        "Blade was easy to install. You need to use a sawing motion and it works great. We used it on our smaller tree branches and on bushes. We don't have a lot of room so this is a perfect size.",
        "I needed a small saw to cut those items I didn't want to have to power through without any help. It is so handy! It works like a charm. I was able to bevel the four edges of a 4\"x4\" pt. piece of wood where I needed to attach a slightly undersized post cap. Worked perfectly!",
        "I used this electric saw once and during that use, the motor starting smoking. STAY AWAY FROM THIS PRODUCT......Instead of contacting the Black & Decker support department, I am simply going to throw it away because they are going to suggest taking to a service center and it is not worth the time and money......",
        "Used the saw four times (less than 4 hours), used it for small branches (2-3 inches) on trees in my garden. The blade did not last, as per the attached picture. Gave Black and Decker a chance on this saw, but it is really not worth it. It is a waste of money.",
        "Easy to use and to switch blade. Comes with blade for metal as well. Strong enough to cut through very thick branches. Vibrates a lot when starts to heat up after a long use but not a dealbreaker.",
        "I’m a 70 yr old woman and I did a lot of tree trimming w this! It is very easy to use and just like a manual saw you still have to do sawing motion back and forth but 100 times easier! Will use it on my next building project too!",
        "I always wanted a power saw for a small job or just need to make a few cuts. It's a hassle to setup the table saw or the circular saw just for that. Other battery powered circular saw would work too, but they are pricier, less power in some cases, and need to keep the batteries charged. I want something that's available when I need it, powerful, and with \"unlimited\" power supply. This little buzzer is one of the best power tools I've ever owned.",
        "This saw has come in so handy! The key to using it well is to have plenty of room, brace whatever you're cutting, and let gravity help the saw cut downward. The instructions for attaching and removing blades confused me because the button on the inside of the saw was slightly turned and did not match the diagram. I've never used one of these before, so I was being extra careful to make sure the blade was properly attached before turning the thing on. Once I figured it out, it's easy. I would recommend ear protection if you're using this saw a lot.",
        "Exactly what I needed for cutting some branches off of a very invasive bush. Being a senior citizen I am finding some things harder to do, but still need to be done. When I saw this electric hand saw I just knew it was needed. It worked great.",
        "This is a great tool for cutting limbs up to 4-5\". It doesn't cut as fast as a chain saw but sure beats a hand pruning saw - and is much safer. I found that rather than holding it still, like one would with a chain saw, moving it slowly back and forth in a sawing motion while it's cutting, it cuts smoothly and fairly quickly. So glad I have this tool!",
        "I really like this little tool. This is the first tool I have ever bought for myself and I went a little overboard with my first use. It is easy to attach the saw after a few practices. I cut a HUGE amount of overgrown limbs in a yard that had been neglected for years. This little saw even cut oak trees about 3 inches in diameter.",
        "Love this saw! I am a 64 yo woman with arthritis and I’ve lost a lot of my strength if the past couple of years. This is just what I needed! Trimmed up a lot of dead branches off of 13 yo rose of Sharon shrubs like it was nothing! Some almost 3” diameter. I did have to look on you tube to get help installing the blade. But once I figured it out it was easy.",
        "Not a chainsaw. Not a reciprocating saw. Just a nifty little saw that cuts most things very efficiently. I have purchased two and recommended to several friends who have purchased. Have stuff to cut or prune? Hate chainsaws like I do? Buy this. Easy changing blades, cuts quickly, great for chopping brush and small trees.",
        "I love it. I am over 70, a female, and have never owned a saw before. If I had known how much fun these are I would have bought one years ago. I can trim tree suckers, small branches, rose bushes. It is light weight and easy to operate. I had some pretty large volentary plants spring up in yard last winter and just could not trim them with hand cutters. So I bought this saw. It cuts clean and fast. It is a lot of fun, no wonder men love power tools. I especially like the little hook that I can string the electric cord in."
    ]
}