{
    "entity": "Tongs",
    "text": [
        "Quality went down from my first pair of OXO tongs. My first pair had a rubber pull-out lock. This pair has a cheap metal pull out that rusted after the first wash. The rest of the tongs are the same. My questions is: Why change something if it's already the best it can be? As Yogi Bera said, \"If it ain't broke, don't fix it.\"",
        "Whereas these tongs look sturdy, they do not grip well. The tongs are designed to pinch by the tips, rather than grip. Delicate items are hard to pick up and larger items can become unsteady to hold, often sliding sideways. Unfortunately, these tongs cannot be returned, even though I purchased them a few days ago from Amazon. I've ordered another brand of tongs -- Pro tong isi. That is the brand I had previously. Sadly, they broke, so I thought I would try Oxo. My Oxo products are wonderful -- not these tongs, though.",
        "These tongs are supposed to lock...but they DO NOT. They were returned and the exact same item was shipped....Tongs that DO NOT LOCK. The tongs are shown as they look when closed...and they do not look like this at all. These are far too long to NOT have the option to lock them. The span, when open, takes up too much space in my utensil drawer and are unwieldy as they mingle with other small kitchen items in that drawer. I've had to close them with a coffee bag twist-tie in order to get them to remain relatively flat when stored!",
        "I am not a fan of these tongs. I find that the tong angle is very limiting in what they may be used for. The tips touch leaving the rest of the tongs with a large amount of gap. I would only use these for grabbing large items or a single specific item(e.g. steak). The design is terrible for trying to serve pasta or salad. The fit and finish and material is all top notch. A redesign of the tongs to have most of the tong touch instead(parallel) would raise my review to 5 stars. I ended up finding a silicone tipped Tongs that I really like which are parallel and work great for serving.",
        "This is my second set of 9\" and 12\" tongs from OXO and they're better than before! The metal is thicker so they've only gotten better with this generation! The only reason I replaced my previous set (bought 5 years ago from Bed Bath and Beyond) was because I lost one pair at a BBQ, and the other melted the rubber handle on a hot grill. (Don't use for grilling. Totally my fault though.) I couldn't be happier with the newest generation and the scalloped edge is so much better than any serrated edge tongs.",
        "First I use these daily for years, love them, metal tips for hot items and open flames, cleans flawlessly in the dishwasher every time. My only complaint is the locking feature (A requirement for my drawer sizes) slowly wears out increasing the spread of the tongues, by year five the spread is the same locked or not even though you still have to close them to lock them. Hence buying new ones now. The old ones will stay outside next to the grill. Other than that, they look the and work the same since the day I first bought them 5 years ago.",
        "I purchased these tongs to replace a couple of pairs of this size that I have owned over 17 years and used almost daily. One of the two, I currently own has started being difficult to lock. But, after 17 years of faithful and heavy use it is understandable that such a well used implement might start giving out at some point. These are truly the best you can buy. Make the purchase. You will not regret it.",
        "I have had great luck with OXO products, and over the past two years this set of tongs has performed very well for me. The locking mechanism still works great, and the tongs have plenty of spring - but not so much as to make them difficult to use. The build quality is evident elsewhere in this product: the tongs have not developed any side-to-side slop - the tips of the tongs align just well as they did on day one. Overall, if you need a good pair of tongs that will serve you well for years to come, look no further.",
        "I love everything I’ve bought from Oxo Good Grips. I can’t think of one thing I haven’t found to be better designed by any one else. I bought this as a gift for my daughter as I don’t like the tongs at her house and I cook there periodically. I have two pair of OGG tongs at my house - a 12” pair with plastic, Teflon-safe ends and a 17” pair without plastic ends for using on my pellet grill. I’ve had them for years and love the lock mechanism with a hole so they are easy to hang on pot rack.",
        "Purchased for use on the barbie, and work just fine. Shorter tongs were always a bit of a pain (literally) if the grill was really hot. These keep my hands out of the fire, and have a nice feel, too. I also like the pull tab lock, as opposed to the tilt and lock style, far more deliberate and positive. If you grill, these are worth the price.",
        "The lock sticks a bit when opening and closing the lock. I have to stop each time I open or close the lock and look to see if the lock properly worked or not. The range of opening the tongs is not very wide. I had seen the 16 inch version of the OXO brand featured as a best buy on Cook's Country TV program, so I am surprised at the just so-so quality of these tongs. Not worth the price. I would not recommend.",
        "I love some of the oxo products when I cook on the grill it is hott I needed something to turn the food while I was cooking with out burning my self I ordered the 16 inch tong and it is the perfect length",
        "Just one more kitchen tool I shoulda bought the moment I saw the review on ATK... The cheap silicon-tipped turn-up-to-lock turn-down-to-unlock 3-pack are relegated to the sounded-good-but-didn't-work-out drawer for occasional use on non-stick pans.",
        "They feel nice in the hand. My old one though is more flat, these have a sharp angle. I use the metal tip ones on the grill when cooking steaks or hotdogs. I find this sharp angle to be problematic as only the tips holds onto the steak. It's great for scooping and holding carrots and what not. The lock is easy to operate one handed. I'm sure I'll get used to them. They are just tongs.",
        "I like there much better than others I've used. The locking feature works perfectly. Clean in the dishwasher. Tehy grip food firmly without slipping. Only thing not perfect is the hanger hole in the handle isn't large enough to use with the hangers on my grill",
        "Easy to lock / unlock. I have their shorter version too. These are good when you want more distance from the pan. I got these b/c some online review place said they were the best (don't remember which). They don't disappoint. I mean, they're just tongs, right? They're not going to do your cooking for you or change your life. But they do what they're supposed to do. Which seems to be saying a lot these days.",
        "I had tongs that LOOK like these, but were so hard to hold together that it hurt your hand. Did lots of research on the \"best tongs\" and these came highly recommended. So glad I bought them, as simple as it may sound, the design of these tongs makes such a difference. They are lightweight, very maneuverable, can pick up small and large items, the amount of pressure needed to close them is perfectly balanced, a pleasure to use!",
        "The lock works and would come in handy for storage, but they still don't want to open with the lock released. There's no springiness to them at all, they'll stay in whatever position you put them in. I like when tongs close with pressure and open on their own when you release the pressure, I don't want to have to hook my fingers around in a weird position to push them back open or use two hands. They feel defective and will be returned.",
        "These tongs work well - better than ones with silicone pinchers. I would not wash in the dishwasher because over time the handles could get gummy-feeling like my old one. This was recommended on America’s Test Kitchen.",
        "These are the best I have ever purchased, these were on Cooks Country Cooking Show and were highly rated and demonstrated how they pick up, closed and washed well......All true!",
        "Able to reach all parts of a Weber Summit grill, this tongs was also the favorite of America's Test Kitchen. Also great for corn on the cob, flipping steaks.",
        "These were larger than I wanted. The dimension giving does not include the top portion. This is more like 14\" with that piece. I wanted the smaller size with the overall dimension of 12\". AND NO POSSIBILITY OF RETURN!! Look carefully at the return policy on ever item you buy on Amazon. It's not worth it to purchase what can't be returned!",
        "I was looking for some new tongs for my husband to use since every time he used the outside grill he complained about my cooking tongs. While trying to figure out something for his birthday present, I remembered his dislike for my cooking tongs. After reading a dozen reviews on various tongs on Amazon, I chose these because of the reviews, stainless steel, and dishwasher safe. My husband has now use them at least ten times and the tongs work great. They look almost brand new still and have held up to being washed in the dishwasher. I ordered the 16 inch size and it is perfect for using on the outdoor grill for flipping meats and chicken.",
        "Heard about these on Test Kitchen. I am a gourmet cook, and use tongs everyday. I have several pairs, but these are by far the best ones I own. The pick everything up so easily, are great to open and close with one hand. They are also a breeze to wash. They are so worth the price. I love everything by OXO!!!!",
        "I am quite picky when it comes to kitchen tools and all I can say for this tong is perfect. I bought the complete steel one because my previous tong's silicone head melted and it was not sturdy enough to grab pieces easily from the pan. This tong is sturdy and it does not leave scratches on your pans if you pay a little bit attention.",
        "This company makes excellent products, I have a shorter one for kitchen use and decided to buy this one when I watched America's test kitchen and they reviewed this as the Best for out door grilling! Excellent quality, length, grip, easy to lock and wash. Based on the one I have had for over 10 yrs. and used almost daily to serve salads and to grip meats when cooking it will last forever!",
        "I love these utensils. I have a variety of Oxo utensils that I have for last 20 years. They are well made. I cook and bake a lot. These are great because I love that fact they are stainless steel with a nice grip. Easy to wash by putting them into the dishwasher. Great gifts for family and friends.",
        "I've been using OXO products and I love it! All quality tools for cooking. The latest are these tongs.... easy to hold, rubber grip handles and the tension doesn't give u arthritis after use! Holds the food secure and long enough so u dont burn ur arm when bbq-ing! Lock secure and has a hole for hanging!",
        "So many positive reviews can’t be wrong. This really is a great tool! The looking features makes it easy to store. I bought the 12 inch one. It is good for large pieces like steaks. But it is not convenient to use in my small 8” pan. I will also buy a smaller one.",
        "If I could I’d give these 10 stars. Sturdy, but light and easy to press together. I love the way the locking mechanism works. And, yes, they will actually grasp a single strand of fresh pasta - easily and without breaking it. I didn’t think I needed tongs because they were pretty useless and hard to clean. Now I’m using these from OXO almost every time I cook. Well worth the price!",
        "I have been trying (unsuccessfully) to find tongs like a very, very old pair I have had for years. The new styles do not hold food as they should, pinch your hand or fingers, or, in general, are clumsy and not easy to use. I love these. Last night I picked up a whole salmon fillet by the sides with no breakage, moved to plate all in one piece. Cannot comment on the durability, because I have just received these tongs recently.",
        "I saw this on american Test Kitchen. They thought this one the best. I think it is the best. Really able to grip anything from eggs, to meat to vegetables. Easy to lock in place. Nice feel.",
        "I have a silicon covered OXO tongs which are a little shorter, and really do work for pretty much anything, but I do find these metal tongs seem to grasp meat better. It may just bee that they feel a little more delicate so I don't grasp the steak or other cut as hard and have less fear of squeezing out any juice.",
        "These were rated #1 by the PBS Cook's Kitchen show, they tested about 20 types. Seems to perform as rated!",
        "I use these primarily for flipping fries and searing the edges of steaks. While both those tasks can be done with other tools, this seems like a far more elegant and controllable one. Having a tiny kitchen, I was iffy about getting another contraption, but I find this an invaluable addition. The locking mechanism is simple and useful, I've never had a problem with the non-slip grips, the scalloped edges are great for grip, and the tension is just right (at least for me) for getting the job done. Now, of course, I have no experience with alternative designs, so this should be taken with a grain of salt.",
        "I like how sturdy these are- the metal does not bend out of shape when I squeeze them (unlike my old tongs). I appreciate the added grip to the locking mechanism- makes it easier to use with slippery fingers. Comfortable, secure grip in the hand. Nice long length is great for using for the grill as well as in the kitchen. After my old tongs' spring rusted out and wouldn't open anymore, I had to get a replacement, and I would buy these again!",
        "I like these tongs and I purchased because they won Cooks Country (or one of those PBS food shows) testing as the best; however, I find them slightly awkward to maneuver because of the size. If they were an inch shorter I think they would be perfect. Other than that, they are sturdy and well made.",
        "I already owned one each of the two smaller sizes and ordered a 16-in one to have a bit more distance when handling meat on the bbq. The one I got was pretty good, so I decided to order a second one. The rubber parts on the second one was different than the first one I ordered. The rubber parts was shorter and not as comfortable as the first 16-in tong I got. So one star off for that and for not being able to predict which type of rubber grip will be sent with your order.",
        "Bought this for my husband after he bought a big green egg. After several burned arm hair events I finally bought him some extra long tongs. These are sturdy and clean super easily. My husband is a big guy with big hands and it isn't awkward for him to use.",
        "Love these tongs! The locking feature is so easy to use, and super helpful! We throw them in the dishwasher when done, and they get clean, and haven’t rusted one bit! I ended up buying these for my dad as well, and he LOVES them too! Great quality!",
        "I had previously purchased a pair with the nylon tip at a store and I loved it enough that I bought another one without the nylon tip here on Amazon. It is easy to use without pinching my hand or fingers like I have using other thongs. The lock and unlock easily and hold foods well. Very comfortable in my haND and it's why I love OXO so much! They provide us with high-quality products and ergonomical for our hands. THANK YOU OXO!",
        "I've had these for over a year and they are still in great condition. They have probably gone through over 30 dishwasher cycles and have also been hand-washed countless times. No rust or any kind of noticeable wear & tear. Great pair of tongs.",
        "Fabulous! It has just the right length to get to the back of the grill without being too long, awkward or clunky. I have good bbq tongs but they feel awkward & clunky. Has an easy feel to it with good grips & sensitive touch but does not feel flimsy, I was worried about that. Exactly what I've been looking for. Gonna get another one to leave in the camper so I don't forget to bring it along.",
        "We got these because they are not coated in plastic on the ends. We don't use these on non stick pans so we wanted metal ends because the grab better then the plastic coated ones. OXO is a good brand so we are happy with the price and quality.",
        "First time I’ve ever had the lock feature. I absolutely love it. The grip is also very comfortable in my hand. The tings are also very good, they grip and hold really well. I bought 2 sizes and will be giving these as gifts. I recommend them.",
        "Well made. You can pick up a whole roast or a piece of thin bacon with ease. The scalloped edges help with the grip. The locking feature is nice for one handed use. America's Test Kitchen recommended these and they were right.",
        "Sure there are other tongs for much cheaper and they also have super high reviews. But OXO is a brand we TRUST. I rather pay a few bucks more than have to deal with junk that I'm going to have to throw out anyway. These tongs are well-made and work just as described.",
        "Always uses the 12 inch ones on the grill and kinda just put up with the hot discomfort but then I got these and haven’t looked back since. I’ve actually also taken to using them on the cast on iron on the stove in cases that I get it ripping hot!",
        "Received in late May, they are now junk, mid September. The spring that opens them broke sitting in the cabinet. The joint is loose enough they are almost impossible to use without the spring. Apparently there was a 30 day window to return them.",
        "I wanted a long set of tongs to move charcoal around my Dutch ovens. These are superb! The locking feature works well so that I can pack the tongs with my other mobile kitchen supplies. The grips on the end of the tongs are well made and can be put in the dishwasher. I'm well pleased with these.",
        "We first heard of the OXO Tongs on The Splendid Table radio show. During that episode one of the top teaching-chefs at CIA reviewed several different brand tongs. These were her pick and they are excellent in every aspect. We now have the 9, 12, & 16\" versions. BTW: I believe that the Tong review is still available on The Splendid Table wed-site.",
        "These were great until the spring broke in the hinge. I am typically loyal to OXO and spending a little more for their utensils, but I am disappointed with this purchase. I've replaced these with some less expensive silicon tongs that I actually find more useful since the silicon tips work great for cleaning food from the sides of cookware, including non-stick surfaces without worrying about damaging the pan.",
        "Buying these was one of the better kitchen purchases I have ever made. For whatever reason I never felt like I needed any kitchen tongs until I felt like I did. So I researched them and time and time again these came out on top and I do have to agree as far as non one piece tongs go. I do like using one piece ones a little better but for home use they are a bit cumbersome to store as you can't lock them.",
        "Make sure to get the OXO tongs with the METAL locking ring. the plastic is cheap and flimsy. OXO makes some great products but that \"softgrips\" model is not worth cheaping out for.",
        "They grip easily, nothing slips, easy to lock and keep clean. I have arthritis among other things, and they never let me down. They have never let me get burned either. I also have the smaller pair.",
        "I purchased these because it seems like inevitably any tongs you may get as a gift with a larger grilling set are always weak and flimsy. The design of these with the rolled over metal provides strength over your typical flat and flimsy tongs. Additionally, they are strong enough to grab and lift my mini cast iron grate that I occasionally use.",
        "So sturdy and exactly what I expected. I love this brand. My second pair of OXO tongs. There is just something about OXO that you seriously cannot go wrong with any purchase.",
        "I had ordered the 12\" and 9\" together; I received the 12\" tongs in perfect condition (and love them!), however the 9\" tongs look like someone ran them over with a car. They don't lock, are completely misaligned, and the rubber grips were out of the holes they are supposed to fit snugly into. I had thought that perhaps they got beaten up during shipping, but the box they came in was immaculate. I am extremely disappointed.",
        "Nice quality, can pick up tiny things and big. I picked up a jar of honey, big bulky and glass jar. The utensil didn't give at all. The full open space is comfortable to work with, not opening too wide, yet wide enough to use easily. Ben using scissor style but couldn't find a high quality pair. I like these more than I thought I would.",
        "Well made tongs. A bit longer than I would’ve liked but my fault for not measuring prior to ordering. Easy lock feature and silicone tips so it doesn’t scratch your cookware.",
        "I have been through several sets of kitchen tongs. They all break, or hard to use, or bend when holding and turning heavy things. Not these! Work great, easy to use, hold anything including large BBQ items! I'm going to buy a couple more, just because they are so good!",
        "Easy to use. Grips well. I have 2 other tongs but this is the best. In the kitchen and on the grill, my first choice to move or flip food",
        "This was a replacement for my previous OXO tongs of this style. This is a smaller size than my last one and I quite like that. It fits well in my kitchen drawers. It gives me the dexterity I want when grilling small items like shrimp while being strong enough to handle larger items like a big slab of tri tip. My old one was discarded because the locking mechanism failed. It didn't last as long as I would like (forever) but I didn't feel like it was unreasonable as I use the tongs very frequently.",
        "We already had two of these, but when we “misplaced” a pair, we immediately ordered a replacement pair. Of course, we then found the lost tongs in one of our ovens -so now we have 3 pairs, 3 different sizes. We use them daily and they have held up beautifully.",
        "Works great, good length to pick up food over hot space. Also makes the perfect obligatory snap-clicking sound before use.",
        "Unique locking feature for storing unit, and the metal tongs are great for lifting food from serving dishes or pots! Highly recommend!",
        "Basic 12 stainless steel tongs. Well made easy to grip food with the wide jaws and easy to clean. Just what I wanted at a good price.",
        "Bought these in multiple sizes. The 9\" and 12\" versions are usually all that are needed. I thought that the 16\" version would get more usage on the grill but unless I've got the whole grill going strong I usually don't need the extra length. Gives a good positive grip on the food, has not rusted in the years I've had them. Better than the cheaper alternatives. Good choice for grills and frying pans that don't have a non-stick coating.",
        "Great for the grill, gives you a distance from the grill heat and the meat being cooked. Well made, durable and cleans up easily.",
        "Well made and sturdy. Much better than the cheap discount-store tongs. Locking mechanism is awkward. I have some other tongs that unlock when pointed down and lock when pointed up. Much better system. Can this be incorporated into these tongs? That would make them a definite five.",
        "Use these for smoking ribs, Briskets, Tri-Tips, Pork Loins, etc. Love them so far. Very sturdy, comfortable to use. Highly recommend.",
        "I finally spoiled myself and picked up these tongs. They're comfortable, easy to clean and give you a nice good grasp on things. The length fits my kitchen drawers still (barely) and the nice long moment arm makes picking up heavier items like steaks and chicken breasts really easy. Good solid build quality, should last a long time.",
        "Received empty bag no tongs inside. Bag was cut open, no doorbell ring by driver but I received picture of package on porch today",
        "These are my favorite tongs so far. They have a nice, solid weight to them, lock up easily, and for the most part are all metal. The rubber grips work well and seem sturdy enough for use. The grips themselves do well in gripping just about any type of meat product or grill food. The lock design works flawlessly for me. The tongs have a tiny space between them when fully locked. All in all nothing wrong these tongs at all. Good design.",
        "Not very happy with the action on these -- they stick slightly after you close them. Perhaps not a great pressure spring, or it could have something to do with the locking mechanism at the top. I think I overpaid for what seems to be a cheaply made product. Next time I will go somewhere and try out the action before purchasing, instead of simply relying on the OXO brand name to be good.",
        "I find these tongs indispensable. They're well made and the grip is comfortable. They come out of the dishwasher perfectly, but I like them so much I prefer to hand wash them, thinking it might add to their longevity.",
        "Perfect perfect perfect For our grill smoker these are the perfect solution. We would purchase again.",
        "It is good for grilling because it is long enough that you do not feel the heat from the griller and sturdy.",
        "I’ve needed new tongs for a while now. I LOVE this pair!! Sleek and easy to use. Easy locking feature! If my one hand is full I’ll push it on my hip to open and pull the rubber tab with my teeth to lock lol Does the job nicely!",
        "It is exactly what I have come to expect and like out of OXO products. My kitchen is full of OXO tools.",
        "Great product overall easy to use when you have a very large grill And need to grab food from the back.",
        "I've tried several stainless tongs and this is the best yet. My previous favorites had the spring rust out after a year or so of heavy use and many trips through the dishwasher. I think these will hold up better and they have all the features. Rubber inserts in the handles for a good grip. Locking tab in the hinge to keep them folded up for storage. Just the right shape and serrations on the business end for gripping just about anything you would want to use them for. I'll be getting more of this brand!",
        "These tongs are so much better than any other tongs you have used. When mine broke after several years, I tried to get by without them. That was ridiculous! I hadn't realized how much I used them for every situation. Nothing is a good replacement.",
        "This is a replacement for one we lost when we moved. Love it and had to have exactly the same one...",
        "These are some heavy duty tongs. I used to have short, wire tongs that I would always get my hands burned with when making a steak or felafel on the stove. Now I use these all the time along with a splatter screen and have no more issues with oil getting all over the place, including my hands. I haven't used these on a grill outside yet, but I'm sure these would be perfect for that. I love how they lock, as well. Push in the tag to release, pull out to lock, which is great for storage and for the dishwasher. Overall, very happy with the 16'' length vs the 9'' and 12''.",
        "I needed good tongs to turn over chicken and turkey breasts, fish, potatoes etc. These do a good job. I like the locking feature.",
        "I like the 12 inch Tongs, use it every day! Today I used it to put some Kale on a baking sheet to toast in the oven!",
        "I bought this size over the larger version after one the ATK testers said she preferred it. I'm finding that it brings my hands a bit too close to the heat when frying. I think I'll get the 12-inch size soon and save these for other tasks. Otherwise I'm happy with them.",
        "I use these tongs daily. My only complaint is that I don't yet have two pair of these. The shape, weight, length, and general fit & finish is nearly perfect.",
        "Keep defected from factory. Jade to send it back. May be they should make this size. I had shorter ones before from Kohl's and theyvweee great",
        "Best ever after trying to use the silicone tipped ones. A Cooks Illustrated best favored. Sturdy and compact. I love it. No more trying to turn meats and having it slip off. I would buy again!",
        "He is enjoying it because of the locking device and long and durable size; no burned fingers!",
        "My husband LOVES these tongs. He cannot stop talking about how light but strong they are. He loves the locking feature and is impressed with them. He is not an easy man to impress. We've only used them inside the kitchen but I imagine grill use will be a wonder as well.",
        "These are the best kitchen tool.Love them! They were rated the best by America’s test kitchen and they were right as usual.",
        "Great product for the grill! Long enough to reach the back of the grill and not burn your hands. Locking mechanism works very well and easy. Cleaning is easy- either by hand or dish washer.",
        "I love the product the grip is just right for my small hand -and the rubber to grab alines just right for my hand - very easy to open.",
        "Husband loves them so much I had to buy another one for camper! Perfect size not to take up too much room in drawer!",
        "Easy to grip, can unlock with one hand, and easy to clean. Fairly priced as well. If it ain't broke......",
        "I had one of the standard grilling tongs you get from your run-of-the-mill grilling set, but it was SO dang hard to close the tongs compared to the OXO Nylon headed tongs we used so often in our kitchen. I looked into it, and low and behold, found that OXO produces this all stainless version, which obviously is much more suitable to the high heat encountered on a grill. This stainless pair is also easier to clean than our nylon version, so I actually prefer to use it in the kitchen now too. Just a very well thought out product that performs perfectly!",
        "Works great watched a tv show where they tested several brands of tongs and this one was the winner it's why I purchased them"
    ]
}