{
    "entity": "Tongs",
    "text": [
        "The OXO gadgets seem to be great, but the vinyl cooking tools are a waste. The spatula edge started shredding on first use (simply stirring a casserole on med-high heat). Disappointing. I would recommend OXO gadgets but buy a different brand for the cooking tools.",
        "Not worth the money. OXO is one of my favorite kitchen brands because they have such high quality items. This set is fill with very cheap substitutes. They all may be labeled OXO but they are not the quality that I've come to know and love. The spatula is super thin and can barely lift an egg without bending. The pizza cutting is thin metal as well. The only decent items are the tongs, ice cream scoop and shredder. They rest are very cheaply made.",
        "For the price these seem pretty nice. I want to start buying more oxo brand items because they seem to be of good quality. Time will tell. The only reason I didn’t give five stars is I felt the picture was a bit misleading. When every item is placed inside as pictured, it’s very tight. I had to strategically place them a couple times to make it all fit. Just know you will most likely want to take a few things out and place in drawers.",
        "Purchased these as a gift for my granddaughters college apartment. She loves to cook and bake so ordered a cheaper set and these to compare. Needless to say, kept these and sent the others back. When you're doing a task that requires tools, get the best ones you can afford or you'll be frustrated. They felt good to grip, sturdy or flexible as designed. As with any utensils, wise cooks don't leave them in the pan/oven or melting could be an issue. These will hold up under normal use.",
        "I love this brand! Everything I’ve gotten I’ve loved! I got these when I moved last year and they still look they are brand new! I’ve loved cooking with these, the quality is amazing! Good sturdy rubber handles, good quality and doesn’t rust!",
        "This product is filled with cheap fillers. I would not recommend buying. Oxo is a good brand, a very good one, however i am very disappointed in this product, not what i thought at all, and the spatulas are starting to shed, plastic is literally shredding off each time i use it",
        "I'm a middle aged bachelor. They seem fine to me and sturdy. As the other reviews say, it can be a challenge to fit everything in the container, but I'm okay with that. I'm happy with them. Thanks! Update: Yeah, got tired of kitchen tool tetris. Threw the container in the trash. Put everything in a drawer. Still good utensils but toss the container 😄",
        "While the utensils are nice and the holder cute; the holder does not really have enough space for all of the tools. You have to manipulate the tools too much to get everything in.",
        "I've had these utensils for about a month now. The utensils and the container are as pictured and of good quality. However, I have been unable to fit the handle of the utensils into the holes at the bottom of the holder. They fit fine otherwise, they are just jumbled up rather than in a nice, neat row.",
        "The spatulas are very cheap and now in the trash. Also, the tools do not all fit in the container. You need to be able to easily pull out a tool when cooking when you have them like this on the counter, that is the point. You really can't keep the bulkier gadgets in the container if you want to use the cooking tools. The gadgets are now in a drawer - can open, meat tenderizer, shredder. I am very disappointed in OXO with this set.",
        "Good buy!! Love that the set included the container to hold them.... I was hoping the material would be a bit softer on the spatulas like one I already had... (silicone) but I'm still very pleased with what I got! Used the potato peeler over Christmas and was pleasantly surprised! Good purchase overall!!",
        "Ordered these great Oxo utensils for my nephew and future bride. I think that they will love having the container for all of these. They specifically wanted Oxo but wanted less utensils since they were so expensive. They will be thrilled to get everything they wanted plus more pieces. I have severe arthritis, so I know how valuable they are for using in the kitchen. They are easy to clean and sturdy. I plan to get a set for my daughter.",
        "I’ve been using my OXO cooking utensils for about a month now. They feel like quality tools and have held up so far! I don’t recommend putting the meat tenderizer through the dish washer. It developed a strange film on it that is awful to touch..sorry hard to describe. Would recommend these to anyone with nonstick pans!",
        "Ordered these tools as our old ones have been stained by too many washes in the dishwasher. My wife found them on amazon and wanted them so I ordered them. They seem well made and sturdy, however the Caddy that holds them seems cramped. We have only used them a couple of days, but they \"feel\" like they are high quality kitchen tools. Hopefully the cramped caddy will not be much of an issue. EDIT: Have used these tools for the past year, and they are definately quality tools. The cramped caddy is a little bit of an issue, but the tools have held up nicely to a year of cooking with them.",
        "Awesome tool kit. We got married two years ago and I had a pretty pathetic utensil collection. This set provided me with all the things I wish I had (like a pizza cutter and potato peeler and masher) in those few yet dire times. I love the set and I think it's a great value considering getting OXO at Target or Bed Bath Beyond would average $8-$10 a piece. The container is a bit small, but comes with those pre-dented areas in the bottom so each piece has a place and it keeps it organized and proper.",
        "Great for a first apartment. Only had to add an Oxo spaghetti server for my pasta loving son.",
        "Nice set of kitchen utensils. Everything is there for your cooking needs. Giftable for a first home or just looking to upgrade.",
        "Excellent product love it I used it everyday fast delivery and great service Totally recommended.",
        "Best quality! Best value! OXO products always worth my money!",
        "Great but look that there is not enough space for all the item, it's took me time to put them together",
        "Great quality. Maybe a bit over priced but you pay for quality and thats what I received. No complaints.",
        "So far I am very happy with the product. the utensils that I use quite often have bleached out a little compaired with the others. I think that it has to do with the very often dishwasher use. Still a very good product, though I wish that all of the utensils were of the higher temp plastic though.",
        "I love Oxo products, and this is no different. A wide range of utensils and a holder. They all work really well and are very durable. The only one that is not dishwasher safe is the meat tenderizer. I recommend any Oxo product.",
        "almost half of the items in this pack came used and dirty. unfortunately we bought this well ahead of moving, so the return date has passed. check your items if you don't want used items to use in your kitchen. there are water marks on some and dirt lodged inside parts of the handles.",
        "BEWARE...these items will melt when used at any sort of high temperature. Both the 'flexible turner' and 'square turner' have had the leading edge melt and then splinter into the food or bind to the bottom of what was cooking (a simple thing as an egg!). I have emailed OXO and had no response. I hope this review will encourage a reply.",
        "I love all OXO items and these don't disappoint. I bought this set for my daughter's apartment, but ended up keeping it myself and passing my older utensils down to her. LOL! She's happy and I'm happy. I put a few of the less frequently used items in the drawer (meat tenderizer, pizza slicer, shredder) to make room for some OXO wooden spoons I also purchased.",
        "the metal kitchen tool is worth it but not the plastic, i end up throwing out the plastic tools in about 3 months because it would melt when it get too hot",
        "This is a good, quality set. I’ve had it for a few months and no issues. My mom loved it so much, she bought one too. I wish the set came with a wine opener and the base was a little bigger but still recommend it.",
        "I love the OXO brand and was happy when I found this set for what seemed a reasonable price. Unfortunately, many of the tools are junior sized...like you'd want for a child's play kitchen. The spoons, tongs and pancake turner have very short handles and aren't practical for their intended uses. I do not recommend this tool set. You'll be better off buying individual grown-up size OXO tools.",
        "After debating between this and the OXO 15-Piece Set, I settled on this one. I received this set in the mail with all parts and pieces and was very pleased at the quality, however upon inspecting the tongs I found a bit of rust. There was no water marks on the box and each piece was loosely wrapped in plastic, so I am unsure as to how the one piece in the set was a bit rusty. I tried removing the rust to no avail. Overall, I was pleased with the purchase and the items look like high quality, however I am returning this set due to the rust and ordering the OXO 15-Piece for the extra tools.",
        "I purchased this set because it had everything I needed and wanted for the kitchen. I love the OXO brand and really trust their equipment. Ultimately, I returned this set, only because I received all of the items as gifts from my grandmother, unexpectedly, so when this arrived, I already had my items! Purchase this for your new home!",
        "The individual items are well constructured. The container is nice as well, but is not the right container for so many items. The utensils just dont fit well and it doesnt help you easily find what you need. Otherwise, like the product and would recommend.",
        "This was a gift for my daughter's first apartment. Tools include can opener, whisk, grater, ice cream scoop, tongs and vegetable peeler. Great price on this assortment of OXO tools! Purchased individually they would have been much more expensive. OXO quality is great. Tools came nicely packaged in a cylinder with pictures of the tools inside. Would make a nice wedding or housewarming gift! Recommended.",
        "I love all OXO products! They are sturdy and last forever!",
        "I bought these for a travel trailer. Well there really isn't any extra room in that on the counter tops. I thought this would be perfect to keep them together on counter. Well no it still takes up room that I don't have! But it's a very nice set for the RV. They are stored in my silverware drawer!",
        "There are many utensils and they are easy to use.",
        "We love OXO products and had high expectations for this. While not bad, it didn't blow us away either. Good combination of items but the container isn't tall enough and the spoons, etc flop around. Not a bad value but not what we've come to expect from OXO",
        "I gave this as part of a housewarming gift and it is super! Very sleek, and full of top quality implements. My only niggling complaint is that I wish there were a bit more room in there so something else could be added if so desired, but really, it made an impressive gift for a very reasonable price.",
        "There are a couple of items I don't need, one being the pizza cutter, but that's only b/c we don't eat pizza as often as we used to, but that potato peeler is awesome! Kept the guard for it tho...that baby IS sharp! I accidentally touched it when washing it and it bites, but works like a charm. Meat tenderizer is perfect and the spoons are great!",
        "I love all of my OXO Good Grips utensils. They are easy to manage and work well.",
        "Nice quality - as expected - just wish there was a pasta wand - otherwise everything you need",
        "I was so excited to receive this. Until I saw that the cooking items came with an open box, no seal, almost looked used.",
        "Have one for 13 years and still in excellent condition bought one as a gift",
        "A good value compared to buying individually. The container is a bonus.",
        "Got these as a gift and they’re amazing, well made and the handles are easy to hold. I imagine i will be using them for years!",
        "I like the OXO brand and the OXO Good Grips kitchen tool set has not lessened my opinion of the brand. I often the tools and they've held up quite well. Each tool is dishwasher-safe and attractive to leave on the counter in the included white \"bucket.\"",
        "I like have the basic tools within reach. Nice quality.",
        "I like all except cheese grater, it doesn't live up to the OXO name.",
        "Purchased this for my granddaughters Shower and it arrived on time and packg was great and item was in good shspe. Thank you",
        "Very nice set. The pieces look good, function extrememly well, and are very comfy to hold on to, even when you have to press hard. The stand is only useful if you take the stuff you don't use very often out, which is what I did. Other wise you can't hardly fit anything in and it just becomes impracticle.",
        "A+++ oxo quality! I’ve owned this before so I knew what to expect and this set is outstanding!",
        "Wow! What great quality. I wanted a set that I would be able to use forever and this is it! It is pricey, but has everything you need and no worry about anything breaking!",
        "This thing is excellent! Incredible materials, well crafted, and convenient. You don't need to go to Williams Sonoma to get a quality product if you don't want to, you have it right here at a very nice price!",
        "Every oxxo product that I have including this one is a good option",
        "Love OXO items, have been using them for years. Got this package for my son's engagement and new apartment so the young couple enjoy it as much as I do.",
        "Very nice set, goes really well on the counter, I o LT wish would have more space inside to fit well as the tools. Otherwise high quality",
        "OXO is my go to brand for all kitchen utensils there quality just can’t be beat.",
        "It's a nice kit and the pieces are well-made but I didn't use a lot of them and it was a little clumsy around the kitchen",
        "This set is very attractive yet simple in it's appearance so it will fit in well in most kitchens. OXO utensils are very nice quality, especially for the price on this large set! The utensils include really cover the basic needs very nicely.",
        "Great kitchen tool set. these work great and look good too",
        "I love OXO. Good quality sturdy and easy to clean. 5 stars.",
        "They are nice heavy duty kitchen tools and I love that they came with a holder for everything. It's nice to have a matching set.",
        "Thought bottom of holder was rubber but it's not, it's hard plastic. Utensils are of good quality, however, handles are way to bulky and do not slide in and out of container very easily. Deffinately no room for anything else you may have.",
        "We love it! Didn’t expect it to be so nice and sturdy for the price, would recommend ☺️",
        "Oxo makes great stuff (Made in China). All the utensils are great except you can't it them all in the bucket and get them out without a crowbar. put the ones in that I use most and stuffed the rest in a drawer.",
        "This package comes with most every utensil someone needs in the kitchen and it's a good price for all the pieces.",
        "Keeps my space organized clean and looks great on my counter",
        "I gave this to my son who at 25 has just started living on his own. It has just about every little kitchen gadget he would need to have a functioning kitchen. The can opener is wonderful, strong and sturdy!",
        "The canister for storage could be slightly larger to allow utinsels to fit inside easier fir storage",
        "Bought it for my mother. She doesn't have a lot of counter space, but this worked perfectly.",
        "This was one of the best kitchen purchases I've ever made. Not only is every single tool extremely high quality, but the chrome finish of the holder matches my new kitchen perfectly. Unlike some of the other reviewers, I haven't found any trouble fitting every tool into the holder. It's a tight fit, yes, but it doesn't look messy or anything like that. There are grooves at the bottom of the holder that help hold each tool in place. Overall, I'm extremely satisfied with this purchase -- I won't need to buy any kitchen tools again!!",
        "I'm going to set a set for my parents anniversary as well; highly recommend",
        "Lovely. This product looks good and of great quality. Don't leave many items on my counter top. But this is there-",
        "Honestly, this is mostly for show because i'm not a great cook. But I like having everything in on place.",
        "this products is nice except it can't handle hi heat.",
        "another present for my daughter who is setting up a house. the quality of this set it the best offered on amazon at this time.",
        "I wanted to replace some older gadgets with a nice, usable new set. OXO has done a great job with these. The grips are comfortable and the set as a whole just looks good in the kitchen.",
        "Love having all the kitchen tools at my disposal. My only complaint is that I wish each item had a \"slot\" in the holder. Once more than one item has been taken out, it's like working on a puzzle to get them all back in the holder in an orderly fashion. But other than -- it's a great buy.",
        "Really nice worth every penny I spend. And great quality items by the way. So if you need something like this go for it you won't be disappointed .",
        "Different with pictures. I ordered white plastic baskets with can opener! But i got stainless steel basket without opener.",
        "i love all things Oxo and this is no exception. A really complete set of some of their greatest products!",
        "Nice kitchen utensils, but they don't fit well into the holder.",
        "The spatulas are somewhat flimsy. Otherwise everything else’s is great.",
        "I like this set a lot. Most of the items get the job done well enough for a home cook, while others well...not so much. Overall good set for the price!",
        "I have been looking for a set of smaller nylon set and these foot the bill. At around 12\" long they work much better in the smaller pots and pans.",
        "This kitchen tool set has worked better than expected! I bought it after looking for complete sets for my kitchen. Everything works perfectly fine, and I have not had any problems with handles coming off or stuff breaking. I use them on a regular basis and I am not the best in the kitchen and these tools have put up with me. Really recommend them for those who are looking for a starter tool set!",
        "Like the product, but the container is too small to easily extract and return utensils. Make the container bigger. Also, the plastic spatula material is too thin and begins bending almost immediately when exposed to low heat in a frying pan. Needs to be at least double the thickness.",
        "Great product, quality is good and the tools are durable.",
        "Haven't used everything yet. But the square turner, I think, is melting when I make eggs. And yeah, bucket is too small. Overall, everything is pretty good.",
        "Oxo makes great kitchen items. They are durable and well priced. This is a great starter kit for a new kitchen.",
        "This has every kitchen tool you could ever need and very compact.",
        "I absolutely love this set. The OXO brand rocks. I have had this for about two and a half years now. They are sturdy, no rust on the metal pieces. I would totally buy this again....in like 10 years when they finally give out.",
        "gave this to my daughter for Christmas. she absolutely loves it. fits nicely on her counter top and looks good in her kitchen. she loves that there are so many utensils to use and finally she has a peeler that really peels.",
        "love the container and I use everything it comes with. Loved it!",
        "The kitchen tool set is perfect. It has everything you need. The handles for each item are great - there's a good grip on it. It's not flimsy like other. Excellent value.",
        "Ordered for my son in his new apartment. He was thrilled it had one of just about everything he could possibly need for getting started.",
        "I purchased this for my sister who is just getting started in her own apartment and she loves it! Would definitely give again.",
        "The tools are nice but one of my tools came broken in the box",
        "Superior product as are all those with the OXO designation. Would definitely purchase again. Real value for your money-buy it.",
        "Quality set, pleasing to the eye and a space saver."
    ]
}