{
    "entity": "Post-Mount Mailboxes",
    "text": [
        "Arrived quickly, easy to assemble. Lock hole was tight but a little scaping with a pocket knife did the trick. Easy to put in ground. I painted mine with some acrylic craft paint but it looked nice as it was out of the box. The other options I considered were 3x the price. Great deal.",
        "the FIRST thing everybody should be aware of is the mounting design, or lack of. in order to mount it, it requires a 4x4 installed in the ground, but it can't extend more than 8\" above grade. that means that the mailbox extends up in the air without any structural support. if you live in the upper states where a mailbox encounters snow being blasted onto it from snowplows, you might want to beware. i am reuctant to cut off my existing 4x4, because if this thing ends up 1 block away in a snowbank, i'll be screwed",
        "Love this mailbox! My husband painted it like brick. He buried the bottom in the ground and built a small concrete platform frame around it. His reason for doing so is to prevent him from damaging the mailbox when he is cutting or trimming the grass. Our mailbox is very unique in the neighborhood and we received tons of compliments, even from our mailman. We took off the inner top shelf and allow the mail to drop to the bottom of the box, now we only check our mail every two weeks. This works out great for junk mail, I only have to deal with the junk mail twice a month.",
        "The first unit arrived with broken front door and a large tear in the plastic inside the top of the mailbox. This could have been caused by a high drop on the top corner in shipping. The second unit arrived and the back door to the mail box on top would not close. If the floor of the box was in, the door does not close without the plastic hinge pins coming loose at the bottom. Step2 needs to work on their QC before product leaves the factory.",
        "Pretty easy set up especially if you have a teenager around to dig the post hole. The instructions aren't very good but if you have any ability at all,you can figure it out. One thing though, the paper shows a 4' post. I measured inside the box @ 3' and you need to be at least 2' in the ground.my calculator says that's a 5' post. Be sure to level your post in both directions as you tamp it in. When you slide the base Dow, check the level on top of it in both directions and make sure it's solidly against the ground. Piece of cake.",
        "great item. we got our mail stolen once and wanted a locked box that i could put a bunch of packages in. you just have to take the insert out and you can fit a lot of poly mailers inside. smart idea and i know that this will last a long time... the only drawbacks are that is you take out the insert you can't use the function of sending out things. also if you have a long arm you probably could stick your hand inside and steal the mail however i think that would be really noticeable.",
        "Three huge issues with this product. 1. Very cheap looking and unprofessional finish. 2. Assembly tool (A) was missing. 3. Worst part.... it took us 1 hours to insert/slide the collar into the plastic door hole for the lock. The hole was too narrow for the collar. DO NOT BUY THIS PRODUCT PLEASE!!! Tool A to press the washer",
        "Item came with wrapped pieces and it was a pain is a** to get them replaced by the manufacturer. After struggling to get the pieces replaced they finally agreed to replace one piece but not the other. Then we discovered that the lock was broken. But having an ordeal over two warped pieces I never contacted the company for a new lock. Waste of money entirely.",
        "Compartment is useless for boxes, remember any box needs to fit though the standard mail opening to get into the lower compartment. The small Amazon Prime box does not fit! The only real use is if you get a lot of flexible packages or buffer is you infrequently check mail (like if you have multiple homes). We remove the floor/divider for vacations so 2 weeks of mail fits easily. Cosmetically it looks like cheap plastic from 20ft, no one will ever think its stone. Assembly is required and the parts do not fit together well. The flag is hard to move, the postman never lowers it fully and I cant blame her.",
        "This is a super idea for anyone who gets lots of mail, catalogs and internet orders. There is a lock that needs a key to get in so you can get your mail. If you travel and want to be sure you get your mail without having to trust a neighbor to do the task this is the mailbox for you. It is heavy plastic, and you will have to anchor it to the ground via some kind of support lumber, but it is well worth the little bit of work. It also comes with stick on numbers. Lets you stop worrying about small packages or mail being stolen.",
        "The order came without all the parts. It did not have the package that contains the key lock and the numbers.",
        "As was mentioned in other reviews, it takes a while to figure out how to get this all put together. I did add some posts inside this to ensure no one could put their hand in it while I was away to take my mail since the opening seemed a bit wide. I would always get comments from people how cool it was to have a secure mailbox. It was a selling point that was mentioned by the buyer of my home. He too loved having a secure mailbox.",
        "Had to modify the door thats used to retrieve mail from lower section, it was attached but would not close (there is no way the person who installed the door tried to close it) the door was 1/2\" to tall used my heat gun to modify it. The hole for the lock had to be reamed out so I could insert the lock. $100 is too much for something that needs work before installing $45.99 would be a good price.",
        "Best mailbox in the world. I don't think anyone would know by looking at it that there was a 'secret' door. the magnet on the back top door could be a little stronger. Sometimes our mailman pushed it open, but maybe he is just really strong. we solved this by putting up a piece of cardboard across the back on the inside. We have been gone for a little over a month and had plenty of room left in the bottom and dry inside. We have had this about a year, my husband installed it with no problem, he also made a concrete pad for it to sit on.",
        "Over all I liked the mailbox. I used the existing post. But I had to do some modifications. The opening is in the front,no big deal. I wasn't about to go through the trouble of digging another post hole.I put a knob on the panel,because the door is tight. I also had to use a dremil tool to make the lock opening wider as to fit the lock assembly in. I painted the box to match the house. I used outside paint with a brush,then sealed it with a clear coat of spray paint. I put 2 bricks inside for weight,and around the edge for protection from the lawn mower guy.",
        "This purchase was perfect for me. I am a 60 year old woman and installed by myself. I dug the hole for the post and installed. The directions were easy to follow and I have had it for a couple of months now. I did not install near the street so I do not have to worry about the snow plow hitting it with snow. It is very sturdy and I love the fact that I can remove the floor of the mailbox and it will support several weeks worth of mail without stopping the delivery at the post office. Very good purchase",
        "We rec'd this late and it took a long time to arrive. It looks good but does not go together well. The hole to put the lock in is not large enough. The screw to hold the lock in is missing. A lot of the holes do not align. We are missing parts. We like the size and how it looks but the avg person is prob going to have trouble putting it together.",
        "I like this mailbox. I like the fact that it will store a lot of mail while we travel and we don't have to \"stop mail delivery\". I would have preferred it made of metal, and I would have paid more .... but It IS STURDY and It was a good upgrade to the \"Step Two\" mailbox it replaced after 25 years. The old one did not ACTUALLY have to be replaced. We just did a major remodel to our home and the old one was quite faded. It still was sturdy and worked well, but this new one is better.",
        "I would have given this a 5-star review but the instructions are very confusing. Be very cautious when you go to put the lock mechanism in, who directions have you do it almost the opposite way. the customer support team for Step 2 wanted to charge us almost $60 for a new locking mechanism; no help at all. Ask someone that's mechanically inclined to install this for you. I had to return it and they didn't have any available for me at the time? So I had to buy one from Home Depot in the end. It's a great mailbox and looks fantastic. All my neighbors are jealous!",
        "Great mailbox. Instructions could be better, but managed to put together fairly quick. Love the storage. Funny thing though was since the hurricane Harvey came through Rockport, TX our mail-person thought our mailbox was damaged because we have the bottom out so the mail will fall in the storage area. She was very carefully balancing our mail on the side edges so it wouldn't fall, lol. We told her, let it drop, it's okay.",
        "I love it! My brother installed it in 1 day with some minor adjustments the following morning. Looks great, and although it looks perfectly fine without, I think I may do a little airbrushing to add the appearance of grout! Ahesive numbers are included, but no letters came with it so, if you wanna put street numbers and a name on it, visit the dollar store 1st! All in all it's a nice quality mailbox, with a locking back and I'm completely happy with it!",
        "good quality mailbox. looks nice. The box did not contain the locking mechanism but when i contacted the company, they shipped one immediately. had to wait a few days but customer support was great. Only issue i had with this was while inserting the lock jacket into the plastic housing. the hole in the plastic housing is smaller than the lock jacket so you have to file it (and i did not have a file, so i had to go out and buy one).. hence taking away one star. but overall, it looks better than the average mailbox in my neighborhood",
        "Looks great. From a distance, looks like stone. I had it installed in cement with a post. The base has a separate piece which confused me. But someone told me that it was to fill with water or sand if you didn't want to install in the ground. With the height, and amount of surface area, I would think this would tip over if not installed in the ground. Highly recommend.",
        "We purchased not even 3 years ago and have rarely used the lock portion. The lock completely broke and fell out.",
        "This product has delivered as promised...when trusted neighbors moved away, I knew it was time to invest in a storage mail box...this saves us from asking post office to 'hold' mail when we are going away for a few days...easy for us, easy for them! Win,win! Well constructed, did not order additional instruction kit; husband had no problem setting it up.. I would recommend!",
        "It looks great, and it's a nice size. The only problem is that when it rains my mail gets wet as well! Not cool! This is the 2nd one I got, because the 1st one that they sent to me had a broken door?! but the box was good. The lock also is a bit hard, and sometimes hard to unlock. I like it because of size and I thought it would keep everything safe.",
        "It's a very nice looking mail box with hidden storage. When I am out of town, I remove the bottom and the mail fall into the storage below which is big and opened with the key. I had another model from same company before, and I wanted one from this company. My neighbor installed this mail box shortly after mine was up. I highly recommend it.",
        "It was relatively easy to install. I am rural so it is roadside --standing at the edge of the road. I like the ability that the 'bottom' of the regular box removes to allow some mail to be safely stored without having to put a hold on mail when I am away for a few days. Durable 'rubbermaid' like material.",
        "A little bit hard to assemble, but it's definitely awesome look. I like this mailbox and it makes our home outstanding in our neighborhood. Good storage while you are traveling for a while. We went to the other country for a month earlier this year and it can hold all the mails!",
        "I have a smile on my face every time I go get my mail . This has got to be the nicest mail box ever and I'll bet the mailman loves it to . It's the perfect height and is totally pleasing to the eye . I don't live in a rural area and didn't want to put it on a post so I bought a ring bolted it to this unit then got a small chain and chained it to house . You will not be dissapointed and its worth every penney .",
        "We're the third family on our street to have this type of mailbox, and we love it! It looks nice, is great for when we are away and don't have to have the post office hold our mail, then wait until they deliver it. The lower chamber holds all our mail securely and we can access it immediately. It has weathered one hurricane, and a major tropical storm, still looks brand new. Really holds up to severe Florida weather.",
        "Once the mailbox was installed it has been great. However, we had some issues getting it together. The lock would not fit into the guide and needed to be sanded down to allow it to fit. Also the hole where the guide was to be installed, had small pieces of plastic that had to be removed before it would go through. After these problems were addressed, everything went smoothly. I purchased two mailboxes at the same time and only had problems with one. The second one was perfect and installation was a breeze.",
        "works as expected; water proof mostly, except for when opening the back hatch after rain, some rain water could get in along the hatch top; easy install, once the 4x4 post is sturdy in ground, this box sits over the post, secure with screws provided; didn't try the lock since mine sits inside iron fence; so far so good",
        "Installed March 1 2017 and love it. Used the recommended 4x4 wood pole for NO DIGGING required. Relatively easy to put together and install outside. Took approximately 60 minutes from start to finish. Went away for 3 weeks and came back to a mailbox housing all my mail with room to spare for so much more mail. Unlocked the back and easily removed all my mail. Very satisfied with this purchase.",
        "I’ve had mailbox baseball bandits several years running. When I bought this, they tried to destroy it by bending it over. But my neighbor quickly & easily fixed it. It’s been great for when I’m away; I love the drop down feature, mail stays safe, secure & out of prying eyes.",
        "Missing all hardware and lock. Missed the return window. Make sure you check the box immediately upon receipt for all contents.",
        "This step 2 item was not well finished. The \"plastic\" is not smooth at the seams nor in the edge of the roof. Does not show from the road, just close up. It is still a nice box, and I hope it lasts as long as the last one I had.",
        "I would have given it a five; however, the rear black door (top) was broken so I had to do some super gluing and dremel alterations to make it work. Thank goodness I have talents and tools. I love the mailbox and now the vandals will have nothing to hit because I'm moving it out of the way when not in use. I have lived here 24 years and this is my 10th mailbox.",
        "The material is a very thick plastic. It is lightweight. You will need sand to fill the base with and an anchor post kit (which can be found on Amazon for a great price). I live in South Florida and this has surpassed my expectations. The mail carrier appreciates the removable floor for bigger packages so she doesn't have to walk to the door in the rain. I am complimented all the time on the quality and appearance. It comes with numbers and, after installation, has proven to be rather sturdy. I have recommended this to family members.",
        "Very pleased with the looks of the mailbox after it was installed. The only negative for me is the lock hole needed to be chiseled out quite a bit. I would recommend it to my neighbors.",
        "We just moved and had previously had the Step 2 regular mailbox for over 20 years still looks as good as new. Got this one because we do travel some. Look over the negative reviews about installation anyone with any little bit of knowledge should be able to install this. Super nice and efficient and great price. Functional and stylish.",
        "I get a lot of packages (from Amazon of course) left while I am at work. This will be great in securing the packages until I get home. The price is really good and its even more sturdy that I had expected. I didn't use a post, I put in on the ground and fastened it directly to my house. I even painted it to match my house color, and it looks great while being totally functional.",
        "I moved three times and every move I bought this mail box Absolutely love it you can take the top out your mail drops down and you don’t have to worry about it if I move again I will buy another one Can’t say anything bad about it you will love it",
        "It was a nice idea but plastic can only be so good. Your mail will be wet if it rains while you’re out of town and the lock situation doesn’t seem that great.",
        "We have a house that we don't always visit every week. The mail used to pile up and overflow. Then I found this! Very good solution to my problem. It was easy to put together. I would recommend that you consider using a longer 4x4 post and dig the hole deeper. I did that and it made the mailbox very stable. Great product.",
        "This mail box is so cool i got it 4 my grandmothers house because she has fenced in yard nd the mail would never close the gate so i got her this 1. U have to file the key hole spot be4 u put the lock piece in because it was to tight of a fit but it was pretty easy so were happy about it. The mail man love's it nd so does the neighbors she gets a lot of compliments on it nd its very durable well worth the money wish i would have seen this along time ago!!!!!",
        "Nice box BUT the doors randomly come off when you open them. Posts are too short to hold door on when it warps a bit when sun hits it I think. Design flaw!",
        "Even our mail carrier likes this! We got it because we take a lot of 3-5 day trips and don't want to put a hold on our mail and we don't have anyone to pick it up for us. The ability to take out the normal bottom allows room for more mail that we can easily pick up when we get home. It looks classy and our mail carrier really did say she likes it! Waiting to see how it holds up to our Arizona heat!",
        "I'm not lucky. I got the one like the other 1 star reviewer got. Lock hole does not accept the lock. I need to spend time to enlarge the hole. Roof doesn't click perfectly. Nail holes aren't big enough to accept nail. I'm so regret to spend $100 for this item.",
        "The post was the only tricky part to properly install. We have termites and a metal post is expensive. After I installed it I got the great idea that the post was not an issue because it was in cement. Don't be as dumb as I was.",
        "arrived damaged but thank goodness for installers was able to put it back together an fix it all while it was raining so impressed with these men",
        "This mailbox is just what we need when we are away from home for a week or two. We can let the mailbox accumulate the mail instead of going through the routine of having our mail held at the post office. The lock on the access door provides some security against mail thieves.",
        "Had this for a few months now and not only does it look good it works great. We went on vacation and didn't have to put a hold on our mail. It never leaks even with our crazy southern thunder storms. We did have to cut the hole bigger for the lock as many reviews said which wasn't a big deal just used a razor knife and spun it in the hole",
        "This is one cool mailbox. Very stylish an well put together. Easy to install. I’ve read some of the complaints an I think they come from people who don’t work w/their hands.",
        "It is a good value. Lots of storage space and reasonable price. It has a little wiggle if you push it around but it isn't going to blow away. Looks unrealistic up close but good from a far. Depending on you available time and patience, I have seen projects of people painting the mailbox that made it look much better",
        "Mailbox is nice for the price, but the whole was not big enough for the lock cylinder to slide through, so I had to beat it in with a hammer, and the back mailbox door came broke.",
        "I like it!! A few notes: (1) This is not a high-security mailbox, but it is high-volume. (2) I had a very solid 4x4 post which I had to cut shorter, and adjust the dirt level underneath, and it came out very solid. (3) I followed someone else's suggestion and screwed the back flip-down door so it doesn't pop open when the mailman inserts stuff, since am on a quiet street and access it from the street side (or the big back door if we are away and pull the insert). (4) I wish I was artistic enough to paint it.",
        "I like the design and the ability to have your mail go down in the base when you are away for an extended time. The negative is that the lock was very hard to install, my husband who is very handy could not get the lock to install with out damaging the lock so now we have to try to find a new lock to fit the hole.",
        "everybody loves it---i do, because it took less than 20 minutes to install, my husband loved it because compared to the cost of a post & mailbox it was only about $30 more & no hole had to be dug. the mailldy loves it cuz she can put big packages in it without having to stop & ring the bell. my neighbor loves it cuz when we go away for a week or more, no one needs to pick up our mail cuz of all the room in the bottom, no one can tell the box is full of 2 weeks of mail. it locks, we all gotta love that. mail stays dry in oregon--lovely.",
        "If you have an existing box on a post (as I did) then you can just run a circular saw around the 4 sides at the height indicted in the instructions (2 some odd ft) and cut off the top of old post and slip this one over it. That's what I did. My only complaint is the bolts.... long and VERY LITTLE space to turn a wrench. I took a socket wrench to it and even that took a long time to turn the bolts in. Still, even with that, installation was a breeze.",
        "This is a great product. Easy to install. High quality. Very sturdy! Love that I can use the extra compartment when I am out of town and my mail is secure",
        "This mailbox was easy to install (not counting the use of a post hole digger, which would be required with almost any mailbox) and the design is fantastic. It looks great in front of the house and I expect the removable panel feature to eliminate concerns about accumulating mail or having it checked when I travel. The only problem I had was installing the lock insert for the large access panel; it was necessary to beat it in place with a hammer, which left some marks on the trim.",
        "This mailbox is perfect for people living in rural areas. When we are out of town, I remove a partition and all of our mail and small packages fall to the bottom of the tower. A key opens the back where you can easily retrieve them.",
        "This mailbox is great. Love the large storage space, we're going to be using the feature for extended trips away. It works great. And then when you are home, just put the insert back in. Great product. We've tried other \"vacation\" mailboxes before. Every other one never has enough storage. I'm very impressed with Step2, providing a mailbox that actually has enough storage inside for the mail. Great product. Highly recommended.",
        "It looks exactly as pictured, and operates exactly as described. Wonderful upgrade from our rusty old run-of-the-mill mailbox. Post isn't included, so digging and setting in concrete is required (as advertised). I took the additional step of filling the base with 100 pounds of sand to offset the wobbling and now it doesn't move at all when you push or pull it. Highly recommended!",
        "There is dent on the roof part and the secured door does not fit well, so it is very hard to open for the mail and close. Every time is a struggle.",
        "My home survived the Campfire but my mailbox did not. I ordered this and it was delivered when promised. My husband built a cement platform for it. It was very easy to put together and put up. He used a 4ft 4X4 and had it up in a day. I Love it!!",
        "Bought this to upgrade an old one, the mail carrier is really happy on not having to walk in yard to deliver mail. Nice storage for oversize packages to store out of site. Retrieve them later in locked compartment.",
        "For the price, it is not bad but don't expect complete security. The big plus for us is the ability to store a lot of mail. We live in a small community with little crime and are away quite a lot. Also we don't get much sensitive stuff via the USPS. If security is a big issue, this item would not do it for you. It is easy to reach in from the opening and get mail from the bottom of the box. So, not perfect but does the job for us at a reasonable price.",
        "This is my second mailbox like this. The first one was missing a pivotal screw for the locking mechanism. I purchased a screw and all was well until someone missed the curve and took the mailbox out. The locking mechanism will not work in the new mailbox. Once installed, the key will not turn the lock, to the point of breaking a key off in the mechanism. Don't know that I will try a third time. Everything else about this item is great but the locking mechanism is an important reason I bought the item.",
        "Arrived fast, exactly as described, easy assembly, good price and did need some trimming with a dremmel tool. Personally I used about 50lbs of bricks in the bottom for ballast VS using a post in the ground to anchor the mailbox. We have a lot of drunks/careless drivers here and it is easier to brush the box off and put it upright VS the old post system. The arid and hot environment does not seem to affect the material, but time will tell.",
        "Had this installed for a bit now. It is actually working out great! We bought this to replace our last one which had been bashed in by a baseball bat. The appearance of this one is great. And I love that during the holiday season and vacations we can remove the bottom and the mail will drop down to where people can't easily access it!",
        "Mailbox door was damaged, needed to install a screw to keep door closed, otherwise mailbox seems sturdy",
        "The installation took some time as we had no place to work once the box was on the ground (the 2 nuts that we had to drive on the back).",
        "Price was right had it for some time, now 2yrs or so number are thin and curled in sun, but the rest is great works well in hot weather, sunny Florida and love doors on both side and vacation feature. Also magnetic doors.",
        "Love this mailbox. Really complements our home. We painted it with some krylon paint. We chiseled out the lock mechanism so that it would fit. I'll echo another reviewer and say if basic hand tools are alien to you. Meaning you don't know how to use a screwdriver don't buy this. Giving a 1 star review because you can't figure that out is not the manufacturers issue, it's yours.",
        "We liked the ability to lock and to receive large packages. And if we are on vacation we don't have to worry about the mail.",
        "Installed this mail box a year ago and we love it. love that you can access from either side and not have to get by the street to check the mail.",
        "It's attractive and can hold several weeks of mail safely. On a daily basis, a platform is provide that keeps the mail from dropping down, and it can be emptied from the back side away from traffic. Without the platform, the mail drops safely to the bottom and then a key opens the from panel so you can remove all the mail.",
        "Love this mailbox. Not only does it look good, it is very functional. I can now go away and not worry about my mail being safe until I return.",
        "this should be a very sturdy mailbox. We just installed it yesterday, so we'll see. We like the fact that there is a deep locking space for packages for those times we are not at home to receive them. It won't fool anyone into thinking that it is actually stone, but it looks quite nice for a plastic mailbox.",
        "I love this product! We now have the cutest mailbox in the neighborhood and the best part is that if we go away all of our mail will be securely waiting for us. No need to ask anyone to get our mail. Totally a great buy!!",
        "Great for when I'm not at home for days at a time. No need to have my mail withheld. It all drops to the bottom and has stayed dry in the wettest conditions.",
        "Love it can hold lots and locks. Didn't take long to install either. Very nice curb appeal.",
        "I am very happy for my purchase, it was a very great investment. Now my mail is safe and secured, just one little problem my amazon mail has been left on the floor because they cant find my mail box. Sad it's very big.",
        "This product is easy to assemble and once installed, is pleasing to look at and very serviceable. I appreciate the fact that my mail is now dry and secure. It is really nice to be able to get my mail without standing in the road, the rear mail access is very safe and handy. This product weather well, keeps my mail dry, and if I am to be away for a few days I just pull out the base and the mail is save and secure in the base of the mail box.",
        "Good deal looks very nice in front of your house convenient easy to install",
        "posted by Jay G., the husband. This product is exactly what we needed. I used Gibraltar 4x4 Easy-Install Anchor Post Kit, APK00000 to anchor it to the ground. This worked well with no problems. We have already used it for a two week RV trip and it works great. For us, it will hold lots more than two weeks mail. It is a very sturdy unit and seems very solid and weather proof. The assembly instructions are OK, not that hard to understand. It looks great next to the end of our driveway. It is easy and simple to switch back and forth from the large capacity vacation mode to the normal size at-home mode.",
        "Got this after someone ran over my mailbox, and it was easy to assemble - all we had to do is attach the doors and the roof. It's perfect. If you have a lot of mail, and want to make sure that it's secure, you just pull the floor out, and all the mail drops inside. You can open the back with a key.",
        "Recently moved and had to replace our trusty \"storage\" mailbox. We vacation during summer months and are often gone for a week at a time. This box is deep when you remove or drop the shelf and can hold an abundance of mail/small packages safely.",
        "When someone took our other MailMaster Mailbox out with their car, we replaced it with an identical one. It's handy to have extra storage when we're away for a while. It can hold up to 3-4 weeks of mail is safe from the elements. The lock on the panels is cheap tho and one of ours doesn't lock securely and may need replacement. Standard size pieces work the best - oversized envelopes and packages may fit. We have some tough cold winters and the plastic will get brittle in the cold, so it can crack if hit by, say, a snowplow.",
        "If I'd seen this mailbox before reviews existed, I'd've said 'yuck', & moved on. Because of the numerous concise reviews, I took a chance on it. First off, I normally hate molded plastic with faux texture. But somehow this mailbox pulls it off. The magnets are a little weak, so I replaced them with neodymium ones. I used nice big screw on metal numbers instead of the cheap stick ons, & they look great. It's so clever the way it switches to a locked box. I understand the one reviewer who could put his arm through, but we don't have security issues like that. Our neighbors watch our house, but now they don't have to collect our mail everyday.",
        "Makes your house stand out. Everytime i go and get mail and somone passes by they say\"Thats a really nice mail box, guess you paid a ton for it\". Reasonable priced and looks great.",
        "After 2 years of putting this up still in good condition and it looks have been recently bought.",
        "I love everything about this mailbox except the magnetic latches on the doors. They are not properly recessed and cause both doors to have cracks around them, which I fear may lead to leaking. I did manage to re-position one of them and make it better (still not great) but the other one did not have any wiggle room to adjust. It appears to be a design flaw rather than a defect. All in all, I love the mailbox. I am so glad I no longer have to ask my neighbor to get my mail when I am gone a few days.",
        "Perfect for my needs. Easy to assemble and install. It keeps my mail safe if I decide to take a trip and do not want to stop mail delivery. Highly recommend.",
        "I love this mailbox. We had one years ago at our old house. All of the hardware (screws, lock, house numbers, etc) was missing from the box though so we now have to call STEP2 to get it since we already erected the main mail box.",
        "Not suitable. All plastic not durable for what I was looking to get.",
        "Overall it's a nice mailbox. I agree with a lot of the other reviewers about the lock hole being too small. I had to use a hammer to get the lock in and also take a razor blade to shave the opening a little. I also didn't like the sticker numbers that came with it so I bought some raised 4\" numbers that screwed on.",
        "I had my handyman install this, and boy, am I glad. Not only is it easier to get my mail out without stepping in a puddle or into the street, but I have had so many complements already on its appearance. This is the second Step2 mailbox I've had over the years. I had to leave the other at my house in Pennsylvania when I sold it. That one had lasted through 11+ years of summer and winter weather, and I expect no less out of this one in Florida."
    ]
}