{
    "entity": "Framing Nailers",
    "text": [
        "What's pictured here is not what I received - the unit I got is still an F21PL but it's some other version, don't know for sure which one it is. The unit works fine, that's not an issue but the photo should be representative of what you're buying. I know some items specifically state that the photo may not be representative of the actual article, but I don't recall seeing that anywhere in the description for this. Nonetheless, the unit did come with the alternate trigger assembly and the metal connector nose piece and includes the integral joist hanger on the tool itself.",
        "Bought this to build out a new deck. At first I thought this thing is huge and will be a chore to work with, but it's balanced well and comfortable to use. Both tips worked great and the depth setting is the easiest I've seen on a gun. The metal connector tip was a real time saver, ridiculously easy to line up on the holes of every bracket I used.",
        "I've owned an older N88 forever and it has treated me very well and I wanted to add to the fleet. Loved the idea of this one as it has the positive placement tip. The tip is great, if you can find the nails that fit the gun; nowhere around my neighborhood! Also really disappointed in the performance. Probably shot about 500 nails through the gun before I became so frustrated with it jamming all the time that I went back to my ole' N88. I need to return this POS.",
        "Used with metal connectors as listed in instructions. Nose cracked half way through first strip of connectors. $100 replacement part. Would not recommend.",
        "will drive nails all day- currently framing with 3.25 inch stainless nails, driving into barely dry pressure treated wood with no issues. Ran through a few hundred nails so far - no misfires or jams. depth setting is also easy to use if desired. Framing hook is plastic, seems flimsy - but swivels out of the way. Wouldve think they would make it more sturdy- no one wants a nail gun falling on them. Can be tough to maneuver between studs for the right angle - but to be expected. Beats using a hammer! I haven't use the metal fastener or alternate trigger, but tool is great overall!",
        "So far it works great! I like that it comes with the positive placement attachment as well as the normal tip. I used it to put up a fence and had no issues. Just be forewarned: you need to order the NPT nozzle separately. No idea why this isn't included as it seems to me you can't use the gun w/o it. Not a big deal so long as your aware though.",
        "A little heavy, but very dependable. I put up seventy feet of wood privacy fence, shot over 1100 ss nails, 2\" x .113, without any problem. Just wish I could get this performance from a 5 pound unit . In summary, I have to say the quality is excellent and this unit is best suited for small projects where you don't have to handle/hold it all day.",
        "Don't beat up your shoulders and elbows hammering nails, use this. Best nailer for the price. Shoots many different size nails from many different manufacturers. Don't be afraid of the sparks it makes, just wear hearing protection and safety glasses.",
        "The unit came with a small leak at the trigger. Not being familiar with air nailers, I didn't know that was a defect. Finally called their service number, and learned it was. Bostitch paid for shipping in both directions, and fixed the leak. Generally the nail head goes just beneath the wood, but if air pressure is down, the nail sticks up. I don't know all the possible adjustments. It's fairly heavy, but invaluable for nailing in tight areas, where swinging a hammer is difficult. Overall, I'm pleased with the unit.",
        "The head on this is a bit large and can be awkward between standard 16\" center studs. I know they offer a low profile version, but that one does not fire as diverse of a range of fasteners. If they HAD offered a low profile version which could also fire the same range of fasteners as this one, I would have been all over that, even at a slight premium.",
        "It worked well although it did start jamming more towards the end of project and yes i made sure I used pneumatic bostitch oil . this wouldnt have been a problem except for the fact that the gun was Brand New. older guns ive used in the past didnt jam at all but i guess thats the problem with progress nothing is made like it was.",
        "Great gun. surprised at how light it was. I knew I couldn't complain about any Bostich air gun. Have many smaller ones.Been a cabinet maker for 35 years. This one is to for addition on cabin. Only wish it came with air connector. Save me the time of looking through tool boxes for that one you know you have somewhere but can't remember where you put it.",
        "LVL's are no problem at 100psi fully flush many times over [see video]. So, all is well thus far. UPDATE: Depth adjustment will always reset to max depth at random (other reviews say same) has been this way from 2nd week.",
        "I paid for 1 day shipping for the nail gun and nails bundle and got the nail gun but no nails. Now I am still unable to work for 2 more days until the nails arrive. Not happy!",
        "Purchased this nailer because while I value quality tools and quality engineering I couldn't justify a Hitachi NR83A3 for my summer fence project. I ran about 1250 2\" ring shank stainless steel nails through it and the only time it misfired was when I forgot to add another stick of nails. Even then it never jammed. So, while I'm not a contractor and treat my tools as if they were glass, this is a great nail gun and the only thing I miss are the envious looks from those who recognize that it isn't a Hitachi.",
        "This is one of only two models that I could identify that will drive 3 1/2\" 16 d common nails, the size that is required to build a FEMA designd wood frame with metal and plywood storm shelter. On the specified southern yellow pine, it drives the nail all the way in about half of the time, and all but 1/8\" of the way in the rest of the time. Given how hard southern yellow pine is and how big a 3 1/2\" 16d common nail is, that's pretty impressive. Have had no problems with it, and it even drives in the metal connector nails just fine. Has not jammed a simgle time, it simply works as advertised.",
        "This is really nice framing gun. Easy to use and seems to be very reliable. The only disadvantage is it's quite heavy at almost 9 lb.. Body the gun seems to be very durable that's why it probably add extra weight. I noticed that it's not as bulky as some other guns I seen on the market",
        "I have observed that it work well with Harbor Freight nails (FASTENSTRONG 21° Galvanized Framing Nails). Easy setup in terms of tuning nail depth. Rafter hook is nice for holding; just wish there was box to store the item when not in use. (Makita Interlocking Cases aren't large enough)",
        "I borrowed this nailer to use while rebuilding my home after Hurricane Sandy. It has worked well in my amateur hands, although I have had to deal with jams and sticking parts. Using good grade nails (Hitachi) I have not had any issues with jams. This gun saw a lot of cold weather use and this may have contributed to the need to disassemble and clean it more than once (or maybe it was the Harbor Freight oil I had been using). When it came time to return the gun to my friend I chose to buy him a new one and keep this used one for myself as I now find it indispensable.",
        "gun self-destructed the tip after only a couple weeks of use. Purchased Square Trade option, Amazon rep told me they would issue a return authorization but did not... had to purchase another replacement gun to try and finish the job!",
        "If you're looking for a positive placement nailer THIS IS NOT IT. This is a framing nailer with a PP adapter. If you need a multi-tasker then please by all means buy this nailer (I'd recommend Paslode,Hitachi & Rigid). I'm sure this performs nicely as a framing nailer, but read online reviews for these type of adapters for PP. If you need a PP nailer only Bostich makes one called the StrapShot and does have some great reviews. I'm not sure why this comes up on Amazon's search engine (for PP nailer) over the dedicated PP nailer/StrapShot.",
        "Well.....I've been using this for about a month now. The plastic tip came off and keeps coming off. They do give you an alternate tip for use with smaller nails. It works fine, but it does take some fine tuning to get the nails to sink just right. Other than that, nothing spectacular, but an all around decent nail gun.",
        "Eh, I almost gave 2 stars but I like the product when it works properly. Gave us a lot of headaches on a building project in my shop class but everything ended up ok. I would go ahead and buy the next series up.",
        "Have used this gun to put OSB sheeting and horizontal Hardie plank siding on two houses now. I like the depth control it has to get the nail heads just right on the Hardie. I also liked the bonus tip that came with it that I used to nail metal strapping for shear walls. I am not a pro. I just fix up the houses I buy.",
        "Bought this because I developed tendonitis in the middle of building an addition to our house. It hurt like heck to swing a hammer. This thing allowed me to finish framing, sheeting, and installing flooring before winter. Jammed often with cheap nails. Feeds Hitachi nails well - but they are not inexpensive. I really like the nose piece that alloys you to install metal hardware, such as hurricane ties, straps, and joist hangers. I had several long metal straps to install with about 40 nails each. It took about 2 minutes with this nailer vs. about 15 minutes by hand.",
        "This nailer has lots of punch. It sinks the nail and head no problem. If you're used to only using screws, try this. It's a beast.No need to write a novel. It's a bamf.That's why you see it used on this old house and other diy shows.",
        "Works great. It drives nail easily. Easy to adjust depth. Some fails to fire but not an issue. Use over 5000 nails so far. I am very happy with this tool",
        "Used for total deck (support base) re-build, from post supports (nine), upwards. HEAVY DUTY and (somewhat) heavy in handling. But, once adapting to weight and \"feel\", learned how to minimize my \"muscling\" of tool and used more appropriate movement and body positioning to increase speed and accuracy. (Would have been very hard to handle if I had used a battery-powered model.) Now, question is: What do I do with a tool that I love, but don't need anymore? My Baby!!!",
        "I bought this gun for it's reputation and advertised weight of 4.17 lbs. When it arrived it was 8.6 lbs.? Amazon should correct the typo of it's weight.",
        "I am using this to build an entire add on onto my home. It has only jammed once after firing thousands of nails. The positive placement tip works very well and has only occasionally double fired.",
        "Good nailer and great value. Much heavier and larger than it needs to be. Does not fit in between 16” sections, so plan ahead.",
        "I can not believe that this magnificently beautiful and finely crafted piece of equipment does not come with the part you connect your air hose to.",
        "This does exactly what I need it to do. It has plenty of power to jam these nails into the wood. Two thumbs up.",
        "Quickest ever delivery, but there was a part missing, so Bostitch will send it in 10 days. Sort of defeats the quick delivery and holds up the project.",
        "Great nail gun. Have framed many jobs with it. It weighs about the same as some of the other nail guns, and may be a little lighter than others.",
        "Good framing nailer. Can adjust the trigger for bump firing or for single nail per trigger pull. I seem to always have help who can't make my nail guns shoot one nail per trigger pull so this one fixes that. It also has the ability to use joist hanger nails. However those are very expensive, around $50/1000 where I live, so I have yet to try that. A little bulky.",
        "This thing is a beast, love the power. it can be a little heavy but small price to pay for the power.",
        "Thanks this tool made the job so much easier.Great buy love it.would recommend it in a minute.",
        "Gun works great. But the quick trigger was not with gun. I sent a email to the seller and no response?? But I do like the gun",
        "I like this nailer a lot. Has worked great so far. Only complaint is the nose piece. Its smooth with no barbs. Kinda tricky to depress when trying to do a precise toe-nail. Sure you can pull the trigger and slap the nose to fire but if you want to position then fire, it may slide a bit.",
        "I built a 12x16 shed with this nailer, and while there were a couple of jams they were easily cleared. I'm very happy with the purchase.",
        "Powerful and well thought out nailer. The adjustable tip is really well implemented. The plastic back to the magazine is a bit fragile and the nail guide fell out of mine, necessitating repair under warranty.",
        "It’s a very nice framing gun has not jammed one time or double shot it puts the pressure to the wood and very strong stave me a ton of work! Definitely recommend",
        "Works flawlessly, used it to build a large chicken coop and had no issues. Highly recommend",
        "The nailer worked great and as described. Made my job so easy and quick... wow",
        "I bought this thinking i would need it for a second helper but i didnt. So i sent it bk although i did get a chance to test it out it worked great and i almost kept it but i need the money more.",
        "I've been using this nailer for a few months now doing some light framing work while finishing my basement. It seems to be holding up very well. It is nice and light. Best part is the local big box stores carry the appropriate nails for this gun. It is nice to have the air release so that you can turn it. I hate having the spent air blasted right in my face and being able to turn the exhaust port makes my able to keep that from happening. I would definitely buy this again.",
        "Good nails but they rust quickly if you forget and leave them outside",
        "This tool freezes up real easy. I have to keep it in the truck when not in use. It is great when it will shoot. Love having two guns in one. This is my 6th nail gun and non of the others have ever given me this issue.",
        "This bostitch framing gun has been a great gun I use it regularly I have had it for four years I oil it every time I use it and it has held up better than my previous gun. I highly recommend this gun. Light weight easy to use and most of all well built.",
        "This stopped working the second time I used it. Very disappointed.",
        "This is NOT ready to use out of the box. You have to buy seperately the air supply fitting for the nailer. The male plug fitting is only a few bucks, but buy it when you buy this gun. FYI: The nails aren't cheap, but pimpin ain't easy.",
        "Best product ever, omg we use it for everything. Thx",
        "I bought this because my other gun wasn't driving RingShank nails up tight when used on Advantech sub flooring. This gun has no problems with that. Very easy to adjust depth on the fly. Is heavier than other gun however. The top load is annoying because i always forget to pull spring back first.",
        "Great deal especially with the combination with the correct nails",
        "Arrived in a couple of days. Removed it from the box, read the instructions, installed an air fitting and ran three thousand nails through it the first day. Two more thousand nails on day two all without a problem. Easy to load and an easy depth adjustment.",
        "Bought this to put up siding on the house. Worked almost flawlessly with cheaper nails that were not recommended. Worked perfect with the ones that were recommended. Good quality gun.",
        "Excellent tool - cut my deck build time in half. The dual purpose- framing head & metal connector head made this a no brainer purchase. Had a few jams - but I think this was operator error.",
        "The nailer has yet not to drive a nail, however, the nailer foot could be improved to say on the nailer",
        "Works well once you get the feel and also purchase the correct nails.",
        "It doesn't come with a case or air hose nozzle! For 180$ you can get a porter cable gun that come with a case and everything. For this much money its a rip off! Don't buy this gun.",
        "My husband is very pleased with this nail gun I got for him as a gift so test he does not have to borrow or rent one anymore. He has used it a couple of times so far with no problems.",
        "This thing has a ton of power. I've driven a few hundred nails with it without incident. it's heavy, so an all day nailing job might be pretty exhausting, but I can't complain about the function of this nailer at all.",
        "I only did one project so far, a shed, but this gun is amazing. Super easy to switch to metal hanger nailing and back. I can't believe they made such a compelling product at this price!",
        "Took me a while to figure that to do good toe in I should pull off the plastic Mar protector. Duh. This nailer works great!",
        "Loved this nailer! We built a pole building and finished the interior walls with rough-cut lumber. This was the 4th barn we built for ourselves and the 1st time using an air nailer. Hands down a great purchase. I highly recommend it.",
        "Husband loves this as an all-around tool. Functions as it is supposed to. Great company with good reviews. He was pleasantly surprised to receive this. It came early (Yay Amazon PRIME!) and he's already used it to install a rockwall for our backyard playhouse. Great product!",
        "Prichard to rebuild the framing on my deck. Works flawlessly",
        "I ordered this nail gun for my husband to replace one he had for years. He really likes the Bostitch brand.",
        "I love this gun. I am a general contractor and have been using this exact gun for years, but the plunger broke and I am replacing it. I have owned several different framing guns and this is my favorite. I especially love the teco hanger attachment . It allows exact placement of teco nails in the pre drilled holes. Overall this is a very durable and quality gun.",
        "Bought this for doing the wood stud framing for my finished basement and it was great. Never had any of the misfire issues that I saw intermittently in the reviews.",
        "Love this thing. My first nail gun and works like a charm",
        "Works great as a nail gun. For hanger nails only OK. I have to push the nails forward because the plastic that holds them together is a tiny bit too thick and doesn't allow smooth feeding. I did use Bostitch brand nails",
        "Can't complain about this gun. Bought it for remodeling my house and we've used it for everything from framing to putting on siding. Shoots 3.5\" nails through cement board siding then 2\"+ of wall and stud. The only thing I don't like is that the little rubber framing cap (that covers the spikey framing head) fell off and I doubt we'll ever see it again.",
        "Took it from the box to the backyard. Put in over 2,000 nails day one with no issues then or since. My favorite tool to work with.",
        "I had a few building projects and I needed a gun that could handle a number of different nails to do various things. Since I am not a full time builder buying three or four guns is not practical. I can operate this gun with my pancake compressor nicely and it did a fine job. It is easy to load and the features are really good. I am happy with this. I had put off buying a nailer thinking about the cost but the time I saved building pays for the costs. Good product very happy with it.",
        "Everything is great! Glad it was also shipped overnight! Thanks!!!",
        "I bought this nailer to build a 12x16 shed. It is one of the best investments in a tool I have ever made. It's a huge time saver and it also allows you to do singlehandedly what would otherwise be very difficult. The quality is superb. It drives a 3 1/2 inch framing nail like a hot knife into a stick of butter. Yes I love it.",
        "Cannot compare, its the first nailgun i use but it work perfectly, easy to use. A very bad aspect of that is that all iron parts rust very fast. I kept it 6 month in my trunk with other tools and the iron parts look like it have been under water for 10 years. I now coverd it with different anti rust products....",
        "Bostitch - why do you keep doing this? Out of the box - totally useless. Does not incoude air hose attachment. Like buying a car without wheels - nice to look at, but you cannot do anything without a missing part. Same thing with their floor nailer. Whomever in product management who dreamed this up needs to be severely punished.",
        "I put about 10,000 nails through it without a problem. The next day it didn't work, so I sent it back for repair. It took about two weeks for it to come back. Worked great ever since.",
        "I am an amateur woodworker. So, read my review with a grain of salt. I used it for my deck repair work, and it worked great. It was strong enough to drive over 3\" nails with impressive consistency. Some of the nailers I have used before gave me more inconsistent result, driving nails too deep, for example. I was planning to sell it after using it for my project or two, but decided to keep it longer.",
        "i purchased this product because of its ability to work with multiple nail sizes and other reviews. I used this on a particular project and it performed very well. It felt well balanced when being used and I liked the adjustable hanger. the depth adjuster was easy to set and change. I have no other products to compare it too, but I have other bostitch products and have liked them too.",
        "My brother builds a house ands it helps him a lot to build",
        "Used it to build a 12x12 barn worked flawlessly. Just make sure you oil it each time you use it so it lasts a long time.",
        "A tool like this is just fun enough to be dangerous! Use one of these and you'll never want to swing a hammer again!",
        "Bostitch is a good nailer but showed up beat up loose in a torn up box. Amazon service gets worse and worse; buy your tools elsewhere!!!",
        "Before I purchased my first framing nailer, I read the reviews and they were convincing. There may be better guns out there, but I love love love this gun. Granted, I am a novice, home owner, etc, and so take my comments in proper context. So far I built a 15x30 shop, a root cellar, renovated my basement, built a deck, and it still operates effectiely. I don't how many nails I've shot, but it hasn't jammed yet. It's a bad-A** gun. Very pleased. It has lived up to the policy reviews that I checked. Pros: Very durable, high quality, good price, American made. Cons: Zero",
        "I like it very much. It having 2 different uses is ideal for what I needed for building a deck",
        "I bought this gun for the full rounded nails. Me being prone to errors I figured it would be easier to pull nails out when I screw up. That turned out to be true. This nailgun certainly does the job, but I had 2 issues: 1. It was a little heavier than other framing nailers I've used. For weekend warriors such as my self an all day project may make you fatigued. 2. The rubber grip is not tight on the tool. This means if I don't grasp it firmly the grip slips around easily on the handle. This may not be the case with everyone. Other than these 2 things I haven't had any problems like jamming etc.",
        "This is a great nail gun. I have others by Bostitch and have had no problems with any of them. Buying from Amazon was easy and saved me money. The gun was packaged properly and i had no issues with that anything. This gun is great for just about anyone from professional to the handy man in all of us.",
        "Bostitich are the toughest and best for the job. I got this to do our skids and crates and is working great. Lightweight and dependable. It is worth the price all day long.",
        "what a monster, nothing but pure power, I love it. It can and will handle everything thrown its way. Great construction and it even looks good. Very happy with the Bostitch brand products. I now have two, this one and the 15 gauge nailer. great tools",
        "seal failed after 15 minutes of use. I did like the connector nailing feature until if failed. I nailed the rest by hand. Return was easy and I now have a new one but have not used it yet.",
        "This was a great addition to our toolbox. In years past it would take forever it seemed to finish a project that included nails! This cut the time of any of our projects greatly!!!",
        "Works Great and for the price I did not go wrong.",
        "Works fine. Body is large and can be difficult to fit into some stud/joist spaces and may be challenging to handle for individuals lacking in arm/hand strength.. Nice depth adjustment and drives 3 1/2\" nails effortlessly. Good value.",
        "Dream come true for deck building! This nailer does exceptional work nailing metal connectors- the attachment is easy to install- just press the silver button on the top front to release the framing nose and install the metal connector locator nose- excellent! Do not hesitate to use the proper metal connector nails- normal nails dont fit the bill! The 21 degree style is also perfect for installing the decking with pneumatic screws",
        "This gun works good for your typical framing. But not for sheeting. 10d plastic .148 nails that I can fit in all my other guns won't fit in this gun. Even tho it says it does. I also bought it because it says it can shoot metal connection nails. Well make sure your local store stocks up on 21 degree .147 nails. I went to a couple lumber yards and only could find 33 degrees. I'm staying with hitachi.",
        "gun is very inconsistent shooting nails, some get driven way to deep others stick out 1/2\". tried adjusting multiple times. holds 1/3 less then wired racks of nails."
    ]
}