{
    "entity": "Framing Nailers",
    "text": [
        "First time DIY roofer - Just finished putting a roof on my ranch style house. Very happy: Positives: Low cost, dependable, easy to load, powerful, fast, light enough. Negatives: Learning curve to prevent double nailing (minor). Loud (expected). Details: Bought this over a cheaper model because it's the model that HD rents. Purchase cost was lower than renting (long time doing it after work & weekends). 1 jam in entire roof was easily cleared. Simple depth adjustment only had to be done once. Used Bostitch nails - They dropped right in, fired regularly. Learning curve: Had to train myself to hold it firmly & be very deliberate about down-up motion. No biggie.",
        "Bostitch has always been my go to nail gun but after these ones I think I'm going to look elsewhere. Maybe I got a bad batch or maybe it's just how they shot nails now. Couldn't get through a bundle of shingles without at least 20-30 nails going in sideways. I thought maybe it was the nails so got a new box but the problem continued. All the other nail guns are shooting nails just fine. These fine used to be the bar but now, not so much.",
        "Bought it to roof a new shed and to use on a separate house remodel project. There is no reason to not buy new- they sell used and beat up on Craigslist for top dollar, and renting one for more than a couple of days makes buying a new one, using it as needed and selling at a later date a no brainer money-wise. Worked perfect, as expected from a new Bostitch. Never a misfire, and loading is super easy with the flip open one-piece side. Time is money- having a brand new nailer that didn't need to be futzed with or rebuilt before it worked correctly was worth every penny to me.",
        "Works great, much better than Makita. I just finished working with my son-in-law to reroof his house, saving $6,000 in labor and profit (California prices!). I bought this nailer and also bought a Makita so we could both be nailing at the same time. Bostitch far outperformed the Makita, which double fired on a regular basis, jammed twice, and was heavier to boot. I am a big Makita fan and have lots of their tools, but in roofing nailers they don't have a competitive product.",
        "im A roofer by trade. My boss had provided bostich guns for us at work so I purchased what I know. Extremely dissenting. He purchased all his from abc supply co for almost 80 more per gun. I saw the price on these and thought same gun better price perfect. This is definitely not the same quality gun. Nails shoot out on an angle. Struggles to feed nails to shoot and I have to open it up and reset the coil. Extremely disappointed and will not be purchasing any tools from amazon again.",
        "I can't believe I ever roofed without one of these. That said, I can't compare this roofing nailer to any others, but I put together a small 7-square roof over a weekend and had absolutely no problems with this guy. I also got the N75C-1 siding nailer for this project, and I definitely prefer the single-door loading mechanism on this model, so that's a great feature. If I had one complaint it's that I'd like more graduations on the measuring foot, my shingles needed a spacing that wasn't available on the gauge (something to an eighth and the gauge only does quarter-inch increments). But also I ended up just not needing the gauge so everything turned out fine.",
        "Overall a good gun and good value. Only issue with the RN46-1 is that you can't turn off or adjust the bump firing mode. Yes, it also has single firing capability, however, when trying to hold a shingle in place on a steep roof pitch and single fire the gun with one hand the recoil is often enough to lift the gun enough to reset the bump fire and fire another nail before you can release the trigger. Then you usually have to stop and deal with a unset nail or gun jamb. The model RN46-2 only has the single fire per trigger pull mode.",
        "Gun failed after about 12 shingles, Bostich paid for shipping back to their repair center but gun has been gone now 3 weeks. Will give it another review if and when I get it back.",
        "Admittedly, this is the only roofing nailer I have used, but I have used a variety of nailers of better and worse quality and this one is very good. The castings are good quality and lightweight, it only jammed once in a week of heavy use, occasionally shoots a double nail but rarely, and the nails are set well in cedar shingles without splitting or going through them. And if you've ever shingled with a hammer and nails, man is this ever easier and better. Highly recommended.",
        "After roofing a couple small sheds the old fashioned way with hammer and nails, my latest build was quite a bit bigger so I took the plunge to get this nailer. Wishing I had done this years ago. Worked great once I got the hang of it. Had a few double nails to start so takes a little practice to get good with it. Saved me hours and worked great. Highly recommend.",
        "Wish the instructions said that you have to use this sequence to get the nail gun to shoot ONE nail, not TWO: (1) Pull trigger and hold (2) THEN press the nozzle against the shingle and ONE nail will fire. The way you do it that makes sense doesn't work, because you put the nozzle on the shingle, then pull the trigger and out comes TWO nails. Once the handyman got the hang of it, it worked fine.",
        "The nails don’t land evenly. No matter how hard or carefully we try, it’s extremely difficult to get a nice flush shot. Even if we do, there’s no consistency to it. It’s a great price, because the gun isn’t as great as all these positive reviewers make it seem. Heads up.",
        "For those that might complain about double nailing, it's true, it can do that. This gun is for roofing, it is designed to P!$$ nails for hours. Hold the trigger down and bump nail, it won't double feed. It's light, doesn't care much about air pressure, it does run fine off a dinky compressor and small air hose. I say it's the best for the money.",
        "Great gun. Watch for a while and when price was more than a hundred , hundred fifty dollars less than local home stores I jumped. Showed box store employee what I paid and he couldn't believe they were so much more expensive. Haven't yet begun to start roofing project (winter) but have no doubt it will work fine. Am loyal to this brand gun over 30 years.",
        "Just did a 3 square shed by myself with this nailer and it really saved me a lot of time and frustration. Only had 3 jams on the entire job. I was using some questionable coil nails, like leftovers found in a dumpster, so I blame the nails not the nailer for the jams. I had better luck with bump mode than trigger fire. I had a lot of double taps with trigger fire, but I think this is user error. Every nail gun I've ever used has had this problem. Anyway, in bump mode I didn't have any double taps. This nailer is worth the money, even if it's just for one small job.",
        "shingle a shed roof 16'x12' read the instruction an after a little adjusting an some practice things went smooth. I do handyman work so it is not like I am going to do roofing every day maybe 3 or4 times a year. So this is going to do me just fine the last job payed for the tool along with a extra box of 1.25 inch nails. did not get tired of holding it / when it ran out of nails it stop great feature / easy to load . This is a tool anyone can use.",
        "Typical Bostich Pneumatic Nailer, works great! I only have one complaint being often when nailing using the trigger, it would double nail. When pulling the trigger and using sequential nailing feature it works perfectly. I own 5 Bostich Pneumatic Nailers, Framing, Finish, Brad, siding, & now this RN66 Roofing Nailer. All work excellent. I wouldn’t own anything else.",
        "I’m not a professional roofer, but I have installed shingles on 6 or 7 homes, garages, and shops. The first few were done with a hammer, the next few with a used Bostich nailer - which died. It had been so good that I decided to purchase a new one for this last project. I was very pleased. Not one jam in 5 squares of shingles. I started out at “1” on the nail depth setting at 100 psi, and didn’t have to make any adjustments. So far, it has worked flawlessly!",
        "Flawless performance. Don't waste your money on any other brand. I dropped this gun from the peak, it went 18 feet to the ground and didn't make a mark on it. Have not had a single jamb with it. It's easy to use, well balanced and works great. A couple of drops of oil in the air fitting every morning and you are good to go.",
        "The main reason for this review is the supplier. I had an issue with the original shipment he personally worked with me and got me a shipment out of New York during the covid crisis and took personal responsibility to make sure I got it quickly and was very satisfied. You just don't see companies taking personal pride like this anymore it was refreshing.",
        "Great price. I already own several other Bostitch nailers, including a finish nailer that is 20 years old. I bought this because I had two roofs to do in my flipping business. Time literally is money for me. I thought it would cut my time in half. It did way more than that. After getting all the prep work done, I shingled an entire 4/12 roof on a 20x18 garage in one day. Not bad considering I also had to take time out to lay the synthetic felt alone on a breezy day. Great product and easy to load.",
        "Pretty much every roofing crew I see uses this gun because it works as it should and it's cheap to buy. Almost never jams, takes job site abuse and keeps on working perfectly. This nailer is like an old pickup truck--built tough and dependable.",
        "Buy new and be sure that you understand how to clear a jam! All of these guns will jam, but clearing them is the trick. I am a second time purchaser of this model and would buy it again. It has done a great job and is reasonably priced. The settings aren't as accurate as I would have liked, which is the reason for a '4' rather than '5'. As a woman, I found the grip to be good, and the weight and handling to be excellent.",
        "Wonderful product. Add a auto oiler in-line and it gets the job done. Trigger won't fire when its out of nails...which is great for the product life. My other nailers will dry fire.",
        "I used this mailer for a small roofing job. It worked flawlessly and cut my roof time tremendously! Good value and saves time. Easy to use, too!",
        "Nice guns, these people know the definition of quality. I have two of Bostitch's guns and a their compressor with a bunch of accessories. I'll be buying more.",
        "First time roofing with a nail gun. This item worked great and made my job go so much faster. Good quality product that gave me no problems whatsoever. A joy to use.",
        "Get the air pressure right (about 90 psi) and this thing works like a champ. It's a big gun and it does a big job. I'm pleased with it.",
        "I already had one and got this 2nd one. All of my properties had bad hail damage and this allowed 2 of to work at the same time.",
        "I purchased this nailer because the two other ageing nailers I own are on their last leg. An original paslode and a 15yr old porter cable. Both good guns also, but I was concerned about the new porter cable not being as good, and the new paslode is a lot more expensive so I thought I would try the bostitch. This gun is very well made and light weight. I really like the last nail lock out as it saves blowing holes in shingles. Also the one piece fold down loading mechanism is easy, simple, and quick. I would definitely buy again.",
        "I bought this when I decided to remodel my garage and second shed back. My intent was to just put the shingles on but ended up using it to hang the Hardie plank siding as well. Good investment.",
        "It is about the right weight for it's design. Had to buy a separate attachment to work with installing vinyl siding.",
        "I used this to shingle my house and it worked great. A couple of jams, but I blame the nail coil being bent and not the nail gun. You can buy a professional grade for twice the cost, but this isn't something I use every day for a business so based on value I give it 5 stars.",
        "I purchased this nail gun for vinyl siding. There was some negative responses in the reviews, but with the Bostitch VSA4 Vinyl Siding Adaptor made for vinyl siding, this gun does work. I did have to remove some of the nails when they missed the slots, but still more efficient than hand nailing.",
        "We've only been using this for a short time, so can't comment on how well it'll hold up, but so far it's been working flawlessly. We've had to tap a few nails in that weren't quite flush, but that's to be expected. No complaints.",
        "Excellent functionality.. and speed. I’m very happy with this purchase.",
        "I bought this to do only one roof, my own, and I glad I did. Worked well, was easy to load, and only a few jams that were easy to clear. I did the job alone over 3 days. Could not have done that with a hammer.",
        "Wow is this a great light weight easy to use nailer. I love it!! No misfires or odd quirks, just works as it should.",
        "I used it to reroof my garage that has 1x8s for the roof deck. The Bostitch nailer never missed a beat. I armed it with 1-1/4 inch Bostitch nails and operated it at 85 psig. I was very satisfied with the consistent driving performance.",
        "My hubby loves his new nail gun. This is the only brand he'll use with being a roofer for 20+years. He was very impressed with the price and his coworkers were a lil jealous that he got his so much cheaper than they got theirs.",
        "This nailer works well and seems to be well-made. A great purchase.",
        "I actually bought this gun for hanging Hardie plank. i read many reviews and this one had the power to send a 2\" ring shank nail into the hardie. It typically left the nail heads about 1/8-1/4\" proud but that is exactly what i wanted because i wanted to use a hammer to drive it the rest of the way. very rarely jammed and of those times that it did it seemed it was user error.",
        "We were able to buy two of these for the price of one here!",
        "Saved me hours of hammering for my latest roofing project. Occasionally I would get the double nail strike but I'm pretty sure that was because of my inexperience and not the hammer. Very happy with the purchase.",
        "Nice tool-I used on asphalt shingles and cement lap siding. Well worth the money!!!",
        "It’s very lightweight. It hasn’t jammed. They sell a adapter for vinyl siding great bye I recommend it!",
        "Not as fast as my old Hitachi,but a quality gun. It is quirky with operating pressure.",
        "I purchased this to nail up Hardi-backer Masonite board in shower enclosures. I do not like screws. This did and performed as I expected it to and it cut my installation time in half. I wanted to minimize the hammering of nails on framing for all the usual reasons and this will be a huge aid. I can also use it for lap siding which is a bonus.",
        "Not one jam or problem, one roof and a huge amount of moisture barrier, full box of nails on the roof and 1.5 boxes on the barrier and not one jam",
        "Two years ago I bought this,work it hard,it will take it great great gun for the money",
        "The best roofing gun I've ever used hands down. Others have less power, stop working in the cold, don't fire right, etc. I've tried almost every other roofing gun out there in my 15 years of installing, and I always come back to this one. Probably gone through 8-10 of them.",
        "product worked great i used it to put my roof on i had 0 problems A+",
        "I used this to install 30bundles of OwensCorning Oakridge shingles for complete replacement of a garage roof. I had no problem.",
        "Lots of misfires followed by double nails. Not at all satisfied.",
        "Great product! Bought this to re-roof my house. Don't worry about miss-fires ect. Took a little time of learning how to use it & regulate proper air pressure.",
        "Bought this and the vinyl siding adapter for putting up vinyl siding. It has worked wonderfully without any issues. We put 15 squares up in a few days. We used my Bostitch framing nailer to put up the trim boards. Everything worked wonderfully.",
        "Bostitch makes great tools so I knew that this roofing nailer wouldn't let me down and I have to say...it didn't in the least. I put on 38 square of shingles and only had 1, yes 1, misfire. It's a little on the heavy side but it is balance pretty nice so I could go all day and my arm was still in good shape. I'm very happy I went with Bostitch.",
        "Works great. I used it for my 8' x 12' shed roof. Loading the coil of nails was a snap. I would recommend to a friend. Only down side is company do not provide instructional video to use it with Vinyl siding, basically you are on your own to figure out. As instruction paper has no information on it.",
        "I used this product for my new roof. It is a very fast nail gun. It shoots over 700 nails a minute. It was delivered quickly considering the country is in a pandemic. It had an excellent protective packaging.",
        "Bought these to do storm damage replacement of my roof on house and garage. Was very pleased with the performance and wouldn't want do shingle without something like this. I was never as fast as the pro's I could hear in the distance, but made the job \"almost\" fly by.",
        "I purchased this nail gun to install the roof on my home. I also purchased Bostitch nails to insure proper operation. During the installation of approximately 3500 square feet of roofing, I experienced two jambs and they were easily cleared. Keep it clean and oiled and it will do everything you require of it.",
        "Worked great! Easy to use. Would jam occasionally but easy to clear. If tackling a roofing project on your own this is totally worth the money even if you only use it once.",
        "I decided to replace the roofs on my house and garage decided to purchase this nailer to help save time and wear and tear on my body. Oh boy, am I glad I did. The nailer worked flawlessly right out of the box and I was able to easily adjust the nail depth on the fly. I wish I had one of these years ago when I replaced several roofs for family and friends. I love this nailer and am now looking forward to roofing my shed and helping friends and family with their roofs. That is only if I get to use this nailer only.",
        "I like the fact that you can set the depth buy a dial on the nail gun at self that is awesome would recommend this product.",
        "Great roofing nailer. Only wish I bought two of them to make the install go quicker.",
        "it's a roofing nail gun. bostitch is well known and works great. cant ask for anything else. price is great too.",
        "Works great, lightweight, I have had this for over 5-6 years now and it sure beats using a hammer.",
        "Great nail gun. Only 1 misfire so far, out of nearly 500 times using it.",
        "I tried to use it to put up siding. It would nail several perfect then one would go on different. I would have to stop and pull it out. Found it faster to do it with a hammer.",
        "Recently bought this to re-roof our house. My wife used it for 12 straight hours with absolutely no problems! Very light with flawless operation. She had never TOUCHED an air nailer of any kind (claimed she was afraid) before this one, yet actually had fun with it!! I'm sure she could have gone longer if we didn't run out of roof! She wouldn't let me use it. The few times I was able to pry it from her hands I found it very comfortable to use. I've used several coil roofers in the past, this is the best I've held. Very light. Overall, excellent gun for a reasonable price. Highly recommended.",
        "Bought this to do my moms roof instead of doing it the old way, man am I glad I did, I would rate it a 9 out of 10 since it seems to be a little fifnicky with older planks, I turned up the pressure slightly more than recommended and it pulled thru. Would buy another if needed...",
        "Had to install a new roof on my garage, Worked great. No jams with 1 1/4 nails.",
        "Great gun. I've always used bostitch for roofing houses, Hitatchi guns are also very nice but they are quite a bit more expensive.",
        "Oiled everyday and have had no issues. Highly recommend, been roofing for 30 years and this gun is good!",
        "Used this for installing shingles on a large A-frame cottage.roof. It works extremely well. I jammed only a few times during the entire installation, and it was not had to free the jam. Great nailer.",
        "I purchased this to replace my shed roof, which is about 2 1/2 squares of shingles. I only had 1 jam, and it was easy to fix. Overall, i found this nailer to be a great purchase, and it worked fine with my 130 psi Porter Cable pancake compressor.",
        "I don't know what is wrong with this. I love Bostitch. I got a lot of different Bostitch nailer. This one didn't work great. Maybe because I used Dewalt for the nail? Even the right size of nail?",
        "I love this nailer used it in the past, ordered one. Came with a broken trigger, ordered a replacement, not happy but won't cry if the next one comes and isn't broken",
        "I just finished installing 7200 nails in my roof using this nailer. It needed 90 psi of air pressure to operate correctly. I had a large enough compressor to easily supply that amount of pressure and the nailer worked perfectly.",
        "I bought this to re-roof my house. Reviewed many other brands and decided on this one. I also bought the same brand of nails for it and only had 3 jams which was probably due to the multitude of previous nails in my 40 year-old sheathing!",
        "House favorite, I buy all our guys this gun. Easily adjustable gauge, as long as everyone is on the same page. I don't like how difficult it is to adjust the gauge on most other guns. Alan wrench etc, it sucks.",
        "It took me a month to receive this item very disappointed",
        "These guns work great. Oil them as needed and they never jam. Has several depth settings.",
        "Delivery was as promised. Used the nailer to finish off my house. Already had about 1/3 done by hand. With the weather closing in, I realized I need to speed things up. The nailer helped me with the remaining 2,000 sq. ft. Worked straight out of the box. It took very little time to adjust the depth setting. Great tool. Only one miss fire. If you already have a compressor, I would recommend this even if you only have 1 large roof to do.",
        "I've done three good size roofs with this nailer, and and it's hasn't misfired more than three or four times. And each of those events were really easy to take care of. I have absolutely no complaints. Yes, I would do it again.",
        "The gun works fantastic.. whish I would have bought sooner",
        "I had an old N-12 for 25 years, no explanation needed. I hope this one lasts at least half that long. Excellent feel and handling, lightweight, and some new features my old gun didn't have. Excellent price thru Amazon, I saved $60.00 vs local purchase.",
        "Worked great, high quality, shipped fast, took it out of the box and right to the roof 19 square and not a problem, plan on having this for a while. And with the price you couldn't rent one for a couple days.",
        "I've used it on 2 roofs so far. Very light comparatively speaking. Other than a few double nail fires it's been a dream.",
        "Can use this gun in sequence or contact at a great price. Great mechanism for depth control and is easy to replace the coil nails. No problems yet.",
        "34 squares of architectural shingles behind me using Grip-Rite 1.25\" x .120 wire coil galvanized collated roofing nails ... and not a single misfeed or jam. I'm very pleased with this gun but took a star because I got double nails more often than I liked while bump firing. Pros: * Bump fire * Light weight * Reliable feeding * Easy to load * No tool required for depth adjustment * Integrated shingle spacing gauge Cons: * No hard case or tool bag in which to store the tool * No adjustment for head sensitivity to help eliminate double fires",
        "Tool met expectations. Seemed to work a little better at setting nails when using Bostitch brand nails. It was sometimes very easy to hit the trigger a second time causing a second nail to be set.",
        "I haven't used it for roofing yet but I did test it on some plywood. And worked great I think I will be happy with it.",
        "Got this for my husband on Father’s Day and he loved it !!",
        "this is the second one of these things that we have tried, thinking the first one was just defective. it works sometimes; then, it will either jam or shoot multiple nails at once.",
        "Great nail gun roofed my whole house only had 2 jams amd they were caused bi bad nails.",
        "This product did an outstanding job when replacing the roof on my house this reduced my time by at least half. My only complaint would be sometimes it would double nail completely or partially. I would like to see an optional switch for the trigger to combine the 46-1 and 46-2 trigger actions. I have several other roofing projects so this tool will be invaluable in completing these to-do projects.",
        "I research all my tools long and hard before I buy. This roofing nailer is the best I have ever used. Love the reliability and lightweight housing. Highly recommend this product.",
        "Saved me hours of work and never missed a lick.",
        "This is \"the roofing gun\". Accept no substitutes! Fires perfectly, light and nimble, and takes a beating. A must have for anyone doing roofing."
    ]
}