{
    "entity": "Combination Padlocks",
    "text": [
        "Advertised as 2 locks with the same combination. I hope you don't need 2 locks with the same combination.",
        "1 of the 2 locks is starting to be difficult to open and its not even opening on the correct last number in the combo. I have to rotate the dial and keep yanking when im close to the number I need and hope this lock opens. So im.glad I bought the double lock pack. Now I have to hope the other lock doesn't do the same thing. Master lock used to be a good brand. Don't know why their quality has gone down.",
        "I was sold on the \"2 locks, 1 combo\" and I get my delivery to find 2 locks, in the same package, with 2 very different combinations. I was able to open them using the combinations provided but I wanted the same combo for each. Very disappointed.",
        "These locks were used to put on gates in our back yard. They remind me of the old school locks used for lockers at your local school. Came with a simple combination, unlocked it and bam! Ready to use. Numbers appear as they should and dial turns just fine. All I can do is hope they last as long as the old ones did. You could use the same lock all your high school years if you were able to keep up with the combination.",
        "The only issue is that they DON’T have the same combination!! One of the locks worked with the combination (luckily because I needed it), but the other lock definitely didn’t have the same combo like it was supposed to. They have the little sticker on the backside of each lock with the (same) combination... and one was incorrect. Otherwise the locks are fine, but since one is completely useless... I definitely wouldn’t buy again.",
        "I trusted but Master Lock Failed - 2 diff combos. Even tried each combo on the other. Nope - need 1 replaced overnight and i'm buying anohter one and hope that 1 of them is right and only need to return 2 packs vs 3 packs and start all over. School is starting and I don't have time for this. HORRIBLE quality inspection on Master Lock.",
        "Basically unusable after just 8 weeks. I ordered a two pack and immediately placed them on doors of two outdoor sheds. So these locks started use the end of June and by mid August both locks are broken. They will not open reliably. Today I tried the combo a dozen times before the lock finally opened. I’ve never experienced a problem like this with a master lock so it makes me wonder if it is a knock off.",
        "I received these locks which were a great price. Proceeded to use the combination to open them the first one opened fine, but for some reason the second one only opens when you yank on the walk after inputting the combination. Not sure if I’m going to be able to use that lock properly but it this point for the price I paid getting one good working lock is sufficient for me",
        "Please check your locks carefully. I received this 2-pack lock with the “same” combination code. When I opened the package up, each lock had their own individual code. Neither one worked on the other. So hopefully you don’t need the locks immediately, very upset that I have to return them.",
        "I bought these for my son who will be starting middle school. I received my padlocks yesterday and they work as they are supposed to. Both of mine have the same combo. I read some reviewers that said theirs came with 2 different combos. They sure don't feel a solid as the ones I was given when I was in middle school. Hopefully it will withstand middle school wear and tear.",
        "I read a lot of reviews here and most of them said that the locks came with different combinations. That is not the case with this item. I just received (8/21/2019) and both of the locks had the same combination. We plan on using it for a gym locker and also as a bike lock and it's more than satisfactory. Just wanted to set the record straight on the singular combination. Buy without hesitation!",
        "I got a pair of lockers as it’s high reviews; however, it took me a while to figure out how it works, also one of them it’s not working so I ended having to return and buy another new pair. I wouldn’t try second time for the same item.",
        "Compared to my earlier version the new amazon one feels much cheaper. The dial sticks a bit. Not sure if it’s just cheaper materials or if it needs to be broken in?",
        "Unlike other reviews I read before buying , my locks came sealed and with matching codes , nothing really special about the locks besides being reliable and sturdy locks good for use at a gym .",
        "I bought this for me and my other half since we normally get side by side lockers at uni and its a hassle to remember different locker combos when we need to get into the others locker. Overall its a pretty great experience but recently with one of the locks has begun to stick whenever you spin the dial and also when you try closing it to lock back. Not sure if water got on it or something since some of our lockers are located in a pavilion like building, but oh well its still usable. PLEASE REMEMBER this is buy is for 2 locks with the same combination pattern! Don't give bad reviews cuz you didn't read the specs.",
        "Just like when I was in middle school, these work smoothly and locks easily. They haven't jammed on me or my students, as I have a dozen of these so that they can practice dialing and opening them for their future lockers in middle school (I teach 5th grade). Master Locks have never failed me so far! The only thing I would have liked - to be able to choose a lock that dialed L-R-L instead of only R-L-R, as I have left-handed students that would have benefited from this option. Cheers.",
        "master locks used to be good locks, these are junk !!! maybe there's a better version of master lock out there but these are garbage. they rarely take the combo(yes i know what i'm doing), the face is flimsy, once unlocked you have to fight with them to relock, just horrid",
        "Bought these for the gym and they are super easy and very durable.",
        "Love the convenience of having 2 locks with the same code for my building with 2 doors on it. That way we don’t have to worry about extra keys and can easily remember the code for either door and not mix them up",
        "Unless you go to the gym with your Cartier necklaces and a laptop full of nuclear secrets, I'd say these are good enough. At ~$3.50 each, you can't beat them. Having two with the same combination saves you about 24 bits of memory in your wet drive, which is almost enough for another pin code somewhere.",
        "Before reading any reviews (and found out about how easy these are to shim), I bought a pair of these locks and was happy with them and would have given them 4 or 5 stars. However, I am using these locks at a gym and the lock acts primarily as a deterrent, they still have some utility. That being said, even with other people in the locker room, if someone made a shim at home and brought it to the gym, it would only take them seconds to shim the lock. Therefore, I am giving these a rating of 2, in order to caution others before buying but also recognize that they have some deterrent use.",
        "These worked great to give my incoming sixth graders practice opening a locker.",
        "Poor QC. The back of the locks are rough and not filed down; potential paper cut hazard. Lucky I am a handy man and have a metal filer to smooth it out. Otherwise, I would have returned it.",
        "So far so good :) I was just happy to receive two with the same combination after reading some reviews that their set had different ones.",
        "Great, classic Master Locks. I do wish that there was a way to switch the combinations, but I obviously understand why this isn't possible. At least the two that they give you are the same, so there is no need to memorize two different combinations. The lock isn't going to keep out a determined thief, but in my opinion it works great for a gym locker where someone isn't likely to have the time to break the lock without being seen.",
        "I bought these to use on an outdoor garage door. knew they wouldn't last forever, but both had to be cut off after about 4 months of use. maybe they are not for outdoor use?",
        "Says made in America..but I'm guessing China...one lock works with the combination the other will not open....",
        "Master locks are the original and best locks that you can buy for a locker. I wouldn't recommend anything to anyone else. I had one for years that didn't break down on me and was always easy to open with the combination. The only reason I bought these again is because I lost that lock. These are very secure short of a very determined and skilled thief. Once again, don't buy anything else for lockers and general purpose locking, especially since these are as inexpensive as they are.",
        "Perfect all-around combination lock to provide just a little protection for your items when needed. Won't stop someone very determined to break in, but good for general protection.",
        "I like the locks and have been using them my whole life basically. This recent order I received had two lock with the same combination, but one of the locks does not open. I am assuming there was a mishap in packaging and now one of the locks is basically useless..",
        "Great lock- bright white on black, heavy, solid, locks as soon as shackle returns into lock . Fits well in my gym locker. AND I can see the numbers without my glasses. The only issue that many gym users have the same looking lock- so I still have to remember my locker number. ; D",
        "I was surprised to see all the negative reviews of master locks on Amazon. Either some of the reviewers are getting defective products, or they do not know what in the world they are doing when it comes to closing and opening a lock. I use one for my desk and one for the locker at the gym. They open like clockwork every single time, never a hiccup or an issue with either one of them. Also I use these on a daily basis. I've used Master Locks since the early 90s and have never had any problems with them. Great product at a great price.",
        "Great locks. I purchased the locks for use at the gym. When i purchased the locks it was an amazon add on item and at a great price. The locks are easy to use and great for use at schools, lockers at the job or at the gym. I would recommend the locks to any one who needs a basic combination lock.",
        "They work. One lock is harder to open than the other. But, yea like your old school locks, pass the second #, straight to last #. Brought this item for gym.",
        "I bought the 2-pack. Only one of them works. The other cannot be completely open. I’ve already thrown away the package, so I guess I can’t return. Could you refund me half of the price? I’ll update the review notes if I hear back from the seller.",
        "These locks essentially do not work. I have to try 3-7 times to get these locks open. Typically, it requires being very slow and precise with the movement. Even knowing that I still have a difficult time getting them open. They are so bad, I wonder if they are knock-offs being sold as the Master Lock brand. I have other master locks, which work just fine. I get them open in 5 seconds every single time. These are definitely different. Do not purchase these.",
        "Love the fact that locks now come in sets for kids that use a lock for everyday locker and gym locker. This way they only have to learn one combination. I wanted to purchase these at the beginning of summer and they were difficult to find in stores. Seems stores only carry these when the school supplies come out. I knew Amazon wouldn't let me down. I wanted to give my kiddo a chance to learn the combination before school started. These will definitely do the trick.",
        "These bring me back to middle school. They’re basic, one of them is a pain to turn. Grinds hard and causes me to skip my number. But I think I could wd40 that mother and it’ll work wonders. These two locks have matching numbers so keep that in mind.",
        "2 locks with matching combinations, as ordered. They are hard to open, when putting the combination in exactly. They open more reliably when I turn one number past the official combo numbers. We'll see how they hold up.",
        "I specifically ordered these as it says 1 combo work on both locks. Well this is not the case both locks have different combinations.",
        "You get what you pay for. These a pretty good locks they get the job done. I see in many reviews people have commented about thieves picking the locks. I personally only use them for the gym so if they want to steal my dirty socks, go right ahead. When compared to the originals they are different and its apparent almost right away for people who are persnickety like me. Both locks have same combination by the way.",
        "These aren't as solid feeling as my 25 year old masterlock I used in highschool (still going strong) but they're decent in quality. I didn't expect them to be as high quality as the ones in the past so I was pleasantly surprised when I saw that they were not bad at all. Five stars since I don't expect them to fail. Didn't expect the shim resistant feature. Not sure if it's real but if someone really wanted my underwear in the gym locker, I think they'd just cut the lock.",
        "These are the traditional pad locks we’re all used to. They seem a bit flimsier than I remember from high school but they work. You get two pad locks which use the same combination to open.",
        "Just like what I used for locker in high school. Using it for the gym locker, don't have to worry about losing the key for a standard lock.",
        "Bought these for my son who is going off to Middle School, so he only has to remember 1 combo for both his hallway locker and gym locker. Opened them to find two different locks. Now I'm stuck because it's past the refund time for Amazon. Should've opened them sooner, but I trusted Master Lock to have quality control of their products. DO NOT BUY!!! You're wasting your time and money if you do.",
        "Got these for the kids when they started middle school. Have done the job. Price is nice. Like that you can get two with same combo if you have two lockers (book and gym).",
        "They got stuck and school had to cut them off cause the teacher and principal couldn’t get it to unlock with the code.",
        "One of the locks doesn't open, no matter how many times I try. I'm sure I'm doing it right because the other lock opens every single time.",
        "Master Lock is the go-to brand. Period. Best lock and cheap.",
        "I like they have the same combination! Very sterdy use them for the gym works great",
        "Both locks have the same combination! It makes so much sense when they have a hall and gym locker.",
        "I loved that these came in a two pack. My child who is in middle school loves that they are both the same code number (easy to remember one code instead of two) Once is used for her school locker, and the other is used for a PE locker.",
        "Grateful for the twin pack! Great value for a reliable lock.",
        "Someone else said they feel like knock-offs and I kind of agree. But I knew that going into it, because I was mostly looking for something to deter someone from stealing things out of my apartment storage locker while spending the minimum amount of money. This does the trick.",
        "I read some reviews saying that the locks came with different combinations, but now the combination is the same. This is very useful as you do not have to remember two combinations! The build quality is good.",
        "Some of the reviews I read said they received locks with different combos, but mine were the same combo and very easy to use. Great to be able to simplify life with one number set in different locations.",
        "Both locks were hard to open upon arrival. I thought they would work better over time. Took one to the gym and had to have it removed with bolt cutters because they wouldn't open. The other worked the same way and will return. Very disappointed.",
        "Very happy with my purchase. They both have the same combo and both work perfectly fine.",
        "Classic lock. Good deal for 2. My wife and I use these at the gym. They are a little finicky, but after using these for years throughout school I seem to figure it out every time.",
        "Exactly what I needed. It is a good sturdy lock and perfect for my locker at the gym.",
        "These worked well for a first time high schooler who can't remember much. Lol. Great to have locks with the same combination.",
        "I was stuck in the men's locker room with only a towel. The combination -- which was still on the back of the lock - would not work. Someone from the front desk had to come and cut the lock. I was late to work. I threw away the second lock out of fear that it would leave me in another predicament .",
        "My son needed a lock for his backpack at school, lockers are no longer provided and during certain classes bags are left unattended. These are perfect for our needs and getting 2 for the price was a bonus! We're very happy with the quality of them. They're easy to use...no sticking or defects. They arrived fast!",
        "My husband and I needed locker locks when we go to the gym. Both works well and I like the fact that both have same number combination so if one of us forgets, the other one would surely remember... Hopefully. I just had a hard time at the beginning on the second number... I didn't realize that you have to bypass the number the first time around but that was my fault not the lock's.",
        "The weight would make you think it's a solid lock, but it jams and sticks easily. Frequently requires multiple attempts to unlock.",
        "Total piece of junk. Doesn’t work at all. Not worth a penny",
        "I have been using these two locks for only a few weeks. One of the two locked up so that you couldn't turn the dial or unlock the lock even though I had put in the correct combination. I had to use a hammer to jar it to allow me to pull it open. Locked it again and the same thing happened. Wish I could get a replacement but I am past the return window. I like these locks... maybe I got a rare lemon?",
        "These locks are great quality and very sturdy! They are the same size one will use for high school lockers.",
        "We have used this brand forever but for some reason both of them were hard to open. Weird that both of them were that way. Will try again tho!",
        "Easy to use and the fact that both had the same combination was great!",
        "Good ol locks. I like that the combo is the same for both.",
        "It’s a basic combo lock. I should’ve gotten a front facing lock though because it’s hard to do the combo when it’s turned to the side.",
        "perfect locks. from the few times i used this at the gym, i got really good use out of it. In addition, these were only about $6 for 2 units when i bought it. quality is 100s of times better then the cheap ones you get at the 99 cent store. since i usually carry some cash around (even at the gym) i prefer this lock to the cheap ones.",
        "Good buy for two locks on prime day. Use for school or gym etc.",
        "I love how both locks have the same combination. I give one to my girlfriend, and that way the chance of us forgetting the combos forever is much smaller. The wheel twists very easily, with just the slightest friction to give satisfying tactile feedback, and it takes hardly any effort to open it.",
        "Cheaply made and they are hard to unlock due to the poorly made parts.",
        "this lock works as intended. It feels well constructed sturdy and durable. It can secure most items and the U-ring is large enough for most lockers.",
        "My husband and I have been using thse locks for almost a year at the gym. We are both very happy with them. They do have a little more give/leeway than I would like, (say if you are going for #3 but go to #5, the lock still opens) but since they are just being used for the gym, it's forgivable.",
        "Great locks that require you to remember only one combination. I've used these for years in the back of my pickup to secure what I am hauling.",
        "Bought these so my son could practice with a combination lock before the start of middle school. They worked perfectly, and my son never had any issues with either these locks or the ones in school.",
        "You can not go wrong with Master Locks. Have used them for both kids school lockers.",
        "School wanted to rent out lockers for $5 at the beginning of school year and with two kids, it would have cost me $10 for the year. I saw this on Amazon and by buying this, I saved money immediately. I also like the fact that the combinations on these locks are same, in case one is lost, we will know the combination for the other one.",
        "Bought these 2 for locker use. And as expected they work so far.",
        "I got 2-pack of locks for my partner and I to use at gym. Previously I had a padlock with key, but had to get gym staff to cut lock locK when I locked only key in locker.",
        "Great price point for two locks with the same combination. You basically get one for free at this price. The benefit is that you only have to remember one combination. My kids have 2 school lockers so this was a very handy feature. You can't go wrong at this price!",
        "Works just like it is supposed to! I use it for the gym!",
        "Decent gym lock. I needed two and didn't want to bother with two combinations to memorize. These aren't for high value things, but to keep honest people honest and they work great.",
        "We use these locks at the gym every day and they work great. I love that they both have the same combination so I don't have to memorize two different combos because \"ain't nobody got time for that!\" :) Great quality and work as expected. I'm a happy customer.",
        "Locks work as expected. Daughter needed it for her gymnastics locker. Works perfectly.",
        "They both have the same combination, which is good. I can keep one on my locker at work and keep the other in my gym bag. This way, I will not forget the combination as easily since they are set to the same. I wish they had like a four pack because I have so many other uses but I don't want to remember a million combinations.",
        "Master lock 2 pack is perfect for high school. My child likes the fact that she only has to memorize one combination. Both locks open and close with ease. Practice this summer and ease the \"incoming freshman\" nerves.",
        "I got these for my girlfriend and I to use at the gym. I love it that the combos are matched, so we don't need to worry about who grabbed which one.",
        "We used it for locker and its quite strong that its hard for others to break.",
        "Love that they have the same combo for both locks. My daughter uses them for both her locker and the gym locker.",
        "These are two locks with the same combination. My husband and I each use one for the lockers at our gym. It's nice they have the same combination, if one of us needs to get something for the other. I used some white-out and marker to decorate the back of mine with a flower, so it's easy for me to identify in the locker room.",
        "I purchased these locks in order to lock up my military gear. They have worked great so far. They are smooth to operate and easy to use. They also seem to be very durable. They have been kicked, thrown, and abused and they still work great. I am very happy with them.",
        "The cost of them together was very cheap compared to buying the same thing at Wal-Mart or separately. They do have the same combination, which I didn't expect (I don't know if it was poor reading comprehension, or unclear from the page) but that's okay with me as I only have on combo to remember. But it might be a bad thing for some buyers.",
        "The locks are sturdy, but I cannot change the code that is given, so I am really afraid I will forget the code after a while when I need to unlock.",
        "Been having issues with the locks opening reliably, and I dont want to be stranded in the locker room with them stuck, so they're being discarded.",
        "These locks are perfect for the gym or pool or leaving your things somewhere where you cannot take a key with you. They don't feel especially sturdy, and they can be a little resistant to lock again once unlocked. The internals get stuck or something. They unlock very easily though. I probably wouldn't recommend them if you need to lock something out in the open, you could probably break the actual lock fairly easily compared to the bolt, they feel kind of cheap in a way. But for lockers and gym bags this is a perfect lock."
    ]
}