{
    "entity": "Combination Padlocks",
    "text": [
        "I have had plenty of Master combination locks that worked well. However this one was perfect at first. then the rotating discs for the combination started moving together. I have to hold each number I set otherwise it will move with the other numbers. For example, if the combo is 1856. I have to hold the 1 to set the 8, then hold the 1and 8 to set the 5 and finally have to hold the 185 to set the 6. Otherwise they move together. I received the lock in Jan 18.",
        "At first this lock was really nice. I’m using it on a Lifetime shed used to store 4 bikes to get them out of the garage. Even my 9 year old could use the lock. At about 4 months the lock started having issues locking. You have to rotate the numbers to make it lock normally but this did not help. I tried to spray some WD40 in the lock to help free up any possible corrosion which didn’t help at all. The lock tries to lock but it never engages and opens right back up when you touch it. I do not recommend this lock at all.",
        "definitely not for outdoor use. Dial completely oxidized, had to cut off.",
        "I created a combination as per the instructions, however, the lock(s) would not open. I could not find any information on-line on how to re-set the lock in order to set it again. when I attempted to return the item I was informed by Amazon that it was not returnable, which I am now having to deal with.",
        "Had the lock for a little over two months. Set the combo, put it on the shed. Opened it about once a week with no issues. Then this past weekend would not open with the combination. Tried shaking it, rolling the numbers back and forth, pulling on it, pushing on it. Refused to open. So cut off with a saw and tossed in the trash. Very disappointed.",
        "I really liked these when I bought them, and I bought many of them. But unfortunately, they rust out in 6 months to a year of outdoor use, so they are really not outdoor locks.",
        "Extremely disappointed. We bought this for security and safety reasons but the lock was able to be picked in less than 2 minutes.",
        "I bought this lock a year ago, and true, I may have dropped it 2-3 times... But now it freezes up and is very hard to lock. The mechanics in it wont let me close the lock, the mechanism wont move to allow for the bar to insert.... so at the gym I sit there struggling with it. I'm throwing it away and purchasing a different lock as I feel like it's unreliable and one day I wont be able to get it closed. Very disappointed.",
        "The instructions that came with the lock begin \"SET the combination to L-O-C-K.\" Guess what - there are no letters on the lock. The support site was only slightly better, saying to set the initial combination to 0-0-0-0. Ok, done. Then the instructions say to insert the key and turn it 90 degrees. The only thing that happens when trying that is that the key becomes bent. Returning this item - it's useless. Oh, one more thing: turning the number wheels on the lock is not easy to do. Would never recommend this product to anyone.",
        "I already knew this, but just don't trust masterlock. They are now a very cheap company. The master 175 combo lock is even worse than this. But i don't own that one. This lock is easier to bypass than to put in the combo. All you need is a piece of a hairclip, (not a bobbypin) that you can fit in one of the sides of one of the combination wheels. In fact, just go look it up on youtube. Just search master 175 bypass. So, good sturdy lock just not secure.",
        "Bought 2 of these locks 2 weeks ago and one has stopped working, it will not lock. I would not buy or recommend these locks Update: the day after I submitted the review on the 1 lock not working the 2nd lock stopped working, did the same thing, wasn’t able to close and lock the lock. So after 2 weeks both locks failed. I am in the return window but I disposed of the original packaging, stupid me. DO NOT PURCHASE",
        "Got two in a row, both have the same problem. The resetting procedure does not work, the key supplied will bend before the code can be reset. Master lock used to be a good brand. I tried to get a good product that was at least designed in America; but nope. I suppose I will try one of the cheap Chinese designed and manufactured ones next.",
        "If there were no way to view the instructions online, this lock would be useless to the user. The instructions say to set the combination to L-O-C-K. This is not an option for the all-number combination wheel. I am a fan of Master's product quality. But the text of the instructions for this lock is wrong. For some of us, finding the answer is easy. But for others, the misinformation will mean the lock will not work.",
        "This is not an outdoor lock. It is not weather proof. I bought this for a shed with some basic yard tools, rakes, shovels, etc, so nothing really important. Within the first week of being out doors it already started seizing up. Had this for the whole summer now and it gets worse and worse as the months go by. Serves me right for going cheap when I knew I should not have bought it in the first place. UPDATE: its been one year later and this is going in the garbage. Will never buy a product from this company again. I orginally gave it 2 stars, it deserves a negative 3. Im downgrading it to one.",
        "I have had this on a gate latch for less than one month. Already there is oxidation on the face of the unit where the numbers are. It rubs off on the numbers as you spin them and makes it hard to see the numbers. Very disappointing product that will likely need to be replaced in less than a few months.",
        "I bought one of these new from Amazon, it’s excellent. I bought another one m, used one from a trusted vendor. No key to set combination was included. No problem I used the one from the other one I had purchased. The key did not work in this lock, even it’s a generic tool. Sent it back. Bought another new one instead of a used one.",
        "lock works great. I now have 4 but this last few that I bought have the directions on the packaging messed up. It says to set the combination turn the dial to the\" word L-O-C-K\"......... but there are no letters, only numbers on the 4 dials. The actual shipping combo is 0-0-0-0, then you unlock it, inset the provided key, turn 90 degrees and put in your new 4 digit numeric code. turn key back and remove it and your code is set. You also must dial in your code then slightly compress the lock as if closing it, then it will pull open each time.",
        "The instructions start 1. \"SET the combination to L-O-C-K\". Note: There are no letters, just numbers. I tried \"0000\" instead, and it worked. 2. \"PUSH key in and TURN key 90 in either direction...Failure to exert force while pushing key in will result in failed attempt to set or reset combination.\" Note: the key is easily bent; using force can render the key inoperable.",
        "Pros + Solid Durable Construction Resistant to Drops + Quick Combination Locking and Unlocking + Easy to Reset Combination with Key + Good Price Point Cons - The Combination Dials are Stiff and Thus Require a Good Grip and Much Force to Turn the Dials Even After Applying Light Oil - The Reset Key is Also Difficult to Turn",
        "It's a nice lock, but bulky, too bulky to fit through the hole in the Planet Fitness lockers which is what I had bought if for",
        "Easy to set for your personal combination. I used it for my breaker box and then bought 2 more for my gates. I heard that a new fad for teens is to shut the power off and run. It is plenty of lock for that purpose. Just have a flashlight handy if you need to reset a breaker at night. I have a hard time understanding such negative reviews. I did some locksmith work for nine years. I don’t remember any lock that couldn’t be drilled out from its weak spot. If you need something to stop a RPG or survive some C4 don’t buy it. Move to a better neighborhood.",
        "I was not very impressed with this lock at all. Masterlock as always provided me with well-built locks and always performed well. When I got this lock I was surprised at the apparent lack of quality. The locking mechanism felt weak and loose. The dials that turn were not smooth and also felt loose and not very accurate. It felt so cheap I wondered if it was a knock-off. The lock seemed like something that would quit working on me at some point so I returned it.",
        "Bought two of these set combos locks. One was outside on shed one used indoors for gym locker. BOTH FAILED TO OPEN WITHIN 6 months. WD 40 got the outside combo to open up once and work for 2 cycles, then will not open again even with more WD 40 and repeated attempts. Lock used on inside dry gym locker area failed to open and WD 40 does not help this one open at all. Have one lock on my nice gym bag and one on my shed, can not open and remove either.",
        "I used the lock on an exterior gate in Chicago. After less than 2 months it began rusting to the point where it will not consistently stay locked and the dials are now very hard to turn. I will not be buying this lock again.",
        "I’ve had this lock for a few months. Everything seemed A ok with the lock. Until that one day at the gym. After my long hard work out I decided to head on back to my locker. I put in my combination.. And nothing..and kept trying. It wouldn’t unlock. What the heck ? Called my wife to bring my key that came with it The key didn’t work either! So I had to use the gyms tools to snap the lock open. Oh well : /",
        "I locked my stuffs with this lock and in the process, somehow the combination numbers got messed up!! Now I'm left with my stuffs locked with this lock and I don't know what number the lock has randomly set itself to!! This is unbelievable. You would think the tool that this lock comes with is the only way to reset the numbers, but no, mine got reset to some random numbers. Seriously, will not recommend buying it. Now I need to figure out how to cut this lock to get my stuffs back. Very disappointed with the purchase.",
        "The instructions on the back of the product packaging state that in order to reset the password, one must insert the reset tool that is enclosed in the package... And there isn't one. So how the hell am I supposed to reset it so that it can be used? Next time, I'll just buy a simple key lock and call it a day.",
        "First off, the directions say to dial the combination to L-O-C-K, when it’s all numbers on the lock. I took a chance and used 0000, which worked. I put in the key, turned it, set my own combo, removed the key. After I locked it my new combo doesn’t work. Neither does 0000. No way to fix it, no way to change the combo because it won’t open. This is now a paperweight and I have to buy a new one >:(",
        "so I bought it for a work locker I had the high school rounds ones but had zero clue to the combination as they were used randomly over the years (I usually had to buy another one if years went by) anyway I wanted one were I could pick the combination so if I need to use it a year from now I'd be able to. works great and came fast. I gave it a 4 because the directions on the package to (unlock it and set it) were wrong, I had to look online for the real directions.",
        "This is an extremely shoddy product. I was able to set the combination and lock it at first although it was a little fiddly. After about a month it randomly shifted the unlock combination by one digit but still kind of worked. The key didn't work at that point and I was unable to reset the combination. A few weeks later it broke entirely and I wasn't able to open it at all. MasterLock used to be an okay brand but I guess either they've gone downhill or this one was a knockoff.",
        "Update 1/6/20: Dropping to 2 stars as the digits no longer stay in place. Moving one moves multiple making it extremely difficult to enter code. Original: Design is different from locks I’ve used before but is smart once you get used to it: 1) you must change the code before trying to lock it. I assume this is intended to stop you from closing and forgetting to change the code, leaving it closed but unlocked. 2) when you enter the code, you must push up the pull down the lock to open. Again, I think this is to deter people from randomly selecting codes and pulling open the lock; it requires an extra step.",
        "I bought this lock to chain bikes in my yard. After three weeks, the combination numbers became extremely difficult to rotate. Then, even when the numbers were scrambled and not set to open, the lock would not close or latch. I was even rinsing it with fresh water weekly to keep it free of weather and things which might corrode it. Huge waste of money. I don’t know if I could have returned it or not because it stopped working just AFTER the Amazon return window.",
        "I have purchased this same lock 2 different times and both have failed. I use this lock daily to get in and out of my property. I set up the code and use it twice everyday and after 26 days it just stops working. I put in my code and it doesn't work. The first lock I purchased stopped working within the first 30 days as well. So now I have to locks both stuck on a chain because the locks are faulty and just stop accepting my code.",
        "I have used this type of \"keyless\" Master lock successfully for decades in harsh salt-water marine environments. This newer design has better security with an improved combination setting method and a hardened steel shackle (shank). The case also has an attractive black (powder coat?) finish vs. the older easily tarnished brass finish. But, like the older, previous versions, Master has retained the non-ferrous, rust free innards that have been time-proven to work well, over time in the marine environment.",
        "Used this lock for the second time at the gym on 11/17/19 . When I tried dial in the combination I heard a click in the lock itself. Then I couldn’t unlock it . Ended up having to cut the lock . Then gym personnel ended up telling me this is a common occurrence with these locks . The the gym telling me this .",
        "While any cheap lock could be vulnerable to a skilled aggressor who is familiar with the multitude of vulnerabilities across designs, I'm going to assert that just having a lock to secure your stuff is probably going to cover you in over 99.5% of cases, as the vast majority of issues are crimes of opportunity for folks who go without securing their stuff at all. This chunky beast has held up well over the years, the dials are smooth and it's always easy for me to recognize in a locker room.",
        "Wish the dial was on the front, but there are photos, and that lock probably exists. This one is nice because you can set it to your birthday or whatever and use it at the gym. probably not recommended for high security use, but it certainly works to keep my wallet in the locker at the gym. I like that I can reset the dial. CAUTION - Mine came in packaging that described the default combo ask \"LOCK\", but the dial is numbers. I googled, and also it was 0000 I believe, but that kept me from using it for like 3 minutes when it first arrived.",
        "This outdoor lock has held up well for me the last year. I keep my shed locked with it. I have not seen any corrosion or wear from being outdoors. The one and only issue is that it tends to freeze up in the winter. Water gets in, freezes, and the lock will not open. I have to pour hot water on/in it, and then it opens up. If you plan to use this lock in an area where it will be exposed to weather, and you need access in the winter, you may want to consider a different lock with some sort of cover or sheath. Otherwise this one works nicely.",
        "The Good: It's easy to choose your own combination, but I'm pretty sure I've already lost the little key if I wanted to change it again in the future. The Bad: Too much friction between each number. As I change a number, the other numbers rotate as well. I have to place my fingers on the numbers I've already chosen to prevent it from rotating while rotating the other numbers. This becomes incredibly annoying. Additionally, you have to change the combo to re-lock it.",
        "I bought this lock for a breakout set because so many of my 4 digit programmable locks are locked forever. Students in fiddling with them so easily reset the combination to something no one knows. This lock requires a key in order to be reset. It's also very heavy, and it isn't easy to spin the number wheels. This is why it gets 4 stars. It would get 5 stars, but you have to squeeze the lock together and then enter the combination to make it open. I can explain this until I'm blue in the face, and I still end up assisting.",
        "Great, heavy quality lock. Needed a new lock for our shed & didn’t want to repurchase a “turn style” lock. Having the numbers on the bottom is super convenient. Directions that come with the lock to set your own code are a little confusing ... Use the instructions off this amazon listing for clearer instructions. Lock is very heavy duty & you can tell it’ll last a long time (through weather, use, etc)",
        "reels won't turn after only 5 weeks outside! I managed to get the lock off the shed and sprayed graphite into it which got the wheels turning freely again. Worked the reels for a little bit and put it back on the shed. 2 weeks later it was completely locked up!",
        "I've had this lock for two years now, on a gate outdoors in the rain and weather. About 6 months ago it wouldn't always open on the first try, and I had to spin the combination wheels and try again before it would open. The wheels were also getting harder to turn. So I sprayed them with WD-40, and the lock is now like new. Opens easily. And no sign of rust or corrosion. I highly recommend it.",
        "The instructions were tiny. I have pretty good vision, but in order to read the instructions I had to use my wife's lighted magnifying glass. & the instructions said to set the combination to LOCK -- it didn't have letters only numbers 0000 was what you had to set. & then use the key to set your personalized number,,, Once you get beyond that things worked out. I just got the lock so I have no idea how it will stand up to weather here in Florida --- time will tell.",
        "After having several locks of this sort, I got this lock for my shed. I set it, locked it, and it wouldn't open to the number set. I found it was one number off, so thought it was user error. I set it again, carefully, and tried again. Now it won't open with either combination. Going into trash, money wasted. Instructions appear to be for a different lock.",
        "Junk and a total waist of money. Set the code check the lock 3- 4 times, worked fine. Put in on the gate and would not open and would not reset. Had to cut it off and go to Lowes and buy a better lock. Don't waist your money this lock is a trash.",
        "Absolute garbage! 4 months in the dry Colorado weather and this piece of junk looks like it's been sitting on the bottom of the ocean for 20 years. Maybe this will work in some anaerobic, climate controlled environment, but in the real world its only good to weigh down your garbage can",
        "It's a great lock and been using it for my driveway to my backyard. Really easy to use and really easy to change the code if needed. You need to change your code before locking it that way you won't have left it accidentally on the same code and forgot to change the digits. Usually can't go wrong with a brand name and works as expected.",
        "Disappointing. Past the return date and I had purchased 5 of these for out door lockers that sometimes get rained on. One of them is badly corroded already, was barely able to re-open it, almost needed bolt-cutters. Other ones are starting to corrode as well but less bad. Will contact company but am very disappointed given prior products from them have been better quality. Cannot recommend.",
        "Works well enough. Only quirk is you have to push it in then release it to unlock it, which requires two hands. Update: after only 3 months of being in use, the lock will not open, and now I have to break into my own tool shed!",
        "This lock is great for indoor use and it has medium rate protection. If you need to lock something in the house and keep your family members or visitors out, it's great. It's not the best for a brake in protection, it's easy to cut with the right tool. The only thing i don't like about it is the grip of the rollers. It's hard to roll them and change numbers.",
        "Okay I'm particularly excited about this review... I use mine for the gym locker and let me tell how perfect it is... Saves time with easy to set personal combo... Heavty and durable much more than others I've used in past. So much so I was worried that it might be too big for gym lockers but it's Not its Perfect this should be on every lockeroom style lockers! 10/10",
        "I bought three of these locks in 2016: One for a bike cable lock, one for use at the gym, and one to lock our shed. This padlock is great for the first two applications. It's been a poor choice for 24/7 outdoor use. The metal tarnishes, making it hard to read the combination numbers. More seriously, the mechanism apparently suffered some modest corrosion, and it sticks. WD40 and oil helps, but the problem recurs. Master should not claim that \"Lock is best used for residential gates, fences, sheds, workshops, garages, and storage lockers.\"",
        "Bought three of these for my trailer. Right away one of the locks the dials seemed to move to easily and I was suspicious. I set the combination to all three of these and on the third day, we couldn't open the easy spinning one (We were on a hunting trip and locking and unlocking the trailer several times a day). Cut that lock off and 2 days later, another wouldn't open and you could tell the dials weren't in constant contact with the tumblers. These are junk, didn't last a week.",
        "Found it! Finally! This is a great outdoor lock for a nice 4 ft. high white picket fence around my back lawn (a long one). Now, while I feel confident this will over time rust like all of the others, I think it will last longer- THIS is heavy, high-quality, well made. I was surprised at how well made. The BONUS to me is not having to keep up with a key, just program combination on bottom (very easy) and boom, you're done. Will use this again in the future, great lock! A locksmith once told me ANY lock will, over time, rust that is outside. I just think this will last longer than many.",
        "I ordered this combo lock, with number combination. The packaging was for a letter combination lock, so the instructions were incorrect. After some guessing, I figured out how to set the lock. So I resolved the mislabeled product issue. However, I note that the combo wheels are relatively small, and do not always rotate freely, so they are somewhat difficult to use. For the size of the lock, I expected the wheels to be easier to turn.",
        "After only about a year, the lock started giving me problems. It would not fully close easily and I would have to spend a lot of effort jamming it against the locker to get it to be securely locked. Later on, it started having problems opening when the correct combination was shown. Eventually, it just became impossible to open when I was trying to get it to work. Luckily it was not locked on my locker with stuff inside or I would not have been able to get my stuff out!",
        "This padlock is great for allowing others access on the spot. You can change the code. Negatives: 1. The little key they provide which you use when setting your own code is rather flimsy and the first time I used it I ended up bending it almost a quarter turn. 2. In just a few rains the lock is already showing signs of being impacted by the weather.",
        "I purchased 8 of these locks for a restaurant patio to secure the chairs at night. After three months 4 of 8 were not functional. They are cheaply made and do not hold up to everyday use. I would not purchase them again, instead we will purchase better, higher quality locks at twice the price. These locks were very disappointing Update: I contacted Master Lock and they replaced 4 of the locks with the 175 model. I didn't expect anything from them. The lock is still rated a 1, Master Lock however exceeded my expectations for a response..",
        "I had this lock for almost a year. Used it every day on my locker at work. It just failed today. The combination entry rollers now just spin freely and cannot be used. Had to cut the lock off.",
        "It’s harder to break than the last one I had because of the thickness of the metal and it’s Combination can be changed. It’s being used as a Gate lock and it’s only been Outstanding. I used CLP on it as soon as I got it. So it lasts longer. Even though it’s a Great Lock. You have to use some kind of lubricant and I think if I use CLP on it every now and then that it can last forever. Like a Hundred Years. It’s. Great Lock.",
        "I have 2 similar master locks and have never had a problem. I bought this one from amazon warehouse with the package damaged. It came and would not open. The combination must have changed while it shipped (it supposed to come unlocked showing the combination)and there is no other way to find it. Returned it for another and the same thing happened.",
        "Really impossible to write a review until the lock has been in use for a year or so. Seems adequate except for the instructions. You are supposed to set the lock to \"lock\" as first step to enter your personal code. Since this is a number lock magic needed to do that. Most programable locks tell you to set the tumblers to 0000 and that does work. Just ignore the instructions.",
        "I've bought this lock twice, and the quality is good. However, the process to set your personal code is not as simple as it should be and screwing it up results in an unusable padlock. The one I sent my college student ended up in the trash for that very reason: she thought she had the code properly set but apparently not, and process was complete it was impossible to open or reset. She wasn’t able to even definitively say what went wrong, so who knows!",
        "I bought this last year and have been using it up until today. I just watched a YouTube video of someone popping this lock in less than 5 seconds with only a thin piece of metal. Visit YouTube and search for \"Master Locks With INEXCUSABLE Design Flaws\". It looks like I will be using my sesamee locks from now on. :(",
        "I would give this lock 5 stars, except it's got this weird mechanism. You have to dial the number and then push the lock in before it will open up. It's not something I've ever seen with a lock except when you're resetting the code. That said, it's been a wonderful solution for the storage unit we're using it on. Now, no one has to have a key to get in. They just need to be on our list of trusted people.",
        "The locks were purchased for our gate. They are very high quality and are so easy to unlock and lock. The numbers scroll through with ease and don’t stick. They are holding up and not getting rusty from the rainy weather. The color of the coating on the lock is very pleasing to the eye.",
        "Good idea, seems nicely built, has a nice heft...but after several months of rain the lock is nearly unworkable. This after pre-treatment with lubricants. I bought two at the same time, and they've both deteriorated at about the same rate outdoors. I can imagine that they would work much better when not exposed to the elements.",
        "You MUST go online to learn the SECRET. There you find that set to L-O-C-K really means 0-0-0-0. AND just how easy this lock is to PICK! And it certainly is NOT waterproof, although it didn't claim to be. I can't recommend it.",
        "The lock works fine for a while and then after rain, it starts corroding and the wheels need a crowbar to move. This is not weatherproof or weather resistant. We are not talking hurricanes or typhoons, but mild California \"winters\". I've gone through a few of these now. They should be considered disposable if used outside. Look for another brand.",
        "Lock worked fine for a while, then it was very sticky and I was afraid to use it as sometimes it would want to open with the right code. Now it opens without the right code! In fact, if the dial is not spun to excess after locking, the lock will pop itself open and I will come back to an unlocked locker.",
        "One day the rotating number disks you enter the combination on started moving together when you rotate anyone of them. So all you have to do is spin one and the others will keep spining until they get close to the combo. The lock will then open when it is at or near your set combination. So basically, this lock stopps locking sometimes.",
        "I've had these locks for years with the original \"pin\" provided to set the combination tumblers. I like using the supplied key to set new combinations as you definitely feel the detent signaling that you can set your number on the 4 wheels. Only negative I have is the small numbers require me to use my reading glasses to open th lock. Bought this along with a 15 foot locking cable to secure our RV generator to deter theft. Will likely use while actually running and store the generator in a locked vehicle out of site.",
        "Bought two for a farm gate. Quickly discovered it freezes when temps get even just below freezing with no rain or snow as the cause. If frozen and locked, the dials won’t turn. If frozen and unlocked, it won’t latch. Both corroded on the number wheels in a matter of weeks. They are now hard to turn even above freezing. I don’t trust Master Lock anymore after this false advertising. Not for outdoor use. I gave it three stars because it probably works indoors and I like that you can set your own combination.",
        "This is the best lock. Super easy to use. Won’t buy a different style or manufacturer after this one. I use for gym. And have others to lock multiple gates on property. It holds up well outside. I wouldn’t say it’s water proof. But serves its purpose. If ever the elements do damage to this lock I will still be buying again.",
        "Great locks, easy to use, and custom code. However, they don't hold up in the weather. Salt especially... Mine completely jammed up on my work trailer. Thank God my angle grinder was in the house! Took about 30-45 seconds to cut. Very few things will hold up to a cutoff wheel and a determined thief so long as you're not trying to use this outdoors these are great.",
        "Very sturdy/ heavy duty feel. Easy to set personal combo, and open. I used it while staying at hostels in Europe, too thick to fit most lockers (luckily I also had an Abus padlock which fit perfectly). This is more heavy duty so I used it with my bicycle cable to tie up my luggage in the room while I was out. Due to it's heavy duty look & feel it would definitely discourage would be thieves / lock pickers trying to get to your stuff. But too big for small pedestrian lockers.",
        "After about a year two of the digits started spinning freely instead of clicking, making it difficult to open because the digits wouldn't stay where they needed. In -10 windchill the lock froze and we had to pour boiling water on it. Now we're doing that even in 15 above zero. Lasted 1.5 years and would not buy again.",
        "My son set the combination, he did have trouble with the key and bent it. However when he finally read the instructions he was able to successfully set the combination. When I first tried to use it I couldn’t figure out how to open it. My son explain that you need to push up on the lock in order to disengage the mechanism to open it. I think of this is sort of an extra feature.",
        "Great quality! Works perfect. Update. Used the lock on my gate. Opening it and locking it many times. One day it just would not open. Had to cut it off.",
        "UPDATE 09/18/18: After contact a Master Lock (via FB), they sent me a replacement pin tool, free of charge and no questions asked! That's what I say GREAT customer service! As far as the actual padlocked goes, it's great! Holding up really well, even in the rain and next to salt water (no signs of rust yet). This padlock didn't come with the pin tool as described in the instructions so that I can set my own combination. That means it's defaulted to 0-0-0-0 and I can't change it!!!! Amazon won't take it back, either! So now I'm stuck with this $13 piece of paper weight!",
        "I bought this in August 2018 and it's August 1st 2019. I put this on my gate outside that leads from the front yard into the backyard. It's had a full year of weather (in Utah) and still works just fine. The number tumbler still works fine and the lock still opens and closes like it was bought yesterday. I wouldn't hesitate to buy another if needed.",
        "I programmed this lock for a new combination but it opened only one time now it's locked and I can't open it! The company won't just let you return or give credit, you need to call them during their business hours. I won't buy another Master Lock, ever, it seems to be a cheaply (poorly) made imported copy of a product which used to be good. I'm very disappointed and am just throwing it away to avoid the aggravation!!! Total loss. DON'T get fooled and buy this product.",
        "The only downside to this lock is that combination doesn't need to be exactly precise to open. So, if one of the dials is like one number off or something like that, the lock will still open. It's a slight downside if you think someone will try to guess your combination, but I guess a plus if you forget the number. Approx 1 month of ownership and no real problems yet.",
        "I bought two of these. One for the gym and one for the shed. I really like it as a gym lock, but the lock on the shed is terrible. After only a few months it is difficult to turn the combo dials and the lock mechanism struggles to actually lock after I've scrambled the combo and tried closing it.",
        "I have purchased a number of these and none have failed. I have been using them indoors, however, so I can't comment about how they would stand up to the weather. The one drawback is I have to remember to tell people to push down on the shackle to unlock it because many people don't know to do it and have trouble opening it for that reason.",
        "This lock works as expected. You are able to use it with a 4-number combination which ranges from 0-9. I used it to lock my side door leading to my backyard just to be a bit more protected. It is also very easy to change the combination but beware if you happen to lose the key, you are @#$&*#ed. Just make sure you keep that key in a place that cannot get easily lost otherwise, you will have to purchase a new lock just to change the combination.",
        "Combination doesn't set up correctly....re-set numerous times...finally set..used two times and then wouldn't unlock...almost like combination changed...don't buy..I had to cut off the cable to get my item unlocked",
        "Easy to set your own combo. Stands up to the elements very well and you can open and close it with one hand. Highly recommend this if you need to lock a gate or shed door and will need to open and close it regularly.",
        "This lock is great in the sense that it is very sturdy. Good quality materials and thick metal that is hard to cut. The design feels a little chunky though and the mechanism doesn't work as smooth as I expected. For the price they should improve the quality a little bit.",
        "This easy to set combination padlock is perfect for my gym locker. I had a larger lock that was rather cumbersome. This is smaller yet very sturdy. The combination is easy to set. The numbers are large enough for me to see without reading glasses. One click and an easy spin of the combination & it's locked. My other lock tended to be a bit more touchy ... sometimes I found that it was looked locked but a slight tug opened it.",
        "This is really nice, durable lock from Master. It was really easy to set the combination. I do find it a tad hard to lock as you have to push in the shackle, hold it, and spin the numbers all at the same time. When you have it on something you're trying to lock - locker, etc. - makes it a tad difficult due to the angles. Otherwise, I really like it.",
        "I bought 4 of these locks for use outdoors. Within 2 months, all four combination mechanisms had corroded so badly that they stopped working. I guess they can't handle Seattle rain.",
        "The lock came in without a key to change the code but fortunately, Amazon replaced it for me. The numbers moved smoothly and all i was missing was the small key. The second lock that I received is very tough on one of the numbers, you have to get rough with it to change the number. I'm guessing the company has a very poor quality check system in their product. I'm using the lock to keep my cooler locked but I would not trust it to lock anything of high value.",
        "First of all the directions to change the combination said put it on L-O-C-K. OK so there were no letters on the lock. I figured I'd try all zeros and that worked. Then they said use the tool to change the combo. There was no tool in the package. Ridiculous.",
        "We use these for our work dumpsters. Having a combination makes it so we don’t have to worry about keys if our normal guy is off. Open well and hold up well to weather, but they can be hard to get back locked it wet weather. You’ll get the hang of it though",
        "This was to replace another combo lock with four numbers where the tumblers with spin when you tried to dial in the combo so you had to hold then to open this worked perfect for a couple weeks now we have the same problem the tumblers just spin and you have to hold him to set your numbers to open",
        "Bought 2, after a few weeks/months one of them stopped working. At first I loved them, no issues, I don't use it too often. But now one of them is getting stuck, I had to spray liquid wrench in it, let it soak and now its working again but hard to use. My wife and kids have a hard time and can't operate our gate now :'( Wish I bought something else.",
        "They have survived their first winter. We spend lots of time in single digits in the winter with freezing rain and snow. they are a little difficult to work with in those conditions but that is to be expected. I bought six and they all worked great.",
        "Lock is very durable, easy to encode and recode. Masterlock has always had the problem that these types of locks can be picked, but if you look online most hasp locks can be opened. The hasp and dials are stainless. The bottom plate is brass and the housing is probably hardened steel."
    ]
}