{
    "entity": "Stockpots",
    "text": [
        "I ordered 3 of these pots on top of the one I already owned. Cooked a clambake for 125 people over an open fire with these pots. They held up great over intense heat. Highly recommend these pots.",
        "I bought the 21 quart pot for boiling a 2x2 (13\") mule deer mount and so far it has worked out great. The mount fits perfectly, with room to spare, and has held up to countless hours of high BTUs without any indication of wear. I highly recommend this product for this use.",
        "I absolutely LOVE this pot! I used it to make a massive pot of broth.",
        "I needed this to brine a large turkey. It worked perfectly. Due to the large size it doesn't fit in my sink too well so it's a little difficult to wash. Although hard to fit in the sink to wash, it's not the product's fault. I ordered a very large stock pot for a reason and it was up to the task.",
        "This is an awesome pot. However it's freaking huge lol. Barely fit on my glass electric stovetop. But it does! Boil chicken in bulk for the dogs. Probably larger than I needed but it's cool anyway. To the people who burn sauce and food. Duh, feel how thin it is. It heats very quickly. Don't burn something because you can't cook and then blame it on the pot. I'll update my review after a bunch of uses to comment on the lasting quality",
        "Came in great condition! Using it for natural dying and does a great job!",
        "Did not even use it yet, washed it and it started exuding some type of smell which I did not want to deal with. So, I returned it. I love the new return process where you can take you item to Kohls and get a discount for use in their store. I do not shop at Kohls, but I love seeing the face of strangers when I give them a 25% off coupon for no reason other than, I can. Great idea, Amazon and Kohls.",
        "Loved the size of pot and used it for fabulous mashed potatoes on Thanksgiving! So the reason for a 4 rating. The handles seem a little sharp when handling when pot is fairly full. Make sure you use pot holders when carrying! Glad we bought!",
        "Works great for making soup, holds lots of veges and meat etc get enough that I can freeze some for lunches and still have plenty for meals. I don't fill it all the way but much nicer than my small big pot using before.",
        "awesome for our home lobster bake! Fit 10 lobster in here no problem!!!",
        "I am a fan of cooking crabs this was the pot i needed to cook the amount of crabs i am accustomed to eating. Pour the beer in there and you are good to go. Great buy and a great price",
        "Haven't used it yet but I thought it would be tall and skinnier....I have used other products b4 made of same material and have no problems. I needed a giant stock pot. Thank you.",
        "The pot actually came a couple of days sooner than they said it would and was in great shape. I bought it to use when canning tomatoes and put it to work right away. It fits over two burners and is tall enough to put plenty of water in it, no worry of it boiling out! Love it, thinking about ordering another.",
        "The pot was big and cooked my greens in half the time that it would have with a regular size pot.",
        "We really like the pot but the enamel chipped on the inside and the outside. The inside after one use. The outside cane chipped from the shipping. I think I need to return it. Have you had this problem with the pot before?",
        "Bought this for home brewing beer. The price was lower than other aluminum pots, and it's big enough to boil 6 gallons of wort without too much boil over. The only downside so far is that the inside bottom is starting to chip a bit, and I'm worried it may affect taste. But it served as an econimcal way to get into full-boil extract brewing. Glad I bought it, but may need to replace in the next year or so.",
        "I bought this as hot liqour tank for brewing. I basically only heat water in it. It works great for that. I have noticed the occasional, tiny chip floating around while heating water, but I haven't noticed any corrosion or any other ill-effects yet. I just wish I had looked around for them locally. After receiving this one from Amazon I saw the exact same one for $5 less at Walmart.",
        "Everything I have tried to cook sticks to the bottom of the pan unfortunately. I have gas heat and really don't cook anything on high so I am unsure why it sticks.",
        "I love this pot. It is *huge*...perfect for boiling maple sap into syrup.",
        "I got this for brewing full 5 gallon batches of beer. It works well for that, being about the biggest post I could reliably fit on my stove. Being a bit wide rather than super tall, it's a little easier to work under the stove hood for stirring, etc. But if you fill this thing up, prepare for a hernia if you try to move it around. You're talking about 50 pounds or more, here.",
        "I use the pot for homebrewing beer and it works great. I can do full 5 gallon boils with plenty of room and not have to worry much about boil overs.",
        "This pot is great I make a lot of soups for my family and this is perfect for that.",
        "got this pot for my mother-in-law she loves it as it is the best large pot she ever owned",
        "I was super excited to receive my pot! Product is in great condition. It is huge! I love it so far. Just finished my greens and string beans in it!!! Made cookinf my smoked meat a breeze. 1st day, so I will update after couple of weeks. So far so great!",
        "Though I originally intended it to be for a lobster pot for my girlfriends birthday - I will also use it for holidays and to make my infamous chilli from time to time .",
        "Somehow the base disintegrated and got micro chips of the granite melted to my stovetop, and might have made it all the way through the pot to the batch of salsa i was making.",
        "I had to return this item as there were chipped places all over the pot and the lid was a little bent and didn't sit flat on the pot. Decided to go the good all stainless steel instead",
        "This stock pot is much bigger than i expected. but love it",
        "I bought this for dying clothes and it's perfect for it. I think that simmering clothes especially darks is better than washing machine dyeing.",
        "For the price it'sworth every penny! I will refer this to anyone who need a large pot! Great product and shipping packing was excellent!",
        "My grandma made gumbo in this pot. A week later I boiled crab legs, shrimp, sausages and corn in this pot for five people. It’s the perfect pot. Love it.",
        "This is how it was when I opened the box. Extremely disappointed that it isn’t more sturdy. It either didn’t make it through ups like it was supposed to or it actually got sent to me this way!!",
        "I used this for my first home brew. Worked great. Be careful not to turn the burner up to high so the bottom does not scorch. It is thin but works well so long as you pay attention.",
        "Could only find this on Amazon, cooks great, great price",
        "The lid had been dropped at some time, the porcelain is broken off whete the lid dented.",
        "Pot arrived today, but had a large chip on the bottom, inside and out. Cheap construction. I will be contactnng customer service. I will post again to report on how well that went.",
        "This is not a thick metal pot. It is very thin and easily bends and chips. Same quality as any $10 stock pot. Do not buy.",
        "This pot was perfect size exactly what I expected!! Huge!!",
        "Bargain substitute for the expensive stainless pots that people use to brew beer. The enamel finish is non-reactive, works fine for beer. Not as nice as a heavy stainless pot, but less expensive, well made, and quite functional.",
        "Very happy with this pot. I was using 3 smaller pots to make my gumbos, but instead I now use this pot. It is just perfect and I'm definitely happy with my purchase.",
        "we cooked 10 lobsters in the boiling water pot for 20 minutes and they came out just right. the pot cleaned nicely and ready for the next seafood cookout.",
        "Great no we can make ham and cabbage in one put.",
        "My preferred pot for home brewing because of the size, cost, ease of cleaning.",
        "the size of the pot i love but its not very thick .... feels and sound flimsy",
        "can cook up to 8 lobsters at a time.. we did it on christmas eve.. real heavy with water though",
        "Product is as described. Used to to book sap into syrup over a fire.",
        "Needed a large pot for cooking large amounts of homemade dog food. Of course I didn't want to pay the ridiculous price being charge by others for a 20 quart. This pot however fits the bill. It holds a large amount of food; holds heat well; and was fairly priced.",
        "I cooked a mean pot of greens for Thanksgiving. This held 12 bushels plus some. I had 24 bushels to pick and clean. I love it!!!!",
        "This pot is HUGE, and it can easily fit over a half a dozen lobsters in it with no problem whatsoever. It takes up a full third of my stove-top as well. Just an FYI.",
        "I bought this pot to brew beer. When it arrived it was so thin I thought it would fall apart the first time I used it. I certainly thought the handles would come off if I tried to lift a full pot with them. I was surprised. It is a lot tougher than it looks. It is not ideal for brewing, (it is to short and wide) but is a big inexpensive pot.",
        "Great. I'll most likely purchase other sizes and configurations as well.",
        "This pot came out of the box with large pieces of the enamel chipping off, both inside and outside the pot. No longer safe for cooking and I haven't used it yet.",
        "FROM CLAM BAKES TO STEW , BIG ENOUGHT TO FEED THE WHOLE TROOP",
        "Large enough for lobsters but also (if having a large gathering) for Italian sauce, stews, soups or my famous corned beef & cabbage!",
        "This was used for canning 2quart jars of apple cider. Worked well. It is very heavy with warer in it and must be careful.",
        "Well it's a cheap stock pot, I bought it for brewing. It had a decent sized dent/gash on the bottom when it arrived. Box was intact, so it left the warehouse this way. Not too happy about that, but we're working on getting it replaced through Amazon, so we'll see.",
        "I returned this pot. The metal on the lid -- where it is turned back against the lid top all the way around -- was not finished smoothly. I scraped my fingers. If I had been holding it more firmly, I could have been seriously cut. Perhaps it was just this pot, but now I do not trust the quality. If you have this pot, you might want to check this. Mine was as sharp as a rasp or saw blade.",
        "Love this pot! It's huge...we fit 3 2.5 pounders in there with a ton of room to spare!",
        "Outstanding buy. I really like Granite Ware for its simplicity to handle and clean. Very lightweight and durable. Do not use excess temperatures and it should last a lifetime.",
        "Veer big and holds a great amount of liquid. Great for making soup or stew. Also great for boiling a chicken or veggies, enough for a big family. Very thick and sturdy.",
        "This pot is huge and great for cooking lobsters. I cooked 4 large lobsters in the pot and it was great. Pot can be used for canning if anyone still cans things. Would be great for a large gumbo to be cooked in.",
        "I had to return this item, because I could not use it on my glass top burners. It has a label on it that says this.",
        "crazy big pot - no clue why i needed it but got it now ! have yet to use it. nothing fancy just huge",
        "Pot itself is fine. However, we did not see a height notation before the purchase. We are having to pull all shelves out of the oven and sit the pot on the bottom to make our chex mix recipe",
        "When I used the pots for cooking purposes to make a soup it was sticking to the pot. When I realize that I turned the flame down on low. It was going to start burning and smell like it was burning . At that point I no longer wanted my food to smell burnt. I turned by turn the pot off",
        "Defective pot Receieved product in a timely fashion, then upon removing sticker on front of the pot, noticed another sticker half ripped behind the new label. Upon further inspection, noticed a blemish on bottom corner of pot, inside it was damaged at the same location as if somehow it was dropped on edge. Someone else prior purchasing the pot must have returned it for the same defect. No problem, just wrap it up again and waste another customers time by sending it out defective pot. What a waste of time.",
        "I was desperate to find a pot large enough to dye a costume and both time and budget very short. This pot was cheap enough but it was never suggested it was a \"second\" or defective in any way. Enamel chipping both inside and outside. Cut my finger on an enamel piece hanging off of it. Will have to use it. Time too short. I would NEVER use this pot as something, especially food prep, to be relied upon.",
        "Bought it to steam crabs. WIll only fit about 9 to 10 crabs inside of it. Great product, simply wish the description was a little bit more detailed.",
        "Bought this pot for brewing beer. I wish I would've gotten something smaller for the five gallon batches that I'm making.",
        "ordered original came -damaged-porcelin chipped=returned second one inside large chip-went to Macys and found perfect products-must be damaged in handling-pass on this item",
        "Very good stock pot. fills the bill for what I wanted. blah blah blah blah blah blah blah blah double blah",
        "Horrible, first time I used the pot it burned my boyfriend sauce in a matter of 10 minutes. highly disappointed I can't return it.",
        "I would have given a 5 star rating ,but it did not come with handles on the sides for picking it up",
        "The most beautiful and good quality ! It arrives in perfect condition and fast delivery.",
        "Exactly what I was looking for! I needed a really big pot that would cover my oval burner in the middle of my stove and haven't been able to find one until now. This is the perfect size for the water bath canning I'll be doing this summer.",
        "This pot is HUGE! You can cook a whole turkey in this thing! I just wanted it to boil crab legs and I had no idea it would be bigger than the eye on the stove but oh well. I can lay the crab legs flat so I’ll keep it!",
        "I like this pot a lot, I can easily cook Paprika-Gulasch for 50 people in there. Can't really brown anything in it but I got a separate nonstick-coated pan and just work in batches and add the browned meat to this awesome pot.",
        "Nice pot for cabbage stew or gulash (if you're making it for like 60 peoples) Had it for almost 2 years no rust no nothing. I had to make chicken soup for my girls scouts one time...yo this pot handled it like a champ. I put 3 whole chickens into that bad boy. The best chicken soup ever, according to the girls. In fact one of the mothers on the girls scout troop said she gonna get the same jawn. I told her where I got it (amazon of course) and she bought it like tree days later.",
        "The only thing not great was the lid obviously had a dent in it before it was coated because the enamel was not chipped so it didn't happen in shipping, the dent is on the side of the lid and is a good 2\" long and about 1\" high, doesn't affect usage just not in prefect condition.",
        "I make and teach cheese & yogurt classes. These pans are perfect to heat up milk. My only wish is they were a tad more sturdy and less prone to rust. Do not heat food in these on high heat due to scorch. After washing graniteware pans, dry very well or in time they do rust. This pan is great for a 5 gallon batch of milk with lots of room to spare.",
        "I love this pot so far! I used it recently to do a giant low country boil, and the pot worked really well. It held all the food, took no damage from my gas stove, and was easy to clean despite its size.",
        "Bought this to fry a turkey for Thanksgiving. Did a test boil with just water prior to the big day. The enamel flaked off from the inside and was floating around in the boil. Enamel on my turkey is not acceptable so I returned it. Poor quality.",
        "had a large dent in the lid and enamel was gone..lots of other spots on lid",
        "No good!!!!!!!!this pan is too thin when filling the walls of the pan are deformed it loses its shape I would not recommend a purchase I do not like !!!",
        "Bought a lot of Granite Ware pots - lightweight and can be cleaned easily without hard scrubbing.",
        "The pot will be used only to brine my turkey. It is big enough for a large turkey. I might use it to make the stock for soup but so far I've returned 2 of 2 because of significant dents and enamel defects.",
        "Worked for what I needed. A little thin on the walls.",
        "The bottom of this pot is NOT flat, it is made to fit over an electric coil burner. Due to this it heats incredibly slowly on a glass or induction cooktop.",
        "Love how huge it is... But enamelware chips way too easily...",
        "Hey, it's a pot! I wanted a pot! It does what pots do! What's not to like?!?",
        "The pot size was great but the material didn't seem too flattering. It felt too lightweight in my opinion.",
        "Great Lobster pot (that is the only thing I use it for as it is HUGE) can easily accommodate 3 large lobsters. Very heavy when full so wait until water cools to move it. (just a suggestion) unless you want to be the next McDonalds coffee caper person.",
        "My 30 year old crab pot finally sprung a leak. It was a family heirloom and it was difficult to find a replacement that didn't cost $80+. This is perfect. The steamer rack fit great in the bottom and 1/2 bushel of blue crabs can be steamed in one batch. Bought the outside propane burner and this fits perfectly on that.",
        "Bought this for homebrewing. 34 quart size will be plenty big for 5 gal batches during stirring, steeping grains, etc. Appears to be good quality finish that should last a while. To be able to boil the whole wort was a big selling point to improve hop utilization. Cheers....",
        "HUGE! Great for large family or a craw dad boil.",
        "nice very large pot, i use it to boil down maple sap, its been on the turkey fryer burner for a few days no problems so far",
        "I have had similar pots for years with no problems but this pot chipped after the second use. I don't know why this one did but I am very dissapointed.",
        "While using this pot the enamel on the bottom of the pot began to chip off and float to the surface. Be wary when buying this pot. This happened on the very fist use. I would not recommend this pot for anyone.",
        "To make soups like pozole,and to use to prepare for tamales",
        "It is a giant pot. Works well as a giant pot."
    ]
}