{
    "entity": "Stockpots",
    "text": [
        "I've been regularly using this pot for over a year now and am very happy with the purchase. The standard 6 q. pots were never enough to make chicken stock. Trying to make stock out of a turkey carcass was barely an option. This stock pot is huge! I can have couple (maybe three if I'm lucky) gallons of stock and I love that the pot comes with a lid. I have not had any problems with discoloration but I wash the pot promptly after using it. Besides making stock, I have also used this to make gallons of pasta sauce and other dishes such as halupki (stuffed cabbage rolls).",
        "On my first use of this pot it pitted at the bottom and looked like the aluminum was showing through and actually rusting in spots. I am concerned about using it. I think it does not have a thick enough stainless coating in it to prevent chemical reactions with the aluminum underneath from tomatoes and acidic foods. Ingestion of aluminum causes health problems. I would definitely not recommend purchase. I will be returning.",
        "This reasonably priced stockpot is nicely finished, and the bottom is thick enough to evenly spread the heat with no hot spots or scorching. The lid fits well and directs condensation back into the pot. So far I've used it for cooking tomato sauce and chili- cleans up very easily. The handles are welded to the pot (no rivets), so I would use care moving the pot when it's filled. P.S. Make sure you wash it thoroughly before using the first time to remove any oils used during manufacturing- it looked absolutely clean but shed gray water in the first washing.",
        "Great pot! I used it all day yesterday to process applesauce. 42 pounds of apples were cooked and blended directly in this pot. No issues! It did not scorch the bottom, did not burn, was a powerhouse. I was able to not stir constantly! I am now ordering the 16 quart to do larger batches!",
        "I am a guy who is just a \"fair\" cook. I wanted a large stock pot so that I could cook larger portions and then freeze some food for later. Well, this pot is too big for me, even for cooking large portions. This would be ideal for a family of 4, 5, 6, or more. The pot is beautiful and seems to be well made. I rated it according to my seasoned eyesight - LOL. I am sending it back. I will get a 12 quart size which is what I should have done in the first place.",
        "Just arrived today. BIG dent in it! The box was not crushed in any way, it was actually packaged by manufacturer damaged! Very disappointed. Poor quality control to allow this to happen...I wouldn't recommend.",
        "Excellent sauce pot! I when I make spaghetti sauce, my great grandmother's recipe requires an all day simmer. This pot has no hot spots to worry about - something my old pot had lots of. It is a heavy stainless steel, so there are no pops or buckling as it heats up - another fault my old pot had. It cleans easily and is so fantastic, I bought a second one so I can I make larger batches of sauce.",
        "The perfect pan!! Besides being beautiful and solid, it’s easy to cook in. I make a lot of food in large amounts such as pasta sauce and then freeze.! I follow the rules for stainless and don’t cook at heat higher than medium. No burning of foods and pan continues to look new. I’m very happy with this pan and it’s worth every penny. This pan will out live me! What a great deal!",
        "I just used this great pot to make 3 pounds of beans (only halfway filled) and I loved it! I’m glad I bought the 12 qt one, it’s big but not huge. I can still look into it on the stove (5’1’’). The beans didn’t stick to the bottom, even though they were cooking for many hours. This pot is sturdy, has a good weight and is well built. It cleans easily. I’m very happy with it.",
        "Four days after receiving and washing the pot, which was already spotless, my wife used this 12-gallon pot to make approx 10-pounds of stew. It held warmth smoothly and thoroughly. The top fits very well. The material is sufficient in thickness. No problems when using the lift handles. No cracks, bends, or deformations on the opt and lid. This pot serves its purpose well.",
        "This Fabre wear 50009 Classic steel Stock Pot Works good When canning. I use it to Small batch water can, soups and stock. It is tall and holds canning jars for small batch canning all my small quantities, Great for slow cooking stock or soup. Holds quite a lot. Cleans up easily. I wash it by hand to keep the shine.",
        "Just got this washed and while drying inside and top inside I saw a black residue on my cloth soaked in warm water and in dawn and banking soda helped some was still there so I soaked in dawn and vinager for about a hour was gone still a little weary about using the inside does not look as shiny as the outside ,any one else experience this?",
        "Do you ever buy something then wonder why on earth you hadn't bought it years ago? That is this pot. It is fabulous! I made spaghetti sauce and for the first time there was nothing burned on the bottom. Easy clean up, too. Looking forward to making soup soon. Great pot.",
        "This pot is wonderful! It cooks evenly and food tends not to stick to the bottom. Because it's so big, nothing splatters outside the pot. I make soup, spaghetti and spaghetti sauce, pulled pork, corn-on-the cob.....to name a few things I use it for. It just fits in my refrigerator but I have to turn the lid upside down. I don't put it in the dishwasher, just wash it by hand and it comes clean easily and looks brand new. The handles do get hot so I use potholders. Nice product. This was a replacement for a cheap dutch oven that everything stuck to. Wish I'd bought it long ago.",
        "These are a terrific value at this sale price. This is not a thin walled stock pot with a bottom you could dent with your knuckle. It is very sturdy with a fully clad bottom. This pot comes out of the dishwasher gleaming like brand new.",
        "i used this pot to make jam and it worked perfect. i think farberware is the best cookware. i have the basic set but added this to it. i have seen others i may be adding also. perfect cookware.",
        "It was a good pot but it got sacrificed one night for beer can chicken. It was too windy and we put it over the chicken on the grill. Chicken was amazing. Cleaning the pot not so much....",
        "I used the pot once on a low simmer and the bottom has black spots all over it now. They do not come out.",
        "I have been using Farberware products for over thirty years. They are well made, easy to care for and I fully stand behind their products. I have been in the market for a new stock pot for a long time. My friend gave me a gift card for Christmas 2019. A portion of my gift card was used to purchase my new Farberware stock pot, based on the past ratings, my personal interest to the product along with function and a well made stock pot. Highly recommended and useful to any chef or cook. Thank you Farberware! Please continue making quality products.",
        "I read a lot of blogs and reviews when I wanted to purchase stainless steel. Everything pointed to Faberware. I bought a complete set and when I wanted a stock pot, I again looked at Faberware. This is a wonderful pot. I make large meals and freeze food such as burritos. This pot is large enough to hold my cooking and not burn on the bottom. It is lightweight enough to carry from the stove. My husband even noticed the handles are not riveted on the inside so food will not get stuck in the hardware. The seller did a good job in packing the product well and shipping on time.",
        "Other than my Cast Iron skillet and dutch oven, this has been the best investment I've made for cooking. I do a lot of canning, I own the Presto 01781 23-Quart Pressure Canner and Cooker and the Granite Ware 0719-1 Enamel-on-Steel Canning Kit with Blancher for water bath applications. But I needed a really solid, easy to clean pot to do my large food preparations in. This stockpot has been PERFECT for my needs. I may get the 8 quart one next.",
        "Decent quality, Reasonably thick sides with the Farberware aluminum clad bottom, good pot for the price, should last for the rest of your life no matter how old you are now.",
        "I've had this pot for a year now, and it's holding up beautifully. I've used it to make stocks, stews, and sauces. I've used it as my primary canning kettle- using a tea towel instead of a rack (most of the racks I've seen don't fit in it properly), I've canned up to 8 pints or 6 quarts at a time. It's a great, versatile pot that's been a bit abused, and still looks great. Seriously, it's a really great, versatile pot and it's holding up well. Strongly recommended.",
        "It's not everyday I need a pot this large, so I've struggled finding the exact pot I wanted and then rationalizing the price. But my old pot, nicknamed 'Old Scortchy', had to go. I made, and then canned, a large batch of applesauce in my new pot as soon as I received it, and it worked like a dream. This pot is made very well, heavy bottom, no scortching, cleans up like a dream.",
        "Bought this for my daughter-in-law for soups and chili. It's very appealing visually - and I like my kitchen stuff to look nice. It's heavy and extremely well-made. Snobs may sneer at certain brands, but if you aren't a professional chef, just looking for a quality item for your home kitchen, I think this qualifies. I like the way the handles are attached. They don't get hot. The bottom is thick and flat, I;m told it heats evenly and the cover fits well. A very good value for good cooks.",
        "Having given the sauce pot of her youth, to my now married daughter it was only right that I give her a stock pot she can one day pass on. Farberware is a name I trust.",
        "Pretty pot. The handles don't get hot. and really heavy duty",
        "I bought this for making cheese and for general stock-pot use. It is a very shiny, impressive pot. Seems to hold up well and is dishwasher safe. Works with up to 2 gallons of milk when making cheese. The heavy, encased copper base distributes the heat quite well. The handles are welded and I'd prefer if they were also riveted, but they seem plenty strong for this size of stockpot. If it was lost or stolen, I'd buy it again.",
        "Quality and affordable! It's also the perfect size for a large family. I have for kids but I like to cook enough to last for a few meals and since it's always better the next day anyway after it has a chance to marinate. I would end up having to distribute my homemade soup into two 6 or 8 quart pots prior to purchasing this one.",
        "I still have in use a few Farberware pots I purchased 40 years ago. Indestructible!",
        "Perfect! I needed something to make a seafood boil and this worked great! Very sturdy.",
        "Perfect size and exactly as specified. Bought it for Mom & Dad for Sunday Gravy for their 66th Anniversary. Dad was thrilled, Mom cried. They have flat top electric & this pot is made for that. Ordering one for me. I have gas burners & the heavy bottom with tight lid will be perfect for soup & sauce. The pot is tall making it fit better on the stove plus works well with smaller quantities of liquid over a wider one creating a shallower depth of sauce.",
        "Finally, a pot big enough for us to boil our corn on the cob, corned beef with cabbage and potatoes, and giant portions of favorite family soups. We have always had to use two pans for those types of meals, but decided to buy this Farberware 16-Quart pot. It is fantastic!",
        "Exactly what I was expecting and they said would be.",
        "Arrived quickly and without using it yet, I’m impressed with the quality. Unless this pot is a disappointment, I’ll happily rate this at 5stars.",
        "Wow so this pot is huge. It was even bigger than I was expecting. It was immediately used to wash dishes (it's that big) and then make caldo de pollo using a puny little camping stove. The soup boiled really fast and came out amazing. Cooking was really even and you can feel the heft of this pot when you lift it.",
        "Absolutely beautiful pot. Distinctly heavy and solid encapsulated bottom plate. Solid metal lid. Sides are distinctly thicker to the feel than cheaper pots I felt in stores. And our experience with encapsulated bottom pots is that they are a great advantage over thin metal bottoms if you are cooking anything that can scorch (cream soups, thick stews, etc.) because there is much less scorch tendency with more distributed heat from the thick bottom. Less stirring needed without as much risk of ruining the whole pot's flavor from forgettnig to stir every minute.",
        "When we received this stock pot, it had a dent in it towards the bottom of the pot.",
        "Love this pot!! I needed something large for processing vegetables. Works great, fits my smooth top stove size perfectly. It is flat on the bottom so doesn't cause uneven heat distribution. Great for spaghetti sauce!!",
        "This was the perfect pot. Would buy more like it. My husband makes spaghetti sauce and chili in it. Easy clean up and no burning! Love it!!",
        "Really good, I was looking for one that fix my needs and this is it. I stock chicken soup to be ready during the week when I need, I am the type of person who reads review and I will recommend this for big batch of soup and many other needs.",
        "This is the perfect pot for making italian red sauce. Not sure why they call it a stock pot, as stock pots are for soup and cooking sauce in a stock pot won't cook properly and will burn. THIS pot is amazing, thick and heavey. Farberware is the best pots and pans they make. I got my set over 25 years ago and they are all still like new. I needed this 16 Quart as our family is big and I needed the largest size I could find. Love love love it.",
        "I know this is stockpot, but I wish Farberware sold a 12 quart pot that was a bit wider and not quite so tall. I needed a wider pot to simmer my meatballs and couldn't find it online so I settled for this one. It's okay, but not exactly what I wanted. I'll tell you what, though. I have cooked with All Clad and Calphalon and think they are way overpriced - Faberware serves me just fine and I cook A LOT.",
        "The equalized heating and easy cleanup. Plus the price was great.",
        "This is the best stock pot I ever bought, heavy duty stainless steel, well constructed ,easy to clean and just the right size.",
        "I really liked this pot, Holds quite a bit. lightweight, the weight of the stainless steel seems to be a good quality. I had bought another Brand a few years back and it was so Heavy! I could hardly work with it when i needed to dump out the water.",
        "After using a cheap ($20) stockpot for the last several years and burning countless dishes, I decided to buy a really good stockpot, and the Farberware fits the bill. Heavy and well-made, with a nice finish, as well as wonderful cooking capacity and performance. I actually weighed this pot, and it came in at just over 7 pounds (as opposed to 3 pounds for my old pot). Highly recommended.",
        "Owned a exact same pot for over 45 years,this one isn't a replacement its an addition..this pot is the best size and width for big jobs (not too tall or narrow) that's why this pot has been around for so long,,its the ideal size for big jobs witout being to big to handle",
        "Great size and great quality. Feels very sturdy and heavy bottom transfers heat well. Couldn't find it cheaper anywhere.",
        "My wife loves it. It replaced the old one she had for almost 40 years. Good price and quality construction.",
        "Great, heavy duty stock pot I use weekly. Stainless cookware needs to be heavy duty and aluminum free in my opinion. I have a (yuck) glass top stove and need to make bone broth on a regular basis. This pot has to stay on for about 48 hours at a time. It does the trick without my having to worry about burning the bottom.",
        "We prepare soups all through the winter and needed a larger pot. The 16 quart size is perfect for large quantities, heats evenly and allows simmering without sticking.",
        "I bought a cheap 16 quart pot and regretted it after the first use. The bottom got very hot and the heat didn't transfer very well up through the pot. If you didn't constantly stir your dish you'd burn the bottom. No so with this pot. Yes, you still need to stir your dish but it did an excellent job of transferring the heat. Very happy with it.",
        "Excellent stockpot. I've used it countless times by now, and I can't be happier. Transmits heat well and evenly, easy to clean, very solid, the cover fits perfectly and overall the looks gorgeous. Basically, everything about it is perfect. Note that it's huge, but that's what it's supposed to be. Highly recommended.",
        "Only concern is that the handles are not riveted to the sides.",
        "I really like this pot. It is well made and looks beautiful. I use it to make stock and it makes plenty! It heats up evenly and I like that it's wide and not as tall as other pots. I have a gas stove, I do not know how well it will work on an electric stove since it is a wide pot and it can get heavy. It has good sturdy handles.",
        "This is the best soup pot on the market. I have been using Faberware pots for well over 40 years. I have 30 grand children and am finding that this makes a great gift. The size is great for even us 2 grandparents who prefer to cook \"Large\" and freeze part of the food for later \"fast\" meals. When it's not used for cooking it can easily store bulky items to conserve storage space. It cleans up easily and always looks beautiful. Purchasing from Amazon.com is a money and time saving way to shop. Thank you for making such an excellent product.",
        "This pot is great! Very durable and looks nice. Cooks food well!",
        "Great pot. I use this for making Dr Furhman’s creamy cabbage soup (recipe makes a lot!)",
        "So far, this pot has been great. Due to it's size, I haven't used it a whole lot. The times I have, it has performed great...not too tall for the stove, no sticking. It's not the most beautiful pot on the block but that's not what I bought it for. When I'm ready for a smaller size, this brand will get first consideration.",
        "Love this stockpot. Great for soups and chili. So easy to clean. It is nice and a good weight.",
        "I absolutely love this pot! I bought it to go with my 23 quart pressure canner to do big batches. It has not failed me yet.",
        "We bought the pot because my husband got me a Nuwave Precision Cooktop for Christmas. However the Nuwave died after about 3 weeks of use. Sent it back but kept the pot. Needed another big pot that did not stick. Really enjoy using this pot, great for big batches of soup.",
        "I bought this pot as a gift for a friend after she commented how much she liked my Welco 12 quart pot. I received the pot today and noticed the box was smaller than I expected. So, I opened it up. The box says 12 quart but, when I use a measuring cup, it only holds 11 quarts. I pulled out my pot and filled the new one with water and transferred it into my old one. Sure enough, it's about 2 quarts less! I haven't decided if I want to return it and order the 16 quart one yet or not. So beware, it's a little smaller..",
        "Love it, love it. The heat is even and not once did anything stick to the bottom. My only regret is not having more sizes for everyday cooking but will that will come.",
        "This is a very nice stockpot. It is heavy, sturdy, and feels well made. My only ding would be that the handle on the lid gets very hot after simmering for a few hours.",
        "Wanted a 21qt pot for making big batches of bone broth. Love this pot! One really nice feature is that the handles are soldered on so the inside of the pot has no bolts to clean around. I have Farberware pots and pans that were wedding gifts 47 years ago and that are still as shiny as the day I got them. You can't go wrong with this brand,",
        "Used to make a HUGE amount of matzo ball soup for the high holidays. Held up well. For the price, it's great.",
        "Great 16 qt stock pot. We got one just like this as a wedding present 45 years ago. Still in regular use, still flawless. We bought this one which is identical to give as a gift for a budding chef. Don't hesitate.",
        "Do NOT like the quality. The first time I used this and washed it the side dented and leaving it on to cook burns the bottom. POOR Quality stainless steel. Could you tell me how to return to get my money back. 248-763-1724",
        "I love to make soups each winter. But I had to use two different pots because I didn't have one that was large enough to handle the entire recipe. The Farberware 12 quart stockpot solved my problem with room to spare. Not too big but it can handle the possibility of over-boiling soup before I realize that it is bubbling up. As for cleaning up afterward, it is so easy to wash and dry. Says \"it is safe to put in a dishwasher\" but I defy anyone to find a dishwasher large enough to accomodate it.",
        "It is solidly built. The handles seem like they're going to stay on. The massive welded bottom spreads the heat so well that when I'm making gallons of applesauce in it, the bubbles from simmering appear all over the surface and not just over the flame like in any other pot I have.",
        "Great pot, and huge! Way bigger than I was expecting, but my fault for not paying close enough attention to the dimensions. Seems to conduct heat very nicely and is dishwasher safe, though it will take up the entire bottom drawer of your dishwasher. It's heavy and feels durable. I've had great luck with it so far.",
        "This is a well built stockpot. The polished finish is like chrome, the handles are welded, not riveted, the lid is nice and light weight and the heavy clad bottom is great for heat distribution. It's made in China, which I don't care for, but it is quality and very well made.",
        "I've had farberware pots and pans for 421/2 years. There is nothing better. I had a griddle for 35 years. Best ever! They are I longer making them. I still have there electric skillet it to is 421/2 years old. The best!!",
        "This has become our go-to pot for soups, stews, spaghetti, pozole...i.e., all my favorite foods! I was really pleased with the sturdy construction and the overall appearance.",
        "Bone broth heaven! I can leave this pot on the stove for 14 hours and the broth is perfect",
        "The thick aluminum base prevented burning of meatballs and suace.",
        "We often make large pots of \"Sunday gravy\" and this pot does the best job of the many we've used over the years. It's roomy enough for 12 cans of tomatoes (yes, 12!) and 6 pounds of meatballs. Best of all, after 8 hours of simmering the gravy, NO burned food at the bottom! All that, and beauty, too. Just make sure you have ample shelf space to store it; 16 quarts is larger than most cabinets will accommodate.",
        "We needed a large good pot to cook down tomato sauce, apples for sauce, etc., without burning the product. This pot does a great job of doing that! It's a very good pot for a very good price.",
        "Product description states that it is 18/10 stainless steel. That is false and misleading.",
        "The best pot I have ever owned. Not being a chef, I had no idea how big this thing was going to be. It's nice to not have to break the spaghetti in half, and I fit 3 whole chickens in it once!",
        "This pot is very sturdy, well made and attractive. It's great for cooking a large quantity of yams for Thanksgiving, soup with the left over turkey, defrosting frozen meat, stew, what have you The price was right too.",
        "My daughter purchased one of these for canning tomato sauce, and was so pleased with it she bought one for me. I was so happy with it I bought a second one. VERY heavy base, nothing seems to scortch no matter how high I cook. No rivets for the handles so the entire inside is smooth and easy to clean. I don't think you could find a better buy.",
        "I've had one of these for 20 years - still looks like new and I use it regularly! Just bought one for my sister who has 8 kids ... she'll get her use out of it! Love the heavy bottom for even heat distribution and strong handles.",
        "I have had a hard time finding stainlss pots without rivets that go through the wall of the pot and provide a vector for rust and corrosion. This pot has no rivets and the inner surface is clear and clean! I am very happy with my pot and would defenitely purchase another Farberware pot in the future. I am not happy with other pots I own that have rivets, rust and corrosion !",
        "I just love farberware cookware. Wouldn't buy any other. The farberware set I received at my wedding shower in 1973 is still beautiful! A big pot like the one I purchased for making spaghetti sauce and meatballs for my big family!",
        "I love those stock pot. Now I have room to stir what I am cooking without making a mess. Heavy and durable.",
        "Just what I was hoping for. A great pot in between my six and 16 quart pots.",
        "This pot is the best...did my corned beef in it and it came out perfect, I have had the meat stick and burn in other pots so it did a good job for me. Very happy with this purchase",
        "Inferior product. After only cooking in this stockpot 2 times, it has pitting in the bottom.",
        "It's been my favorite soup pot for thirty years; I got this for my son and it seems to be the same reliable pot.",
        "This pot is exactly as advertised. It works like it should, and I have always liked the stuff Farberware sells. I wasn't disappointed in the least, and I recommend this product without reservation.",
        "Farberware quality at a great price. Well constructed, with a tight fitting lid and excellent heat distributing bottom, this big beauty bests my considerably more pricey gourmet level lineup. Highly recommended!",
        "This pot works nicely ... heats evenly and cleans well. I would have given it a 5, but I would be happier if it had a vent/adjustable opening to allow steam to vent somewhat without boiling over. The lid fits with a very slight bit of room, so steam comes out the edges. This is not preferred since it's easy to get burned even when using the handles if there is a large amount of steam.",
        "Very happy with my new soup pot! Highly recommended and I would buy again.",
        "HUGE pot - more than enough for massive soup making, lobster, crab legs. And again, I'm just sayin, this is a MASSIVE pot.",
        "Very nice, heavy kettle. It's exactly what I was looking for.",
        "works as expected, easy on time delivery. Purchased to donate to church kitchen.",
        "Beautiful pot! This will really be great for making my sauce for XMAS!"
    ]
}