{
    "entity": "Teapots",
    "text": [
        "I liked this product and decided to buy it among other options available on Amazon. However, after few weeks of using it, I noticed it is leaking from the bottom and making a big mess and leaving Tea stains all over my desk. Is there is way to fix this? Why this is happening over time? I would give a 5-stare if it did not leak but now it is making a huge mess everywhere and everytime that I make tea. I hope I can fix this. I also wish there was a way to clean inside the lock-in mechanism since it get dirty/black over time. Thanks, Kamran",
        "This is my 2nd one purchased. First one started leaking after some time and got a little stained. I figured it was time for a new one. This one leaks wayyyy more than the 2nd one have to constantly put it under a plate so i dont have tea all over my desk after a few minutes.",
        "We ordered two of these a few months ago. Great size, great concept, and was awesome for about three weeks. One started to leak within a month. At the time, it was just a small leak, nothing a small plate below it couldn't resolve, but after a few more uses, became completely unusable. The other broke down this week. It didn't leak filling it up. It didn't leak setting it on my desk. It leaked when I walked away to get something, leaving me with a huge wet mess upon my return. Zero zen for me that day. I trusted the nearly 5 stars this received but should have believed the reviews regarding the leak issue.",
        "Wanted this to work so bad, but this device leaks all over the place. Tried many temperatures and received the same result, tea puddles on the counter and stove. I caught it early and was able to make sure all the liquid didn't spill out, had I not, I'm sure the entire contents would have leaked out over time. Many reviewers have said that the manufacturing moved from a metal mesh to plastic, which is true, and that was the failure point. Again great concept but poorly manufactured...",
        "After the 3rd use it was leaving a puddle under the valve but I was still able to use it. I got a solid six weeks total of use out of this (about 4 times a week) before tea would flow freely from the unit all over the counter. NO I didn't put it in the dishwasher, it was never damaged it just is a waste.",
        "DO NOT BUY THIS PRODUCT FROM KAENKAY. Received my teapot yesterday, and it is obviously used. The strainer is tea stained, the plastic has hard water stains all over it, and there are even tea grounds still in the strainer. VERY UNETHICAL, to sell a used product as new. Nowhere in the description does it say I was buying a used product, and the price absolutely did not reflect that it was used. To add insult to injury, they will not return/refund/exchange the product. So I'm stuck with a $30 piece of garage sale trash.",
        "This item leaks so bad that I have to set it on a plate after I use it. I have already returned it once. I am returning this one as well.",
        "It does the job of dispensing tea quite nicely, will fill your cup. HOWEVER....it leaks when set down. If you did not completely empty out contents into your drinking cup....expect an ever-growing puddle of tea. LYYOOONNN",
        "It SEEMS like a great idea. In practicality, it's a terrible way of making tea. Small pieces of tea get in between the little stopper and it leaks everywhere. But worse, if you don't pour it all, you can't get the tea leaves out so it sits and over-steeps. So no using it to keep tea warm while you drink. I'd definitely want my money back but I gave it a fair month of usage before I decided i hated it.",
        "We had an 8 oz., older version of this teapot. The filter on the old one was removable and created a problem. If you try to empty the used loose tea into the trash, sometimes the filter would fall out and you'd have to fish it out. Also, if even a tiny remnant of tea leaf was unknowingly left under the filter, it would leak all over the place next time the hot water is poured in. This design is much better (with the fixed filter) and it's big enough to make tea for two!",
        "My wife purchased one of these teapots for me when we were first married--15 years ago. I finally had to replace that first Adagio pot after all those years of regular use. The valve started to fail. C'est la vie. This is a very good product that is a pleasure to use. I like the option for making varying amounts of tea depending on who you may be with, or how much you feel like drinking. I like the clean taste of the brew. . The new product is a little different from 15 years ago, but I can only see improvement. Thanks.",
        "I have two of these. One unfortunately leaks a bit from the bottom, dripping onto the table after tea has been poured. Without the tray, the water can stain or leave marks on the table. The other works perfectly (so much that I don’t even know where the tray is). I love being able to use loose leaf teas, instead of tea bags. For the most part, I just give them a rinse when done. So they have tea stains on the inside. It doesn’t bother me too much but that’s the part that is harder to clean. My coworkers are always impressed with the tea dispenser!",
        "Love this product! Not usually a tea drinker...lol... but this product now has made me become a tea drinker. Fresh brewed tea tasted great! It has made the process so painless. Every tea drinker and new tea drinkers should own one! You will not regret it!",
        "I just started to get into loose leaf tea so I was looking for an easier way to brew than to have to strain it every time. This was the perfect solution to that! Just steep your tea in it and put it on your cup! There are 3 pieces that come apart for cleaning which I try to do about once a week otherwise I just rinse really well after I empty the leaves! I don't have the leaking problems other people do as much unless it's at the very end of the cup and there is a little bit left at the bottom then I've noticed a very small leak but nothing terrible.",
        "The idea is great, unfortunately not well executed. Had the product for some time, it started leaking a few months after purchase. Company will not honor warranty because it was bough on Amazon. Their stated reason is that they don't have information on purchases through Amazon. Doesn't sound right. Also the product is made of plastic not glass. I've learned that plastics may leach chemicals when used with hot beverages. Won't buy again.",
        "I used it for a few times when I originally ordered it and it worked great. Then I forgot about it for a few months so it was just sitting inside my kitchen cabinets for a few months. I took it out recently to use it and it leaks tea drop by drop wherever I place it. It seems like the rubber seals degraded just in a few months and that too when it was just sitting in my kitchen cabinet. Wouldn't recommend it.",
        "Absolutely best and easiest way to brew loose leaf tea. Spoon in a cup of leaves, fill with water, microwave a minute or so, let steep a minute or two. Then place the contraption in top of your mug, triggering the door and see your tea drain into your mug leaving the leaves behind. So easy!",
        "A quick demonstration of the Ingenuitea teapot. We like the ease of use of this product and especially how easy it is to clean. We tend to not use tea bags and prefer loose leaf tea. This little infuser has us drinking tea more frequently. Watch how easy it is to make a nice cup of tea: Update December 2012: We still use this unit all the time and it has held up quite well. One note is that the coaster in the video no longer comes with the unit. We misplaced it a long time ago anyway.",
        "I LOVE this teapot. I used it every day for several weeks. Unfortunately after the first week I started getting small puddles underneath it. By the third week there was a constant small drip when any liquid was inside. This seems to just be an inherit design flaw of this unit. With the constant battle against gravity it seems like this teapot loses in the end every time.",
        "I purchased this for a friend as a house warming present. He LOVED it! The quality was great, the price fantastic, and I think I even like it better than the one I have from a different brand. I do not remember seeing the instructions to take it apart for cleaning. I had previously looked up cleaning instructions on Youtube; that would be the only suggestion I'd add. But, other than that it's great! When mine gives out I plan on purchasing this one. Loose leaf will take your tea game up so much; forget buying bagged tea anymore!",
        "Have owned one for years, since they came out on a shopping channel. Pop a spoonful of loose tea or coffee in the top at hot water and steep until you like the color. Set it on your cup and it dispenses without a mess or drips. Clean up in the dishwasher with an occasional soak and scrub. Makes great gifts for my coffee and tea friends. Best to have one for coffee and one for tea.",
        "Love love love this product! Mine doesn’t leak at all, super easy to use, free tea leaves make better tea by far, I love that I can see the color of my tea as it brews (dark/light easy to gage so you get what you want) and most importantly to me it’s easy to clean (helpful hint if you don’t like the stain that happens over time just use baking soda and hot water let it sit and tah-dah much better no hard scrubbing needed)",
        "I think I like the Teavana version a little better because it both drips less and came with a drip tray. I like this one better because I can fill it all the way up without it overflowing when I close the lids. But I had to dedicate a plate to sitting this one on which is a little annoying. That being said, if you are a tea drinker, get this or the Teavana one because this design is overall awesome and so convenient.",
        "I am disappointed in this infuser because I like to reuse my tea leaves a couple of times. This infuser leaks out the bottom when sitting on my counter after I drain the tea. I can't find the other brand I used to use that finally broke after many years. Now I have to have a plate or saucer handy when reusing my tea leaves.",
        "This has become my go-to single cup tea brewing solution. The simplicity of it is just delightful. Add tea, add water, steep, set on top of mug and watch the steeped tea flow out the dispensing hole in the bottom. In particular makes it that much easier to do further cups off the same leaves. I know there are fancier options out there and they may honestly be better. But this product for this price has me sold.",
        "I like the ease to use and clean this product. Made well. The only thing is to make sure before you buy that your cup is the right size for it. I found out my Starbucks cups was too big so I had a buy a smaller cup for the tea which is fine with me.",
        "I bought one of these several years ago and remember it being several dollars cheaper. It's a little expensive for what it is. That said, it works flawlessly and makes very good tea. It is easy enough to disassemble and clean (even with large hands) and it is very satisfying to watch it drain into your mug.",
        "This is a wonderful way to brew up some loose leaf tea. I've used it everyday since November 2016 and have had no problems with it at all. I've tried four different flavors of tea in it with various sized tea leaves. As of yet, I've had no tea leaves in my cups of tea. The mesh strainer part has not clogged up at all and there's been no discoloration. I do have a little tea leak out onto the counter but I just place it on a plate or paper towel while I'm using it. It's not a big deal for me.",
        "When this works properly it is wonderful. Unfortunately the mechanism to release the tea is very sensitive and sometimes doesn't sit exactly level. When that happens the hot water flows out on the counter when it is being filled and it is necessary to hold over the sink until the seal can be adjusted. Even the lightest touch on one side of the seal will begin the emptying process.",
        "LOVE LOVE LOVE THIS THING! I saw it in a coffee shop and just had to get one. It's fantastic for loose leaf tea, I've never had any tea leaves get through. It's so easy to use. Only thing is, I don't ever feel like it's 100% clean, but since it's only for tea, I feel like that's not a huge problem.",
        "It works perfectly for making tea, but now I wonder why I got this thing instead of a couple of tea balls. It stains incredibly fast and it's just another thing I have to clean. The novelty of seeing your tea infusing is not worth the extra effort. Plus, it feels like you're about to break the thing anytime you need to rip out the filter for cleaning. Make it easy for yourself and just get some tea balls.",
        "DON’T BUY. It’s easy to clean, easy to use, but the two I purchased were faulty- both leak. It’s not a full on spill/leak, but it’s about 3T to 1⁄4 cup worth of liquid, enough to require a countertop clean-up. It was minimal at first and then slowly, it got worse and worse. Once, it leaked so badly that it spilled down the counter, onto the dishwasher and then the floor. I’m done. I ordered the glass one with a top filter and liking that one so much more.",
        "I had several bottom dispenser teapots. This one is by far the best. I use full leaf teas and I don't like the leaves contained to a basket. The reviews stated the filter was hard to take out the first time. I washed It in warm soapy water and allowed hot water to sit in it 5 min. I was able to remove the filter. Just love this teac pot and small enough to pack when I travel.",
        "I was mostly a coffee drinker but began to add tea to the rotation. I purchased this along with a electric kettle so that I could try loose leaf teas. The ease of use and wonderful results have made this an invaluable tool. I now look forward to enjoying a variety of teas every day. Buy one.",
        "In concept, this tea brewer is great. In reality, I can only give it a 3 star rating. It is difficult to clean after brewing tea. My leaves often stick inside and are difficult to remove. Sadly, it also leaks. I found this out the hard way, after brewing tea in it on my nightstand, while putting my children to bed. I came back to a puddle and a tea stain on my white wood. I will continue to use it, but will only do so on my sink drainboard.",
        "I have a really nice traditional teapot with metal infuser but I still find myself using the ingenuiTEA most of the time because it's a breeze to clean and the mesh filter does an amazing job of retaining even the smallest loose tea particles. After almost 5 years of use it still works great. You can use a solution of baking soda in water to remove most stains from the plastic.",
        "This is a great product and makes a good cup of tea. The biggest issue is that it leaks. After dispensing the tea, I have to set it down on a napkin to soak up the remaining tea. I don't have any issues with the water in it before I dispense the tea, only after. I'm not sure if it's pooling up somewhere or actually leaking -- but it does make a good mess if I don't put it on a napkin. Easily a 5 star if it didn't make a mess on my desk without a napkin.",
        "This is one of those items that makes you sad to think about your previous life. I experimented with the leaf tea in the past, but always moved back the bags. No more bags for me, though. The leaves taste better, and they have more green tea goodness. No leaves get through this cup! And, it is simple to use. I heat water in a drinking cup, pour it in this device w/some green tea leaves and empty the tea back into the original cup. This tea maker rinses spotless in 2 seconds. The lid is a bit tricky, but it does come off for the occasional run through the dishwasher.",
        "I use this product at work, and it was great in the beginning, but the more I used it, the more leakage I saw. I started needing to place it on a plate, then the plate would be soaked by the end of the day, so I added a paper towel to help with the leak. The attached picture was after less than an hour of brewing my tea.",
        "I just received this in the mail and immediately used it with no issues at all! I love it. It's a perfect size too. I expected it to be bigger but I'm glad it's not. Its nice to have at my office to use while I work.",
        "Just returned from vacation in CO and ate breakfast at Farmers Market in Denver. The had this product for my tea order and I was so impressed, that I ordered mine on the spot. Was delivered to my home in OH 2 days later. Love it and have been able to get 2 pours out of pot. Now I’m on the hunt for more loose tea options which I had gotten away from",
        "Love this brewer - it's clear so you can easily see how strong the tea is becoming. Dispensing through the bottom into a cup is easy and neat. Setting the brewer on a plate after dispensing prevents any drips. It does go in the dishwasher, but the attached lid makes it awkward to get in there.",
        "I've purchased six of these over the last few years. combined with the right tea leaves, the ingenuiTea makes the best single cuppa you can produce at home. The reason for the 3 star review is that the item routinely and predicibly begins to leak at about 10 month to one year in service. I'd gladly pay more for a re-engineered version with some staying power.",
        "Years ago, I bought a similar-looking product. You know, from the company with the “tea”-name. This should be the same, right? Not by any means. If you love tea dribbled all over like a frightened toddler, go for this one. You won’t be disappointed. Jokes aside, I feel actively cheated out of $20. Buy the other one.",
        "This is my second IngenuiTea. I accidentally broke my first one so immediately ordered a replacement. It makes brewing loose tea very easy with very little or no mess. Just put the IngenuiTea on the cup and it dispenses directly in. Also, depending on the loose tea you use, it is nice to see tea floating or moving as it brews.",
        "Works really well but only on certain mugs. I've never had an issue with tea leaves getting stuck though, and it's really convenient, more so than using a normal infuser. Just make sure that you keep an eye on the water the first few times, and don't fill it up completely, because the first time I used it, the water overflowed even though the mug held 17 ounces.",
        "This is super easy to use and clean. drop in the tea leaves add some agave sweetener then add water. Let sit for a while and when ready place on top of your cup and watch the tea drain into your cup. enjoy! super easy and works great, thus far no residue allowed in. The only draw back (why I took a star off) is the lid pops off way to easily. It pops right back on but it is a bit of a hassle. That is minor but still. With all that said, I would buy this again.",
        "Unfortunately, it’s seldom that you find a product that works as advertised and exceeds expectations. This product does both. I couldn’t be happier. Nice work Adagio! Keep up the good work. Only one thought for the future. Plastics get brittle and break down over time. If you guys made a glass version and charged twice the price as the plastic version I would definitely buy one.",
        "I'm so worried to wear out the plastic by removing the lid all the time, but it stays on or comes off easily, yet never falls off on its own. Fits the perfect amount of liquid for my largest mug, and fits every cup I own. Makes brewing and then straining the tea leaves out so easy and makes it significantly easier to use loose tea. It also rinses out easily",
        "My sister has one of these so I decided to get one. It's super easy. You just pour the grinded coffee in and then pour hot water on top. Put it above your glass and press the little thing underneath the teapot and that's it. I don't use it for tea, I use it for coffee and it's like magic!",
        "I always read the reviews. And then question the validity of the reviews (healthy online skepticism). This product warranted me writing one. Simple - I love it. It works wonderfully! My only “complaint” was that I have some very wide brimmed mugs that it doesn’t fit on. I switched to a different mug and no issue.",
        "I used this device every day and got a little jolt of happiness every time. After a while, some of the nooks and crannies get stained, so I took it apart to clean it. There is one very fragile connection from the bottom plate to the stopper. The first time I purchased it, the post broke when I was reassembling it. Yesterday, the part rolled off the counter and broke on the floor. I tried to fix it with epoxy, but it didn't seal right, so it's dead now. Sad. I can't bring myself to replace it a second time, even though I really like it. I just wish it were more durable.",
        "I've used this just about every day for the past three years. I don't drink much green tea anymore but it was easy to re-steep the types that allow it. In terms of cleaning, if you have a garbage disposal it's especially quick to dump the used tea and rinse. Though I don't remove it after every use, the inner strainer also lifts out and pops back in. There's been a few times where I've dropped the whole thing in the sink and the top popped off. Turns out that can be removed and clicked back into place as well.",
        "This Rocks! No longer comes with Adagio sampler teas. Makes amazing tea. I will never go back to using a basic infusion tea strainer again. Cannot be beat, and easily cleaned (with a little baking soda and water, stains come right out) Only complaint: This was purchased as a replacement for one that I broke (totally my fault, nothing wrong with the original product) The replacement had some noticeable spinning scratches from production. I am crossing my fingers that these deep scratches do not turn into cracks. So far no problem, but the scratches do concern me a little. Cheaper than the Teavana brand, and just as effective.",
        "I was surprised to find there were no directions on how to use this diffuser. I assumed you had to take the bottom out and it was very tight but I got it off. I put it over my tea in it ran right through. However the Seal is off to the side, so it’s not functioning well. I just went on YouTube and found how to use it, but it is now broken I don’t want to spend another $19 when this one never worked for me.",
        "Bought this because our daughter had one (another, more expensive brand) and it was very nice for making herbal teas using fresh herbs from our garden. Just pour in hot water, add a few sprigs of the leaves (amount is your choice) and let set until steeped. This teapot worked as well as the more expensive, glass unit. We just set it on a saucer to steep and then put it back after filling the cups. Never had any issue with leakage. Cleaning does not seem to be a problem at all. Read other reviews to get instructions if you like. Recommend it if you want to brew herbs and teas and dispense into the cups easily.",
        "Get ready to stock your stash with quality loose leaf tea. These rule in every way!",
        "I have been using strainers like this one for years and couldn't live without it. The room in the cup allows leaves to fully expand and setting the strainer on a cup is mess free. I recommend this to all tea drinkers. The whole thing comes apart to put into the dishwasher, too.",
        "Purchased at end of December, started leaking middle of February and now the mechanism wont lock at the bottom. Completely worthless after just two months. Good idea but terrible design, trust all the other reviews here that have the same issue.",
        "Always good to get a product that lives up to the hype. Had this 3 years, 3x/week. Put in whatever tea, spice you want, and add as much water as you prefer. Wait for brewing. Place it on your mug and it drains fast (3 seconds), no leaking when you take it off your mug. Put it back on the counter--until you're ready to finish off the remainder of the 16oz. Cleaning takes a whopping 4 seconds to fill and rinse it twice. Loose tea never gets stuck. Wish everything in life worked this well.",
        "Genius! It looks great and it’s a blast to use. It’s like magic. Put tea leaves in and when you place the pot on your cup, the liquid pours into the glass. So easy to clean and reuse over and over again",
        "Works great, The one thing I wanted in the package would have been instructions on how to clean out the bottom. I know there might be videos on how to remove the parts and clean it I will just have to look. It is not a fault of the product itself since this works great.",
        "This is a fun start into the world of tea! Super convenient to use, I bring it with me on trips where it's too much of a hassle to bring my tea set. Because the brewing chamber is so large, you can brew in whatever ratio you want -- adding a lot of leaf-to-water ratio if you like gong fu brewing (which I recommend!). It's quite amusing to pour out the tea -- I call it \"peeing\" out the tea -- but I don't recommend doing it in the middle of a work meeting (speaking from experience ^^')",
        "I am a HUGE tea drinker and I always used to step my tea in these little tea stealers that hang over the coffee cup, but this thing is way easier and is just super cool. Really easy to clean, just rinse out the leaves basically. Its awesome. If you are a loose leaf tea drinker is definitely worth it.",
        "I bought one of these 15 years ago. Worked great. Bought another in 2019. Within six months it began to leak. There are many other reviews saying the same thing. Unfortunately the product will still have a high average rating, but do not purchase this product now.",
        "If you drink tea regularly, but one. Buy ten so you can rotate flavors. I love this thing. They could make a few engineering improvements, but only small ones. This thing works great.",
        "I use this to make all of my loose tea now. Came with some lovely samples of four different teas. Works as advertised. A bit of a hassle to clean, and I worry that someday some mold may grow in it and I will be unable to get it out of the mesh. All in all, quality product.",
        "very awesome, it that it doesn't creat a mess and drains into any cup I used so far. Square cups round cups. Purchased in 2017 and the filter part does not come out separately for cleaning. Much better design and sturdy to the ones sold at the Tea shop owned by the worlds largest coffee store. This is very nice.",
        "This is my second IngenuiTea brewer. First one worked for years through several moves. This one...well, not so much. It's kind of like they have changed the plastic. The parts fall out and the top pops of easily. I find myself reconstructing it. It does the job, but in comparison to the one from about 10 years ago, the quality is low.",
        "Really impressed with this tea steeper dispenser. Never tried one before, but now I’m dedicated to it. Works as advertised, no drips when it is not over a cup. Rinses easily. Love the taste of loose tea steeped in this way. And, the bonus package of tea was a nice surprise, it’s awesome tasting.",
        "Used product 3xs and it leaked every single time, a substantial amount of water. Does not come with a little stand or disk so I just put it on a plate. Very disappointed. Returned and ordered another one that does not leak.",
        "This is a great product. I use it all day. I prefer loose teas and have tried dozens of tea strainer. By far this is the most convenient and easiest to use. It steeps the tea and strains it with ease.",
        "We saw this in a specialty store in Glen Arbor MI but didn't want to pay there asking price which was $10.00 more than Amazon at the time so I immediately ordered one and buy the time we got back home it was at the door. It was nice that the sales clerk at the store had one she was demonstrating so we could see how it works, It does just what it says it will and it makes great tea and it doesn't care which tea you like it just does a great job of it. We liked it so well we pruchased several more for Xmas presents for our tea drinkers",
        "I just ordered my second one of these because I accidentally threw away the lid. It is one of the best products and most reliable products I have purchased on Amazon. The only issue I have is the discoloration that coats the inside after a while but that is probably because I use it quite a bit. It is easy to clean which is important because I drink loose leaf tea. I highly recommend this product.",
        "My family of five and I are major tea enthusiast. We drink tea morning, noon and night. We’re moving into loose he’s now as this is an amazing tea infuser for us to use. It is also very easy to use and very easy to clean. The only downfall about this is that it doesn’t keep your water hot while it is steeping the tea leaves",
        "I love the idea of this but the design needs improvement. Cleaning involves shaking it out upside down or putting your hand inside to remove the filter, or otherwise rinsing it out into a strainer - in which case, why not just use a $10 french press or a regular cup filter? I like this overall, but it could use some tweaks.",
        "This makes great tasting coffee—as strong or weak as you want. I like it strong. I put 3 founded scoops of dark roast coffee (I love the Trader Joe's Bay Blend), pour hot water heated to 212o F over the ground, stir a few seconds, let it sit a minute or so, and then put it on top of my mug. Coffee is hot, strong, and tasty. Really easy to use and easy to clean—just lift off the lid (easily to remove and replace and doesn't feel like it's going to break), rinse, and dry. Very happy with this device.",
        "I like the teapot, it is good for just the right size and easy for a cup of loose tea. The first time I used it, there was no problem; the second time, after putting the tea in my cup, it leaked. It now leaks everytime. Solution would be a little drip tray. or use a saucer. The other one I have comes with a drip tray.",
        "Cool mechanism. I love seeing how much liquid in ounces I’m brewing. It can get clogged and take forever to pass if your tea is very fine. Just dump it into a strainer, no biggie. My issue is being clumsy to knock it off the counter or drop it —I’ve broken two. I bought a different system.",
        "My wife loves hers. One of my co- workers has one so I got one for my wife. It comes highly recommended. I got me one too and it was taken to her work so she has one for work and one for home.",
        "This tea infuser was great and I thought I had a real find! Then it started to look worn, the plastic started to disintegrate, mineral deposits clouded the plastic and the hinge on the top broke. To be perfectly honest, I did wash this in the dishwasher, top rack, about once a month (rinsed it clean every day after use). I also soaked it in vinegar once (1 hour) to try and get the mineral deposits off with no luck. The plastic on this just got very soft after daily use for 7 months. I was going to get a replacement but see now that there are many more options so I'm shopping around and won't buy this one again.",
        "I have had a smaller size Adagio Teas ingenuiTEA teapot for the longest time; however, as someone who drinks tea around the clock, I could not be happier with the purchase. Perfect size, easy to clean. Very practical!",
        "This thing is absolutely awesome. I just started getting into tea (made the switch from coffee which gives me too much acid indigestion) and I couldn't be happier. it's well made and super easy to use. I also like watching it brew as it kind of becomes a tea lava lamp. haha. I'm not 100% sure how you are actually supposed to clean this this and I am hesitant to remove parts so I have just been running it under warm water after each use and that seems to do the trick.",
        "I really like this teapot, infuser, whatever. The mesh inside is so fine that it really does a great job of straining out the \"stuff\" you don't want to drink. It is a nifty design and I can easily tell when it has steeped long enough and add more water for a second steeping if I choose. Two things - a little awkward to clean and I burned myself by picking it up and accidentally bumping the bottom ring and dispensing very hot tea on my hand. So, don't be clumsy and thoughtless with this product! I would recommend it and buy it again.",
        "Cannot recommend this product enough! I drink A LOT of loose leaf tea and was getting tired of all the fuss with a larger teapot and strainer, etc everytime I just wanted a cup or two. This allows the right amount of tea for a couple large mugs full and clean up couln't be easier. Just toss used leaves in the trash and pop in the dishwasher. I have really been enjoying this product and plan on buying a few more for friends and family.",
        "This is by far the best way to make tea if you use loose tea. I am on my third one and found it is very durable and easy to clean. I take the filter out and also remove the bottom once a week to clean . Denture cleaner works really well !!!",
        "We're real happy to have this one as a replacement but really prefer the Teavana size which is at least 1 cup larger. Nice product though. Glad we at least found this one.",
        "I love loose green tea, but the tea leaves were always getting in the way. I have tried many other solutions but I have finally stopped my search. This is it! I have been using this pot for a while now but was not sure if it was microwaveable or dishwasher safe since it is plastic, but I have checked the description and yes it is! Therefore I give it 5 stars. I love this product, no more tea leaves in my mouth. If I had to improve something, I would say maybe stronger material as it feels a little flimsy, but it works fine as it is. Very happy with the purchase and very reasonably priced.",
        "PROS:Sturdy, filter is tight-fitting, does not leak. CONS: (Nitpick) -> Filter seems a little fragile, and is a little hard to clean. Nothing else. FINAL VERDICT: Worth the money if you like to drink loose leaf tea. SUMMARY: I bought this recently on my girlfriend's recommendation, and I have not been disappointed. I started drinking loose leaf tea for the first time, and this works very well. I had one leak incident, but that was because I didn't push the filter back in all the way, have not had a problem since. NOTES: Turns out this is dishwasher and microwave safe, so maybe I'll try tossing it in with the rest of the dirty dishes.",
        "pretty cool teapot. I bought this for my girlfriend who loves tea. I would recommend this to anyone who enjoys their Tea, especially as a gift. kind of a fun conversation starter at a dinner or desert time. I wouldn't say this Teapot is any easier to use than regular Tea pots, it looks cool though, fun to use. I would say that it IS easier to clean than some tea pots with smaller openings at the top though which is nice. Its big enough to stick your fingers in to clean it all or use a sponge or something to do some light scrubbing.",
        "I absolutely love my ingenuiTEA! I use it every day at work, and it still looks new. I rinse mine every day, and that's all the cleaning it needs, but it is also easy to disassemble if ever you need to get in the nooks & crannies.",
        "This thing is beautiful, sleek, functional, and super easy to clean. It steeps tea very well and is sturdy. Definitely recommend it! If you're looking for a tea steeper, this is the one you're looking for.",
        "Works really well! At first I had a hard time figuring out how to clean it, and then I accidentally dropped it on the ground one day and apparently a part came loose because the next time I used it that part came off and leaked EVERYWHERE. It turned out not to be broken though, I was able to put the part back on and it works great and is much easier to clean now!",
        "Did anyone experience discoloration after 3 months of use? I threw it out, not sure what caused it. The mug became so cloudy, bleach wouldn't even work. Suggestions anyone?",
        "I have had two of these infuser. The plastic wears and stains terribly. I clean my infuser immediately and have even sprayed with vinegar for the stain. The plastic looks very scratched and fuzzy only after a few months. Makes great tea but the unit looks worn out after a few months.",
        "Fast shipping, like two days. Appears to be good quality. I'll update if I'm wrong. I would give it a shot.",
        "Gets the job done. Inexpensive but mine always leaked very slightly. If I filled to top, about an oz would be on the counter top leaked through the bottom. Would make sure it's on a flat service but still always leaked. I just started placing it on a small plate so not a huge deal. Does what it needs to do and a good price.",
        "Great product, will be purchasing more for gifts. So easy to use and love the idea of using the tea more than 1 time.",
        "Love LOVE love it. I need another because I carry it back and forth to work and sometimes forget to bring it home. I don't drink tea by the cute little cup I drink it by the mug. This makes more than enough for even the biggest mug you can find. The only problem I have and it is ALL my fault, is that I have a bad habit of putting my hand under it and spill tea all over myself.I'm going to have to learn to put it on a saucer just for carrying purposes at work.",
        "I love this thing. The gadget that makes the tea flow and stop worked flawlessly. Bonus: The lid keeps animal hairs from getting into the tea. There's just one thing I don't like about it- I drink too much tea. While my first steep is pretty strong, the second steep is the polar opposite. I think this would be solved by buying a larger holder. Where both cups would get the the first steep. More consistant cups."
    ]
}