{
    "entity": "Teapots",
    "text": [
        "I have had this teapot less than 6 months and it has already broken. I was simply pouring a cup of tea and the fragile thin glass on the spout cracked and broke off (I’m assuming from the heat). I didn’t hit it against anything. I’m extremely disappointed in this item. I ignored the other reviews saying that it broke easily and hoped that I would have better luck.",
        "I bought this because it was recommended on the wirecutter's blog for best tea pot. My husband uses the Hario coffee pot for his pour overs, and the glass on his coffee pot is much thicker than this tea one. This tea pot worked great...until I noticed that the spout must have broken, but I have no idea how or when. I have 2 toddlers, and I then had to worry about where the missing shards of glass were. I'm disappointed because I want to buy another one, but this one only lasted a 6 weeks. Not sure if it was a defect, or if they just don't make the product as well anymore.",
        "This little glass teapot seems fragile at first but I could not ask for a more functional and durable glass pot. Handles hot water very well and is great for watching your tealeaves unfurl through the nearly flawless glass. The included strainer fits perfectly and the spout pours accurately. Wonderful craftsmanship! Overall a great piece from Hario. Look no further for a functional yet elegant glass teapot!",
        "I bought it a while ago and I like the teapot itself. It is nice, well made and I really like it. The problem is that the infuser is absolutely not appropriate quality for this overall nice product. It was initially ok, but with time started to oxidize, smell and overall ruin the tea. I had to replace it with my old truly stainless steel infuser. I am really disappointed at this time. For the price they should have made quality stainless steel infuser infuser.",
        "I've had several teapots over the years, ceramic and glass and plastic (Teavana), in addition to loose tea infusers in every size and shape. This is my favorite. It's the perfect size, brewing two medium sized mugs of tea. It really does make a difference having such a large basket for the tea leaves to float around in. Also, the spout is perfectly designed and does not dribble hot tea out while pouring. The price is fantastic, too. One year old: still using it every day, in the dishwasher every night, sometimes in the microwave, and in spite of a granite countertop....still a champ.",
        "I bought this teapot expected that rhe whole set is made in Japan, but only the glass teapot is made in Japan, the stainless steel strainer is made in China. The worst part is I saw the same Hario teapot in the local Japanese market with the strainer made in Japan too, just a few bucks more. Really disappointed with this purchase, and felt being lied by the seller. If I knew the strainer made in China I would not buy this.",
        "I've had a wide range of tea brewing pots over time, and this one is the best so far. It's the perfect size to brew a mug at a time, which is how I usually drink all my teas. The basket is quite large, and a heaping teaspoon gets excellent water circulation around it, even after it all unfurls. It takes even boiling water in stride, and has held up to months of daily use with multiple steeps per day. It's easy to clean, and even though it feels like awfully thin glass (for a teapot) it's held up without a scratch or crack. I definitely recommend this one!",
        "Absolutely love this teapot. I've had it for a year and half and use it every day! You can get 2.5-3 cups out of it and the whole thing can be put in the dishwasher if needed. If you leave the strainer out for half a day, the leaves will dry and they fall right out. I would like to get a second strainer, so I can make different types of tea, one right after the next without having to wash out the strainer in between.",
        "I am a little disappointed that the stainless steel filter is made in China instead of Japan but at least the pot is made in Japan. I would easily spend a few dollars more to have the entire thing made in Japan. I actually dropped the top glass cover in the sink and it bounced around without a single crack! The filter will stop most leaves from getting into the tea unless they are dusty like some green/black teas (not a problem if you use high quality tea). Overall a good item for the money.",
        "Inexpensive, attractive, contains a large strainer basket, and pours well- what more could I want? And since my tea kettle's minimum water level is 500ml, it's basically the perfect size to make a full pot of tea without wasting a ton of water. It's enough room for three regular cups of tea or one really big one. The walls are thin glass, of course, so I wouldn't necessarily use it for really temperature-sensitive tea (unless maybe you pre-warm and put a cozy on it). For my every day black, chamomile, and peppermint brewing, it's great, though.",
        "I like the shape and style and used it very carefully for three to four months. Then one day when I put it under tap to wash it, a piece of glass suddenly chipped off(photo attached)and almost cut my finger. Can't use it anymore...Had to throw it into trash...",
        "Great little tea pot. A little smaller than I expected even with the 700ml. But perfect for about 1.5 cups of tea for me at work. One thing to note. It looks like this unit is made in China. (Though imported from Japan). Personally I've been trying to avoid China made cookware - which is admittedly quite difficult - out of wariness of potentially unhealthy materials being used in the production of them.",
        "I bought this pot for my oldest son for his home but I have this same tea pot and have been using it for years. In my opinion it works better than any other tea pot. Since the pot is rather short and squat it has a larger wider mesh diffuser for your tea leaves to have room to expand as they need to for full flavored tea. Mine has lasted for years so when my son expressed interest in making real tea I bought him the same tea pot I use every day!",
        "This gives an attractive show when your tea leaves float around as they steep, combined with the hot water turning attractive colors. Much better than an opaque teapot. Very easy to clean the pot, strainer, and cap. You can pour without losing any leaves by holding down the lid as you pour. While the whole pot is probably fragile because of being thin glass, reasonable care during storage and washing will make this thing last a long time.",
        "This is a beautiful teapot. I would consider it a teapot for one. 700 ml is 23.67 oz, which is almost 3 8 oz cups for dainty tea drinkers, or 1 1/2 16 oz mugs for those who like large mugs of tea. So pour accordingly if you've invited a friend! I received this yesterday: I washed it out and have brewed two pots of tea, and I am completely thrilled with the sweet little pot with its substantial tea strainer, which worked as intended with the loose green tea I purchased. Highly recommended.",
        "I’ll start with I love this teapot. Unfortunately, I broke mine and had to order another. It arrived with the box opened and the lid was missing rendering it unusable. If we weren’t in quarantine, I’d send it back. However, as I kept the lid from my broken pot, I have a complete teapot, but I would never purchase from this vendor again.",
        "The fundamental problem I have with the other glass teapots on Amazon I've tried is that the primary thing they get wrong is the filter is too narrow. What's even the point of a teapot? You want the tea to breathe, to swirl around and extract evenly. This teapot will do it for you and it's obviously designed by tea drinkers who know their craft well. Also, you can't go wrong with Hario.",
        "Update: still Love this teapot. Keeps tea hot and pours nicely! I have been using it for nine months now two or three times a day and I am so impressed with the quality and it keeps the tea hot! It is not as fragile as it looks I wash it by hand and sometimes I’ll scrub it but it has held up really well. Perfect size for for 2 cups of tea!",
        "Solid quality and great Japanese craftsmanship. I use this kettle for all of my hot tea, whether it's white, green, black, or mixed blends. Holds heat wonderfully (if the lid is kept on), is easy to clean, and pours cleanly. A great gift to any tea drinker you know, and I'm a big fan of Hario glassware after using this kettle.",
        "Save your money! While the pot is made nicely & the stainless basket is well made, the glass spout is very fragile. A slight bump caused a chip while hand-washing. My pot lasted about 2 weeks.",
        "This pot worked very well for a couple of years until one day I wanted to use it and saw a big crack. I am willing to buy another one though because I really like it.",
        "Pros: As expected of Japan, it wins on the design front. Good aesthetics, it pours well, and it seems to be made out of thick(ish) glass. Large area to put tea into means less hassle trying to fit your bags or leaves in. Cons: It's not really a fault of the device but what is it with everyone's obsession with 700mL being the max available capacity? It's far from enough for me. I can't help but be unsatisfied with the quantity of every brew. I feel like I'm wasting ingredients. Purely a personal issue but I cannot help but shelve a star.",
        "I bought the 700ml, and 4 years later I still love this teapot. I'm about to purchase a second smaller version for use at work. I have an appreciation for glass, and this is top notch! I regularly use in the microwave. Can't go wrong. If you like tea, buy this!",
        "Lovely teapot. Easy to clean, except for the spout part, but doable. Wish it didn't stain so much, but any teapot would. Glass is always pleasant to look at (if you keep it clean) Can pour with just one hand, placing thumb on the lid. I don't really like the spout look, but wow it is practical as it doesn't spill and pours well. Also ordered a smaller 300ml for one person use as this one at time I find a bit too large, since I like to drink a lot of tea but brew small amounts of fresh tea each time. Like Hario brand so far and use three different teapots so far, one at work.",
        "Best screen ever. Fine mesh, super high quality. Pours like a dream. Steeps in the huge infuser like tea should, free in the water. All round the best tea pot I have ever owned. A little small, but with a good electric kettle making a second pot is a matter of 3 minutes. Leave it to the Japanese to do a teapot right.",
        "Got my little teapot today! Very excited as I broke my old glass teapot and had been using a Pyrex measuring cup. It’s surprisingly hard to find small glass teapots like this one. I got the 10oz. size and it’s perfect for one cup brews. The design is attractive. The glass seems to be good quality and thickness...the lid in particular is nicely substantial. The teapot itself says Made in Japan, but the strainer is stamped Made in China. I brewed without the strainer and just let the leaves settle to the bottom before pouring...worked pretty well. My guess is that this type of strainer gets clogged easily and could be hard to clean.",
        "I used to have a hard time using my cup and a filter to do double or triple infusions of high quality oolong tea. Now I finally have an easier time, since this tiny teapot allows me to promptly infuse my tea multiple times. It is easy to use because it has a big filter that allows the tea leaves to expand. I love it!",
        "Okay so the good- it has a good enough size, the shape is really perfect for brewing a flavorful cup of tea. The mesh is really effective in letting the leaves roam around in the water and then keeping them from running loose in the water when you pour the tea. However, it is really delicate and sort of cheap feeling, like dollar store stuff. The beak broke off my first one and I never saw or heard it happen, thankfully I didn't drink the tiny piece of glass at the bottom of my tea!",
        "A lovely design! I am a regular tea drinker and try as many varieties as possible. So, I have the 700ml, also the 450ml, and this 300ml is the cutest! The 700ml is good for larger cups or if sharing tea with a friend, did not try the 450ml yet, the 300ml is perfect for a quick small cup. I agree that the strainer gets stained eventually, still need to try the vinegar or lemon cleaning to rid of tea \"rust.\"",
        "The manufacturer of this tea pot decided to put an incredibly difficult to remove sticker on the bottom. It does not remove cleanly even if you pull very carefully, and it does not come off in the washing machine. The tea pot is currently sitting upside down on my counter with a mixture of baking soda and olive oil soaking the sticker. We'll see if it scrubs off after that. I just want to use the tea pot I bought... WAY too much work. Hario, stop putting this stupid sticker on the glass.",
        "This is a great little teapot that is attractive and really well designed for pouring (it's quite difficult to spill from the spout!). I really love it. It holds enough water for two regular-size cups of tea. The only issue I've had is that loose tea leaves will get between the metal mesh and the metal ring at the top of the strainer and they're impossible to get out.",
        "Arrived quickly, well packaged, in perfect condition. Works exactly as expected. I do not put it on the burner. I use a kettle and add the water to the teapot for steeping. The strainer basket is fine enough to provide a nice, clean tea. It's beautiful to see the tea liquor in the glass.",
        "Wirecutter recommended this teapot and I have been so happy with it. It brews wonderfully and I've just really enjoyed the look, the feel and the quality of tea I'm getting out of it. I did rate it four out of five for durability because it is glass and the handle could probably be a teeny bit thicker, but it is a nice handle and as I mentioned it does feel nice when you handle it.",
        "I got this and was happy until less than a month the glass cracked and I can't use it. I did not put it in dishwasher, on stove or microwave. Not happy with this purchase at all and went with another brand.",
        "Love this little pot . basket is big so leaves can expand and you get a true flavor of tea.,plus it is very actractive when adding bud tea flowers.",
        "My dad wanted a single-serving teapot, so I got him this one for Christmas. He said he loves this one, as it's the perfect size, easy to clean (the glass won't stain, either), works well, and is nice looking. He's just afraid of dropping it (his own clumsiness, not a fault with the pot itself)",
        "Very convenient, simple and great volume - just exactly for 2 cups. I recommend it over any other tea pot.",
        "I really wanted to like it but I honestly barely use it. It's just so small. When people in the comments say two tea cups, they mean 2 very very tiny tea cups. Other than that I have no issue. It hasn't broke or anything but I've never really used it more than enough to find out. I just went back to using my Contigo container.",
        "I like this tea pot for its elegant design. It is perfect for one or two people's amount. Pros: made from glass, so no need to worry about any health problem that can occur on plastic ones. elegant design. Cons: The flitter is somewhat too soft to keep its shape. (One interesting phenomenon is that the filter is made in china, while the body is from Japan.) It doesn't matter too much, though.",
        "Pros: Dishwasher safe Basket can easily be removed without burning fingers because metal doesn't get very hot (not sure how) Wide basket for more flavorful tea Glass and stainless (no plastic) No moving parts to break Artistic and craftsmanship Cheap Great for 1-2 people per brew A sincere and funny note inside written in broken English that was amusing to read Cons: If brewing for more than 3 people daily, I would prefer a larger pot If you want it to take abuse like plastic can look else where - but if you are used to handling glass with average care, then you can expect this to last.",
        "A really beautiful and well-made tea pot. The strainer doesn't really detract from the look of the thing, but the fact that you can remove it once your tea's done steeping and replace the lid to keep the heat in is a great feature. I had a bit of a difficult time finding a pretty, smartly constructed pot-- so happy I stumbled across this one! I actually accidentally ordered 2 instead of 1, but the quality was so fantastic that I felt pleased rather than sheepish. :)",
        "It's a very nice teapot. Features Hario's widely praised borosilicate glass. No frills, just put the tea in the basket and brew accordingly. You can use blooming tea flowers in this without the basket, or use tea bags. This pot appeals to me because of its transparent, minimal ascetic. I only give it four stars because it is not especially well insulated, but I drink my tea right away, so for me this is not an issue. You can spend lots of cash on pots which won't yield any better flavor. Buy this pot and spend the money on quality loose leaf teas and a thermometer for your water.",
        "All glass mostly made in japan tea pot. The stainless tea basket is made in China. Seems like Hario now only makes glass parts in Japan. Kind of a bummer. Tea cup is really nice though. Basket goes deep but not all the way to the bottom. I can make 350ml of tea at a time about enough for one person.",
        "Great tea pot for your loose leaf tea's. It's used daily at work and the mesh infuser is very fine so it won't let any leaves slip through while also being quite large so it let's leaves fully expand unhindered over multiple infusions. Only one minor gripe is that due to the style of construction of the mesh infuser some tea leaves may get stuck between the steel lip and the mesh which is difficult to clean out. Beyond that clean up is extremely easy and quick.",
        "Similar to other reviews I have found this pot to be of high quality. I am considering giving these away as gifts. The pot is large enough for 1 large mug or a couple small tea cups of tea. The tea has sufficient room to move and the design of the tea pot (when the lid is on) limits the amount of leaves that get into your cup. The handle can be rather slippery and cause my hands to move higher on the handle and thus get slightly burned from the hot container, but with some maneuvering (or a cloth/glove) this can be minimized. All in all a nice militaristic design that has served me well the last few months.",
        "I have had this for years now. I wanted a clear pot for when I made blooming teas, but now it's seen more regular use than the other tea pot I bought for that exact purpose! I might just prefer the clear design, but it's also the perfect size. This tea pot has been used to serve 3-4 people and we all get a good few cups of tea (shot glass size cups not mug size). It's beautiful and great for hosting/sharing.",
        "I simply love this tea pot. The design is simple and it looks beautiful. Holds about 3 US Cups of water, which will make about 4 servings of tea. Basics: What comes in the box is three pieces... Glass pot, glass lid, metal infuser. The lid works with and without the infuser, simply pour in hot water from your kettle. Pros Looks good It doesn't drip! I really can't stress how cool this is, when you tilt the pot back up there's no drip that runs down the side of the pot. Perfect for 1-2 people Cons The handle could be wider, but I'm really nitpicking here.",
        "Everyone kept saying this was fake because the filter was made in China, but if you go to Hario’s website, it shows where each product is manufactured. The glass is made in Japan, but the metal filter is made in China. No counterfeits here! Looking forward to making tea with this. I love the simple clean aesthetics and everything Harmony produces in general. (Their V60 for coffee brewing is top tier)",
        "I have been a tea drinker for the past 10 years or more, and I have so many teapots in my collection, yet this one is my favorite as of yet. It has a very large mesh infuser, which allows the tea leaves to expand (important in the extraction of the tea leaves), and the teapot itself is so adorable. It does not spill like other teapots, and it allows you to look at the distinctive colors of the tea you are using. For me, this is more like a 22 oz teapot, so perfect for one person. Hope this teapot holds well over time! Highly recommended!",
        "This is my second purchase of a Hario Chacha Kyusu Maru Tea Pot. My first is smaller. I use both of them every day, because I like using loose tea and allowing it to steep for an extended time. I like the feel of it in my hand. It is dainty and elegant. The strainer has a small mesh, so none of the loose tea leaves move through to the tea. With the lid on, you can pour the tea without leaves escaping from the strainer. I really like this teapot and recommend it highly.",
        "I got this teapot for the brewing basket and it doesn't disappoint. However, I was expecting it to be larger. The lid gets hot, so you need to put on a mitten or something when pouring it. Finally, I like that it's light, but in exchange, it seems pretty fragile. I have not tested it in the dishwasher, so I don't know how well it holds up. Thankfully, it's rather inexpensive, so I'm not too worried about any accidents.",
        "This tea pot is absolutely wonderful! It is beautiful and infuses and steeps tea perfectly. I do not like tea a lot (big coffee drinker) and decided to begin drinking more tea since it has many health benefits. I'd found that the ritual of brewing tea, using loose tea and an infuser brought a new experience to drinking tea and decided to buy a pot for this purpose instead of using ordinary pots. It was definitely worth it and the tea has a very good taste. Very pleased with the product.",
        "This is a great pot for two cups of tea. The filter is nice and large to allow plenty of room to infuse, which is a major problem with other pots. Also, this filter is very fine mesh so only very fine teas like rooibos make it through. Excellent personal size tea pot.",
        "I have been looking for a simple and inexpensive teapot with a large brewing basket. I think it is important to allow tealeaves enough area to thoroughly steep without being pressed into small infusers and balls. The basket is so large I can stir the leaves. It is easy to clean, and pretty sturdy for seemingly delicate glass. Highly recommended.",
        "I add water and microwave (without the mesh holder) the water until it boils. Then add the tea leaves to the mesh, insert and let it steep until ready. So simple. Quick and easy to clean by hand. Very cute. Very useful. It makes about one and a half cups of tea if you fill it so it won't spill when you add tea leaves in the mesh.",
        "Be aware that the teapot is only large enough to hold 3 8oz cups of tea or two average size mugs .. Having said that I've been pleased with performance and look of the product and use It regularly .. I have even forgotten a tea bag with small amounts of tea until it got moldy .. yet clean up was a cinch .. Sometimes I simmer on a gas stove at low setting for up to 30 minutes.. No problem so far.. Survived several dishwasher runs and come out sparkling..",
        "I bought it as a replacement since the handle broke off. I've been using this tea pot for years and this is my second one. I love how big the handle is (it's easy to grip), I love the shape of the spout (it's easy to pour and it doesn't spill any), I love that it's easy to wash as well (I don't think it's dishwasher safe but I handwash it anyway). If you love making tea from loose tea or fresh herbs, I highly recommend it!!",
        "This teapot is very handy for making small amounts of tea on a daily basis. It is very easy to clean and store. However, it is a bit thin and delicate. I broke my first one, but I liked it so much I immediately ordered another one.",
        "It looks so small. You might feel a twinge of distrust followed by an urge to get back on Amazon and look at the bigger version. Relax. Trust the teapot. It makes just the right amount for one person to get through while it's still at drinking temperature.",
        "Very well made glass tea pot. The mesh steeper is excellent and filters even loose rooibos tea. It’s Japanese. Good quality",
        "Well, I just starting drinking tea after I retired in August 2015. I was using tea bags. Then I remembered my English grandmother used to brew loose leaf tea back in the day so I thought, \"why not try\". I am so glad I did. It is far better than tea bags and you can adjust the strength of the tea. This glass pot with the strainer is perfect. It is very cute and it serves its purpose well. I would say, thank goodness I didn't need the instructions as they were not in English!!!",
        "Absolutely LOVE this little teapot. I make LOTS of herbal teas and this is PERFECT to steep herbs in. The only drawback (I ordered 3) is that Amazon absolutely sucked at padding this well so one came shattered in million pieces. I got a very quick refund (thank you amazon) and promptly ordered a replacement. My daughter loves her also. Great product. As with any glass cookware, be careful putting hot liquid into a cold teapot or cold liquid into the pot when it's just had hot liquid in it - any glass will shatter when you do that!",
        "This is a lovely little teapot. I own a few Hario items and it's my go-to brand whenever I need tea or coffee-related gear, especially glassware. The glass is thin and lightweight but strong. The spout is sculpted to a point so that the pour is very precise. I once took a tea serving class in Taiwan and the lesson learned was to try to pour as elegantly and quietly as possible, so splashing, no sloshing. This pot is the perfect device to allow you to do that. The wide basket holds a good amount of tea and gives them room to breathe and expand.",
        "I bought this little teapot almost three years ago and it has become my all-time favorite kitchen item. I use it every day to make tea at work all day long. There's no drip when pouring tea into a cup. A quick rinse at the end of the day cleans the pot. Over time, the stainless strainer gradually becomes, err, stained, but it's easy to restore by soaking in a vinegar solution (once/year). I purchased the 450ml size and if I were buying it again would opt for the larger capacity.",
        "I have a nice Japanese-made ceramic tea pot which I received as a gift, and I love it, but I didn't want to take it to my office. So I picked this one up, and I'm glad I did! It's no-frills, affordable, and makes just enough tea for me. The design is simple, and easy to use/maintain. I highly recommend this to anyone who's looking for a good quality, basic tea pot.",
        "Very cute teapot, it seems very delicate because the glass is very thin, but so far it's held up, I've used it every day since purchase. I was looking for a clear glass teapot so I could monitor the color as the tea steeps, so this was a good find.",
        "300ml is perfect for steeping one cup of tea for me. I can resteeps easily too. Awesome to see tea brew in real-time. Kinda scared of mishandling it. The mesh is kinda hard to clean, but overall a nice product. Made in Japan!",
        "I would have given this 5 stars but the handle on this makes it very hard to hold when the glass is hot, sort of awkward and it slips out of the hands easily. I would suggest designing the handle with a high temp elastomer to survive the heat and give some more grip to the handle. Other than that the steel filter is very nice and the glass looks very nice and clean.",
        "This is a perfect thing. I have had it for more than a year now, and use it at least several times a week. I have many tea brewing devices, since I grow and process tea and I'm frequently evaluating my results. there is no question that this is my very favorite method of brewing tea. the fact that it is clear, that it has a huge basket, and that I can easily pour from the pot into cups with the basket remaining in place, make this teapot perfectly suited for its purpose.",
        "I love this little tea pot, very food quality and sturdy. The only thing I don’t like, is that I thought it was for two cups. It’s good only for one cup.",
        "This is such a good product. Gives you about 3 standard mug size coffee cups or two good size mugs. Had a friend over and we had leftover tea. Only reason I do't give 5 stars is because it does leave a small amount of tea leaves that sink to the bottom but I don't see this as a deal breaker. It's such an insignificant amount it really does not matter. Hope this helps.",
        "We have been having a cup of tea every afternoon and I wanted to brew 2 cups of loose tea at a time. This is perfect. Just fill with filtered water to just below the brim, microwave to desired temp, put 2 rounded teaspoons of loose tea in the strainer and add to pot. Steep to desired strength. The glass does seem thin, but is about the same as my Mr. Coffee carafe. It's glass and you just have to treat it as such. Very pleased with the pot and the strainer. BTW, both go in the dishwasher just fine.",
        "I love this little pot. It holds 16 oz. perfectly, so I can run two 8 oz rounds of water through the Keurig, pour it over the tea in the strainer, pop on the lid and let it steep 3-4 minutes depending on the tea. It's also great for making iced tea because it pours so nicely, I can easily pour strongly-brewed tea over ice in a narrow-throated pitcher. The glass is delicate, so I'll need to be careful with it.",
        "This teapot was exactly what I expected. However, heed other reviewers, it is fragile. Mine is in good shape, but I am just waiting for it to break. The glass feels thin and like you have to be very careful. I wouldn't recommend this for children or seniors with reduced dexterity, it could be dangerous.",
        "I love this little tea pot! Its great I put it right inside the microwave and the handle doesnt get hot! Perfect for tea just for one! (The small one ,11oz )",
        "This is a great little teapot. Easy to get the perfect brew. Took off one star because these are extremely fragile. Even a slight bump against a cup or boiling pot and it will crack. Writing this review 4 months after I cracked my first one. It still worked for 4 months cracked until the split got too long. Even with the shortcoming, I can't find a better teapot. Reordering now.",
        "I just returned from Sri Lanka where I hiked through tea plantations. We were told that REAL tea drinkers use loose leaf tea. NO TEABAGS. So I returned home and bought TWO of these teapots for my two houses. They are clear, clean and just right for our two cups of loose leaf tea - with some left over for a last cup (we use glass tea cups). BIG basket for optimum tea exposure to water. I have been using them for about a month, on granite countertop, with no breakage. And you can see the beautiful color of the tea.",
        "I love this teapot. It is very adorable and came in one piece! (Always worried when buying glass products). But I thought it would be a little larger which is my mistake. I love flowering tea but some of the blooms I have are too tall for this shorter pot. I am giving 4 stars instead of 5 because the glass seems very thin. I have used it twice now and both times I have been very gentle with it because I'm worried of breaking it.",
        "Super cute and beautifully made. Glass is not heavy where you feel you may drop it, and its not light that it feels cheap. Perfect feel. A little smaller than I judge, but its 700ml (makes 3 cups), and much easier to handle because of size.They definitely knew what they doing when they designed this tea pot. It makes your tea experience a little more prestige. I feel so sophisticated pouring into my mug. Love it, and also got for gifts.",
        "The simple design makes it very easy to use and clean. The glass body/spout is formed in a way that prevents dripping at the end of a pour. For caffeine addicts that love the jitters, the large infuser allows you to brew multiple pots from the same batch of leaves. It's indeed delicate so handle and wash with care.",
        "I love this thing. Makes the perfect amount of tea. Looks great. Everyone who sees it loves it. Lets me use my super tasty loose tea. What's not to love? Maybe the directions, since I don't speak japanese. But, it's a teapot - who really needs directions; I assume it's not dishwasher safe, so I just wash it by hand. I like that it's clear so I can see when my tea is ready the way I like it. Also, the price is much better than anything similar I could find locally.",
        "I bought this so I can finally brew some loose leaf tea and I was not disappointed. I wanted those fancy ones with the automatic draining of tea after steeping but I don't want to clean too many things.",
        "I like the tea pot, however the made in China logo on the stainless strainer ruined the made in Japan expectation.",
        "I was very frustrated waiting for such a long time but when it finally arrived i was happy about it. it's beautiful and easy to clean. and actually made from glass not like most plastic junk in the department stores. love it",
        "i thought this would be a nice little treat as a couple that drinks tea every night. the pot feels very fragile but can probably handle a little more abuse than what i choose to give it. i don't know the long term negatives yet since i've only had it for for a few months but so far i'm very satisfied. other reviewers complained that tea leaves still sit in the water if the pot is half full but i personally don't mind that. i do wish i got a bigger one but i didn't see if this company made them or not.",
        "This is a great teapot, and unless your using it for a fine black tea (like CTC style) or you need to keep it hot for a long time, then this is the perfect size and easy to clean and pour. I would recommend it for all loose-leaf teas except the finest types of cut tea, since those tend to go through the strainer.",
        "Good for tea for two, microwavability is very convenient. But just for myself, I've gone back to a coffee mug and tea ball. It's just as hard to clean the mesh insert as a tea ball, so the pot's sitting in my cupboard now.",
        "Well made. I am using the 300 ml size, without the strainer, as a syrup warmer. I keep it in the refrigerator, about half full. Use the microwave to heat it up. The top opening is about 3\" so it is easy to wash.",
        "I had purchased this on a whim when I was starting to explore some different teas. I had a few inexpensive, store-bought teapots, and didn't think I needed another. But this one was inexpensive and came with a great reputation. Boy, am I glad I got it. Everything about the teapot is top-notch. The glass pot is beautiful and sturdy, the basket is well-made and strains the tea beautifully, and it looks great when serving a delicate oolong or green tea.",
        "This is a perfectly designed little tea pot. Easy to use, easy to clean (can go in top rack of dishwasher), the handle and the knob on the lid always stay cool, easy to pour without spills, and lovely to see the color of the tea. Very common to see this teapot in use in Japan too - I encountered it in the housewares section of a couple large department stores in Osaka.",
        "This is my second one of these teapots after I broke the first one due to rough handling. They aren't super fragile though, I just slammed it down on another dish after I washed it. I love the wide tea strainer which makes it easy to add and remove tea, plus the teapot is nice looking and comfortable to pour. I also bought one for my parents.",
        "I LOVE this teapot - everything about it. For glass, it seems very durable, however I like that it has a small spout because I tend to be clumsy and I feel a long elegant one would be at hazard of breaking. The built in strainer works perfectly, even for the finer loose leaf teas, and the handle does not transfer heat. This is a breeze to rinse out / wash. I typically make anywhere from 12 - 16 oz of tea in this at a time. This is a great value for the price and I've already recommended it to several family members / friends!",
        "Love this tea pot! Waisted a lot of money on pretty ones, they all made a mess when pouring tea. The mesh is big enough for big loose leaf teas. Get the bigger size, it's perfect.",
        "My husband somehow lost the basket so I'm getting a new one. I totally LOVE this teapot. i still have the first pot, but without the basket, it's not terribly useful. Not only is this teapot a great little brewing pot, it's easy to clean and very pretty. The 700 ML one make two big mugs of tea, or probably four regular cups. Wonderful little teapot!",
        "at first was concerned , very thin glass. now its my favorite. thin but strong glass. if you do one cup at a time this is perfect. large enough screen for the tea , even 2 teaspoon teas. love it. will order another just in case i drop it.",
        "I only gave it four stars because it's tiny! And it's kind expensive compared with other similar teapots. But it's made in Japan, a real plus for me, and it does it's job very well, especially for loose tea, which my husband drinks a lot of. But he'd like it if it held four cups of tea, not just two. He drinks cold tea all day long, but prefers to brew a big batch in the a.m., but can't do that with this little pot because it's too small.",
        "The teapots are great for brewing loose leaf tea. They pour beautifully, not a drop on the table. They are also very easy to clean. I purchased several different sizes. I drink several cups of tea a day and love them!",
        "This is a nice little tea pot. I ordered the blue color but received the clear (thus removing a star). However it didn't matter enough to me to do a return. It's a great size for one person. It looks very delicate but I have banged it around a few times in the sink and it seems quite durable. I like the cute shape as well. Would make a very nice gift.",
        "I've had this teapot now for about two years. The thing I love most is that there is no plastic, only stainless steel and glass. It's pretty amazing how no loose leaves escape the teapot when pouring a cup of tea. I use this teapot every day and it has never failed me. Great quality for the price.",
        "super cute! also bought the hario teacup, when i received the teacup, i know why is more expensive than the another brand,, the quality of the glass, very lightweight and clear. i know to drink tea everyday"
    ]
}