{
    "entity": "Mallets",
    "text": [
        "This is a very unique rubber mallet. The shape and weight balance are totally different from your standard 1lb rubber mallet. This hammer puts more force over a smaller area and fits into tighter spots. I like the dual head with black for I don't care what this thing looks like and white for I care what this looks like. It has a real nice balanced feel. I mean bottom line it is a rubber mallet so you can only get so excited about it.",
        "The first time I needed to use the mallet the rubber head popped off. I flipped it over to use the other side and it popped off. I could not get the heads back on. Extremely disappointed. The look and weight if the mallet is great, but durability just isn't there. I wish I had done a project that fell in the month return time period so I could have identified this flaw. Ultimately I am out my money.",
        "If you are working in hardwood flooring these are really great. I do not do flooring but my husband does. These are the only mallets he and his crew use! They do new build homes and say these are the best. For some reason they stopped selling them in the stores here and what they replaced them with were (I'm quoting him here) \"crap\" compared to the Vaughan mallets. Since they do hardwood everyday they go through a lot of them and always reorder these.",
        "I am seriously impressed with the quality of this mallet. It is VERY well made, solid and has a good weight unlike the typical solid rubber mallets. I cannot attest to the durability but by inspection it appears that it will last a very long time. The center head is cast steel or iron giving it a substantial weight. The two rubber heads appear to be slipped over the metal, not screwed on, so should be very secure. The rubber heads are also have good sized faces for serious work. AND IT IS MADE IN THE USA which is a big plus for me.",
        "I have bought three rubber mallets in my life. The first two were under $5, and I thought I was doing well, until the 3rd or fourth time when the rubber head broke off or the wood splintered. This rubber mallet is worth the money, and is everything a rubber mallet should be. Wish I hadn't wasted my time with the el-cheapo mallets! I expect this is the last rubber mallet I'll ever buy, unless a friend borrows it and realizes how good it is!",
        "I own 6 Vaughn hammers. In my opinion they are the best. This guy is no exception. Whether it’s for a tile job, hardwood floor or a stubborn brake drum, it’ll do the job. Beautifully balanced, perfect weight and easily replaceable heads. Arrow straight white hickory shaft. Made in the USA 🇺🇸. Vaughn: simply the best. Highly recommend. Thanks for reading",
        "Great mallet! Thought I'd get a nicer rubber mallet this time. My last one only last about 30 years. I like the balance and feel of this mallet and the use of two materials in one head. I've used it on block, brick, tile and everything else that needs a little nudge to get it set just right. I would recommend to anyone.",
        "This hammer is exactly the right weight for the occasional DIY-er. The soft and hard heads make it a handy tool in the tool box. I use it to pound metal rods into the ground for a plastic fence around my swimming pool equipment. The white rubber mallet does not leave marks on the rounded tops of the metal stakes that support the fence sections. Definitely 'professional' grade.",
        "Love this mallet. Be sure to use the white side to avoid black marks when necessary",
        "This is soooooo sturdy. It just feels very strong and well built. You can tell that this mallet isn't going to break. I purchased this entirely because of the review from a construction company.",
        "I use this mallet for having hardwood flooring and for installing vinyl plank with a dropping lock mechanism. This mallet is sturdy and hefty in a good way. The no-mar white side makes to easy to get boards in place quickly without damaging them. The handle and mallet head appear and feel well made.",
        "Recently purchased the mallet and used it to assemble some furniture. It is a good weight, not too heavy nor too light. Very happy with my purchase.",
        "I have put this thing through a great deal of abuse and it has not shown any signs of failing. It delivers very controlled application of \"gentle\" but massive force in an almost fool proof manner. The rubber holds up very well, doesn't mark. The weight of the tool is about right. I can't think of any flaw that I would assign to it.",
        "Great construction and material, not heavy enough for heavy duty floor nailer. Hardwoods need the heavier mallet.",
        "Great craftsmanship and quality. Started with a Vaughn claw hammer and have increased to a full set of hammers. Might be a bit more expensive than an import but when you hold a good tool in your hand you know it. This fits that bill!",
        "Great Product made in the USA. Recommend to anyone wanting a quality Mallet.",
        "Okay this is made in the USA as should be this is big boy Very handy around the home or for whatever",
        "I love these hammers. Id buy 4 at a time but i only have 2 hands. I use them for installing laminate, and hardwood floors, but comes in handy for other things.",
        "Great rubber mallet. The white side works great on delicate surfaces.",
        "Excellent tool. Well weighted. Efficient reaction. No marks left behind. USA made. What's not to like about this tool?",
        "Bought this for my husband. He says it is a good quality mallet.",
        "Made in USA! Perfect weight and made laying down over 1100 sq ft of flooring a DREAM!",
        "One of the best all around tools. Well constructed. Handles all types of pounding needs. Highly recommended!",
        "Great rubber mallet. Very durable, and non-marking side really doesn't mark. Ideal whether you're assembling furniture or tuning a Djembe.",
        "Love it! Used for installing wood floor. Sturdy and balanced well!",
        "Very well made. Just what I was looking for. Good balance and weight.",
        "love this and love that no one else at work has it",
        "Made Correctly, this hammer...The Product is well-balanced has a good feel. Beautiful hickory handle. These guys put out a good driver. Thanks.",
        "This mallet is amazing, but better than the Chinese made crap I bought & returned. American Made tools can't be beat.",
        "Every household needs a rubber hammer and this one is awesome",
        "Great Mallet, I have projects after project after project and this is holding up well.",
        "Well made,good weight,and made in USA.I am going to buy more from this manufacture.Fonzie",
        "this the tool to have for me. wonderful mallet. I would not be happy with any other. They last for years",
        "I wanted, but didn't see a twin head rubber mallet with forged steel head with a fiberglass or solid steel handle. I've had wooden handle mallets break and hollow steel handle mallets collapse, in the past. We'll see if this one holds up to standard use."
    ]
}