{
    "entity": "Mallets",
    "text": [
        "So far I can say that the cut lines and smoothing is very well done. I do not regret this purchase. The mallet appears to be sturdy, balanced, functional and well crafted. You will have to finish this mallet yourself with a good tung oil or polyurethane, etc. Honestly, it's better that way so you can apply the finish or stain that you desire. I like natural finish that I can reapply once a year, you may not.",
        "This is a very nice wooden mallet. Just the right size, just the right weight and it is well made. Basically, it is a stick which makes it seem strange to write a review, but if you don't have this mallet, you're going to search around to find something else to use, which won't work as well, so just buy the mallet and keep it on hand when you need it. I've used mine a dozen times already just in a couple of months.",
        "Wood is too soft to be very durable, every strike leaves a fairly deep impression. I will not get much use out of it before it is junked. Its ok if you have expensive tools that you dont want damaged by a metal hammer but i would not buy again.",
        "Until you pair this wooden mallet up with a good set of chisels, you don't know how important and helpful it can be to woodworking and cutting notches or mortises. Sure, you can use your steel head hammer, but it hits too hard and can cause a chisel to gouge the work. But this wooden mallet is superb and adds just enough heft and measured impact to allow you to make your cuts and notches more carefully. It essentially teaches you to be more patient and improves your work. Five Stars!!",
        "It’s a wooden mallet. It will serve its purpose. However, for the price, I am underwhelmed. My example does not say “Made in England” like the Amazon pic, leading me to assume mine was made in a third world country. The fit and finish supports this theory. It arrived with a big chip off a corner face. Or perhaps it was damaged en route in the plastic bag the seller felt was adequate for shipment. I felt the need to spend 45 minutes sanding the tool because it was so rough. I wish I had selected one of the (much) cheaper options available on Amazon, and put the same amount of finish work into it. Disappointed to say the least...",
        "As soon as I pulled it out of the package I found that the handle was never totally finished and had areas that needed to be sanded and smoothed. I would have thought that would have been better considering these guys build mallets all the time. Other than that, it is a good working wood mallet.",
        "It is almost too pretty to use! I put two coats of boiled linseed oil on to protect it. I find myself reaching for it for more than just chisel work. Great for tapping timer for adjusting alignment,too.",
        "Solid build, the weight is really nice. Overall it's a good deal. It came unfinished and needed a bit of sanding on the handle, but 10 minutes of work got it tuned up nicely.",
        "Simple, functional, and well made. Bought it to make hand-crushed ice for cocktails. A mint julep never had it so good.",
        "I don't normally write reviews but this product made me laugh. I ordered this and when it arrived there was NO handle, just the mallet head. ??? The mallet head seems pretty nice, good quality, but it is pretty useless without a handle. ???",
        "Fit and finish were lacking. Seems sturdy. Would t complain of it was a few dollars less.",
        "This product was advertised as made in England and when I opened it there was no indication where it was made and they appeared to be knock offs! I have another one which is authentic and the difference is significant.",
        "Not sure there needs to be much of a review on a mallet. You hit wooden things with it. This one is very adequate at that task.",
        "Seems like everything is being downsized. This Bora 540049 Mallet does work, but it is disappointing. the face of the mallet is narrow as is the handle, and it doesn't have much weight. The handle doesn't feel good in use, as it is barely rounded edges.",
        "Heavy with is good, I don't have to swing as hard as I was with the rubber mallet I was using. Well build, should last a long time.",
        "This is a great little mallet. I bought it for my chisels and joinery. It's a little on the light side, but works well.",
        "I've used it for breaking clumps of ice and woodworking. Good quality and works well.",
        "Finished mine with butcher block oil. Works well and looks good.",
        "Never had one of these before. I know now now that I have always needed one.",
        "Perfect weight, fits perfectly in hand when used for chiseling",
        "Perfect size and heft. I found it very useful during assembly and for pounding in dowels.",
        "Now this mallet is awesome. First one I ever used but it is a pleasure to use. Good balanced weight and easy to use. I bought along with some mortising chisels. Never used either before but I have been now successful in hand forming mortises and tenons. love it",
        "Love this mallet. It makes easy work of mortising and general chisel operations. I'm going to buy a second one to convert into a dead-blow hammer.",
        "I started using this right away on the turning bench I designed and built. Great tool for a true woodworker.",
        "WOW, quality wood hammer. Makes you feel like Norse god THOR the minute you grab it.",
        "Ok so I just got this shipped to me. My first thoughts were the mallet felt good in the hand. It seems well crafted and after giving it a try found it works awesome at what it was built for"
    ]
}