{
    "entity": "Coffee Machines",
    "text": [
        "So far so good! Love it!! I noticed a lot of bad reviews stating the lid doesn't close right. There is a snap that keeps it shut that I didn't realize at first. If you use the snap, it's perfect.",
        "This is soooo much nicer (and several times cheaper) than a kurig. Brews enough for 2 real sized cups of coffee or tea and does it quickly. I program it to wake up just before I do in the morning. By the afternoon, if I didn't have the a second cup I usually just brew a fresh pot cause it takes almost no time at all. Keep warm function is only an hour to prevent scorching. This is perfect for one or 2 people, more than that need a bigger pot.",
        "Ordered this April 23, 2018, and started using it daily. I'd ordered it b/c I briefly had a gig that required waking up very early, and I wanted to have a coffee maker with the timer option, as well as the pause and sip. I kept my old Black & Decker though! And I'm glad I did because this Mr. Coffee stopped working the first week of August 2019. It hasn't ever been packed up & moved or otherwise jostled around either. Also now that I'm back to using my old model, which I'm really glad I stored in the basement, I'm like, \"Wow! The coffee is so much hotter!\" which of course equals better. Would not repurchase.",
        "Works fantastic. I brought it into my office. It makes just enough coffee to fill up my huge coffee mug. When coffee sits in the pot too long it doesn't taste as good as a freshly made cup so I love the size of it. I also have a Keurig - but I need to use at least 2 K-cups in order to fill up my mug so this is much more convenient and also a lot cheaper. Also it automatically turns off after a certain amount of time so you don't have to worry about forgetting and having burned coffee. I use it every day and love it!",
        "I have many variations of the Mr. Coffee 4-cup for years. They last a long time and when they fail I just order another. However, with this last machine I found that the decanter drips when you pour from a full pot. I sent the first unit back thinking that it was just an anomaly. The second unit does the same. Mr. Coffee suggests that you pour SLOWLY. Tried that! No joy! I had several old decanters so I used one of them and NO DRIP. There has to be a design or manufacturing flaw there.",
        "Reasonable price, easy to fill and serve but does not keep coffee hot. By the time I drink the first cup, coffee in pot isn't really hot any more. Surely Mr. Coffee can do better than this. Really had high hopes for this and getting rid of the ridiculously large Krups machine freed up much-needed counter space but I don't like lukewarm coffee.",
        "I ordered this with something else in mine. It was very small.. but I went with it. I never put the pot in the sink with other dishes, I always left on counter. My coffee pot gets extra TLC... because it makes me my coffee!! Lol The one day I went to clean the pot and ended up slicing my hand opened on a chipped part of the pot. I have NO idea how this pot chipped. But my hand was cut pretty good. I ended up tossing the entire unit and buying another.",
        "I love everything about it EXCEPT it is SO LOUD! It makes this weird ticking noise while brewing that’s loud enough to wake up the entire house. As someone with kids who works from home, I wake up early to get an hour of work done before the house wakes up. I have to wait to make my coffee until everyone is awake. I’ve had it for almost 2 years now. The noise was less at first. It has gotten louder, especially in the last year. I’m about to buy a new coffeemaker solely for that reason. Pro: coffee Con: the machine will wake you (and everyone else) way before the coffee can",
        "Should be called 2 1/2 cups because that all it makes, and I keep having a problem with grinds getting in the coffee. As another reviewer stated the \"4-Cup\" refers to coffee cups, not 4 measuring cups. Also another problem is that it turns off way too soon, if you take your time drinking coffee, than when you go to get another cup it will only be lukewarm because the machine has turned off.",
        "This is 5 star coffee pot for its price BUT the only feature it doesn’t have is that it will start at alarmed time even if the pot is not under the dispenser. Alarm went off, coffee started and water was so hot it ruined the clock and base. Bought another one though! Totally my fault but as a precautionary, I feel this feature is a bit necessary for safety reasons or I shouldn’t be making coffee late at night while doing dishes",
        "Fantastic little coffee maker. The Kurig finally hit the dust and I'm glad it did. We always make 2 cups in the morning anyway so when I timed how long it takes to make this one it's right at the same time. It doesn't fill as fast but we can walk away while it brews. The main thing is how much I'm saving on cost. After doing the math a cup of coffee using folders costs me 8 cents per cup using this vs 40 to 50 cents using the kurig, and that doesn't even take into account the massive cost of the Kurig. Love this thing and would definitely buy again.",
        "This is a gift for our daughter. She said her coffeemaker went on the fritz and stopped working. So she hasn't seen it but I'm sure she will be happy with it. I had one for years and it never went bad and I know the quality of this little coffeemaker. The taste, ease of brewing, swiftness/coffee done extremely quick, small but powerful. Amazons priced this product perfectly and I can't stress enough how great it is and thinking of gift ideas---this is the one that keeps giving back. Also funny to say this but great conversation piece. Highly recommend A + +",
        "hard to set delay; have only had for a couple of months; making a lot of noise when brewing, sounds like it's going to spill over; guess you get what you pay for. Nice size for brewing single cups, much more cost effective than Keurig machines. Probably will have to replace within a year!",
        "My old Mr. Coffee machine was the simple ON/OFF version but it needed replacing. The MAIN reason I bought this programmable version was for the delayed brew function. Sadly, the clock doesn't keep correct time, it's very slow therefore there's no point even trying to set up the delay. Very disappointed especially since returning it is no longer an option for me. Hopefully it makes coffee as well as my first one did at least.",
        "I really like this little coffeemaker. It's perfect for me. I like to have two cups of coffee each morning, and this is the perfect size to fill my mug twice. I often read complaints in coffeemaker reviews that people don't get the number of \"cups\" of coffee listed in the description. Everybody uses a different sized cup or mug, and the manufacture is basing it on a standardized size. Anyhow, for me, this fits the bill; attractive, compact, has the features I want such as an auto shut off and a timer for setting it the night before. And the price is right.",
        "I bought this to put in my bedroom as a substitute for an alarm clock and it's one of the best ideas I've ever had. I set it up at bedtime and at 7:06 each morning it bubbles and scents the bedroom with Starbucks coffee. I pour myself a nice hot cup and drink it in bed, and before I know it I'm ready to get up, and life doesn't get any better than that. For $20!",
        "This coffee machine is amazing. Don't be fooled by its cuteness. Pros: My coffee tastes delicious, it's easy to use, no muss no fuss and easy to clean. Cons: I only wish if the pot was a little bigger so I can share coffee with my friend. I definitely recommend this item because it's absolutely amazing and you deserve amazing especially if you lose coffee as much as I do.",
        "The pot brews exactly 2 1/2 cups of coffee if you fill it to the max. Enough for a 20 oz travel mug. I am an avid coffee drinker and in my opinion it brews an average cup of coffee and gets the job done. Don't expect your coffee to taste like your french press or percolator. I bought this because it's quick and easier for me in the morning and it doesn't take up a lot of counter space. The programmable feature is nice and it was a good price. I agree with other reviews that the display is dark and hard to read, it needs a backlight.",
        "YOU GUYS this cute little machine does everything the big one does except smaller and for my household of just two people, this is perfect! I'm terrified of the biofilm that runs through the Keurig systems, and I just can't bring myself to use one. I've got nespresso which is great but too expensive to keep buying the little pods. Buy this little coffee machine and the reusable filter and VOILA! The perfect amount of coffee with little to no waste. This thing also allows you to set a time to brew automatically when you want it to <3",
        "This is THE noisiest coffee maker I've EVER used, it continues to burble loudly after the first few minutes. The \"fast and easy\" basket may only be inserted with an exacting level of difficulty, and the cheap plastic lid is too lightweight to close tightly. I suspect this model would never last as long as the 19 year old I'm looking to replace. Cross-referenced clock instructions (see image) are FAR FROM user friendly. Mr.Coffee is riding on the brand name, not product quality. Upside = Taste is as good as other coffee makers, and the clock DOES keep its setting after brief power outages.",
        "Arrived in a timely fashion but the item appears to be a \"returned\" coffee maker. Examination of the package shows the unit to look brand new with everything intact. I'm sure the coffee maker is fine but it does not make me happy to have somebody's returned item sold to me as \"brand new\" especially when this thing was purchased by me to be used as a gift. If it was just for me I wouldn't care that much but it was purchased as a gift and the tears in the packaging and bogus tape job makes the appearance pretty poor. Not too happy with Amazon on this one!",
        "Makes pretty decent drip coffee, especially when paired with fresh ground coffee and a reusable metal coffee filter. Perfect size for single person household, makes 16-20 oz of coffee max. Most people don't seem to realize that a cup of coffee is only 6oz to coffee shops and other pros and not 8oz (cup of water) so they complain that it's not really a \"cup\".",
        "Brews a quick and easy cup of coffee and is perfect for a home that only needs a 4-cup unit. I bought this 4-cup Mr. Coffee in August 2014 and it just went out today, December 18, 2017. Three years of reliable morning coffee for a $20 coffeemaker seems more than a fair deal to me. (My previous Mr. Coffee lasted nearly 10 years, but I know that things just aren't built that way today.) The delay brew feature is handy, the auto-off is essential. It's plain and simple and inexpensive. And, the coffee it brews is fine!",
        "this is my first coffee maker. i'm 47 years old and never liked coffee but my wife's old one dies so i decided to try it just once. i filled a big cup, added turbinado sugar and some cream (using some uber coffee she had) and DAMN! It was goooooooooood! I dunno about the machine... takes about 5 minutes to brew it'd lil pot. really tasty coffee!",
        "The no-drip isn't accurate. It does drip when you try to sneak a cup while brewing. This has caused major corrosion of the heating plate. The carafe drips when pouring if you don't lift up the lid first. The programming works well, but the button are easily bumped which has caused the brewtime to be incorrect on several occasions. I would be hesitant to recommend this. I imagine there are better options out there.",
        "Have been using Keurig, but the clogging up thing had me getting frustrated--as well as the price of the K cups. And when I used my own coffee it was a mess. And never seemed to make coffee that woke me up. Mr. Coffee does make coffee that actually gives me a jolt. It actually makes coffee that has me wanting to have another cup. It's hotter than the Keurig as well. Keurig was never hot enough. This little coffee pot makes just the right amount for my huge cup in the morning. It's HOT. It's GOOD. Buying another one as a spare!",
        "This worked as you would expect, but I never had a coffee maker give out in such a short time! I only brew 1 pot a day, so it hasn’t even seen hard use. The timer function is flawless. Up until this morning, I woke up to a fresh pot of delicious coffee every day.",
        "To Open The Lid I Had To Pry It Open as The Lock Catch Was Way To Tight, I Should Have Sent It Back But I Filed The Burs Off Now It Does Not Lock So The Cover Just Sets On With a Gap because Unless It Locks The Filter Basket Spring Raises The baslet which Inturn Raises The Cover.. I Think It may Still Work OK As Long As The Water Don't Splash Out. My Varry Old Mr Coffee 4 Cup was a 100 Times Better But After Abbout 15 Years Of Use It Finally Started Leaking. Because Of The Poor Latch Design I Would Not Recommand This Coffee Maker.",
        "This is the perfect little coffee machine except for one huge quality control issue. The \"Lid\" that you open to pour the water in, warps in a very short time. Other reviewers have had the same issue. Mr. Coffee would do well to either beef up the existing lid or better yet, make it out of stainless or some other sturdy, non toxic material. I am going on my 4th pot. I use it til the lid warps and then toss. Otherwise, as stated, it does a fine job brewing, turns itself off after awhile (safety feature),",
        "Liked the product for a few months--it is great for small spaces like areas beneath cupboards--but the lid has broken and the top doesn't close properly anymore. This is problematic because it throws off too much steam that can wet surrounding appliances and the wall. So close to be being a great product at a great price, but disappointingly faulty top. You can see the gap in the photo with this review (gap on both sides, I've tried everything to make it fit properly).",
        "This is my first 4-cup coffeemaker, and it works fine; however, i will probably be getting the larger coffeemaker soon, and keeping this for trips or camping-type use. There seems to be less flavor brewed by using a 4-cupper, perhaps because the grounds do not get as much flavor out, when just \"running' 4 cups of water through them. I do notice that I need more coffee, to make a darker , richer cup of Joe.",
        "Makes a decent cup of coffee, & a great alternative to a keurig if you're the only one who drinks coffee in a household like me. This is extremely simple to use, but you might want to put in more grounds than suggested - the coffee tastes a bit weak, despite me using the same measurements I've been using for years. I purchased a permanent 4-cup basket coffee filter with this to cut down on waste. Making a cup is extremely simple & fast. The ability to take this off while its still brewing is useful, but unnecessary, because I can't imagine anyone who drinks less than 4 cups of coffee per mug.",
        "I would have preferred better tasting coffee over machine sophistication. I understand the machine is very cheap when it comes to cost but serving coffee smelling like \"plastic\" is a big NO NO. I have been using this machine for a month now but the smell just doesn't go away or fade. My advice will be to spend 10 bucks extra and get a better machine. Given that I really like its little glass coffee pot.",
        "The lid over the coffee grounds would pop up and release steam every time it was used. The coffee it produced would have a plastic taste not matter how many times I cleaned the unit. The machine stopped working after about a year of use.",
        "Needed a coffee machine that brewed 2 mugs of coffee each time. Worked fine until last week when it died. Lasted a little over 2 years. Nothing special just your basic cheap coffee maker at least when I bought for $19 from Amazon.com. The auto off feature was much appreciated.",
        "This is the third coffee pot i bought in 1 year the first one stopped working after 7 months and I purchased another one and it stopped working after 2 weeks. I returned that one and received a refund. I purchased a new one from amazon on June 7, 2018 and it stopped working on 10/06/18. I am glad I did not throw out my 12 cup. It is also a MrCoffee. Why is there a defect in the smaller ones. All the coffee makers were MrCoffee. w",
        "I’ve been researching and testing different coffee makers for a month now and I must say the ease of using this makes me love it. Simple. Small. Does the job! Will another maker make a better tasting coffee? I’m not sure. But I know this: I buy nice coffee that I grind myself and I’m really enjoying the cups that come from this machine",
        "This is a great little coffee maker that I use to brew my commuter coffee before leaving for work every day. It only takes a few minutes to brew a full, \"4-cup\" pot, which is enough to fill my (I forget the size) commuter mug. I also bought the GTF2-1 basket-style gold tone filter basket, so I don't have to bother with paper filters. I just rinse it out every day and wash it weekly and it brews great \"wake me up coffee\". If you're an aficionado, I'm not sure if this machine is for you, but it works great for the early morning eye-opener coffee.",
        "I THOUGHT A GOOD CUP OF COFFEE WAS IN THE COFFEE BEAN, NOT TRUE, A GOOD CUP OF COFFEE COMES FROM THE COFFEE MAKER. FOR FIFTY YEARS I TRIED TO FIND A CUP OF COFFEE WHICH MATCHED THE FLAVOR OF COFFEE WHEN I WAS A KID. I WENT THROUGH EVERY BRAND, GRIND AND BLEND WITHOUT SUCCESS. SO HAPPENS MY COFFEE MAKER, AT THE TIME, TOOK A DIVE SO I ORDERED A NEW ONE INFLUENCED BY THE PRICE. GOOD CHOICE, THIS WAS THE LEAST EXPENSIVE AND HAD A GOOD NAME. MY FIRST CUP WAS WONDERFUL AND EVERY CUP THEREAFTER WAS EQUALLY DELIGHTFUL. I DIDN'T WANT TO BE WITHOUT MY NEWLY FOUND COFFEE MAKER FRIEND, SO I ORDERED ANOTHER JUST FOR BACK-UP.",
        "It does the job well. Much better and less expensive than the single serve makers. The automatic feature is rare in a 4 cup coffee maker. I like to wake up to the smell of fresh coffee. I just hope it lasts a long as my Krups and Mr. Coffee larger size coffee makers have lasted. I still have the original Mr. Coffee coffee maker and it still runs as new.",
        "So far, so good. The time could be a little longer (only an hour, but I suppose for only four cups, most people probably don't need more. I also would have liked a one cup measure on the tank - sometimes I just need to make/add a little more coffee to finish off the day. Heats quickly, seems durable. Now if only I can avoid breaking the pot! :)",
        "I bought this coffee maker after my third Keurig died. I refuse to sell my soul to Keurig again, so I bought this as a replacement. I don't drink a lot of coffee, usually one (pretty large) cup a day. If I make a full pot, this coffee maker will fill my favorite coffee mug twice. I usually only make half a pot. It is a fine little coffee maker, but I do miss the convenience of my Keurig. It will probably just take me some time to getting used to this again. All that being said, I do recommend.",
        "It may not be a Keurig, but I get good coffee, plenty hot, quick and as inexpensive as it gets. It doesn't clutter my countertop space, and my last one lasted a couple of decades. Program it and get up to a great cuppa...Would give it five stars but for the size limit; however, I'm the only coffee drinker so....",
        "I bought this for the wife, and it's turned out to work very well for her since she only drinks 1-2 actual coffee cups a morning. This makes just that much (1-1.5 coffee mugs full). We had tossed on a Keurig for awhile, but she prefers to just brew and mix her own and it's a bit more environmentally friendly as well. The timer is nice, and the build quality is great. it doesn't feel \"cheap\" really at all. Very portable and small so would be a great RV or camper addition as well likely.",
        "I've owned this coffee maker for about 6 months now. It has brewed great-tasting coffee without hiccup... until today. I turned it on and... nothing. Nothing was heating up and there was no water flow. As an electronics technician by trade, I popped the bottom open and found this KSD301-G thermostat was not giving power to the heating element. The contacts were stuck open. Since this device uses mechanical as opposed to solid-state switching, I fixed it as you would fix anything mechanical: I hit it with a hammer. Problem solved. I bought a cheap coffee maker, I expected cheap components and was not disappointed. So... uh... buy with confidence?",
        "I love this thing. It's a no frills coffee maker that you can program to make you coffee in the morning. Setting the time was a little tough but once you learn how it's easy. Only cons are I wish the clock was backlit so I could read it in the dark, and the lid snaps on kinda flimsy, but it works perfectly fine! I bought the reusable coffee filter for it too and that works great. Really happy with my purchase.",
        "Great little coffee maker but yeah, it’s really really small. A full brewed pot is a little more than a regular cup of coffee. So if you’re the type of person who likes 1 cup of coffee at the most, then this is perfect for you. Otherwise I would definitely say go for one of the larger coffee makers. But again, the quality of this one is excellent. It’s just small.",
        "Although I was fully aware, when purchasing this small and relatively portable $20 coffee maker for travel purposes, that it was unlikely to be sturdy or elegant, it was literally the first time I tried to use it that it broke. The flimsy plastic containment \"notch\" which holds the cover on to the base (by snapping over a plastic post, see photo) had too tight of a fit. This rendered the unit useless without applying weight to the top of the unit, since otherwise the top of the carafe is rendered too loose to permit the unit to distribute brewed coffee into the carafe. An inexpensive lesson learned, I'll purchase a better-made product next time.",
        "No matter how many tablespoons of coffee grounds I put in for a 2 cup brew, it ALWAYS comes out weak and watery. Not sure what’s going on but I just can’t put a cup of grounds per cup of water. My old keurig would take 1 tablespoon of grounds (or however much a tiny reusable kcup took) and made a strong 16 oz cup! I’ve been experimenting with this one for probably too long that I can no longer return it so it will get tossed. It’s trash anyway.",
        "I bought this 4 cup programmable coffeemaker for my office. It works exactly as described and provides hot beverage. You can have it shut off relatively quickly - which I do - for safety reasons. It is attractive, compact and functional. What else needs to be said here. I think every household needs to have one of these. We use a Keurig for the most part - but every now and then a regular coffee maker is awesome.",
        "Good for the price. Wouldn't pay a cent more though. The pot is EXTREMELY SMALL. You can get one cup of coffee out of this, maybe two. This is meant for one person living by themselves (me) who doesn't drink much coffee. That said, it brews quickly and is hot enough. I've had coffee makers brew hotter, but at that point it you can't even drink it. Satisfied with this purchase. The Delay Brew works very well. Note that there is no beeping sound or other alert when your coffee is done brewing. This doesn't matter since the pot is so small, it brews so quickly.",
        "This is great coffee maker for a single who just drinks two cups a day. Cheaper and better tasting than Kuerig or whatever. Just buy a can of coffee and forget those stupid little pods. Easy cleanup. I use this everyday and it fits perfectly in my small RV.",
        "Easy to program and set the night before to wake up to fresh coffee when I want to. Simple Time Delay, just select the time to delay the brew for. Hit Delay. It will show delay and you are ready for the next morning. Small enough it is only about enough for 2 good size cups of coffee which works perfectly for me. Not very noisy, brews quickly.",
        "They made the clock set and brew delay function so ridiculously and stupidly counter-intuitive that it makes me hate this coffee maker. I bought it because I had previously owned a programmable Mr Coffee Coffee Maker and the settings were simple. I hate this coffee maker. I hate this coffee maker. I hate this coffee maker.",
        "I got this because my husband doesn't drink coffee with me, so I needed something small. With the coffee mugs I have, I get two cups out of a pot. That is all I drink, so I don't end up dumping any out. I bought this to replace my Kurig maker, which broke twice in less than a year. This little coffee maker has been working great. Not complicated to use at all, and the delay timer is nice so that I don't have to wait for coffee in the morning. Very happy with this.",
        "Yes it is small, one pot makes one large coffee or travel mug. That said, I'm the only coffee-drinker in my house. With this pot, there is never waste. On the rare occasion that my husband wants coffee, I can simply make another pot. Would make a good office or desktop coffee pot. I just wish the screen with the clock was lighted, a bit hard to read the time and change the timer.",
        "I like it because it's simple. to program and operate. It replaced the (same) unit I bought years ago except that one had the green LEDs. This one has an LCD display. So while the clock feature works the same, you can't really see it more than a few feet from the clock. Maybe that's why they did it?",
        "This coffeemaker works best with the smaller proper sized paper filters, but if you are careful it works with the standard size larger filters as well. It makes great coffee and it does so quickly. No dripping, no mess, no fuss. It's simple, easy to use, and it works great. It has auto shut-off and a clock with a timer so you can pre-set when you want coffee made fresh for you. When I first unboxed it I laughed at how small it is. It looks just like a large full size coffee maker, but it's around 1/3 the size.",
        "Yuck. Read the reviews and took a chance... the coffee tastes like a $20 plastic coffee maker made it. Not being a snob, but think college days, that cheap thing you had to get through all nighters- or first apartment crap- that awful taste. Basically, tastes like plastic. Apparently I don't have free returns on this one so another thing I'm taking a loss on. Lesson learned to just go with your instinct and spend the extra money. I just wanted a small single cup machine, but this one was not the one.",
        "I like it quite a lot, fast and keeps hot for short period, long enough to finish but not to stew the coffee. I was surprised by the size. Somehow I expected 4 cups to be 32 ounces but this is for a different sized cup. I think it is about a 16 oz pot. Still being small, it doesn't use a lot of counter space and it is easy to clean.",
        "Works great and the spout/lid is perfectly lined up and made to NOT SPILL. The similar (same company too) 5 cup machine I had before this spilled coffee every pour unless I held the lid up and got steam burned. This one is so much better. only thing I wish were different is the clock colors/background. Black against grey....can't see the time without a mini flashlight aimed at it...",
        "This was my second purchase of this model of Mr. Coffee 4 cup Programmable Coffee Maker. The first one I had for about a decade and it always worked but I broke the coffee pot. Since it was so old, I figured it was time for a new one anyway. But the new one only lasted 6 months before it stopped heating up and brewing. When it worked, it was a great little coffee maker.",
        "Coffee maker I bought for a friend. It's smaller than what we're used to, but it is the perfect amount for a large cup of coffee in the morning and then another bit to top off that cup. I'd recommend it if you're one person who just enjoys a couple cups of coffee in the morning. If you're brewing for more than one or two people, I'd suggest a bigger size. The programmable feature is nice but it's kind of loud. Other than that it brews some delicious strong coffee and does the job well.",
        "Just the right size for my needs. This coffee maker has brew delay, which supposed to allow you to pause so you can pour a cup while it's still brewing the remainder of the coffee - I use this a lot because it's there and I couldn't wait. I like the water windows as they allow me to see if I need to refill. The lid or cover to put the coffee in latches a little awkward - not a big fan.",
        "we've been using this coffee maker about 3 times a week. it hasn't been 6 months and it no longer works. we tried all kinds of things to get it to work. dud",
        "Bought this to replace the Kurig. My husband was really missing the good taste of coffee. He loves it. So far so good. I had to return this item because the box had been opened, but went and bought it somewhere else cheaper. This is an awesome little coffee pot.",
        "I love this little pot. It’s the perfect size for us. But it malfunctions and will turn on randomly with no water or coffee in it at all. Light turns green, the hot plate gets hot and heats up an empty pot. :/ I want to like this, but the safety concerns here are worth paying attention to.",
        "This is a nice functional little coffee maker for the money. I am the only adult in the household and don't need a big pot of coffee. This makes ABOUT two normal-sized mugs of coffee, maybe a little less. It is programmable for delay brew, has a clock, and makes decent coffee. Definitely follow the pre-cleaning instructions if you don't want your first pot of coffee to taste like plastic. I would recommend this to anyone who doesn't need a huge pot of coffee and is on a tight budget.",
        "Use every day- works great. Makes like one large travel mug worth of coffee which is exactly what I wanted. If you want to share one pot this is not big enough though. I love mine- easy to use and clean.",
        "Bought this to replace the 6 pot i dropped. Idently dropped. This one is horrible. The pot starts heating immediately when plugged in. Plug it in, hit off button, still tries to brew. Hit on then off, lights up then lights off, but still gets hot. Can't use programming, cause it brews the moment you plug it in.",
        "This is a very nice, basic 4-cup coffee maker. Has a clock, delay brew, and auto-shut-off after 1 hour. Takes about 5 minutes to brew, easy cleanup, takes the 4-cup basket filter. My preference was 3 heaping tablespoons for a 4-cup pot. Had this shipped to our vacation spot (along with the filters), bought local coffee, gave the pot away to one of the resident's in my Mother-in-Law's retirement home when we left. It was cheaper to go this route than to hit coffee shops for my 2-3 cups a day.",
        "I love this little machine. Programmable, makes great coffee, easy to clean, small profile, great price...however I have had two, and each one lasted only one year before failing to brew. Moving on. My dad says his Cuisinart lasts 10 years.",
        "My husband got this for Father's day and love it mouch hooked it straight up before even opening his other gifts..he was only slightly annoyed when th e delyedstartsidmt work right. But I think it was more operator error than timer problem. He never teuely reads instructions. O also got a permanent filter to go with it he loveditlso",
        "Excellent machine. Simple and the easy to use. The timer function that allows me to wake up in the morning to a fresh brewed cup of coffee is divine. If you're super picky about the quality and strength of your brew this machine might not be for you. But if your just looking for a hassle-free ready-when-you-are cup of black coffee, look no further.",
        "Works great for me! I had a Keurig made one cup at a time. The Keurig pods are expensive so had a insert that you could use your own coffee. Only had Keurig for a year and stopped making a full cup. Too expensive to replace so this is perfect for my 2 cups of coffee in the morning..maybe 3.",
        "It makes coffee. It does do what it is supposed to do. And it’s small, so it doesn’t take up much room on the counter. But pay attention to the size. It does not make a full 12cup pot. It also does not have a stay-warm feature. So if you’re someone who likes to make a large pot and then just sip on throughout the day, this is not for you.",
        "Bought in February this year. Started to splutter and hiss with 2 cups or less coming out. 7 months use. Noticed coffee just not tasting rich or full bodied. My last few mr coffees have had progressively declining quality. Time to look elsewhere.",
        "I had a similar problem to other reviewers. The coffee overflows the basket and grounds get into the brewed coffee. I have tried other baskets and coffee pots from previous Mr Coffee's and the result is the same. The problem appears to be a defect in height where the spring at the bottom of the basket is not depressed enough to allow coffee to drip into the coffee pot resulting in the overflow. The last Mr. Coffee I bought lasted a few years before it stopped brewing. I'm back using the discolored white one I purchased at least 15 years ago.",
        "This thing cannot be programmed to delay brew your coffee, which is why I bought it. I did exactly what the instructions said, even looked at YouTube videos. It cannot be programmed! So, if you’re looking to save a few minutes in the morning, don’t waste your money on this so called “programmable” coffee maker. IT DOES NOT FUNCTION AS ADVERTISED.",
        "This coffee maker is really flimsy and has many other disadvantages. I yearn for one that is well designed like the 4-cup model brown that I have owned for 15 years which just hit the dust. Unfortunately brown no longer makes a 4-cup model.i want to add: mr coffee is a piece of junk, especially the curved carafe instead of the straight one of the Brown. The whole unit is ill fitting compared to the brown solid one. The curved carafe makes pouring very awkward.. Mr coffee is a piece of junk but AMAZON IS FABULOUS! THANK YOU!",
        "This is a good little coffee maker!! I like that it doesn't take up a lot of space in the kitchen. It is cute and the delay brew function is really convenient. The quality of the machine is good and it is easy to operate. It is really small but not a problem since I tend to brew just a few cups of coffee when I use it.",
        "Love my little 4 cup coffee maker! It's the perfect size for my 2 person household. It has a delay brew feature so I can program it to start before we get out of bed in the morning. Doesn't take up a lot of space at all! Make sure you buy the Mr. Coffee 4 cup coffee filters, it's a pain and not worth it trying to use the regular size.",
        "This is the tiniest coffee carafe I've ever seen! If you live alone and want to make coffee just for yourself, then it's fine. The carafe simply doesn't have enough volume for more than that. The coffee maker itself seemed fine, but I didn't actually use it. I took one look at the size of the glass pot and said, \"nope\" then sent it back. However, I used to own an older Mr Coffee maker with identical features and that one worked just great for years, so I'm sure this one would be fine. I exchanged this for the Mr. Coffee BVMC-SJX33GT, and that one is like your typical size coffee maker, and works great.",
        "Love this coffee maker for its size, speed, basic function etc. I have only one complaint - The brew-pot (4-cup pot) that comes with the machine is IMPOSSIBLE to pour when full after brewing without getting some of the coffee on your cup, counter, arm, the dogs, your in-laws, the cars in the garage, etc.. We've tried slow pour, a rapid committed pour, a close pour, tall pour... nothing seems to work. So, we now make the initial pour over the sink and live with it because we like the machine enough otherwise..",
        "I had a 5 cup Mr. Coffee before this one. It finally died and I decided to not get the same one again because I thought adding water to the old one was more difficult (had to pour in in a back corner beyond the filter) and I really needed only 3 - 4 cups capacity. This one is more compact and easy to add water; no careful pour, just dump in. Also, the carafe doesn't drip and opens fully for easy washing in the dishwasher. A good buy for a personal coffee maker.",
        "I received this today so I can't speak to it's reliability. I just wanted to pass on that this 4 cup size is just the right size to make 2 big mugs (the type you can get 4 fingers through the handle) of coffee. Since that's all of the coffee I drink, this is perfect for me.",
        "this product is exactly what I was looking for. It was small and made coffee quickly and made just the right amount. However, it left a horrible chemical aftertaste to every pot of coffee I made! I tried cleaning it with vinegar, I changed my coffee, I changed my creamer & I changed my sugar but nothing changed the horrible chemical taste. I don't know what else to do, so I am still going to have to get another pot. Won't buy this kind again.",
        "Makes a great cup of coffee (fairly fast too). Get about 2 standard coffee cups per pot. Pouring is a little difficult and the pot isn't designed to empty (fully) easily (either water or coffee). Pot has built in marks for measuring as does water container. Top gets REALLY hot when brewing, might burn you a little bit if you hold for too long. Built in clock and timer if needed. Use \"1 X 4-Cup Basket Style Permanent Coffee Filter fits Mr. Coffee 4 Cup Coffeemakers (With Handle)\" reusable filter, fits great.",
        "I really like this coffee machine. It makes delicious coffee without loose grounds (when you use a coffee filter). Standard 4 cup coffee filters fit perfectly. The only thing is that I wish the water compartment came out for cleaning. Also just make sure you know that 4 cups does not mean 4 mugs of coffee - it means about two.",
        "Considering the following factors: price, delayed brewing function, drip coffee, and small serving. I'm happy with this purchase! Could keep the coffee warm for an hour. That's a bonus for me. Coffee is served really hot! coffee tastes good too. Would probably just need to adjust the amount of grounds until you find the perfect amount to serve you your perfect coffee.",
        "The best part is that it brews at the set time. When I wake up, my coffee is ready. It does get hot and stays hot for a few before it cuts off. It'll probably be best to buy the reusable filter with it, now that I see.",
        "Got rid of the keurig and got this basic maker and i love how coffee is ready for me when i wake up. i can make a cup and fill my mug. Perfect for one or two people. And i know when i clean the machine, its clean. I also save a ton not dealing with k cups and using so many k cups to make coffee at home and fill our mugs. Sometimes to basic is better. Its also small and snug in my tiny kitchen",
        "My apartment does not have much counter space in the kitchen and what little space I do have, I use to prep food. I included a photo to show the size relative to the space that I have (with the coffee pot pushed to the wall.). If you are looking for a fast coffee maker (this is extremely fast) that takes up very little space, this is perfect. I'm very happy with this coffee pot and no regrets so far!",
        "This is perfect for one person and takes up hardly any counter space. I chose to also purchase the permanent filter. After Keurig and the Verisimo I got tired of the expense and big machines, so I just went back to the old Mr Coffee and so glad I did! Brews hot and has auto shut off.",
        "I didn't see this in the product description, but for me it's a huge annoyance -- this model has auto shut-off after an hour. I like to make a pot in the morning, have a half cup getting ready for work, then pour the rest into my travel mug. The first morning I thought I must have shut if off accidentally pouring my half cup. This is a replacement for the same model I had for many years, and I love the small size, but the auto shut off is annoying. I have not looked in the manual, there may be a work around, but I wanted to post a HEADS UP that it is the default setting.",
        "Love this little guy. After reading the negative reviews I can only say: if you are an adult and can put a plug into a wall, spoon coffee into a filter, and are reasonably attentive while pouring.then this device should work for you just fine.I only wish the coffee were a little hotter. To address that I run hot water in the cup before brewing and let the brewed cup sit on the built in warmer for a couple of minutes after it's done. Seems to help.",
        "Purchased my Mr Coffee on 11/27/17. Delivered 11/29ish and started using it the next day. Today is 1/12/18 and it quit working as of this morning. I get that it’s a $20 coffee maker (I’m the only one who drinks coffee in our household), but I think it should probably last longer than 2 months. I won’t be purchasing another Mr Coffee. I’ll purchase a different brand that offers a 4-5 cup maker like this one.",
        "OK. I'm having a HUGE issue with this product. Got it so I could make Tea for myself. After a few weeks I noticed a sediment not only in the Carafe but also where the water goes!! (don't know correct term for it) Almost looks like a light colored sand that builds up in both areas. And It's very hard to remove. We use filtered water and use a black plastic coffee maker for our coffee each day. And it has never had a similar issue with our water (if that was what you were thinking) Obviously had to stop using it. VERY DISSAPPOINTED.",
        "Still chugging away over a year later. No problems. Quick to make a single big mug or two regular ones, quick to rinse out, super simple to use. Will but again when this one finally gives in to its heavy use. Love the preset feature.",
        "Works great! We've been using this coffee maker consistently for 2 months now and have no complaints. When I first ordered this product I was worried because my mother in law wakes up a lot later than I do, and the hotplate shuts off after an hour. This didn't end up inconveniencing us because the hotplate gets pretty hot fairly quickly and reheats the coffee within a few minutes after the coffee maker has been turned on again. We had an older version of this model and it lasted maybe 5 years before breaking. Not bad for the price!"
    ]
}