{
    "entity": "Coffee Machines",
    "text": [
        "Before I ordered this item I checked the Q&A section and was told it's made in the USA. But when I received the item, the box and the product itself said it's MADE IN CHINA! And when I actually used this peculator I found it to be of low quality. I've had old peculators in the past (not made in China) and they performed far much better. The \"basket\" and the \"spreader\" units of this peculator are made of cheap material. There's no on-off button. Even when I used coffee ground specifically for peculators, the brewed coffee had many \"coffee chunks\" in the cup. I would not recommend this product.",
        "Had it with the drip coffee makers and all the other makes and decided to go back to a percolator and boy am glad I did. This is exactly what I have been looking for a straight forward pot that makes fantastic coffee fast...love getting up to the sound of it doing its own thing in the kitchen...you will not be disappointed in this heavy weight pot.",
        "I have had a coffee maker for years and it finally broke down so I got the percolator which is what I've wanted to have for a long time and it is marvelous! It's so sleek-looking and clean and it keeps the coffee hot as long as I have it plugged in it's a beautiful machine! The only change I could wish for is a longer cord! It's so short you can barely pour it.",
        "Just as described. I am getting rid of all plastic in my house, which includes my coffee maker with all those plastic parts on the inside. So this is the perfect way to make coffee. Peculators do not work well with finely ground coffee though. By using the little disc filters and coarsely grinding my coffee, it uses a bit more product but makes a great cup without the grounds. I am very happy with this product and look forward to years of use. #nomoreplastic",
        "Every time we brewed a pot, coffee grounds were all over the outside of the coffee basket. Yes, the basket lid was in place. I really wanted to love this pot. It does make great coffee and keeps it very hot. But I don't want grounds in my cup. I wish I had read the one-star reviews before ordering this pot. Some reviewers were complaining about this problem. Maybe a coarsely-ground coffee would work okay. We use Folger's Classic Roast.",
        "This coffee maker was a terrible purchase. Even with the filters, I got grounds in my brewed coffee. I let it slide, because other than that it was really hot and had awesome flavor, I just didn't drink the last sip. After the first week of use, the temperature started to cool down and the brew wouldn't brew as long, so the flavor wasn't as good. The final time I used it, 2 weeks after purchasing, it was cold and barely flavored like coffee. I returned the item and will not be buying it again.",
        "I purchased the percolator in July but it was a Christmas gift so it has only been used for 3 months and it is no longer working. The coffee comes out looking like dirty water but sometimes by around 2 or 3 in the afternoon (after being on all day) it will give a pretty good tasting cup of coffee. Useless and not impressed and of course, I can't get hold of the seller to try and resolve this. I have never had any trouble purchasing anything on Amazon but this purchase is very disappointing...and not cheap! I have never left a bad review before and hoped I could reach out to amazon but I have no idea how",
        "This is a great, solidly built, fast brewing electric percolator. It brews quickly, requires little coffee, 6 scoops equals 12 cups, and produces some of the best coffee I've ever tasted even from cheap store bought coffee. I will update this review if I have any problems with it since I just got it today. So far though, I am impressed. This will make a great percolator for anyone wanting a good percolator that brews great coffee.",
        "I have been using percolator type coffee pots for over 25 years and this is the worst one. I have always used Presto and tried to save $ but it ended up costing me more. First off it is soooo loud when it is percolating, when it is on downstairs the whole house can hear it, it sounds like something is blasting off. I have dealt with it for 6 months and now the coffee is barely hot when it is finished. Since it has been 6 months no one will do anything. Terrible customer service. I guess you get what you pay for, I won't make that mistake again. SO disappointed.",
        "Works great - there is nothing like percolator coffee! Have to change my review. After 7 months of using it probably 30 times it has quit heating and percolating long enough to make good coffee. Going back to either Farberwre or Presto - they only last a few years before going out...but this Hamilton Beach is ridiculously poorly made. Save your money and buy a different brand.",
        "UPDATE: Cleaning and drying the area where the cord plugs into the perculator solved the GFCI trip problem. Worked as expected and made good coffee. After 8 months it started tripping the GFCI outlet. Tried another outlet, same thing. Ran it on a non-GFI outlet and it worked fine. Then I checked the connection \"port\" from plug to pot and found it moist and a little contaminated with what could be coffee stains. I'll update this when I try the next pot of coffee. For the record GFCI ( often called GFI ) outlets trip due to grounding/current leakage problems, not due to too much current load. A complete short and high current load would trip your circuit breaker.",
        "Super-annoyed! Spent a ridiculous amount of time researching what would be the perfect percolator to buy. After realizing that NONE were made in the US, opted for the Hamilton Beach because of the reviews and retro design. Loved it, UNTIL... 3 days in....it started tripping my circuit breaker for no reason. :-( After all that, now I have to go to the trouble of packing the whole thing up and shipping it back for a refund. Total waste of precious time. I'll guess I'll try a different brand and now it's back to the drawing board.",
        "The only thing I regret more than buying this coffee pot is tossing the box. Normally I hold on to them for awhile, but having just moved and already surrounded by boxes, out it went. Lots of grounds in coffee and basket is covered with them. I've tried wetting/not wetting the basket prior to adding coffee and brewing, used different brands of coffee, used less/more coffee, less/more water, and taken the grounds covered basket out prior to pouring. Unfortunately, nothing worked and I am left with a coffee pot I won't use and, as I foolishly tossed the box, can't return. Normally reliable Hamilton Beach let me down this go around. Very disappointed.",
        "If you like grounds in your coffee this is the percolated for you. I have to strain each cup before I drink it. Search elsewhere, I wish I would have.",
        "This percolator makes amazing coffee! After brewing, the coffee is kept warm for hoooours without burning! The only caveat, and it’s minor, is that at times a little brews out into the counter. Otherwise, it’s the perfect brewing machine!",
        "I grew up in a home where my mother used one of these, so going back to this type of coffee maker reminds me of her. It keeps the coffee HOT without cooking it but I do have an issue with the power cord. It's too short. Also, I'm already having problems getting the prongs to stay connected in the percolator. I have to really push it in hard to get it to stay put. The spring on the stem of the percolator already came off, so now the basket drops down in the percolator. It would have been nice if they included another spring, or made it so it wouldn't fall off when cleaning.",
        "I use this only as a hot water dispenser so I cannot review its percolator. I replaced a presto 12 cup coffee maker with this. It seems to take much longer to heat a full pot than the presto but seems to heat and keep water hot as well. The only complaint other than the time it takes to get the water up to heat is the handle. I can't be accused of having a dainty hand but the handle is so large around I have trouble lifting the pot when it is full of water. It was not made for a weak hand. I have to use both hands if it is full of water. Back to the presto!",
        "Makes coffe that looks like tea, does not always brew, some times I open it up after it has “brewed” and it’s still clear water. Have been using electric percolators for years and never had this much trouble. Threw it away and bought a new one.",
        "Update: after a year and a half it stopped perking. Started out good but poor quality. Hamilton Beach is if off my approved supplier list. Cost-reduced junk. Has 2 heTing elements and one temp switch. How does fail so soon unless it’s junk. ——————- Really like this throwback appliance. Works great, takes up a lot less space than a drip coffee maker and it is an attractive, timeless style. You need to use coffee with larger grounds or you’ll get ground in the pot but you can use a filter (cheap). A few grounds at the bottom of the cup don’t bother me. Very happy with it.",
        "I would have returned this if Amazon didn't charge for return shipping unless a product is damaged or defective. I bought this percolator to replace one that no longer worked. I chose this one because it was cheaper than others. The minute I saw it, I knew why. Everything about this looks cheap. It is manufactured from the thinnest metal I have seen on a coffee pot, the parts fit together poorly, and it lacks features that I thought were standard on percolators, like a window to see how many cups of water you are adding. Very disappointed.",
        "Did not last 2 months!! Bought it in March...stopped working last week. I don't know how where to call for warranty!",
        "Perks in about 10-12 minutes for 12 cup. Keeps coffee hot without burning. works with Alexa and a smart plue (internet-and-router required for this) so nice to say \"alexa turn on the coffee\" and when you get to the kitchen HOT COFFEE we use Folgers Colombian 4 heaping and 2 level Tablespoons for fantastic coffee (wife drinks it Black) wouldn't by anything else...and we have had quite a few different brands. can't go wrong with this one.",
        "I love this product. Brews in minutes and tastes delicious. It's easy to use. Light turns on when it's done. And easy to clean. Standard removal basket and stem are also easy to clean. But it's the taste that sets it apart from other similar products. And I'm guessing that has something to do with the size of the unit and basket. I don't know what else it could be, but whatever it is Hamilton Beach sure did it right!",
        "Had to send back the first one. Amazon was great about it. First-time return and it was easier than I thought. Still a pain in the neck, but not horrible. Best coffee I've ever had and I'm particular about my coffee. This one doesn't seen to be as good as the first one. Weird. Same product. But it's still excellent coffee Hope this replacement holds up. The coffee is excellent. I'll never go back to drip",
        "I have been using my HB percolator for about 4 weeks now and Here’s why I like it. Strong, flavorful and HOT coffee. The stainless steel permanent filter basket has smaller holes than more expensive percolators I’ve tried, leaving little grounds. (I pour through a cute tea strainer into my cup anyway though instead of using filters, only the tiniest of ground is left in strainer. I would have liked a glass lid, but The ready light lets me know it’s ready.",
        "This is not only the ,messiest coffee pot I have owned it is hard to use as the stem barely hits above the top of the strainer so there isn't much to hang on to when you lower it into the pot. I have tried to adjust my grind of coffee but it leaves grounds in the lid, the pot, on the strainer and basket. DO NOT BUY.",
        "When purchased, I wanted a fast turn around time for my morning coffee. Seven minutes for a 12 cup is not bad. However, I do not like grounds when I sip my morning brew. Wow! I've tried filters top and bottom of the grounds cup, heavier grinds and none of these work. Every cup has sediments of fine coffee. I would never recommend this coffee pot.I thought Hamilton Beach would be a good brand. I was wrong. Don't buy it.",
        "The percolator makes great coffee, when it works! Compared to others, this makes the best coffee. We have two, one for our primary residence and one for our summer lake house. One works fine, and the other sometimes fails to get enough energy to pump the water over the basket so the percolating finishes and we have just water or very, very weak coffee. Since we like the coffee, we just ordered a replacement for our primary residence, hoping that the one we have is just defective. We had tried others and the coffee grinds get all over. We do not like the taste that comes with filters.",
        "Didn't do my homework - I was surprised when the coffee maker didn't have an on / off switch or an automatic shut-off, like my $19.95 Mr. Coffee machine. Coffee was OK, but my hope to 'wake up and smell the coffee' was an even bigger disappointment. Couldn't detect any coffee brewing much like I remember many years ago when I first had a coffee percolator. The filter was not very effective. For just the reason of no having an on/off and automatic shut off, do not buy - look for something else.",
        "The material was very thin and it was very finicky in order to align the top with the tube going down to the base of the coffee maker and even that it was not that sturdy and I got a lot of coffee grounds in the cups of coffee when I used it",
        "Determined to get away from literally coooking in plastic, it was imperative for us to find the idea stainless steel perculator. We are very happy with our purchase. The coffee is delicious & is ready in a very short time, & the keep-warm feature does a great job of keepng the coffee nice & hot. Highly recommend.",
        "This percolator does not have an adjustment for coffee strength other than just using more or less coffee. Most percolators have a setting to adjust the perc time or for stove tops you can just let them perc longer. This one has just one setting. I like strong coffee and this pot using a Starbucks dark roast was weak. Which means i will need to use a lot more coffee than I was using in my drip coffee maker.",
        "Used a Farberware Percolator for 31 years until it died. Stupidly threw that out instead of rebuilding it. Searched for several years now for a replacement. Hamilton Beach has the weight of the old styles. Feels good in your hands. Makes even better coffee - quick perking, aromatic, HOT & smooth, but use a filter. Thankful to have finally found a decent substitute because new Farberwares don't hold up to their vintage counterparts.",
        "I am so tired of the drip system and after 10 minutes of pouring hot coffee into a mug the coffee is ice cold! I decided to buy this percolator and the coffee is HOT! Even after 10 minutes in the mug! ... I must admit, I am not too crazy about the coffee grounds at the bottom of my cup however it is something that I can get over! The coffee is HOT, so good and NO bitterness! ... I LOVE IT!! ... I'd buy again in a heart beat!!",
        "I purchased a Hamilton Beach Perculator, it lasted about 6 months, just stopped working, so I bought a new one , I received it March 1, 2019..I did not even have it a month, it would not stop perking, so I had to unplug it when I thought it was done...don't waste your money on this product...I think I will buy my next perculator at the Goodwill, I did contact Hamilton Beach and they said they would send me another coffee pot , which was ok, but I had to pay shipping cost, just not right.....Oh well, Live and learn.",
        "This is the one that works well and we kept it. The others all broke or didn't work well. Love the old percolator style coffee makers, they make the best coffee ever. This one keeps it really hot too. The only issue is sometimes it's hard to gauge whether the stick is actually in the hole in the bottom and it doesn't perk the coffee, only makes hot water! Then you have to start all over again. So make sure the stick is for sure in the hole before putting on the lid and plugging in!",
        "I’m getting used to a perk coffee maker. It does make great coffee, and is easy to use, but I can’t see it perk up in the top which should be a glass knob. 😑 Small thing, I know. Also it must be washed and thoroughly dried right after use or it is hard to clean. I also wish it had a larger capacity. And finally...even though I use the disc filters, it leaves a lot of grounds on the coffee at 12 cups so I only brew 8. 😕",
        "I bought this 7 months ago and it shorted out. I only used it about a dozen times. It was great when it worked. It brewed quickly and kept the coffee hot. My only real complaint then was that the cord was too short. It shorted out the entire wall of electrical sockets. It could have caused a fire. I don't recommend this product.",
        "I’ve had them all Fabreware, Cuisinart, Presto. You’d be lucky to get 2 years out of a percolator these days. This one never worked. Defective out of the box. And even if you you’re lucky to get one that works, the holes in the filter basket are too large and let way too many grounds through compared to others.",
        "My Hamilton Beach 40616 Stainless-Steel 12-Cup Electric Percolator worked good for the first 15 times I used it but after that it kept blowing the circuit breaker and not heating up properly then quit working all together.",
        "If you're looking for a percolator, move on. This product puts a ton of coffee grounds in your coffee. I've tried everything from different filters to no filter and everything in between. I will be buying a different percolator and I can promise that it won't be a Hamilton |Beach product.",
        "Pot trips GFCIs consistently. First day - as percolating finished, oops, flipped the GFCi. Second day worked perfectly. Third day, tripped GFCI from the git go. Is it me or the pot? Tried on another circuit and same thing. Nothing else plugged in or drawing off power. Electrician coming anyway today so will see what he says. Coffee very good tho. When it finishes.",
        "We have very hard water and would go through 4 or 5 coffee makers a year. Did some research and switched to the Electric Peculator and was amazed at the flavor! Brews a perfect cup of coffee every time! I've had it for 6 weeks and so far hasn't slowed down yet. The quality of the flavor is no matter what brand of coffee is used surpasses the auto drip.",
        "Makes a great pot of coffee. If you auto drip folks haven't switched to a percolator you need to. The taste is soooo much better! I've had this one almost a year and it's still going strong. We average 2 pots daily...lots of people under my roof :) Only gave 4 stars instead of 5 because this purchase was to replace an identical one that only lasted a year. Before that I used the one made by GE...same thing...only a year before the element went out. I have my mothers old percolater, circa 1970, and it works great but is too small. Hence the need for a larger one.",
        "This percolator is incredible. With a 3-prong cord that is quite durable, this brews very hot coffee. I was a bit skeptical after reading some of the reviews on this product, but I have no regrets with this purchase. I am quite pleased. It is easy to clean and I think this will last a long time.",
        "Works like any percolator I've ever used. Makes the funny sounds, creates an aromatic coffee smell in the air, and that bronze colored coffee that tastes great. The handle is very comfortable to hold. Cord like most percolators is short. But overall it looks nice on the counter, brews quickly, and leaves you with an all around nothing to be desired brew that you can put a smile on others faces with.",
        "Poor quality. Sharp edges. Quit working after 3 months. My previous Hamilton Beach was the same model and lasted five years. Another example of decreased product quality over time. Will never buy Hamilton Beach again.",
        "We received the coffee pot on Saturday night. I washed the pot and made coffee on Sunday morning. When I checked to see if the coffee was ready, brown coffee water was all over the counter. The water was leaking from the plastic base. I unplugged the pot, let it cool, and added water. I placed a paper towel underneath and within minutes the water was leaking out. Its a safety hazard",
        "If you don’t mind some grounds getting in your cup (cause there will be) it makes amazing coffee. Like way better than a drip filter. You have to let it sit for five to ten minutes after it’s brewed then it’s great. Then after nine months of consistently great coffee it starts to fail you making weaker and weaker coffee 👎🏻",
        "Love how much hotter the coffee is...especially if you live in northern states where the water is so cold. We had for ex: Mr. Coffee type brand where the coffee would come out Luke warm....in 5 minutes the coffee was cold. We thought maybe it was the coffee machine was old went bought another Mr. Coffee style machine same thing. That’s when we purchased this one. Dislikes: no auto shut off...no bigee! Makes me use my brain...the old fashion way!",
        "I only have coffee once every few months and for some reason EVERY single time I attempt to use this it doesn't brew! I end up having to pour everything out and start over again while crossing my fingers that it might work the second time. Hate this percolator.",
        "Excellent product. I read product reviews as some were negative but revealed operator error. Product makes great coffe that stays hot for hours. I was disgusted with the new Keurig one cup brewer that only made one cup at the time, was expensive, required frequent cleaning, and would not brew non-Keurig coffee pods. My new Hamilton Beach percolator solved all those problems. Now I have all the coffee I want for a lower price, ready to use as needed.",
        "I tried this brand after my Presto died only to be disappointed. It does not poor well and leaks all over my cabinet. It also doesn’t clean well as the coffee grounds really stick to the finish of the unit. I wish I could return it. I’ve ordered another presto and will likely donate this coffee pot.",
        "This thing won't strain the coffee. The grounds come out of the top because the strainer design is flawed and doesn't allow the water to strain, it just fills up and overflows.",
        "It lasted slightly less than 3 years, got it in August 2017 and the chord connector shorted. Disassembled it but alas you cannot replace that part. So for the years we had it, loved it. But it should last more than three years.",
        "Thought would be better than Presto percolators but it’s not getting hot enough exactly two years after purchase. Bought this unit November 2017 and made coffee with it once every day. If you decide to buy this subpar unit make sure you buy the warranty extension sold by Amazon. Also can not tell what the well that holds the perc tube is made out of as it turned black after couple of months use???",
        "I don't like the fact that the bottom of the pot has to be cleaned quite well or it does not perk. My older percolators were not as fussy. Other than that, it works well.",
        "Hamilton Beach is the Cadillac of coffee makers. It is easy to use- has numbers inside the basket as well as the cannister so you know how much coffee and water to use. The brew is always the perfect temperature and has a fuller body than most coffee makers. For multiple coffee drinker households, it's perfect since the 12 cup maximum goes a long way. This coffee maker empowers the consumer to make coffee at home that surpasses most convenient store brands. Reintroduce the pleasures of old school coffee by using this product.",
        "The first one I received didn’t work. Wouldn’t heat up at all. The replacement works fine. Doesn’t have auto shut off and is difficult to clean without wetting the electrical socket area. Nice that the insides are all metal with no plastic in contact with the coffee.",
        "Like the percolator very much! The only thing that I didn't like was the measurements. I think of a cup as 8 oz. and the measurements on the coffee pot are 6 ounce cups so I put to much grounds in and coffee was very strong!",
        "Makes 8 cups in 5 minutes. Parts easy to clean. Keeps coffee warm after brew cycle, doesn't burn it. Use a lamp timer to preset brew for next morning. No plastic parts touch water.",
        "The first pot I bought worked fine till I forgot to put water in it before plugging it in. The pipe in the pot was ruined. There was no replacement part available so I had to order a second coffee maker. To avoid paying the same price I was able to order the coffee maker advertised with blemishes at a nice discount. The blemished pot was apparently out of stock, and I received a shiny new pot with no blemishes at the promised price. Thank you Amazon! I'll be more careful with this coffee maker.",
        "Coffee pot must have had something wrong in the electrical department. Plug it in and it kept tripping the switch so you would have to stay right there for the coffee to make. When we got it there was no warranty card or instructions so we can't sent it back or get a refund. Just ordered and received for more money a Cuisnart and hopefully it will work right.",
        "This coffee pot is awesome! The coffee comes out piping hot, and is very full-bodied and flavorful. It’s all-steel construction makes for a very solid look and feel and avoids the problems of mixing steel and aluminum parts that I’ve experienced with other percolators. Even the holes in the basket are designed to eliminate grinds in the coffee without using a filter. Highly recommended!",
        "PURCHASED TO TAKE TO MANDALAY BAY AS THERE WAS NEVER COFFEE IN THE ROOM! I HAVE TO HAVE MY MORNING COFFEE BEFORE I START MY DAY.....UPON ARRIVAL THERE WAS COFFEE POT IN ROOM----I THOUGHT OH SHOOT...UNTIL EACH MANDALAY CUP WAS LABELLED $6.50!!! RIP OFF-----EVEN MOTEL 6 PROBABLY GIVES FREE COFFEE. I BROUGHT MY FAVORITE CERAMIC CUP AND ENJOYED DAILY FRESH PERCOLATED COFFEE.",
        "I purchased this peculator on July 24, 2018 and used it daily. It was typically only plugged in for a couple hours every morning while I got ready for work. It was well maintained and cleaned regularly. I was very excited about it because it does makes fantastic tasting coffee, but unfortunately it stopped working after only 2 years of life. I woke up one morning plugged it in and nothing. I will be replacing with another peculator, but will be switching to a different brand.",
        "Makes good coffee..easy to use and clean...one problem with it is it keeps tripping circuit breakers..have tried multiple outlets...bought this in March 2017 to go with a new kitchen in a new house....had outlets looked at by electrician and changed the breaker we wanted to use with it....to this day it still pops breakers....",
        "Shipping was fast, pot works but no light until completely brewed . Twice I had not pushed cord in after washing the last 1/64th of an inch so didn't start until I noticed no light yet so 15 minutes lost. Can't view it perking since liiid doesn't include clear area to see perking .",
        "I love this coffee maker. My grandfather used to use a percolator & I wanted to give a nod to him with this in my home. The coffee tastes great & I love using this. The only downside is there’s no auto-turn-off, so I’ll only use it when I’m going to be at the house for a while.",
        "I have had my pot for a week now. Love it! Even my husband commented the coffee tastes much better than the k cups...which I got tired of spending an arm and a leg for. Glad I made the switch. Update...",
        "This is so great, heavy duty, water is really hot. Cleans up nice. I absolutely love this. My daughter and I keep it on at the start of our morning and it is so nice to not have to warm up the tea kettle everytime we want a warm drink instead we go to the Hamilton and pour us a nice cup of hot water and make our tea. Highly recommend if you like to have hot tea throughout the day.",
        "I love percolators instead of the drip coffee makers, so I tried this one. It really makes the coffee fast and the flavor is really good. Easy to clean. Glad I made the purchase.",
        "I prefer the percolator type coffee maker. First, hot coffee! Second easy to clean and no counter top mess. Third, it takes up less space and looks nice. Last, a Heavy solid appliance, not cheap looking or feeling.",
        "this item is just what I need coffe great stay hot for a coffee drinker a good cup of coffe is just what you need then this is a must awesome thank you",
        "Great fast coffee maker nice and hot .One thing try to find electric perk grind coffee.We have a permanent brew filter that's fits in side the coffee pot it helps .Just don't put more that 8 scoops of coffee we use eight tablespoons per pot of coffee.But it works great takes about 10 minutes to brew the coffee.",
        "Percolated coffee is a slow process. If you are buying this expecting true percolated coffee boldness and taste forget about it! The pot brews very fast...to fast as far as I can tell. The true way to get percolated coffee is the pot that you put over open flame and SLOWLY perks. This one produces watered down coffee",
        "Fantastic coffee maker! I would highly recommend this product. It perks so fast. The coffee stays hot for hours and it is so easy to clean. The price was great and I will be buying another as a gift.",
        "Love this percolator ! Works well and is easy to clean. Goes with me in housesitting job and does a wonderful job in making delicious coffee.",
        "This is the best perculator I have ever had. I think because it’s stainless steel. The others I have were not stainless steel and it’s is so much easier to clean an makes great coffee",
        "I bought this to supplement Kcups when we have family dinners. Used it for Christmas. It made a very good, hot cup,of coffee. I’m so pleased with it I bought it as a gift for my cousin who was with us and who needed a new electric coffee maker. It is very attractive, holds the heat and is not too heavy.",
        "Super perculator. Brews a strong pot in minutes and keeps it piping hot, unlike the auto-drip machines I have owned in the past. This method of brewing has such a great flavor. I'll never go back to the auto-drip method.",
        "We've used this coffee maker for over two years daily. Never had any problems. Great tasting coffee, easy to use and clean. I don't know why others have had electrical problems but I do know you can't have any water on the end of the cord that plugs into the coffee pot or the end that plugs into the wall, that should go without saying. The coffee pot can not be submerged in water like any electric appliance.",
        "Well, At first we loved it, but now I'm going to try to get my money back. It started smoking on the bottom and out of the plug on the back tonight. Nothing our fault, we know how to take care of an electrical appliance. We haven't even had it six months. Really a shame, we liked the coffee it brewed.",
        "Makes a REAL cup of coffee. Way better than pods and drips. I hooked it up to Alexa. I fill it at night and tell Alexa to turn it on. Nothing better than the smell of coffee brewing . As discribed and better.",
        "While it lasted this was a good percolator. But now after 4 months it only makes lukewarm coffee. What a piece of junk.",
        "I got this water heater for my dads birthday, he loves it! It heats up quick and the water is hot and clean. He says it’s the best water heater for instant coffee he has ever used!",
        "For a very long time we have used a percolating coffee maker this one is easier to clean then our older one and makes more in one brew. The only thing indo not like is that the holes on the coffee grounds holder are big and warrants the use of filters. Wish it would have come with some or mentioned we would need to purchase them.",
        "Stopped percolating after 5 uses. Bought in November 2018 saved it for our lake cabin. Just was there for a week-August 2019. Stopped working! I had to go buy a coffee maker locally. Can’t see where or how to return as it is defective.",
        "Great quality product. Makes delicious very hot coffee. It's not really loud when coffee is brewing. It looks classy and elegant in my kitchen. It has a very nice handle that feels fantastic when pouring.",
        "We have given up on K-Cups and drip coffee makers. Gone back to percolator coffee. Love it!! Prepare the pot the night before. First one up plugs it in! Great coffee!",
        "Makes excellent coffee. We are now a family converting to perking morning coffee instead of using the keurig. This is for the third member of my family that found this method makes great hot coffee",
        "This percolator so far has performed stellar. The coffee is good and hot and tastes excellent. I would have given it a 5 star review but the walls seem so thin and I fear that would be easy to dent.",
        "Great quality / no aluminum ...stainless steel ...get the most of you Coffee......full flavor . Well made , HOT coffee all the time .",
        "I love the taste of the coffee it makes! It is sturdy and easy to pull apart and clean. The only problem is we consistently have grounds in the coffee. We strain the coffee as we pour, yet some grounds still slip through.",
        "Great pot. Taller than I wanted, but makes great coffee. Regular filters with hole poked in middle work better than round filters.",
        "I bought this percolater for my elderly parents. Mom hasn't used a percolater in over 40 years. They LOVE it! Tired of the current type of coffee maker leaking and hassle with filters, etc. Super great product. Very easy to use and makes a great cup of coffee!",
        "Purchased this percolator on June 19th and it no longer works. Unit faintly buzzes when I plug it in but no percolation take place. A 5 month life span is ridiculous...threw it out and will never purchase a Hamilton Beach product again.",
        "I love the taste of coffee in an old fashioned percolator. This Hamilton Beach product works great. Keeps coffee warm for hrs and the taste does not get bitter as it sits. Yes I would recommend this product any day and for the price it can't be beat.",
        "easy to use quick coffee taste's better...bought all kinds of flavorings..so thanks works great",
        "I love it. No plastic to worry about as an endocrine disrupter, keeps coffee warm but not burnt, and I can wash it easily. I use a paper filter for less coffee grinds. Works great doing that. Just wish it had a timer/auto turn off because sometimes I forget to unplug it."
    ]
}