{
    "entity": "Coffee Machines",
    "text": [
        "Have only been using this pot for a few weeks to make the coffee for church, so don't know how long it will last, but so far I'm very happy with it. It takes about a minute per cup, we have been using hot tap water to start with and it reduces your brew time by about 1/3. It is a little noisy when it first starts perking. It sounds like it's trying to launch into orbit, then quiets down after it gets going. Attractive coffeepot, so far I like it a lot and the coffee tastes good, doesn't leave many grounds in the bottom.",
        "My only negative is that the directions say not to use coffee filter, but too many grounds get through into the coffee. Otherwise, product is nice and works well and it true to the \"1 cup every 60 seconds\".",
        "Love this coffee pot. Easy to use and very easy to clean Coffee tastes delicious. Many compliments from friends Use it all the time for birthdays, parties, gatherings. Saved me from brewing many individual pots of coffee. Great find for my needs. I now spend more time at these special gatherings without having to go into the kitchen to make more coffee.",
        "I bought this item only 2 months ago and recently started leaking, Can not find anyone to report it to or have it replaced because the return period of two weeks lapsed. It is an awful expensive item for only getting two months use of it. Do not buy this product!!",
        "Bought this for our department at work for the rare, bigger meetings - maybe used 6 times in a couple of years. Brought it out to brew for an event, filled it with water and it leaked immediately everywhere. It stays in storage and does not get jostled about, so we were shocked and DISAPPOINTED! It cost over $100.00 so not happy at all. When it did work it was fine. Feel ripped-off.",
        "I bought this coffee pot because it had good reviews. Have only used this once a week (for church on Sundays) since June 25. The on/off button quit working this week.",
        "This is our 2nd Westbend 55 cup coffee maker--this first one lasted over 10 years and was still working when we decided to replace it. It is used 5 times a week making 45 cups each time. It is easy to use, easy to clean, very durable and trouble free. The interior cup level is a great feature and makes it easy to use for multiple, non experienced coffee makers in our organization. Great product",
        "Purchased 2 urns. Have used both for 2 months, once per week and they are both leaking through the base! Also, we set up the water in the pots on the Friday prior to church service on Sunday and the interior is completely corroded. Our water is hard however this hasn't been such a dramatic problem with other urns. The aluminum must be of poor quality and too thin.",
        "Leaked near the lid by the handle down the side the first time used. I tried to brew fewer cups but it did not matter--it just leaks during the brewing cycle. Unfortunate purchase and beyond return period. Wish I heeded other reviews noting same problem--but then I thought I might be one of the good reviews.",
        "Works good for our Office/Meetings. Start half to an hour prior to serve time to allow it to be ready.",
        "Disliked that coffee leaks when brewing. It’s a disaster. Would NOT recommend",
        "Works as described. Makes 55 cups of coffee or less in a reasonable amount of time. That being said you are getting what you pay for here. This is really a piece of junk as far as fit, feel, and finish is concerned. And while it appears to be polished stainless steel on the outside...it is certainly not on the inside. Looks very aluminum! And stained like aluminum! I would not drink from this pot on any type of regular basis a) because of what it is apparently made of and b) because it is a bit difficult/clumsy to clean and I would question anyone else cleaning it thoroughly and/or properly! And lastly the word is out on consuming aluminum!!!",
        "After a few months the faucet started to leak, which was still tolerable but today it completely broke down and it’s only been one year since we started using it.",
        "I had not had it very long, had probably used it about 30 times over the course of several months when it began to leak. Poor quality.",
        "This is a wonderful product and is well worth the money if you are supporting any larger venue. The only issue to consider is the brew time. I have two of these pots now and I have experienced a time where I drained the one remaining pot before I was able to get the next pot brewed. It takes at least 50 minutes to 1 hour to brew a pot of coffee. Other than that, this exceeds my expectations.",
        "I ordered this for our parish kitchen. We have several of these already and they work very well for our use.",
        "I ordered two of these West Bend coffee urns for our church. We had previously owned the same type but in a larger size that made 100 cups of coffee. After many years of service, it was still working but we decided to order new ones. These urns are so dependable that they will last a long, long time. We chose \"two\" 55-cup urns this time for the ability to have two coffee stations going instead of a single line. Plus, the smaller urns are easier to handle and to clean. We love having the two coffee stations. The West Bend coffee urn is the workhorse of coffee urns.",
        "Classic Roast is served from 7:30am and gone by 12 noon... all 55 cups of deliciousness!!! Very happy with this item.",
        "Though the coffee stayed hot, the pot leaked after a few uses.",
        "This urn is used at a senior center. Gets lots of use and people can tell we now have a really good coffee maker.",
        "After going through several other urns, we've found this urn to be the best by far! This unit is used M-F and is enjoyed by all my employees. The quality of this unit is high and obvious compared to others that didn't last. I would recommend this product to anyone!!",
        "We used the West Bend Coffee Urn for the first time at our Fall Festival Dinner, the coffeemaker worked great and made very good coffee. I purchased this item at Amazon and also received free shipping, arrived quickly . I looked at quite a few coffee urns and decided the West Bend one met all of the qualifications we needed for our church.",
        "The pot itself is a thin one piece of aluminum so it transmits the heat of the contents quickly and directly to the outside surface of the coffee pot. This means that if you touch it you will get burned. This is not for use where children or others would have a chance to come into contact with the pot. Very dangerous. Avoid.",
        "I love, love this urn. It's easy to use, easy to clean and the booklet that comes with it that tells you what measurement of coffee to use per cup, is actually right on the money. I highly recommend this urn.",
        "The coffee urn is made for Us electrical system, not for europees one!we could'n use it that way and since we changed the electrik cables it went broken",
        "AFTER 2 MONTH OF USE JUST STOP WORKING,ITS TOO BAD I HAVE TO BUY ANOTHER BRAND",
        "I purchased this coffee maker for our community center. The price was great, it arrived in only 2 days, and makes a wonderful cup of coffee. I would reccomend this coffee maker with no reservations.",
        "Bought this product for our church. It brews enough for our small congregation and is ready just about the time services are over.",
        "The item arrived damaged. It was not packaged properly and the black plastic bottom was broken. I did not return it because I needed to use it immediately. I am very disappointed and wish I could return it.",
        "Was so disappointed. Ordered the first coffee urn for our church. It leaked by the handle. Thought it was just a fluke so I sent it back and had it replaced with another to use for our Easter breakfast. Well believe it or not that one leaked in the same place. Don't know if it is riveted by the handle and the rivet is not fitted properly. You cannot tighten it either as there is no screw in sight. Needless to say I will be looking for another brand of 55 cup coffee urn.",
        "Bought this for the church coffee hour. This brand holds up for years of heavy use",
        "Not made is Wisconsin, but China. Very long Cord that doesn't disconnect from pot. I like the on off switch. Metal Coffee filter is HOT to the touch when making another batch of brew as apposed to a plastic one? Logo isn't etched into pot (as pictured) but painted, takes away some of the charm? Louder than my old coffee pot. Makes a great cup of JOE!",
        "I purchased this on behalf of our Activities Committee (a Senior's highrise) and it fits our needs perfectly. We like that a cup can be set nicely under the spigot. Very well made. Experienced again Amazon's wonderful service!",
        "Bought this to replace older unit at church. It works as advertised and after over a year of use is still working great with no issues.",
        "I don't think this has changed much over the years, and I keep buying it over again after the last dies a slow death. Get some 5-7 years out of it I think using it multiple times a week.",
        "Bought two of these for our church and they are just great. Use both of them at least once a week and they have been doing a great job for a number of years now. Well satisfied.",
        "This urn is great. I needed an easy to use, high capacity, coffee urn for an annual party that we have and this one fit the bill. The price was a bit more than I wanted to spend but after seeing how well it worked for me I was glad that I did.",
        "Only had it a few weeks, but it does a good job for the church I donated it to.",
        "Works fine but leaks around the handles where the rivets attach the handles. Messy.",
        "Purchased this urn several months ago. Works very well. The spout drips a little after you pour a cup of coffee but still worth purchasing.",
        "think you for nice pot it is nice. now they can have coffee in the mornings.santa comes 365 days a year.",
        "Bought this for our snack bar at church bingo. It brews fast, keeps coffee nice and hot and cleans easily. The price and free shipping made this a great buy for us.",
        "This product is used every day and it is holding up well. Brews good hot coffee and keeps it hot.",
        "We bought this for a non-profit organization, planning to use it at least twice a month. It's a good urn, a nice size, but the metal seems very light weight so we don't know how it's going to hold up since we have to pack and unpack it each time we use it.",
        "Have had one before so know what was purchasing. Only complaint picture of product was old and didn't match actual product, would have preferd older model like picture showed!",
        "Our church uses it every Sunday since 2012 and serves an easy 50+! Easy to maintain and clean. It is nice brewer!"
    ]
}