{
    "entity": "Coffee Machines",
    "text": [
        "I never made cold brew coffee before this and I found this system to be great. I like using this with the filter as it makes clean up very easy. While its brewing I put a plastic wrap to cover it (shown in pictures). I wanted to try to DIY cold brew at home because I was spending a lot of money at Starbucks. This is just what I needed. You can follow the recipes that's included and tweak it a bit to your tastes. I like to dilute my concentrate 50/50 with water over ice with a little bit of almond milk.",
        "My wife loves her toddy so when her Toddy pitcher cracked we had to replace it. Yikes! $35 for a glass pitcher and some plastic. I get it that this is is not that much for a coffee maker, but the glass is so thin. I would have loved to have opened up the new one and found a much beefier pitcher, but no, I think this one may be thinner than our old pitcher. I guess you have to cut costs somewhere. As far as functionality goes, it does what it does...it makes cold brew coffee concentrate.",
        "Their website Toddy lists it as having a lid but if you order it Shipped and Sold by Amazon.com it doesn't come with a lid. I think this is the best cold brew system on the market for not getting grounds or particles in your coffee but only if it had a lid. Am I supposed to leave my coffee and water open to the other smells in my fridge or on my counter before I put it in the decanter?",
        "Very disappointed with this purchase. Even with the rubber stopper in, the coffee leaks out of the bottom and I have to repeatedly pour it back in during the steeping period. Really wish I could get a replacement/refund",
        "Really simple to use with great results! Iced coffee tastes great. Just followed directions. There is a cork that is installed at the beginning that you remove after infusing the water. Make sure is pushed in far enough. I pushed in on and placed the container on the counter to steep. Slid the container out of my way doing food prep and the cork was extending out and barely touching the counter surface. You guessed it! The sliding across the counter caused the cork to pull out and a three stooges situation ensued!! Great results for a very low price.",
        "I've used the Toddy system for years and recently got a new one. It makes the BEST New Orleans-style cafe au lait, like Cafe du Monde in the French Quarter. But you've got to watch it... unlike the County Line set-up, Toddy can make a big mess. Just yesterday, for example, coffee leaked all over my kitchen counter because the stopper went crooked somehow. I wound up with about half the coffee I was expecting! Yet, I stay with it because it's just so good with authentic New Orleans flavor. On a day to day basis, however, I recommend County Line.",
        "This thing is utterly amazing - The concentration of coffee from a 12oz bag is literally like jet fuel on how strong it is. I don't think I soaked the filter long enough for my first batch as it took some time to drain and some stirring of the grounds (30 mins), but everything after that has moved pretty quickly. I used to do the old fashion method of grounds in a quart ball jar and coffee filter, but Toddy is waaay better. I don't pour as much coffee because it's so strong but a 12oz batch will last my husband and I the entire week before making the next one.",
        "If you're like me -- incredibly lazy but also a snob for good coffee -- then this 100% for you. Add the ground beans, the water, leave it to sit overnight in the fridge and BAM you have coffee for like two weeks. That's all you have to do. The entire process is so painless I always feel like I'm doing something wrong. Only thing I recommend are the filter bags instead of the little felt filter. In my experience, the felt filter got super grungy after multiple uses and also took forever to filter. The filter bags are so dang easy and then you just dispose of the leftover garbage beans however you deal with that sort of thing.",
        "I've been drinking coffee made in a Toddy since I was old enough for caffeine--there is no better way to make coffee. Add boiling water for hot coffee in the mornings, add milk and ice for iced coffee in the afternoons. I've tried lots of other ways of making coffee but nothing holds up: drip is too watery, those moka italian stovetop makers are too easy to burn, and don't even bring Keurig into this conversation. French press is the only method that compares, and even that is just an impatient man's Toddy and the coffee is never as rich or complex. Simply put, Toddy can't be beat.",
        "I was using a(actually the crowdfunded earlier version), and getting decent results. Then I followed a couple review sites and bought the Toddy based on their recommendation. Wow, what a difference! It isn't pretty like the Breuer (OK, it's a great flask, but the tub is utilitarian at best), but the quality of coffee is remarkable. You do need to follow the directions to avoid gunking up the filter. On Toddy's website they are now selling large filter bags (grounds go in the disposable bag, but you still have the bottom drain filter). Instead I've been using a, which is reusable and seems to do the job.",
        "I had the Toddy maker for over 12 years. Loved the results of the cold brew coffee concentrate flavor. I began having problems with the stopper not holding back drips during the processing and the filter replacements were not fitting tightly. So I tried another similar product but was never able to get the same rich result. I decided to reorder the Toddy and with more processing instructions and recommendations I am back to loving the results. Yeah!!!",
        "The upper plastic portion got a tiny crack where the plug goes. No idea how, but now the coffee leaks right out before fully brewed. Was great the first 2-3 times we used it, disappointed.",
        "If you want to reduce plastic and make your own cold brew - this is the tool you need. I highly recommend buying the filter bags and using those as they are a lot less messy and prevents grounds from coming through the filter. Pro's - Tastes great, saving money and the environment by not buying premade cold brew from the store anymore. Cons' - Messy to clean up , you have to keep track of tiny little plug for the bottom of the container that holds the cold brew in, filter sometimes comes out or gets loose allowing for grounds to come through, not using the lid (created suction) is best to avoid that, just leave the lid off.",
        "Makes great tasting coffee! Very different from hot water brewed. Nice mellow tones with no bitterness. Very easy to make. Makes the kitchen (and house) smell really good. \"What coffee is that that smells so good?\" - my daughter said upon entering the front door of our house while making my first batch. She has never commented about any other coffee I have made, perk nor drip. I am a hot coffee drinker so I just heat it up in the microwave which actually saves time in the morning. The stopper which holds the liquid in the brewing container seems kind of primative, but it works.",
        "A barista friend recommended this to me. I’d been using a mason jar cold brew maker for a couple years. Holy moly, I wish I’d went with the Toddy from the get-go! Absolutely zero grinds in the final product, easy to clean if you use the bags, and the carafe is high quality. Ended up buying a second one to keep at the office!",
        "It is expensive. It is time consuming. I found after using this system for a while that I just don't like cold brew coffee as much as I do traditionally brewed coffee. I kept trying because I thought I was doing something wrong but nope, it is just not for me.",
        "This is easy to use, and it makes a very good coffee concentrate. If you want, you can make a large amount and freeze it in ice cube trays. I made coffee for my daughter with this, and she immediately ordered one to replace another (pricier) cold brew system she already had.",
        "The Toddy T2N Cold Brew System works reasonably well for making cold brewed coffee. PROS: The directions are simple and easy to follow. It's more convenient than assembling your own equipment to make cold brewed coffee. Cons: The filters and bottom plug replacement parts are extremely expensive - buying the entire system is only a few dollars more than buying one set of replacement plugs and filters. The filters aren't easy to clean and with multiple uses, the coffee runs more and more slowly through the filter. The jug is very thin, fragile glass and breaks easily.",
        "I like cold brewed coffee. This method and container makes about 7 cups of coffee. It's easy to clean up after brewing the coffee.",
        "Like(s): Makes cold brew as described and is very cost effective and easy to maintain. Dislike(s): Buying filters is a quirk. Buy the brand name filters to avoid frustrating cleanup of torn bags. Because I'm cheap, my work-around to counter the filter bag cost is to carefully reuse the bag. I get 4 back to back batches per bag b4 the bag becomes too weak. Empty filter bag. Rinse bag and disc in opposite flow. Turn bag right side out out repeat brew.",
        "I bought this to save a little bit of money. Definitely use the paper filter things, they make everything much easier to get the most bang for your buck out of the filters, i use a pound of coffee and 9 cups of water. Make sure you use fresh coffee, a corse grind, and filtered water. dampen your grinds for best taste. Put half into the toddy system and half the water. Wait ~10 minutes then put the rest of water and coffee in. Stir it up and let it steep for 18 hours.",
        "Hands down my favorite cold brew system. I highly suggest using with the paper coffee filters for quicker and easier clean up, but it is not a must. The carafe is a great size. My wife and I are pretty heavy coffee drinkers and a full carafe will last us 2-3 days. Great product!",
        "Very easy to use, directions are very helpful. The coffee comes out perfect: tastes great with low acid levels. It may take more time than traditional coffee makers, but the cold brew is well worth the wait. Really nice taste, and it's nice to be able to drink coffee without having to worry about feeling the effects of acid/heartburn. As for the equipment itself, it's very sturdy yet lightweight. Nice ergonomics! Overall, I would highly recommend this to anyone looking for a cold brew maker. Damn fine coffee!",
        "Big fan of the Toddy cold brew system. We make about 3 batches a week. Simple, easy, and produces great cold brew! My husband broke our original purchase, and we bought the same thing again! Highly recommend!",
        "For over a year we have looked at this toddy system and always put off buying it because something else felt more important to buy. Well, after realized how much our household was spending on iced coffees every week it occurred to me that this was a GREAT investment. We have only had it just over 24 hours and we are onto making our second pot. It's easy to use and creates a fabulous toddy that will keep our household high on caffeine for a long time to come. Thank you for such a great product!",
        "I would consider myself an avid coffee drinker. I have a decent manual espresso machine which I use daily for lattes, shots, or individual cups of hot coffee. Before having the Toddy, I really had no way of making iced coffee or having hot coffee ready quickly (the manual espresso machine is a bit time consuming) for when a caffeine boost is needed immediately. While there is nothing incredibly unique to the Toddy, it is definitely a nice to have as it both gives you a brewing area and a storing container for the coffee which work together nicely. We have been very happy with this purchase and have already given it as a gift to others. Highly recommended.",
        "I like the idea behind this system and the cold brew it makes is good - but it leaks!! What a simple thing to get right. I have tried putting the stopper in several different times and with varying force, but it always drips all in the refrigerator. I have to put the container inside a bowl which is a pain and a mess.",
        "This is our second Toddy coffee maker. We bought the first about 25 years ago. Eventually the lip of the pitcher cracked so it was time to replace. We love this system and it makes beautiful coffee. It is simple and a pretty easy clean up. We double brew now and mix the 2 batches.",
        "I've been making my own iced coffee for quite some time. I love cold brewing, but it had a tendency to get messy. This makes clean up a breeze! I don't love having to buy the bags and filters from Toddy as I find them a bit overpriced BUT I'm willing to pay that trade off for the ease of clean up.",
        "Makes great coldbrew with ease. Only complaint is that after steeping, you have to pull the little cork to allow your coffee to drain into the carafe, and there's just no good way to do it without getting coffee all over your hand. But until I can think of a better solution, this works fine! Highly recommend to coldbrew fans!",
        "I’ve used this my Toddy many times now and it’s a must have! I have acid problems, but still love coffee. I read that cold brewing is better than hot brewing for acid. I also buy low acid coffee to use in my Toddy. I can drink my coffee without having so much acid. Super easy to use. I followed the instructions and it makes a concentrate which I then mix with water. Love my Toddy",
        "but lost some of the parts. Find I sometimes cannot drink regular coffee because of the acid but love coffee so thought this might be the solution. Have had a lot of problem with clogged pipes so I didn't want the grounds going down the drain, found an article where the guy put the coffee into large coffee filters and tied them up before pouring in the water. The coffee isn't as strong as I norally like it, and more work then normal coffee. I probably won't switch completely to this cold drip coffee but it's nice to know when my gut can't handle the regular coffee acid, I can still have coffee this alternative way.",
        "Wow! I love this cold brew system. Not only is cold brew incredibly easy to make with this, but it’s very simple and quick to clean. Comes with instructions for making the best cold brew (be sure you have cold brew beans). The carafe is large and comes with a lid for easy storage in the fridge.",
        "There is a reason most coffee websites and blogs recommend the Toddy. It is simple to use and makes fairly large quantities of cold brew coffee. It doesn't get much easier or efficient than the Toddy system. If you want to make cold brew and you want to do so in large quantities you cannot go wrong with the Toddy.",
        "A friend introduced us to cold brew coffee so we searched for the items so we could prepare our own. I thought the directions for use were very easy to follow. My first batch turned out fine. We will be starting a second batch real soon. I need to try grinding my own coffee beans for the next time. It is a much smoother coffee. Look forward to using this for a long time.",
        "Purchased July 2019 and it worked fine for one year, although only used 3 times. I pulled it out again in July 2020 and it leaks through a crack in the plastic at the stopper hole. Very disappointed in quality, especially at that premium price. No information on warranty but left voicemail at HQ.",
        "Used to buy a cold brew everyday but this is a money saver. The system is very easy to use and clean. It also has a top over the carafe to store in the fridge. Great product.",
        "I've tried several systems and found that methods where the coffee is in complete contact with the water makes the best coffee by far. The problem with that method is filtering the grounds from the brewed coffee can be messy and time consuming. The Toddy makes that problem very simple and easy to clean.",
        "This is a great product. We make a batch of cold brew every two weeks for my wife and I. During the summer we would do a 1/3 or 1/4 ratio with water and then add some cream to make a cold brew. During the colder months we use the same ratio but heat the coffee up for a perfect hot cup of coffee. If you are looking for a way to have full-flavored non-acidic coffee this is the way to go! Tip - Don't pack the coffee in or you will clog the filter and it will not drain after steeping. We let it steep for 48 hours.",
        "Using this has greatly improved my acid reflux issues. I no longer drink regularly brewed coffee. Most days I still heat up the coffee I cold brewed but I just heat it up in the microwave. If you have bad acid reflux and suspect coffee might be one of the issues, you need to dry cold brewing with this Toddy System.",
        "All I have to say is, wow! This system is so easy to use. Easy to clean and some of the best ice coffee I’ve ever had. I would recommend buying extra filter bags. They are inexpensive but totally worth it. You don’t have to use them but they make clean up so simple.",
        "I love this thing. I've been making coffee in my French press for years but was sick of the sort of acrid taste that was left over. Nothing like that with the Toddy. The cold brew is smooth and delicious, and it's easy to make iced or hot coffee with it. I've had it for about a month now and I make a new batch every week. Can't recommend it enough.",
        "Very Easy to make your own cold brew at home Great flavor Recommend - Toddy Paper filter bag inserts for easy clean up of coffee grounds when done brewing Glass carafe stores cold brew nicely in refrigerator Would recommend",
        "Excellent product and easy to use. Good price point and quick delivery. Recently got turned onto Cold Brew Coffee and bought this model based on positive reviews. Very simple process to follow - mixing water with coarse coffee grinds then waiting 24 hours till ready. Used Stone Street coffee. The final product as excellent cold brewed coffee! There was confusion, however. The written instructions say wait 16-24 hours at room temperature. Videos say refrigerate for 16-24 hours. I did the former and it was fine.",
        "This makes great iced coffee in a reasonably simple and compact vessel. There are other, cheaper ways to go about it that don't really call for special equipment, but I think this makes it easier and cleaner. I use whatever coffee is on sale--so no need to buy special, fancy beans--and it makes a consistently good iced coffee concentrate. The instructions are a little fiddly: water, then coffee, then water, then coffee. But that's the only reason I removed a star. Otherwise, I've been pretty pleased.",
        "a little expensive for what it is (basically 2 containers and a filter) but good for whoever invented it and is rolling on cash. does the job - makes coffee. was supposed to save me money by keeping my husband out of starbucks but now he just buys VERY EXPENSIVE craft posh coffee for his new cold brew obsession. YAY.",
        "Best coffee ever!!! I was given one of these years ago and liked it but it got lost in moving. Haven't had it for a few years. Been using the Cuisinart Grind and Brew. This is far superior in taste even with the same coffee. I won't be without one again. Coffee ready immediately whenever you want it. And in the summer, it's already cold. In the winter, a few seconds in the microwave.",
        "I bought this product because I suffer from acid reflux and I love coffee. Not a good mix. Then I tried the lower acid brand coffees and had significant success with them; however, the cost of the coffee was a bit high. When I found this product and saw I could use my local brand coffees, I had to try it. It works!...and makes an excellent cup of coffee! Please note: because of my reflux issues, I had to switch to decaf a long time ago. So I can't speak to the effectiveness of this brewer for caffinated coffees. But for those of you who drink decaf and want a low acid coffee, it is well worth the money!",
        "Excellent flavor. Amazon review is correct, it is somewhat cumbersome to use (have to get plug in just right and don't budge unit or it falls out, spilling coffee, step-wise directions to make coffee). Of note, don't worry about how exacting the directions sound - the process is more forgiving than they make it seem (just chuck the right amount of water and coffee in there, even if you don't do it stepwise, it turns out flavorful).",
        "I got this for my mom last Christmas and it is still one of her favorite things. The cold brew comes out super flavorful and smooth. It was easy to figure out as well.",
        "I have been using a toddy for over 30 years and for me it is the only way to make coffee. Even an inexpensive coffee can make a good cup of coffee using this cold brew system. The better the coffee that goes in the better the brew that results. The acid is greatly reduced and so is any resulting bitterness. It is very convenient and the yield is fantastic. The toddy also makes a superior iced coffee. Get a couple of carafes and if you are in to flavored coffee you ready to be on a coffee fantasy come true.",
        "I've been making cold brew in a French press for sometime and have been consistently disappointed with the flavor and consistency. My favorite coffee shop uses the Toddy to make theirs, so I figured I would give it a try. It is SO MUCH BETTER. I am very impressed by the quality of the coffee concentrate it produces and it is very easy to use. I kind of wish I had gotten the model with the extra filters now that I know how well it works, but you can be extra filters separately too. I would highly recommend this product to customers interested in making cold brew coffee at home with a rich, full bodied flavor.",
        "Makes GREAT coffee. Very simple to use regarding set up and clean. I like the glass container. it's a great size for the fridge. Looks nice and doesn't take up much room.",
        "Love the Toddy cold brew system. We use the larger size at the cafe and I thought why not at home. It is easy to use, clean, and saves a ton of money. Purchasing the bag filters makes clean up even easier! Highly recommend 🙂",
        "After about 10-15 uses. The cork will not plug in correctly. A slow leak occurred when trying to brew. Essentially can't use anymore",
        "I'm so addicted to cold brew! I love my Toddy system. It's easy to use, and helps me save money, by making my own.",
        "It was time for a new one, and these are the best. They are a bit technical to figure out at first but worth the effort FYI, the handle is not very helpful",
        "Great purchase. This system is easy to use and the glass decanter is high quality with airtight lid. Directions are clear. Makes silky smooth cold brew. I recommend purchasing high quality coffee beans, such as Stumptown (rather than Starbucks etc) and coarsely grind it yourself. I add a carton of coconut milk and it lasts about a week for me. I've only had one scenario where the filter came loose overnight and had to salvage what I could after pulling the plug.",
        "My sister was a barista and coffee shop manager for years and recommended this system. I bought it even though it was a little pricier than I wanted and it is totally worth it. Works well with all of the different coffees I have tried it with. I can use it for an iced coffee or even add some steamed milk or water for a hot drink. I love this thing and I can't wait to keep using it!",
        "This has completely changed my view on Coffee. I have always had terrible stomach issues with regular coffee; and not just because of the stimulant, caffeine. After purchasing this cold brew system, I will never go back to the high acid content of hot-brewed coffee. No Way! In fact, I found myself contemplating and trying to justify the purchase of Toddy's multiple gallon Commercial Size cold brewer!!",
        "This is by far the best method to cold brew coffee. As soon as a guest drinks a glass they immediately ask me where I purchased the coffee from. Cold brewing gives you a rich coffee without any bitterness. This is a foolproof method of making the most delicious coffee I highly recommend this product",
        "Honestly I never write reviews for products but this brewer is awesome! It makes a coffee concentrate that when combined with water makes a delicious ice coffee. I do suggest that you buy the paper filters because without it clean up is tedious and it results is far less concentrate at the end. Works with all types of coffee beans I find that flavored coffee tastes the BEST. Worth it!",
        "It made my cold brew quite easily... Now if I can just find a nice-tasting cold brew I will be happy. The one I selected was quite bitter. I do think this would be more practical if there were more filters and bags included. You will need to buy more if you intend to use this frequently.",
        "Best cold brew maker. Love cold brew and this maker couldn't be easier. Soak the filter in water and add your favorite coffee. I love the community coffee hickory flavor. Makes a nice smooth cold brew every time. Love the glass carafe for easy storage.",
        "I use this weekly to make coldbrew coffee. It's so easy and so good! Follow the directions! DON'T STIR, not even a LITTLE BIT. The water has plenty of time to wet the grounds, so just let it do it's thing. Trying to get the coffee out of this thing when the filter is clogged is nearly impossible, and it ruins the filter. I let it sit for 24-30 hours. Sometimes I do a full pound, which makes it REALLY full, and sometimes I do 12 ounces. Brew time is the same. I like super dark roasts. Sometimes I mix in ground vanilla beans from Beanilla-so so delicious.",
        "This is a great system to have. Simple and easy to use. My coffee tasted smooth and didn't have to deal with any of the grounds. You can also adjust the taste level by adding more or less water. So far there are no complaints. No major mechanical issue to deal with because it is so simple and easy to use. cleaning instruction, is basically rinsing and storing the prducts.",
        "Works as easily and as well as head advertised. The only reason I have for not giving 5 stars is that the \"system\" is pretty expensive. For about $30 you could get 6 filters (instead of 2) and the plastic top bit from Toddy's website and then you'd be good to go if you BYO glass/plastic jar. I also found that my coffee was stale after 7 or 8 days. This doesn't really bother me but maybe do some more research if you're dead set on keeping your brew for two weeks like they say you can.",
        "My sister loved this gift. She said it is super easy to use and clean. She loves her cold brew coffee and this was a perfect fit for her.",
        "My first batch of cold brew was great, instructions were super simple to follow. Today I went to make another when I realized that the cork plug fell out of its holder and into the trash when I was shaking the grounds out. So just be super sure the plug is secure, or remove the handle before cleaning.",
        "Have used this cold brew system several times and the coffee always comes out great. This system removes most of the bitterness and acid from the coffee resulting in a very smooth tasting beverage. The instructions are clear and the device is easy to use. If only someone could figure out how to grind and transfer the ground coffee without making a mess. But that is a problem even with regular hot brew coffee makers. Definitely would buy this again. Oh, and it is manufactured in the U.S. in Colorado.",
        "We absolutely love the cold brew coffee and this system works very well. I did not give it five stars because the plastic hole where you place the rubber plug on the bottom cracked at the second use. Not sure if my husband pushed the plug too much or not but it cracked really easily! It still works just we have to place a bowl under it as a few drops of coffee drip through (maybe 1/4 cup over 24 hours). This is however the best method to cold brew we have tried so far.",
        "As a fulltime remote employee I can brew a \"pot\" of this once every two weeks and have quick hot coffee every morning just by microwaving some water quickly.",
        "Good product with great flavor if you have 24 to 48 hours to wait for coffee. Takes twice as much coffee as your typical coffee maker.",
        "We have used a toddy for years and just stick a plate on top to keep stuff out as it brews. This is especially required when we stretch certain beans out to 48 hours of brewing.",
        "I have owned this product for about a year now and must say that I use it weekly. It makes an excellent cold brew. Not a single complaint",
        "Back to making real coffee at home. Been drinking instant for years, as my wife didn't like the flavor of most drip coffees, most espresso machines are too much work or else too costly, and the K-cup type machines are great for making money for the makers! Wow - this makes smooth coffee - finished the first two batches within a week, so had to run out to Peet's and buy some more beans yesterday.",
        "My favorite Amazon purchase ever! I live in Hawaii and prefer iced coffee because it’s always hot here, even in the mornings. I only have to make the concentrate every 2 weeks. Clean up is a breeze, and I’m saving money on coffee! Plus no more k cups so it’s better for the environment. LOVE LOVE LOVE",
        "I started using this 5 months ago and have only stopped for coffee a number of times since then. Such a money saver to iced coffee drinkers!",
        "No directions, no cork. Package had obviously been opened. Also could see ring around inside of container, so clearly had been used. Gave as a birthday gift. Very disappointed! No idea if works well since unable to use without parts.",
        "Love this thing. We grind coffee every 2 weeks - this makes enough concentrate to get me and my fiance through that time (although it does get a little stale toward the end). The top does get a little messy but that's expected when you're brewing big batches of coffee.",
        "This is an effective apparatus. I can't say I like the coffee it brews better than other methods necessarily, but it is a nice variation and good for guests who all like their coffee at different strengths. It is hard though to get it hot enough when it comes out of the fridge, even when adding very hot water directly from the espresso machine wand.",
        "Functions well. One of the better cold brew makers. I’m very happy with the product but there’s certainly some design and durability questions, specifically with the removable handle and thin glass.",
        "I LOVE iced coffee, but found it difficult to make with a pitcher and large sieve and coffee filters. The TODDY T2N makes it's so much easier. I have had it in constant use since my purchase. I followed the directions, using fresh, coarsely ground coffee. I hardly ever drink hot coffee any more. I just had water, ice and a little bit of sugar free caramel or vanilla syrup.",
        "I’ve had Toddy for three months. The process makes fine coffee yet nothing exceptional. What really stands out is the THIN glass carafe, flimsy plastic handle, and no lid. When the cheap glass carafe breaks I will try another system.",
        "I am a lover of iced coffee, so I know I had to pull the gun and buy this. This system is super easy with great instructions on how to make cold brew. I love the container that it comes with to store the cold brew because the lid is air tight. I've used the filter about 3-4 times now and so far it's been great. It comes with an extra filter as well. I will be continuing to make my cold brew with this.",
        "Makes it so easy and saves so much money and the decanter is cute so win win win",
        "This is the absolute best way to make coffee. The gadget, however, could be higher quality. I am not a fan of soaking anything acidic in plastic due to health concerns. And the price for something made from plastic is nuts. It also could be designed so that it looks nicer. Has to sit on the counter. Be nice if it was beautiful.",
        "Purchased this as a gift for someone who had mentioned the waste of coffee made and not consumed each morning. I've owned my Toddy for over a dozen years, make the concentrate and have coffee on demand, with no waste. It is great for iced drinks and the exotic blends that sell for big bucks at the coffee shops. I use my concentrate, chocolate syrup, vanilla, spices etc - and leave the house with a grande of choice while saving money.",
        "Best purchase this year! I make a batch each week and drink cold brew throughout the week :) Its been great during quarantine and moving forward I won't need to get iced coffee or cold brew from any coffee shop! Love it! 100% recommend!",
        "Other reviewers have described the system and how to make the perfect toddy. The quality is acceptable in this combination of plastic and thin glass. Price is commensurate. It makes the product as expected. A bit work intensive, more coffee grinds used than hot drip process. Delayed gratification for 12 to 16 hours or longer, depending on how concentrated and bold you like your coffee. I shall not give up my espresso maker any time soon.",
        "I love this whole set up. It’s so easy to use and clean up is super simple. Only draw back is that it does not come with a lid. I encourage you to purchase it separately, as having it does make a major difference with flavor and freshness",
        "As was listed in numerous reviews - our toddy split on the drip hole, as well. Constant drip when cork was put in. It appears that the current model is made from a cheaper thinner plastic.",
        "I used this exact system when I ran a coffee shop and I love it.",
        "each cup of coffee we drink out side the home is a toddy appreciation cup of coffee. the cold brew flavor is out of this world clean, flavorful and easy to manipulate the strength. I wish it was less expensive because we'd gift everyone who enjoys coffee w/one of these toddys lol. we highly recommend you purchase more stoppers and filters right away",
        "This is a great product for those of us who love the taste of coffee but not the bitter stomach that comes from it. Instructions state 12 hour drip with coarsely ground coffee. I found the best brew to come from a drip grind and 24 hour brew. Also, I like a 50/50 ratio as I like my coffee european style. Once you get the process down, it is not cumbersome but if you like a really hot cup of coffee a microwave heat up is necessary. It is now time for me to order another filter as my first one has had seven brews and I will use my second one.",
        "Bought as a gift for my friend who absolutely loves it and says loves having consistently excellent cold brew!",
        "It is a great product but he plastic had a crack and now a leak. Had to throw it away. Going to have to buy another one. Kind of a waste but I need one so yeah...",
        "We love the toddy coffee. It's important you use a \"course\" grind of coffee bean, and although it's not as economical as drip coffee, I like STRONG coffee and with so little acidity :) This cold press coffee is worth it. Let grinds soak overnight, then drip coffee concentrate into pitcher in morning. Dilute with hot water, or milk, cream...whatever your preference. This has made a tremendous difference on lowering the acidity in my body. Great purchase.",
        "I’ve used my new Toddy a few times and I found the instructions easy to follow. The concentrate was delicious and stayed fresh for the few days it was stored in the refrigerator. I don’t have faith the thin glass carafe will last long in my house but here’s to hoping!",
        "Have been using this for a couple years now and couldn't be happier with how my coffee turns out. Once you have cold brew there's no going back to auto-drip. The flavor is pure and good enough to drink black."
    ]
}