{
    "entity": "Subwoofers",
    "text": [
        "Glass shattering bass. I have not had the cutoff problem that some reviewers have reported. I put both the frequency range and volume up to almost max and then ran the Onkyo amplifier auto sound equalizing setup with the new subwoofer installed. What a difference in the sound quality. It’s been only a day but the audio quality of hi fi music is vastly improved...noticeably so.",
        "Great buy for the price of this awesome subwoofer! I'm posting some backside pics here because there was none when I was browsing before, because I wanted to see the backside features of this subwoofer. So far I like the automatic shutoff when there is no bass signal from the receiver.",
        "Replaced my Polk PSW10, because my cats had damaged the speaker cone. This Onkyo is much better! No more low frequency distortion like with my Polk. The feet are rubberized instead of the cheap plastic feet on my old sub. Definitely worth the extra $20 or so dollar upgrade in sound.",
        "well it worked great until it caught on FIRE I was listening I was in other room heard my bass go out went to investigate and found it on fire there were no storms contacted onkyo they want me to send to mich for warranty repairs at my expense I tried to explain your not fixing this its less than six months old you need to send a box and a label and figure out wtf went wrong not to mention the hot plastic that burned my carpet if I would have waited five minutes my house would have been on fire I threw it out back door and hosed it down after snapping a couple shots",
        "This sub is for a low-end system. The main issue I had with mine was the auto-shutoff. It happened way too quickly and there is no way around it. Most subs do have an auto on and an on, but this lacks both--it's just auto on. Then, I had a defective sub, because when the sub went from auto off to on, it created cracking sounds--like soft firecrackers. I ended up returning it two days after receiving it. Too bad, because I love Onkyo products generally. Go with Onkyo's THX certified sub woofer. It is a fantastic sub!!!!!",
        "Inexpensive but it fully compliment my 7.1 setup in the living room. without it (the original one was broken by my kid) the music did not sound natural and the action movies felt radiophonic audio quality, means BAD. Now when I come back home, Smartthings senses my arrival at home so my Yamaha receiver turns on and the light on the Subwoofer turns green and sounds are so natural as they would be outside home. Some users complained about the light turning red as soon as the programming is stereo or receiver is off. I do not mind as I am sure the subwoofer works fine.",
        "I am using the sub with an Onkyo TX-8220 receiver and a pair of Infinity bookshelf speakers (6.5\" woofers and 1.5\" tweeters). I mainly run TV audio through this system, and it is spectacular. The Infinity speakers by themselves delivered very good bass. Adding the sub took the audio to a whole new level. All those bass notes and rumbling sounds in movies come through beautifully. I highly recommend this subwoofer. Incidentally, I haven't experienced any of the problems or annoyances that other reviewers have described. For me, this product works perfectly.",
        "I got crackling noise on previous brand new 230w Onkyo even in very low volume. It was busted on arrival. I ordered a replacement. The replacement one is a little better. It does not have crackling noise at low volume, but you don't hear good bass, turn on volume to 35%, it starts to have crackling noise, a little more at 40%, you have all crackling noise with the bass. I cannot stand the noise. It is a defective item again. Onkyo makes 230w subwoofer with a very weak, and low quality speaker. I will return it.",
        "OMG! Talk about BASS! This thing is turned down to about as low as it goes and it still bumps when I am watching a movie? Even at the lowest setting music is insane. If you turn up the bass, sounds like some systems you hear in cars that bump super loud.",
        "I've been looking for a subwoofer for some time now since my built in woofers in my twin towers went to static mode. Finally reviewed stats and read reviews on this one and took a chance. This SW delivers great sound and appears to be of great quality. I am enjoying my movies again!!!",
        "After going to two different Best Buys to pick up a subwoofer, I finally just went to Amazon. Found one the same brand as my sound system, better quality, and on sale. I don't know why I bother going to Best Buy and probably will not in the future,",
        "Using this in combination with a pair of Pioneer SP-FS52 floor standing speakers in a 12' x 18' room, mostly for watching TV and sometimes for listening to music (rock, jazz, classical). The subwoofer performs and sounds great! I really like having the frequency adjustment control on the back, between that, the volume control, and the phase switch, it can really be dialed in for a great sound.",
        "This bass system is fantastic. You will not need to turn this to full volume, you never will. I'm pretty sure that it will rattle everything off of the walls and annoy all your neighbors, even if they are not sharing walls with you.",
        "This unit replaces an older Onkyo 10\" down blast sub. The older one has treated me well for over 12 years until she gave up the ghost. In comparison this newer unit has 15% tighter base. So the skw204 sounds superior. Hopefully it will last just as long.",
        "Speaker has great sound. Controls where good to have and easy to adjust. Unit is big and heavy but that is what is needed for a sub bass speaker",
        "Beautiful piece of electronic engineer, however, I feel it is too big and the grill is not to be removable by the consumer and the fuse is to be changed by skilled technicians only. It sounds excellent in my music room along with two shelf speakers to complete the set. You can change the frequency from 50 Hz to 200 Hz (I believe) and gets into stand by mode shortly after no signal is received anymore, then the led turns red; turns green immediately after a signal is received. Nice but not so practical due to the issues already mentioned but great sound and enough power to shake your home.",
        "The only thing I don't like about this is it \"pops' when it comes on and only comes on when the volume is load enough. Sounds great though.",
        "Bought 2 of these for my home theater based on the reviews. I have a Denon 4400 AV receiver, after hooking everything up and calibrating it with the mic, decided to watch a movie and both of them during action scenes where just rattling like crazy. The volume on both of them were about half way or less so it shouldn't be maxed out, maybe my bad luck i got 2 bad ones, maybe the room is too big but it shouldn't be popping or rattling.",
        "I bought this sub woofer to replace the one which came with my onkyo 7.1 system. This has been a pleasant surprise in sound quality and overall power. Good speaker.",
        "Product works, and this isn't worth returning, but I could use a very small amount of black paint to paint over where the wood was broken and dented.",
        "This is a phenomenal subwoofer! The LFE is absolutely amazing. I really like that the sub takes up so little space. Most 10\" subs are much larger than this Onkyo. For the owners that said they have the sub switch off and on frequently: Just turn the volume on the sub itself down lower and turn the subwoofer level on your receiver up higher. This will send a constant LFE level to the sub so it will always stay on. You can't beat this sub for the price and as always, Amazon is outstanding in their delivery, free shipping and customer service! Way to go Amazon!",
        "This small subwoofer truly ads depth to your music or movies, put this in my new basement billiard room to augment the space . Just wish I had run rear speaker wires for 5.1 .Great speaker would buy again",
        "The Onkyo SKW204 is the right subwoofer to complete my Onkyo CS-445CD mini stereo system, The CS- 445CD sounded very good on its own, its clear sharp with a lot of depth but mellow sounding. But wanted the best sound possable, so ordered the Onkyo SKW204 subwoofer to fill in the bottom octaves the subwoofer is totally adjustable from the controls on the back, it took less than a min to balance it to the speakers that come with the CS- 445CD. Happy with it before, but by adding the sub, am even happier, easy to hookup an balance this system!..........walter",
        "I was looking for a little more punch in my system. All my equipment is Onkyo and I have five JBL Northridge series speakers. Although speakers are supposed to be matched, reseach turned up that it was not necessary with a subwoofer which really worked out to my benefit as all the reviews I read on the JBL subwoofers in my price range had very poor ratings. So I decided to look at the Onkyo, the ratings were good and I could see (or should I say hear) why. I am very happy with the choice I made and would recommend it.",
        "My previous subwoofer died and needed to be replaced. After looking at the reviews I chose the Onkyo SKW204. It is slightly more powerful than my previous, but you would think it is 3 times as powerful. After the EQ I still turned down the bass volume. You can actually feel the good vibrations. My son said he can even feel it upstairs in his room. It works better than I expected. It also arrived 2 days earlier than promised. Also a great shape, not square like many of the others and looks more appealing in a room. I would highly recommend this subwoofer.",
        "Bought to replace the original that came with my Onkyo 7:1 surround sound system (power supply failed on that one after about 7 years of use). The card board sound tube (behind the round opening on front face ) came loose during shipment and was laying in the bottom of the subwoofer cabinet, but gluing it back on was easy. This is why I'm giving 4 rather than 5 stars; not very sturdy as it's suspended from front panel with no support. For the money though I really like Onkyo products.",
        "This powered subwoofer is an amazing value for the price. It easily provides bass-filling sound for a large room, and greatly enhances the movie viewing experience. It nicely complements my Yamaha receiver. Volume control and crossover adjustment are provided on the rear of the system. It looks great and sounds terrific. I wouldn't hesitate to recommend this to anyone looking for a great performing subwoofer at an equally great price.",
        "The first subwoofer would not work. Amazon customer service is wonderful. I had a new one within a couple of days. The return went flawlessly and they made it quite easy. UPS came to my door to pick it up. This subwoofer has great sound. It is very large but we were able to put it in an out of the way place. I never added a subwoofer to my system but am quite glad that I did. Didn't realize what I was missing. I have all Onkyo components so didn't hesitate to buy from them. I feel they have a great product and their customer service is very helpful. I would recommend it.",
        "Awesome sound connected to my onkyo reciever. Dolby Atmos set up for gaming.",
        "I purchased this unit reluctantly only due to 2 reviews by apparent experts. All I can say is ignore them. They would not have had the complaints they described had they read the operating instructions! This Sub is definitely the best bang for your buck! The only complaint I have is that the instruction should be much better. Adequate if you are a techie but not near enough for most of us. To the \"expert\" that had problems with automatic /standby/ shutoff......... you read nothing did you? Lee",
        "I bought this to enhance my Bose Accustimass 7 speaker system because the sub that comes with this system is passive and didn't have enough bass for me when watching DVDs. Luckily my receiver had a separate output for a sub. I hooked it up last night and put in the Lord of the Ring DVD and WOW! I'm very impressed. I haven't done any adjustments yet to see how they sound with more power or different crossover settings. I'm pretty happy with it right out of the box! It fits my media room just right for a great movie theatre experience.",
        "Too say this was a uses item it looks brand new. I love it!",
        "I purchased this subwoofer as a replacement to my already existing Onkyo home theater system. My system is about 5 years old and the sub only went out because my youngest son kept filling the internal chamber with toys. This sub was an excellent replacement and has only improved the quality of my overall system. I use awith it and after adjusting it to balance with my other speakers, the quality is amazing.",
        "This has performed better than I expected. In fact, I will have to get better front speakers to balance it a out. A little over kill for the space that it is in but it sounds incredible.",
        "These subs offer impressive sound quality and quantity for your dollar. The features are great and the size is reasonable for the output.",
        "I give it a 4, because it is an adequate sub and excellent amp... and by that I mean... the sub blew after a solid 30 minutes of hard thumping... so I threw a kicker 10 250watt Rms car sub from Walmart in it, and now it flexes the bejeezus out of my bedroom window... So just tweak it and it's amazing (;",
        "Good addition to watching movies in my garage. It fluttered a little with some higher sounds. UPS delivered it and the corner of the box was smashed. It left damage to the corner but being I put it in the garage I keep it. This could of caused the vibration.",
        "I love it so much, good quality, very heavy, excellent bass sound. now I have two of them.",
        "Very very good subwoofer, does what it advertised etc. Positive reviews didn't lie! I was looking for a down or front firing subwoofer which is why I originally went with the Acoustic Audio, and Theatre Solutions 10\", but they were junk! So, short of what I wanted in astectics, this sub does the job,easily!",
        "Fits perfect for our space and more than ample power and quality to give you that total theater experience!",
        "I have owned this product for about 2 years. I have used it in a mid size living room along with the polk rm10 and onkyo 606 receiver. I was very disappointed in the onkyo receiver but this sub has done a very good job and puts out plenty of bass for my use. I normally watch bd and listen to rock music with my home ent sys. If there is one thing I don't like about the sub it's that it has a small light on the front of it that is always on when in use. I wish more of my home ent sys did not display lights.",
        "Work very well with my system a great ad on",
        "Best value as an exact replacement for the subwoofer that came with my Onkyo 7.1 system. That lasted many many years of daily use, I just finally blew it out. Sound quality is great and I expect easily another ten years or more out of this one as i like my bass cranked up. Super satisfied.!",
        "Used as a replacement for my Acoustics Research sub that came with my Onkyo system. Had to spend a lot of time tweaking to get it to sound good. It has more wattage that the AR sub but does not pack the punch that I expected. Still a good replacement sub for my old sound system.",
        "Been working for a few years now and I have been happy with the sound and quality in our 12x14 entertainment area.",
        "This thing just puts out such a natural low-end sound. I never looked too deeply into the speaker and amp specs of this, but the parts sound top notch. Cons: only reason for only 4 stars is the auto-shutdown which seems useful, but basically makes the unit make strange noises at random times (when it shuts off, then when it kicks back in). Seems to be they would have been better not implementing this feature. How much power are you really going to save??",
        "i am very pleased with what i got for the money i paid. i put one in each Corner teamed with my New 9.2 Onkyo 900 watt receiver and i am very pleased. Best DEEP base my Home Theater system has ever had to say the least. this all teamed with MY 82 Inch Mitsubishi 3D - HD TV is one awesome set up. i may never leave home again :-) Kenny \"Starmaker\" Bolin",
        "This subwoofer is a ton of power for the price. I looked at similar priced Klipsch and Polk Audio, but this one had way more power than similarly priced ones made by other mfrs. This one has been great. I love that I can configure it once and its ready to go. You may want to second guess this if you live in an apartment.",
        "as expected, onkyo has delivered an excellent audio product. easy set up. not too big/obtrusive. fills my very large/open family room av set up (onkyo TX-NR708) with glorious bass. i debated for quite some time whether i should spend hundreds of dollars versus purchasing this model...my more frugal side won out and my ears/wallet are very pleased. highly recommend.",
        "Awesome sub.... I actually have to keep the volume down a tad since it has the tendency to cause everything in the house to rattle (in a good way)",
        "Auto shut off work around for the technically inclined. Grab the service manual here  Review and understand page 9. \"Short test point P631 for amplifier is under active mode\" Worked for me but use at your own risk.",
        "Serious bass response. Seriously. The little green light in the front tells you the sub-woofer is powered on. That's a small thing, to be sure, but it does remind you to turn it off when not in use. Its amplifier will last indefinitely that way.",
        "Sound quality is great we enjoy it specially when we play action movies",
        "I don't dis like them at wow the sound is so good.",
        "Onkyo what else needs to be said!!! Great sound to complete my 7.1 system. You would really need to hear it to appreciate the true bass that this little monster puts out. I was always a Cerwin Vega person until I purchased my first Onkyo 5.1 1100 watt system. It blew my mind and the windows out. When it came time to upgrade there was no deciding \"Onkyo\".",
        "The sub performs beautifully under heavy bass load, especially once its broken in. I have the sub in a small room (12x15), so it fills it pretty nicely. If you're not near the opposing corner from the sub then the bass isn't tremendously powerful but its presence is definitely still there. The box feels substantial and looks good, it doesn't feel cheap. Overall I'm impressed and pleased with the purchase. Its a great deal and adds a lot to your sound pallet.",
        "I have it in a deck box under my deck to keep it weather proof. Provides incredible sound combined with my Polk Audio outdoor speakers. You'd think you're in my living room.",
        "Works great and fits right in with my existing surround sound system. My previous subwoofer started making hissing and crackling sounds. This one sounds great!",
        "Decent sound and worked perfectly to replace a sub that had stopped working.",
        "You can't find Tune the Base, To Much Base you get a loud Rattling Sound, Especially when in Reverb Mode, Not Very Impressed for the amount I Paid, and the Cable I Bought just for the Power Base doesn't Fit All that Right Eather!!",
        "This little sub is just ok - doesn't have a ton of power, but sounds ok at low volumes. Expected a little more from Onkyo",
        "Got this on sale for 100 bucks. Couldn't be happier. I have a cheap Pioneer surround sound system that came with a 5 1/4\" or 6 1/2\" passive sub that in no way puts out any bass. With this Onkyo sub, I barely turn the gain and frequency up and I've got the whole house shaking with quality bass. I highly recommend this for those like me that bought a cheap surround sound system. BTW, our living room is 19' x 21'.",
        "Spent all the AV money on Def Tech front, center, rear speakers and a Marantz AV so I was looking for a temporary budget sub as I wasn't in a position to spend $400+ for hi-end sub. I am very happy with my purchase and will continue to use this sub until I upgrade to a Def Tech. The low bass that this sub produces is actually pretty good for a $100.00 sub.",
        "It sounded great but it broke just very short time after the end of the warranty.",
        "Already have one that came with a set I bought a few years ago. This is to provide a 2nd sub woofer to my home theater setup.",
        "I bought this unit for my 7.1 surround system and having recently purchased a receiver from Onkyo I found that the price was good for what I wanted and the size was good for my home theater room. So far I have not been dissapointed by the performance of this unit. It handles very well the low ranges encountered in movie soundtracks, as well as 5.1 surround satellite HDTV programs. NO complaints so far. This unit packs a punch for it's size.",
        "I received my onkyo SKW204 subwoofer today and connected to onkyo 509 receiver. I am so happy with the quality of this subwoofer which I replaced with a polk audio 8\" subwoofer. It's definitely an improvement going from 8\" to 10\" subwoofer. Unused standard settings for this subwoofer and did not have to make additional settings.",
        "Great sound. Just don't like the 2 second delay when you turn on your radio before it to pick up the signal to get the bass going",
        "We replaced our old surround sound system with components, and we needed a new sub woofer. I found this product, saw some reviews, it had a great price, so I said why not. It has awesome sound, and is easily able to be controlled. Love it!",
        "Great sound that fills in what was so desparately missing. Great low bass, no rattle or vibration noise. Easy hookup to my Onkyo receiver. Audessey dialed in the sound just right. Oh, and the price was hard to beat.",
        "Nice tight bass for a small project I am building. Price for performance is very good. I took off one star because the first unit I received was not working and had to send back. Seller was easy to work with on this issue and I was very pleased with how it was handled.",
        "It does the job well, at this price I wasn't able to find anything like that. Paired it with Onkyo receiver as well.",
        "It is so nice to have a working sub again. So far I love this sub. Plenty of chest thumping bass out of this! Definitely happy with my choice!",
        "This subwoofer looks good and sounds great. It goes back deeper than it appears to in the picture. The dials on the back are handy for controlling the volume. Watching movies is so much more fun now with the new sub. I keep mine at about 25% of volume. 50% or higher rattles things in the house!",
        "This sub woofer does sound good. But is a little boomy at first and is easily fixed with the adjustments on the rear. The only dislike I have is the auto standby, it kicks in a little soon and when it comes back on it sometimes makes an annoying thump.otherwise I really like this sub.",
        "Still working 5+ years later. Very happy with this purchase.",
        "I've always like Onkyo products and I bought this one with out hearing it. It does good at low levels and even in some louder cases but occaisionlly the cabinet will rattle if you want really heavy bass. The price was great and I would recommend it if you are not going for extreme volumes.",
        "Can't beat this for the money. In our home theater room paired with Infinity Primus LCR and rear speakers. I like the smaller footprint and it has plenty of power and nice tight low end for home theater use. Highly recommended.",
        "My parents upgraded their TV and speakers over the holidays. They bought everything...except a subwoofer. That's a crime in my book so I ordered this one and had it there in two days. Amazing sound. It's taller than we expected but that didn't really bother him.",
        "I love this sub woofer but this is my second one the first one just stopped working I have not had a chance to get it repair or checked I took it to Best buy but they could not fix it or check it the closest place is in charlotte NC two hours away",
        "Had it for a month or so now; good speaker for the price; nice bass. I bought it as a replacement for an older model Onkyo sub-woofer that died (probably due to abuse when moving, so not Onkyo's fault), and it hooked right up.",
        "I've owned this for a couple of years now and it is wonderful! It fills my basement theater with deep, clear bass. I love that it automatically powers on when it detects audio input and turns itself off when finished--nice touch!",
        "This was a gift for my Daughter and Son In-Law. The love the sound and the power saver mode. If I didn't already have a Matched subwoofer that came with my Onkyo speakers I would have bought one for myself.",
        "if this ever gos bad, trust me i will buy this same unit again......2 years now ........love it",
        "Best subwoofer I have ever bought .At A 1/4 power shakes the hole room witch is 25 buy 20 feet love it",
        "Much louder and cleaner sounding then the 10in polk I was using psw10",
        "The picture simply doesnt do this justice .. Its huge .. Very attractive unit made solid and obviously built to last .. Comes with everything you need ... Love the controls on the back .. Xrossover around 120 lvl around 3/4 max and prepare to be thumped .. I read others saying this rattles at high lvls .. dont believe it The only rattling will be the knick knacks on the shelves and the walls lol ... This is an awesome unit ... Just remember its MUCH larger than the picture suggests",
        "This powered sub is an excellent choice! It works great with my home theater set up and also sounds fantastic while I listen to Music. Onkyo did a great job with this subwoofer. For less than $200.00 you will NOT find a better Powered Sub.",
        "This subwoofer is a verry high preformance subwoofer for the price....... Nevermind it is just awesome. It can really crank out though deep octives, also with the frequency changer you can make it do the high bass sounds......... Sounds like it dosen't make sence but it dose. It was shaking my whole room and everything in it, a beast sub. Also one funny thing it shuts off when theres no bass in the song at verry low volume. And the grill never makes funny noises, it prob the stuff around it shaking out of it mind...............overall GREAT.... Ohhh i forgot something, its really big you will be happy:)",
        "This sub is just great and a wonderful piece to add to any good system shakes your seats.",
        "This is an excellent budget subwoofer that is easy to install/configure and sounds great. I have it attached to an Onkyo TX-SR707 receiver and the sound output is excellent for a small-medium sized room. Very easy to set up. I started with the output volume fairly low (below 1/2) and raised it up a bit as I tried different movies.",
        "Super quick delivery and the sub is even better then I expected! Its worth triple what they sell it for. Thanks and I'll be shopping again with you soon!",
        "I bought this in April 2013. It stopped working in August 2014. The light comes on, but no sound comes out at all. I primarily use this for movies, but occasionally for music. I replaced another Onkyo subwoofer (this is what they recommended). I guess Onkyo's strength is not in there subwoffers.",
        "Excellent value! Excellent base response, love this sub! Brought a whole new sound to my surround sound! Operates as designed and sounds great!",
        "Excellent as always with Onkyo products. One issue I do have is that the woofer turns itself off when bass signals are too low, which happens often.",
        "My system rocks!! Adding this subwoofer just took my surround sound to another level.",
        "Very powerful subwoofer. This can rock the house if needed. Highly recommended and this comes from a person that has three other subwoofers in the house.",
        "Nice bass sound that you can adjust to the right mix with your home theater. I don't regret buying this product.",
        "I use this sub-woofer with an Onkyo TX-NR616, and it sounds great. It's amazing how the sound is so much more alive with the sub-woofer on. A nice feature is that it goes to standby when the sound level is lowered below about 27db if others don't want to hear the output.",
        "I had a very similar model that came with my HTIB package. This one is much more expressive, and has an added frequency crossover knob that my original one lacks."
    ]
}