{
    "entity": "Subwoofers",
    "text": [
        "Sounds great, can't beat the price. I listen to blues and classical, so just needed a bit to fill in the bottom end. Folks into heavy thump might be disappointed. If I ever need a kidney stone dissolved, I'll turn it all the way up and see what happens.",
        "I don't know enough about electronics, I was tasked to find a new subwoofer for our new stereo system, after reading all the reviews, I chose this one and all I can say is WOW! What a game changer. It's much more sleek and hot looking than that picture, puts out a mean bass sound for music and surround sound. My husband loves it, and that's all that matters.",
        "While cheap, it doesn't really add to a desktop or small stereo system as there is serious port noise. Tried with two different subs of this model. The first sub had a hum and didn't auto-off. This one (2nd attempt) distorts at any volume at low frequencies due to the port design. To really see how the port fails, try 'Fading Sun' under the Winder Songs (icemusic) album by Terje Isungset. Either the sub has an issue with quality control or it isn't designed for the lower-end frequencies and should limit. Shame. Will be returning.",
        "Seven months of use playing easy listening music at low levels and the speaker has a load hum and then continues to blow fuses. Not a very good product. I know it wasn't expensive and it has a good warranty, but why can't it just work for a long time? Why do I have to go to the trouble to get it replaced or repaired. QA is lacking, built in quality lacking, just lacking all around. Will look for a replacement subwoofer from another company. First and last Polk Audio purchase.",
        "Beyond-impressive. I mated this Polk PSW10 to my Sony STR-DH790 AV Receiver, totally straight-forward RCA-to-RCA connection. Installation took 3-seconds, configured the pass-band and auto-ON switch, configured the volume, and BOOM... everything worked perfectly. GREAT lows, beyond just hearing or feeling a thump. I have a fairly-large media room, and this subwoofer just fills the room no matter how it's positioned / pointed. Plus, it's kind-of pretty for a speaker. You can hear this down the street (through closed doors and windows) when we're intentionally trying to thump. Was easy to equalize the lows to the rest of my system. Beyond thrilled!",
        "This thing blew my expectations out of the water. I knew it was going to be a good purchase, however it outdid what I needed it to do. The bass can be adjusted really well. It can be heavy & punch while maintaining a super clean deep sound without distorting. Alrhough the box is big & somewhat heavy, it is incredibly well built & the finish on the cone is absolutely gorgeous.",
        "Expected much more from polk ,very disappointed, just didn't want to bother with returning it, probably give away in a fee months ,just expected better sound form polk ,it barely pushes out much bass at all ,dont buy this one",
        "Product died 2 months after warranty expired. But that's not what bothered me. The fact that I only use the product for such a short period of time, like I did not get to enjoy it. I'm not home much and only use it like once a month. I should have gone with Bic America. They have 5 year warranty on the whole sub. Customer service wants $150 to replace a board. Like half the price of the sub I didn't even use that much.",
        "With only 50 watts RMS on tap I had my reservations, but the 6.5\" sub that came with my Pioneer sound bar left a lot to be desired. The difference was immediately clear. This thing is legit. I don't think It'd cut out for a true home theater in a large room, but in a living room application where shaking the windows aren't a priority, it's perfect. Relatively compact with solid build quality and a nice, clean look - not a cheap look like the theater-in-a-box subs. Sound is much deeper and fuller, makes everything sound much more convincing. At the $100 price point, I couldn't possibly recommend anything else. The value is unbeatable.",
        "First off, for under $150 this is one heck of a deal. The bass is strong, punchy and fills up my 15x20 open room with 12 foot ceilings nicely. As long as you place this subwoofer appropriately and adjust the volume(less is better) to match your speakers, I'm confident that you'll like what you hear. I gave this 4 stars because the auto on/off feature is completely unreliable. I've had full songs play, with bass tones throughout, only to have the subwoofer remain inactive. It'd probably kick on if I raised the volume but I shouldn't have to do that. Fortunately, you can just turn it to always on, which is what I do.",
        "EZ to hook up. Understandable documentation. It actually does have documentation. Rattles the room. It is in a small room (about 9x13) but it fills all the rooms on the floor with no trouble and is too loud upstairs unless I turn it down, so I don't know how it would fill a big space, but I can't even turn it up half way without rattling things off the shelves or upsetting people upstairs. It makes the sound from my tuner way, way deeper. I was nervous when I read some of the reviews, but it has been, so far, beyond my expectations. I didn't think it would be this good!",
        "well as the thousands have reviewed this sub before me I can only say that everything that was said is true and then some. I have been thru 3 prior subs in the 200-300 price range and the polk does not disappoint. I only use the sub mostly for music and along with my polk RTI bookshelfs in a 2-channel system this sub is fantastic! no regrets here! lows are deep and not boomy and overall sound is superb. just enough to take my music to the next level. more than enough without breaking the bank. thanks polk and amazon!!",
        "After 3 months of use I will simply state that for the very low cost I got this for, this PSW10 is a well above average sub. I set up a 7.2 home theater system after finishing my basement. The powerful Velodyne sub I already had just needed a compliment to really fill out the sound thruout the area and this Polk Audio PSW10 fit the bill perfectly. It's seated diagonally across the room from the other sub. Excellent controls to adjust to personal preferences and clean, rich lows with tight punch. Definitely a thumbs up!",
        "I had an audiophile quality speaker system that finally quit on my after 40 years. At this point in my life, I don't think I could even tell the difference between the old subwoofer and this one. That one was 12\" and this one is only 10, but I'm getting as much bass as I need. Back when I bought my old system, you could go to any stereo store and audition everything, whether it was a high-end system or just the standard mass market brands. I was a little shocked to find out that you can't do that anymore, so I had to buy these just based on the recommendations. I have no regrets.",
        "I know this is a budget subwoofer that has been marked down significantly from the original price. I think the original price listed is too high. It seems to be really boomy at a very narrow frequency range. I know you don't get much for this price so it might be a decent deal considering that. However sometimes it's worth throwing more money into something for better quality. I'm torn over rating it poorly because it is underwhelming or rating it well because it's super cheap.",
        "Really love this 10\" powered subwoofer. It sounds so much better than the 12\" passive subwoofer it replaced. It takes some good program material to reveal the real difference. For example, on progressive rock material like Yes or Pink Floyd, the bass guitar clearly separates from the kick drum for a very accurate reproduction of the original. This subwoofer pairs well with Polk columns on my system. A new Yamaha receiver drives the system with ease.",
        "So happy I upgraded to the Polk Audio PSW10 10\". I literally plugged it to the headphone jack (which is also a sub out) of my Sony 4K TV with a RCA splitter and it works like a boss (No need for receiver) paired it with a bluetooth speaker so i can have it close to my ears, It complimented each other so well...watched a terrible movie with awesome visual and sound track and it just out performs the cost of this sub...I would pay 150 and still be very happy and impressed with it. For $90 it will make you smile",
        "I use it in my bedroom and have inexpensive but high quality sounding speakers (probably because I don't blast them with full wattage). But added high-end tweeters and needed a decent inexpensive subwoofer. THIS PUPPY ROCKS !!! It upgrades my sound system several notches. Again, I don't put it on full wattage BECAUSE IT WILL BLOW SOMETHING APART !!! Fully enjoying it and fully unexpected.",
        "This is a highly reviewed unit, but I think it makes too much electrical noise when plugged in. When the thing is pumping out music, no problem at all. But mine is in a studio and when things are quiet and I'm working on a project, I hear the hum of electrical energy going into it. I tried to send it back or get it replaced, got the runaround about taking the thing apart and from the company. Not gonna do that - so I endure the humming. Since the sound is good, perhaps worth putting up with - but know that it will make some noise when plugged in.",
        "Worked for a few minutes, then a pop noise, then no power. Researched online and found many similar issues. Turns out there’s a slow burn fuse inside the unit that will just keep blowing, no known solution. Recommend you pay more for a higher quality subwoofer.",
        "First things first - this is a BEAST. I was not really prepared for its volume, size-wise... for some reason I thought the photo made it seem like more of an 8\" sub box, but it is the real deal 10\"...and the box to go with it. But then when you move past the issue of 'where do I put this thing?' you set it up, and it is HUGE when it comes to sound. It challenges my 3x more expensive Polk for clarity, depth, and sheer sound power. If you just need a sub for music or home theater and don't want to pay audiophile prices for huge sound, do yourself a favor and get this one.",
        "I have owned many subwoofers from many brands - SVS, Paradigm, Klipsch. I have multiple hometheaters. For $100 this is the absolute best subwoofer you can buy! Of course its not perfect, wont rattle the walls and floors, wont ultra low frequencies. But for compact theaters and small rooms its perfect. If you **can't** afford the $200 Polk PSW505, then get this one. On occasion the price for this sub has dropped to $80, then you should buy two of them ! But the Polk Audio PSW505 is better than two PSW10's but only if you can afford $200.",
        "This sub make a big improvement to my sound system. I had a cheap surround sound setup with a center channel, 4 satellites and a pass-through non-powered sub. Rewiring for the front satellites and installing this made a big difference to music and movies. It took me a while to get the gain settings where I liked them between the back of the unit and my receiver. Once I figured that out it was a great improvement for sports, movies, and music. I would recommend this to anyone with a similar setup as me.",
        "A nice decent sub. Unfortunately the sound has gone out. That's right,.. Absolutely no sound. 2nd Polk Audio sub with problems. The first sub had a popping/clicking noise. Since it's been over a year I doubt the manufacturer will honor warranty we'll see what happens.",
        "This subwoofer is unbeatable for the money. I have this tied into a Denon 5.1 surround sound system. The connection to the subwoofer out ports on the Denon don't produce a signal that the subwoofer can use. I hooked it directly up to the front speakers and it works excellent. I am very pleased with my purchase. I wouldn't suggest buying this subwoofer if you're expecting it to perform like $1,000 subwoofer. The subwoofer performs better than I expected for the price. Based on the price if that's what you want you will get a good value.",
        "For anyone reading this checkout the bottom picture shown, this unit has a black cover over the front of the unit so you don't see the speaker! Of all the subwoofers I have purchased this is the best because. 1) it can be left switched on as it powers down automatically when no signal is detected. 2) the power cord is 9ft 3in long, so actually reaches my power socket without an extension cord. 3) takes many kinds of input ( I just wanted LFE ). Best of all the 10 inch woofer adds so much realism to movies and music to my 5.1 living room receiver",
        "Purchased this for a new movie room. Paired with a new Yamaha amp. Very satisfied with the performance, especially for the price. It really does add to the sound experience. It has an auto-on feature from standby (detects signal and turns on...turns off after 15 minutes of no signal). It has customizable levels as well as cross-over frequency. I run it direct via RCA cable from the amp, and it detects the signal without issue. The 10\" is the perfect size for roughly 13'x12' movie room. Have Polk in-wall speakers as well, and they are just as nice. Quality gear.",
        "There is something wrong with this sub , this is my second one in 2 years to totally die, must be a defect that somebody is missing , pisses me off",
        "I am not an \"audiophile\" or whatever but ive always had decent stereo equipment... This sub is way big for my needs ha! Sounds decent and was cheap so whatever.... Look at my setup in my room, rediculois ha! EDIT: Now that I have had this for some time... its awesome. Sounds much better after its \"broken in\". Im not really an audio guy so I dont know if thats really normal for a sub to get stretched out and used a bit before it gets better but thats the case here. It sounds way better now than it did when I first got it.",
        "When dealing with electronics, many give low or negative reviews that hurt a product because they are not experienced with the product. And because of this, I was a little nervous to purchase this sub. But I am glad I did. Having more expensive subs in the past, I assumed paying $129 for this meant I would just have to deal with a 'lower quality' sub. But what a pleasant surprise to find it's actually a really good little sub. It does what it's meant to do. Hooking up was a breeze. It took me 3 mins to balance the volume between this and my Denon receiver. Totally recommend.",
        "I have nothing but praise for the Polk PSW10. I got it to compliment my Polk T15 speakers in my bookshelf audio system. What a combination! Great, accurate sound, natural bass (NOT fake booming). I don't like it when speakers are described as \"Good for the price\" because that implies a compromise. There is no compromise on the accuracy and clarity of the sound of these speakers. They are a bargain.",
        "Ordered this sub to go with a pair of bookshelf speakers my son and I built from a DIY kit. I was amazed at what you can get for $100 from Polk these days. It's nothing compared to my SVS subs in my main system but for most applications, this is plenty of bottom end for a rock bottom price.",
        "I use this with a very cheap pair of bookshelf speakers, and a little digital bluetooth amplifier/receiver that is the size of a deck of cards, and the system ROCKS. I also have in my home theater in a different part of the house, 18\" subs powered by 2 kilowatt sound reinforcement amplifiers. Can this sub hang with those guys? Not even close! But it is a huge improvement over the bookshelf speakers alone that makes for a great musical experience. A super great value and highly recommend. Just don't expect to rock your house with depth charges from a movie and you will be happy.",
        "The performance is more then I had expected and the construction quality is definitely of high standard. It is larger then I had expected however the sound more then makes up bulk. It works great with other brands of speakers but I have been slowly replacing my out dated speakers with Polk Audio and the sound just keeping getting better. I definitely recommend this to anyone looking to add to their existing sound system.",
        "Do not fall for these silly reviews, these people never heard real bass in their life. They are probably mostly older people. This subwoofer sucks and its veryyyyy WEAK. I mean its so weak, you will hear it the moment you play it. What it does, it focuses on a very specific high bass frequency to make you think its loud. However, there is no real bass, low freq, or vibration. It is tuned to a very high frequency to fool your ears to thinking you are hearing bass. You are better off buying a logitech 2.1 PC speaker system than this high frequency basss junk subwoofer. Dont let them fool you!",
        "My old subwoofers were all 8-10 inches. Some were powered and some were not but none were as HUGE as this one. I just wasn't expecting the sheer size of this thing. However, once I heard how it sounded I wasn't about to return it. I honestly can't afford a super high end system. This was a huge increase over my old one. My wife was pretty angry about the size of it though since our house is on the tiny size for rooms. I found an end table at Walmart that was cheap that this fits into very nicely. Crisis averted and my sound has never been better!",
        "Great speaker. Simple to setup and works well on a 5.2 or 7.2 setup Make sure you get a single male rca to dual male (left and right) rca cable. this wasn't in the product write up on the page when I bought it. But not a big deal.",
        "I like that it has an automatic off/on option switch. Has good overall sound quality and I like the phase switch. I also like that it has a frequency scoop Contour adjustment on the back so I can remove those irritating mid-range bass tones . I purchased it to replace my Yamaha 50 watt sub. And it does a good job. Very equal in overall sound quality to my Yamaha. With maybe just a tad more thump. For the money that I paid for it. $100, there's just NOT a better subwoofer on the market for that low price. I'm very happy with it",
        "I recently was given a pair of POLK shelf speakers, and was quite impressed with their performance and overall quality. So, when I saw this subwoofer, it seemed the risk would be low in taking a chance on a purchase without hearing it in person. Well, it arrived today, and it is amazing! Well worth the price, and very powerful! Best bass for the buck! You can not go wrong as this thing is right on!",
        "These subs sound fine for a small room, however, they randomly stop working. The first one failed during the return period, so I got a replacement... the second one failed in the same way... lasted a little over three months now I have a worthless wooden box and can't do anything about it. Total waste of over a hundred bucks.",
        "Wow! I upgraded my my receiver and decided to replace my aging subwoofer as well. Since my new receiver supports 2 subs, I decided to order 2 Polk 10\" subwoofers. I had no idea what I've been missing. The range on these are incredible! The thunder rumbles, explosions really boom and even non action movies benefit from the bass in the soundtrack! I am in love with these subs and can't give a higher recommendation, you won't be disappointed!",
        "I write this with mixed feelings. It sounded really good but I cranked it all the way up and I just couldn't feel it. I wanted to love it (it replaced a fantastic older Polk down firing that I'd had for 19 years) but I didn't. It didn't hit as hard as I wanted it to. 50W just isn't enough and my room is on the smaller side. I guess if you don't need your couch to shake during a movie then this is fine but if you are looking for some umph then you'll want to pass. I sent this back and got a different highly rated 300W subwoofer and it kicks.",
        "I've been using the same pair of Sonic 3-way stereo speakers for over 40 years. Obviously, audio technology has come a long way in that time. Endeavoring to be on the cutting edge of audio tech, I decided to pair this Polk Audio subwoofer with my old speakers. OMG! What a nice sound! I used a 6-foot FosPower RCA Y-Adapter to hook up the PSW10 with the right and left RCA connections. Very impressive! I have the volume knob on the PSW10 turned up only to the halfway position, and I'm getting plenty of bass for my taste. I'm very pleased with this purchase.",
        "fifty watts of awesome. I live in a small condo with travertine floors. Sounds crisp and powerful. Plenty of sound for my living room and kitchen. No noticeable unwanted resonance, rattling or vibration. I like the adjustable cross over and sound level controls. My only complaint is that it's too loud with music if I adjust the sound for the TV. An automatic attenuation circuit would be nice but too much to expect for $90 shipped.",
        "Sounds great for what it is. I was worried about only having 50 watts rms but polk has done their research. This is used to compliment monoprice in wall speakers with a denon receiver in a 32x14.5 basment room, the sub fills the lows without hesitation. I'm sure a more expensive sub sounds better or louder but for the price I can purchase 2 of these. With some tuning to dial it in its awsome.",
        "The bass on this thing is incredible ( just don't turn it up to max and blow it up-- as with any piece of audio ). I have neighbors, so I constantly have to turn the volume down, as much as it hurts to do that 😂😂",
        "I purchased this to replace a failing subwoofer. This subwoofer totally out performs my expectations. It fills the low end of music. Has more power and volume than I needed. It is wonderful having thumping music and rumbling movies again. This speaker is the best addition.",
        "The PSW10 has been a great addition to my home theater system. I will likely be adding a second to my system in the near future for even more bsss. Great product for the price. It is heavy duty, built to last. However, it would have been helpful if they would have included a RCA Y adapter since the PSW10 has a dual input. Very happy with this subwoofer, and do recommend it.",
        "This speaker has the sound quality of more expensive speakers. I have the volume at a low setting and I still get chest pounding bass from the action scenes in movies. It is easy to wire directly from a digital optical outlet on most TV's using a converter from toslink to RCA connections. Amazon also offers these converters as well as other sites. It is a little bigger than some other 10 inch speakers but still fits in spaces to not be obstructive. If you are looking for an entry level subwoofer with good sound and on a budget, the Polk PSW10 is an excellent choice",
        "I am quite surprised at this sub, hopefully it lasts but it is no doubt the best bang for the buck sub I’ve ever bought. A little background, I own Focal Electra 1038be’s for my main surround setup that are 15 grand. I wouldn’t pair this with those but I have a smaller surround using JBL sats and this is a perfect pair. I removed a humming Sunfire sub to put this in its place, its smooth and gets pretty low, I’m impressed. I almost didn't believe all the great reviews and here I am writing one. Super happy with it!",
        "Very Happy with this purchase! I bought it to replace my Samsung home surround sound system. And this has delivered more than what I wanted! If you are like me and wanted a little bit more bass and don't want to break the bank, this is for you! I can't run it full blast! But it is very convenient to turn down the volume on the back of the speaker and adjust it accordingly.",
        "Hooked up to a soundbar for game room. Sounded excellent, used maybe weekly on weekends for gaming or movies. Amplifier screaming hot and fuzzy sound, opened up and checked a fuse and it was good. I guess now it is a paperweight.... This is the second one i have purchased psw10 from 4 years ago still going strong and sounds great. Maybe a bad batch of something. The one that failed i ordered end of july 2018 died Nov 2018.",
        "I purchased this subwoofer to round off my home theater system, as I had had a couple of front tower speakers with reasonable bass for a few years and wanted to add something to the lower end. I was a little skeptical, but hooked this sub up to my Yamaha amp, fired up Spider-Man Homecoming on 4K UHD BluRay, and was blown away by how much bass this little box added! As well as being a great price and offering exceptional value for money, the smaller form factor means that I can easily hide it in a corner without it being overbearing. Really impressed!",
        "I bought this to fill out the sound from my small Polk Audio Monitor 40 Series II ( The combination fills my office with a great sounding system for not a lot of money. It took a little time to dial in the levels for the sub woofer. Now that it's set, I can fire up Amazon Music and know what ever I choose is going to sounds great.",
        "This subwoofer was $99 when I bought it in 2009, and it has stood the test of time. I'm replacing the 10\" driver now as I also replaced drivers in the Polk Audio Monitor 50s that I bought at the same time. I found a well-reviewed 10\" driver replacement at Parts Express. I don't know if Polk Audio still manufactures this little 10\" sub, but for it to still be available after 10+ years is a testament to its longevity. The Polk cabinets make driver replacement easy. (With the exception of the tweeters on the M50 towers, which are cut with curves.)",
        "Crossover control knob is very useful to tune your system. When paired with the Polk Audio TSi200's I found maxing out the crossover to 160Hz was about right, perhaps a touch light at 150Hz or so is ideal. Volume control knob right on the base is handy as well. A good 10\" driver sub around the price point of most 8\" drivers. Solid buy.",
        "I have this in a 10X24 bedroom paired with 2 t-15 Polk bookshelf speakers and the sound is very satisfying. I listen to music videos from the line out on my smart tv through a 75 watt per channel amp. I am quite pleased. It cannot compare with my living room system which has a 200 watt 15 inch Cerwin Vega sub but it cost about 1/5 as much so I got what I paid for. I do recommend this for a smaller system.",
        "I don't normally write reviews because I'm not good with words, but this sub has definitely exceeded my expectations. I use it with my PC setup because that's where I do most of my music listening. It's powered by a Sony receiver and teamed up with a pair of JBL ES20 bookshelf speakers. I set it up and haven't touched it since, and this thing sounds AMAZING! Flawless, no issues whatsoever. The only thing I noticed was the mesh cover on the front will rattle given the right amount of power and frequency of bass, but that's super minor. I would recommend this to ANYONE looking for a decent sub for their room/living room setup.",
        "I have a Bose system for my entertainment center Nice surrounnd sound but the included subwoofer if off in a corner. After furniture rearrangement I found that I was diagonally across the room from the base. By adding the Polk unit the base is no longer directional. Perfecto. The Polk unit was simple to install and set up and it does exactly what I wanted it to do.",
        "I find the resolution/response/acuity of this subwoofer to be not as accurate as my Pioneer SW8MK2, but I really like that this subwoofer has higher power handling/output. As a worldwide audio professional who spends his time in A-List studios, I give this subwoofer a high recommendation, especially for the price and level of quality. (BTW, I am using it with a pair of Dynaudio M1 monitors, all driven by a little Dayton Audio DTA-2.1BT2 amplifier, which is a diamond in the rough and which I urge you to check out.)",
        "Gets really loud. Works awesome if you just want to supplement your system. I have it up just high enough where the bass comes in only when my speakers can't pick it up. If that's what you plan to do, for ~$100 it's hard to beat CONNECTION: this confused me for a minute. For this, or any other sub with similar connections, you plug the SUB cable into your receiver, and plug the other end into the Left channel on the sub. Got this for my first system, so that wasn't obvious to me and I thought I'd share the info!",
        "Purchased this to replace a cheap, 6\" sub I'd gotten years ago to bolster the bottom end on my Yamaha shelf system that has a a sub out jack. I cannot speak highly enough of this subwoofer! The frequency range is incredible, where I'm hearing low frequencies in music and movies I wasn't aware existed. Speaking of movies, the rumble/vibration this box produces provides a true, in theater experience in my living room for action scenes. It took me awhile to dial it in where it wasn't too thin or too thick with my shelf system, but it was well worth that effort. Music sounds absolutely amazing at any volume. No distortion. Just full, rich bass! Couldn't be happier! 😊",
        "This is a very good sub IF you pay under $300 for it. Its great for the money and not too huge. It is well made and the design is nice. Its not a powerhouse with hundreds of watts but you probably don't need that much bass anyway. If you live in an apt this is plenty of sub. I have a typical LA living room open to dining and kitchen. I use ORB Audio speakers and this is a great 10\" driver to match well with small speakers. Th PSW 111 is also great for the ORBs.",
        "This sub-woofer is an awesome piece of music engineering! I added it to my music studio setup. It is easy to balance and provides super clear bass response. It was on sale for $99, best bucks I ever spent on a speaker! This speaker will vibrate my whole house if I turn it up. I tried it in my 25' x 25' great room with my home entertainment system. It fills the room and that's at 50%.",
        "I love this subwoofer! I bought a more expensive one previously to go in another room that has a low hum and we have to turn it on and off which is annoying. Not this Polk! There is no hum at all and I keep it on non stop. It works beautifully! The sound is fantastic. I have it paired with Micca speakers and a Pioneer receiver.",
        "Unfortunately, I live in an apartment. That being said, I went a little crazy one Saturday afternoon and turned it up to see what I could get out of it and wasn’t disappointed. It’s a bit of a waist if you have to control the volume like I do. If you have the ability to run free with it then it’s definitely worth the purchase. Spoiler- Played Br. Sleep and when the heart beat is playing during the scene, really adds the the effects of the show.",
        "This little speaker packs a punch. I have had my eye on upgrading my Polk RTi sound system by adding a sub and for $99 it was hard to pass this up. Very happy with the purchase. Theater experience While the bass is not the deepest, it is more than sufficient for watching movies, and TV shows. Music experience This is only a single 10\" sub so you are not going to get crazy deep bass when the volume is turned up high... but that's okay because the bass it does produce at moderate to high volumes is still pretty good.",
        "I ordered the Abramtek e600 portable bluetooth speaker after researching on-line for systems to enhance the sound quality of music generated by my Echo Plus. I'm a bit of a bass fanatic, though, and wanted even more bass so I added a Polk PSW10 subwoofer to connect to the speaker. Now that I have all three systems working together I am experiencing fantastic sound at an economical price! I highly recommend the Polk PSW10!! This is an excellent subwoofer producing a high quality bass sound and doing so for under $100!!",
        "This sub is no joke. I bought it so when me and my wife play Just Dance we get some extra bass. But I caught myself leaving it on whenever I’m watching movies or tv shows. The extra bass this sub puts out is a hidden gem you didn’t realize you needed until you hear it. It makes playing video games 10x more fun and watching movies and tv shows more enjoyable. I’m so glad I purchased this sub and for the price, you can’t go wrong. It’s a 10” sub so it’s a bit punchy on notes, but it hits the low notes so beautifully. No regrets at all!",
        "A friend gave me a left and right set of their speakers, which sounded fantastic. We changed receivers for the TV, and the one we purchased didn't have a powered subwoofer output, just the signal. I added this and VOILA!, the room filled up with low end. I'm a professional in the production side of the music biz, so my ears are attuned to good quality audio speakers (my recording studio speakers ran me thousands of $'s). You can't beat Polk's gear unless you want to go full on audiophile and spend thousands. This is quality.",
        "This is my first subwoofer. I have lived for many years with two large front speakers that had 15\" woofers in them. I have had the low frequency bass directed to them during that time. Now that I have a subwoofer, I can hear what I have been missing over those years. The 10 inch subwoofer sounds really good to me, but I have not owned one previously to have another one to compare this one to. I enjoy this one so far.",
        "Absolutely the best $100 I have ever spent on home electronic's... It replaced a Velodyne VA1012. The Velodyne was bought in 1993, and purchased for around $700. The Polk sub is much cleaner, much tighter, just the perfect amount of bass. I hear only bass coming from the sub instead of walls and doors vibrating like with the Velodyne. Just totally blown away with this Polk sub!",
        "Ya había tenido una experiencia extraordinaria por casi 10 años con uno de Polk similar. Bajos profundos y claros, sin embotar ninguna de las notas bajas. Una presentación preciosa. Lástima que no trae LFE. (He had already had an extraordinary experience for almost 10 years with a similar Polk. Deep and clear bass, without dulling any of the low notes. A beautiful presentation. Too bad it doesn't bring LFE).",
        "I am very pleased with how well this mated with a pair of NHT SuperZero speakers. Setting the crossover at 100Hz, the sound was much fuller. Bass seemed to come from the NHT's rather than the subwoofer - as it should. The NYT Wirecutter recommended the similar priced Monoprice subwoofer (which is out of stock at the manufacturer) and the cheap BIC - but I've also owned the BIC in the past, and it really sounded terrible. Your mileage may vary, but I'm a happy camper.",
        "When i took it out of the box there was something rattling around on the inside. i didn't want to open it up to see what could be loose inside or go through the hassle of boxing it back up and lugging it to the Post Office so I hooked into my system and it really sounds amazing. Going to try not to move it around much. Don't know what inside and i guess I don't want to find out. I would have gave it a 5 if it didn't have something loose inside.",
        "I have been using this sub with my Denon AVR 2112ci receiver and it is awesome. It has produced incredible bass for music from rock to rap and classical. It has a cutover and volume switch on the back so you can make precise adjustments about the cutover frequency the sub handles and also the volume. The bass is incredible especially at the price. For $99 I expected it to be OK but it is awesome, couldn't be happier with this purchase. I definitely recommend it without hesitation.",
        "I bought some very expensive bookshelf speakers and was disappointed in the lack of \"bottom end\" After buying the Polk sub-woofer and dialing it in I have everything I had hoped for. Tight bass reaching into the midrange, slightly. I thought I was going to have to buy a more expensive sub-woofer somewhere down the road but this fits the bill perfectly. I am very pleasantly surprised.",
        "These little babies make awesome bass shakers. I have a 7.8.4 system and have four if these behind my chairs. Forget using transducers that only output 50watts, use a sub instead. All my subs are ported and the integration into my other 4 subs (2 SVS PB3000, 2 SVS 25-31CS+) is exceptional. I would say 4 of these is almost equivalent to a PB2000 except you will get a much lower frequency response with the PB/PC2000. They do slam around the 40-60hz area though. All in all if you want a better room response pick up multiple subs and for this price you really can't go wrong.",
        "This sub bumps! I thought maybe I might need something bigger than a 10 inch to make things rattle, but this sub gets the job done. Dont want to play at max sound. Dont want the cops called or things to fall off the shelves in the living room. This sub is perfect for my 2 15 inch speakers for future events and parties. This has been a great purchase for a great price. Might even get a second one.",
        "I'm one of those guys who moved my living room entertainment center into a bedroom rental when I last moved and let me tell you, this subwoofer has some power. I use it with an Onkyo Audio/Video receiver and aside from having to buy a long specialty cable (not sure what its called but looks like a mono RCA jack), it's been an excellent purchase. The dial on the back makes it easy to turn down late at night if needed but otherwise, I let her roar and this baby pumps out some seriously low-lows during movie nights. I love it!",
        "Coming from a logitech z-4 2.1 system to this and a pair of Edifier R1850DB Active Bookshelf Speakers for my office computer sound system. This sub completely destroys the logitech, subwoofer. It's not even in the same league. I had to move the hamster out of the office because everything was shaking. The adjustable phase, amplitude and crossover are big wins. One of these is more than enough for a medium size room. Might be overkill for a small size room. Dont get this if you love in an apartment",
        "This is a really good sub for the price. I was using a JBL side-facing sub with my home entertainment system before it blew and replaced it with this Polk. The only reason I gave it 4/5 stars is because the upper range of the low-end is a bit muddy. I also realize this could be due to the subwoofer EQ and crossover of my receiver - and am trying to explore that possibility. If I find out that is the case I will amend this review, and then hopefully it will be a 5 star review.",
        "I'm not an audio expert by any means, but I know what insanely loud is. Given the price I wasn't expecting this much sound, I think my neighbor might call the police on me soon. Granted it's day 1, there's plenty of time to get used to it but right now I wish I lived somewhere that I could go nuts. Might buy another just because.",
        "This great for most people. But if you do what the directions says to turn both knobs on back to max. And ajustcas needed. I know that it limited to 20 hz and above because it will sometimes rattle. It doesn't makes the room shake but does make a nice cinema room. For people that are happy without a bass heavy noise. Great for living in a dorm or appartment. I am happy for now. I will get more bass this was a great buy.",
        "Eh, this thing isn't anything to write home about. It's my rear sub as part of my 7.2 surround sound system and anything more than low volume bass and this thing sounds awful. My old 12\" and 18 year old Polk sub in the front clearly outperforms it still after nearly 2 decades of use. If you have a very low expectation and looking to not spend a lot, this might do. Anything more than that, and you might be disappointed.",
        "I have a lot of Polk Audio equipment in my vehicle and this sub for my office was a great choice. It's built very well and sounds clean and deep. The volume and frequency controls work well too. This is an excellent buy for the price!",
        "Wow. This is a great little subwoofer. Considering this sub only cost around 100 bucks is awesome. I am listening to it right now. It's got the punch you can feel in your chest. If I had one minor complaint and that would be it's sorta limited on the bottom end of frequency's. while it gets pretty low it does have a limit. But for the cost you can't get a better value. It is punching about it's weight class.",
        "I have purchased two of the items for different rooms. One ( the theater room) is 26 feet by 16 Feet with 8 feet ceiling. The system also has monitor series 2 floor speakers. In addition, Polk surround and a center speaker. This system was strong and the room shakes. The second room ( great room with kitchen) is 30 feet by 30 feet with a Cathedral ceiling of over 20 ft. This has two s series center speakers with one psw 10 sub. For the size of the room, this sub works well ( per my wife) but it is on the limit. I would have gone to the Polk 12 inch 400 w for this size room.",
        "have this 7.1 onkyo system and my first sub had a weird vibration..something was wrong..it was old...someone gave me another cuz i really didnt wanna spend 100 on just a sub...but that one only worked sometime...im glad i ended up not going to buy a used one..for $130, id say this is a solid value. i finally get a full sound from this very nice movie theater room. carpeted, so preferred a front/side firing sub.",
        "The product description doesn't make it clear that this product doesn't have a subwoofer connection. The sound quality achieved by connecting a subwoofer cord to one input is poor. When I ordered a 1 x 2 Wye connector to input into both inputs, the sound quality is good. The product description should explicitly state that it doesn't have a subwoofer connection and that an adapter is recommended or better yet included with the subwoofer.",
        "Adds punch to my theatre surround system. The adjustments are nice. I love this sub so much I bought a second one for the bedroom. Excellent price.",
        "I have 2 of these and I bought them at separate times. I thought adding a second one would help, but you really can't even tell the difference. It's a low power sub and seems to work fine and it's reliable, but when you crank it up, the base gets sloppy. Low to mid-level volume it works great. And really for the money when you can find them on sale, they are worth it if you aren't looking for wall-rattling bass.",
        "I order this subwoofer after my old one (Sony) stopped working. Which was the perfect excuse to upgrade! I am no audiophile, but I do dabble. I wanted something that was not too expensive, but packed a punch. I settled on this subwoofer, and I am SO glad I did! It was a snap to install. LOTS of great features to fine tune the subwoofer and worked well with my Yamaha receiver and existing surround sound speakers. They are powerful and it makes the entire house shake during heavy action parts of movies! LOVE this subwoofer! I would recommend trying these out to anyone looking to upgrade their subwoofer!",
        "Great upgrade over the two mid size bookshelf speakers (Bose 201's) which it is working will. Adds a lot of life to the sound of an ok system at a very reasonable price. It is a lot of bass for a rather small room but don't expect it to fill a concert hall. On a test CD there was no audible response at 30hz. It becomes audible at 40hz. Pretty good output at 50hz. It is not a real low end thumper. I only wish it had a single input RCA rather than having to use a cable splitter.",
        "After weeks of adjusting the knobs on the back of this subwoofer and the levels on my stereo's equilizer, I can't imagine life without this subwoofer. It took a while to get the crossover right. I wish it had more inputs.",
        "I bought this subwoofer to replace my 15 year old unit, whose volume control was no longer working. The bass sound quality is great, much better than my older speaker, which had exactly the same power ratings and speaker size. The bass is clear and crisp, and the volume control works well. I use a RCA y-cable at the end of the cable coming off the subwoofer output of my amp, and I feed both inputs from the y-cable. This works well with my 5.1 system. I noticed an improvement in the sound quality after adding the y-cable.",
        "As others have noted, this sub is good for budget minded people that don’t go past 50% on the volume. It distorts heavily as you get louder and doesn’t give low booming bass sounds as expected. My 8” entry level Onkyo subwoofer is outperforming this 10” and I’m very disappointed after reading so many 5 star reviews. I’ll be returning it.",
        "For $99, can't go wrong to add low end to home theater. Keeping it set at about 40% power for plenty of punch, @50% that low end rumble on action movies can be felt! NFL games really come alive hearing their hits ...Hit you! If you really intended to make the walls shake, the Polk PSW10 can do that, but you'd probably want to spend more if you need the sub to part your hair all through a show. Not my taste to shake my dentures! This unit fills my 25x40 living room with 10' ceilings. Great bang for the buck!",
        "Bought this for my new basement tv setup and couldn't be happier with all of my Polk speakers. When this bass is bumping you can see the glass of water vibrating on the coffee table upstairs. Very happy. Sounds great.",
        "I have a 12” PSW505 that I have had for the past year that I really enjoyed and thought it did a killer job for the price. I decided to buy this Polk 10” sub for another room looking for something more punchy and less boomy. Out of the box the subwoofer was in amazing condition, no scratches or dents. I plugged it into my system and sounded quite distorted anywhere past half. I decided to play music over the next weeks on low volume to try and excercise the suspension, but it did not help. I returned the sub and might just buy another 12” due to my good experience with the first."
    ]
}