{
    "entity": "Subwoofers",
    "text": [
        "it's alot of bass for a reasonable amount, but that amount becomes less reasonable when the thing dies shortly after warranty expires. it started making odd noises when no sound was playing, and then shut off never to turn on again. $300 brick.",
        "Well what can I say. The bad reviews were correct. Most people got a good two years I got 6 months. Fantastic sounding sub...when it works. I called Polk and talked with a nice gentleman. I’ll be getting a new amp. Hopefully in a reasonable amount of time. I can’t recomend this speaker because of the faulty amp. I paid $229 which is a good price point if the amps weren’t so unreliable. Now I’m looking for a good quality sub woofer. Any suggestions would be appreciated.",
        "Sounds terrific, gobs of deep, accurate bass. Sounds great for both music and movies alike. At $200, it might be the best bargain in Powerful, powered 12 inch subs. I am sure you can find 12 inch powered subs that are cheaper, but I bet they have a much weaker amplifier (this one has a very healthy 300 watts RMS, go on and compare the wattage to other woofers in this price range) I cant really hear the port noise that a few people complain about, its probably an issue with their woofer placement or turning the woofer up extremely high.",
        "Update. It blew. Just an annoying buzzing sound now after 11 months. Never turned up loud, only used for home theater. Not cool for an item of this propsed quality and price... Outstanding quality and range of low end sound. Not just an annoying bass thumping box.... Has the LFE RCA port. I should have purchased this unit a long time ago. Completely satisfied.",
        "Bought this Sub woofer almost 3 years ago. It has been a great buy. No problems whatsoever. It is connected to a top of the line 7 channel Yamaha receiver via coaxial cable. It provides a good crisp bass. Placement location affects how it sounds. I like to place it in a corner so the sound reflects on 2 walls. I would recommend it. The only minus is that it is fairly large. So if you have a small house, it takes the space of a small side table.",
        "I just upgraded from the psw10 and wow, what a difference. A little extra money went a long way. The psw10 sounded muddy and distorted over half volume so i returned it, maybe it was defective. But either way this sub right out of the box looked and felt better. Heavier and the sub itself was definitely sturdier and felt heavy duty. After i plugged it in....wow. i put on transformers and damn! Bass was clear, room thumping without it being muddy or sounding distorted. You could only feel the bass not hear the sub itself. Awesome. Highly recommend.",
        "I bought this as a surprise gift for my S.O. back in January (2017) and waited to review this product so we could experience it first and boy does this baby work! The Polk Audio PSW505 is amazing! It sounds clear and great even when we turn it up to where our furniture rattles a bit. We use it in our room but I'm sure this bad boy would serve a bigger room perfectly. I love to feel music to my bones and this speaker/subwoofer hits them like no other. Definitely a great buy! (Not attaching a photo because the product looks exactly the same as in the pictures and is the correct size as given too.)",
        "After only a bit over 3 years of service, the power supply in my subwoofer died and the unit is now a heavy paperweight. Polk's warranty on the electronics is a short 3 years and the cost of a new amplifier board from polk is more than what I paid for the unit. I'll try a different brand for my next subwoofer. Judging from the technical forums on polk audio's website, this seems to be a fairly common problem with the 505.",
        "I bought one of these 5 years ago and just added another. This is the best sounding sub-woofer I've ever heard. Now that I have two, it's so immense and enjoyable to listen to that I'm having a hard time going to work in the morning. Thank you Polk Audio for this wonderful sub.",
        "I got this sub on sale for $199. I've had my eye on it for at least a year or more. Ever since my JBL sub bought the farm. Then when I saw it on sale, I pulled the trigger and boy am I glad! It is SO NICE to have BASS back in my life! HAH! As I'm writing this, Hotel California (Live) just came on, with the heavy bass drum driving the rythym! How Perfect! Anyway, if you're living without a sub, STOP IT! And just buy this sub if you want a good, solid well made entry level sub woofer. Trust me!",
        "I bought this subwoofer to replace a 10 year old JBL. I am pairing it with Polk Monitor 40s for fronts, T30 for center and T15 for surrounds connected to a Yamaha receiver with a single subwoofer cable. Everything was perfect out of the box. I had to dial the volume back a little to keep it from overpowering the rest of my speakers. Once dialed in, the sub blends in great for music or movies and it performs beautifully, not overly boomy but with very pleasant lows staying out of the way until called upon and then delivering in spades. Very pleased with the sub and considering purchasing another to go dual subs.",
        "I bought this subwoofer and posted a positive review but sadly I have to take it back. This subwoofer just suddenly stopped working for no apparent reason. The speaker got scratchy sounding right before it died and now nothing. Sad to spend this amount of money for it to not even last 5 months with not even using it that often and no options to return for possible defective product.",
        "Bought 8/2016 and died 9/2019. No amount of savings is worth having to replace the sub after just 3 years. Look elsewhere for higher quality equipment. Prior to not working at all the sub began making a \"heartbeat\" sound even when disconnected from the source and on standby. This is a well known issue with Polk subs (Google it). Only option was to replace the amplifier for more money than the sub is worth. Will be spending more for a better sub this time around. I used only for movies at very minimal output. Never ever abused or cranked up.",
        "Amp was good for 1 year than Broke. Filed claim under warranty and had to pay $65 shipping from Florida to California. That's 1/3 of the price of a new unit. I believe that shipping for Warranty issues should be covered by the manufacturer.",
        "Was trying to get a larger punch out of my subs. So I move up to two PSW505 12\" subs in the audio room. I replace the 10\" down fire Polks. I think I like the 10's better. They seem a lot more musical to me and have a tighter punch. My buddies like the 12's. I'm on the fence. If you are just into action movies the 12\"s are a great choice but if you are into concerts 10\"s maybe the better choice. But great product, good build quality. No surprises. They are heavy.",
        "Excellent sub for under $200. You will be hard pressed to find a better sub in this price bracket. Shipping was great as well since it was still free which was great with being a larger item and it arrived in perfect condition. It replaced a home theater in a box sub from polk that just couldn't cut it in the frequency range and sound quality I want. This has been great for movies and music.",
        "I have a JBL surround-sound system and when the sub-woofer shorted out, I went looking for a replacement. After some shopping around, I decided to spend a little more than my original price range and I'm glad I did. The increase in dynamic range of this unit has improved the sound of the overall system. I see this as the first step in what will probably be a gradual upgrade of the whole system. Polk is good stuff, you can trust the brand when it comes to both quality and performance.",
        "This is my second purchase of this speaker. The first lasted 4 years. I purchased it again because I was satisfied with the quality. If this second purchase lasts only 4 years, it will be my last. I play only classical music at low volumes. I set the sub to 1/2 power and only on minimum frequency. I have the matching bookshelf speakers which are quite good and would recommend. My previous sub lasted about this same time period. Perhaps buyers should realize that the computer electronics on these things fry after a few years of use even at low levels and conservative use.",
        "This unit failed last week. I am totally disappointed in the quality of this product. The failure manifested as the power light going from red to green and back again on 1-2 second intervals with the unit dropping out and back in again. I do not recommend this product to anyone. I purchased this unit on July 7, 2014.",
        "A 12\" sub for under 200.00 and it sounds great. Bass is there when it needs to be..... it will shake the walls when it kicks in and sounds good / clean. Movies and music sound much better now. No brainer at this price and quality. Came well packaged and no damage, Hooked it up plugged it in and fiddled around with the settings a bit works great no issues. I tried a couple different spots before finding the sweet spot and now I can hear the bass but it envelopes the room and you really have no sense where its coming from. You can feel it in your chest. No regrets with this purchase and price.",
        "I bought this subwoofer in December 2016 and bought the warranty with the product. I really enjoyed the sound that I received from the subwoofer. a few weeks ago we had a power surge and the subwoofer quite working. Sent the subwoofer in for repair since I had the warranty. Received a response back about the subwoofer that it couldn't be repaired so here is your money back. Cool. But now the same model in a little over two years now cost another $229 more than the original cost! I really enjoyed the sound from the subwoofer but don't know if it is worth the extra money.",
        "This by far is the best Subwoofer I have ever come across. The sound quality is simply top notch. It's a sturdy well engineered piece of sound equipment. The craftsmanship displayed with this unit clearly screams the engineers paid attention to even the smallest of details. They could easily have increased the price of this unit and I would still agree to buy it. The low frequency and booming bass shakes my house during action movie sequences (Which I love!), so I can't have it at maxed volume : ) I can only give this a 5 Star rating because they don't have a 6 Star choice. Bravo!!",
        "Had this for almost four years and it started buzzing, regardless of whether it was hooked into the HT or not. Never had any other issues with it and it was always plugged into a surge protector. Not overly happy that after a year out of warranty I have to buy another. Looked into getting the amp replaced but it costs almost as much as the sub does! Bottom line is it's a decent amp but it won't last you very long.",
        "wow! you realy feel the lows. jungle book the stamped of the bufflo and the avalanch segments shook the floor . realy good speaker for a great price no problems with it after several hours of use . other films that tested it were the magnificent seven (new one),rogue one , and others with blasts and gunshots and cannon fire will really test your equipment and floors.",
        "For music, this sounded decent, but after cueing up Blade Runner 2049 it was clear that this subwoofer was sub-par for movie watching. Even with low to moderate input, it could simple not handle the range necessary for movies with rich soundscapes. I really wanted this to work as our budget was limited and it had a lot of positive reviews. Decided to go with a used ebay Definitive Technology ProSub 1000 and blew the Polk Audio PSW505 away. FWIW, I got the used Def Tech for less than the cost of this. Even new, the Definitive Technology would be worth the price.",
        "And this one definitely fits the bill, added to my system with a Sony SA-WMS230 (9\"), man what a difference it made. I let the Onkyo do it's thing and set the volume, wrong... the base was way to loud for TV watching, so I set it manually and now it seems about right for both TV and music. I am not pushing this speaker at all, but now I hear some base frequencies that I never heard before, it has made my system that much more richer. I definitely recommend. (4 stars for material, not special visually, heavy which is good for woofers).",
        "This 200w powered sub does not sound like a 200W sub, it was replacing a 15 year old RCA 200W powered sub.. it didn't come close.. I'm returning it for a klipsch 400W unit..all I can say is the standards over the years have changed. I had it at max volume, and even turned my amp up from half to full power on the sub output line..still fell short of the crisp hard hitting I am accustomed to. For those that are less discerning it would likely be a amazing upgrade to your system.",
        "Wow! This sub produces some great resonating bass. I originally purchased the PSW10 due to its positive reviews, but for someone who feels bass is very important, the PSW10 was not cutting it. It was vibrating the port during heavy bass scenes and I needed something that could handle more power. The PSW505 shakes my house. Clear solid bass. Would highly recommend to anyone starting to take interest in a customized home theatre systems.",
        "Get one soon ... seems kids today with all the technology only know about sound bars and small subs... And Polk is catering to the market instead of what made Polk a great speaker ... No sound bar can compare to tower speakers ..the same with a big sub.. Call Polk and ask them. They will agree... People spend thousands on TV picture clarity.... then get a sound bar because of the neighbors ..... I'm old school. Tower speakers big subs,true surround ---- and a great 4K,3-D TV large screen... To put a sound bar with a TV like that they may as well have a black and white TV with their sound bar .. about the same to me",
        "Somewhat of a biased opinion here because I buy only Polk Audio speakers. I was running 7.1 surround but was missing some of that deep tight base. Settled on this subwoofer. I should have measured the area I wanted to put it in because when the subwoofer came it was a lot larger than I expected. So I could not fit it in an enclosure I had for it in my audio cabinet. Put it about 18\" behind the TV. Sounds great, tight, deep base. Took a few different listening experiences (movies, albums, CD's) to dial in the volume so it was audible but not shaking the house.",
        "I have an old stereo with no subwoofer output so I needed something that I can connect with speaker wires and have the signal passed through to my bookshelf speakers. It works perfectly and the bass quality is perfect. I couldn't be happier and every time I have family over they compliment the quality of the bass. Only problem is that it's huge, it's a huge box and I wish I got the 10\" but either way I love the sound.",
        "Excellent value. Don't expect this sub to necessarily be audiophile/enthusiast quality, but it's quite good for only $200. Setup is pretty typical, if you have an LFE/subwoofer output on your AV receiver use the the LFE input on the subwoofer. Otherwise just use the line in for line level audio. The line in can be used for LFE input too by cranking the frequency override all the way clockwise. At 50% volume the subwoofer is already quite loud, so it's probably overkill for most setups, but I wouldn't have it any other way. This subwoofer enhances all of your audio experiences for an unbeatable price.",
        "This sub provides clear, usable bass. It's adjustable to match your bass output to the rest of your surround kit, and the bass produced is always complimentary to the rest of the sound once you've set it up properly. I appreciate that I can use it when playing music - the sub works well in this context as well as video surround sound. The unit is well made, and I really appreciate the solid post connections - a big upgrade from the spring-clips on the typical lower priced units. For me, this is worth the price and a great value.",
        "I use this on a home stereo that's primarily used for movies. 5.1 surround paired with a projector throwing a 130\" picture on the wall. It's plenty loud at a medium volume. If I turned it up any further then the sub would overpower the speakers and muddy the overall experience. I read some complaints online about the sound quality and other nitpicky details. Those probably come from audiophiles who are spending huge sums of money to eek out that last bit of quality. Assuming you've got a \"normal\" home stereo, you'll be perfectly happy with this.",
        "I absolutely love this subwoofer, but I only got 4 years of use out of it before the amp board went bad. You can purchase a new board from Polk for $150 plus shipping. I had a positive experience with Polk’s customer service by contacting them using the email option. I read the comments on the 2017 version of a 12, and Polk hasn’t completely figured out a fix for the amp board going bad. Don’t expect to get too many years out of it, but it REALLY is a great subwoofer.",
        "It's probably your best bang for buck. But don't kid yourself. These subs are not going to hit those low, low chest thumping notes. Good subs start at 500 for a 12 inch HSU and they go up from there. But if you're like me, you don't have 4k laying around for dual SB16's. Because if you're gonna go, go dual. I've seen it happen one time. One time. Where a single sub filled the room without me being able to point right at it. Two subs makes for clean, omni directional bass. And don't spend more than 200 on a single 505, because they are a budget sub. I've seen Amazon list them for 589 and that's rip off.",
        "I'm coming back to leave a review after using this subwoofer for the last 2 years, obviously I'm here because it stopped working. About 2 weeks ago it started making loud repetitive booms over and over again without any audio. Turned it off, unplugged it, after plugging it back in I heard loud static, once audio started it just started randomly making loud booming sounds again. Did some troubleshooting by playing with knobs, etc. thought we fixed it but then it quit working all together. A red light is on when the switch is on auto but nothing happens, pretty big waste of time and money.",
        "I don't know much about home audio but knew I was in need of a new setup. I had been using the old school pioneer system that worked with the xbox 360 for years! Pathetic! A good friend of mine turned me on to this sub along with Polk towers and a center. I already had a Pioneer receiver so the whole setup cost me under $600. He told me he originally purchased a 10'' sub, then quickly replaced it with a 12'' This subwoofer is fantastic! My other half always complains about the base shaking the house! It's a great way to change my movie and gaming experience.",
        "I needed to replace the amplifier which went bad after about 3 1/2 yrs. I waited on hold for customer service for 1 hr and 35 min - not kidding - only to have the call dropped. When I tried to call back into the cue, I got a message saying the offices were closed. So I'm guessing they just decided it was time to go home, and dropped all of the waiting calls. I tweeted them, and 2 days later got a reply that someone would contact me. But now another 4 days have passed and I have not been contacted. Add that to the mediocre performance of the speaker, and I will never buy another Polk product.",
        "UPDATE Got through to customer support eventually. Overwhelmed because web site is in transition. Once I got through, they were very helpful and it now sounds great. ========================= I think this is probably a very good product, but I am having a lot of trouble with unwanted booms and such that I cannot get rid of. Mainly on TV talk and programs. Movies sound marvelous. Unfortunately calling customer service I gave up after nearly 30 mins. on hold. eMails have elicited no response. The product is not even listed on their web site and the link in the supplied manual to setup help just leads to a \"Page to found\" error. Will update if things improve.",
        "AMAZING!!!! LOVE IT!!! Highly recommended. Great sound quality. More than enough base. i have it in my basement so there is lots of concrete around to eat up the base but there still is more than enough base pumping out of this thing. You wont regret buying this woofer. Ive used it both for music and surround sound. and works great for both. this is used every day for watching TV as i dont know how people dont have a good surround sound for every day use.",
        "This sub sounds great. It replaced an Infinity PS-10 sub which died prematurely. I understand that's not unusual though. I have the Polk installed in a system with a mix of vintage equipment, 45 years old, and new stuff, only 20 years old. Quality lasts. Having had some other Polk speakers I expect the Polk sub to last; it may outlast me. My 50 year old vinyl still sounds wonderful.",
        "This woofer is bad azz! I had a 10 inch Polk Subwoofer in my media room and when it went out I replaced it with a 12 inch Polk Subwoofer and yes size does matter! The sound is incredible especially when I play my PS4 games through this system. Definitely recommend!",
        "First one arrived DOA. Amazon was kind enough to ship me a replacement. But now the replacement seems to be failing!! I have talked to Polk and they said from their diagnosis, with me on the phone, it seems to be the plate amplifier that has gone bad. There are many bad reviews about amplifiers going bad with this subwoofer. I am going to see if Amazon can help me out (only a week old) and take this one back and give me a refund. This will be my third subwoofer of this model in total that have gone bad. At least the first one lasted me 6 years.",
        "I recently upgraded my living room surround sound system and needed to do the same with my sub woofer. I researched many days and quickly discovered the price range is all over the place on a good sub woofer. I also discovered the Polk sub woofer had great product reviews at an affordable price. I've only had it a few months, but I am completely satisfied.",
        "Purchase in Dec 2017. Worked great for 25 months of constant use. One morning heard a popping noise from the subwoofer. Called Polkaudio and Immediately got to customer service. The representative was very nice and helpful. I did a quick check to see if it was the amp or driver, it was the amp. I sent them a copy of my amazon order and 4 days later I have a new amp at the door. It has been a great product and it was nice to receive great customer service.",
        "These were so much bigger than anticipated! But man oh man do they hit hard. Parties never sounded so good. I think even hear the camera man in the porn movies everything, these things work so well! I bought these to replace my old definitive technology subs that were 150rms... these are claimed 300rms but holy cow... I don't even have them at full power and it is like 4x the bass! Just have your lady sit on your lap, turn on a bass heavy song and let these bad boys do the work! One came doa but it was promptly replaced. My 7.2 sounds amazing now! Thanks Polk Audio!",
        "I’ve owned this sub for several years and finally decided to disconnect it from my 5:2:2 atmos set up. I bought this to replace the smaller and older 10 inch Polk, which I hooked back up today. Wow! This Polk psw 505 is trash compared to my ancient psw10–now back in service after sitting in my spare room unused for 5 years. Unfortunately, at 50 watts and with its 10 inch cone, the psw 10 is just not powerful enough for my current set up.",
        "I love this sub. But why did the price go up so much? I bought mine for about for 240 dollars!",
        "The amp on my sub went bad after about two and a half years. Called polk customer service and after multiple conversations they said that I would have to cover shipping costs to get the amp shipped out. Pretty disappointing considering the product is still under full warranty. Love polk audio, but disappointed in customer service experience considering I'm having to pay shipping cost for their defective product.",
        "This is my first time writing a review but felt i had too. WARNING... IF U LIVE IN A APARTMENT and buy this sub u wont be there long! Very tight and clean. I would strongly recommend this sub to anyone that likes too feel the bass. And all u people out there that keep complaining about speakers blowing quit clipping ur amps. I have a set of subs in the car that are over 24 years old my son hooked up two a 1000 kicker and box started rattling thought was speaker but a cpl of screws in the box 24 years later still shacken.",
        "Although I bought, installed, and calibrated this product over six months ago, I did not actually try to use it to watch a movie until tonight. Whenever Avengers Endgame had any intense bass, the box would emit a sound resembling crumpling paper until a few seconds after the bass ended. Although it sounded like an old, ripped paper speaker, the speaker itself appears intact. IMPORTANT TO KNOW: If your speaker is under warranty, they will send you instructions on how to tear the box apart and find which part is broken. Then will send you that part and tell you how to install it.",
        "Wow... Replacing a 20+ year old Sony sub that came as part of a theater in a box. I was debating between the 12 and 10, so happy I went with the 12. No distortion even at VERY loud volume levels. Nice and clean, low and very controllable bass, it is everything I hoped it would be. Make sure you pick up a sub woofer cable as one does not come in the box.",
        "Wow!!! This speaker blew SONY off the market! Wow what astounding bass. My floor vibrated and the sound quality is off the chain! SAY WHAT!! We watched a movie tonight and it felt like we were in a theater. Paired with our new Denon receiver we are swept off our feet and happy with our new home theatre system! Again I say, wait what!!! :)",
        "I purchased the subwoofer 2 months ago and finally yesteday and it was absolutely worth the wait. I am using it with ceiling speakers which I know its not a great way to get good sound but I do not want to launch into a major renovation at this pint to get better speakers. Having said that, the sound I am getting with the subwoofer is nothing short of incredible. My music now sound balanced, nuanced and with a wonderful yet subtle low end punch that is hard to believe is all coming from ceiling speakers and a hidden sub.",
        "I purchased 2 of these and couldn’t be happier until one completely died. It simply won’t turn on now. The other speaker connected to my Yamaha works great. Very disappointed especially since I would have easily given this product a 5 star review. You shouldn’t have to replace a speaker 2.5 years after you buy it.",
        "When I had an issue, customer service was great. Sent me a new circuit board. When I went to put the new circuit board in, found that one wire was not connected. Somehow it fell out, either in manufacturing or shipping. After putting the new board in, it worked fine. After a couple years, I checked the power with a kill-a-watt device. When the device is plugged in and not in use, with standby mode active, I found the device was leaking 14W! I know these were designed a while ago, but that is leaking a lot of power.",
        "When I ordered this woofer I was a bit afraid that it might overpower my existing surround speaker system. I have been very pleasantly surprised at how well the speaker blends in and is an exceptional addition to my system adding so much additional depth and dimension.. This subwoofer replaced the existing Yamaha I had before and the Polk is far far superior in every respect.",
        "Seems to do the job for movies. Kind of feel like I need two of them for my space (12X14). I do not have the frequency not volume up to far as to protect the sound quality and longevity. Last sub I think didn't like the higher volume I had the powered sub set at. No real complaints, for the price range it is work a try.",
        "I had a older Radio Shack 10 inch bottom sound subwoofer, it finally quit working. I did like it, however, it is in my basement and it rattled the upstairs pretty bad. The front speaker sounds crisper and does not rattle the upstairs as bad and still sounds good. I have a 20x24 room with pool table and 10ft ceilings. I think I could of gotten away with a 10 inch probably, however the 12 inch sound great. I would not know how another more expensive brand would sound, however this one is good enough for me. Hopefully it will last for many of years.",
        "I barely use my TV. The few times that I do, it's a great experience. After owning this sub for just over 3 years now, it stopped working. After basic troubleshooting and contacting support, there appears to be an issue with the amp. Since the 'amp' is out of warranty, I have the option of buying a replacement, or paying to ship the amp to get a 'free diagnostic' before receiving an estimate for repairs. For a $300 sub, this is a huge waste of time and terribly inconvenient. My Logitech Z-5500s are still fully kicking for the better part of two decades.",
        "This would be a good product if it would last. I was expecting it to last. There is a common issue of the amp being stuck in standby which I have been cursed with. The fix is to replace the back plate amplifier, which costs as much as the unit in entirety. I would be less offended if the replacement parts were reduced to reasonable prices if you can provide a core. It seems the reputation to the quality of their products is no longer a concern to polk audio. Even if they fix mine, it will just die again, unless they fix the design problem itself.",
        "I hooked this up to a cheap 100$ rca surround sound that had come with a small sub, what a huge difference it has made for music and movies, it’s got enough bass to rattle some of my windows and make the glasses in the kitchen cabinet vibrate. I definitely recommend this sub to add to any home theater.",
        "My old subwoofer died and that makes Home Theatre “blah” 😪 The new Polk Audio Subwoofer is OUTSTANDING! 👍😀 It was easy to set up (it is Heavy) and adjust. The instructions are clear & simple. With a few tweaks of the subwoofer “volume” control I got the perfect low end balance. I did go back to the settings on my audio amplifier to dial in the correct crossover point. (Check the instructions that come with the subwoofer & your audio amplifier). Overall the new Subwoofer is performing beautifully! All this at a very low price!! If you need a subwoofer, you will love this Polk Audio PSE550.",
        "A much better purchase than the psw10 and has the base to back it up. This really shakes the apartment/house and has a nice deep and rich sound. The psw10 doesn't have a low enough frequency and enough power for me. I use the intro speakerboxxx electronic song with its punching base to test the sound of my speakers and subs. This exceeded my expectations.",
        "Just an absolutely phenomenal sound for the price. Don't even hesitate - this is the one. So much better than our previous 12\" sub-woofers from Sony and others. Get it. You will have zero regrets. (When we let the edge of this thing touch our couch, we can actually feel the explosions and big punches during films. It's that substantial. But somehow it's always still smooth on the ears and never overpowering or ridiculous - it's like butter.)",
        "All i can say is it does what it is supposed to. A lot of reviews on here are a little unfair. It plays loud and low. And it has a good clean tight sound. Is it the best no, but its not the most expensive either. For the price there is not a better buy out there.",
        "Worked great up until it stopped working after nearly two years of use. Recently started making loud knocking sounds every time it would hit the lowest frequencies in a movie, then a few days ago all of a sudden started making these loud earthquake rumbling noises out of nowhere when the TV/audio receiver is off. The first time it happened in the middle of the night I thought there was a tornado outside or something lol. Don't buy this sub, there are plenty of other better ones to choose from.",
        "Bought in November 2014. Worked great until February 2017, when it started periodically exhibiting static and low bass humming. Initially I could cycle the power and unplug it to fix the issue. Come late May 2017, that solution no longer worked. Now the sub is making a 4-5 second static sound punctuated by three-second periods of silence. As if it is on a phase-repeat cycle. Called Polk customer service, who diagnosed the problem as the amplifier, offered to send a new one for me to install. Hope it fixes the issue. Judging by other reports and reviews I've found, should do the trick. It's a nice sub otherwise.",
        "This sub woofer is amazing! I have it hooked to an 800 watt Sony Home Theater receiver. This thing will actually shake the house!!! Movie sound tracks and special effects can be heard AND felt!! I love it.",
        "Permanent smile on my face since I bought this. My Polk 8\" punched... this Polk 12\" DROPS. Enhances entire surround system and good vibes are constantly coming from my house now. Pros: Great woofer, the ultimate experience. Cons: May cause structural damage to home, will update review to 4-star if it shakes my foundation away.",
        "Added this as a room shaker to my Velodyne 3750R sub woofer which has one of the best sounds, but it just didn't shake the room as much as I thought I'd want, now with both, once I tuned the Denon 4311ci, now my room, the house, the neighbors house, and my brain will shake. It was a different experience re watching movies like Jurassic World with this addition.",
        "I wanted a sub that was able to put some \"feeling\" in the special effects of my home theatre. I was not disappointed. It has plenty of power to shake my walls and windows. There are enough adjustments to be able to match and blend with the rest of my surround sound components that I individually selected. Great buy",
        "Absolutely phenomenal sub for $200. I have many dedicated subs around my house, including multiple popular name brand manufacturer's offerings and about twelve custom made (by me), some weighing up to 400lbs. each, and this sub is one of my \"store-bought\" favorites for several reasons; compact(ish) size for the great sound and room-filling bass it hammers out, trouble-free operation since 2011, good looks, easy controls and wiring, etc. If you're looking for a modestly priced sub for a medium-sized room (or buy two for a large room), you can't go wrong with this sub.",
        "I have three of these now between two systems (two for music one for movies).. will probably get more over time. I'm a bass head if you can't tell and think these sound great. They do bottom out at really, really low frequencies but it's pretty rare they can't get there. Everything has been ran through these from country to dubstep and they perform well. They are better for movies I hear, but I haven't heard anything produce room filling sound like these when T-Rex is chasing jeeps or space ships are docking in movies. Great buy for the money!!",
        "after a few months the sub started making loud distortion like noise. It is now totally worthless to me......I tried contacting polk audio, but they never respond........unless amazon can help me with this, I'm stuck with a worthless wooden box..",
        "I upgraded an old Pioneer Sub to this one to match the older Polk Audio Speakers I had (they are 15 years old, but still sound great). This one was a huge upgrade which I had done it earlier, the Pioneer sub was great for movies, but not for music, was too loose, and made some port noise. This one has a nice crisp sound, no port noise, but still provides that massive low rumble when movie sound track calls for it.",
        "Deep thunderous bass that literally shakes the entire house. Great for movies, music, and gaming. You can really feel the bass in your chest with this sub. I can finally feel the sub-bass in my music that I've been missing with headphones! There is plenty of headroom for power, and it never gets sloppy or loose on even the deepest notes. 10/10 would buy again.",
        "The sub woofer sounded really good and looked really nice but the only problem is I’ve owned it A year and a half and I was just watching TV and all of a sudden the sub woofer sounded funny so it’s broken doesn’t work now I think it’s the amp so I would not recommend buying. I was never hard on it either.",
        "Subwoofer stopped working and after providing Polk Audio with all of the information they wanted they said it was out of warranty (which it isn't - my receipt verifies this) and sent me a link to buy a new one. They didn't even know what was wrong with mine and never bothered to ask.",
        "So my first got lost in the mail. Second cake in and would not output sound at all. I tried all troubleshooting and requested a replacement. I googled it and a person said they pulled the amp with Polk on the phone and a wire was disconnected. I thought....this was 5 years ago, surely it’s not an issue. Popped the amp off, immediately saw the red wire disconnected. Reconnected, tested, working. Canceled replacement for now. I will update this once I hear it working.",
        "Sub worked great but the amp died after 4 years. I didn't even jam it that hard, never over 50% use and it was hooked up to a UPS for clean power. Contacted customer service which is 3rd party, and with my serial) and they had me take it apart myself to determine it was the amp not the driver (directly hooked up the driver to the amp). After I do this they tell me it's out of warranty and to buy a new one. So I'll shop for a different brand now.",
        "Very thunderous bass. Setup is simple has a LFE filtered line (if your receiver already does the filtering) or can accept unfiltered signal and you can use a crossover knob to set what frequencies will be controlled by the woofer. Little pricey for the equipment you get, but it's heavy, has no rattling and sounds great",
        "I was happy the sound quality. But on my third year almost to the day it stopped working. I had it in the garage and I believe that Polk Audio uses cheap electrical components causing it to die. The silver lining is that if you call the manufacture they don't really argue with you and will send you out a new plate amp as long as it's still within warranty. But still it's irritating that you have to work on it at all.",
        "I had a Klipsch 10\" subwoofer with my surround system for many years and this Polk Audio subwoofer is the bomb. A major enhancement to my surround system. I don't think the neighbors are real happy though. It is the real deal if you like an enhanced bass sound.",
        "I have one of these already (purchased on Amazon) when I built my movie room over 2yrs ago and never an issue. I had already wired my room through the walls for a 2nd sub so hooking this up will be very simple. These things are very hard to find and I've been wanting for for the past 2yrs, I was concerned I wouldn't be able to find another one when I was ready, but since the price drop on this one, I had to snatch it up. They are WAY better than new Polk subs that are smaller (10\") and only 100w, can never have enough!",
        "Used for approx three hours before returning. Port noise, farting, etc. I didn't expect an amazing sub for the price, but the reviews here were misleading. For folks looking to upgrade, I recommend getting an SVS sub within your price range.",
        "Incredible sub for the money. Excellent deep low bass. I believe it goes below 27 hz. For the size cabinet incredible sound and amplification. I would buy another if needed.",
        "I used the 10 inch Polk sub for many years. I love that sub BUT it struggled to maintain clean clear bass for certain movies with a lot of action, explosions, ect. I can honestly say those 2 extra inches made a HUGE difference. This 12 inch sub vibrates my walls with no rattling and no distortion. So if you have the extra money grab the Polk 12 inch sub. You will be a lot happier in the long run.",
        "I am just an average customer that simply wanted a great home theater experience and was tired of the whole sound bar slim/sleek design deal. With that being said I not only purchased this fantastic sub but the Polk TSX 550T Tower Speakers as well. The frequency response is great and has just the right amount of impact I was looking for not only while watching movies but regular television shows as well. Polk has always made great speakers and I am extremely pleased with my purchase.",
        "Amazing clean bass. Bought it on sale and was amazed at the performance for the money. Highly recommend.",
        "If you're looking for an easy-to-add subwoofer, I highly recommend a look at this model. It can work stand alone, as well as an integrated component of a 5.1 or 7.1 system. It has its own power supply, so it plugs into the wall with a normal IEC power cord (not wall wart) and it will auto-power off. It has its own volume control, which is nice for quick adjustments. It's also a stylish piece of furniture, so it doesn't have to be hidden under a table, although I'd make sure it's positioned so feet can't kick the grill too easily.",
        "I purchased 2 of these subwoofers an have had to have the amplifier replace in one of them 2 times already, and the 2nd subwoofer amp went out. Been trying to get Polk audio to honor the warranty an keep getting told a supervisor will call back and they never do this has been going on for 3 weeks. This item is a total disappointment, and now the customer service is a disappointment.",
        "Do not buy this sub. It worked amazing and sounded great until the amp went out. I've been waiting over 2 months for the replacement part. All they can tell me is the part is on backorder. No problem making and selling new subs, just screw customers that already gave Polk their money. This is not a one off case their own forum has multiple reports of the same issue, all for the PSW505. Spend your money elsewhere.",
        "Faulty amplifiers are very common in this model and are a known issue with Polk. I had 2 PSW505's that had faulty amplifiers under warranty. Polk customer service is extremely slow and will not respond. Their customer service number only says \"due to high call volumes, please all back later\". This has been going on for months I have several other Polk audio speakers and subwoofers that have been great, but not this model.",
        "Great disappointment. It started out great tho. The system is wonderful. But after very little use it died. 3 year warranty was up in February and it dies in October. There is nothing customer service could do. I have to spend $150 for a replacement board that went bad. The light on the back stays on red and does not turn green. I paid $300. Should have gone with Bic.",
        "I have this subwoofer a little over 2 months in an 11' by 11' room and I have to say you not only hear the deep bass, it is felt, like a semi truck out side the room or a small earthquake. Bravo!!.. As good as the 15\" Altec Lansing Triaxes I had in twin Karlson enclosures in the 1960's.... Well almost. The \"karlson\" enclousure was shaped like the top of an organ pipe and came as a Kit for you to assemble .",
        "This is an outstanding and powerful subwoofer that sounds great when paired with the right AV receiver, center channel and satellites. The bass is clear and really makes the room come alive with a rumble that makes you feel like you're apart of any action movie. I'm running two of these withe Polk TL250's and I couldn't be happier the sound. Actually, one of these is plenty of bass for a 20 x 20 space. This is the best subwoofer for the price that I've seen and heard. I highly recommend it.",
        "I bought two of these, they make really good speaker stands for my four Bose 901's. They sound great musically for a sub woofer so if you are into music as much or more than just home theatre. I have an old school stereo setup with two Bose 901's stacked on each subwoofer with a B&K pre-amp and two very large adcom mono-block amplifiers. The PSW505 keeps up and has plenty of power to keep up with my setup. There is plenty of boom and base, really hard to beat for the price!",
        "You just can't beat the 505's until you spend double or triple the money just to be equal! I've heard many subs that sound blahhhh. If my 505's sounded that bad, I wouldn't own any subs at all! Buy 1 or 2 and if you aren't pleased with the result, check your set-up. I have great speakers all around so I really only use the very low end of mine now but when I bought my first one I wasn't set up yet so my so-so speakers needed the extra the 505's provided. The last ones I'll buy for a long, long time."
    ]
}