{
    "entity": "Griddles",
    "text": [
        "Cast Iron is always a pleasure to cook with. So happy to get this. I have had several in the past. BUT... It cracked. Seriously it cracked while making pancakes. It was used less than a dozen times.",
        "I bought this griddle to pair with my Colman classic stove and was delighted to find that it's fits like it was made for that stove. This griddle takes and holds a seasoning well as should be expected of a Lodge. Cooked pancakes, eggs, grilled cheese and fajitas evenly and quickly. This is a great addition to our chuck box.",
        "This is a great griddle, cast iron so what could possibly go wrong? Nothing as far as I can see. This fits on top of the Camp Chef MS2HP 'Everest' stove perfectly. Except, it won't fit with the cover closed so it has to be stored separately. Don't throw the box away as it is perfect for storing and transporting the griddle. I did purchase separately; Lodge SCRBRSH Scrub Brush and Caron Doucet - Cast Iron Care Bundle to clean/season the cast iron griddle. Very happy with this griddle and the Camp Chef stove combination...",
        "Exactly what I was looking for! Beautiful, even heat for pancakes on a well seasoned griddle. I did do a swipe with oil in between batches for guaranteed easy release. I also kept a close eye on the pancakes directly over the burners in the beginning, but the overall heat transfer to the center was excellent. I have a pretty high powered pro range, so simmer was just the ticket. Let the griddle heat up slowly while you're prepping, that will help with hot spots. I will try it with some higher temp dishes and update...",
        "It cracked right down the middle the first time using it. Sounded like a gun went off. Scared the daylights out of my wife",
        "I'm in love! I've always been intimidated by grilling meat, but I decided to try this on my new gas stove that has the long element in the middle. After doing some research on cooking with cast iron and grilling techniques, I've got it down! I preheat on high for about 10 minutes, then throw the meat on until it's cooked to the point where it's ready to release from the pan on its own, then flip it and cook to the same point again. I then let the meat stand for 5-10 minutes, and it stays nice and juicy with just the right amount of char.",
        "Super heavy I'm returning them and keeping my whirlpool. If you are looking for cast iron one then they are all usually heavy this is a great price but not for me. I need light and easy to carry off the stove and clean and use every other day. If u want light weight and something to use for pancakes eggs and naans buy the whirlpool. Yes it's more $$$ but you will love how easy it is to clean and use it more.",
        "I literally just got this and it came right out of the box with rust along one edge. I had high hopes from all the photos posted here and the great reviews :(",
        "Anyone complaining about the \"pre-seasoning\" must not understand cast iron. The pre-seasoning from the factory is never enough - they do it to make it look nice. It isn't cost effective for them to season it enough to make it non stick. After seasoning the pan really well myself (I always season it in the oven at least 4 or 5 times before first use) this skillet is great. My only complaint is that the grease catch on one side and the wide lip on the other makes this just a bit narrow for my taste. Overall though, it is a great product.",
        "Wanted to love this because we've always used plug-in griddles that have lost their ability to heat after awhile. Couldn't ever get this to work for us. The cooking was always uneven, either too hot at the back or too low at the front, no heat in the middle where there was no burner. I lost a lot of food into the \"gutter\" as I was trying to catch it from getting away. Usually ended up with a big mess (like hibachi) in the end and food that was either overcooked or undercooked. Very heavy to lift. Upkeep is more than I wanted to invest since it needs to be \"oiled\" after handwashing. Went back to using electric griddle.",
        "High quality! Love this griddle. I have cooked Brauts, Steak, Chicken breasts, cubed Chicken, Pancakes, Bacon, Eggs (scrambled, fried, omelette), ribs....oh, them ribs man!, fried noodles.....and more, but damn this is a good piece of cookware! I use it on my glass top cook top with no issues, just need to be mindful when moving it around. If you use on a glass cook top, you will notice the separate hot spots above the burners, so the middle of the griddle isn't as hot but this is the nature of that type of cook top and not a flaw with the griddle. Very happy with this purchase.....now let's cook some food!",
        "Everything sticks to this no matter how much oil I use. Also I bought it mostly for pancakes and again, they stick and since the surface has texture it doesn’t work well. Also even for grilling chicken with the gril side - it just sticks and makes a mess. Id return it if I still could - just collecting dust....",
        "The flat side of the pan is pretty useless because it heats so unevenly. Makes sense because it’s got big gaps on the side heating up. Bacon ends up both burned and raw. Nice idea that really should have never left the testing stage.",
        "Used this 3 times so far, just got it a few days ago. LOVE IT!!!!!!!! I have a stove with the glass top and I was worried about uneven cooking since I lay it across one large and one small burner but it works fine. Used it for caramelizing onions, cooking veggies, sausages and eggs. Very happy with this and HIGHLY recommend.",
        "I seasoned it as per a previous review and it works great for pancakes, which is really the only thing I have used it for. I was worried about the pancakes sticking, but I have had no issues. Plus, since it is seasoned appropriately, the cleanup has been a breeze. The downside is that I cannot get it to heat evenly. This isn't really the fault of the griddle, but a function of my burner placement. It is too hot directly over the burner and too cold in between. Perhaps if this were used on a grill with an even heat source underneath it would be great. I am going to buy an electric griddle instead.",
        "Do not make the same mistake I did. The first time I used the grill side I applied a tbsp of canola oil and tried to grill some marinated pork chops. The \"pre seasoning\" was useless. The chops immediately stuck and burned onto the grill. The worst part is that I add to use oven cleaner to get all the burnt on residue off. Now my grill looks blotchy and discolored. I never had any such problems using my Wagner cast iron skillet. I can't even return it because it is too damaged. I am so disappointed.",
        "Wow. Don't bother spending the extra money for the Lodge Grill Pan. Ungodly heavy. Coating peals even after seasoning pan regularly. Ridges so high the food does not cook well. We have 2 grill pans we use side by side to cook everything in the grill. One is this Lodge grill pan, I only wish I knew the other brand - I'd order more. We cook everything we can on the other brand and save lodge for fish only. We've tried other meats vegetables etc. on the Lodge. Meats cook to slowly. Vegetables (carrots, beans, etc.) get caught in the deep Lodge ridges. Very disappointed for the price.",
        "Just as expected. Well worth it to spend a little more to get the name brand, seasoned, larger size with handles. Anyone that cooks with cast iron knows that they will last a lifetime (I still use my parents Lodge that's over 60 years old) and I've probably been through 4 Forman grills and 5 non stick skillets in the past 10 years. Also wanted one that trapped the fat and the channel reservoir and in this regard it worked well.",
        "Once you've used it a few times to season it, it's great. We use it for pancakes a lot. It's a nice size for making 6 medium or 8 small pancakes at a time. I far prefer it to the electric griddle previously used. The first batch or two of pancakes was a bit of a disaster because we didn't season it first, but now that it's seasoned, it's perfect. It gets hot fast and it cooks evenly. Does not stick much anymore - just makes sure to oil it. Also, it's quite heavy. Would make a nice weapon if you're strong enough to wield it!",
        "I don’t think this is a real lodge product. It rusted immediately! I have 3 other lodge products that I love including the identical iron at our cabin. It does not rust like this. I washed it lightly with a mild detergent to get the rust off, the black coating comes right off. Waste of money.",
        "Bought this to replace the aluminum non-stick that comes with the stove (non-stick lasted about three weeks...) This griddle is heave cast iron and fits well on the center section of five burner stove. The grill comes pre-seasoned, but oil each time it is used will improve the finish. Nice even heat and perfect for frying eggs or pancakes. Remember to heat slow and keep the flame low for best results when using the flat side. For grilling meat, turn it ip to high and it will sear nicely. Very nice product.",
        "You need to have a bridge burner AND TWO burners for this pan to heat evenly. This was a huge disappointment. I have since purchased a family size electric griddle for the same price (maybe less) that COOKS EVENLY.",
        "Maybe I’m spoiled from the easy use of nonstick surface pans. Maybe I enjoy throwing dirty dishes in a dishwasher. I suppose I’m a sucker for being able to move a pan while in use. Maybe I like food evenly cooked. Or you don’t like rust to appear if you leave a drop of water. If you’re one of those people like me, take a pass here.",
        "Quite disappointed....I thought Lodge was a trusted brand, but the \"pre seasoned ready to use\" iron griddle was not....made 3 egg-n-a holes and they seriously stuck. Even though I added extra grease to be on the safe side. I have multiple iron skillets that I use and have never had quite this bad of sticking...just really disappointed.",
        "This is my first cast iron grill/skillet and I love it. I use it often. Great for steaks, grilled chicken, burgers, eggs, pancakes, bacon, home fries and other food. The distribution of heat to me is fine and I have no issues. It's easy to clean and to oil up. My only complaints are the handles and hight of the edges. Food tends to fall in the hole when moving it around since the edge isn't high.",
        "We sold my last griddle with the grill it came with. I expected this to be an upgrade but the hot spots that exist on this griddle scorch half of each pancake around each burner. Also, I like the idea of a grease catch on each side but it takes so much cooking space, I actually cook less pancakes/grilled cheese/french toast/etc with this \"bigger\" griddle. Oh well, the search continues.",
        "I bought this Lodge Pre-Seasoned Cast Iron Reversible Grill/Griddle With Handles, 20 Inch x 10.5 Inch to replace a griddle and indoor grill pan that I had, thinking it would save space having the two in one. It is extremely heavy, which again, I thought would be worth it given it is two in one. It says that is is Pre-Seasoned. I have used it several times and have yet to make anything that does not completely stick to the Grill side. I am extremely disappointed so far. I will now go back and try to help the situation by seasoning it myself.",
        "This skillet is on the large size which is perfect for laying on top of a bbq rack for making smash burgers or cooking up meat for tacos. I found it easy to clean and the heat distribution to be excellent. I would only suggest this product as it’s craftsmanship and build is top notch and we love it. Made in America which also a huge plus.",
        "Was hoping to use this while we are in between outside grill. BIG MISTAKE! This girl is IMPOSSIBLE to clean. No matter what product I use, no matter how hard I scrub, even cleaning it warm nothing works. Would not recommend you buy this grill",
        "I love lodge. I have been using their cast iron products for years and will continue to do so if properly taken care of. I have this item along with frying pans and dutch ovens that I have cooked on open flame and my brand new glasstop stove with no issues. Follow instructions on care and cleaning and this will treat you well for decades!",
        "Love my reversible griddle! After struggling to flip pancakes in my cast iron fry pans for years, I finally gave in and purchased a griddle. (I make lots of blueberry pancakes for my grandchildren.) Wish I would have purchased one years ago! So much easier to flip those cakes without burning my fingers on the edges of the fry pan and no more pancakes flipping on top of each other because there’s not enough room in the frying pan. Worth every penny!",
        "This has to be the worst cast iron skillet ever made. Co. claims that skillet is seasoned,I seasoned it myself and have seasoned it several times since I bought it. Everything sticks. I would not recommend this pan and I wish I had returned it instead of trying to season it myself. Skillet is very heavy and awkward to wash in sink.",
        "The finish. The cooking surface is so rough I can't cook a decent egg. All my other cast iron skillets, Dutch ovens and griddles are smooth, including older Lodge pieces. Is this what we're becoming?",
        "It is heavier than I thought so will not be using it as much as I thought I would. Would be fine for a young, healthy person but I am old and not as strong as I used to be. Although it says it is pre-seasoned and should not stick my over-easy egg did stick and turned into scrambled. So far everything else has turned out well but they all had some fat in them. Hopefully it will not stick as much with use.",
        "Very nice griddle overall. I replace a less expensive (I believe it was aluminum) griddle and man what a difference! This thing holds and spreads the heat nice and evenly. I now used to for everything from burgers, frying fish, heating tortillas to making pancakes and breakfast like at a restaurant. The only drawback is the handle design in my opinion. I have a gas stove and the flame does come up through the handle holes making that area very hot and can even burn food nearby. I did measure our burners to make sure if covers them, which it does (for a Wolf Range). Overall very happy with this purchase! Highly recommended!",
        "I love cast iron, but this is has quickly become my favorite piece I own. I recently got a new oven where there is a middle burner for a grill pan. This piece is pretty enough to leave out at all times. It is a little bit big for the space, but if you heat it long enough and do a water drop test, the whole thing does get hot. Made burgers and bacon just last night, and was able to toast the buttered buns on the less hot spots.",
        "Great for cooking on the grill or over gas. Cooked a whole pound of bacon on it and the drip catcher allowed it to hold all of the resulting grease comfortably. Gives tons of surface area to work with and holds its heat well. Doesn't work too well if you aren't cooking with gas, however (cold areas between burners on glass top stove), something to keep in mind. Handles make cleaning and general handing easy. As with cast iron in general, this thing is indestructible and will probably outlive you.",
        "The pan itself is exactly what you expect it to be as far as durability and quality. It’s Lodge, so you know it’ll probably outlive you if you treat it right. My issue is that I paid extra for a pre-seasoned pan that was ready to cook on, and either that’s not what I received, or the pre-seasoning job was inadequate. Everything that touched this pan stuck to it on first use, including a dry, halved English muffin. I ended up spending 20 minutes scraping and scrubbing to get everything off of it, and ultimately had to re-season it myself the way I do my other cast iron pans. Lesson learned. Save $10, buy un-seasoned and season it yourself.",
        "I have always loved Cast Iron and hate to clean grill grates so I ordered this to place on top of the grill to cook on. Now my grates stay clean and this Cast Iron Griddle eliminates hot spots. Good if your cooking for 3-4 people but is not recommended if cooking for a larger family. Item came quickly and we'll protected. I definitely will be using this Vendor again for all my Cast Iron products.",
        "I've been using this for 3 years now, and overall, I'm not very happy with it mostly because it cooks so unevenly on my gas stove. I end up with 2 circular hot spots and a cold spot in between. I have to keep shifting the food around and rotating it to get things to cook evenly, which is a pain. And it doesn't matter how much time I let it pre-heat. I would never buy one of these again and I'm currently shopping for a new hard-anodized griddle like my other griddle I also need to replace (which does a great job of cooking evenly despite being warped and using it over the largest and smallest burners).",
        "I was very excited to get this griddle and I love Lodge products but I've had it a year and I'm generally disappointed. It is quite heavy and substantial. Preseasoning is excellent but requires occasional seasoning. However, this griddle does not heat evenly. I've been using it for pancakes and such on an electric cooktop. It has severe hotspots and takes close to 30 minutes to heat evenly enough to use effectively. This is probably a function of the grill grates on the coil side. A flat-flat griddle would likely work better.",
        "This product is the most used item in my kitchen. I can grill steak, chicken and any other protein or vegetable on one side flip it over and make eggs, pancakes and many more on the flat top. Such a versatile kitchen tool. I will have to admit that it is not the easiest to clean the grill side with all the grooves, but by using my chain mail it doesn't deter me from using it over and over again.",
        "This griddle/grill is great to use on the stove top! Making a big breakfast just got easier! I can make pancakes, then bacon and eggs all on the same griddle. Even though is is very heavy, It's much easier to clean just the one item than 2 or 3 pans. I like that it also has a little trough for old grease and butter you can just slide it all to the trough and add clean butter/oil. We've made fish and chicken on the grill side, and have really enjoyed using it and knowing it will last a very long time!!",
        "This is a fine grill griddle but it will take some time and use for it to become properly seasoned. Although it's described as per-seasoned, it's not possible to fry an egg on it \"as is\". Hopefully over time with use and added oiling, it will become seasoned sufficiently to cook most items without them sticking to the griddle.",
        "Fits on my Camp Chef Everest and works like a dream. It's heavy. Soooo heavy. I found a suitcase. Inside a pocket of the case, I slip this in and in the body of the suitcase, I put the campchef Everest inside it's own flimsy thin case (that I don't like) and zip them both up together. I'm a big fan of lodge.",
        "Wow! This is the 3rd griddle I’ve bought and this has proven to me that Lodge is simply the best! I took it out of the box, gave it a wash, heated it up and piled it. This morning I used it for pancakes and was so pleased. No sticking at all, very even heat distribution (I have a gas stove) and super easy clean up! I 100% recommend this griddle. I can’t wait to do some steaks on the other side of it!",
        "Its great. You have to appreciate cooking on cast iron to benefit from this. If this is your first foray into cast iron cooking, start out with a pan. You will have a hard time with uneven cooking while cooking over two burners. Once mastered theres nothing better for steaks, burgers, or any other grilled foods. I use the flat side almost exclusively. Also use metal utensils on these. 5 stars because its a very heavy duty piece of cast iron. Its just a hunk of metal and a very high quality one at that. Cant blame the pan when your pancakes stick to it. You either went too hot or didn't use enough butter.",
        "Heavy and flat. Distributes heat pretty well. Have used on a gas stove and the grill. Even though it comes \"preseasoned\" still do your own seasoning first just like you would with any cast iron pan. Pretty easy to clean. Retains heat for quite a while and can do double duty as a place to keep things warm if needed.",
        "Don’t buy it it’s not nonstick I did exactly what they said about how to use and the first time I wanted to cook was pancakes it got stuck and it’s not easy to wash.",
        "If you love to cook and even if not, this griddle is wonderful. I have bought pans and griddles in the past made of steel and aluminum and all have one large drawback, they heat unevenly. The second problem with many, they warp and do not sit flat when they get hot. this cast iron unit stays flat and the heat is much more uniform, I love cooking on it.",
        "This is a heavy piece of cast iron but we love it and use it all the time, mostly for the grill aspect but we've used it as a griddle a few times as well. Can make a lot of food by placing it over two burners. Heat distribution is excellent. So glad we bought it when our previous grill pan (which wasn't cast iron) was looking pretty ratty (it had non-stick finish). Will last a lifetime with proper care.",
        "Great versatile product. I use it in my kitchen then bring it to camping as well. I had a hard time with heat distribution but only because of the way my burners are on my home stove. A great product and I would highly recommend. Just follow instructions for cleaning CAREFULLY!!",
        "I wish this were a bit longer. My stove top seems a little longer and the flames come out the handle holes if up to High. I would rather it over extend a little than have flames shooting out the handles. Seems to heat wave my. Masonry really need a high glam as it retains heat well. Just which o had sent with the rectangle one.",
        "This is one piece that is 2 sided. One side is flat top and other side is grill. I love this for the flat top. It's seems really heavy and it's all one piece. I have the center part on my stove and it sorta fits. The one sided thing makes it so you can't really use the flat top then the grill, you have to wait until it cools down, clean it then reheat and grease it again. The grill side didn't do so well with frozen burger patties, Walmart brand at least.",
        "Purchased for a gas stove that has a middle long burner. Works very well but is HEAVY. This burner takes up the entire center of my gas stove and spills over a bit onto the pan burners. Be aware as it may limit how much other cooking you can do if you have a normal 5 burner gas stove to use for this. It comes seasoned but since it is cast iron so be sure to keep oiled and clean.",
        "This is as close to a grill as we could get, given that we do not have any space outside for one. I love this product and am glad to have bought it. I can grill on the stove top over two burner and get those awesome sear marks or I can grill in the oven and get some nice heat for my meats, flat breads etc. Worth the buy.",
        "Great grille/griddle, I have learned how to properly maintain cast-iron pans and this one has held up well. I use it on both my burners. I notice some reviews regarding uneven heat dispersion; The stove and burners plays a large role in that as well. Cheap rental unit stoves do not have the great heat dispersion that higher quality stoves do, i used this pan on three different stoves ranging from rental unit to high quality, and there is a huge difference in heat distribution with each stove. So I am not going to say the pan has poor heat distribution properties. Would recommend this for home use and camping.",
        "I bought this for my husband’s birthday and he is thrilled with it. He uses it on our stovetop and in the oven. I personally don’t have much patience when it comes to caring for cast iron, but I love when my husband cooks with it. He has made steaks and veggies and uses it whenever he can. One side of this is flat and the other has grill wedges. We are able to store it in the drawer below our oven. Overall this was a good purchase.",
        "We decided to replace our non-stick double burner grill, which we only used occasionally, with the Lodge. Was apprehensive because of the weight, but now that we have it weight is not an issue for us and we use it at least 2x weekly , rather than a few times yearly with the older non-stick! Truly a pleasure to use and I love the way our food tastes. We like it so much that we have resurrected all of our cast iron pans!",
        "This griddle is really heavy which you expect with cast iron but is also very narrow and because of that doesn't fit across standard stove top elements. I really wanted this product to work but it just never really did. Used it on camping trips when Glamping but it's too heavy for anything less.",
        "So we purchased this griddle a month ago, didn't seem to have any issues. The other night we flipped it over and grilled some steaks on one side and that was a real mess to cleanup, everything sticks to it. This morning flipped it back over to cook some pancakes and they completely stick to the griddle, what a mess. Need a chisel to clean it now. I will by a non-stick griddle and hopefully return this one.",
        "I forgot how nice it is to have a griddle until we got this one. Lodge is the best for cast iron. It is already pre-treated so you can wash it off and use it right out of the box. It also makes subsequent seasonings easier as it has been season correctly the first time. The griddle works great. One tip, if you are using oil, grease or frying bacon, make sure to keep an eye on the grease well. We fried two packs of bacon and I spooned out the grease a few times while cooking.",
        "My wife finally agreed with me that cast iron is the way to go when cooking on the stove top. So I got her one of these so she could see how great it is for other things too. She loves this thing so much that she keeps trying other things on it (my greatest reward). And the clean up is so easy that I don't mind helping after she's done cooking.",
        "The product is solid and does the job. I purchased for the flat top for pancakes, but the grill side is an issue due to my electric range having sensors. Sense it isn't flat it gives an inaccurate heat so i have to turn it up all the way. Still looking for an all flat one havent found.",
        "Cooked 4 pieces of steak on it a few days ago. They were perfect. Heat distribution was perfect allowing me effective control of the cooking process. 2 old griddle plates i bought from costco and amazon bothe warped from over heating. This professional/ solid iron shows no sign of being affected by heat in any way. It is my money well-spent at half price.",
        "The heat distributes fairly evenly, but watch out because it can get too hot too quickly. There may be a bit of a learning curve if you aren't familiar with cooking with cast iron, but stick with it because its worth it. I like that this is two-sided for various needs (from pancakes and eggs, to grilled burgers and fish). Husband seems quite happy with it. Highly recommend.",
        "Great buy! First, read the instructions. Second, cook food on low for first few times to let grill season by absorbing and adding to the non stick coating. Add oil before you add food. Clean with salt. Dont use soap unless have to. I love it!",
        "Best griddle ever!!! This thing is built to last forever. Replaced my warped $90 high tech coated griddle, with this ultra heavy duty model. Best $40 ever spent!! Used Crisco vegetable oil to season it. To season I used a very light coating of Crisco oil, in the oven at 400 degrees for 40 minutes and let cool for 10 minutes or so. I repeated this process 3 more times. Don’t put too much oil or it will become sticky... This griddle is super easy to clean, and a pleasure to use!!! Beware though, pan is very heavy, and is built to last. Just finished making homemade waffles this morning, and they came out perfect!!!",
        "I bought a used commercial grade 6 burner gas stove and wanted a skillet to grill onions, bell peppers, and stuff for fajitas. This griddle stretched across two burners perfectly. Now I can grill several onions and bell peppers all at the same time. This skillet came pre-seasoned, which is good. Saved me the work. This skillet is HEAVY, very well made. Very pleased with my purchase.",
        "The Lodge is the name to look for. It fit the gas stove just right. The first pancakes were right on. She did good and like the Grill/Griddle very well. Happy Wife, Happy Life!",
        "Outstanding addition to my bbq grill. Worth every penny. You can also use this on your stove - covers two burners. Cast iron gets super hot and holds heat like nobody's business, so you get super great sears. I've cooked steaks, pork, fish, shrimp and vegetables on this bad boy and they all come out excellent. Just remember to spray it down with a little cooking oil and let the griddle get piping hot before cooking.",
        "My wife loves this grill. It fits perfectly over two eyes on our gas stove. She has cooked several different foods on it and all have cooked even. We both enjoy the flavor and even the appearance after cooking. From pancakes to eggs, bacon, sausage, hamburgers, steaks and hot dogs, it gets the job done right.",
        "Everything Lodge makes is of outstanding quality, and this grill is no exception. It's heavy enough to sear, and retain heat. It comes pre seasoned but getting a better seasoning coating on it makes it really non-stick. What to say? It cooks great, is a perfect product, and it will last forever if used and cared for correctly. It's made in the USA and the price is right too! Go Lodge!",
        "This thing just gave me so many wonderful options. It has a nice, large footprint but not unwieldy. I’m finally able to make kickass smash-burgers on one side and delicate grilled fish filets & veggies on the other without worry. It fit perfect on my grill and came pre seasoned.",
        "Ordered a month ago and the first time I use it, as soon as it starts to get hot, it made a noise and a big crack appears on one side. But I order a replacement and it has been really good, my only concern is the durability that's why I'm giving it 3 stars, if it lasts for a few months I'll change it to 5",
        "I really like the flat surface of this griddle though like with my other Lodge cast iron products it wasn't really great until I took the time to sand down the cooking surface and make it smooth before using it. If only they would add this step back into their process and make their new stuff as good as the old stuff. Surely this can't be where all manufacturing is going. The grill side works pretty good for chicken and stuff like that but I don't use it that often.",
        "A great product but beware that it is extremely heavy - so heavy that I could barely lift it out of the box, much less move it from stove to cabinet for storage. This would be best if kept permanently atop a six burner stove. I had to give up and donate to a resale shop. Also, not returnable on Amazon. This should be posted at the point of purchase.",
        "I bought 3 total units like this one from different brands to just look at them. I kept this one. It is the best quality. The ridges are spaced well apart so it is easy to clean. It has a groove/well on the side that can hold a good amount of oil. It came pre-seasoned. It does take about 6 minutes to heat up. The heat is even throughout, and it is very thick and heavy. It's a high-quality product. I love it and recommend it to everyone. If you are looking for something like this, search no more. This is the one.",
        "It came \"seasoned\" but I added more oil to assist the nonstick. Everything sticks way worse than my stainless pans. Giant waste of money.",
        "This is nicer than i expected!! I was looking for a grill mat/pan and eventually settled on this because I've had good experience with Lodge products in the past and this has a nice \"lip\" on the edges to catch grease/juices while grilling....gotta keep that grill nice and pretty. Plus, cast iron will last a lifetime (if properly cared for) as opposed to pretty much every grill mat I saw which specifically stated it was only good for a certain number of uses.",
        "This is a great addition to my grill. The griddle heats up evenly and holds it heat very well. Anything I cook on it - from bacon and eggs, to steak or more; just seems to cook so much better than just over the open grill. Very solid surface that is ready to go. I followed the suggestions for prepping and using it (from the manufacturer's website). Keep it well cleaned and oiled - and I'm sure it will last a very long time.",
        "If you have never had a cast iron anything, be warned. They are heavy. My kids can't really move this around without almost breaking my counters or my tile floors. When in use it is hard to adjust because the entire thing is hot and heavy. So get it in place and don't move it till done. Also, don't forget to oil after cleaning or it will rust up really quick, like hours.",
        "Use it almost daily. Really gives food an authentic grilled taste. Haven't used it in anything but the stove but I like it's versatility. Not as easy to clean as I thought would be, but I think it has to do with my misconceptions of cast iron and gets better with use. If you read up and keep up on good cast iron maintenance, this grille can be used a lot and often, for an extremely long time, and in many different ways.",
        "I bought the Lodge grill to replace an old LL Bean aluminum grill that worked well but had an aging nonstick surface. I have used the Lodge a half-dozen times on the same Jenn-Aire stove as the aluminum griddle, and have found--unlike the aluminum model--that the Lodge will not heat evenly, even after lots of experimentation. Pancakes are burned on one edge and uncooked on the other. This is a defective design, and the failed heat distribution pattern is surprising, given the heftiness of the griddle. I do not understand how this item remains on the market, much less why it gets good reviews.",
        "My wife made me buy this because she said my breakfast cooking stunk up the whole house. I use this on my Weber 3 burner spirit grill, and it works better than the indoor pans, and a simple wipe is all that's needed to clean up. The backside works great for fish, too.",
        "I use this almost daily. The heat distribution is fantastic. I use it for meat, eggs, potatoes, pancakes, and potato pancakes. Highly recommend. I've used cast iron pans for many many years and always wanted a stove with built-in griddle. Now I have it!",
        "I bought this as a gift and i am so embarrased. It is NOT GOOD. It is heavy all but thing stick SUPER bad even after you oil it. Its not good with heat distribution either. I hate it. Wish I didnt buy it. Want to send back.",
        "Got this for my girlfriend to add to her cast iron collection. She loves the ridge parts of it when cooking steak and the flat for pancakes. Holds heat extremely well, and can even be used over a campfire. Lodge is a great brand for cast iron, and I can't wait to try their other products.",
        "I was so excited this arrived and couldn’t wait to use it. I cook only once, and washed it with water and mild soap as the instructions suggests. Dried it and left it in the kitchen counter. In the morning, I come to this! This is such a bad quality product.",
        "We cooked our first Rib Eyes and couldn't be happier! Both gas burners on medium heat, and in about twenty minutes, voila the temperature was perfect for our steaks. We can't wait for Bacon, Eggs, French Toast, and Pancakes on the Flat Griddle side",
        "Purchased as a gift which was well received, given it was meant as a replacement for lighter gauge pan that had warped due to heat. Due to frequency of use, recipient leaves it sitting out on stove top. Item is heavy for the older generation.",
        "Bought this to go camping with. Did three rounds of Flaxseed Oil seasoning before leaving. Worked great to get even cooking times on all of my foods. Was a tad small for my group size (12 people), so it was pretty messy when I finished, and then I left it to cool too long before cleaning. Suffice to say I'm still learning to cook with Cast iron. Was a great use paired with a Camp Chef Everest, and Grill Master welder quality grill gloves.",
        "I am so in love with Lodge cast-iron and I needed to add this to my collection. I did season it, though you probably don't need to first time around. Works perfectly! I have a five burner gas stove so it works well either in the middle or the side two, depending on what I'm cooking. Cleans well with my chain mail and warm water. I've made pork chops, eggs, fried sandwiches, bacon, etc. on it and they've all turned out great!",
        "If you follow good cast iron practices this is a great item. I also use it in the oven. I leave it in the oven white its preheating then I throw my salmon on the grated side. Cooks very nice that way. I've used it for pancakes, burgers, and steak. I can't complain. Been using it just under a year.",
        "Been looking fir a versatile griddle that I can use with my grill or inside on top of my gas cooktop. This fits the bill. It is a flat griddle on one side and the other side is a grill top. This heavy ! (Cast iron) Great for pancakes reheating pizza or cooking burgers",
        "I use this on my vintage gasoline Coleman two-burner camp stove. It's size is perfect for this stove. As long as you care for it correctly it will out live you! After over 15 years of use, this gem is still performing beautifully!",
        "we almost didn't get this because we worried we wouldn't use it, but it's become a permanent and well-used fixture on our stovetop. perfect for eggs, pancakes, burgers, you name it. we also take it with us camping, which has allowed us to cook some great meals for a big group. we've had it a few years now, and i cannot recommend it enough.",
        "Just used it for pancakes and LOVE it! I do need to say that I returned my first one because it had a couple bubbles near the handle and that made me nervous cuz they popped when I scraped them. After receiving my second one that also had bubbles I called Lodge and asked about it. They said this happens during the seasoning process as the oil is sprayed on the item it drips off while being heated and sometimes leaves these \"seasoning bubbles\". He suggested I scrape them off and season that little spot. Easy. Done! Cast iron is my favorite and I am so happy to finally have my two-sided griddle =).",
        "At first use, food still wanted to stick. My wife doesn’t like it, however, she does not know how to cook on cast iron. It takes a different mindset and thinking to get used to it. The nonstick is getting better with use and continual seasoning. You’ve got to remember to get it up to full temperature before cooking. The ends will stick if not.",
        "The griddle is formidable in mass but I am disappointed in the actual cooking space. The effective cooking dimensions are 8.5\"W x 16.5\" in contrast to the total dimensions of 10 x 20. Width wise this is because of the 1 inch raised band on one side and the gutter on the other. Length wise there are 1.5\"x 4.5\"crescents on either side making up the easy grip handles. In my experience you can only get a couple of slices of \"artisanal\" bread down at a time or a couple of pancakes. Not the end of the world but does not meet my expectations."
    ]
}