{
    "entity": "Griddles",
    "text": [
        "I was anemic and had to use cast iron for first time. I was little reluctant as I thought it's gonna be hard as these are not non-stick. To my surprise, never once it got stuck provided, the girdle is properly seasoned. Now I can make paper thin dosas (South Indian crepes) and never have to worry about things getting stuck. Very happy with the purchase! Oh, I forgot! My iron levels are back to normal just after 2 months of using cast iron pots and pans.",
        "I bought it because of the reviews 😒 i thought cant go wrong with over 4.5 stars and over 4,000 reviews? When I first open the package i rinsed it with warm water heated up tortillas and realized they had turn black? But not burn? Washed it after use with cold water regular dish soap and black started to rub off. Immediately i thought of returning it realized the black on my tortillas was this material 😡washed it and left it on the table to dry and return it. Couple hours later it turn ORANGE and left a spot on my table! Yes ORANGE! HORRIBLE PRODUCT! I hope non of these materials are harmful!",
        "Listen, I love lodge cast irons. Why I went ahead and bought this one but as you can see from the picture - it looks used, it didn’t come with the label that typically goes around the handle, and the letters on the bottom are rusted. I’m not down with the used product that I bought as new. I’ll change my review if this is amended but for now I’m annoyed.",
        "Product is supposed to be pre-seasoned and it arrived rusty. It is rusty around the words on the bottom and along one top edge of the pan. There are holes in the product in the cooking surface and also on the bottom. If I still had the label attached to the skillet I would return (tossed the label and trash company already picked up). Very poor quality control. Amazon also did not package shipment well since I also ordered a 9\" skillet and some other things among them a book and the book was pretty destroyed due to the cast iron pans sliding all over in the giant oversized box.",
        "Gets hot too fast, batter sticks to the pan even though I followed instructions to preprocess it (apply oil, bake it, etc). could not use it at all. total waste. could not return it so keeping it.",
        "2nd time I have purchased this product. The first time I thought I had made an error in cleaning it as the finish began to. Come off. Well guess what, 2nd one is the same, after 6 month of use and care the finish comes off and makes the product unusable. Fine black chips of finish come off onto the food. It is potentially unsafe. Big shame.",
        "Wow, what is not to like about Lodge cookware. I purchased this to cook my husbands eggs. Although it is seasoned I still put just a little Crisco on it each time I use and wash it. It has not disappointed. The eggs come up with out sticking and cook very evenly. I will add, being cast iron, it conducts temperature very well, and I have found I need to reduce my stove temperature to keep from burning my eggs. I have used it for grill cheese sandwiches (perfect), warm tortilla shells, and grill some hotdogs on the stove top. I use it all of the time.",
        "If you would like some additional info or photo's please comment and I'll update the review with any new info I can. As far as cast iron cookware goes this is decent. I have no complaints with the fit, finish or function. Two tips; Check the edges of the pan. Ours came very smooth and buffed down. You'll want to make sure you season it there so it doesn't rust. If you take this camping; when you go to pack up you can fit this into a gallon ziplock back. It's a super tight fit but it'll keep everything clean until you get home.",
        "This is my default, go-to pan for anything what isn't super wet and/or doesn't splatter and make a mess. I originally got it for 10\" tortillas and it stole my heart. I have a pile of expensive stuff in my kitchen le creuset and all-clad and such, but this thing just rocks. I got after it with a flapper wheel and angle grinder to smooth it, seasoned it with some flax seed oil and it's my absolute favorite pan BY FAR! Cast iron absolutely kills it on induction cook tops. Wonderful value, construction, and durability.",
        "I've loved every Lodge product I've ever bought, but I had problems with this griddle from day one. I could never get it to heat evenly — supposedly one of the great benefits of cast iron — and I could never get the pan sufficiently seasoned that pancakes didn't stick to it horribly. Finally, I was heating it up one day, on medium heat, and it sprouted a big fat crack down the middle. On the stove. Heating up. Not doing anything a cast-iron griddle shouldn't do. I'll contact Lodge to see about that lifetime warranty, but I find returning products a pain, so I thought a review was in order nonetheless.",
        "Love it! Bought this to make dosas but was very happy to see how it’s cooked parathas and cutlets!!!! Beetroot cutlets in the attached pictures turned out to be very well cooked. Slow heat makes the cutlets and parathas cook perfect!!! Cleaning is easy. But if you don’t wipe immediately, it will rust. So wash it, wipe it and apply some of oil. Or the easy method - don’t clean after use till the next use ;) the oil from parathas/ cutlets keep it from rusting. Wash it right before using it next meal( This lazy method works if you cook every day every meal )",
        "I purchased this pan because of a review saying it was great for dosa. Not so! It is Lodge, so the surface is rough. It didn't mater that even though it was pre-seasoned and I seasoned it again 4 times, the dosa stuck like glue. Because I can use it as a griddle for other things, it still gets 3 stars. But do not order this if you want to make dosa. Go to the Indian store and get a coated pan. Was able to use it straight out of the box (after washing).",
        "So completely disappointed in this! My crepes stuck no matter what I used... spray oil, butter.. it was a mess! Would throw it into the woods if I didn’t want my money back I’m so mad!",
        "The pan is made up of cast iron which makes it susecptible to rusting if not seasoned with a coating of oil after thorough cleaning. It is sturdy and cooks well. However, my food keeps sticking to the pan. I have a similar pan from target which doesnot have this issue.",
        "We love using cast iron cookware, lodge products Are USA made which is a plus in my book. This griddle is top quality just like our other two frying pans also made my lodge. I see a few reviews complaint of rust, well first off you only clean a cast iron product with very hot water and a plastic scrubber, that’s it! No soap! Your product issues are user error and not the product. I just got this today and have already used it for supper, nice crisp potato cakes! Washed and dried up nice. Remember to oil your cast iron before you put them away and season them every 6 months.",
        "Replaced a Teflon Coated Griddle to have a healthier option. This cast iron griddle works great; takes just a little longer to get up to temp but holds heat really well. French Toast, Pancakes and grilled cheese all cook beautifully. Was easy to season the griddle, clean with salt, water and scrubbing pad, reheat to dry off. Wont be going back to the Teflon Coated Griddle. I like the size but, if your cooking for several might consider a larger or second unit. Was poorly packaged for shipment; handle was sticking out of box when it arrived. But, its iron so no damage.",
        "I ordered it around 1pm and received it at 5:30 the same day!! That was super quick service!! Anyway, Lodge is a well known brand and they do make good quality cast iron cookware. I’ve been using it almost everyday since I got it. You do need to use a little more oil than usual when you start off using it, but it’s a way healthier alternative to non stick pans. It’s waaaay heavier, but you can give your arms a mini workout every time you use it 😛. I don’t put it in the dishwasher. I hand wash it, dry it and apply a generous layer of oil all over the cooking surface to avoid rusting.",
        "I use cast iron a lot. I have woks, skillets, dutch ovens, lids (extra lids are good), and even cast iron garden stakes! Point is this pan design is amazing. Low edges makes getting a spatula under an egg, or pancake, or juevos rancheros, or ANYTHING super easy. Heating up naan or breads on this thing is top notch. Talk about a brilliant portable seasoned flat top that works on energy efficient induction stove tops. This thing ROCKS!",
        "Texture is more like sand than smooth. This is not grandmas cast iron. My old cast iron is smooth and almost polished, this may get better in twenty years. I’ve had no issues with the seasoning and honestly, that takes time despite ur being preseasoned. It’s not near as non stick as higher priced. My omelets stick on this even with large amounts of butter. This is not something I had an issue with on my old one. And if I wouldn’t have already used it, I’d order a different brand. It’s perfectly acceptable just not a great texture.",
        "I love this little skillet. It seems to fit one package of brussels sprouts perfectly. I like washing them, cutting them in half and placing them flat-side down in this pan with olive oil. I keep the pan ripping hot and essentially fry the Brussels sprouts until they're almost blackened on the bottom. I prefer this pan to a bigger cast iron skillet because it has low walls. This allows steam to escape the sprouts without steaming the veggies. It keeps this nice and crisp. As with all of my Lodge cast iron it's easy to clean and maintains a patina well.",
        "I have owned cast iron pans for many years. I know how to use them and clean then. The first time I used this to make pancakes it left burned stains on the pan. The pancakes were not burned though. I washed the pan right after cooking. Tried to clean the burned spots but instead stripped a layer of the pan. Very disappointing wonder if the ingredients of the pancakes were not good for the pan. Not sure of I can return since it's used. Also I am staying at home due to COVID-19",
        "I've been a fan of Lodge cast iron for more than 50 years or so. Cast iron is terrific. This 10 1/2 inch griddle suits me fine. I use it for searing steak u/ broiler, homemade pizza, tortillas, calzones, quesadillas, focaccia, socca (a French thick chickpea crepe) or any kind of crepe! and roasting veggies too! There's nothing like roasted root vegetables. Roasting adds such additional flavor to the veggies, brings out the sugar in them too. Great for eggs, any kind whether fried eggs, scrambled eggs, or whatever kind of eggs! Just the right size. Easy peasy clean-up too. Yup, I love my Lodge cast iron bakeware! :)",
        "We love this cast iron griddle. It’s extremely versatile and supports a variety of cuisines and needs. We use it for Pakistani/Indian parathas, pankcakes, dosa’s, pre-bake pizza dough & crepes to name a few. The griddle comes seasoned but we purchased organic flax-seed oil as well since that’s supposedly a good oil for cast-iron seasoning. We were a bit concerned about the diameter when it first arrived but it ended up being perfect for our needs. As all cast iron, this will rust if not adequately dried after washing. There are tons of how-tos on the internet to remove rust / re-season if you ever need to. Excellent price for a high-quality product.",
        "I love Lodge cookware for all my cooking needs. This pan is versatile for pancakes, grilled cheese sandwiches, eggs and many other flipable goods. This is a complete circle using this non a glass stove could result in breaking the glass. But for other stove types or outdoor cooking this brand is your best option. It comes pre seasoned and is recommended to be washed before first use and then reasoned with olive oil or preferred cooking oil. Must have for every kitchen.",
        "I wish wish WISH I would have returned this!!! If I knew better, I would have. The surface of this pan is nasty textured. I wanted a SMOOTH surface not this funky, textured kah-kah. Nope, Lodge doesn't have a place for questions on their website. Apparently, they do NOT want feedback. I am so sorry I bought this. Be forewarned... if you don't want a textured surface,... don't buy Lodge products. The only thing this would seem to be good for is to clean off the oil and turn it into a chalk board. :( This stinks.",
        "This is the second Lodge round griddle pan I've purchased, this time as a gift for my mother as it reminds her of a piece of cookware her father used when she was a little girl. We both love using this pan. This is my most used go-to pan especially for scrambled eggs and pancakes. The low sides make it easy to access and scrape the bottom with a metal spatula. Cast iron is indestructible and you can always get a nice sear on things like steaks and burgers. Lodge always makes quality products and many of their products including this one is made in the USA.",
        "I bought several pieces of cast iron pans that are from Lodge and was dying to get the round griddle. I put this on my list and in no time at all, the price had dropped $2. Yup, I bought it. The lodge pans say they are preseasoned but you still have to work at seasoning them until things don't stick any more. I found that the best thing to clean them with is the coarse salt. The pans do a great job in browning things as they do hold the heat. Looking forward to many years with this pan.",
        "This griddle was recommended very highly by review sights for heating frozen pizza. While it certainly can do that, I found that the pizza was absolutely cemented to the surface and could only peel it off in broken pieces and ended up with pizza casserole. I don't know why it was recommended for pizza because it's not at all ideal for that. I'm sure it works better for other items and plan on keeping it in case I ever need it for that, but as a pizza pan, this does not work.",
        "I have used this pan four or five times since receiving it, always on a low flame on our gas stove, since the cast iron really retains and builds up heat. I have kept the original seasoning, and I feel that each time I use it, the release of food gets better. The one thing that makes this griddle annoying to use is that it is warped. The highest point is in the center of the pan and any oil slides to the periphery. The center of the griddle is always high and dry. Okay for some uses but terrible for pancakes, which is what I purchased it for.",
        "This is the Most Versatile Cooking Item Ever. I've been cooking on this one Daily for the last 5 years, eggs, pancakes, grilled cheese, bacon etc... what ever I'm in the mood for. The seasoning was pretty good on day one but now eggs slide on the surface. Stays on the stove with the Lodge glass lid on. Wash with water and stiff brush while still warm, dry with towel and put back on stove over Medium heat, when its hot add a bit of oil and wipe surface with paper towel then cover, never leave cast iron wet or moist.",
        "Cast iron is inherently not very good at heat distribution, but this is as good as any other iron. If you know how to use cast iron, then this will be on par! Iron is great at thermal capacitance! This item has a sufficient quantity of iron to live up to standard! Surface is not smooth, but is smooth enough! Way smoother than a couple Chinese pieces I was given. !!! Made in the USA !!! Buy it! This will last many lifetimes!",
        "I like my new cast iron griddle. I forgot to get a handle pad so ordered that separate so I can hold the hot griddle, but I like the way pancakes and tortillas turn out on the griddle. Pancakes get a nice golden brown and tortillas get just the right amount of heat.",
        "I received this one this month. Heat is uneven, surface is uneven. bumpy, scratchy surface especially in 1 inch circle area of the grill it looked raw and burnt all the time. Too heavy to return. I don't know what to do. I ordered one many months ago, and it was very good. I gave it to some one else I liked it a lot. I order again and this one looks like damaged ? resealed. Just not the same. Sad. I wish the quality is dependable.",
        "We were under the impression that cast iron, including Lodge products, could be used on an outside grill. In fact, the tag that accompanied the pan said as much. Granted it was at high heat (500 degrees) because we were grilling a pizza, but we understood the the pan could take that high temperature. I tried cleaning it and it two weeks later, the grill \"stains\" are still there. I am disappointed because we wanted this pan to be our go-to pan for virtually everything--including grilled cheese sandwiches, pancakes. Every time I look at it, I go, \"ugh.\"",
        "Pancakes come out perfectly on this. With a little bit of lubricant, there is no sticking at all for me. What I don't like is that it is slightly raised in the center, so if you crack an egg in the center, it will start running for the edges. If it were flat, it would be a 5-star product for me for sure.",
        "Bought this griddle after reading a lot of positive reviews. This is our very first piece of cast iron cookware, and we're hooked! It heats up quickly and stays hot for a LONG time even after turning off the burner or oven. It's a bit heavy, so we do have to be careful not to drag it across the stove. If you're considering getting this, go for it. We use it all the time, so much that it earned a permanent spot on the stove. There was a small hole when we received it. We called customer care and then everything sorted out.",
        "Lodge makes quality cast iron cooking utensils and this tortilla cooker thing is surprisingly versatile. Checked it over upon arrival and none of the casting roughness you find in a lot of iron products was present. It was like all Lodge gear---very well made. I did season it because I do so with all my cast iron gear although a close exam suggested it was not necessary. Under very high heat no warp. We added a silicone slip on handle cover. Very satisfied with Lodge. Price was no part in decision but it is a great deal.",
        "I have been wanting to buy a comal for warming up tortillas for so long. I have been using a square skillet to warm up tortillas and that thing was at the end of its life, so it was time to UPGRADE! The cast iron comal works so great, the heat distributes evenly and it retains heat for a while too. I use this to warm up tortillas, flat breads, naan and I have even used it to make pancakes. It has a permanent spot on my stove and I love it.",
        "Very happy with my purchase. It's very sturdy, easy to clean.....(if you are familiar with cast iron) cooks food evenly, great trusted brand, it came pre-season but won't hurt to do it again before first use. I will use and use again for years and pass it on to my daughter one day. P.S. I got cast iron pans passed down to me as old as 100 years old and they work and look amazing, you can't go wrong with cast iron...you only need to know how to care for them.",
        "I bought this for making tortillas, and it's perfect for the job and so much more. Typically I'm not a huge fan of pre-seasoned cast iron, but this one works. The low sides make it perfect to flip tortillas, pancakes, or eggs easily. It's got some heft (it is cast iron) but isn't needlessly heavy. Cleans up easily with a brush and hot water (I never use soap on seasoned pans). With a little care, it'll last generations.",
        "Works sooo good for our regularly scheduled pancakes breakfasts that my 5 year old demands. I give In cause I like pancakes too, but this pan is awesome. Keep it seasoned, never turn up the heat past medium infact low medium is best. Keep it well oiled, buttered or sprayed while cooking with it and nothing will stick.",
        "This is thing is great, especially for cooking breakfast. Eggs, sausage, bacon, etc.. Some have said it's heavy(it is cast iron after all) but compared to cast iron skillets it is quite light. Easy to clean. Pre-seasoned, but I suggest you go on youtube and follow the instructions on how to season it if you don't know how to already. This will insure that food will never stick to it as long as you put oil or cooking spray on it before you cook something. Easy to clean, and I suggest buying the Lodge handle with this item, as it fits on there perfectly.",
        "i have several lodge brand cast iron pans and other items. Im a fan of the company. However my pan arrived with significant rust on the bottom. I dont mean you can just wipe off and go on. I mean I needed to seriously sand it to get it all off. The rust looked like it left holes almost like an orange peel. Its not expensive enough for me to return plus the damage was on the bottom so I am leaving it. but kinda disappointed in lodge.",
        "Well, well, well. I decided to risk it and buy a “used” in “very good condition” item under Amazon warehouse deals for a little less than regular price and was a bit disappointed. Mainly how it is advertised as “in very good condition” item arrived intact, but had lots of rust on. It’s a good thing I know how to treat and season Cast iron or else I would have returned it all together.",
        "This was purchased as a Xmas gift for the X from our Kids. I have one that's similar (a fajitas pan \"requisitioned\" from a local bar and grill after a few too many drinks while a stupid and ignorant young man) which primary (and frequent) use is for warming/lightly toasting corn and flour tortillas. The Mexicans call this 'La Plancha' or ' La Comal'. Works beautifully. The Kids wanted one at their Mom's too so X got this. She too adores it and swears by it. Good item for cast iron heads.",
        "Great griddle. The cooking surface was not as smooth as I had hoped. Works great on induction cooktops. I gave it 4 stars only because of the rough cooking surface and the fact that it doesn't heat evenly. Pancakes near the center cook much faster than ones near the edges. All that being said, I would purchase this griddle again.",
        "I will never use another baking sheet ever again for biscuit/dinner roll baking. The heat distribution of this griddle is amazing.. Pancakes, grilled cheese sandwiches, the possibilities are endless. It's the perfect size for a variety of uses. It can easily be used on your outdoor grill as well. Read the instructions for cleaning and take care of it and it will last for generations. Fast shipping!",
        "I bought this product because of all the reviews, but I am disappointed. Even though I used this product just once for chicken fillets. And I followed the entire cleaning process too, washing with mild soap and immediately drying it and seasoning with oil, I still have wierd marks on my pan. I think it’s original seasoning has gotten off or something. I am disappointed 😔",
        "This is like an allrounder, little did I know that we'll use it for a lot more than I had expected. I make the entire breakfast on it, scrambles egg, makes omelettes, makes fried eggs, make rotis, tortillas, french toast. Best part, works like non-stick, nothing sticks to it, not even scrambled eggs. Only demands certain maintainence but anybody who is a serious cook wouldn't mind doing that.",
        "This is a very nice griddle. It heats up quickly and evenly. It easily accommodates three sandwiches and browns nicely without sticking. The cast iron finish is quality and cleans well. I like the smaller size of this griddle for easy storing compared to other large griddles. This does the job just as well without taking up space in my cupboard. I am very happy with this product.",
        "Great for pancakes and french toast. Once additional seasoning (all preseasoned or not cast iron has to be additionally seasoned), it has been the go-to griddle. All you need is a silicone handle cover so you don't accidentally burn yourself. Like all cast iron, I just wash with water, give it a light coat of oil and it's all set to go the next time. Griddle will last forever.",
        "I love cast iron cookware and this griddle is no exception. It performs as expected...excellent heat distribution and easy clean up! I've heard folks talk about rust when it comes to cast iron. This griddle comes with \"seasoning\" instructions. Follow them and your skillet will last for years. I have cast iron skillets my mother purchased over 25 years ago.",
        "Bought this skillet because my boyfriend has one he uses for everything and I was a little jealous. Its exactly as pictured. Such a great skillet that I almost used it for every meal at one point. You can cook anything on this thing and barely anything sticks to it. The trick is to keep it seasoned (google it, its a must for cast iron cookware) & only clean it with coarse salt (no soap!) and water. Has good weight but not too heavy. My scrambled eggs come out the best.",
        "Perfect size for the stove top, and for one. Made a NY Strip tonight between not giving cast iron the full credit it deserves for its heat retention and my phone UUUG ...my strip quickly went from the intended medium to well. I was very sad. Lol! As always be sure to clean only w hot water, dry immediately and oil ... I use olive oil in mine. Your cast iron WILL serve you as well as any non stick coated pan, for far longer. Treat it well.",
        "Lodge makes a good product, good distribution of heat and size is exactly what we needed. I will say that the rough texture on the cooking surface can be difficult at times, I have seasoned it 4 times, and it is finally starting to release like cast iron should. Plus I think using metal utensils is smoothing out the surface, which is making a huge difference.",
        "This is a great pan for pancakes or other delicate dishes that need the utensils to make precise movements. My other cast irons that I use have high walls and make it difficult to maneuver so having a really low side wall on this pan makes it super convenient and worth the purchase.",
        "I've purchased this as a gift for 2 other people and when I moved out I bought my own. Most frequent uses are for quesadillas and grilled cheese because the shape lends itself toward wide objects that need flipped. Cast iron is a high upkeep item if you're not familiar with it but once you learn how to handle it, you'll notice it slowly taking over your kitchen pots/pans",
        "Only purchase cast iron with a smooth inside surface, it may look machined or grounded smooth, but that's the best. Rough or unfinished surfaces are harder to clean, and a simple paper towel and oil wrap is not possible without leaving food a bits of paper towel behind. Also with a rough surface, if food does stick you can't get under it with a spatula.",
        "Got this to replace my non stick pan after reaching horror stories about non stick health hazards. The heat distribution is surprisingly great. Only thing is the extra care it needs to avoid rust . I clean it immediately and place it in heat for few minutes till the water is all dried up so that there will be no rust. Overall it’s worth the hassle",
        "I love cast iron for cooking and this pan does not disappoint. Even heat and easy to clean. Can be used for a multitude of things from meat to eggs to tortillas. Must learn how to cook with cast iron. It is different than nonstick or stainless steel. Recommend a tutorial first or you can end up burning things and a mess to clean up. Keep seasoned.",
        "My item came cracked half way through. It was not very visible but when the pan is heated it expands leaving a gaping crack causing stuff to leak through. I live outside of the US so it will cost me way more to return it. I'm really disappointed.",
        "Disappointed....i have my grandmother's frying pan and my great aunts...both have smooth surface and are thus eady to clean AND easy on what ever one fries....This pan has an incredibly ROUGH surface...i have several Lodge Dutch ovens, and these have much smoother surface.... Why the massively rough, almost pitted surface??? WHY?",
        "No matter how well you season it, store it with a nice thick coat of oil. It has not become non-stick. Food stick like hell on it. I get so frustrated that feel like throwing away griddle instead of cleaning it. Also I have noticed the heat distribution is not even; food cooks faster on one side while other side remains uncooked. What a waste of my money!! Really disappointed with the purchase.",
        "I love that the sides on it are flat. I have used this pan for a huge variety of foods. Easy to clean and upkeep. Heat is evenly distributed. I love how burgers taste !!!",
        "I've had Lodge cast iron pans for a few years and it has been my go to pan for outdoor cooking or even indoor for fantastic heat retention. This griddle is no exception and has been a nice addition to my kitchen. I use it to make pancakes, make tortillas and crepes. It has been pretty versatile. You do have to know how to maintain your cast iron cookware to ensure longevity and to ensure that it maintains its non-stick seasoning and doesn't begin to rust. If that does happen, a quick search on the internet or youtube will show how to restore it.",
        "I give everything negative stars I just bought this product and I decided to make some fried eggs for breakfast on Sunday for my husband when the pan literally broke and flew off my stove it’s upsetting for the price and I’m very disappointed as it was my first time using this product.",
        "This griddle is heavy ,but that does not not matter to me because the quality of the food is amazing. I highly recommend it. Worth every penny. The food you cook in this griddle is so good if you use quality ingredients you can cook restaurant quality food in the comfort of your home. Plus, saving money is always a good thing!",
        "I have a couple of Lodge products, and this one is as reliable as all their stuff, in my experience. Just clean it up once it cools off, a bit of oil to keep the rust away, and you're good to go. I use it primarily as a griddle on the grill top to sear meat and carmelize it, giving as close to that black and blue on a nice steak as one can get with an inexpensive consumer grill. Recommend.",
        "Lodge what can I say you make the best cast irons around do not try to go the cheap way and but a knock off brand on amazon which I did and received the worst cast iron pan made to man. It’s was bumpy and couldn’t fry a egg without it breaking the yoke. This pan is awesome it has become my everyday go to pan that I use for almost all my normal stuff like a Fried eggs, quesadillas fried bread with eggs. I love this pan! I love lodge. And would buy another one again in fact I may have to buy another pan.",
        "I bought this thinking that it would be seasoned and ready for use. It is not. I followed the directions and my pancakes stuck badly. I don't like to use a lot of butter or fat for health reasons, but I did use a little oil, and they still stuck badly even after heating up the griddle to the correct temperature.",
        "I used the griddle for the first time a day after i received it and let me say that I was not disappointed. For the past few days I've used it to cook pancakes, fry plantains and breadfruit. I cannot wait to use it on the grill and to make my family favorite roti. Signed a satisfied customer",
        "I love cast iron cook ware. I had a griddle that covered Half the stove and I thinthe hated using it just to cook a few pan cakes. This little griddle will cook 3 small pancakes or 2 medium size. Also it cooks the best grill cheese. I love cooking steak on this griddle & I also use it for breakfast . I keep it well seasoned.",
        "Received it with two holes. Some other people are remarked on this. This may not affect the quality immediately but eventually a hole like that can create a crack. The process of a replacement is not too involved but it is still a hassle to go through at a time like this. Also it says preseasoned but it still make a sticky mess. Had to re season twice before a true non stick surface built up. I will be returning this for one that hopefully has not holes or indents.",
        "I never bought a cast iron pan before because I thought it would be so hard to see you soon. This preseason Skillet is wonderful. I slowly cooked bacon on it before I used it for anything else to add to the seasoning. Since then I have used a skillet for baking my buttermilk biscuits and they turn out perfectly.",
        "Works great for dosas :) dosa batter is made with soaked rice and black gram (lentils). I’ve tried several nonstick pans, but an iron tawa or griddle does the magic to make perfect crisp dosas and this griddle is just too perfect for these. Heats evenly and stays hot for a very long time after the initial few minutes of waiting on the stove.",
        "Great little pan! Super easy to clean and has been the perfect pan for breakfast (frying eggs and pancakes). I’ve been using this on an induction burner that is the exact size of this pan so heat distribution has been perfect, but when using on my crummy stove doesn’t distribute the heat quite as well (hard to know if it’s the pan or the crummy stove though). With the price being so reasonable as well, I can’t recommend this little pan enough! Great but!",
        "This is a must-have. I make pancakes for my kids every weekend and this is the best for that. I also use it for quesadillas all the time and to fry perfect eggs. I got a bacon press and I use it with this and it's an amazing combination! Highly recommended. ps: If you aren't familiar with cast iron, you can look for tips and tricks in the r/castiron on Reddit!",
        "Three days of seasoning per internet instructions. Supposedly pre-seasoned by manufacturer. No way. Useless upon receipt. Used Avocado oil. Heated in oven as directions dictated. Worked ok for hamburger to make tacos. But, bacon, eggs, pancakes STUCK to pan. Not worth wasted time and effort to maintain or clean. Returned!",
        "We bought this for the sole purpose of making pancakes. Our old griddle was warped and had uneven heating. This griddle is PERFECT. Nice even heating and perfect for nice BIG pancakes. Doesn't stick to the pan. Easy peasy. Now my husband LOVES cooking me pancakes. Which is great because pancakes are life!",
        "The moment I received this I washed it as recommended and used it right away. I made blackened catfish for tacos. It's heavy so that it won't spin around on you while you're cooking. It's flat, so I heated up my corn tortillas first until they were pliable and a little crispy, then placed the catfish on the griddle. The pan heated evenly and my fish cooked quickly. This will be my go-to pan for crostini as well. Very easy to flip/turn items on the pan. I highly recommend this versatile pan!",
        "We love this cast iron griddle. With shorter sides it is lighter and easier to pick up and swirl the thin Swedish pancake batter around the bottom. It cooks evenly and was surprisingly easy to clean. It comes pre seasoned but we rubbed some cooking oil into it anyway, and it works very well. It is cast iron so should last decades, but I can't answer that question for another 20 years or so.",
        "Best pan for pancakes, they don’t stick , I put oil on pan let heat about 5 minutes, turned up the heat and started making the best ever homemade butter milk pancakes ,so pleased with this lodge pan I ordered another while cooking pancakes lol the pan after cooking looks amazing nothing sticks",
        "After my first use only 4 slices of bacon fit and 3 large eggs I had to clean it after bacon so I would be able to flip eggs. Eggs were not easy to flip. I cooked on a very low flame. After my second use I cooked French Toast and the skillet held 3 slices. It cooked very good! It is best for 1-2 people. Does not fit a lot of food. No pour spout for grease. Would be good for Grilled Cheese! When it gets hot it cooks fast and complete! Low Flame only!",
        "we use this for making Indian Crepe's (Dosa) .. hands down best one ever. we also use Lodge dutch oven and Lodge grilling cast iron with ridges. Best quality and purchase for fraction of the price what Le Creuset has to offer. I wouldnt waste money on those high end products when i get the same thing here. Just buy it and thank me later. <Psst...DONT FORGET TO OIL YOUR CAST IRON STUFF regularly>",
        "The pan is releasing too much rust since first wash. too much heavy, scratched and dented my electric gas top. poor handle quality, handle warms up equally the pan gets hot. i burned my hand when i touched the handle, no cover on the handle to avoid accident. have to wait for hours for the pan to get cool down and then move it away from the gas top. not user friendly at all.",
        "This is an awesome pan! We have been using it almost every day. The season holds up well, I am still getting used to how much more oil I need to use though for non-stick cooking. It IS very heavy, esp. for someone with arthritis. Use 2 hands and heavy pot holders, this pan holds the heat VERY well.",
        "I really like my Lodge brand griddle. It is perfect for a grilled cheese, quesadillas, a couple eggs or any small batches. but I really love my double burner Lodge Griddle for pancakes. I have made more pancake since I got it that I have in, forever! I really love the qualities of all of my Lodge cast iron skillets, Dutch Oven pots and griddles. I won't use anything else.",
        "This is the first cast iron griddle in my home! I'm is using non stick pans for a long time,and change them over a period when it starts to wear. I've always wanted to try cast iron,this one is solid.Though it says preseasoned ,I took my time to season it ,used Flex seed oil .I make Dosa(Indian breakfast crepe) almost every morning,it comes out great ,nice and crisp.We know cast iron skillets are high maintenance.It may take little extra time every time we use it but its worth having.Now,I can say good bye to non stick pans.With the proper maintenance hopefully this should be life long.",
        "There is not one flaw with this product. Heat distribution is excellent, easy to clean - just simply use a scrubber and water. No soap necessary. You can put the skillet on a stove burner and heat it up and then pour some cooking oil on it. I use a wadded up paper towel to rub the oil on the surface while it is warm to make it non-stick. Perfect for tortillas, eggs, pancakes, and more. The low rim makes it easy to flip food.",
        "Love this little cast iron griddle. Full disclosure- I can’t cook very well & hubby uses it more than I do so this review combines our usage. It heats up quickly and evenly just like a larger cast iron skillet. I use it mainly for grilled cheese, quesadillas, & breakfast items. Pancakes cook quickly on this and browns nicely. Husband uses it all the time for quick lunches & sautéed veggies. The cast iron finish is great.",
        "I was given this skillet as a birthday present and it is the best skillet I have ever owned. When my boyfriend of three years and I broke up, he was heart broken that I was taking it because he too had recognized how great it is. ( We both love to cook and especially eat steak so this thing got a lot of use). I ended up buying him one for his birthday after we broke up because I felt so bad leaving him without a skillet. He said it was the perfect gift. If you're looking for a great skillet this is definitely it!",
        "I had liked using the griddle for past one month until today When some black coating completely came off and got stuck to the food. Whole house smelt like plastic burn. Shocking revelation of how customers get cheated even by such big brand names. I hope the material is not poisonous, because I am concerned unknowingly how much of it has gone in us. Purpose of buying cast iron griddle was to avoid teflon non stick coating.. People, please don't buy this product !!",
        "Works well. But 2 issues: 1. Handle does not come with silicone or some cover. So it gets very hot. So you have to purchase that separately which adds another cost. 2. It’s very heavy. My wife can’t pick it. Not very practical for cooking if you are not wellbuilt, specially if you have gas cooktop.",
        "We literally used this pan once and it cracked. We have several other lodge cast iron products and have not had any issues. Any thoughts on why this one cracked after one use?",
        "The handle of the pan is very short and therefor gets super hot instantly, the weight of the pan is also pretty heavy. If you are expecting to be moving the pan often after or in middle of cooking than don’t get this, the handle is almost as hot as the pan cooking surface itself. I recommend the manufacture to put a handle on top of metal one to make sure it’s safe to pickup.",
        "My relationship with this excellent griddle got off to a slow start, until I realized that getting the seasoning right was going to take a few weeks anf many sessions. I am pleased to report that the pitted original surface, that food stuck to badly, is now filled in and smooth. Nothing sticks and cleanup is quick and simple.",
        "This item works FANTASTICALLY as a tortilla \"comal\" (cooker). The heat is even and steady. The tortillas do not stick once the griddle is seasoned. The griddle does not warp under the high-dry heat required for tortillas. It takes 3 minutes for the griddle to get hot enough to start cooking tortillas. Even though the griddle comes \"pre-seasoned', before using it I did my own seasoning by rubbing only the griddle (top of pan surface) with Crisco (very thinly) and leaving it, upside down, in the oven, set to 375-degrees. Don't even think about using an aluminum-with-non-stick-surface product instead of this cast-iron gem. There is NO comparison.",
        "I love Lodge cast iron stuff. Either buy from walmart or amazon. This time looks I am sent a seconds not the new. Has lots blemishes.",
        "This thing is great! I use it on the weekends to make pancakes for all of the sleep-over guests. Once hot, you can really keep them coming and cook until you run out of batter. It also performs great for reheating pizza, cooking eggs, and just about anything else you can through at it. I wouldn't ever cook bacon or sausage on it, because the rim is not high enough to retain the grease, but it's not intended for that type of food either (I don't think). I highly recommend it for anyone's kitchen and would definitely buy it again.",
        "Does what it is supposed to do. Not good for bacon. Side are to low to hold grease without overflowing. But good for crepes, eggs, burgers, dogs. The best for making grilled cheese sandwiches. Very controllable heat all over the pan. Never need more than medium heat."
    ]
}