{
    "entity": "Tree Stands",
    "text": [
        "It's hard to find substantial and sturdy christmas tree stands these days, and this stand is both substantial and sturdy. I like that it has a large water reservoir too, as plenty of water is necessary to keep your tree needles soft and pliable all the way until New Years. Also, how awesome is it to be able to order something like this online and get it shipped to your house!? My small town has very few options and I was glad to have this delivered to my door in less than a week.",
        "Product is great, found the same one at Lowes for $42.00",
        "No I haven’t used it yet but I can tell I won’t have any problems. It’s all metal so there are no plastic parts to get stripped, the base is wide and the feet are covered at the tips so your floor won’t get scratched. It says it can handle up to a 12’ tree but I’m only going to get an 8’ tree. And there is also a limited lifetime warranty. The only thing I didn’t like is that it’s made in China.",
        "We used this stand on a 7 foot fairly wide blue spruce Christmas tree. The first time we stood the tree up it slipped off the supports on the bottom of the stand. Be sure the tree is firmly wedged in place and the screws all tightened before attempting to set up the tree. We had no other problems once we reset the tree firmly against the base. It is very solid. Also it is very easy to water the tree with this stand. We recommend this product to others. The large size might be better for anything over 7ft trees.",
        "This tree stand holds 2.5 gallons. Worked great this holiday - highly recommend.! We also bought miracle grow for christmas trees. 1 month later, needles dont fall off that much. highly recommend.",
        "They don’t build Christmas tree stands like they used to! This was a gauge for price ($75~), but we were in need of one for the new house, so you do what you have to do. I was looking for a metal stand, and there were none left in-stores, so what can ya do? I hope it lasts 40+ years.",
        "We get an 11-12 ft tree and our old stand just couldn't take it. Put the tree in, tightened the bolts, and the tree stayed upright first try, didn't even need to tie it to the wall :) and it holds a lot of water so less crawling under the tree.",
        "I believe in buying it well, and only buying it once; that the initial purchase price is only one measure of value. This steel stand holds 10' trees with ease and is going to be with us for a long time. Not only is it built well, but contacting the manufacturer yields prompt responsive customer support. My wife and I are very pleased.",
        "My husband always buys a crazy tree. It’s always too tall, too wide or has a crooked trunk. We almost always have to tie the tree to the wall to keep it from falling over. This year we switched to this stand and it was PERFECT! Highly recommend",
        "And the design is simple without resorting to too-heavy- to- pick- up! Wide opening allows for easier watering. It's a really good stand.",
        "Nice solid stand. Held my tree up nicely and was easy to screw in to place. And the water basin holds a decent amount of water so I wasn't watering the tree every day",
        "This is a sturdy tree stand. I expect that we will get many years out of it. Our 7 foot tree was easy to place in the stand and screw into place. I would recommend having at least 2 people to direct the stand into the hole and keep it held up straight while the pins are tightened.",
        "Very well made updated old school stand. First Christmas with it so can't comment much more. You should be happy with this purchase.",
        "We have been looking everywhere for a strong tree stand that won’t fall over once the tree is in it!! The tree was so easy to get in the stand and get it set up! Good size to fit a variety of trunk sizes.",
        "I like it. I can get big tree in my house now",
        "This thing looks like it will last forever. Worked great for our tiny 4 foot tree this year and could easily accommodate something huge too.",
        "Good stand seems a little small for their big stand, but sturdy enough to do the job, and its not plastic thank goodness. Build quality seemed a little crude the legs weren't welded completely symmetrical like they didn't weld it in a jig. I'm just being picky though, it does the job.",
        "PERFECT tree stand - It NEVER ran out of water because of the big capacity (1 gallon) and was heavy and wide-legged enough to make the tree stable!",
        "Setting up our tree was very easy. The stand is truly heavy-duty. Don't see why it couldn't be a lifetime purchase. Recommended.",
        "The last tree stand you will ever need. After years of battling, re-centering, holding, tightening, loosening, and finally fighting with my wife trying to stand up the tree, I invested in this beast. It’s a life saver, highly recommend!",
        "Just put up my 10 ft tree and this thing works like a champ. Very sturdy, very heavy, the clamps are great and sturdy too. I put the stand on the tree outside and pulled it in on the stand - had to correct it a bit and done. Put some glycerol in the base and a gallon of water on top - I dont see anything to improve, great product so far.",
        "Excellent tree stand, currently holding a 12' tree with zero issues. Very stable. (note, probably best for carpet as the pads are not all in the same plane, will rock a bit on hard floors).",
        "Solid. worth the money. Will have this for years to come. Held an 8.5 foot tree solid. Holds 2 gallons of water in the base, but trees suck that up in a few days, keep it well watered and your tree will stay moist for weeks longer.",
        "I have been struggling for years setting up the large 12' trees to enjoy in my 'great' room (19' ceiling). The Jack-Post Welded Steel Stand, rendered my job the easiest imagineable ! Perfectly straight tree not leaning or unbalanced, no 'guy wires' needed to tie to wall, a really professional looking installation, secure and trustworthy for the season, done in mere minutes! !",
        "Well worth it! Best stand we have ever had! Loved it. Holds the tree up perfectly and is sturdy. Way better than plastic. It’s a stand you can use for years!",
        "This is exactly how an xmas tree stand should be. Sturdy, leak-proof, easy to set up, keeps the tree standing. No more plastic garbage every year; this is the only stand I will ever need.",
        "We got a real Christmas tree for the first time in a long time and needed a new stand. This stand worked great! It is very solidly built and extremely sturdy. The description mentions that it is for trees up to 8 feet tall, but our tree was closer to 9 feet tall and the stand still worked great. The tree was solid and never even appeared close to being unstable. This was especially important to us with a toddler running around the house.",
        "HEAVY DUTY, very well made, if your looking for a tough heavy duty tree stand, this is it",
        "We have a 10' tree and it was hard to get it stabilized in the stand.",
        "This product was a lot bigger than I expected (and heavier), but it is completely durable and just what I needed! Worth the price!",
        "First tree stand I've ever purchased and I was very pleased! Held up even better than I expected. Very sturdy and reliable, I would definelty recommend.",
        "Really nice tree stand, good size water bowl. Very happy with it!",
        "I usually dread setting up the tree. We always have a tall tree and It usually requires 2 - 3 people and securing it to the wall. This tear it was so easy. The stand is VERY sturdy and requires no extra securing. Wish I got it many years go.",
        "Excellent quality. The right size for my 6-8' live Christmas trees. Large water holder. Rugged all-steel construction will last for many years.",
        "Very stable, substantial tree stand. Am confident it will last.",
        "Well made and works. Did not even wire the tree to the wall. Very secure.",
        "Found it at Lowes cheaper. Last one lasted 20 years",
        "Best send ever. Holds 8 foot (and very wide) tree without any issues",
        "We purchased this hoping it would cut back on some of the strings we used to hold up our 12 foot tree last year. To our pleasant surprise, the stand COMPLETELY eliminated the use of string! It's so sturdy that our 12'4\" tree stands all by itself—even when we nudge it in an attempt to knock it over. This stand was totally worth the money.",
        "Very solid. Held our 12' tree up with no issues.",
        "These guys are great! Not only do they have a good product, sturdy and built well, but there customer service is fantastic. Thank you!",
        "Awesome stand ! It doesnt get any durable than this.",
        "Good and sturdy. No water spill. Easy to set up tree.",
        "Met and exceeded expectation. Solid. Will pas from me down to my grandaughter",
        "This is a well made sturdy stand that held our tree without room for wiggly and is sure to last us years.",
        "This is the first real Christmas tree we've had. This stand really made it easy. No issues taking it down either. So far so good. We'll use it again next year and if there are any changes we will re-post.",
        "Did everything specified - Very satisfied - shipment on time -- Tree size 8 foot - Strong construction - Easy to keep straight snd Firm in stand - Easy watering",
        "Best tree stand I have ever used in 49 years!",
        "I have had both good and bad experiences with tree stands. Always have a 12' tree. The water tank was my objective. Even Santa approved.",
        "We have a 11ft tree and the stand worked great!",
        "It is very easy to use , well constructed and does the job. I would recommend this product . It looks like it is built to last.",
        "Loved this - red base helps keep it from scratching our floor and hold it in place. It felt secure and strong.",
        "Got this one for the family for our first big Christmas tree. Got the stand onto the tree with a little fight and a few minutes after standing the tree up, it came crashing to the floor damaging furniture along the way. The poorly welded stand broke a leg off. Very poorly made stand. Don't make the same mistake that I did. I had to order another stand and wait a week with the tree laying in the house till the new one came. Don't buy unless you want to ruin Christmas for your family.",
        "The stand worked as it said it would. Easy to set up and will last us many Christmas's to come!",
        "This is a good solid stand seems to be well made, holds a 9' tree with no problem I was able to move the tree around for placement it stayed solid. The only fault I have with the stand is the water bowl is too small, with a fresh tree you have to fill it twice a day. All in all I would recommend it.",
        "Awesome, heavy, sturdy tree stand. Great price for this item, also. The cats will NOT be knocking over the tree this year!!",
        "Nice and sturdy. 11 foot Tree has been up a week and kids bumped into it several times with no issues of it leaning or falling over. The nuts were not welded to the bolts which caused some aggravation when screwing them into the trunk.",
        "Best tree stand ever. These are so sturdy. I first found one at the grocery store after Christmas sale of all places. Later we purchased this to have another size. Love it. Will never use the cheap flimsy ones again.",
        "I have not yet tried this item out. I appears to be very sturdy and should handle my Christmas trees for years to come.",
        "This is an excellent tree stand! It's durable, steady, and will clearly last a long time with proper care. As another reviewer said, I'd recommend cleaning and drying it thoroughly after use, then applying an appropriate hardware lubricant to the screws to avoid them rusting shut during storage. The reservoir holds enough water to avoid daily refilling based on your home's climate and the type of tree you have. It was very easy to stand the tree straight. I'm very happy with this purchase and look forward to many years of use!",
        "A really nice heavy duty stand. We buy 7-8 foot trees and our previous stand would not accommodate the larger trunks causing me to butcher the trunk to make it fit. We purchased the large stand and no longer will have a problem with an undersized stand. I weld for a living so I can tell you that the welds are of top quality on this stand. A touch pricy but the lesson is that you get what you pay for.",
        "We purchased the medium stand. I was a little worried that it wouldn’t be sturdy enough for a 6.5’ tree, but the medium stand felt very secure. I had zero worries about the tree falling. With 2 adults it was incredibly easy to get the tree in the stand and set up. The basin is nice and wide, which makes it easier to see if tree needs watering and also for watering the tree. This really is an inexpensive stand, with a foolproof design and minimal moving pieces (that could break down the road). It works and doesn’t overcomplicate having a real Christmas tree. Love it!",
        "We have about a 12' peaked ceiling where we put our tree, but it's on carpet. Some of the other stands I looked at, I didn't fully trust would be stable on carpet. This thing is SOLID. we got a 10' tree and it held PERFECTLY. Love this thing and so happy I invested in it.",
        "Been looking for a tree stand that holds 9-10ft trees without falling over, this one is solid, tree has stood like a rock, despite cats climbing in it a couple of times",
        "The reviews are accurate. The stand is very sturdy, all metal, and with plastic \"shoes\" that won't scratch the floor. A great investment. It will last for years to come.",
        "This tree stand is a high quality stand, that performed as well as I had expected, It had no problem with the 7+ foot tree that I bought. I felt that it was extremely sturdy and held a good amount of water. One of the locking bolts on it was damaged, but I could probably replace it cheaply from a local hardware store and it didn't affect the stability at all.",
        "Great stand for the money. We tried an inexpensive plastic stand last year - it cracked and was an absolute nightmare to work with. Prior to that we had a cheap, flimsy metal stand that rusted and bent. This stand (size Large) is very solidly built of thick steel (with solid plastic feet) and can easily accommodate 6.5\" trunks. Why waste time and money on cheap stuff? This stand will last a lifetime.",
        "This is the best Christmas tree stand out there! Trust me. Your tree is NOT tipping over in this thing and it is so worth the money!",
        "This is a purchase for life. THE most absurdly solid tree stand I've ever seen besides it's own roots.",
        "Awesome price and awesome stability provided by this tree stand. Far better than anything you can get at the store. Love that it is so well built. We used a 7.5 foot tree and just slid right into the stand, no need for cutting down the sides.",
        "This is a very we'll constructive Christmas tree stand. Mig welded joints and large stance to keep the tree from falling. The anchor bolts hold the tree very well on center. I would highly recommend this product.",
        "This thing is built like a tank. By far the best stand I have ever used. I suspect this is the last stand I will ever have to buy. That is pretty green as is the stand.",
        "Using on a 7 foot tree and its solid as a rock. Had no issues fitting trunk in as others have. Holds plenty of water!",
        "It is very stable. It looks a little bulky but the tree skirt covered it great. It has kept the tree fresh. No needle drop. I would recommend this to others.",
        "Finally. Something that is made from heavy gauge metal, solid, and built to last. Too bad it's made in China.",
        "This tree stand is the real deal that makes all the others look like the junk they are. Buy it and you'll have it forever.",
        "I don't have to crawl under tree to water it very often. Very sturdy, my tree doesn't wobble like it did in the old stand.",
        "Very sturdy and reliable. Cost is great, was $20 more at tree lot . Fits a standard 7 foot tree, probably even up to a 9ft tree.",
        "I bought this stand after our large tree bent our stand. This stand is very solid. It also holds much more water making watering less frequent.",
        "Big upgrade over our previous \"heavy duty\" tree stand! It was very easy to quickly adjust the tree to its perfectly upright position---five minutes or less. For the first time I felt very confident the tree would not fall over. Good product!",
        "Haven't had a chance to use it quite yet BUT it looks to be an awesome tree stand. It is very sturdy, heavy and the prongs that you twist to hold the tree are very well made with a wider base to hold more surface area on the tree, thus creating it to be held securely. There is nothing that looks to break down over time, (like with plastic pieces from our last tree stand) and looks like watering the tree shouldn't be complicated. Now all we need is a tree!",
        "I wish it held more water, and I needed to carve off a portion of the trunk to fit it into the 6\" hole. However it held a big tree up just fine.",
        "no comparison. this is the very best tree stand money can buy. it will support anything from charlie brown's tree to cousin Eddy and anything in between.",
        "This is naive sturdy stand, takes a little getting used to with the water. If you don't put it right in the middle the tree does not get the water."
    ]
}