{
    "entity": "Tree Stands",
    "text": [
        "This stand leaked. After we had the tree placed in it, all decorated we realized it was leaking. We placed a tree bag under it, also a large contractor bag, which caught all of the water. We had to undecorate the tree, get a plastic container to put the tree stand/tree in and redecorate. I would definitely put water in it first.",
        "Because I bought this after Christmas, I didnt open when it came. In the process of cleaning my garage, I decided to finally open it. Sand spilled out when I did. I lifted the Genie out, and the whole base of the Genie was filled with sand! I have been sitting here for 30 minutes trying to empty the base. The sand appears neverending. I have grit in my eyes and hair! I'm past the return date, so I'm just tossing it. The \"gear\" on the stand sounds damaged. Totally unhappy with this company. Buyer beware!",
        "We purchased this stand for last years tree and it worked great, no issues. I stored it in the original box, lying flat until we needed it this year. After placing the tree in the stand and filling it with water we noticed water seeping out from the bottom onto our tarp (thank god for the tarp). We removed the tree and emptied the stand to find a large crack in the bottom plastic. I have no idea how that base would crack, it was stored safely and never dropped. I've attempted to contact Krinner but I expect I'll get the same response many in here have gotten, nothing helpful.",
        "None of our family knows how we ever lived without this Christmas tree stand! It literally took us under a minute to get the tree off the top of the car, into the house and standing straight in this stand. Brilliant concept, very heavy base (very!) and holds a LOT of water which is important for the \"did you water the tree? no, did YOU?\" family. Has saved us from Christmas bickering from start to finish! Have recommended this stand to lots of people who, like us, are still wedded to the live-trees-only for Christmas!",
        "I just paid over $100 for this stand - the tree went in easily, even though the instructions are not very good - illustrations only with no text. Then I spend 2 days putting on lights and expensive collectible ornaments. As I gently placed the tree skirt around the top of the base, the pump apparently flipped up (though I did not feel it “catch” at all!) and the 8\" tree fell over. My son swears he locked it into place and it seemed very secure before we decorated. Hundreds of dollars worth of ornaments broken. A giant mess. I'm sorry I took a chance with this.",
        "This thing is the boss. The indicator lets you see from across the room whether your water needs replacing. But it holds so much in the reservoir, I didn't have to add any water the whole season. I had my tree up from a couple of days before Christmas until Epiphany. It's also very heavy duty. Once I had it locked in there was no doubt the tree was staying put. The foot locking mechanism makes it a breeze to center and lock your tree. No bruising your knees crawling around adjusting a seemingly infinite number of thumbscrews. I highly recommend.",
        "One my most vivid memories as a child was the frustration of putting up the tree. It almost tore our family apart. Not anymore. I did it by myself in 5 minutes. Super great piece of holiday hardware.",
        "I'm very impressed. Much easier to use that the kind with three or four awkward screws. Assuming the instructions will get lost, I printed these mini instructions small and taped to the base. UNLOCK: slide red lever outward & red buttons downward. Pull out foot tabs. Pull down LEVER and GRIPPERS will SNAP OUTWARD (careful fingers !!! ) Ratchet repeatedly downward, grippers tighten on each pull. Reverse lock positions to LOCK - red buttons UP and red lever INWARD.",
        "This is incredible. After several years of struggling to put a 4 to 5 foot tree in a base by myself (how hard is it to hold the tree straight while bending over to screw in various screws?), this year I was able to haul in and set up a 6 foot tree all by myself with ease thanks to the Tree Genie stand. I was a little worried some trees with a thicker trunk wouldn't fit, but it looks like with the M size that almost any tree 6-7 feet would fit, even with a slightly thickish trunk. Truly an amazing stand that everyone should own, as corny as that sounds",
        "I will admit to initially balking at the price. \"$100 for a Christmas tree stand!\" But, after my husband picked out the most enormous Christmas tree on the lot, we needed a stand that was capable... and we needed it fast. Ordered via Prime next day, and it arrived about midday. I still can't believe the ease we had getting our 12 foot tree into this stand. It was literally up in seconds. LOVE the water level indicator. It's so well made - clearly going to last for years. Worth every penny.",
        "We had been using a dome shaped swivel-straight stand for the past few years that finally broke. It was okay but required a 2-person alignment process with one of us on the ground and the other one standing, each of us adjusting and haggling. When the retractable locking lever didn't play along the process would repeat itself. With the Krinner stand I held the tree straight up on the center pin and my wife pumped the pedal. Our first try was a success. Still a 2 person operation, both standing, and foolproof. Then reach down, set the lock, water it, and you're all done. The large size fit our 6' tree easily. Would highly recommend the Krinner tree stand.",
        "Worth it, worth it, worth it EVERY time (*****). Watch video, literally what you saw is how long it took to set the tree. This thing is built tough, its solid and heavy. I expect to get up to 10 years or more from this which is $7.00 a year for its utilization and simplification of the biggest pain in the *ss of the holiday!!",
        "I got this stand at Christmas because my ancient one started leaking from the bottom, it was 40+ years old. I wanted a tree stand that I could handle on my own and this one promised that. I haven't used it yet, but when I took my Christmas tree down, I did a trial run putting it in this new stand before I dragged it out to be picked up for recycle/...and I was able to do it. But I don't consider that minor test to be my only review. This Christmas I will do it all on my own and see if it delivers through the holidays.",
        "Loved the ease of putting our tree in this stand...BUT, it leaked the first time we took it our of the box! I was so excited when this stand came in. I wanted it to work so badly! We put the tree in and as soon as we put water in the well, it started to leak. We had to pick the whole thing up (tree and all) and put it outside until the water drained. We ended up getting another stand from wal-mart and returned this one. Obviously, there wasn't time to reorder another stand.",
        "I think the size description may be misleading. I purchased the medium size because it said it fit trees up to 7ft tall. I got a 7ft tree and the trunk barely fit in the hole. If you are buying for a tree that is tall enough to fill up room with a standard ceiling height, go for the large size.",
        "THIS THING IS AMAZING!!! So ridiculously easy to use and very sturdy. Being a single woman I needed something I could handle and didn’t require crawling around on the floor. Has easy to see pop up indicator on the top of it to show water level (I put water by using a christmassy funnel with long tube that you just leave in the tree). Just leave a hole between presents to see the pop up. You just sit the tree in it, pump a few times with your foot and hit the lock. LOVE IT!!! I had a very big full 9’ tree and used XXL. Where has this thing been all my life? Look no further!!!",
        "Best Tree stand EVERRRRRRR!!! I always have tall trees to match our tall ceilings. However putting them up and getting to stay up is a problem. We add 30 lbs weights, tie the tree, to no avail. After my tree falling AFTER all the decorations were on it 2 years in a row. I found this stand and it changed my life. In less than 30 mins the tree is up and stays up. Oh and the water well holds about a gallon of water so no dead tree on Christmas. I just put my tree up I think is my 3rd year using it so easy, maybe 2nd year idk🤦🏽‍♀️ Enough......just buy it!!!",
        "This is our second Krinner stand. The first lasted over a decade and I can say these are well worth the expense. Very small minimal design. So simple to use - just place the trunk into the stand and start depressing the foot pedal to lock the tree in place (you'll know you're good when the bell rings). Tree not at the right angle? Just release the foot pedal, rotate the tree and depress the pedal again. Fill gauge float ensures you always no how much water is in the stand. We'll never buy another brand of tree stand!",
        "Setting up the Christmas tree has always been a trial with standard stands: rusty screws, cracked plastic, &, after all that, a crooked tree. When our last stand started leaking, I researched options and finally coughed up the money for this stand. It is amazing! perfect! soooo easy to use! and sooo stable! We keep our tree outside, standing on slightly uneven ground in a windy area. No problem, start to finish. Simple to erect, easy to set straight, and never, in all the wind, has it dumped over. Believe all the other reviewers: This is worth the price!",
        "For years I struggled with a traditional style tree stand, where you hold the tree straight and tighten all four of the screws into the trunk. First trying to secure two that would meet, then the other two. Sometimes having success on the first attempt, sometimes having to get back down on the floor and attempt to secure a second time. This stand has a \"claw\" type system, that easily closes using a foot pedal. Nice and secure the first time without having to lay on floor and secure the stand. Buy this stand you will not be disappointed.",
        "My tree has fallen over twice in one week. This never happened in over 20 years with my previous stand. It spilled water all over my new carpeting I think it's too small in diameter to be stable. Very difficult to pour water in too without getting it all over the carpeting. You have to use a water bottle. Not worth the price. Addendum: I hate, HATE this stand. Has ruined my rug, broken my ornaments, and damaged my tree. Can't even put tree back up in that spot because carpet is too wet.",
        "Five stars because this saved my relationship. Had a lesser stand, tree fell a couple of times (AFTER it was decorated, of course). Boyfriend was not enjoying the tree grenade, neither was I. Bought this and my only complaint is it should come with a chorus of angels to sing \"Hallelujah\" when your tree is securely up in under a minute. Worked like a charm. It DID leak, but I read other reviews and realized we were overfilling. Once we stopped, problem solved. Not the easiest to clean but neither was my other stand, so I'm not knocking it for that. Very glad I purchased.",
        "Bought this so I'd be able to leave my real tree for a week while on vacation. Was nervous about tree drying out in a normal stand. This thing holds a ton of water and kept my tree hydrated all season. So happy I have this so I can be confident the tree wont dry out if i forget to water it for a few days or if im away. The pully mechanism is a little clumsy but works. Worth the price tag!",
        "Please save yourself the headache and don’t buy this stand. I could tell there was sand in the box when I took it in the house. I opened the package to find the stand covered in sand and also a pile of sand in the box. I thought it might still work, but the foot petal that controls the things that go around the base also didn’t work. Waste of time and money and it seemed like such a good product. Please don’t bother buying this.",
        "This will be the last tree stand I will ever need! It was so easy. I had a 6.5 ft blue spruce that I cut ridiculously crookedly, but I just plunked it in and used the pedal and in seconds it was locked in super sturdy, straight, and no way it was going to tip without being tackled. Holds enough water for about 4 days in super dry winter indoor environment. Release and removal was really easy. It took about a minute to remove wedged in needles from in the reservoir and under paddle but no big deal and easy to store anywhere.",
        "We had been using a 30 year old metal tree stand and had been having a ton of issues. The tree would never stay straight, it took three of us to get it in the stand and to screw in the support. This year after some research we decided to go with this tree stand and couldn’t be happier. It is super easy to use and very sturdy. We loved how easy it was to fill with water and how much the stand held. There is even a water level indicator that lets you know how much water is left. It has made putting the tree up so much easier and less stressful.",
        "It is very heavy and it was hard to dump the leftover water out after taking the tree down. The water level float does not work very well and it was hard to pour water into once the tree was in. It seemed to loosen up on the tree after awhile and the tree started to lean a bit. I did put a screw in the lever to keep it from springing open unexpectedly. Not sure I will use it again next year.",
        "This tree stand is absolutely worth the money. After struggling with tightening hard to screw bolts year after year, and our tree falling over the last several years resulting in the loss of several memorable keepsake type ornaments, our tree started leaning and nearly fell once again this year. With that we went ahead and purchased this tree stand, which we wish we'd done years ago. It's so easy to drop the tree in and step on the peddle a few times and you're done. We got the XXL and used it on a ~9 foot tree with a very thick trunk and it worked amazingly. I highly recommend.",
        "This is our first tree stand. I did a lot of research and Krinner came up repeatedly. While I do not need the XXL for the height of tree we get, the 2.5 gallon water capacity keeps us from watering it all the time, which is nice (especially when we head out of town for the weekend). That alone was worth paying an extra $4 (at the time) to go from a L to XXL. It does weigh a TON, so you may need help moving it to where you’d like it.",
        "This stand didn’t even last 24 hours holding up my tree. I went to put the star in too, pushed a branch out of the way, and the tree started falling towards me. Thank goodness my daughter was there to grab the tree. We tried again and again to secure the tree and it was locked, but it just kept tipping to fall.. the prongs were not wanting to hold the tree. I wouldn’t recommend spending your money on this stand!!!!",
        "This stand is awesome. Not only was it super easy to get the tree up, but we didn't have any spillage issues like we did with our old stand. The tree stays secure in place and the foot lever makes it so easy to get in position. Highly recommend. Get rid of your old, cheap stands. You'll never need another tree stand again. ***Update*** For the first time ever, my husband was able to take the tree out of the stand all by himself. Just a click of the lever with his foot and the tree was able to be lifted right out. This thing is a beast and I highly recommend it!",
        "This was the easiest setup of a Christmas tree I have ever encountered. There was no setup of the item, no weird instructions on how to fill up the tank or anything that I needed to be aware of. The box was delivered to our house while we were out shopping for a tree. When we arrived home, I took the holder out of the box, placed it where i wanted the tree to go and put the tree in pushed the lever and presto...done. 5 minutes....5 minutes!!! I will never use another Christmas tree stand, this will be my stand forever...for..ev...er!",
        "Throw away your old tree stand and order one of these TODAY! More expensive than other Christmas Tree stands, but very much worth the investment. No more laying on your back trying to screw-in the old type fasteners trying to get a \"straight\" tree. Very high quality product that should last for many, many years. It is very heavy however - you're forewarned... Very easy to use, both setting the tree into it, tightening, and then releasing during tree removal. Just an excellent design, well manufactured and made from high quality materials. Highly recommended.",
        "I have had this thing since 2012. It's great. Everyone I know who buys a tree balks that I paid $100 for a tree stand. I always ask them how long they have had their tree stand and they always say about 10+ years. So if you could pay $10 a year for a tree stand that saves time, is easy to use and setup and probably get more than 10 years out of it... would you? They always say \"That's true.\" and never buy it. Don't be like my friends.... do yourself a favor buy a xmas tree stand that will save you time and frustration.",
        "This is by far the easiest tree stand I have ever used. Less than 5 minutes after I brought the tree in the house it was upright and sturdily in the stand. Just put it in the stand, step on the foot lever until the bell rings (three steps in my case) and voila--it's done. Stand is nice and heavy, and seems very sturdy. I particularly like that it has a low profile, so I didn't need to cut off a lot of the branches on the bottom of the tree like I did with my last stand. The only complaint I have is that I didn't buy one of these years ago! Highly recommended!",
        "After spending an hour plus on the 2015 xmas tree stand setup only to have the tree fall over causing a re-do + screwing an eyelet into the wall behind the tree to secure with twine because it still wasn't standing perfectly straight. Well let's just say for 2016 I searched and came across this stand. We brought our ~9ft douglas fir home and had it perfectly straight in 10 minutes with zero movement problems for the 2 months the tree was up.Very happy with the purchase.",
        "Never again will I struggle under the tree trying to screw in four independent bolts while balancing the tree itself with my fifth arm. It took me two quick tries to line it up perfectly and there it stood for a month. I keep my tree outside and with the rain this year it kept itself full of water so I didn't even think about it again until January 2nd. Definitely good to have the locking feature as it doesn't take much to pop it back open. Pretty big to store but worth it.",
        "Absolutely the best decision we have made in tree stands! We have a good size tree (8 1/2’ tall x about 4 1/2’ wide at the bottom) this year but will go back to an even larger size next year so that will be the true test! But it was easy to settle the tree into the base and position it on the tree mat. The base holds several large water bottles worth of water so if you forget to add water one day, there is still going to be a tiny bit left until you remember provided it was full to start. 😉 Definitely is one that we would highly recommend! For us, it is worth every penny!",
        "It definitely works well, and is pretty easy to use. It seems very sturdy, but it is rather terrifying the way it snaps together. You differently need to keep your wits about you to make sure you don't hurt. That said, this was replacing a Christmas tree stand that let our tree fall over, which was a disaster. Our family cherishes our many generations of ornaments, so having a sturdy stand is crucial. This does the job.",
        "Best tree stand ever! As a single mom it was always quite a chore to put up the Christmas tree. But I splurged on this stand based on reviews & internet searches for “the best tree stand” & I am so happy I did. It took me less than 3 min to put up our tree (Mind you that was my first time, while reading directions too). It is so sturdy, it’s flat which makes the skirt look better & the water gauge is incredibly helpful. Very happy with my purchase.",
        "This is the best tree holder ever. Solidly built for the tree we get, and we usually end up with a 7ft tree. The clamps hold that tree securely. One recommendation is to get a small padlock to lock the clamps in because a child can press the release button. But like I said, that can be solved with a padlock. This even has a gauge to let you know how much water is in it, but it does get a little clogged with tree degree, giving a false reading. Like other and possibly all tree stands, it's a little difficult to fill with water. I recommend making something to fill it with.",
        "+ Very easy to use + Used for 4 seasons now, very durable and works like brand new + Stylish green and looks great with my live tree + Water level is clear and easy to view - Incredibly hard to use if you don't trim the bottom of the tree. Make sure to leave at least 8-12\" of room at the bottom with no branches. If you cut it cleanly you won't have any issues",
        "You need this stand!!! The ONLY downside was that I kept thinking \"Why did I not buy this YEARS ago??\" Yes, I have had a tree fall down after it was fully decorated. NO, your tree will NOT fall when installed in this stand. Easy setup; you're done less than 60 seconds after you get the tree into the stand, and getting it into the stand is easy as well. That said, you should - with this stand or any other - have a friend to help you set the tree in the stand. The stand is heavy (a good thing when you add the tree), so be aware.",
        "Don’t waste your money on a pricey product that evidently has no quality control. Put up our tree today and thank goodness I checked it - water was leaking from the stand. Our Oriental rug was soaked. Luckily, I caught it in time before it warped my hardwood floors. And now, I’m stuck without a tree stand and a tree on our porch in a bucket. VERY disappointed.",
        "This thing is AWESOME. Yes...its pricey. However, for someone who has had several trees fall (and thus damaging ornaments and creating a huge mess. Have you ever tried to clean sappy water out of carpet before???) this is a great product. It is very sturdy and you can feel that as soon as you handle it. It cinches down on the tree and the tree will NOT move. I especially love how it holds the tree tight evenly all around with a heavy gauge steel(?) cable. Adjusting the grip is a snap, and the pop up \"turkey timer\" style water gauge is a very nice feature. Holds quite a bit of water, too!",
        "This tree stand is the best! I have been wrestling with 10' annual Christmas trees for years with the old stands that have the metal spoke the tree sits in...it was never straight, difficult to place the tree in and the metal stand would scratch the floor. The Krinner tress stand is worth every penny...simple and straight along with no scratched floors. It's also easy to water and lets you know the water status...without having to feel around for depth of water. HIGHLY RECOMMEND!!",
        "I have been wanting one for a long time. I finally bought it. The XXL can hold an 8 foot tree and probably bigger. The stand by itself is a bit heavy. I put about 2 pitchers of water before I added the tree so it seems very stable. I also put plastic under mine so I can slide it around a little if I need to and protect the floor from drips when refilling. I do need to get a watering can with a long neck to top off the water but it initially holds about 9 -10 quarts. My dad has had his for 20 years.",
        "The only dislike is the price, but it's worth every penny. Super easy install of the 9ft tree which with the old stand would be countless tipping, adjusting, cursing and frustrations. That is why I say \"just buy it\". The water level indicator worked perfectly fine, if you think it might not be reading correctly just tap it and you'll see it bob like a bobber in water, then you know you have liquid.",
        "Well, first of all, I NEVER write reviews and all I can say is that I laughed out loud while reading the reviews about the tree falling over and water going everywhere and trying to screw things in and yelling at each other etc...because we had just gone through this exact scenario. This was WAY more than I wanted to spend but it was worth every penny! Literally I pulled it out of the box and 1 minute later our tree was up. Mind blown!!",
        "Greatest and best tree stand! My wife believes the price is way too much, but I must disagree especially if your the one screwing and unscrewing regular Christmas trees in. Put the tree in the holder and simply push down the lever with ur foot to set the tree and place. Just place water in the tree holder and your set to go!",
        "We love this tree stand! Gone are the days of having to fight every time we get a tree when trying to get it screwed into the stand and trying to get it to stand straight! The only thing I wish is that we had chosen one with a bigger base! I chose based off the guide (we usually choose a 6-7 foot tree) and we had to shave down the base of our tree considerably in order to get it to fit.",
        "I love my Christmas tree and all my precious ornaments, and was tired of tying it to the wall so it wouldn't tip over. I was also tired of my husband's annual swearfest trying to get the screws in and the tree straight. This is so worth the $$$ - easy peasy getting the tree in and straight and, most importantly, SECURE!!",
        "We love big trees and always fought getting it up and straight. We purchased the Krinner this year and had it up in less than 15 minutes. Took us longer to get it in the door. Our tree is a 9+ foot Nordman that is really full with about 5\" base. To big for the baler at the tree farm. It went up easily and is very secure. The tank holds 2+ gallons of water, so I don't have to worry about running out. Recommend this to anyone that can have big and tall trees!",
        "Was disappointed this didn't have the button that pops up to show you water level. But that is not a deal breaker. This company makes a number of similar model and they ROCK! Tree is up and secure in 1 minute. No turning screws, or wedging things to right a tree. This is the best engineered tree stand and so worth the money considering all the crappy stands I've gone through over the years.",
        "I bought this to make it easier to stand the tree up by myself. That part works. My only issue is that it is quite heavy. It was hard enough to move empty. Tipping it to get the water out is quite the trial. You may need help with that. It does hold the tree well. I put a chopstick in the locking handle to make sure it didn’t get released by accident.",
        "The stand incorporates such a simple, yet effective design to enable you to hold your tree upright and keep it upright. No more kneeling on the floor to tighten one screw, then the other, then the other, then re tighten, etc. etc. The water level indicator is a welcome bonus! I had read some of the negative reviews, but honestly did not experience any leaking or breakage of cables. Folks, you just have to follow the instructions, which are easy to follow. If I had to mention any drawback, the unit is heavy, especially when filled with water. Be sure to keep the box- it's handy to store the stand after Christmas season is over.",
        "The concept for this product is great. The reality is very different. The plastic base arrived cracked and in pieces with sand spilling out all over the place. The gears were temporarily seized due to all the grit bound up in the gear grease. Now I have a tree I can’t put up today, a mess in my living room, and a $75 product I’m going to have to repackage and return.. This was supposed to make the holiday less stressful but it’s nothing more than a giant mess.",
        "When my dad found out I bought a 12’ Christmas tree he was dreading the horrible balancing act we usually do with smaller trees. When I tell you this thing was up in less than 5min I am not exaggerating! We had to make an adjustment here & there but this is by far the best stand we have ever had as a family! It’s heavy (in a good way), build extremely well, has a water level indicator, & this crank foot grip action: simply the best! I told everyone I know they need one!",
        "Makes putting Christmas trees up as easy as snapping your fingers! Had my 8 foot tall heavy Christmas tree up within three minutes. The base also holds 3 gallons of water. What I noticed is the tree stayed moist all year with no needle dropping because it never ran out of water. Even if I forgot to water for a day or two, the tree always had enough water in the base That I didn’t go empty.that it was great. Can’t say enough good Things about the stand.",
        "Bought this after crying. I spent 40 minuets directing my man friend on how to set up my Christmas tree with a target stand. Once he left I went to water the dam thing and it fell over! Amazon to the rescue! This is my first year with a Christmas tree, and I will never do without this stand again. It took all of five minutes flat to get it erected and straight. What more can a lady ask for? The water measurement mechanism was a lifesaver, I will just fill with my foot for it to see if it was Bobben. Paired this with a long funnel and you were smoothing sailing through Christmas. Highly recommend.",
        "This stand was totally worth the money. Last year, we tried one of those green plastic stands from Wal-Mart, and it was a nightmare. It took forever to get straight and to the point where it wouldn't immediately fall over. The tree was unstable, even after we tied it to the wall. With this stand, we had the tree up and completely stable within literally 2 minutes. Simple to set up. Put the tree in the center, make sure it's straight. Use the foot lever to secure it to the base. Lock the foot lever, and you're done. I can't recommend this stand enough.",
        "After purchasing piece of crap $25 new Xmas tree stands every year and throwing them away every year, we finally bit the bullet and purchased this amazing tree stand this year. The purchase came after this year’s Target tree stand had me cursing it out- really didn’t do much for holiday cheer. We LOVE this tree stand and I look forward to more pleasant tree-standing with this for years to come. It’s heavy, durable and extremely easy to use. Very much worth the price tag!",
        "I purchased this item in September and just today opened it to put my Christmas tree in it and it is all scratched up and broken!!! I can’t return it because the return window is closed. I can’t even buy another because they are out of stock. SO MAD! Now I have to waste more money on a junk stand. I will update if the Krinner people help me.",
        "I lost my last cheap tree stand in a recent move and was reviewing all of my replacement options on Amazon. This one caught my eye but I was a little taken aback with the price. Then I read all the reviews. I have always have and plan to keep getting fresh cut trees each year. I struggled with tree stands, crooked trees, water tipping out and the endless amount of adjustments. Today my boyfriend and I brought a beautiful fresh tree home and literally in 1 minute had the tree standing straight and secure. No mess, adjustments, arguments! I feel this is a wise long-term investment to make my holidays a little brighter and WAY easier! Highly recommend.",
        "Well, if are willing to spend more money on a tree stand then you probably will on the tree itself, then this is the way to go. Having wrestled with other stands, this one's clamp is awesome. It really was as easy as having one person stand the tree in the stand, and pumping the clamp. That's it. The reservoir and pop up indicator are also nice. Only thing i didn't care much for was that adding water is tough (not much space to pour into) and to use the pop up, you have to make sure its not obscured by the tree skirt. But this is a great stand over all",
        "This is the BEST money I have ever spent!!!! I have been married 10 years and I kid you not when I say our Christmas tree has fallen over 8 of those years!!!! So many ornaments have been broken and oh so many marriage fights! Hide old Christmas tree stands are designed to cause a divorce. When we got the Genie home I swear it changed everything! Amazing! You just put the tree in the middle and then pump the foot peddle and it tightens around the tree. There is no turning of the screws or a leaning crooked tree. This Genie saved Christmas. (And a marriage 🤣)",
        "I had a tree delivered, and the guy said this was the easiest he saw a tree go in a stand all day. I am a small woman, and I did this on my own in a matter of seconds. The directions inside the box are GREAT, and really explain each step with good diagrams. Then it's just a matter of stepping on the foot pedal to bring in the tangs, flipping it to the lock position, and you're done. Perfectly level.",
        "My family loves real Christmas trees but we’ve endured decades of frustration and teetering firs because of balky tree stands. The Krinner stand is a beautifully engineered godsend that works. Its sturdy cable-based grasping system holds the tree firmly and works with just a few pumps on the lever- instead of endlessly turning 4 or 5 bolts that may or may not support the tree. The handy float eliminates guesswork about water level. This device is a wonderful product that is long overdue. If you enjoy real Christmas trees, you’ll love this product!",
        "This is terrible! I set up my tree with this stand and thought everything was fine.. I just realized water is leaking from the seam at the bottom. Krinner... can you help?! I am at a loss as to what to do and I’m afraid my hardwood floor will be ruined and/or the 3.5 hours of decorating today will be for nothing. :’(",
        "This Christmas tree stand is amazing. We've owned this stand for three years now and every time we get our Christmas tree we get so excited to set it up because it's so fun and easy to use! The tree goes up in seconds. No more hassle of trying to screw in the tree. This stand is build like a tank. It's very sturdy and I never doubt that the tree will fall down. Ever since we got this tree stand we've had several family and friends buy one as well. Everyone loves it. The design is genius and always make us think why this wasn't around back in the day. I can't recommend this tree stand enough. Buy it!",
        "We bought this after reading all the reviews and used it for the first time this season. We LOVE this tree stand and so worth the money. Honestly I think my favorite thing is how much water it holds. Usually by the time Christmas comes our trees are so dry and have needles everywhere. Well this year our tree is almost a month old and we have lost only a handful of needles....I directly attribute it to this stand and keeping the water level up which was easy with the water gauge.",
        "We got a 7 foot tree last December and this held it up perfectly, was so easy to use- Put the tree in, watered it daily and once we were done, removed the tree, cleaned out the stand and voila- It's been forever since I had a real tree but I do remember how the tree would lean and I had the fear of it falling over, not with this bad boy, claws of life holds on to the this tree and will not let go!",
        "Despite being low profile, this base is really sturdy and held a 10 ft tree with ease. I liked the water level gauge that let me know when to water it (it holds a lot of water). But the best feature was totally unexpected: the foot pedal. You have a big enough target to get the trunk in the base, then a few steps on the pedal and the tree is up. Ridiculously easy, one-person operation (not including a helper to tell you if the tree is straight).",
        "The best tree stand ever made. By far this was the easiest tree stand to use. I stood the tree up approximately in the center of the stand, and started using the lever to ratchet down the arms to close in on the trunk, it squeezed it tight, and held it firm. Perfect. My wife wanted me to slide the whole thing over to the side of our living room, and it slid very easy on our carpet. I filled the reservoir up with water until the water gauge popped up. I have never put up a tree so fast. If you use a tree stand, this is the one to get. It is sturdy, and should last a lifetime",
        "Stand is completely assembled out of the box and a breeze to use. Only had a small (8\") tree this year but one person could set up the tree since you hold the trunk with one hand and step to lock it in (you do really need a second person to tell you the tree is straight unless you have a mirror). Reservoir is massive, only had to add water once and the floating pop up indicator is easy to see (but not too obtrusive) tells you exactly how much water is left. Really happy with this purchase.",
        "Box easy to open with nice instructions right there on the side which I appreciate because I know I will likely lose the sheet of instructions that come inside the box. The instructions are clear and easy to read. We'll designed as is the stand itself. No screws! No repositioning the tree over and over! Simple - insert tree, pedal and ding! You're done. I love how there's a little indicator showing if there's water in the basin. Seems easy to clean which is a plus for maintenance because I am planning on making this last for as many years as I can.",
        "This may be the best product ever created! I have struggled for years to put up our christmas tree but after using the plastic ones from box stores I purchased this masterpiece. I regret not buying one sooner. If you have any difficult in getting your tree to stay up this is the only way to go. In five minutes the tree was up and it has not fallen yet! I wish I could work in marketing for this company because they need help in making this product a staple for the holiday season. I stumbled upon it and am grateful I did.",
        "i agree with other reviewers that sometimes the water gauge gets stuck, but over all it works for the most part. as long as you are dropping the tree into the stand, rather than attaching the stand first then tilting the tree up, you shouldn't have some of the issues others have had.",
        "My hopes every year: a fun romantic date night of putting up the tree and making memories. Memories prior to this tree stand: cursing, 45 minutes of tightening screws; Getting a wrench because screws wouldn’t tighten; Probably sleeping in separate beds because It was inevitably someone’s fault the tree stand sucked. As we’re driving home from getting the the tree this year: “there’s gotta be a better way”...commence ordering tree genie Current status: literally put the tree up with a glass of wine in hand while writing this review with the other because this tree stand required no hands. Under 30 seconds. Looked at each other and high fived.",
        "Works great. Would give five stars but there’s one small problem. The water gauge really doesn’t work well. Seems like it’s paper on the outside to see the measurement. Gets stuck so you have to push it down to get the right reading, and your still unsure. They need to fix that. All else is great.",
        "This tree stand is wonderful. It is very easy to insert and lock the tree in place and getting the tree straight is simple. The only downside is that the water well design makes in hard to get all the water out and even harder to clean out the needles and other debris. Once the weather warms up, this is an outdoor job with a hose and brush. I love the water level indicator float to allow an easy monitor of watering.",
        "I did lots of research and decided to pay for quality hoping to get many years use out of this. The spring snapped the very first time we used it. Now I have a tree that seems secure, but since the foot pedal and spring are broken, I have no confidence that it will stay that way and no way to remove the tree from the stand. Very disappointed.",
        "Stand came quickly. The only problem is underneath, it looked like it was dragged on concrete. Looks like someone used it before. It was also missing the little company emblem button on a string showing its brand new. I have water in it checking for leaks. Will give an update soon.",
        "This was my first tree stand that I've ever bought and it is perfect! Worked so well this holiday season. It is extremely heavy duty, holds tons of water and is super easy to use. I hope it lasts several years! I was told to buy a krinner tree stand because they are the best, and I am so happy that I did!",
        "This stand is awesome. No crawling under the tree and fidgeting with stripped screws--my husband was VERY happy about that. Also, this stand holds LOTS of water. I really like that there is a water level indicator - makes things so much easier. Our 7' tree drank three gallons in three days! My old stand barely held 5 cups of water. We did a quick water test to make sure there were no leaks before setting it up. The stand seems to be of durable quality.",
        "This tree stand is weighty, creating a solid foundation for any tree to be anchored. The five-claw gripping method sets this stand apart and securely hugs tree into desired position. Keeping our tree hydrated is easy and the water-level pop-up is super helpful in keeping our tree free from thirst. We expect to enjoy this tree stand for years. Buy this today!!!",
        "This is as plug and play as a tree stand can get. Holds gallons of water. I rewatered the tree once over the entire month. Has a pop up water level indicator with markings to let you know when you need to water. Drop the trunk of the tree into the center of the stand, step on a lever several times until claws grab hold of the tree and you are done. Only caution is that the stand is heavy but that just further assured me the tree was in a sturdy base. Highly recommend it.",
        "Disappointed. When you invest in a stand that seems sturdier than the rest, it's frustrating when it acts as cheap as the rest. We bought this two years ago, so this is our third tree in it. Worked great for the first two. We set this year's tree up yesterday. Fortunately, we didn't have time to decorate. By this morning I could tell we had a leak. Just finished an investigation without the tree in it, and we clearly have a slow leak coming through the bottom. Given the enormous interior cavity, it's impossible to know where that water is coming in. SO, back where we started, $114 poorer. Two stars for the two seasons we did appreciate its value.",
        "Best item I have ever purchased at Christmas. 40 years of screwing around with crappy old stands, and this year, my tree was plumb, square, and level in just over a minute. Read this again - PLUMB, SQUARE, AND LEVEL IN JUST OVER A MINUTE.",
        "After years of wrestling with the tree year after year I made a note to find a new tree stand this fall. Read reviews for this one and gave it a try. This stand is AWESOME! It literally took 60 seconds. I’m holding the tree as my husband backs up to look. Umm can I let go? Is that it?? Holy cow this thing is sturdy, tree is straight and it holds a ton of water. We have an 8’ Nordman but there is plenty of room for larger. TOTALLY worth the $$. Buy. This. Stand!",
        "Loved this stand for the three years it worked but this year started leaking 2 days after we put our 10 foot tree in. Water all over the hard wood floors, had to undecorate the tree and broke a lamp trying to get it out of the stand. What a disaster! For the money and everything it claims to be this stand should have a 5 year warranty at least. Won’t buy again.",
        "I'd always hate having to put the tree up with our old stand bc the screws took forever to tighten down. This thing takes a few pumps and it's done. It's great. Get it.",
        "Wow! This tree stand was everything they said it would be. It usually takes my husband and I both to get the tree in the stand, then I have to crawl around on the floor tightening the screws. Then we move it and everything has to be retightened. I put the tree in the stand, secured it with my foot and the 1 lever. Moved it into the house, turned it around repeatedly to get the best side and it stayed upright, secure and STRAIGHT! This stand is worth every penny!",
        "Been an Amazon Customer for many years, but never wrote a review before. This item just floored me. I have been among those fighting with Christmas Tree Stands for many years, trying to get the screws tight, adding bits of wood, ending up with a crooked tree, or maybe one that is 'somewhat' stable. NO MORE! This stand works exactly as advertised! Put the tree in, hold it straight, step on the peddle to tighten the cable and you are finished!!! Instead of 15 minutes or more, took all of three minutes to get that tree sturdy and straight! Well built and love the water indicator too!",
        "This is a fabulous stand - as easy to use as promised! We used this for a 9-ft fraser fir tree. The stand is sturdy, and it's very easy to place the tree in the stand and tighten the grips. It replaces another stand that we loved for years until it broke . . . .but this one is even better! Highly recommend!",
        "Without a doubt the best trees stand in the world. It saved our marriage as we used to have a very stressful time getting the tree just right in other stands. The water level feature is very helpful. I purchased this one for my daughter so her Christmas's will be stress free as far as putting up the tree goes.",
        "We ordered this 1 year ago and it worked perfectly the first time. Today we were setting up our tree and began to step on the pedal that tightens the claws which go around the tree trunk when I heard a loud clunk. The pedal no longer works, so the unit is will not tighten the claws. I will attempt to contact customer support to see if it is still under warranty, but I have a feeling it is not. I will write another reviews later on depending how my conversation goes with their customer support.",
        "Those funny reviews that I read along with the videos, pushed me over the edge to get this. Though the price is steep for the tree holder, it is indeed worth every penny. Let me repeat,....worth. every. penny. I only wish my dad was around to have had this....heated discussions with Mom would have not happened. If it wasn't for the fact that I was new to locking lever on this, it would have only taken me TWO minutes to put the tree up instead of four and half. Just buy this if you are on the edge. Rationalize the cost over a period of 10 to 15 years and you will realize it is totally worth every penny.",
        "I don’t normally write reviews, but I was so impressed with this product that I felt the need. This tree stand is amazing. With our old tree stand we would literally have to adjust the tree 5 times, it would probably fall at least once & then end up leaning eventually. Very frustrating. This one worked perfectly the first time we tried to place the tree. No adjusting, no fears of falling, no leaning. It was also super simple to use. Plus, even if the tree has an odd trunk, it will still hold it. I cannot recommend this stand enough. We LOVE it!",
        "Paid more for the stand than I did for my 12 foot real tree...was wondering if I did the right thing paying this much until we put the tree up....in less than 1 minute and the huge resoviour helped us keep the tree completely watered and moist even though next to our fake electric fireplace that puts out a good amount of heat. Looks as good today Dec 28 as it did when we put it up the weekend after Thanksgiving."
    ]
}