{
    "entity": "Equalizers",
    "text": [
        "This is a awesome product all around if your very serious about trying to make your sound system more tuned and your on a budget this will do the trick got it hooked up to only 2 amps 1 for sub and other 4 highs i can tell you this much i got a bass remote with my amp for sub dont even use it anymore its already bumping hard with jus this clarion Highly recommend",
        "It's made by clarion. What else should I say? The difference in sound quality is unbelievable! I will never purchase anything other than clarion from now on!",
        "I stopped using this after getting a loud pop everytime I turned the car off I traced wiring only to find online that this is a common problem with these I use my other one and have no issues",
        "I can't believe the price if this EQ! It made me iffy at first but really it's cheap enough to try it out... And it's more than worth it... Though all inputs and outputs are RCA so if you need to upgrade something just get amps with the inputs on them... The only downside is its difficult to mount in some vehicles... So I just put mine on my sub in my mustang... That's minor though you'll figure out a place... Best price and cleans up everything with your system so no more too much bass in the speakers crumbling them and make the best set up of frequencies through 7 bands for your liking... Clean an simple...",
        "I recently rewired and did a full audio in my truck. Door speakers are 500w with 3) 500w Rockford shallow 12's wired to a *Rockville RXH-F5 3200 Watt Peak/1600w RMS 5 Channel Amplifier Car Stereo Amp* and the sound quality is crystal clear on any and every volume level. Quick and easy install and easy tuning even if your not a professional. The company and customers even hhae tutorial videos on youtube. Definitely ang for your buck!",
        "Had some doubts when purchasing this after seeing so many bad reviews, but took the leap when I saw the price was starting to go up. Pros: Makes music sound much clearer, and gives you much more tuning control. Cons: Did not receive mounting bracket screws, backlighting did not working. Even though bought \"NEW\" still had some scratches on the clear plastic. Even Though the backlighting didnt work, I still considered keeping it because of the difference it made to my sound system, in the end I did return it and they are sending me a new one at no cost.",
        "Wondering if it was my unit, but no matter what amp or source I use, increasing gain on OTHER devices increases the white noise coming from the eq. DESPITE the clean signal and power. Will need to investigate, but im stumped. It is quite noticeable at low to no volume.",
        "Just like the Old Days...Great sound from a awsome product",
        "This Equalizer completely changed my car. As long as you enjoy adjusting to every song. You can get the the 80 -250 hz to hit perfect on the mids right before your doors start rattling, that's if you have a rattle machine like mine. A Great Investment. I used 14 gauge romex for the power, rem, n ground. It could fit 12 but its very very unnecessary. The Lights aren't too bright. All around kick ass.",
        "My old EQ74 went out after a lot of years. I run a small amp and some decent speakers. This new EQS746 works really well. Much better quality then the old EQ. Like others have said, the display is really bright, but it does look cool. I highly recommend this if you are putting together a low $$$ system. You will not be disappointed.",
        "I was really looking forward to getting this but now I'm not so sure. Based on all the reviews and from everything I read this was supposed to have a s/n ratio of 105db. It seems that has changed because the manual for the unit I received says the s/n ratio is 83db. I know that the EQS755 has the 83db s/n but mine is definitely the EQS746. Anyone have any info about this?",
        "Made my highs transform from mediocre to wow, now sounds like a concert and the clarity is awesome , at high volumes it will not sound harsh or hurt your ears. Really wish the sub control wasn't control by the other bands as well really hate that, had to bypass the eq yo my sub amp, should honestly have an input for each channel rather than just one leaving you to choose if you want yo run it from front or rear Would've given it 5 stars if it weren't for that",
        "This Clarion equalizer has a very nice sturdy build quality and the adjustment knobs are very responsive with no distortion noise. It has great power rating handling that boosts my sound system. My only gripe is that there is a cut off for lower bass frequencies that my speakers would otherwise easily handle, yet the high pass cutoff for the sub channel is too low at 90hz. In the end I'm left with a system that is straining to find a certain range of bass frequencies that this equalizer has removed.",
        "What a unit for $60... I have 4 Sundown 15's in a 4th order and this eq controls everything from the 7 most common hertz to subwoofer volume or gain, or the complete overall volume of my system. I have it wedge between my seal and the center console right where my arm rest and my hand lays right on the knobs for instant control.",
        "Installed in a high end system. Caused a ton of noise/feedback and turn off and on feed back through the speakers. Since it was all installed at the same time it took a couple months of trouble shooting to figure out that the EQ was the problem. Now it's too late for a return. Don't buy this if you are a audiophile.",
        "Really this eq is one of the best I've ever own iam supersize how much they cost now when I got mine for only 60$$ I was shocked",
        "This EQ/ preamp is a little gem! It's internal circuitry cleans up the signal while giving you a 7v output maximizes your amplifier. You get only pure quality sound the way it was meant to be. The 7 band EQ then lets you tune it to your liking all while having auxiliary input, sub out and a fader. You cannot go wrong with this EQ/ preamp. I highly recommend it!",
        "Clarion word is quality proof, excellent sound, great size, everything is fine on it. It has one dual input (left/right) for your receiver/stereo, it splits into two dual exits (2 left/2 right) for front and rear speakers, you can connect 1 amps to each pair of exit and get an extra punch, it also has one dual exit for subwoofer with low pass filter and volume gain to connect an additional amp to it. (3 amps totals you can connect). And the last one and not less imporotant is it has an aditional Aux input for you to connect an MP3 player, a DVD player for the kidos while trael, etc, you can connect everything you want on it.",
        "Good EQ, real clean. Love the way the nobs feel in your fingers - small adjustments easy to attain while driving. The unit does burn out, however, with serious use. My first one lasted about a year. After shopping around again, I found that this EQ is so versatile and effective (and affordable) that I purchased a second one to replace it anyway.",
        "I love the quick access. No more fumbling around in menus on my head unit. Only problem is my audio system does have an ignition whine noise, but the noise might be coming from the separate AMP or possibly . I haven't tracked it down yet.",
        "Great unit. I ran this in between my lc7i and aftermarket amp. Gives great control over sound adjustments. The sub out with adjustable low pass filter sounds great as well.",
        "Excellent equalizer!!! Worth every penny. Sounds crystal clear! The knobs are easy to move, they glow blue and not too bright.",
        "I had an olde version of this unit in my boat for several years. Finally quit working after getting wet MANY times LOL. A testament to the quality of the unit in my opinion.",
        "This clarion equalizer is a great product to have if you are into setting up your car audio with a heavy sound. It offers great control over how the mid and hi ranges perform. Where as for the bass the built in crossover seperates the mid and hi ranges from it very well giving you pure clean bass. I like the performance of this eq, it is worth giving a try, it won't dissapoint you.",
        "sound control is a pain in the back side. i'll know tomorrow.",
        "Thought it was dead upon arrival but turned out I had the power and remote wires backwards. Works Great.",
        "Yes its another gadget, but well worth it trust me. Its sooo nice being able to control everything (especially my subs) at the flip of my wrist. You can make your music sound however you want it to sound, and it really scrubs the signol. My tunes are CLEAN! Highly recommended, especially for this price!",
        "Has to be the best for the price. I replaced an old Clarion from 1994 with this and added a remote on the dash of my boat. With the 6 speakers I have, and the ease of installation it's like being at a concert all the time when I play my cds.",
        "This is a very well made, functional eq. Adds a ton of adjustment possibilities to the constant tweaker. Looks good but can be a wee bit tough to adjust for those of us with thick fingers. Can't be the price of this sweet equalizer.",
        "Product was great. Ear buds not so much they were no where to be found.",
        "I am using this equalizer with a small amplifier with no head unit in a vintage Thunderbird. I plug my iphone into it. First I tried just the amp because it has an aux plug also. It was ok but nothing like after adding this equalizer. The sound quality is amazing and it also added considerable volume over just the cheap amp. Very happy with this purchase!",
        "I installed the clarion eq on my 2010 buick lacrosse factory system. All of my friends are wondering why they didnt do the same. You can fine tune any type of song right at your fingertips and the size is so small. The blue light illumination definately compliments my back lighting and every song can be made perfect by tuning yourself. Take my advice and go get one for this price and rejoice at end result. You will not regret this move.",
        "Always wanted a eq but never knew i need more than one amp to get one so i added another amp . like everyone says this is a good equalizer its wakes everything up and its half the price on here than at my local beat shop. No complaints here Thanks Amazon keep up the great deals",
        "does this improve the sound of music? Yes. Is it accurate? Maybe. Truth is i was running a electronic passive crossover when i replaced it with this but it s crossover points are not where they should be. To my ears it shifts my bass to the upper range rather than filter from 300hz and below to the sub amp. it also cuts bass from that point which bass is still part of. 90Hz is an unreasonable cutoff point it should play bass from 300 down and allow me to adjust from that point. This is my only quarrel with this EQ.",
        "Works well when working correctly this will be my third one hopefully no more ground issues",
        "This EQ is a very good accessory to your car deck, but is really useless unless u also purchase a good \"kicker\" amp. Together they will produce a killer sound for u!",
        "I recently bought a 2010 Mercedes S550 and was completely disappointed in the stock Harman Kardon audio system. Thinking the problem may be in the factory head unit's equalization (and very limited Bass and Treble controls) rather than the speakers, I tried the Clarion going through the car's Aux In jack. Instant joy! I was able to dial down the harshness in the mid-range, punch up the bass a ton and put some sizzle in the highs. It's like the car got a new full blown aftermarket audio system makeover. Highly recommended!",
        "Still works like a champ in my car. Bas hits hard i would recommend it to any one i have haf it for 2 years.",
        "EQ is used, think I deserve half my money back seeing that I’m not sure how long it will last",
        "Very well designed, sounds great. The backlighting is a little bright.... but i have it hidden in my center console, so it's not a problem for me. Built very well.",
        "Good unit and good selection of EQ frequency bands. I use it to EQ HAM radio AM/SSB voice and it does a very good job.",
        "Purchased for a friend that loves to tinker with piles of 12V audio gear. Gain, noise level, and control access are features he remarked as being happy with.",
        "Great equalizer but never got to install it since my double din receiver has a built in equalize so why spend the extra money on buying and installion.. Ended up returning it.",
        "This Xover is the best one you can buy for the price. After installation, there was no noise coming from the speakers. You can control the Mids and highs as your taste and the speakers sound a lot clearer. Love it!",
        "Without this I can't get my music from my Galaxy Tab/Samsung BT Adapter/Other 3.5mm input device to my Amp's.. necessary for me and it has worked great for the last year and half!",
        "clarion its been in the market for long time and this eq its amazing!! i got it in my car and i can control every single sound with it i mean if u want clear sound u need this eq in ur car! thanks clarion",
        "This EQ is truely awsome. I have it teamed up with a Clarion FZ406 HU and I tell you this combo is the bomb. Installation was pretty simple. The blue lights are really cool and not too bright. Nobs are a little small or maybe I just have big fingers. Get this EQ for less than $50 you can't get any better.",
        "Great EQ except for the low pass switch at the top had to pull out radio just to switch frequency from 60 to 90 hz",
        "I got very little almost no noise and it does its job adjusting the levels. Knobs are so much better than sliders",
        "Easy install. I bought this for my wife to replace an Alpine 3331, she loves it.",
        "Fantastic! For the money i dont think it gets better than this! Knobs are a little hard to turn at first but that is a good sign. They have loosened up over the last few weeks. Knobs also a little small if youve got big fingas, but no real problems.",
        "It is a very good product everyone should have it in there sound system it makes a big difference on your system but You must have a front output on your head unit in order for it to work it does not work on A output sub woofer it only works on a front output if you only have A outputs sub woofer then you would have to get a head unit that has a front output on your head unit",
        "I love this Eq. It gives you power to your sound at your fingertips! I can control my highs, my 18 inch subwoofer, and whatever else I have with ease! I hooked it up myself cause I'm used to doing my own audio. But if you have no clue what you're doing you might want to find someone who does. It lays out what goes where tho in the instructions. Thumbs up!",
        "If you don't have a Equalizer this is a must have. It Looks supper cool and it gives you full control over your music. It works wonders on bass. The option I like is that it has aux feature and you can connect a MP3: if your head unit douse not have a aux feature. For music that has weak bass this unit can make it sound way better. I love it.",
        "I had to buy another one of these because my last one is about 5 years old and started making noise. But after the installation of the new one, it was back to clarity with little feedback",
        "This is just a flat out awesome deal. Far better control than just a basic 3-way low/mid/high eq. Allows you to really tune the sound. The ONLY reason this is 4 stars and not 5 is that the LIGHTS ARE BRIGHT and can not be turned down. I like keeping the interior lights dim at night and this sucker is BRIGHT. That and just a few small nitpicks with the dials... I would lay them out a bit differently is all. That's just personal opinion. But hands down it's a great piece of gear at a even better price!",
        "this is my second one. I do really like it. the only thing I don't like on this kind of EQ is that it does not goes very low frequencies.",
        "I’m having problems with mines and I order this like 2 months ago or maybe less",
        "This unit is great. I can honestly say I'd never do another install without one or a comparable product. The built in line drive gives a nice clean output to your amps. In fact oscilloscope showed that with the radio set where it did not clip output, this unit could go to full volume without clipping. (In some ways this is what you would expect but often not the case with this type of EQ) Vast improvement to sound over running deck to amps directly.",
        "With this controller I achieve equilibrate my car system sound. Also it looks terrific in my car. Is a very good article for price.",
        "I've been using this for a long time now (1yr+) and I'm still in love with it. The clarity is decent, ease of use, the sharp look to it. You can't beat this EQ for the price",
        "This right hear is the key tool to a system",
        "It feels like super high quality materials. The nobs are super smooth and I love the blue lights. Arrived on time 10/10",
        "the clarion eqs746 is one of the best in sound technology it a stable and balance output levels with no distortion and the sub woofer is quiet unique what else can i say if you are lokking for clean clear sound the Clarion EQS 7456 is the way to go.",
        "Easy to use and install. I had the old version of this for about ten or more years and loved it. This one looks better and sound really good. Really improves sound. Very happy.",
        "A great way to improve the overall quality of sound with the ability to tweak individual frequencies. Enhances highs and lows beyond the presets on todays stereos. The best way to improve sound quality for a minimal investment. It is very easy to install with the added feature of an auxiliary input for easy switching to an iPod or other audio source. The dials are soft lit in blue (a feature not in the original description). An excellent buy.",
        "I want my money back or a new one sent to my house because when I got it the eq was not working.",
        "If you want something that with allow you to tweak the heck out of your music and give you a great signal look no further.",
        "This is the best eq I have purchased. I have it set to a Rock style setting and it needs very little tweeking once a song I like comes up. I have the head unit set a little over mid-level on volume and only use the master volume of the eq to adjust the sound. It looks great at night with the blue lights!",
        "Very cool EQ. I put it in as a volume control + for my tablet install in my car. Better than expected. Love it",
        "Second time using this both exceeds it purpose, a must buy.",
        "Sucks I've had two of these just fail on me. And they don't even give you an option to contact the seller. Cheap bastards",
        "This unit worked well for my needs. I have a Pioneer head unit with only one RCA output. The Clarion is designed for this and takes the one input and provides front, rear, and subwoofer output. This means you can connect up to three amps to the head unit. The sound was great, and it did not seem to add to any noise or hiss when added to my existing system.",
        "I am Very content with this purchase. I have 3 amps connected to his Equalizer; 1 for the Front, 1 for the Rear, and 1 as a Sub. I had all of them connected to my Head unit; and the sound was good, but not great. As soon as I installed this Equalizer It blew me away. The sound quality that comes from this is just outstanding. I would Recommend this Equalizer to Anyone and Everyone!!! (2003 Honda Civic EX Coupe)",
        "Brand new sealed item. Was recieved 7 days earlier that expected!!!!!! Thank you",
        "Just got it and went to install it. Put power to the + - and nothing. No lights, no power button, no sound? Measured the power at the screws where you tighten the wires and have 12v. Guess I have to send it back.",
        "Installed in series with an Alpine headunit with 2V preouts... greatly improved the signal and provides the ease of adjusting without going through submenus on your headunit... I definitely recommend this product if you're not running a strong source signal or you just want some easy adjustment",
        "The connections for the ground/power/remote are awful. I found it nearly impossible to get them to stay properly in place without losing one of the connections. Even when I was finally able to (temporarily), the EQ was not very effective/it barely had a noticeable effect. I ended up taking it out of my signal flow and it is currently sitting in its box. I do not recommend this EQ.",
        "i sent it back because didn't really need it, with 4 6x9, pioneer 4 way. pioneeer head unit, infinity amp.",
        "This clarion is phenomenal! The control it gives you over not only the low end frequencies(which is outstanding!) but the mid and high end as well! For the small price you pay, you get BIG performance! Buy ,and I guarantee you won't be sorry! Robert L Isleton, ca",
        "This little piece of equipment took my system to the next level it made everything so much more clear and easy to control. I didnt run my subwoofers through it cause I didn't like how the sounded but everything else MAN you got to get this thing you won't be sorry you did.",
        "sound is excellent, but the volume starts to short out after about a year.",
        "It can deliver a clear sound with immediate response when adjust the selected frequency. Put it in new console between front seat of Honda Spada and the size is right, thw sound stage is great",
        "This EQ was a true help. I was able to pull out some other stuff and just have this installed and still had a much bettter sound. if your anything like me i have purchased alot of music items but this one was one that my wife even said this was one of my best deals. That means it exceeded expectations",
        "what you see is what you get, great conditions, new, love it, love it, love it. this item i really recommended.",
        "I've been upgrading my car's audio system bit by bit, and dollar for dollar, this is probably the most efficient purchase I've made. This lets me fine tune on the go, allowing me to accentuate the important levels for whatever genre I decide to switch to. No weird noises or muffled sounds, and so far nothing bad to say. Great product, and I'd buy it again in a heartbeat!",
        "my brother ordered this for his car and is a great equalizer. works great. I will recomend it with no doubt",
        "Best eq!!! My second one. Would definitely buy again and again!!!",
        "If you already spent any kind of money on your system but don't have an e.q. , this is what you need. Will double your sound quality easily.",
        "This eq does what it says and exceeds expectations , this is the best on the market..I installed a iPad mini with no head unit in my truck and this works perfectly for the price",
        "Replaced my 4 band soundstream EQ with this one, and wow! it changed my car into an entirely different beast! it was a little confusing at first to learn what each band does, but once you get the hang of it, theres nothing that wont sound good. Classical to Death Metal, Country to Hip Hop. if twist a few nobs, the soundquality is absolutely superb",
        "I like this product. However some rewiring was in order. The battery was dead the next morning due to the way it was originally wired. Causing the Eq and the amps to not shut off when the car is turned off. All fixed now and works good",
        "This Clarion equalizer is the best I've ever had. I don't even have a head unit hooked up to it. I just run my ipod straight into it. The sound is powerful and clean. The soft blue illumination that glows from behind the knobs is very nice and not overpowering at night. The connections are all gold-plated so they conduct all the power and sound to it's maximum potential. LOVE THIS PRODUCT!",
        "had it before knew what i was getting solid unit thx",
        "I bought this for my son, and it quit working right after our return date was gone. Terrible!!",
        "for the money you are paying for the eq.. you cant really complain unless you recieve it broken. this eq has been great for me and all my friends that owns it.. i had this for more than a year now and i have no problems at all.. great mids/highs and bass signals.. i use it almost every day, and no complaints. for the price, you just cant go wrong",
        "Purchased about a month ago. And i had everything wired properly, it worked well but stopped working !! I checked my rca and amps and they were fine when plugged directly into my head unit, the eq even lit up but was not giving out sound. Do not buy only lasted a month",
        "Insane clarity coupled with attractive lighting and design all in a compact size!",
        "awesome product a must have in your car audio set up",
        "Replaced an old crossover with this item and was able to dial in audio ranges that allowed garbled sounds to be heard clearly and the subwoofers are better than ever. It fits perfectly in a VHS case to maintain the dark environment."
    ]
}