{
    "entity": "Equalizers",
    "text": [
        "Major upgrade to my old unit,the nobs are of metal rather than plastic that gets Shakey after awhile it comes with only the power wire which is not attached to the EQ like the older units.",
        "I was very happy with this at first. The sound quality was great, the price was great and it worked they way I needed it to. After about a year the audio in my car just stopped and I discovered it was the EQ. I gave it the benefit of the doubt and bought another one. This one just failed on me after only 4 months. So I am pretty disappointed with this EQ and would recommend getting something else if you are planning to use this regularly.",
        "Got it today, ran just the subwoofer which is only a 500W alpine mono amp with a rockford punch 12\" subwoofer on a bandpass ported box. Made a huge difference in responsiveness for death metal. If youre a metal head, definate win! 🤘🤘🤘",
        "If you are looking for a reasonably priced equalizer with great tech support this is it. My e-mail question was answered with a tech name and his phone number within a day. The tech walked me through what I needed to do and had me listening to music in no time. Great customer service makes for a great buying experience and product!",
        "In the beginning, the eq worked flawlessly, everything was sounding good, then suddenly, I was getting Barley any sound out of all of my speakers. Took the entire car apart, checked all of the wiring throughout the vehicle. And it turns out that the equalizer was bad. Upon removed the equalizer from my vehicle, I can here something loose on the inside. My advice, save your money, and invest in something like a massive or clarion 7 band",
        "scared it will drain my battery, guess ill have to hookup a toggle switch,, it randomly turns on and the quality of sound isn't that great dont buy",
        "I did not like how some of the wires were hooked up it should have just been nothing but why's all those extra three wires you had to hook up virtually made it look like s*** not a good looking item nobody wants to see all those wires coming out of the back of their stereo just saying",
        "Another great product from Power Acoustic. Does exactly what it says, control your low, mis and high range output. Bass and frequency control. Great product, would recommend",
        "Sofar it's been working perfectly. it's a plus that it turns 2 channels into 6 I've got a 1000 watt amp hooked to 2 12s another 1500 watt 4ch hooked to 4 6.5 3 ways & still got4 more channels coming out of my head unit",
        "Easy to install but could not get anything to adjust I ran my 1 pre amp out put from head unit to the c d input on eq and the ran rca to amp no sound ?",
        "This product works really well!!! I absolutely love it!!!! Amazon has amazing things for an absolutely great price!!! I would definitely recommend this product for everyone. Love It!!! Thanks Amazon!!!!",
        "Great buy even better seller get it now while the price is low well worth it",
        "I have 3 15inch dbl coils kickers amp for hi/low. This EQ will deliver the job right.. Definitely a happy customer ty..Check out the video and it's on on 9 vol..",
        "I used it as a gift for my husband and he loves it.. he used it to inhance the music in his truck and it sound really good",
        "Exactly what it says it is. Easy to install. Kind of bulky but made it work.",
        "Was good for almost a month den just shut off",
        "Nice add on to my system easy to install and very good price",
        "Good product. Good price. The quality of the out sound is enough good.",
        "Fast shipping......as described......brings out the lows ....good for the price....",
        "Very good work perfectly for me I would definitely recommend.",
        "Item works good no problem with the fast delivery and price thanks",
        "Works great I would recommend to everyone I know thanks amazon you are the best shopping site ever",
        "I needed a phono amp for my newer Onkyo amplifier to operate my record player. I chose the wrong one as the car pre amp was in the midst of a long list of phono amp. Thanks to your allowing the return, I was able to get the audiophile unit I desired. It was more expensive but I never mind paying more for the quality products you offer. Thank you again.",
        "It great works wonderfully I love how it amplify the sound clarity",
        "had to return (used item) came with indicator light where the cd push button is shown! Appeared to be a well made product, so I changed the 2 star to a 3, but hey, it is my money and it didn't work out. Read all reviews and consider it.",
        "Nice little equalizer, note, stereo input so if your using a fader from the radio, think twice, you may have to use this as volume and fader Nice sub woofer option",
        "I really should have given this no stars, however, being that it came as a dud a single star is appropriate in all fairness. Being that there is no education in the second kicking of a mule, I returned it for another model.",
        "I have had this eq for about month it is well worth the price i help make u mids a high sound amazing and the build in bass booster real increases the bass for u sub this is a great product would but again",
        "This is a great product for a unique sound to your vehicle... LOVE it and the price.. plus fast shipping!",
        "Really works well it solved alot of my balance issues! I would check the fuse before installation because mine was blown and it took me a while to figure out why I had no power.",
        "Still have in my hummer since purchased and its great",
        "I've stalled this equalizer yesterday and I must say that it delivered the job it supposed to do. It makes my music sound clear and adds more volume without distortion. I recommend and I only paid 23 bucks. I will add a video and pic an other time. Update work good while it last..the equation stop working after 3 months of use ...disappointed..",
        "It's good just watI wanted an for the price you can go wrong",
        "As advertised, small, well packaged, no surprises really. The unit gets warm to the touch in operation, almost hot really. I'm not sure why since this isn't an amplifier. A little temp I can see but this is really quite warm. 5 stars except I'm expecting the heat factor to shorten it's lifespan or cause future problems. Still, can't beat it for the price. I'd buy another.",
        "Doesnt have a wide frequency range..volume control is limited. VERY disappointed. bought 1 for my self and 1 for a friend. We plan to sell and get boss or clarion",
        "Never in my life building sounds system i come aross x2 \"two\" power acoutik pre amp last longer than 5min. I give one star rateding because the lights are blue.",
        "My pre amp came without a power supply and therefore doesn't work",
        "Crap, bass doesn't work. It plays with highs makes my 12s move 2 much",
        "i like the equalizer but the only thing is that the lights dont come on on the the knobs itself.",
        "Was not very impressed. Thought I would pawn it for ten bucks. But I'll give it to them.",
        "This pre-amp is great for a low budget audio system that needs a little boost. My problem with it was that when it was installed I had a terrible high pitched buzz through my tweeters that I just could not get to go away. Ended up removing it all together and the high pitched noise is now gone.",
        "It works - I use it on my boat instead of a head unit running multiple amps for the inside speakers, the tower and subs. Only disadvantage is it has split volume between the subwoofer output and the other outputs. Kinda clunky, but, what I did is got everything dialed in, and just use the volume on my phone instead for \"joined\" volume control. Else, you turn the mains down, and the sub is still running full volume. minor gripe.",
        "I added this to my homemade boombox that is using car audio equipment (2 amps, 2 speakers and 1 sub). It worked really well as a pre-amp. Takes in a bluetooth dongle or phone and will step up the signal for a car amp to take in and handle. This allowed a much finer control over the sound, volume, and quality vs plugging my phone directly into a the big amp.",
        "Have had this product in my vehicle for 4 months the first one I got must of been defective I got no sound just white noise I hooked up various tests I had a buddy with a pre-amp we used his and it worked perfectly...when I emailed the company they were cool about it they did the right thing and sent me a new one and I have been enjoying it very well very crisp sound I don't wanna sound like in exaggerating but it almost seems as if my stock speakers amplified a little bit definitely recommend",
        "Oper instructions missing you must have +12 to both +12 in and and REM terminals to operate. When powered up absolutely perfect response! Excellent range exceptionally clear .",
        "Ive always loved power acoustik, lows,mids and has you can hear everything over the bass thx to this eq",
        "Works ok for the price. How front left and rear left channels do not work. I used a splitter to make it work. Clears up the music, but does not amplify much. If you have the cash and a decent sound system, spend the extra cash on a Clarion.",
        "The price on this passive EQ is excellent. I mainly use it for my subwoofer amp. With this passive EQ I can adjust my subwoofer amp down to 50 Hz. The base I receive is amazing. I use it with my Pioneer stereo and my JVC amp.",
        "Many different brands out there, but this inexpensive EQ works great. I love the way it makes my system sound. No need to spend more.",
        "For the price this thing is amazing. The crisp and hard sound surprised me. You get what you paid for does not apply to this unit. It's just as good if not better than the one I replaced. I'd definitely recommend this to anyone who is looking for a great sounding EQ without the high price tag attached.",
        "Worked fine for a couple of months then today it said, no more, I quit.",
        "Works perfectly as advertised. Once our sound booth team worked with it a bit... great output",
        "Made my sound system much more louder and cleaner sounding",
        "Works great mskes a bad sound into good quality sound",
        "Does what I need it to do and easy installation",
        "Liked because it was a 5 band instead of 7. After it was delivered wished i picked a better one. Knobs are too small. Hard to grab them. And there stiff to turn.",
        "Easy to install. Great sound with no feedback noise. Love it.",
        "Awesome product. Definitely improved the quality of my sound system. Would recommend to everyone",
        "Doesn’t have the features it claims to have . Waste of money",
        "Item came with minimal mounting hardware, and instructions were not informative or helpful. This \"equalizer\" does not tune frequency ranges for highs or mids, it does for subwoofer output . At night it's difficult to see knob settings. After four months preamp outputs stopped working on right front, and right rear!!",
        "Not bad for the money. Installed pretty easily. Wish it had the little tangs that stick off the side of the knob instead of etched in arrows. Really the only complaint that I have. This equalizer really changed the sound of my system, and it also made adjusting the sound on the fly much easier. My head unit is a JVC Media only model. All the sound adjustments/equalizer settings are buried in sub-menus. Not easily changed or smart while driving.",
        "Got a crossover plus the headunit and amp for adjust my speaker to my ears than this gift from God came in to save me lol it does a lot ,no is not a badass expensive one but works awesome I recommend it",
        "Matched with a basic system, amps and speakers, dynamic difference. I wanted to wait and check durability and flexibility. This lil thing made a big difference for a lil bit of money. Do it",
        "Needed something to boost my music without too much wires and other costly side ends(for hissing). This gadget fixed me up nice and made my music sound as if I had a bigger amp. I highly recommend this pre-amp to any interested party!!!",
        "Came on time, just installed and it works great makes my music sound way better this was my first time using an equalizer in my car and I can't believe I ever was with out it",
        "Doesn't work if stock head unit powers speakers. Must have sub and door speakers powered by an amplifier for it to work. You also get what you pay for, I have a much nicer EQ in my boat and it makes a big difference"
    ]
}