{
    "entity": "Sweepers & Accessories",
    "text": [
        "I like this sweeper. Actually I have had it for a good ling time now and just getting around to reviewing it. It does a fantastic job. It's way better than others I have had in the past. It takes some effort to push it on berber carpet. The brushes don't roll and pick up well when pulling it back. It does pull back and forth well on hard floors. Emptying it is a little wonky so be careful you understand how this works first and I recommend holding it close to the top of the trash as you remove the dust box. If not, the dust, etc. can go everywhere.",
        "The design works in theory only. It wouldn't pick up anything on low pile carpet. I returned it and ordered a Bissel carpet sweeper, like the one I had 20 years ago and am so very glad I did. It works wonderfully and was a great deal less expensive. It just proves that new designs and being more expensive doesn't mean you are getting a better product. Amazon was great to work with on the return, no hassles.",
        "We have a number of cats and litterboxes and it helps me keep up with the tracked litter, and it's super easy to empty the basket. We have quarry tile in most of the house and it does sweep just fine even in the lower areas of grout between the tiles. I can sweep one-handed while talking on the phone. I do have to keep scraping cat fur off the brush or the sweeper becomes much less efficient. One drawback is that I can tell I'll wear the brushes out on our rough tile, and I would love to be able to buy replacement brushes, which after an internet search do not seem to be available.",
        "I'm amazed at the amount of trash, lint & dog hair this sweeper will pickup. I'm in wheelchair & this sweeper makes cleaning up here & there so much easier than dragging out the vacuum cleaner & battling the electric cord as I roll over it. I have vinyl & indoor/outdoor carpet throughout because of the wheelchair, so this sweeper is perfect for me.",
        "I am comfused, There is no top for the unit. After you attach the poles, there is still another screw top that should have something on top of it",
        "It is fine on hardwood and tile. Not good for oriental rugs",
        "The cleaning capability is impressive enough that I got one for my daughter, too.",
        "Thought it would be helpful on the back deck with outdoor carpet. It wasn't. Tried it on the hardwood floor, was not impressed. Pushed the dirt around more than picked anything up. Save your money.",
        "This is the best sweeper! It even has a little plastic brush rake that snaps onto the bottom of the handle for storage. You don't get 'reverse rug mess' if you use the rake before each use.",
        "This sweeper is hard to push, even on very short nap throw rugs. Its higher than others so doesn't go under the lip of kitchen cabinets to get crumbs the circular brushes should pick up. I should have returned it right away. The less expensive one I had works better on hard wood and area rugs.",
        "This has to be the most excellent manual vaccum I have used, it picks up everything, even dog hair. The only draw back to it is the dirt tray, it is open on one side, of course to empty, just be aware when you pull it out which side is open. I have cleaned as a pro and would recommend it to any business or household, it is not like the other manual vaccums. Kind of high priced compared to others, but does everything it says it will.",
        "I love this! Very straightforward and easy to assemble. I got pet hair and dust on my carpet and it picks it up very well. I just had a baby and pulling out the vacuum everyday wasn't ideal. This product was good to use for in between vacuuming. Love it!",
        "Works good on laminate and tile but not very good for carpeting.",
        "Didn't pickup hardly anything. It was a total waste of money. I gave it away.",
        "The only thing I had a problem with is that it doesn't have a label for what side the trap empties on. I just wrote on it with a silver sharpie(this side up) and that solved that problem.",
        "This is a good-quality sweeper. It picks up most of the crumbs, dust and all, after a few passes. I think that other reviewers may be expecting this to work more like a vacuum - it will not get every last bit, and it will take more than one pass. For quick clean-ups, it's great.",
        "good design. It gets the job done both on hardwood and carpet.",
        "Works find but the handle is at the wrong angle for my bad back.",
        "I have gone through many a vaccum cleaners. Just recently bought a cheap $20 one - and threw it away within 2 days. Item broke. This vaccum does not break. no matter what I pick up. Have ordered my second one for large home.",
        "not good for use with pets, hair gets tangled in the brushes immediately",
        "We never knew we had so much filth within our rugs and on our floors until we got this sweeper. It supplements regular vacuuming nicely, and picks up way more than we expected. We can even operate it when the kids are asleep!",
        "It's not that easy to push tried all the adjustment but either the floor still dirty or it's too hard to push. It's not as good as they said. Spend your money on something works!!!",
        "This product is as advertised. A light weight easy to use every day sweeper of carpet and floors. Easy dirt disposal. I highly recommend it.",
        "Does not pick up very well at all. Very disappointed in this product. Thought it would work much better since its German made.",
        "I'm used to electric. Just wanted to practice my right to choose.",
        "This works good on carpet, but is horrible on hard floors! I bought this to use on both carpet and hard floor and it works good on getting out the cat hair and lint from the short pile carpet I have, but go to the hard floor and no matter the setting you have it on it just throws the food, dirt and whatever else around. Following instructions precisely doesn't make a difference. I am returning this unit and going to buy a different brand. I've been hearing and reading that the Bissell is pretty good.",
        "great for surface crumbs, debris, and whatnot. picks up everything from pieces of paper to bottlecaps! for some things you might need several passes but it'll pick it up. the brush needs to be aligned correctly, low enough to touch the floor/carpet but high enough to move the unit freely.",
        "Just received it today and tried it on different floors throughout the house. It picks up far more than my Bissell ever did and I will use it instead of the vacuum for most chores. The only reason I gave it 4 stars is because it is quite hard to push when you use it on carpet, it will give you a workout. Emptying it is simplicity itself, just pull the top up and dump the dirt out the side. I only used it for a few minutes and dumped out a huge amount of dog hair.",
        "I am always open to try anything that cuts my electricity consumption, so I was excited to get this product. It is very heavy and has a sturdy construction, but the handle almost seems silly because it is quite thin. I also don't like that the brushes get tangled with hair very quickly (and I'm a neat freak) and it is difficult to clean the brushes. I still use the product, but it is mostly for light touch up cleaning.",
        "This carpet sweeper is very impracticable. The brushes on the side do nothing but make the casing jump up from the floor, Its a very poor design. I have a 15 yr old Bissell that works better than this heavy duty looking one.",
        "GOT IT A FEW DAYS. I LOVE IT. IT REALLY WORKS GOOD IN CORNERS. MY MAID LOVES IT MORE. NOT JUNKY. IT IS STRONG AND HAS SOME WEIGHT TO IT. WORKS GREAT. THE ADJUSTER FOR CARPETS IMPRESSED ME",
        "I really loved my carpet sweeper until something heavy fell on it or twisted it and the handle broke off. Really unhappy about that and don't know anything else to do but buy another one. I see that the picture of the product has some sort of different attachment where the handle meets the crossbar. Maybe they've strengthened the connection. I've had many carpet sweepers, but this is by far the most efficient and easy to use.",
        "I like this sweeper but my wife is not thrilled. She doesn't like the way it does our wood floors. It does a good job on carpets or rugs but doesn't seem to pick up as well on hard floors. Although I find that with an extra pass or two it will get everything on our wood floors.",
        "This handy carpet sweeper really does work. No electricity needed too! We really like it.",
        "Expensive, but worth it! My Corgi sheds 24/7 and this thing gets most of his hair off the rugs, fully as well as my upright vacuum. Easy to use, empty and store, with no cord to plug in and unplug, etc...takes me half the time for the same job! I've had other brands of carpet sweepers, with poor results. This is a keeper!",
        "This is my third one, I like it very much.",
        "Threw items to be swept up all over the floor.",
        "Shocked at how well it works. I HATE pulling out the heavy vacuum...and the shop vac didn't do well in the house. Finally, clean floors!",
        "I had high hopes for this. But it ends up frustrating most of the time. A friend bought me a cheaper one from Walmart that works better, is much easier to push, and costs way less. So sad:(",
        "In some cases, this actually works better than a vacume cleaner. In fact, I havent used my vacume cleaner since I bought this gizmo! It is well-built. Nothing cheap about it.",
        "We had one and that's why we we bought a second for my brother. Easy to use for quick clean.",
        "After using the sweeper for a while, I can attest that it's a well-made, effective sweeper. Two considerations: the handle can't tolerate as much pressure as I'd like to apply and it the sweeper doesn't handle anything other than tiny amounts of lint/fur. That said, I'm still able to limit frequent vacuum use because of the sweeper. I'm MUCH more apt to use the sweeper than the vacuum, which I'm now using only on cleaning days. I'm happy with this unit.",
        "picks up most dirt and ALL dog and human hair! but not a vacuum so if you are a clean freak don't buy it. great when you have a toddler and you constantly have bread crumbs, dried play dough crumbles etc. on the ground make sure you adjust the height for the thickness of the floor covering/bare floor",
        "Seller was prompt and great but the sweeper wasn't as good as I had hoped. Not bad though.",
        "The Leifheit Rotaro Carpet Sweeper is the best carpet sweeper that I have ever owned. This is not some piece of crap made in China. This is a first class quality machine made in Germany. The Leifhit Rotaro Carpet Sweeper will work on both bare floors and carpet. I love this machine and this is the only machine I will ever own again.",
        "Cannot believe this is a manual sweeper -- outstanding -- so good three friends purchased same and they too are most pleased.",
        "I bought this for my office. It is very sturdy, does a great job of sweeping the carpet, is easy to clean, and hangs on a nail in the closet. What more could I ask? Yeah, I want one for home, too. It is a step up from the Bissell I used to own.",
        "Have tried others, some conventional plug ins; a battery operated one and they all failed miserably. My wife just wanted a good old fashioned carpet sweeper. I did some research on the internet and liked what I read about this Leifheit Rotaro S carpet sweeper. Well made product and my wife is happy with it. That, in itself, is quite an endorsement. I would be surprised if many people were disappointed with this.",
        "Best push sweeper I have ever used. yes better than Bissell!!",
        "We got this before we bought the electric dirt devil and the reason we bought the dirt devil is this really didn't work. It did an OK job o hard surfaces and did a very poor job on carpets. Pass.",
        "works OK in coffee shop on floor around tables not well on area rugs"
    ]
}