{
    "entity": "Sweepers & Accessories",
    "text": [
        "I have wood floors and three low carpet areas to clean. I needed something that adequately picks up dust bunnies and sand. Yes! The rollers are high quality and the design/engineering makes it easy to clean. My dust bunnies turned into little sausages of dust and I popped it open and it's clear. I rolled it over some dust that was on Burber carpet and it completely cleaned it. Also tried it on a Persian rug and had 95% success. A few caveats: I wish it were made in the USA; The handle likes to get loose, but that might be good for storage purposes.",
        "Just put together the one that came today. Ran it around for a little while, and then ordered another from Amazon. I don't know why I didn't get one of these sooner. I guess I remember this as a kid and just didn't want it because it was old. Hauling out the vacuum, even a light weight, is no fun, and this does the trick. Now I have one for both up and downstairs. A reminder that old doesn't always mean useless.",
        "The sweeper itself seems reasonably well made but the brush fell apart in less than a week. All the bristles either broke off or fell out from the rotor brush. I had to order a new brush as it became useless. Fuller brush products are not as good as they used to be. I would not recommend this sweeper because of the poor quality of the brush.",
        "Yes, my cat scratch pad chad is swept up as fast as he makes it. Just once around the house on my low carpet and linoliem keeps my place neat until I pull out the vacum. The small brush rake that convieniently attaches to the pole works marvously. So well worth every penny.",
        "Fantastic sweeper works so much better than I dared hope. My vacuum is heavy and this is perfect for daily clean ups. I intend to send one as a gift to a family in the Air Force to take when transferred. It's so compact, but does a wonderful job of picking up things you don't even see.",
        "I had an old one of these back when and it was very easy to use for a quick cleanup on a hardwood floor. This one required that I bear down on the handle in order that the wheels roll (and not drag) and, thus turn the brush to work. Not acceptable.",
        "Basically if it doesn't work, their return policy is - there are no returns (unless unopened or unused & you're happy to pay to ship it back at your expense.) So if you don't think it's working, you're out your money. Also, if you have more than a dog... too bad... the fur will get stuck in the rotary brush underneath. I didn't even have to use it, to know it wasn't going to do a good job. It's also very tiny & won't get under a lot of things. I would give it zero stars, but that isn't an option. I can't believe this has a high rating????",
        "I use this sweeper to clean the indoor/outdoor carpets on my screened porch and basement floor. Sweeping head is smaller than expected but it works very well. Picks up debris, hair, etc. It has two compartments on the bottom near the brush that hold the dust and dirt picked up. Flip open the metal doors on the bottom to empty them out. Glides easily and seems well constructed. Very pleased with this purchase.",
        "This is exactly what I wanted when I ordered it. I have a central vac system but didn't want to drag that out for small jobs. This works great, nothing needs to be plugged in and it's easy to empty. If this is what you're looking for, this product does it and it's reasonably priced. Five stars!",
        "I am disabled and can't walk so I needed something light weight for my upstairs level. Works as expected and does what its suppose to do. Couldn't drag my 10 ton Kirby up from the main level. BTW, Never buy a Kirby.",
        "Pretty good while it lasted. Metal screw threading wore out within a few weeks of use. Totally unacceptable for a broom this expensive. Will update my review after contacting the warranty dept. Update: manufacturer sent me a replacement handle under warranty. This handle seems to be working OK for now, but I have a sinking feeling that it will come loose in a few weeks again!",
        "This is a beauty. It picks up a LOT, leaves the lines in the carpet, very very satisfied.",
        "This thing is awful. First of all the sweeper is tiny....it's heavy and hard to push and the pickup stinks....",
        "Small, very compact. Easy to use. Well made. Picks up dog hair off carpet. Does a good job, not sorry I purchased it.",
        "Quite a bit of work for mediocre results! It is not so much the size, although it is small, as the fact that one needs to go over and over the same area for the best results. It does pick up human and pet hair but is not as efficient as I hoped on small cat food kibble, and not at all on kitty litter. It was easy to assemble and the price was fair. It is certainly an incentive to get my vacuum cleaner repaired soon and use the sweeper for touch ups.",
        "I have low nap carpets. Purchased the item to do cat fur pickup every day or so between vacuuming. It is without a doubt the worst carpet sweeper I have ever used. For the first 2 or three passes, it picks up cat fur but after that it returns it to the carpet on every back pass. I specifically purchased it because Fuller has had a good reputation over the years but this item is useless! I have two cats so it is not as if there is much fur around.",
        "I've been using an electric broom on new hardwood floors, but it just doesn't have the power. This little manual gadget is amazing! I can see how people might think it's flimsy, but you just have to treat it with a bit of care and it'll do wonders for you! We're on a beach, so even little gravel bits the electric one couldn't pick up get swept up by this guy. And love the little brush cleaner that comes with it. I grew up surrounded by Fuller products, so it's wonderful to know they're still making things solid and useful. Definitely recommend.",
        "I'm using this on a concrete basement floor. It sweeps up the debris from firewood and cat litter. It's definitely faster and more fun than a broom, though it can't get to the edges the way a broom or vacuum does. I had a Bissell sweeper in the past. This is more well built, and the emptying mechanism in particular was annoying on the bissell where this Fuller has spring-loaded steel buckets that open with a flick. I'm very happy with it.",
        "I have always liked the concept of this type sweeper since seeing them used in restaurants years ago. I don’t like sweeping in the kitchen, dust in the air. This little guy is perfect for me. It’s just heavy enough to work very well on hardwood and on low pile carpet. Cleans out easily, just dump in the trash can. No dragging out the corded vacuum for a quick cleanup. Obviously, will still use my Oreck for deep cleaning. Its small enough to fit in my closet . Very pleased.",
        "This small sweeper is very effective in picking up all kinds of droppings on your carpet and I use it every day due to the fact we have two house dogs and this unit is very effective in picking up hair and grass clippings when they come in the house. Here is a tip to keep the sweeter most effective. Keep the brush effective by using the large teeth of a comb to clean the brissles at least every two times used.",
        "Love the compact size. The brushes move smoothly over carpets and wood floor. It does pick up a lot of dust and dirt but streams of collected dust spread out back across the carpet with the back and forth motion. I thought I was perhaps holding it backwards so turned it around but with the same results. I have to sweep across the collected dust bunny a few extra times to get it picked back up. Annoying but not terrible. It eventually picks up a lot of dirt and is easy to empty. I need to see if it is durable. Only time will tell.",
        "This is the next best thing to my deeper cleaning regular vacuum ... and this product is absolutely everything it says! It's light, maneuverable, manages to get just about everything by the return sweep. I really like the brushes in the corners to help grab the stuff that manages to get away! I carry a very small broom to brush out the places where I can't angle the Fuller, but those are very few, especially with those corner brushes. It's perfect for closets and small spaces, and does an excellent job on carpets. I'm simply in vacuum heaven with this !! Fuller's been around so long for a very good reason ... I highly recommend this!",
        "This throw back item,should be thrown out! It's an old torture invention from last century,where you try to pick the hairy filthy dusty dirt out ,but didn't know about the razor sharp rug cutters inside it! Surprise! The carpet sweeper is a failure at cleaning,but good at finger piercing!",
        "This is the fastest review of a product I have ever done. I got it today and put it together in about two minutes. I used it to pick up dirt on my living room and dining room rugs. I bought it so I didn't have to lug out the full size vacuum cleaner for small jobs. This sweeper worked great. I tried it on some steps and it did OK as it was a bit big for the carpeted stairs. This sweeper is a time saver. I gave it five stars for durablity even though I just got it. It is heavy for it's size and well made.",
        "This sweeper picks up objects from our berber carpet very nicely. But to be fair (to be faaaaaair), berber is as easy as it gets to clean. Obviously, it's no replacement for a vacuum, but it's nice to not have to get out the vacuum every time there's a piece of fuzz or some other crud on the carpet, or just live with the stuff on the carpet getting ground in. It's easy to empty, and stores away nicely. I like that it feels surprisingly solid, even the multi-piece handle is solid once it's screwed together. Also, replacement brushes are available, so it's not a throwaway item. Because of that, I could see using this thing for decades.",
        "This product is not very durable. I thought with the companies good reputation this would be a good product. The handle is very flimsy and bends with the slightest use of a back and forth movement. It’s pretty useless for me if the handle is prone to bending so much it will eventually break. It might be ok on bare floors but unfortunately my house is fully carpeted, so basically I have a useless floor tool. It was an expensive buy for something that I can’t use.",
        "Small, almost seems a toy size , will be a hit with 7 year old grand son. This is simple, sturdy and a great relief from vacuum cleaner. Picks up crumbs, hair and general surface-type \"crud\". Easy to empty. Amazed to see the amount of linty, fluff-like material that was trapped by the electrostatic act8ion. This means that airborne \"dust\" is reduced, not just spread around!",
        "Sometimes the vacuum is too big to haul out for quick clean ups. These are terrific on floors and low-nap carpets. (I haven't used them on a high nap carpet.) The Fuller picks up way more than I expected— pet hair, dust, small lint, and mini pebbles. There are two slight drawbacks: there's no tidy way to attached to the handle the little brush that comes with it and I frequently need to tighten the handle with each use. Overall This is work the money.",
        "- I was looking for a sweeper because my vacuum does not pick up all the lint and hair from the carpet. -I ordered this sweeper in particular because amazon recommended it and there were tons of positive reviews. - Fast delivery; I ordered this brush on March 30th 2018 and received it April 1st ( no i did not use Amazon Prime) - Easy assembly, simple instructions. - I immediately used it when i received it- it removed every piece of lint and hair from my carpet. - The comb/brush cleaner provided to clean the rotating bristles works fantastic!",
        "Works great! I had one of these in my store where it was very effective for picking up birdseed. I bought this one for my house where I have four cats. It picks up cat hair easily as well as scattered kitty litter. It's light weight and quiet so it's my go-to device when I don't want to have to take out the vacuum. (You know how cats feel about the dreaded vacuum!) The only quibble I have is that the handle, which screws together, sometimes starts to loosen. It can probably be glued together if you don't feel a need to ever take it apart.",
        "I have Arthritis in both knees & back. Therefore, it's difficult for me to use my upright vacuum cleaner. I have one area in the living room, in front of the couch that gets crumbs on the carpet. This Fuller Sweeper does an excellent job of picking up hairs & crumbs. It was not easy for me to pull the loose hairs from the roller brush but if I use it often enough, I'm sure it won't be so difficult in the near future. Also, Fuller is a well known product name and I trust it. I got the Sweeper in Pink. It's pretty as well as functional. Can't ask more than that!",
        "Barely picks up dirt, picks up a tiny fluff ball of hair. Have to ram it back and forth to get it to pick up. Mostly just drags the hair around the floor stuck to its tiny brushes. Looks great as a prop if you don't plan to actually use it. Can't recommend which is too bad because the construction is good, just does not pick up dog hair and that's why I bought two. Ug!",
        "I wanted something for a quick cleanup of hardwood floors without having to drag out the big vacuum. This is somewhat helpful, but it takes more effort than I had hoped for. It is awkward to maneuver especially to get close to walls. It did a fair job of picking up dust, but had a hard time retaining small pieces of debris. It is lightweight and compact. I'll use it sometimes.",
        "Works as advertised. We use this to keep things neat in between vacuuming and this little sweeper does a nice job picking up lint, leaves, particles, crumbs, kernels etc. We use it on low pile carpet and hardwood floors and it works well. Works better than a Bissel we own. Unit is small, construction especially handle seems flimsy but seems to do the job as this is for light clean up. Comes in a surprisingly small box only assembly is handle which comes in 3 pieces. Given that his is one of the more expensive sweepers of its type on Amazon I thought it would have been a more sturdily built machine.",
        "This was a gift to my grandson's school teacher. Great item. Sorely needed by the teacher. Excellent service.",
        "This works well enough since it eliminates most of the dustpan use I was doing. Sweeping up hair and small bits of whatevers from the floor from multiple pets is much easier with this. It doesn't get corners so I need to sweep stuff away and often have to make multiple passes. I don't expect it to work as well as a vacuum, but then it's easier to use so \"good enough\" cleaning, it's a keeper.",
        "would it have killed 'em to have made a sturdier handle? The brush part works fine for what it is intended for and I like that it comes with a bush cleaning tool since what I intend it for is to gather the flotsam and jettison of thread and string on my craft room floor. BUT the poles have to constantly be rescrewed together and even then are wobbly. I don't think it is worth the extra money spent over the least expensive model. I tried to switch out the pole for an old broom handle but the thread was wrong. This is not my grandmother's Fullerton Brush product.",
        "I purchased two of these and I love them both. They save me time in between vacuums around my home. I can use this every week and only use my heavy cumbersome vacuum cleaner once a month. Yay! Progress.",
        "It's a bit smaller than I was expecting but it does seem to be pretty good for doing light cleaning on our carpeting. It does pick up hair but getting the hair off the rollers isn't easy to do (it took a knife to cut it off the rollers; there is a 'cleaning tool' for this but it wasn't useful for hair we have on our carpets). It doesn't do deep cleaning but then it doesn't claim to do that. It's good for those days when I just don't want to drag out the bit clunky vacuum.",
        "O yes. This makes me sweep away at our floors. We have a kitten that sheds and that bits little cardboard bits out of every box in the house, and this sweeper picks it all up: pet hair, crumbs, paper bits. You must go over the debris at least 5 or 6 times to pick up the stuff, but hey - it's a sweeper, not a vacuum. Light and sturdy. Sweep away, my friends! It's quiet and does not scare the kitten. Can I buy another one?",
        "Very disappointed in the products. One, it would not pick anything up even on the low pile Berber carpet. Also the top part of the handle would never screw on completely and so it was absolutely useless",
        "This is an awesome product for those times when you just need to do a quick sweep and don't want to drag out the vaccum. I bought it for the office and I was amazed at what a great job it did on all kinds of items, dirt, paper, food, hair, and even paperclips. It comes with a little comb to pull out the hair it collects from the rollers and I suggest you use gloves because it collects a lot of hair, especially in an office full of women. Great product!",
        "It's just me and a cat. This thing works very well for light cleanups. Now I don't have to lug my sweeper down from upstairs every time I want to get the cat hair etc up from the rug, glad I bought it. Update. I have been using this now for a few weeks, where has this thing been all my life. Picks up cat hair on carpet and hardwood floors, it's a great little gadget.",
        "It’s ok!! But dog hair gets stuck on the outside brushes. Plus it’s tiny. I mean TINY!! A lot smaller than expected. If I’d have know it was this small, I wouldn’t have spent so much on it. Would I buy it again or recommend it.... No! No I would not. Upside, my 8 year olds kids like to take it for a spin around the house and although they miss the occasional bit of floor mess, they don’t do a bad job and it saves me doing it 😂",
        "This product was hard for me to use it did not run smoothly over the carpet. I had to push really hard to get it to roll. the handle is too short and I’m only 5’4”and it was hurting my back just run over carpet. It did not pick up items I had to run it over several times just so we can pick up little stuff. Very disappointed I’m going to buy a different brand",
        "My husband and I both have extremely long hair. I will say that after I used it for a short time I was disappointed because it seemed to have stopped working and my effort at cleaning it were difficult. In a moment of frustration I thought I broke it but miracle of miracles the brush disconnected and I was able to easily cut the collected hair off and easily replace the roller right back in. It picks up a lot of things very happy now. I recommend lightly going over your carpet with a broom to gather long hair off the carpet before you use the item. Less stress that way. I am grateful",
        "While my house is on the market, this is so much easier to use for spot cleaning vinyl floors and rugs than dragging out my Electrolux vacuum cleaner. However, I'm 5'3\" tall, and the handle is perfect for my height. Are there extension sections for the handle to make it easier for taller people to use? I didn't see anything in the material that was shipped with this product that allows you to order more handle section extenxions .",
        "This wouldn’t be so bad if the handle actually stayed together! It’s made like a piece of junk! I do not recommend this product.",
        "I'm a bit disappointed. Admittedly, I should have checked the size before ordering but as an \"elder\" who remembers carpet sweepers from the past, I was amazed at the size, or lack thereof. Let's put that aside, though, because it's adequate. My real disappointment is that it doesn't do a good job of picking up pet hair, even after sweeping over it several times. If you're looking, like I was, to avoid having to pick up what is left on the floor, you may want to reevaluate that as requirement. The price was good but I'll be searching for a better solution.",
        "I use this for in between cleaning for crumbs nails (finger) and any thing else , or a quick swipe and a promise. This sweeper works very good on throw rugs too. Picks up very good and pushes smooth and easy. Fuller Brush is a great CO.",
        "I work in a call center envirnonment so I purchased as a quiet option in between the nightly office cleaners. Literally everyone is asking to borrow now on almost a daily basis from all different departments. I just have them sweep my office as \"payment\" to use it. Works well and comes with a little black fork/comb to help unstick something to sweep it up. All of the cute color options is definitely a bonus!",
        "One of the best carpet sweepers. It really hugs the carpet and picks up very well; even when using on thin carpets It doesn't just pick up litter, It draws dirt out of the carpets, too. It also does a fine job of cleaning floors, . It's sturdy. The red color is pretty.",
        "Replacing an old Hokey we use to have- wish I would have bought the Hokey, even though it was a little more. The Hokey is 12 1/2 inches wide vs the 9 inches of the Fuller. Didn't think it would make much difference but it does- many more back and forth motions to cover any area. The multiple piece screw together handle is less than the best design also. Have screwed it as tightly as possible but the handle is still \"wobbly\". The good news is it does pick up well on floors and carpet. The design and poor craftsmanship though tells me I see a Hokey in my future!!",
        "When I placed the order, it said next day delivery guaranteed, and so, I told the recipient to expect the delivery. When I received the shipping notice, the delivery date was delayed by one additional day. It was going as a gift to my grandson so it was unfortunate that I had counted on next day delivery. The product is fine. Picks up small debris and animal hair efficiently. No suction available so no rating for that or deep cleaning. This is a surface cleaning product. I would buy again.",
        "I bought this for my sewing room; yes I have carpet in there. My expensive vacuum couldn't handle all the threads that accumulate in the carpet but this little sweeper does an excellent job. Highly recommend for quilters, and anyone who sews!!! Love this little sweeper!",
        "Im actually really happy with this product! I have 2 dogs and a backyard door that leads right into the kitchen so there's always dust, hair, dirt and grass particles on my wood floors. I have to vacuum 2/3 times a week. This product is perfect, it works great picking up almost everything. Some larger leaf items etc get left behind but it saves me from having to lug the huge vacuum everywhere all the time. It is small but that dosent change it's effectiveness. My floors look great, i actually can't believe it. Mine works fine when I go forwards and backwards... i saw some reviews that said otherwise.",
        "That's what mom said when she opened the box. When she ordered it she did not realize that it did not require power, other than good old human strength (and very little at that). Despite her initial misgivings about the possible effectiveness of the machine, once we started testing it we were both pleasantly surprised at how well it worked. We used it on both a hardwood floor (kitchen) and an average thickness rug (family room). In both cases it worked better than expected. Come the loss of all electricity in America (probably in 2021), we will at least have cleaner floors than the neighbors.",
        "Does a very good job of cleaning. Brushes are sturdy and well made and the cleaning compartments are very easy to empty. Those features are very good. BUT...the handle is a two piece, small diameter tube which is very flimsy and tends to bend. Very cheap for $60. They could and should have made it at least an inch wide for $60. Would not buy it again.",
        "The size is mall...which is good for ease of getting into tight spots. The handle does not screw on tight so it keeps coming loose and twisting as you try to maneuver the sweeper. Lastly, it picks up cat hair, but the back and forth leaves too much. Even if I turn it over and repeatedly use the de-hair tool on the brushes it still leaves too much hair. Does pick up dirt, sand brought in, but I find it is much more effective using a broom!",
        "I didn’t think this would work. I put this tiny push broom up against seven (yes, 7) cats and it works! This picks up pet hair, cardboard scratcher remnants and litter as well as the other messes my cats leave behind. I use this in between vacuuming with my big machine and I couldn’t be more pleased. Picks up better than any cordless vacuum I’ve owned. Don’t hesitate to buy this one!",
        "This little sweeper is a major blessing. I just moved to an apt with all wood floors - yikes! Such heavy maintenance. Additionally, I put out a throw carpet on my balcony so I could feed the birds and amuse my cat. All went well til the lady 2 floors below told me she was finding birdseed in her morning coffee. Ugh! This sweeper is amazing at whisking it right up - so easy!",
        "I rarely write reviews,but I LOVE this.Really debated for awhile but after reading other reviews decided to spend the extra money knowing I could return it if I thought it wasn't worth the price.Put it together in just a couple of minutes and started using it. I have a cat that sheds a lot, it got her hair up on all the different piles of rugs I have. Worked well on tile also ,just use short vacuuming strokes instead of long ones. Empties easily and there is a tool provided to clean brush. Also love the vacuuming lines it leaves on my rugs,makes me feel it really did it's job!",
        "Bought it to quickly pick up cat hair from 3 white cats. Gets it up without having to drag out heavy vacuum. Wish it was wider so it picks up more area faster but I can live with. Doesnt replace a vacuum but a good quick pick-up on both wood and carpet. Also picks up yarn pieces (I'm a knitter). Let's you pretend your house is clean. Was willing to try it for sentimental reasons. As a kid, the Fuller Brush man brought great, quality products to your house and was so nice. The good, old days! It works for me, I'll keep it.",
        "When I first got this I thought it was the best sweeper for quick pick ups. I was buying an old been around forever name, so they have to know what they are doing, right? No, with in a week the handle snapped off at the sweeper head. It is made of steel so I thought it would have lasted. It however did a great job at picking up on all my different floor types. I was so disappointed when it broke, I really liked it, until it broke.",
        "For a small sweeper this does a good job. I keep it in my sewing studio and it's great for picking up stray threads, dust bunnies, and lint on carpets. I knew the Fuller Brush Co had a good reputation, and it comes through in this little sweeper. Easy to empty and easy to unravel things - like thread- on the brushes.",
        "This is a handy and easy to use floor cleaner. Used it on my Pergo floor as well as carpet. Some areas took some extra back and forth but not bad and it did pick everything up. I did have trouble putting handle together. The part that screws on to the sweeper still isn't entirely screwed in. Will need a \"man with muscle\" to get that done, but am sure I am not the strongest gal in town at age 70+.",
        "This works really good. I bought it for in between vacuuming. I think it does a better job than my vacumn though, really picks up everything quite well, including dog hair! It is a little smaller than the average ones you see in the store, but that's OK with me, cause it works great, and can get into smaller spaces!",
        "This Fuller Brush sweeper works quite well at picking up debris off of floors. I have 2 complaints, though. One is the handle is thin and a little wobbly. I keep telling myself to get out the duct tape, but I haven't and it still works just fine without it. My 2nd complaint is that it\"s hard to empty. It came with a cleaning tool so that helps some.",
        "Great tool for relatively quick sweep up of wood floors in whole house. Long hairs will wind around brush, but if you pull them off every time it should not become a problem. If like us you need perfect cleaning for asthma/allergies, you’ll still want to damp mop/Bona, but happily surprised at how much invisible-on-the-floor dust it picks up in addition to visible bits.",
        "OMG! Fuller Floor Sweeper: Love it. Have 4 cats in cottage under 700'. You cannot even imagine how much hair, spilled chow & tracked litter hits the floor each day. Tried another, cheaper, brand of floor sweeper & it did nothing. Replaced with the Fuller & it gets everything! Was skeptical about small size, but that turned out to be irrelevant, except that it fits into smaller, lower spaces. It's solid, picks up everything, & lightweight is a good thing for little old lady. Going back to get the 'carpet sweeper.' Will be so much easier on my back than pulling out the big vacuum. Hip, Hip, Hooray!",
        "This product would be great for a carpet that's already clean. Don't waste your money. The scraper tool for cleaning the brush was too wide to fit over the brush like they show in the video. And it doesn't remove for cleaning. I had to use scissors to cut the hair on the brush and then pull it off. Filthy mess. I just tossed this ripoff product into the dumpster since it's too late to get a refund.",
        "This sweeper was really small, I mean, it fit in my mailbox! Small, but MIGHTY. I got this so that I could sweep up my craft room which has needles, stained glass pieces, thread, pins and assorted flutsom and jetson. I didn't want to risk ruining a vacuum and this little baby does the trick! I love it and throughly recommend it. So easy to put together and use. A definite must buy.",
        "Having an autistic child I needed to find a quiet carpet sweeper for his bedroom and bathroom. This works well, but, it's limited. Not for large areas at all it is more for small rugs and/or picking up bits of paper, etc. It is not hard to assemble, but the pole is in two pieces that does not completely meet. It doesn't fall apart, but it's only for quick pick ups as I m mentioned. Mint green is pretty.",
        "I have nothing bad to say about the carpet sweeper. It lives up to promises in every way. The brush is in the center of the sweeper so you'll need a duster to clean the floors close to your walls. We really like that is will easily pick up dirt on hardwood floor and does a great job on rugs and wall to wall carpet. HIGHLY RECOMMENDED!",
        "First, I was shocked at how small the sweeper head was. Then, after testing it on our fairly new carpeting, it was obvious that while it might work on a small, little-used rug, this sweeper was doing nothing more than picking up some of the carpet dust going one direction, and depositing the dust back onto the carpet when pulling the sweeper back! Returned the sweeper.",
        "This is a perfect solution for a quick cleanup and tidying up the house without hauling out your vacuum. This does a fairly decent job of cleaning g up dog hair and little pieces of whatever that may have fallen on your floor or carpet. It does great on hardwood, tile, and carpet. For a quick and easy pick up this is the tool to use.",
        "Kinda expensive really, and when I got the package I was surprised at how small it was. It looks like a toy at first but it has a solid build and is engineered well. Very sturdy and works GREAT. I LOVE IT I use it for everyday cleanup on my area rugs and hard surface floors. I love that I no longer have to drag the vacumn out for minor cleaning. It also picks up hair, dust and crumbs really well.",
        "I purchased this sweeper because one of my grandchildren is extremely sensitive to loud noises and the sound of the electric vacuum sweeper seemed to really hurt her ears. This made it difficult to clean up the carpets when she was visiting. Although this sweeper does not pick up dirt and hair quite as thoroughly as an electric one, it still does a good job and is much less noisy! It is easy to empty and since it is much lighter, it is easy to do grab it and do quick, spot cleanups of cat hair, etc.",
        "We are so happy to have found this product. We had purchased an (8 X 10) area rug for our living room as an accent piece to lay over our wall to wall carpet in order to define the seating space around and in front of the TV. It has some darker colors in it, so lint is a constant problem. Hauling out the big vacuum is a pain, so when I noticed this carpet sweeper, it sounded like the perfect solution. Well, it IS! It is so lightweight and easy to store; yet it picks up crumbs and lint in just a few strokes that require no effort at all. It is a godsend.",
        "Purchased this sweeper for an area rug in the living room and playroom. It works great on our low pile area rugs and goes flat to get under the couch as well. Picks up all the crumbs and pieces of paper. I feel it's totally worth the money and very useful. It doesn't pick up on floors as well but it does work on them. It seems to hold quite a bit.",
        "We bought this to use to pick up cat litter than gets tracked on to our low pile carpet and hardwood floors, so that we could clean it daily without using a loud vaccuum that would scare our cat. This thing works great. It not only picks up tiny pieces of litter from carpet and hardwood, it grabs cat hair, dirt, dust, and pretty much anything else on the ground. It works passably on a more shag-like rug we have but is clearly made for flatter/harder surfaces. The red is a really nice color too.",
        "I wanted something to pick up small messes that occur in ordinary daily living without having to haul out the vacuum and cord, etc. Something to be used between regular vacuuming. I looked at reviews of the trending \"stick vacs\" but the best rated were the corded versions which defeated my purpose. The battery operated rechargeable models were not highly rated and, for many, replacement batteries were expensive. This unit is quick and easy and exactly what I wanted. I am very pleased with it. It will not replace regular vacuuming.",
        "Purchased for my store which has commercial carpets. It is on the small side, but it is sturdy and quiet; I can easily use while customers are in the store without any notice. It worked very well. for quite a while, but naturally, the brush started to wear down and also filled up with hair so it hasn't been working as well lately. Bought the replacement brush which should arrive any day - I hope it works just as well!",
        "This sweeper at first seemed disappointingly small and I almost sent it back, but decided to give it a try first. It may be small, but it is totally awesome! I have a few antique rugs that are hard to vacuum. This sweeper cleans it in a fraction of what it took to vacuum. Works great on my rugs and my hardwood floors. Absolutely LOVE it.",
        "just got it today & it's perfect! very small, only 6\" length & 9\" width, so it stores anywhere. bought it for my hall & kitchen which consists of irregular texture tiles & low pile runners. cleaned close to baseboard. then tried it on medium pile rug, again worked!. should be noted however that I do not have long haired pets. addl info: the handle comes in several screwed in sections that at first unscrewed a bit when in use. it's easy to correct, when the handle is fully assembled, just step on the sweeper to keep in place & turn the entire handle to tighten. perfect for in between vacuuming.",
        "I purchased this because I tried it at my aunts house and loved it. The one she had was my grandmothers and was probably fourth years old. Well as they say \"they just don't make things like they used to\". Although it is not bad it really does not clean up like he older model does. It is good for a very quick clean up but just not the same as the older fuller model.",
        "This sweeper is wonderful! The first time I used it, it picked up fuzz and dog hair off my carpet and even picked up kitty litter! The only negative is putting the handle together. I had to use some sewing machine oil to live the threads first and then a delicate touch to get it aligned followed by a tiny bit of muscle to crank the parts together. Otherwise, I am quite happy and it stores flat in the broom closet! And it will save me alot on vacuum cleaner bags since it can be used in between vacuuming!",
        "OMG, I love this carpet sweeper so much I can hardly stand it! We have a standard rough coat collie and a cat, and between them we are constantly inundated with fur. Our vacuum cleaner is fine, but it doesn’t get underneath the furniture where the furballs take up residence. But this sweeper works beautifully under furniture ! I also love the fact that it is quiet and doesn’t require any electricity, so it doesn’t contribute to noise pollution or climate change. Works under furniture? Check! Picks up pets’s fur? Check, check!! Energy efficient? Check! QUIET? Check! It checks all the boxes for us = Woo-hoo! Highly recommended!!!",
        "This carpet sweeper is fabulous! Easy to use on carpeting, hardwood floors, and area rugs alike - it makes a daily whisking of the whole house a breeze! It not only keeps carpet 'walking paths' easily touched up, but also helps avoid the carpet nap from being tamped down as well. Fits easily under furniture and in-between chair legs as well! I absolutely love it - it is so easy to use, I purchased one as a gift for an elderly relative who also found it easy to use and sings its praises! This is a must-have, small enough to tuck out of sight but close at hand for any 'dry' spill or tracking!",
        "This product is very good on low pile carpet. It is fair on tile doesn't pick up as well as the carpet. I don't particular care that the handle comes in pieces that have to be screwed together. On one section of the handle the part where you screw it to the next piece of the handle striped. I am only 5'2\" and the handle is for me a little to short. I would prefer the handle to be longer and also thicker and in one piece.",
        "I really like this for under my dresser my vacuum doesn't get under there and it gets all the dust in hair that collects under my dresser I have very low pile carpeting it's perfect for that and if I'm in a hurry I can just take it and zip over the carpet and then I only have to vacuum once a week I highly highly recommend in to clean it's easy there are buttons on the bottom you push it it opens you empty it",
        "I read some reviews saying it stopped picking up after a few months, bit I haven't had any issues with it. Stores very flat in my utility closet on the wall. I use it for quick cleanups on the tile floor and empty it after each use. The tool for the brush is helpful too. Very happy with it!",
        "I bought this to accomplish quick cleanup of an area that has 10 parrots housed in it. So I don't know how it does picking up \"hair\", deep cleaning, and of suction. But it is good to pick up dry bird kibble and feathers. Only criticism is its really SMALL. But it's easy to grab and use...just wish it was larger.",
        "I like the ease-of-use. Depending on amount of hair on floor, cleaning may be more difficult at times. Disposal tray empties easy. Mop will still be needed on hardwood floors. The degree to which this makes ones life easier depends on 1) if you have a dog, 2) length of dog’s hair, and mostly the 3)frequency of use.",
        "I have toddlers so this makes picking up easy! I only use it for the family room which we use daily, and of course having toddlers, you got goldfish, Cheerios, and whatever else toddlers eat, and of course crumbs! So in the evening when they go to bed, I take this out and just start cleaning up. Less than 2 min my space (which is pretty big) is cleaned up! I def recommend this to those who have tiny people! I haven’t tried it on tile, but that has never been my goal, but eventually I will.",
        "Not sure what is up but when you push it in one direction it is quiet but when you turn it around and push it in the other direction it makes noise. This only occurs on a carpet. On the hardwood floors that does not happen. Not a big deal except it then only fills up one side of the container.",
        "I have owned a couple different types of these sweepers for my business. The others are mostly junk. This one works really good considering it is just a push type sweeper. Good weight, sweeps well, and appears to be a quality product.",
        "While it was easy to assemble, this is not easy to maneuver. It doesn’t swivel and when you try to, the bar unscrews out of the other below. It doesn’t pick up dirt and dust like I thought it would even when I go over the same spot again. And this is on laminate flooring as well as carpet. Overall it’s one of my least favorite items ever purchased from Amazon.",
        "This handy tool was purchased for quick cleanups that don't require a vacuum. It works beautifully, doesn't require electricity, and is easy to clean out! I was surprised to find it still available and even more surprised when my young granddaughter announced that it is too much fun!",
        "I’m shocked. I thought was getting this for My 3year old, Montessori at home. I’ve ended up being the one that uses it all day. It’s nearly replaced our vacuum. Great for fragile orientalists rugs, hardwood floor, carpeted stairs. I’m in love. Costly, but beautiful if left out!"
    ]
}