{
    "entity": "Boring Drill Bits",
    "text": [
        "Use can be extracted from these if you have the equipment and time required to get them to a correct shape. As received, they are basically useless for anything harder than a stick of butter. After working on a couple with diamond for a while, I was able to get passable performance with aluminum and steel.",
        "Carbide is good quality, no chipping (mild steel), needed some of the clearance angles reground",
        "Received the boring tool set & satisfied with the look of the tools & grinding of the carbide surfaces- I'm sure they can be used as received -with out touch up grinding - Good value for price of the set- Thanks- Dave Richardson",
        "I knew something was wrong when I picked up the box on delivery. I could hear tools rattling around and when I opened the box several of the tools had chipped cutting edges from bumping into each other. They are carbide tipped and carbide is very brittle. I can not recommend this product.",
        "I purchased this set because I needed to finish bore a hole in aluminum in my garage hobby shop. I only used the single largest and longest boring bar and it worked reasonably well. Deflection seemed to not be a problem and the quality of my machined surface was great. Good value for the hobby machinist working with softer metals.",
        "Decent for the money for sure served the purpose of boring out sprocket ids and easily re ground",
        "Just cheap entry level bore bars that will most home machinist doing hobby type stuff can get by with, without spending a hell of a lot more for anything better.",
        "Not extreme industrial but good for the home shop if used sensibly.",
        "i have only used one of these so far but it worked good and did what it was supposed to do. if i need more of these i will order from this company again. they were oiled good and no bad places on them.",
        "They all are as expected, sharp enough to use out of the box. Very nice set,",
        "They do work but to really be usable you need to relieve them. Cut decent so far",
        "Only tried one of the 9, but it worked well and the others look good.",
        "These are obviously Chinese made/finished, but they work fine. Carbide hasn't chipped yet so I think definitely a good buy for general use..",
        "Seemed to be well built, did the job I bought them for.",
        "Great bits especially for the money. The shafts are quite rigid and have seen no chatter even on the longest (3\") bit on steel. Very happy with purchase. Carbide is brazed cleanly and quite large for long life. Will buy again when needed.",
        "Many of these have a bad grind on the carbide, and you'll need to fix that before they will cut properly. You get what you pay for here.",
        "this set is a good product for the price. i would recommend this set to a friend and delivery time was good",
        "I've not had occasion to use these yet====but they appear to be very good quality and are very sharp I am not an expert lathe user so I might have preferred a square shank which would 'locate' them at the correct cutting angle. These are obviously designed to use in a different kind of holder than I am familiar with",
        "Nice tools for the price, had to make a holder though.",
        "I was disappointed when I went to use these because I had to regrind them to get proper clearance and a clean cutting edge. They are sturdy and very useable, once the cutting edge was sharpened and proper clearance angles were ground.",
        "the product was like it was described. im pleased with this item. that's all im going to say about this item.",
        "they are ok for the price. don't try to force them or they just bend they would be ok on a mini lathe or mill."
    ]
}