{
    "entity": "Boring Drill Bits",
    "text": [
        "35 years as a machinist I had probable doubts. It is cheap but it worked well repairing a bad bore on an old cast steel rototiller head. It had a little chatter at first with .020 cuts but worked them out with shadow passes. The carbide tool itself has little wear as well. So for me, I'm happy as crap. It was done on a cheap mill too. Had to hand feed it. Good old enco mill. Very satisfied. But I can't yet claim joy yet with the accuracy because I haven't done anything that had to be accurate.",
        "Came with case, wrenches, and wrapped in dragon lard... as expected I guess. As others have said, no flats on the actual boring bars is annoying buy fixable. There is a HUGE amount of backlash in the adjustment screw, so I have to work in small increments. I am hobby machinist, but this set seems to work well for me when I take my time. I have only worked small holes, and in aluminum. 4 stars might be generous... it gets that only because of the value, not because it's high end piece of tooling.",
        "HELLO. WORKS GREAT . I BOUGHT 3 . I'M LAZY . SET THEM UP FOR ROUGH , MED FINISH , & FINISH BORE . JUST SWAP THEM OUT & YOU DON'T HAVE TO TRY TO ADJUST TO GET YOUR FINISH DIMESION TO REPEAT BUT OF COURSE WATCH FOR TOOL WEAR ON FINAL FINISH CUT . I APPRECIATE YOUR TIME. THANK YOU GOD BLESS HAVE A BLESSED DAY",
        "So far I have only used this once. I needed to bore a 3.080\" dia X 1\" deep hole in Aluminum using a small BF-20 mill. It did the job and I got the size I needed. Based on previous reviews, I milled flats on all of the boring bars to prevent them from binding in the head after tightening the set screws. It looks like the smallest hole you will be able to bore with the supplies bars is around .313\" (although I haven't tried one that small yet).",
        "Impressed with the quality of this for the price. Yes the screws are soft but you also don't need to be reefing down on them. Carrying case is nice and I had no issues with the carbine cutters in aluminum. Handled interrupted cuts with no issue. I didn't trust the scales for measurement so just crept up on the dimensions slowly by taking successive cuts.",
        "I bought this a couple months back and used it for the first time the other day. Needed something in between 1/2\" and 9/16\" and this fit the bill. Everything went well. The one thing I would have liked it to have is flats. Not only to reduce the marring by the set screws, but also so that the angle of the carbide will automatically be set by the flats.",
        "Disassemble this and clean VERY well before using, debur if you need to with a soft rubber stone. NOTE the slot for the alignment pin on the R8 to 7/8-20 holder is NOT long enough and will destroy your alignment pin if you are not careful. With some crafty vice holding you can modify to meet your needs. Also not that the (0.001\") incrimination is radial and not diametric in adjusting. Overall works as it should, boring bars are NOT set with neutral rack; if you can modify or get ones that have it for better cutting.",
        "Not a bad tool. Its made in China and not without faults. I have had two problems with this item. 1) The set screws are soft requiring replacement to maintain proper function. 2) The boring bars have no flats on their shank. When the set screws are tightened they mar the boring bar. This causes the bar to be difficult to remove and wears the boring head. Both problems are easily fixed. Would I recommend this item to a friend? Sure. If I had a catastrophically failure would I purchase the same item again? Yes, it has served me well for quite some time. Would I use it in a production environment? No...",
        "The Shank doesn't fit quite right in the mill, so there is slop and the tool chatters. It is basically useless on all metals. Works OK for plastic.",
        "Boring bars were a little dull, touched them up with a diamond hone. Bored out 2 hydraulic cylinder eyes to within .001 of what I was shooting for. Very pleased for the price.",
        "Not bad for the money. Only problem I had was the R8 collet indexing slot was not long enough for a Bridgeport. Had to use a key way bit and extend the key way by another .5” so it will snug up all of the way. If your going to make something for a knee mill, make sure it fits the industry standard.",
        "This product totally met my expectation - I had to clean a bore in an automotive wheel hub and it did its job just fine - the adjustment screw is chintzy - if you want accurate results, definitely use a dial indicator.",
        "Ditto on the lack of flats on the bars, having to pull bars out with channel locks after set screws chew them up. Also a lot of play in the adjuster. All in all, not bad for the money. Would buy again",
        "The R8 pin channel is narrow and it won't fit in the mill.",
        "Bought as gift for budding engineer grandson. He says they work great.",
        "Had to bore a few holes for backhoe pins. These were priced right, and seemed to work just fine. The price was certainly less than a large drill and a reamer.",
        "Using this to bore out worn holes in steel. Sharpened the carbide cutter myself. Works fine.",
        "I have found no problems with this other than it is to small. Get a 3 inch. It is better to have and not need than need and not have.",
        "Does what I expect it to do. Good finish as any. I certainly have no problems with it- other than the settings are too hard to use.",
        "Very nice set, couldn't do better purchase for the price",
        "Accuracy is certainly sub par. Once all hardware is tightened it is useable...sort of, but adjustments are tragic. The adjustment screw is junk, has 20 thousands play.",
        "Took a few tries to sharpen the boring bars to my liking but works as it should after deburring it",
        "A very nice boring head for the price. Adjusting dial is a little sloppy but usable for home shop use. Certainly not a production tool.",
        "Great price point. Could have spent a lot more without a whole lot more quality. Perfect for the home shop",
        "Nice packaging, good delivery. The tools that came with the unit to adjust it were substandard but I have other (metric) Allen wrenches. Good boring head for the money.",
        "I have used this tool to bore cylinders for steam engines and wheels for axles and making fixture plates and it performs very well. Completely satisfied.",
        "Well, as expected, the cutters will need to be reshaped but overall it's decent.",
        "Ok for occasional hobby boring tasks, but quality is mediocre.",
        "nice unit for my home shop. Very happy with it",
        "very good tool for the money and it came in a case that was not in the ad.",
        "works OK but needs more fit and finish. made in china but was cheep.",
        "Beautiful craftsmanship considering its an import product. Great for hobbyist",
        "The screws to tight the boring bars did not work",
        "Very useful tool and very reasonable price. Quality and finish are good.",
        "arrived fine, it seems to be ok, haven't used it yet.",
        "Have not used it yet but looks good and is well built.",
        "Maybe I don't know what to expect, so it's fair to say it is ok for what it is. But I'd like to see a better, more precise, more precision, adjusting screw and ways. That probably would cost more though.",
        "First experience was very satisfying in that after watching the youtubes I was able to setup and operate the boring set with no difficulty. Have not had the issues with the set screws, but have only used on Aluminum. As with all machining, you need the best material holding methods, reasonable feed rates, and proper speeds to ensure safety and accuracy.",
        "Just what I need, if anything to say bad about it...it is Made In China."
    ]
}