{
    "entity": "Electric Space Heaters",
    "text": [
        "I bought this for a large (400 sf) room. Based on reviews that said it worked well in large rooms I ordered it. The fact that it was so small made me nervous, bc I had guests about to stay in the previously unheated room, but this little Lasko heater proved itself! It's super easy to figure out and works quietly. I'm now using it in my 2 car garage to warm up the space for my dogs at night. It's keeping the insulated garage at exactly the 60 degrees I have it set to, even though it's 10 degrees outside. I love it!",
        "Living in Michigan my whole life, including some dives, I've owned a fair number of space heaters over the years. This is easily one of the best ones I've ever had. I bought this one to spread some heat around in my chilly basement, and it works great. I really like the oscillating and timed shut off features. It's pretty quiet as well (at least in a largish basement). Will be getting a second one.",
        "Decided to buy a lasko after our old portable heater died on us and was very excited to receive this. Upon opening, I quickly realized this was a used machine. Considering I bought this thinking it would be new with no prior knowledge it would be used as it doesn't mention it would be a used item anywhere on the description, I am thoroughly disappointed.",
        "The heater works well but the thermometer doesn't seem to work like it's supposed to. I have it in our bedroom and its set to turn off at 70 degrees but it doesn't turn off until it gets around 74 degrees. Our room get so hot and then it doesn't turn back on until the room is around 65 degrees.",
        "Heater worked fine for the first week or so after opening it up. Then the remote and manual controls stop working correctly. temp control jumps from 69 degrees to 79 degrees, then to 84 degree, then the oscillating function stops. You must turn off the fan manually and start over. Then it seems to choose its own temperature and the oscillating function works when it wants to and shuts off. Really disappointed in this product. Plan to return it, but I disposed of the box. How do I return it without the box. Never again.",
        "Had this for a few weeks.. worked fine no complaints really until I’m awakened this morning at 4am by my fire alarm going off. I’m not sure HOW or WHY this happened as heater was plugged in but not turned on.",
        "Was worried since several reviews mention melting the outlet or overheating. Have used this in our bathroom that has tile floors and has an exterior wall and it has made THE difference. Within minutes, the room warms up and it's easy to use and somewhat energy efficient. My wife and I have used it to take our bathroom from around 55-58 degrees in the mornings to 68-70 in a matter of 5-10 minutes. Very pleased so far.",
        "It heats small rooms quickly, big rooms take a while. It’s great for the price, I think. We bought two. I like that it tells you the temp of the room as soon as you turn it on. The oscelate and heat setting are nice. It has two different heat settings, low heat and high heat. It has short circuited our outlets if we have one on with another high power item like the oven, a blow dryer, or the tv but that’s to be expected. We haven’t had any issues with maybe outlets over heating and we live in an old house.",
        "Heater works very well, quite pleased. Having a remote control is great. The only downside is that you cannot see the readout from across the room (or anywhere unless you are right next to the heater) because the readout is on the top of the unit. We have another heater in the bedroom that has the readout on the FRONT of the unit, which is much better. That said -- it works well and we are happy with it.",
        "This is so superior to the quartz-type heaters I have had before. This actually blows warm air around, it doesn't just heat nearby objects. I was given one at work some years ago, and it still works -- so I bought my own for the basement. I like the temp control, the oscillation, and the timer options. Very good!",
        "so i've owned the 5160 model for two years. the heater works and warms up our bedroom which is a medium sized room. i wish it was a little quieter and there was an option to turn off the noise when pressing ANY of the buttons. i give this heater a solid 3.5, but rounded up to 4 since amazon doesn't do half stars.",
        "I use my heater in the bedroom... you cannot see the temperature or other features unless you stand up. The temp setting is confusing it’s cool and I have it set at 62 I want to change it to 65 and it’s flashing 75! I do not like this heater. The worse one I have ever purchased. Not recommended",
        "Good heater, purchased 2 one for my sons room another for my mother, doesn't quite heat up the entire room but if sitting in front of it will satisfy. Not good for a large area only good for compact",
        "Have been searching for a few weeks to find a good heater but the only way to know is to try them. We had a tower Lasko that was >10 yrs old and it's not heating as well. Have bought and returned other brands and decided to return to Lasko. When this arrived, I was a little disappointed as it is 6 inches shorter than the one I have now. However, I was shocked at how much heat this put out. I have a large bathroom that is cold in the winter and this really did the job. Very happy! Might have to get one for another room in the house.",
        "Item was dead on arrival. The display looks like its sinking into the device. The power button was unresponsive and some of the buttons were sinking in. The remote works, but the heater wouldn't start heating or rotating. The display only shows the top half, so I can tell that it's responding to the remote, but there is clearly a connection failure somewhere inside. There was also a large crack on the front of the chassis. The box it came in had no damage and the heater was secured inside very well, so I doubt this was the result of rough shipping.",
        "Temperature control creeps to over 80 no matter what you set it to. Overheats all the time. Afraid to use. Replaced my first one with a second one. Same thing is happening. DO NOT BUY",
        "I have a rather large finished basement (~1500 sq feet) that never has heated properly. I needed to replace my old portable heater and was hoping to find something similar that would keep the basement comfortable. This heater amazed me. It is very quiet. I like that you can set the desired temp and it turns on and off to adjust. This heater keeps my basement at a comfortable temperature and I don’t have to worry about turning on and off though out the day.",
        "I had just bought a DeLonghi convection heater and it just didn't heat up the room, so I took a chance on this thing, and it works like a charm. The temperature control could be a little more precise (it runs to two degrees over the set temp, then comes back on at one or two degrees under), but it puts out some heat! And I've monitored the amount of electricity each of the heaters have used because I started this whole quest because the oil-filled radiator I had been using gave me a $200 electric bill, and this one is efficient.",
        "Once I realized I spend most of my time in 2 rooms of the house, I took a chance and bought one of these. IT worked SO well. So, being that I don't have to run the central heating in the winter nearly as much now, this has saved me a ton of money on my energy bill. My bedroom is about 13 ft x 20ft and the unit warms so well (with the bedroom door closed) that I end up turning it down before the auto-swift on it turns off. Super toasty! Now I have 2 of these units.",
        "right out the box new.....chemical smell is bugging the hell out of me. i have another 2 models of lasko that dont smell.",
        "Hmm cold Michigan nights are no longer an issue! Our bedroom is a bit cold even with the heating in our home. Warmer in the lower part of the house is to warm up stairs. So a standing space heater for our room was the way to go. But we had a smaller one that just didn't do it unless we cranked it up. This size pumps out more warm air and it is far more appropriate.",
        "Heater works well with the controls and with the remote. Runs quite which is nice and is compact. Only problem is with Amazon. This is the second item we received recently that someone else returned. The box was obviously opened by someone, the item removed from the box then repacked and returned to Amazon. They just resold it as new. After careful inspection we could find no defects or problems so we decided it this instance to keep it. Still working great after a month of use. The five stars because the product is good. Not as pleased with Amazon.",
        "I am using it for my office area and it is okay but not really heating the area the way I would expect it to. It emits good heat and temp control is nice, but it doesn't seem to be able to heat the room to a 73 degree temperature. The office is only 8 x 8 so it's not big at all. If you are sitting right next to the heater, you will of course feel the heat but the air around is still chilly. Not really a fan of this one so I'll buy another De'Longhi instead.",
        "I've purchased several space heaters over the years and every one has good features and bad features. This heater is small and, initially, I thought it would be too small for my living room. After using it a few times, I was able to adjust the temperature so it was comfortable. It has a remote control, which makes it even more convenient. I am happy with my purchase.",
        "I’m disappointed I missed the return deadline for this. I gave it 2 stars because, technically, it works. It heats up the room! However, the thermostat control is WAY off. I’ve woken up the last two nights sweating profusely. We have it set on 70 degrees in our bedroom, and when I got out of bed in the middle of the night to turn it down (because the remote barely works) it read 82 degrees!!",
        "It heats up room in 10 mins. I use it everyday. No noise.",
        "I have ordered new \"Lasko 5160 Ceramic Tower Heater with Remote Control\", but received a used one. From packing, labeling and everything it is easily visible that item was used before. Although they are selling as new. I have not used it yet, so not sure about the performance of it.",
        "my electricity bill went up $200 for running these heaters all night. it also dims my lights when i turn the heaters on. heater update dec 2018: since ive moved, the heater works fine. sometimes it can blow the electricity if too many things are plugged up at once. i really like the setting and features it has. it has remote and is temp control. so if its set at 80, it wont shut off till the room is 80. shuts back on when the run goes below 80.",
        "I didn't see a remote in mine, but I dont particularly care about that. It works great and heats up a large area. It was amazing to see the difference between my old heater and this one. My last one was essentially the old model of this one, and it lasted about 5 years. I'd say that's a winner.",
        "The heater itself works great but it is really annoying that the display faces upward and to use the remote control, you have to aim from above the space heater. So the remote and display are basically useless unless you're standing up, in which case you can walk over and change the settings.",
        "Works wonderful, small, sleek, & stylish. I had a box type last year and it was good but this one oscillates, temp is consistent & warms the entire room. Definitely recommend this.",
        "These heaters are great - this is the third one I have bought for various uses and have never had a problem. They are quiet, put out an amazing amount of heat (I can heat a 38-ft camping trailer), and the remote is great. I can fully recommend this heater without reservations.",
        "Powerful heater that can warm up a room quickly. I use it in an upstairs bathroom in which the central heater barely works and the stone flooring is very cold for bare feet in winter. I leave it on for 30-60 minutes before showering in the morning or getting ready for bed, and it makes the room toasty and comfortable. A very worthwhile purchase.",
        "I want to return this but can not connect with Amazon to get return labels. Please advise since there is no way to contact Amazon direct",
        "I have had it for 2 years and my co-workers are jealous",
        "I had gotten one of these for my office to offset an unbearable window draft. Liked it so much, now have one at home. I use it to take chill out of bathroom when dressing/showering. Great for a quick warm up blast wherever needed. Does not heat the surface it sits on, which is important and was a problem with small ceramic heaters that I've had in the past. Highly recommend.",
        "Defective heater causing breakers to go out in the house. Waste of money had to throw in the trash in fear of my house catching on fire",
        "Not loud! Heats so quick! And there’s a timer and also high and low heat pressure option. If you get cold easily like me this is for you! Has a quite blowing sound to it, it’s a bit soothing. I love it",
        "It's very nice easy to use remote works great but it doesn't quite keep the room as warm as I thought. The room we put it in is about 150 square feet, plus it cost a bit more to run then it was listed.",
        "These are very good heaters and we have several of them that we use in our bathrooms, store rooms and living area. They put out good heat, the remote works well, and we've had no problems with them. AAA+++",
        "This is an excellent space heater. It can heat a large room very well. It rotates or can stay in place. Excellent product.",
        "I bought this as a gift for my daughter who lives in South Dakota and was freezing her butt off. Her electric baseboard heat was not getting it done. She is pleased with it and it does a good job heating her small apt.",
        "So, I'm from a temperate climate and this will be by first winter. I saw a Lasko ceramic tower at a friend's house and was surprised by how warmn I felt, so I decided to gibe it a try! Best buy ever the room gets warm quicklt and I can sleep comfortably! Recommended to my roommate and all my friends!",
        "Great heater and it’s quite. It heats up a room pretty quick for its size. The base could be slightly wider for stability but it works. Nothing bad to say about this heater at all.",
        "I had one already and it works great this one is just as good and it is quiet Update: about to buy my third one for the music/workout shed.) This heater warms very nicely, it is very light and easy to use and is safe. And the price is very nice",
        "This is a great little heater! I’ve had really good experiences with Lasko products - I have 2 heaters and 2 tower fans from them. The only issue is that you have to hold the remote really high if you’re on the couch, since the beam needs to connect with the TOP of the heater.",
        "This little space heater is working well and heats our small office satisfactorily. We are pleased with its features of oscillating and shutting down when the proper temperature is reached.",
        "This heater gives good heat but can't seem to read it's own thermostat. It will continue running until much warmer than it is set to, then not turn on until much cooler. Also, will continue running if tipped or moved. We will continue to use this to heat a cold room where we are present but won't use overnight or unwatched.",
        "I haven't had the heater very long but so far it seems to be doing the job, the instructions could be a lot more detailed though as you only get what's printed on the outside of the box.",
        "This bad boy really works well. I like that it's remote controlled and oscillates, these features make it feel almost luxurious. It's compact size does not affect it's efficiency.",
        "This thing barely heats up a kitty litter box - you can't expect to heat a room with it.",
        "I LOVE THIS SPACE HEATER... KEEPS MY ROOM WARM AND TOASTY. SEE MY ROOM IS THE MASTER BED ROOM AND I ALSO HAVE A BATHROOM IN MY BED ROOM.. WEIRD YES I KNOW BUT THAT IS HOW THE BUILDING WAS BUILT. I COULDNT TELL YOU THE SQUARE FOOTAGE BECAUSE I LITERALLY JUST DONT KNOW BUT MY ROOM IS SHAPED LIKE AN HEXAGON. BUT GIVE IT ABOUT AND HR OR SO MY ROOM IS LIKE OMG..TO DIE FOR...",
        "This tower electric heater is very stylish and generates an adequate amount of heat. The only problem with this model is that it is always a couple of degrees higher than the setting.",
        "It does what it is supposed to, without breaking. We rely on it to heat our daughter's nursery and have had no issues. You do have to hit the +/- button when auto-setting to a temperature to avoid overshoots, I think.",
        "My apartment unfortunately has very very drafty windows. I purchased this heater to warm the bedrooms and it works fantastically! Our bedrooms are a minimum of 14'x12' so they're not tiny. I HIGHLY recommend this heater.",
        "When it worked, it was fine, but after approximately three uses it stopped heating.",
        "Great heater. Have it in a bedroom and it has no problem keeping the room warm when the outside temps are in the teens. Only negative is if the unit loses power it defaults to 75 degrees.",
        "Worked well for 3 months warming a small office then died. Wasn't even used daily. Go with a different product.",
        "This works great. My heat in the house went out so this heats the living room. Dining room and part of the kitchen. Pretty neat.",
        "In the middle of Winter, my furnace died! This heater, once I learned how to adjust the temperature control, was a life saver!!!!",
        "I like that it's a tower heater and fan. The remote works great, and so does the heater. I like the overheat shutoff.",
        "Seems to be well made. Keeps my 20ft camper at 70 degrees in mid October in Michigan no problem. Shuts off when it reaches the preset temperature as it should. Remote actually feels quite nice too.",
        "I was looking for a small heater for a rather large bathroom and this did the trick. It's relatively light weight so it's movable and if I turn it on a little before shower time, it heats the room perfectly. Good purchase!",
        "It keeps; my trailer toasty.... its all I run until cold gets below 26...then I mainly run this space heater and my wall heater set on 67.... wall heater rarely clicks on!! Its a dandy little space heater.",
        "It is great and does its job well. However, I wish it didn’t make too much noise. The noise is durable though.",
        "My basement has been too cold to do anything in my stained glass workshop but this heater has made a huge difference. It works really well. I am very pleased and back to playing in my glass shop :)",
        "So my wall gas unit doesn't work right because it's not venting so I bought this and believe it or not it heats up a large room when you put it on oscillating. It heats up a room fast as well",
        "This heater is just what I needed. The mornings are cool in my California condo and do not want the big apartment furnace on. The rotating feature and the remote control add to the effectiveness. The price is right, also!",
        "I had one and was moving it around from room to room. I like them so much w have 4 now. It will take the chill out of any room in minutes. Great when you live in a 1740 farm house.",
        "Puts out great heat. Unfortunately the thermostat is a 5 degree swing which makes it very difficult to maintain a comfortable temperature.",
        "I have used this for 2 winters now to keep my bedroom warm. Love the remote and the timed feature. Warms the room up quick. Not overly loud. Happy with this purchase.",
        "I’ve had mine for almost two years and it is both efficient and effective—gets the job done at very low cost. Remote controlled, light weight, easy to move around and programmable! Can’t go wrong!",
        "Bought one for a tenant and liked it so much I bought one for our personal use.",
        "Love love love!! It's quiet and heats our living room/dining room in our condo pretty well considering we should probably have two heaters for the size of the room.",
        "I have not used it a lot, so I can't comment on reliability but I use it in a 11x14' cigar room with vaulted ceiling and ventilation, on high it warms the room too much. IMHO this unit cranks the heat well",
        "gives just the right boost of heat to any given room when I don't feel like getting a wood fire going.",
        "It runs quiet, easy to operate. The auto setting is only in High mode. So far so good and I am waiting to the bill to see if it is energy-effective.",
        "Love this product. so great for the bed room to knock the chill off before going to sleep. love that i can set the tier for an hour go to sleep and then not be over heated when i wake back up!",
        "so far so good, haven't seen anything bad about it, yet. I like it",
        "We run it instead of our wall units to economize. Heats up a 625 square foot area quite well and fast",
        "Just got it last week, so a bit premature to give it a perfect five. It's quiet, does what is expected of it. I live alone in a one bedroom apartment, so it's perfect for me.",
        "I bought this heater for my living room. It's an old garage and tends to be colder than the rest of the house. It works great and heats the large room nicely. It's quiet and I like the fact that it oscillates. I haven't noticed an increase in my electric bill and I think it's helped to lower my gas bill.",
        "Gives out a ton of heat for such a small heater, keeps the room cozy",
        "love love love this wonderful unit. It's small works and has great features. LOVE the remote!",
        "Works great for our 16x16 room, slim tall design keeps it out of the way, controls are super easy",
        "This works great. The remote is awesome and the heater works quickly to warm up the space. It shuts off if it gets too warm.",
        "It seems its hard to find a decent heater these days. This is a good heater. I bought a different heater before this one, for 30 bucks. It had good ratings. But Lasted a week. This is my second heater this winter. I was a little hesitant. But I bought it anyway. It works great. I plan on buying an extra one.",
        "I live in an RV and the propane is very expensive more so then electricity. I have had this heater on almost constantly since I bought it. It is still going strong.",
        "The temperature control is a hit or a miss. There have been several instances where we set the temperature to 67F but the heater kept on going. The auto mode was on. Once it was at 76F when we switched off. Since that point we use it only for an hour or two and then switch it off.",
        "The heater gets warm, and rotates like it is supposed to, but it will only stay on for about 3 minutes before it pops the breakers. I have tried different outlets in different rooms. I am extremely disappointed because I was really looking forward to a rotating heater to keep my office warm.",
        "This is the best heater ever. Can control to the exact temperature you want! Good buy. Bought one for our daughter as well...",
        "This is an excellent little heater for heating a room to save money instead of heating the entire house.. Temperature is accurate and remote control works, very nice heater for the price, for any price.",
        "It doesn’t heat as well as I anticipated. The highest it’s gotten is 63 degrees. The room is 9x12 and 3 sides are outside walls but I expected the temperature to rise more after many hours of running.",
        "Our item came in a box that had been resealed and the remote had clear signs of wear. Not cool! SO I went back to see if I had made a mistake and purchased a refurbished one. I can not find anything in the description to suggest that I was getting anything other than a brand new item.",
        "Love it I have it one room and it keeps the room heated. I'll purchase it again",
        "Awesome heater. Heats a medium sized room and maintains the heat. However I do wish the remote CAME with batteries.",
        "I returned this because it does not turn off if tipped over as required by state and local law. Also it did not seem to heat very well.",
        "This heater offers a whisper soft flow of warm air. If you want more volume, look elsewhere...but it's great for small spaces.",
        "Using this in my den. It works nicely for the price. It takes about 20 minutes or so to go from 65 to 69.",
        "This is my fifth LASKO space heater. (One of them died after several years of regular use.) An overall fine product."
    ]
}