{
    "entity": "Electric Space Heaters",
    "text": [
        "This heater really cranks out a lot of heat, so much so that it heats my entire 2 bdrm home (which is old and drafty). I've only been using it a short while but I am well impressed and I can get about 11 hours of heat (on low setting) with one tank. Very nice!",
        "Perfect for a supplemental heater or emergency heater. It really does put out some heat. I'd recommend educating yourself on the proper flame height though. I see a lot of tutorials where people have the flame way too high and that kills the efficiency / purpose of these heaters. Also buy a new transfer siphon. The one that came with it was a nice bonus, but didn't last past 2 months of use.",
        "I've used one of these for years, until it needed replacing.. I anticipate many warm days ahead.. It warms my 800 sqft home quickly. I have to turn it off often, to keep from getting too warm. Brief smell when it's lit, and put out.. Use k-1, always. Never had a problem with it.",
        "I am so happy I bought this for the brutal winter we just survived. Cranked out heat, quiet and easy to use. The igniter is crap, but they always seems to be, just use a cheap stick lighter",
        "Worked well the first 4 times. Ignitor failed on the fifth and I'm not willing to go through the return or communication process to get it replaced or repaired. As far as performance, it does well. Heats up my workshop sell even when it's below 35 degrees. It doesn't deflect much heat to the sides, but you can modify a cover to accomplish this. The handle pulls out easily and rarely is in place when going to pick it up. The cage is a bit flimsy as well, but can be modified to heat water on the top to wash hands while working. Pretty happy with this heater as it served it's purpose.. but disappointed in the electric start function.",
        "Works great, but difficult to keep it running well. Customer service not very helpful. Told me I needed to clean the wick, even when I did it still didn't work right. Tried changing the wick and ended up with it in pieces since the wick is not easy. We got it in but then it wouldn't go up or retract. I think they do this so you have to pay to have it serviced or get a new one!",
        "This Kerosene Heater works great and it heats our garage without trouble. We actually have to turn it off half-way through our workout, that's how warm it gets! We haven't had a problem with it yet. It's easy to use and the instructions are easy to read. We recommend this to anyone needing a Kerosene Heater.",
        "good product if intended use is as a main source of heat you will be replacing replacing unit every two to three years, after that it just gets tired. not unhappy with units, I own several and replace them every several years. Never felt unsafe with these units",
        "Easy to put together, easy to use, is a great additional heat source in my 1100sq ft house; will raise the temp throughout the WHOLE HOUSE a few degrees after a few hours; perfectly heats the back/chilly areas of my house in the winter. Very happy.",
        "I had one of these, same brand, that cratered after a year. This one puts out plenty of heat, and is smokeless, but the self-lighter doesn't always work so I have to light it myself. Other than that it's sufficient for my small tool shop where I tinker during the winter months.",
        "We have a couple of these...and they work great! Will warm you up no prob....and the kerosene seems to last for long while .....so I would for sure recommend them!",
        "Our pipes Burst and damaged our Boiler. These two Heaters were a God send. Worked absolutely perfect. There is a slight smell and due to the size of the area we needed to turn it on 3 hours ahead of opening to heat up the area but it completely worked and made a WORLD of a DIfference!",
        "excellent heater used for a few days when furnace went ..kept rooms in the 80s..does not smell if you use k1 kerosene....",
        "We have a small old drafty house with steam radiators. I light this unit outside and bring into the living room where it heats the kitchen, dining room and living room at a comfy 74 degrees from when at 69 degrees my thermostat turns on the furnace. The heat travels upstairs to 72 degrees and heats the 3 bedrooms, surprisingly the furthest bedroom is steady at 69 degrees. This unit offsets my utility bill. All this time my furnace isnt cycling on whuch is a huge money saver.",
        "gets the job done, but uses way too much kerosene and the handle falls off a lot if you just pick it up without checking",
        "This unit is well made, and very efficient! Amazingly, we don't have to use it for more than 20 minutes at a time. 20 minutes of having the Dura Heat unit lit not only warms the room in which it is placed, but also raises the temperature in the adjoining room by as much as four degrees! We are very pleased. This heater gets the job done!",
        "Heater worked well for 2 months. I extinguished the product to the manufacturer directions. Came home 3 hours later and heater was on fire inside of unit. Had to use fire extinguisher to completely extinguish unit. Contacted amazon they sent another one at no cost unsure if I will use or return .",
        "I have a question for anyone who bought one of these. We just purchased this about a month ago and it doesn't ignite We have to use a lighter to get it going and I don't like doing this. What could be wrong. From day one it wouldn't light. Help!!!",
        "I bought a 104 year old home in Feb. I needed a source of heat as the home was vacant for 2 years. I purchased this as a way to just get the temp down to something where i didn't have to wear a coat. To my surprise it heated my kitchen, livingroom and diningroom.",
        "Electric starter worked once only then nothing. Harder to light than older models.",
        "Easy to assemble. Puts out a lot of heat. Kerosene is expensive, so to use this item a lot you need to procure a source of cheap kerosene. don't assume it is easy to find. I spent considerable time and never found a local source.",
        "Love this heater!!! We live in Florida and don’t have many cool days / nights, but this year we did so we got this for our screened in back porch. It is perfect for a medium size area to warm us up quickly.",
        "I bought this a right before winter been using it for a couple of months now and it a great product. Easy to use no complaints. I use the klean heat instead of the k-1 kerosene. And works fine. Heats up the whole house.",
        "The heater is just about what I expected. It produces a pleasant radiant heat and very little fumes in comparison to my other emergency heater which is propane fueled. It's strong enough to heat my 2000 Sq foot house, even when it's below freezing outside. Also, I love how it's powered entirely by batteries and kerosene, making it almost perfect for emergencies when the utilities fail. It comes with a siphon pump to help reduce spills, but the siphon pump began to fail during the second use. I suspect the adhesive used in the pump is being dissolved by the kerosene, which is a strong solvent. However, a large funnel suffices. Minus 2 stars for shipping with a defective part.",
        "Love this heater. Looks nice. Easy to use and puts out a lot of heat. My husband had an easy time assembling it.",
        "Amazing heater. It's changed my life. It is like have a forced air heater in your house.",
        "Extremely hard to operate. I burned 3 tanks of gas in it with a lot of trouble getting it to work and now the turn knob has broke off of it. Its junk. Highly advise against it.",
        "I have used kerosene to heat 3 rooms of my house as the furnace went out. This unit is quiet and hardly any odor detected. Very good unit, shipment was fast also",
        "It does a really good job but it is hard to find A-1 Kerosene, plus it is very expensive (fuel) almost 9 dollars a gallon. It burns the fuel quick. I still like the product.",
        "if you are going to buy a heater THIS IS THE ONE! very well made a good price lots of heat realy like it easy to set up.",
        "It works great for heating up my living room or the up stairs of my house. When I feel like the heater of my house is not warm enough I just give it a little boost with this heater.",
        "We have two of these. They do great. When our furnace stopped working in Jan 2016 these kept the house warm until repairs could be accomplished. (4 days)",
        "It did a good job keeping three rooms in my house warm",
        "This one was so much better than the previous one. Unable to use the first one I bought",
        "Heat up my house. We put it in the hall way in first floor and you can feel it upstairs. It helps a lot.",
        "Heats my home very well, was packaged great no dings or dents, easy on fuel, and easy to fill up.",
        "this is a great heater. I just missed the big 2015 storms and power outages here in Washington. I feel that I am prepared for it now.",
        "Even though item had some slight damage (a little chaffing in the paint during shipping) it works as designed. It heats my 2.5 car garage in no time flat. I would recommend this unit to anyone that has a garage that wouldn't mind the slight smell of kerosene while its on.",
        "Works great on our patio. Gives off more heat than a table heater or a stand beside the model type and its cheaper to rin.",
        "My parents had one of these growing up. It is great to create a warm spot in an otherwise cold, unheated garage. Easy to use...electric start...but easier to use a match or a lighter to start. Assembly was easy...works great.",
        "I love this heater! Heats up fast and doesn't smell! I use it in my garage and have it in case the electricity goes off and no heat! Burns thru kerosene pretty fast but like most anything that runs on fuel of any kind , that's to be expected!",
        "Great heater. I use it to save money on my oil bill. It really keeps my home toasty and warm. No heavy kerosene odor.",
        "Puts out a good amount of heat without over-consuming fuel. Has a solid well-made feel to the unit",
        "I am very happy with this heater. Well made. No Oder.",
        "Great heater. Used in lower floor of house and lowered my electric bill 40% from previous winter.",
        "I chose this heater because it had a good rating and that it covered so much area. The heater burns clean no smell which is great. I would suggest this to anyone looking for a nice heater that heats a large area,.",
        "This thing makes more black suit then heat. I used it to heat a garage and made the mistake of turning my back in it. Garage was so black I couldn't see across it. I took it apart and back together again and same problem. At least I was watching it this time. Looks like garage sale fodder for this one. Hope the next person has better luck than I did.",
        "duraheat works perfect to take chill out of garage without CO concerns. Have ran 5 gal thru it without fail. Highly recommend to friends.",
        "It was great! Very warm and yet outside was cool. It burned odorless and I received in a record amt. of time. I can sometimes smell the kerosene when its not burning but not to the point to where it outweighs the positives. I will recommend it to everyone and recommend ordering on Amazon.com. Thank You. Aileen",
        "This is a great unit. I use this as a supplement to our home heating and it does a wonderful job. We have a newer house, good insulation, 2x6 construction and a cathedral family room so this thing will heat the entire upstairs no problem. Ran it all day today, burned less than 2 gallons and kept the upstairs 75 degrees on a 33 degree day! No smell of kerosene whatsoever but I did open a window periodically to ventilate. I Would highly recommend. I will be purchasing a second unit just as an insurance in the event we loose power and need to heat the entire house.",
        "Works great, but the drip tray was dented pretty good when it arrived, there was no dent on the box so I don't know how it got there.",
        "Thanks for your quick response in getting it to me. I am very pleased.",
        "Exactly what I wanted. Works well and easy to operate, assemble, etc.",
        "The DH2304 performed as expected warming my poorly insulated garage with a concrete floor from about 35oF to a temperature I could where shorts in while I painted. It came with a small hand-pump that made fueling the heater very easy. Once the wick had soaked for about an hour the electric start lit the heater instantly and easily. The cage around the unit stays cool enough to prevent accidental burns and ignition of other nearby objects.",
        "I have a 3 car garage and when it cold I just don't like going out to change the oil in the car. But this really warms up the garage in about 1 hour it has taken the chill off. In about 3 hours it can be sauna like conditions. Of course I only live in California where the winter only get to maybe 30 degrees.",
        "This heater throws a ton of heat I had know idea. The only time you smell kerosene is lighting it but after 2 minutes no smell. I have a good size workshop with no heat this thing heats it in about 30 minutes. Wish I bought this along time ago.",
        "It is okay but that is all I would say. Not what I expected, I thought it would produce more heat then it does.",
        "Great heater! Use it to heat parts of the house. Saves money on home heating bills. Pretty much odorless. You will get a little smell when you put it out.",
        "Came just as advertised.. it was a used product but the seller did an amazing job mailing everything with it.",
        "Will keep me warm during winter power failures or a EMP. Getting Kerosene was not as easy.",
        "Does a great job of heating and I would recommend it very highly.",
        "Why did I choose this rating? Because it helps keeps the house warm on a cold day and it's sturdy. What do I like or dislike? I like the item, but what I dislike about it is all the work(putting it together and having to be cautious to prevent any danger such as a fire or the fumes). Who would I recommend this product to? Anyone who has trouble keeping his/her home warm.",
        "Great investment for the garage! Pipes froze once this year. Never again!",
        "This product is cheaper on other websites. The product came with a dent on the bottom. It did not affect any of it's functions or usage. I am giving this product a low rating because of cost.",
        "I liked it, it has worked well and some of my friends have shown a lot of interest in it they will be ordering it soon.",
        "This heater work great for the first week then the following week it didn't. When we checked it further we found that it was damaged in the inside. It looked like it had been dropped. When we attempted to exchange we were told that our window had closed by a day. I check the paperwork and it had not. So safe to say we were not satisfied and disappointed.",
        "Easy to set up and keeps the garage at a good temp.",
        "Easy to set up. Purchased for back up for power outages. Handle could be tighter when picking up. But item well made.",
        "Still in the box. I bough it in case Hillary or Obama got us into a civil war or war with Russia, China or North Korea... Thank GOD they are gone and the grid is still up!",
        "Item works fine but the packaging as well as the product was very dirty like it has been sitting in storage for years.",
        "NOT happy at all! Stopped clicking out, had fumes in the house. Probably should have return it.",
        "I can't comment on the operation just yet, as it arrived today. If/when it sees use I may amend this review. However, right now the review is due to the condition of the unit on arrival. Outer packaging showed no sign of damage from shipping. However, on opening the unit, it appeared the unit was a return/reseal. The bottom of the base was badly smashed. It shouldn't affect the operation of the unit, but based on this experience, I can only advise prospective buyers to avoid this seller and get this unit elsewhere.",
        "Works great. Purchased one for my dad to heat his garage and another for me. I burn regular low sulfur diesel from the gas station and added a diesel fuel injector cleaner and rubbing alcohol to the fuel and it has eliminated the smell almost entirely. One tank lasts about 8-10 hours on a high setting. Much cheaper than burning the $10/gal Kerosene from the box stores. Dad tried it with straight Kerosene the fumes were strong enough to be smelled throughout the house while it was on in the garage.",
        "Worst kerosene heater we've ever owned. It smokes, it constantly needs some sort of jiggering to make it work, replacing the wick is an absolute nightmare - even for my husband who fixes absolutely everything. Complete and total aggravation. We've given it a couple of years of use and it never, ever works exactly right. Makes us very sorry we replaced our old, battered-but-dependable, kerosene heater with this waste of money.",
        "This thing works great at heating my three car garage- it only takes about 30 minutes to get it warm enough to be comfortable (30 degrees outside- mid 60's in the garage after 30 mins. The starting mechanism only lasted a couple of starts but I can easily manually start it. It does seem to use a fair amount of kerosene and this can become expensive if using it a lot- (furnace is much cheaper to use) But for an emergency, camping, garage work during winter- this is great.",
        "READ and FOLLOW the DIRECTIONS! This heater works GREAT! Light the heater outside to avoid fumes, wait 5 min and bring in, do the same to turn off outside, no FUMES! Not for weak armed. BE CAREFUL!",
        "This thing is a powerhouse! It's almost too much for our mobile home. We use the Sengoku HeatMate most of the time but I'm grateful I purchase this for the 2017/2018 winter as it's been 30+ below zero here and this heater has been a pleasure to use. I haven't attempted to change the wick or anything but so far, so good!",
        "Easy to operate. But, you have to constantly check on it. The instructions say you have to check it frequently. If it runs out of fuel it does not shut off automatically. It keeps running and soon the whole house smells like kerosene. Windows need to be opened to clear the fumes.",
        "Puts out a lot of heat, Very large, easily can heat a couple rather large rooms. Actually larger than I thought. Burns a lot of fuel though, cheaper to use a propane heater. Propane is only about $2 / gallon where Kerosene is hard to find less than $8.5 per gallon - buying 5 gallons at a time.",
        "This did not seem to work right... I owned one of these before... The control would not turn the wick down low enough and this thing went thru a tank of kero in about 8 hours.. Needed something for my greenhouse in the early spring in NH... but could not get this to work property... Thanks to Amazon... I was protected and refunded.",
        "Excellent product! Way easy to set up and light. Needs about a gal and 1/2 to fill then you need to let the wick soak, the igniter lighting is safe and easy. it is a big unit..bigger than it looks, and heavy when filled. I started it right up in the house and smelled nothing! Awesome product!",
        "keeps all the 1600 foot house comfortable. runs well and does not need to be filled more than 2x a day. worst that can be said is that if you do not follow the instructions it will soot up and need to be cleaned.",
        "Amazing. You can heat this indoors and it only smells kerosene like after you extinguish it. Not bad.",
        "My husband has this going non-stop on these cold winter days in his shop. No smell and gives off just the right amount of heat!",
        "Performs as advertised. Competitively priced. I use it to hear a 10 x 20 green house. Get about 12 hours from a full tank which gets me through those single digit nights.",
        "Takes several hours in my I insulated garage to get warm. However once the place warms up it maintains well. If my shop was insulated I’m sure it would be twice as good",
        "I love the heater. I use 1-K kerosene and have great results. The 1.9 gallon tank goes a long way for many hours of heat in my basement. There is only a little smell when first lighting or turning it off. The directions suggest lighting it outside, but I don't mind. It only lets off a smell briefly and my carbon monoxide detector doesn't even see it. The oil burns very clean, long, and provides a great amount of heat.",
        "I have issues with the electric starting system checked batteries wick does not light the heater only twice I have had success.....checked out the owners manual one needs an engineer to change out the wick ... to heavy to return",
        "Great backup heater. Heats up the house to.a.comfortable temperature in just a few hours. I burn a cleaner kerosene that doesn't have a strong oder.",
        "Love this heater!! Heats whole downstairs!! Only drawback is I gotta fill every 6-8 hours but it does burn very well",
        "This heater is a big success. I'm sitting in front of it right now on our enclosed porch - southern Ohio in January, 33 F outside, and 65 F ten feet from the heater. We have just reclaimed my favorite room in the house - the three-season room is now an ALL-SEASON ROOM!",
        "I wasn't able to get the electric ignition work, so I just light it with a stick lighter. Puts out a good amount of heat. I bought a carbon monoxide heater for garage when using it to be safe, after many hours i only read 8ppm at the highest.",
        "This thing works great and heats my garage in the winter.",
        "Really puts out the heat on my enclosed porch, actually too much. Will buy a smaller one. Will be great for power outages. Get 0 reading on my CO gas monitor.",
        "Puts out lots of heat. Use only the commercial grade kerosene, not from the gas station pump.",
        "It is packed tightly in a damaged box. Works great but need have wick checked to make sure it is in right.",
        "Worked great, easy to put together out of the box",
        "It provided the heat throughout the house , however the kerosene of approximately 2 1/2 gallons was gone in 5 hours. It definitely is not a more economical way of heating up the house.",
        "Clean, proficient heat! I like to light it outside, and turn it off outside, this just avoids the smell of unspent fuel. But, as soon as the wick is burning evenly... it is the best damn heat there is! It is worth the extra work. Love it!",
        "This is a nice toy against winter power outages and old man winter. It burns really clean and no kerosene smell/fume. It generates a lot of heat. With common sense and use precaution, it is a perfect backup solution in the cold winter. I read several researches and online posts regarding safety. Most of the fire hazards occurred because of mishandling and not used specified 1-k kerosene. With this type of kerosene heater, when it is turned off it needs a coupe minutes for the flame to extinguish completely. By the way, the price of 1-k kerosene is not cheap. But I'd rather have this than the firewood and fireplace (these two are not completely smoke-free smell)."
    ]
}