{
    "entity": "Citrus Juicers",
    "text": [
        "if your tired of jucers that dont work than you need to buy this one, the old saying (you get what you pay for) is true you pay a little more buy u will never have to buy another one, i use this at my home and all i can say is (wow)",
        "Perfectly simple and functional piece of equipment, will make you want to upgrade your kitchen to meet such high standard of simplicity and sturdiness. The only imperfection we found is that the metal bowl slides due to immense torque. Easily fixed as shown here:",
        "This juicer is spectacular! It pushes the juice out of the orange halves super fast and efficiently. Cleanup is fast as there are only four parts to clean in total. Using this is a pure joy.",
        "We use this daily in our high volume cocktail bar, we’ve had one for almost 6 years and it’s still going strong. We squeeze between 30-100lbs of citrus every day. It’s quite enough for hone use if you have the space for it. Great juicer, I would recommend it to anyone.",
        "Fantastic, works like a champ, we use it every day in our cafe and it is a workhorse - very happy with this purchase",
        "It's the best you can get because it lasts forever, even in a commercial environment.",
        "I love my new Hamilton Beach electric juicer. It is an extremely well built, robust piece of kitchen equipment that literally whizzes through any citrus fruit thrown its way.That siad it can be a little intimidationg as this machine only has one speed and that is full bore which can be a little more than is needed for the casual user.",
        "Excellent in terms of speed (cannot be faster), but some training is needed for home because it is very fast, and juice gets much pulp: fine if you like it but bad if you need to filter it.",
        "i really like it. it is make to the last... is easy to clean and you get a orange juice faster and easy... we can saw the power full motor and is really silent while is waiting for put a new orange..... I really love fresh made orange juice...",
        "Its a good product compare to similar ones .... it’s powerfull I like it all",
        "This this is a tank!! If you have enough use for it, I'd say make the investment",
        "Great juicer. Would be nice if the price was a little more affordable",
        "This juicer is what I use in my restaurant. It is high powered and very easy to use. Cleaning and maintaining the machine are very easy. The only reason I am not giving it a 5 star rating is because I would like for the strainer to take more of the pulp out. Besides that, it is a quality juicer that is perfect for a commercial evironment.",
        "very good product, makes juicing oranges and grapefruit almost effortless. it is everything i expected and i hope to have many years of great use.",
        "We are a restaurant. We are using \"the heck out of it\" and it hasn't broken down on us. 10 gallons of line juice every 3 days or so.",
        "It's too 'flimsy' The cone is not well designed. The citrus fruit 'comes off' during juicing and the cone 'bites' your hand. Spend more... and get the real thing.",
        "This is one powerful juicer and is solidly built. This a commercial juicer but I bought it for home use. I browsed the reviews of other juicers here on Amazon and found alot of mixed reviews. This one stood out because other reviews said it was a really good commercial juicer and it was half off. I would be very surprised if it gave me any mechanical problems any time soon because it looks acts like a strong and well built piece of machinery.",
        "My wife used it with mixed feelings, but I thought it was excellent. I juiced 26 large oranges in ~30 minutes, including cleanup, making over a gallon of orange juice. It's fast and quiet.",
        "I've bene using it for a month now in a cafe, every day, and it works great. Solid, fast, quiet and reliable. Highly recommended.",
        "If you love squeezing fresh oranges and you are fed up with all the littly crappy juicers on the market, then this product is for you. Just be careful, its so effective you might not want to let a kid play with this.....easy to clean and very effective......."
    ]
}