{
    "entity": "Citrus Juicers",
    "text": [
        "I wasted 3 years with centrifugal juicers. The quality of the juice from this juicer is way way better than centrifugal ones. I could taste everything I put in and used much less produce. Wow what a difference. I would highly recommend this juicer. This is the best thing I have ever bought. It is much easier to clean too. If you want to drink healthy and tasteful juice please use a slow juicer like this one.",
        "Have been through 3 of these machines in less than 5 months and now broke again. Top plastic piece continues to break. Do not put whole carrots, etc in machine as it will crack.",
        "I used the juicer 4 times so far. Advantages: 1-heigh yield 2- quite 3- very good for juicing greens 4- nice juice consistency Disadvantage: 1- stuff get stuck easily 2- somtimes it's very hard to open it after juicing 3- get easily blocked 4- in the end there will be un-juiced fruits remaining inside the container",
        "I purchased this juicer to replace a hamilton beach centrifugal juicer. My concern was that the blades of the centrifugal juicer was causing excessive aeration and heat to occur in the juice which could be affecting the nutritional value of the juice itself. This juicer is fairly stout with a motor wearing much more than most centrifugal juicesa I've ever had. The shoot is large to allow medium to small sized apples or other similar fruit to be fed in. Fibrous vegetables like celery or carrots can wrap around the auger and get jammed so just be aware. The included brushes make clean up much easier as well",
        "Quality product, easy to clean. You realy have to cut the fruit in pieces. I wish the feeding tube opening was a little larger. This is where I put the green vegetables and herbs. Other than that, it is a great product and I am getting hooked on juicing.",
        "I just don’t like that when you do a little bit more product it gets stuck and doesn’t filter the liquid down. We use it only for celery juice and you have to cut the stalks in little pieces otherwise it gets stuck! Is not that easy to clean and sometimes I just avoid using it because I don’t have q lot of time to clean it but other than that is a very practical way to detox your body with a good juice",
        "Pros; Squeezes out every ounce of juice. Cons; Have to chop fruits and vegetables. Waste of my time. To many pieces to assemble. All pieces has to be aligned exactly. Can't be bothered. Juicer to hard to unlock. On the second use it would not unlock. Had to have my cousin who is built like a football player to unlock it, and still he had to put in a lot of strength. In the process of returning it Bottom line; Not worth it. Would Definitely NOT recommend.",
        "I love the fact, it make a lot of juice at one time without taking it apart. My son does not like vegetables so i can put vegetables and juice them. He loves fresh juice. He asks me to make it. I am very satisfied with juicer except one issue.issue: I have been facing it trying to remove the upper section for cleaning. I have to leave it for my husband to take it apart for me. Otherwise I would of given 5 Stars. My husband suggested maybe trying or putting little coconut oil? I don’t know. Trying to think of ideas how to best take apart.",
        "Its pretty good when it actually works. I cut up the fruit small. I take out the seeds when I'm juicing apples. I even peel the skin off but some how the fruit still gets stuck and won't feed out into the trash part. I have to stop it and clean it out and start all over again or find some to clear it out. Too much work. What should be a quick process take an extra 20 to 30 mins.",
        "So instead of grinding to get the juice. It uses circulating mechanism to squeeze the juice out slowly and crunching the fiber on side and juice comes out through filter on other side. Great for making carrot cake for fiber left over and really works for leafy green like kale and spinach for making green juice. Top opening is large enough for small whole apple and cut fruits quarters from orange and lemon. For citrus juice, masticating juice is more efficient than spinning high speed juicer.",
        "It gives me high quality fresh slow juice. It is not very convenient but give me great juice. Not easy to clean too.",
        "I want to be fair the juicer works but I feel it’s underpowered and locks up fairly often, the you have to click the reverse button back to forward to restart the rotation . Other than that It’s a good machine. I wanted to add I think most people more than happy. I upgraded to 4 stars because I thought 3 before was a little low.",
        "Easy to use, assemble, clean Highly efficient at extracting juice",
        "Love our juicer. Easy to use, easy to clean. I do like my Vitamix but the nutrition value is a plus. Highly recommended.",
        "Got the caynel juicer because it was a better price point on the 3rd had it a week then the outer sheath broke. Amazon refunded...got the Breville so far so good..I dont have to use a strainer to get the excess pulp out..super quiet and easy to clean..I say you get what you pay for...If your investing in your health spend the money.",
        "Great juicer. It takes 90 % of the juice out. Easy to clean. And very quiet to operate. I’ve had 2 juicers before this one. Wow !! This one is the best.",
        "I love it. It’s a bummer that you can’t use the dishwasher with it. Kind of hard to clean.",
        "This juicer is amazing !!!! Expensive but worth every penny!!!!",
        "When I juice certain vegetables like celery the juicer gets clogged up and it very hard to unclog without having to stop my juicing session and start over again.",
        "It came broken in several places. I ordered it in “like new” status",
        "broke in 1month. I was juicing regular vegetables. Steel strainer was broken. Returned and refunded!!",
        "The best blender! Juices anything you can throw at it!",
        "I like it because it works as advertised. Read the instructions and you should not have any issues with juicing or cleaning. I make green Sirt juice recipe and each batch turns out rich and consistent.",
        "These juicers are just not built well. After a while, they can't handle juicing a carrot or a beet or even a cucumber. It is a true waste of money and so disappointing.",
        "Juiced apples, carrots, celery, spinach, ginger all with great results. It is a chore to clean the various parts but the juice it makes is worth it.",
        "Love everything about this juicer. The produce is well squeezed and all of my leafy green are juiced well, very dry pulp when done. The cleanup is very easy also. Very impressed with this juicer.",
        "If its whole celery or a chopped celery or really any vegetable it will get backed up & the juice is not smooth at all.fiber through out the whole juicing process.very disappointed",
        "We juice veggies. Wish the strings from celery and kale would get by that tiny hole instead of staying stuck in it.",
        "Your search is over. this is it. absolutely worth the money. don't settle for anything less.",
        "So easy to use & clean up is a snap!",
        "Easy to put together . Silent , and extract all the juice out of everything. Perfect investment",
        "Makes great juice. Doesnt get clogged easy. Im very happy with this one...",
        "Is an addition to My healthy routine a life changer",
        "This juicer works great but isn't as good as the Kuvings it replaced. However they both have fatal flaw RUST! The cutting/straining bowl that goes inside the juicer rust behind the blades and can be seen through the plastic. This is critical part that your juice makes contact with. IT should be made out FOOD GRADE STAINLESS ONLY! Ingesting rust particulates isn't what I purchased this unit for....",
        "REALLY, SERIOUSLY DISAPPOINTED WITH THE ENORMOUS WASTE OF MY TIME AND ENERGY. EVEN THE PUSHROD COULDN'T REACH THE DEBRIS CLINGING TO THE INPUT CHUTE. THE ROTOR JUST SPUN IN SPACE. I TRIED POURING TWO CUPS OF WATER INTO IT, BUT IT JUST FOUND ITS WAY OUT, BYPASSING THE JAM. REVERSAL DIDN'T HELP BECAUSE THE ROTOR WASN'T JAMMED. THE ITTY BITTY OUTPUT CHUTE WAS SO TIGHTLY PACKED THAT EVEN AFTER THE WHOLE MACHINE WAS WASHED OUT, I HAD TO VERY CAREFULLY AND REPEATEDLY FISH THE FIBROUS DEBRIS OUT OF THE OUTPUT WITH A PAPER CLIP HOOK. HOURS OF WORK!",
        "Hate ittttt!!! The hole where everything goes out gets stuck very easily so you have to keep opening it to clean that part , like if you have pineapple, celery, ginger or anything with fiber FORGET IT your will not make juice any sooner, it took me almost an hour to do the juice today ! You can see the video I uploaded, unfortunately I can only upload one! Don’t buy this you’ll regret it!",
        "Kept clogging and to clear required disassembly. The base is made out of plastic. I thought Brenville was top of the line. My old unit is all stainless and built like a tank. And always works great . Glad I kept it. Glad I bought this new one on Amazon, return was no problem. Thanks Amazon.",
        "I really wanted to like this juicer. The juice it makes is delicious, but it takes two people to separate the feeding basket from the strainer. Tried calling the company and just put on hold forever. Sadly, I'm sending it back.",
        "Love this juicer. So fun to watch the fruit and veggies be ground into juice. Easy to use, very sturdy and high quality parts. Extracts as much juice as possible - better than the spinning type juicers I’ve had in the past. As easy to clean as any juicer I’ve owned, which is to say it takes time. Very happy with this juicer - better than any others I have owned.",
        "I was looking into a good juicer and found that the slow juicers like this one with 2 different options to feed the juicer with your fruits and vegis, a spout that you can close, powerful enough to handle a full size apple, extracts the liquid nutrients from your leafy greens easily and not hard at all to clean. I love it, I cant wait to juice everyday! Great unit, cant go wrong. I'd suggest this Breville juicer to anyone.",
        "Hands-down the best thing I did for my health. It’s life-changing. Worth every penny. Once you get creative with that juices , you’ll be addicted. If you’re looking for a juicer/ extractor , look no further",
        "This Was Made For Me. Beautiful Juice! Easy Prep. Easy Clean No mess Nothing spills anywhere I love how quiet and Easy and slow and steady and performance is Awesome. You have to get this. If you are a daily juicer. So so wonderful to use. It’s a great product.",
        "Horrible and very messy it get stuck very easy the pulp get stuck and create a huge delay in the making of the juice",
        "Quite silent, convenient to use. This is the best thing I can buy for myself as a gift. I recommend to everyone.",
        "Have juiced 3 days in a row since receiving the Breville. Made a fantastic V-10 vegetable juice just now. It's one of the best juices I've ever had. Besides the tasty juice, it's a breeze to clean!",
        "The only thing that I don’t like is that the base is plastic. The old style that I have was in stainless steel."
    ]
}