{
    "entity": "Keyed Padlocks",
    "text": [
        "UNDER NO CIRCUMSTANCES SHOULD YOU PURCHASE THIS LOCK. I bought this lock to practice lock-picking, a hobby which I picked up YESTERDAY. This was the first lock I tried picking after a transparent ACRYLIC lock for absolute beginners. I was absolutely floored by how absurdly, pathetically easy it was to pick this with minimal knowledge and low-quality tools. I can do it in about 5 seconds after getting a feel for it. It wasn't even good for practicing lock-picking! I learned nothing from it because it was SO EASY.",
        "I purchased this lock to practice picking, and i was shocked at how easy it is to defeat. I am not exaggerating when I say I can get into this lock in under 5 seconds as a novice lock picker. There are locks with security many times better than these locks for only a small amount more money. Here is my recommendation for this price range: ABUS Titalium 64TI/50",
        "I installed this on an outside gate in September 2013 in Minnesota. Since that time I have not once removed it or unlocked it. I've attached pictures of what the lock looks like after having been exposed to Minnesota weather for 15 months.",
        "Got this open with a key from a different padlock. This alone warrants 1 star for legitimate use. Full disclosure, like many other reviewers, I'm using this as a practice lock for lockpicking. I mean, I WOULD be... It's just so incredible simple to open that it's not even good for *learning how to pick locks*. My wife, who had never held a pick before nor seen the inside of a lock, had it open in less than 10 seconds. All things considered, the clamshell packaging is a more formidable barrier, which, again, warrants 1 star for non-legitimate use. Avoid!",
        "I bought this as part of a progression set for lock picking. It has a spool pin, which I had hoped would be at least a little challenging. Unfortunately the only challenge with this lock is the fact that it has terrible feedback. I picked it open within minutes and moved on to the next one. If you're a beginner looking for a basic security lock for lock picking, you should consider skipping this one. Go straight to the Brinks 162-40001 instead. If you're looking to use this lock to lock something up, unfortunately I have no opinion other than the fact that it is not pick resistant and therefore not very secure.",
        "In short just like your standard lock but the keys man o man. My key after approximately 6-7 used and one week the key snapped inside the lock and had to grind the lock off. This is not a high security lock merely a deterrent but it is cheap all indoor use by the way weather had nothing to do with this",
        "I'm giving this lock 2 stars because it's extremely insecure, but not 1 star because it is a deterrent and is better than not having a lock. It does a decent job of keeping things closed, and it's a deterent for the general population, however anyone who wants to take 15 seconds to try to pick it will find it pops open with little effort. Don't buy this lock to secure anything you aren't prepared to replace.",
        "I'm a novice picker and it look me several hours to pick this and I've only done it twice. Definitely harder to pick than a chinese clone of the master lock 10D. It's also manufactured with much better tolerances. However, I believe it can be opened instantly with a tool that pushes all the pins up far enough (I do not have this tool so I can't try it). It's also very light, thin, flimsy feeling. I'm sure it could rapidly be brute forced with tools that can fit in your pocket, either with handheld bolt cutters or the wrench leverage method.",
        "The good: the build quality is decent enough for a very inexpensive 4 pin lock. Great for learning the fundamentals of lock picking or keeping your kid brother out of your secret stash. The bad: Anyone besides your kid brother will be able to pop this thing open within a few seconds. Even though it's nice to look at and feels solid, it can easily be picked and it is small enough to be cut. Overall: It's a nice inexpensive deterrent lock to keep honest people honest. If someone wants to bypass this thing to get into your stuff, they can do it with ease. I'm still giving it 5 stars though because of the build quality and price combo.",
        "Bought this for lockpicking practice and accidentally opened it without the picks in yet. Was able to duplicate the results with a paperclip... so, yeah: don't expect this to secure *anything*.",
        "I purchased 4 of these locks for a project I was doing. When searching for lower cost locks, I figured a 4pk would work (since it seemed cheaper).... but all the 4pks of locks I kept finding at a lower cost meant all the keys included fit ALL the locks. That wasn't gonna work.... so purchasing 4 of these individual ones made more sense. Glad I made that decision. Since they are \"Master\" brand... I felt better knowing I was getting a well-constructed lock from a trusted brand (as opposed to the lesser-known brands out there). No issues with these locks what-so-ever.... All 4 of them work flawlessly. Very Satisfied & Highly Recommended!",
        "I bought this lock to learn lockpicking. This lock does NOT need to be picked!!! You can completely bypass the whole lock mechanism with the most crude of tools. I can bypass this lock quicker than I can open it with a key - and I am an AMATEUR! I can open this with something flat and something thin. A zip tie, a toothpick, whatever. DO NOT BUY THIS LOCK. SHAME ON YOU MASTERLOCK. SHAME.",
        "Theres a fatal flaw with this lock and all other 140D locks. if you keep tension on the core and tap the back of the key way hard enough with a key, the latch will pop open. i did this with my lock i ordered, and various 140D locks around work and other locations. these are terrible locks and the only thing they do is keep honest people honest.",
        "Terrible at being a lock. Good for teaching lock picking. You can teach anyone in two minutes with very simple picks how to open this as fast as with a key. As a very easy lock though it is good for practicing beginning techniques for picking locks. It does feel nicely sturdy in the hand.",
        "This is a lock that was recommended for beginning lockpicking. As it turns out, you don't even need to pick it. Just insert a rake and it'll open. This is definitely not a lock I would use for anything valuable. If you just need something secured well enough to keep out small children or animals, this is probably good enough. For something that you don't want stolen, buy a real lock.",
        "I waited for a long time before writing this review, because I wanted to see how it handled the elements. The lock has been on my garage for the past three years, through rain, snow and everything in between. I’ve only had to spray it with WD-40 twice, and it still opens like a dream. This lock is strictly meant as a deterrent. I’m sure it wouldn’t withstand serious abuse by someone trying to enter my garage, but that’s not the point of buying a little lock like this. If you’re looking for an all weather, rugged and dependable little lock, look no further.",
        "Whoever says that these locks fit and work for luggage is spreading lies. They certainly do not. Not even close enough to wedge in there, not that you'd want to anyways. However, this is pretty much the type of lock that you would expect from MasterLock. Definitely strong, solid, heavy. The lock tumbler is not particularly smooth and the keys are really flimsy. I haven't bent one, but it definitely wouldn't take much effort. Overall, good deal for the money. I'll find good use for them even if it's not for my luggage. What comes in the package: 1x 140D hardened steel lock (size 4 from MasterLock) 2x keys Comes in fully sealed, store shelf, frustration guaranteed packaging.",
        "Even for a small lock, this thing is pretty bad. It's a good training lock for a beginner locksport picker. It's just not secure and should never be used to secure anything of value. IIRC it had 1 spool and 3 standard pins. I'm pretty new to picking and I can pick it in about 10 seconds. With a crowbar or hammmer, probably about 1 second.",
        "Don’t protect anything worth more than fifty bucks with this thing. Actually for home defense this thing works better wrapped up in a sock and used as a weapon. If you are beginning picker get this one to learn on. Also if you lose your key just get a shim or two.",
        "To start, I'm no locksmith expert. I've been lock picking for about a year. I bought this lock for picking and it's great for beginners, but for goodness sake do NOT buy this lock to keep stuff safe. All standard pins. 5 pin set. I can pick this lock in ONE second. I'm not lying. Use a 3 hump snake rake pick. Instant open. All brass construction except the shackle. Quality isn't too bad honestly. It's just awful for security.",
        "Several reviews have said this lock is pickable but for my ourposes, protecting the 5 gallon gas can on the back of my camper it is just fine. I neede something that would prevent casual, walk by theft and this is jyst the ticket.",
        "Solid look and feel in a sleek size. Docked one star because, even though it does contain security pins, it fell apart under SPP in about 4 seconds. Maybe I just got a bitting that was incredibly vulnerable to a standard hook, but bump the back slam the front and pop goes the weasel. If you're looking for soft training on security pins, this is your jam. If you want something to keep your guitar case safe, go with the brinks security locks of the same size.",
        "bought this because my combination lock sometimes took forever to open, with this one now I dont have to stand buck naked and while I try to open my locker. Nice.",
        "I'm an amateur lockpicker (literally started less than a month ago) and picked up one of these to practice on. It proved slightly more difficult to crack than my practice lock, but not by much, so if you're looking for something 'secure', then steer clear. An experienced lockpicker could have this open in less than a minute, for sure.",
        "Great lock. No issues other then one. MAKE SURE ITS LOCKED BEFORE YOU WALK AWAY. Give it a good couple yanks to check its locked. I came back to my locker and saw it never really locked.",
        "It's a small padlock. It's not really worth $8. I thought the mechanism was you put your key in the lock, turn it, and pull the lock open, and then you can't remove your key until the lock is slid closed. No. The mechanism is, you put your key in, turn it, and the lock will click open as if with a spring or something, and you are free to remove your key. Not factoring that into my rating, I'm rating 3 stars because it is terrible value. It doesn't even feel hefty in your hand. The casing is almost the same width as the bolt itself. I'd pay $3 for this lock.",
        "I had this picked within 30 seconds of getting it out of the packet. I bought it to practice lockpicking on and it was stunningly easy to open. I'll never buy one to actually protect anything.",
        "Really nice , inexpensive and serves its purpose. I wasn’t looking for something fancy just a plain lock for my shed and so far no problems.",
        "Nice solid lock. It seems solid but nothing a small bolt cutter couldn't remove in a second. This lock is to help keep theft down, not prevent it any size lock like this can only do so much. But Master quality still is in this lock.",
        "I'm torn. Do I dare this 5 Stars because it's my favorite lock with standard pins to practice lock picking on or 1 star because even family members with no experience with lock picks can open it in fifteen minutes? I stuck with 3 stars",
        "This lock is sturdy and suits my purpose, which is securing my locker at the gym/pool. One gripe: the bottom edges (circumference around the base) are so sharp I'm actually afraid I'll cut my fingers one day. Why couldn't they make the lock with smooth corners so that it's hand-friendly? Anyway, other than that, it's a good inexpensive lock.",
        "My friend had one of these locks on his locker. As a joke I went up to his and tried to open it with my key since we both have the same lock. My key opened his lock and he was like terrified. His key couldn't open my lock. I don't trust this lock at all. I use it as a barrier access for people who have low IQ now.",
        "I like how it comes with two keys. Feels like it will hold up well and wouldn't be quick to break off if someone wanted to get in. -Jen",
        "I had a little difficulty with this lock when I first got it. I couldn't turn the key at all when I inserted it the first time. I'm not sure what the cause of it was, but I ended up putting the key in the lock, then hammering it down, one the key, on the counter once. After that, I was able to turn it, and the hasp clicked open like nothing. Now, every time I turn the key, it's smooth and the hasp pops open with vigor! Easy to use, and just what I wanted.",
        "Pretty standard lock, not much in terms of security, but fun to learn lock picking with. It has 4 pins, 1-2 of them will be security pins. I would definitely recommend an american lock if you want something more protective at a lower price point. Don't lock anything you care about with this thing.",
        "I have it locking the gate around the pool. I never need to worry about it. After being in the rain it still works perfect.",
        "I have bought this padlock for locking the U-Box container. It is sturdy enough and locking very well. Overall happy with the purchase.",
        "Great little lock. Not too big for a locker that is in an office. When opened with key, the lock pops right open.",
        "I don’t think the top is supposed to fly off it’s base. A lot of crawling on the floor trying to find it!!",
        "Ordered in conjunction with the file locking bar and it worked perfectly. Strong durable lock. I only recommend Masterlocks!!",
        "I'm glad it came with two keys, in case I lose one. But the strength of the lock is in line with other master lock products I've used (which is good for my needs).",
        "The Master Lock is a good quality and well made lock. The brass body is solid, it can get stained or tarnished.",
        "This is a good, high-quality lock for general use at places like the gym or a shed. This isn't the type of lock you want to use in a bank or storage unit with stuff you want to keep. So far I haven't had any trouble fitting it in holes designed for locks (lockers, chests, sheds etc.). The lock operates smoothly and is a good deal. If you get more than one of these locks they're keyed differently. Overall this is a good lock for light duty things.",
        "I purchased this lock to practice picking and was pretty disappointed in the ease of picking this lock. This lock seems to have 4 pins and a very weak shell. It allowed me to sweep pick this lock in a matter of seconds. This lock does however come with 2 keys and a cheap price tag . I would not use this lock though on anything that you want to be protected from thieves.",
        "Locks only keep Honest people honest. works great, no problems",
        "I know nothing of locks. This is just to use on a secured storage. It’s for privacy, not security. It feels solid, and the design is elegant.",
        "The lock and key works great. I use the lock to lock my clothing and shower items at the gym. Friends and family kept telling me it was only a matter of time before my backpack would be stolen. I feel much more secure now, absolutely worth the money! I do have to carry the key with me but ultimately it saves me time and effort by not having to fiddle with putting in a combo code.",
        "Its a lock, normal people would use for a shed or cabinet. It has a bypass flaw, where you need tension and a pick to open it.",
        "it a cheap master lock. Anyone who knows how to pick locks can get into this in 10 seconds. Its more of a determent for people who enjoy randomly opening your draws and cupboards. I don't recommend using this lock on something very valuable.",
        "There isn't much you can really say about a lock right? Unless you're a locksmith? Or a lock enthusiast? or lock historian? Which I'm neither of. Does the job, comes with two keys so I can keep one at home and one on my car key ring. I use this lock for the gym before and after I walk around the locker room nude for an hour. (just kidding, but we all know what I'm talking about).",
        "Got for my locker at work. So far so good.",
        "It's okay, but it's very easy to pick, I wouldn't recommend this to protect anything important.",
        "This lock is very easily picked. I picked it open in less than 1 minute using a rake.",
        "No not this lock... Unless you're practicing beginning lock picking. Good for first lessons. I expected more from Master.",
        "A great novice lockpicking practice lock. TERRIBLE security. Seriously, after watching a dozen Youtube videos and getting a set of locksport tools, I picked this lock in less than two minutes. DON'T get this if you want to secure valuables. DO get this for someone who is learning very basic lockpicking.",
        "I needed this lock for my chemistry lab (to put on a drawer) and it was exactly what I needed. It was a good size, not to big or too small, and it was really simple to open and close. I liked that it came with 2 keys so that I could keep one on my keys and one in my desk in case I didn't have my keys. It was secure and exactly what I expected.",
        "The lock worked well for a couple months, then it started to get extremely difficult to re-lock after opening. Now it's almost completely unusable, I had to purchase a new lock. I wasn't expecting a lifetime of operation, but I've barely had it five months, and used it maybe twice a week.",
        "So I probably had one of the unluckiest experiences with this lock. I had used this lock for about a few months, but yesterday, I tried to open it with my key, the key went into the slot, but the lock, no matter how hard I tried, would not open. I eventually had to get the shackle chomped off with the jaws of life. Heh, it took the security guy a few tries to open it because of how tough the shackle was. Poor experience, but it was pretty good when it was working.",
        "I got this lock to fit on a small chest. It is pretty small and feels solid, but it isn't really that secure. I found that I could blind pick it by raking it in about 3 or 4 seconds. I mean It works as a deterrent, but if anyone tries to open it it probabily won't stop them. I still use it, I just found it was more convenient to pick it open than try to keep track of the key. Basically don't use it for anything really important and you will be fine.",
        "Using this for an electrical breaker box. Seems very well built and sturdy and has a nice brass finish to it. Shackle is a good length also. Master rates this lock as a 4 out of 10 on their security scale, so take that into account. It's sufficient for my use and i would recommend it for other such uses. Comes with two keys as shown in the picture.",
        "What is there to say. It's a great small key-lock. I recommend it.",
        "This lock is good for \"deterring\" a criminal, but it offers little protection. It is small and easy to break open. I would not recommend using this to protect anything of significant value.",
        "I use this indoors for a locker. It was a solid low profile lock for about 6 months until the body and shackle (\"U\" shaped piece) fell apart. It still locks, but the shackle completely comes out of the body. I doubt I caused any major damage opening it a few times per week. Overall, this was a little disappointing compared to the majority of Master Locks I have owned.",
        "I'm a beginner lockpicker and this lock is a good challenge for me to pick, however I am able to rake it open very easily so I would not recommend it if you are going to use it as an actual lock.",
        "Laughable \"lock\" I say this for the majority of people who have no experience with security and am absolutely not exaggerating, this lock can be picked with a zip-tie... easily. Buyer beware.",
        "Pros: Great Price Small and compact Fits any locker (specifically \"Planet Fitness\" that push on you combination locks that are annoying and pricey with lockers specifically designed to their locks) TWO KEYS Cons: Easier break-ins....maybe?!",
        "I can easily open this lock with a toothpick, and it doesn't appear to be much for strength either. I wouldn't trust this on a gym locker or anywhere where a stranger could have a go at it. Anyone who really wants to get past it will, I would say it's only good for keeping a nosy friend out of your stuff. If what you want it a small, cheap lock to keep nosy people out then I'd say it's not a bad deal.",
        "We have a 6 foot wooden fence where we have a swing door on either side of the house. The way the fence is built with the locking mechanisms leaves very little space for a lock to go through. We have a pool so it is very important that our fences are locked. This lock is the perfect size for our fence. The lock is nice and sturdy and comes with two keys!",
        "Thin and really good quality. I love master locks, they work great. This one is small enough to fit in small locks!",
        "It's as described. Shipped promptly. Would not recommend for anything more than a locker for daily use or something as it is not as secure as a better lock would be. Great for dissuading people snooping around but will not keep a determined person out",
        "I have bought several of these lock from Master Lock company. ALL this company's locking product have never disappointed us in keeping out people who are not supposed to gain access to what's on lockdown. I swear by this company's name, reputation, and products!!",
        "Lock was TOO good.. Accidentally locked my keys inside my locker, and my local locksmith couldn't get it off without cutting it off.",
        "Weak body, easily snapped. But why bother? I picked it with a paperclip.",
        "I use this for my small locker at my Volunteer EMS agency. Master is a good name, so I went with it. It has a solid, hefty feel for it's size and the keys and tumbler offer a smooth action. Nice, solid brass keys (the lock comes with 2 of them as is typical). It just works and does the job. No complaints. Solid enough for what I need it for.",
        "Good lock for lock picking! I only started a couple weeks ago and I can get this in seconds, sooooooo also not that sucker if you want to keep something safe.",
        "I ordered a Master outside padlock for a gate which ended up being discontinued so I ordered this lock instead. Enough to keep any common riff-raff out of my back yard until I can find an adequate outdoor lock. It is much too elegant to use outdoors.",
        "I spent a summer as a locksmith's apprentice, and I just had a random key sitting around which opened this. But the small size made it a decent thing to practice lockpicking with non-traditional tools (that is, with a pencap and a hairpin rather than lockpicks)",
        "Even though it might not be PC for Parisians, I definitely purchased this for a recent trip to Paris with the GF! Love Lock Bride y'all. It was perfect our needs - seems sturdy enough to withstand the Parisian citizens protesting our love and came with two keys for us to toss in the Seine!",
        "We used this lock on our shed. It worked great for our purposes. We lost one of the keys so we were happy it came with two. It could get a little stuck sometimes trying to close the lock, but otherwise was exactly what we needed.",
        "What can I say it's a master lock as usual it's built tough and works like a champ. We live in the desert here in AZ and so far no issues with the finish blemishing in this hot desert climite and no sand is getting into the lock so far jamming it up. Amazon had it for a good price and free shipping when I got it.",
        "We've always liked Master locks and needed several at once, found this to be a good value and would buy again. Delivery seems to be getting to be a real problem with Amazon purchases, but if we don't need them quickly we'd buy this way again and trust Amazon to fix the problems.",
        "These locks are some of the toughest locks around! I had one a while ago and I shot it with a .223 round at 100 yards and that sucker was hardly damaged.The round pierced the brass but the lock didn't even pop. That is some tough stuff,I had to get one again.No wonder Master Lock is a leader in the security industry.",
        "I'm liking this lock so far after a few months of using it 4 times a week at the gym locker room. All metal design is nice to look at and has a solid feel in the hand.",
        "I could open it with a paper clip. This is not a lock it is a Christmas ornament.",
        "Only two of the four pins need to clear the shear line in order to rotate the cylinder..!! I gave three people a pick and tension wrench and gave them a very basic explanation of lock picking and all three were able to defeat the lock on their first try in less than 30 seconds each. I haven't bothered cutting up a soda can yet, but the gap between the shackle and the case easily appears wide enough shim the lock as well. The one good thing about it is that it is pretty heavy, so if someone attacked you, you could throw it at them and run away.",
        "I use it for a gym locker. It does it's job! The key does not feel like solid metal and I am sometimes concerned that it will break off in the lock.",
        "Shackle comes right out and so I have to turn the key and push it back together to lock it. Pain in the but.",
        "It was perfect for learning lockpocking cause its so redicilously easy to open. Better than nothing though",
        "Use this for the gym and it is a great little lock. No complaints whatsoever. These are a little harder to break into than the combination ones I have heard. Definitely wouldn't lock up anything of too much value with this lock, but it's great for lockers.",
        "This is the best lock I could find because most of the combo locks were known to break on this site. So I chose the simple lock and key and it's worth it.",
        "They are cheap, but don't expect them to deter anyone who actually knows how to pick a lock.",
        "Nice solid brass body, but someone cut or sawed right through the shackle.",
        "I would say it would be okay for keeping people in check but would not deter any real thieves. Very easy to pick, it took me about a minute to open it and I'm not even a locksmith or advanced lock picker.",
        "It isn't the most secure lock in the world but it keeps an honest man honest. I bought it for my locker at work. It fit, and works great.",
        "I lost my last lock for my gym locker and bought a lock at the hardware store but when I took it out of the package it felt cheap. I then went on-line to try and find one like the one I lost and Amazon came through. This is a nice solid heavy lock at a great price. Perfect for lockers.",
        "I have had this lock for about 2 years now. (lost the first one at the gym) Very solid construction. Keeps my gym locker safe. Keeps anything I lock to it safe. Comes with 2 keys. No complaints. Great price.",
        "My husband wanted a keyed lock for his locker while he works out at the YMCA and this fits the bill. He just keeps the key on a stretchy wrist key chain and the lock always locks and unlocks like it should. He says it fits the lockers perfectly.",
        "Good lightweight gym locker lock. Costs half of what they try to sell at the gym, and much more secure. There's two keys so if you accidentally lock in the key, you can go all the way home to get the spare key.",
        "Beautiful brass lock is much more attractive than its sibling the 141. 4-pin with 3 spools for better anti-pick security than most other Master Locks. I've seen people secure their bicycles with this lock, but I wouldn't try it. It's a small cabinet lock that can only thwart the curious.",
        "Operates well, both key and the locking. Light duty - just to prevent opportunistic theft. Know for a fact that a hammer will open this, but light is what I need."
    ]
}