{
    "entity": "Keyed Padlocks",
    "text": [
        "I purchased these locks for my Stealth trailer. The lock has a small drain hole at the bottom of the lock to let moisture out, but as shown in the picture the trailer requires the locks to be sideways. Since it cannot drain in the sideways position, water collects inside the lock and freezes making it impossible to open the lock with the key. Fortunately nothing inside the lock warped. It was a sunny winter day when I needed to get in the trailer and a bucket of warm water was enough to thaw out the locks. I'm confident this could happen regardless of lock position when cold given how easily water can get inside the lock.",
        "Last summer, someone attempted to break into my drive up storage unit. I purchased this pair because I needed two new locks. Unfortunately one of the locks rusted in two spots within three months of use. I am so bummed! Looks like I am going to have to look into a better lock for outside use.",
        "This is easily the WORST purchase I ever made on Amazon in 15+ years. The lock stopped opening after TWO -- yes TWO -- uses. Amazon was great in processing the return for the lock, but the real reason to stay away from this item is that now I will have to pay a LOCKSMITH to cut off the lock from my storage unit. So this lock will end up costing me way more than the purchase price. So, if/when it stops working, you could be out even more $$$ just to get your lock removed from wherever you were using it!!! The warranty does not cover cost of a locksmith. Be warned.",
        "I needed a lock to secure a Pod and this works perfectly with their system for s fraction of what they charge. It’s sturdy and when locked it is not possible to access the mechanism to cut off the lock.",
        "Locks came as open box items missing keys, so completely unusable. Not only that, but when trying to process return I was notified it would take two weeks, and I would be getting refunded via Amazon gift card. I paid with credit card. Not amused, after wasting 15 minutes on the phone with customer service I gave up. I used to really enjoy Amazon prime, but lately I'm better off stopping at the store where I know I'm actually getting new product.",
        "I purchased this lock to use at CubeSmart self storage in Tucson AZ. It's cheaper than what they sell at the office, while offering the same level of protection. The lock comes with only two keys. I kept one for myself and left one with a classmate, so that he could retrieve my stuff in case I couldn't return to the city. I wish there's a third key that I can give to the storage facility manager for receiving packages. Arizona law prohibits the manager from releasing the key to anyone other than myself, so the second key has to be left with my classmate.",
        "Great lock if you don’t want anyone (including yourself) to ever be able to access your belongings. After two months of it being on the door and being used all of four times, the lock was struggling to open. During my attempts to open it the key broke off in the lock. Feeling like Hercules over here, but pissed off ar this garbage product.",
        "This is quite a sturdy lock. To open, insert the provided key and turn. To lock, you have to use the key. The lock is constructed such that it is very hard to get a pair of bolt cutters over the shackle to cut it. That being said, if what you're attaching your lock to is the weak point, then having a good lock defeats the purpose. It also looks hardened to striking attacks with a hammer . The small opening of the area under the shackel also means it will be hard to get a crowbar in for prying",
        "Took the first lock of the three out of the abominable plastic bubble and immediately and without warning sliced my thumb open on the sharp edge of the lock at the top of of the case which had not been ground down by the manufacturer. After band aid treatment I looked at each lock and found that each one has edges sharp enough to cut you. I will have to grind off those edges before I can use them to prevent future cuts. Be warned. Also, you get three locks but only two keys. I'll have a new key made.",
        "This is a fake replica definitely not a Master Lock don't buy it honestly just go to Home Depot and get a real master lock this is some Chinese crap",
        "This lock is junk. It seized up in cold weather and the flimsy key it came with ended up breaking off inside. I had to use a grinder to cut the lock off my trailer door. Apparently another person just left a review describing the same issue, where water collects and freezes when placed sideways on a cargo trailer door. Not a good lock for use on a cargo trailer.",
        "After a shed with a good (other type) of padlock was silently attacked by a monster with bolt cutters, I really needed an easy solution to outfox the \"bad guys.\" A friend told me that this type of super heavy steel padlock left absolutely (almost) no way for a roving bad guy looking for an easy target to get at it. It's a good but tight fit into my shed's mechanism, but easy enough to remove for access. Nice.",
        "Work very well at storage facilities. Someone tried to cut one off of my space and had no luck.",
        "To update this review, the lock has ceased to function after 9 months of frequent use. The key will no longer turn, lock has been lubricated per masterlock website and still no luck. Will have to try and warranty the lock while purchasing a replacement to keep the trailer locked up. (update to review 07/2018) Masterlock quality to go with a blaylock trailer hitch lock. (review when purchased 10/2017)",
        "The lock has been on my outside storage unit for months through all kinds of rain and no sigh of rust or water in the lock. Good lock, Good price!",
        "The current Master 40 lock is not as refined as the older model (from 10 years ago) and the mechanism does not operate as smoothly as the older lock, but still acceptably. The new and old locks are within .3 oz in weight of each other, with the heavier being the older lock, which appears to have a slightly thicker stainless case, but very close. I will be pleased if the new lock lasts as long as the old lock which is at 10 years without any sign of quitting.",
        "I bought these for my enclosed car trailer. I live in Wisconsin so the only thing I can say bad about them is that they will freeze in the winter if they are not hanging perfectly straight. On my trailer they hang sideways so the water can lay inside the lock. I wish Master Lock would put two more holes on the sides for drainage for this application. Still very good quality lock. I've had another set on my other trailer for over 10 years.",
        "the lock was just like it was advertised. master lock has always had a reputation for quality and this lock performed. It slides easily in and out and fits the holes in the storage unit to make it work for storage facilities. had another cheaper lock on a facility and the unit has broken into twice. they used a saw. this one looks like it will hold up in the weather also. makes me feel more secure",
        "I hate thieves so I welded on some tabs to my roof top tent and roof rack and used this lock. First night out (in the desert) it rained. Headed back the next day and when I went to remove the lock the keyhole was completely frozen, as in break the key off in it if you twisted any harder. I doused it with WD-40 and after a couple minutes and some finagling with the key I was able to get it opened. PS that was the first time in my entire life (50 years) that I used “finagling” in a typed sentence.",
        "Used for a storage unit worked as expected. Recommended lock from the storage location but they were charge 2x this price. Great value!",
        "I have neighbors that broke into my storage unit in the apartment building all the time by breaking my locks, but after I bought this, I haven't had to replace the lock! It's HUGE and fantastic. Love this",
        "Bought these locks to secure 2 shipping containers during move from Florida to Maine. The locks being keyed alike was a big plus since I didn't have to keep track of 2 different sets of keys. Solid and secure locks. Highly recommended.",
        "We used for ou pod containers for our move cross country. Sturdy and perfect for the job. This is the type of lock you need for a storage facility. Had no issues and a plus that you get two locks.",
        "Keyed alike locks were brilliant as we sold two homes and had to declutter for showing and eventual move. This made accessing our Pods seamless, no matter where either of us was, and at final delivery we also had convenience of not matching key to Pod/lock. Would do it all again (minus moving, which is always a drag).",
        "I do not understand the good reviews for this lock. Evidently the quality control must have changed in the last couple of months. Shackle is a poor fit and rattles within the housing. The housing is obviously stamped. This is not a master built quality lock.",
        "Terrific lock for the price! I used this on vacation to lock up the trailer that I was towing. It got some sand in the mechanism, but still worked like a charm - no issues at all. And, it's major sturdy - if somebody wanted to break it off with a sledge hammer, I'm pretty sure they could do it eventually. But the ruckus it would create to pound it off would be enough to catch somebody's attention. Love it - will use it again.",
        "Excellent disk locks all keyed the same perfect for storage lockers and my trailer. The only reason they do not have a 5 star rating is that I needed to lubricate with some garage door oil to make them turn super easy. If you do this before using the locks, you will be pleased with the quality and turn ability of the keys.",
        "This was recommended to me by a storage facility. Super heavy and durable. Harder for people to cut off lockers. I felt very safe with these. Super heavy duty and a couple dollars cheaper on Amazon.",
        "This lock is a perfect fit for my CubeSmart storage locker. I have one of the medium size storage (I believe 10 x 15) so instead of buying a lock there, I ventured online. Come to find out CubeSmart apparently likes the locks as well since they sell them in their facility. The lock itself is heavy, but not too heavy and it feels sturdy and secure. I haven't had any issues with the key or locking and unlocking and I like the lock enough to feel safe and secure about it storing my things. Good buy, great price!",
        "Key broke off in lock on first use. The lock itself may be fine but the key was thin and flimsy. Amazon was fabulous about crediting me for the purchase, but it meant my storage unit wasn't secured for a day while I purchased a new one at a brick-and-mortar. As for the lock design, it did fit the contraption on my storage unit very well. It took the maintenance guy a good bit of elbow grease and a grinder to get it off, so hopefully thieves wouldn't put in that much effort. If the key quality improves, this would be a good purchase.",
        "I purchased this lock for our PODS storage unit because the Sales Rep stated these were the most secure. When they delivered our PODS, the delivery guy indicated this was the best lock on the market because bolt cutters can't be used to pry open. The keys were easy to use and it has served its purpose for us. I hope the Sales Rep and Delivery Guy are both right and we can get our items out of storage without incident. Not sure if the price was more or less expensive than local stores, but Amazon Prime shipped it to and that removes the hassle of me driving to the store.",
        "Sturdy lock that I use for my shed. I wanted something that would pose a challenge to anyone trying to get into my shed. Someone tried to break in and this lock held up well. The would be thief was unsuccessful. The shape makes it hard for someone to cut. It has a good weight to it and does not feel cheap.",
        "idea is good but the lock stock inside and wont move , specially if you try to lock it in tight hood , even a little pressure stops it , the lock can be moved back and force by hand I wont recommend it as main lock",
        "Unless they are hanging straight down, these locks fill with water and rust.",
        "They get water in them very easily. It’s very difficult to turn the key to unlock them. I broke a key off the first time. Don’t buy",
        "No one is going to cut these off. Very good design. The only thing to mention is, the bolt that goes through your latch is thicker than most locks so you will need a larger hole to be able to use this.",
        "Don't let the nice stainless steel shroud fool you - if you are going to use this in a wet location you need to choose something else. The internals on the lock rust and freeze it shut. I purchased a 3-pack to secure some cargo trailers and have already had to cut one off and the other two are barely functional.",
        "Locks are good just didn’t function real well right out of the box. I put a few drops of 3 in 1 oil inside them and made lots of difference. Now they are easy to turn key and latch",
        "Solid and great for storage lockers. I needed a lock for my Public Storage locker. They provide locks as part of their monthly fee, but we added this product to ease any paranoia. The positioning of the actual lock makes it slightly more difficult for a bolt cutter, although I'm sure anything is possible.",
        "Just like the ones the storage units sell you. Both locks are keyed the same. Comes w only 1 key per lock, which is the only downside.",
        "Bought this for Uhaul truck. Doesn’t fit the stupid truck lock hole though. Lock itself didn’t seem very secure but seemed to function well enough. Hopefully will find a use for it elsewhere.",
        "These Masterlock Discus padlock design locks are great to deter criminals. They are made of durable steel and based on design doesnt facilitate bull cutter intrusion and destruction. Great price and effective. Only issue might be getting your chain to fit in the locks opening and locking it in.",
        "Well made and sturdy by a brand that doesn't dissappoints. This lock should last a real long time. Good purchase, perfect for storage units inside or outside environments.",
        "Work well however will rust if exposed to the elements",
        "I purchased this lock for an interior climate controlled storage unit while I was traveling and in between apartments. I felt safe with the lock on my storage unit and found it easy to use. Occasionally I have to give the key a slight jiggle to get the latch to move, but overall it works just fine and offers decent security. Some reviewers seem to have issues for regular use/outdoor use. For the price point it seems great for a storage unit you don't access to frequently and don't need climate control. The price is reasonable for the protection and function.",
        "They do what they are supposed to. They lock and are well built.",
        "These are great. One caution though, keep them lubed a little with some spray silicone if you're going to use them in an outdoor setting and they'll keep working forever. (or use WD-40). They're Master Locks. Say no more.",
        "The key opens the lock. Needed for a storage unit. Nobody cut the lock off and the key opened the lock each time I opened the storage unit. Perfect track record!",
        "These were perfect for our uhaul pods that were on our office lot for a month then shipped from Chicago to San Diego! They were in snow and rain yet didn't rust!",
        "Look like sturdy locks to me. I own and rent out self storage units and that is what I use these for.",
        "Used these on my uhaul storage pod. Good security fit great, I feel like the lock could be compromised given the right tools thus 4 Stars. Manufacturing was rough with welds and conjunctions.",
        "The locks are “okay”. Bit smaller than I expected. Very disappointed that I was shipped a product that had the packaging cut open with the blister pack cut open on two sides! See pictures.",
        "I needed to put my household goods into storage for a month and the storage place wanted to charge an arm and a leg - this is just what I needed for a fair price!",
        "I saw these being sold at my storage unit for triple the price. I figured they had to be cheaper online. They were. It works fine. No complaints.",
        "Very frustrating to be stressing with a lock that is so hard to open. I've three storage sheds with u locks. Never had this problem with the Brinks. $1 or $2 cheaper than the good locks. The lower price is unimportant because of the time it takes to open it.",
        "Perfect for storage unit since the lock is designed so there is very little room for anyone to try and cut lock and break in. About 75% of every storage unit at our place uses these locks!",
        "These locks are very good quality and virtually tamper proof. Yes, they can be taken off but if someone goes through the effort of getting this bad boy off, they almost deserve congratulations. Heavy and made to last forever, a good purchase.",
        "Unfortunately this did not work for the storage unit I rented which is a standard unit. It was just a tad too small unfortunately even though it looks just like the ones they sell:/",
        "Got these to replace some slide pattern locks that would not work after a rain. These don't mind the rain one bit and work exactly like they are supposed to.",
        "I recently rented a storage unit and was encouraged to purchase an onsite lock to secure my rental. I did want to do my due diligence however and began sourcing prices for padlocks. Almost immediately I realized that this deal was much better than any other I had seen around, and about 1/2 of the price of what the rental place wanted to charge me. This lock is very well made, and included 2 keys. I have used this style of lock on two separate rental units and this leads me to believe that this style of lock will work for most units. I have no complaints about this lock.",
        "I use this all the time to lock up my longboard on campus. Works well and is very secure",
        "These disk locks are ok. I used ti as a back up on an outside storage unit to slow anyone done or make it not worth it to break in as it was 1 of 2 locks on the unit. It held up well over the winter and did not get terribly rusty. Turning the lock cylinder was a little rough, but it did sit outside all winter on the side of the building that gets the brunt of the weather. I would never use this lock as a primary the body of it is thin and not very hard. With the right tool it is easily defeated. Excellent 2nd lock though.",
        "Ordered them, got them, and now they're just sitting in the garage collecting dust. I'll eventually use them someday",
        "Well I got these for a outside building and they are rusting to the point I can not unlock them . Now they may have been something about them not being for outside but they rusted",
        "Used it for my PODS containers. The locking bar is very close to the lock itself, thus making it nearly impossible to bolt cut it off...which is perfect against would be thieves. I’m happy with them.",
        "They had fallen out of the packaging during shipping, but the cardboard box kept them safe inside. Can't go wrong with these locks though. We shall see in the long run.",
        "I bought this for a pod. Once fully packed, the lock worked well. When the pod was received however, there was a dent on the lock and we couldn't fully open the lock. I didn't think the lock itself could get dented, but it did.",
        "Sturdy locks but I was able to pick in like 5 sec. With a light touch my set could be zipped open. A rake made super short work.",
        "Master Lock is the standard for locks and this is no different. Perfect for storage lockers, solid strength and easy open / close with a key.",
        "Bought this for my work locker, unfortunately it doesnt fit, but I can still use it for plenty of other things that require a lock and key.",
        "Smooth, strong, I’m a little scared the key is so thin I might break it one day, but I’m very happy with the lock",
        "I bought this for my storage unit and It has been on my storage unit since August 2018. And there is already rust on it 5 months later. It still works so I can’t complain. It is definitely exposed daily to weather elements.",
        "Two really cheap high quality padlocks. Was just what I needed at a really great price. I would highly recommend these locks for someone who needs a good lock at a good price",
        "I have these on my enclosed trailer and they are very heavy duty. The locks collect rain if they are secured with the lock portion sideways, but doesn't seem to be a problem.",
        "Great design to use with our baylock 5th wheel trailer lock. Feels sturdy and secure.",
        "I use this to lock up my shed. I predict someone would just rip off the doors before they attempted cutting off this lock. I know a lot of people use it for storage units too.",
        "Rust resistance and sturdy this lock is everything you need for a outdoor gate lock!!",
        "This packet allows me to secure my entire trailer and have one key to open them all. The type of lock lets me feel better that people can’t just use a pair of bolt cutters to get them off quickly.",
        "This isn’t the greatest lock. We thought this style might work better than the standard style but it’s just adequate.",
        "these are still difficult to open, slightly less to close despite oiling them. Kind of disappointed.",
        "Great product, bought for enclosed trailer and it was perfect functionality and price",
        "This is fantastic for storage units. We had a lock get cut off. Replaced it with this and no more issues",
        "Not the best locks I’ve had compared to brinks but they work pretty well.",
        "I feel like this lock would be extra had for anyone trying to cut it off.",
        "Looks strong and a fine deterrent to thieves. Makes us look well fortified",
        "Great price, very high quality. I sprayed them down inside and out iwith light oil, since they are used on the back of the boat.",
        "Heavy Duty Locks. Sometimes I have to jiggle key to open Not a big deal.",
        "It’s a good lock. Being keyed the same is a nice feature. I’ve only one key to carry.",
        "Using lock to secure a trailer lock. No problems thus far. Easy to use.",
        "I'm going to need to use a storage facility soon to store merchandise, and I've noticed this style of lock is sold at those facilities. I saw them here for such a great price, so I grabbed a couple. I couldn't be more satisfied with these locks. The shielded shackle is a great feature, and I love the size and weight of the locks.",
        "Bought this and a tow chain as a bike lock. My bike ain't going anywhere!",
        "Big bad ass lock. I had to drill out the hole onnmy garage to make it fit because it so heavy duty",
        "These are just as described, I am using them on my storage unit and the uhaul I will be renting",
        "Seem like good locks. Not the most heavy duty but good. The problem is that the body of the lock fills up with water when it rains as these are on my tool trailer. Not an issue but winter is coming. I'm not going to be thawing locks out daily to get into my trailer so they will be replaced.",
        "Sadly, this was junk. The key broke off in the lock on the first day of use, so I can't recommend it. And the lock did not survive removal, so I couldn't return it. Somewhat surprised since Master Lock is usually a solid brand, but I can't recommend this lock.",
        "Sturdy and strong. Fit the UHaul truck I got. Easy to open and heavy duty.",
        "Corroded after only about 2 years in an exposed location.",
        "These locks feel like there coming apart when you open and close. Gonna need to have them send me out 2 more and if there the same, I will return them and back to the big box store. Its almost like there blems! Have 4 others that are fine from Lowe's. These 2 locks concern me!",
        "Works really well, I used this on a storage unit. Saved me a ton to buy it from amazon rather than the storage company themselves.",
        "as described, quick delivery, easy to use. very sturdy. work great with \"The Collar\" Trailer Hitch Lock for Bulldog-style Couplers"
    ]
}