{
    "entity": "Keyed Padlocks",
    "text": [
        "Takes seconds to open this lock even with an upside-down pick. If you’re protecting more than a pair of socks, you need to get a better lock.",
        "It didn’t work after one week using, really embarrassing. Cheap doesn’t mean quality. I’m so disappointed with this masterlock.",
        "This is a revised review. I initially said that this was an okay lock, but that is no longer my opinion of it. After opening and closing it a maximum of 6 times in a month, it's broken. Pretty much a piece of junk.",
        "After the embarrassing experience of having to get my gym lock cut open after forgetting my combination, I opted for one with a key. Best decision I’ve ever made. I keep one key in my car just in case and I keep the other in the tiny pocket that most of my leggings have. They are not large so most of the time I forget I’m carrying it with me, and I don’t have to worry about not being able to get my lock open.",
        "It's an okay lock for the price if you're using it to keep a kid out of a locker or something of that nature. Spend the extra money and get a heavy duty lock if you're protecting something of high value. Doubt this will hold up well outside",
        "I love this lock :) I take it to the gym and it comes with 2 keys as well. The color is cute too and I can point mine out since everyone kind of has the same lock. Lucky I bought this one and is a different color other than gold, silver or black.",
        "I purchased this security lock to secure my picnic bench underneath my tree because I have an open yard. I am pleased with the heavy duty, quality of the lock. I have used the Master Lock brand for years. I anticipate this lock lasting for years to come, just as my other ones that I am still using. I am using this lock with BV 15ft security rope, also excellent quality (see picuture) and available on Amazon. I would highly recommend this lock and the security rope. Overall, this is a 5-star product for quality and durability.",
        "Which is introductory lockpicking. It is no crowning achievement that this is the first \"real\" lock I've picked. The security is garbage.",
        "This lock sucks! It is easy to open and provides no security. The lock is not hardened and can be cut with some miniature bolt cutters. The pin assembly is easily fooled and can be picked with a toothpick.",
        "I've been following Bosnianbill and Lockpickinglawyer on YouTube for a few months now, so I have become very weary about what makes an effective piece of lock hardware. After the countless warnings about depending on the Master brand for security, I immediately upgraded the lock on my storage unit to a Medeco. I feel like I'm drawing attention to my unit, because every other unit is using Master locks! Anyway, I got this because it similar from that of the common No 5's. which I admittedly had on my storage unit at first. Very easy to pick and I am at the point I will upgrade to a Master Model 911 or American Padlock, for more of a challenge.",
        "Great quality lock that comes with 2 large sized master keys. The function of the lock itself feels really good when unlocking it kinda' springs open, and when locking it gives you a very secure metal clanking feeling saying its good to go leaving you feeling confident that it open malfunction somehow and reopen. I personally using it for a small ammo can lock-box so its not a heavy duty, commercial/industrial type of pad lock. But it would be great for things like locking up your small gates, gym-lockers, chastity belts, tool-box's, etc.",
        "This is a beautifully blue, secure, sturdy lock and it comes with two keys (also blue). The lock is not only pretty, but also super-effective and sufficient for locking up our outdoor storage shed for security purposes. It would also work on a regular storage shed or even as a heavy-duty lock for a locker or something similar. I like how the keys are also blue as it helps to differentiate them from the other keys that I keep on my key ring. It works well and seems (so far) to stand up to any bad weather such as rain or snow quite nicely. I think this lock is great and will pas the test of time. We'll see...!",
        "Of the less-secure Master Locks, this one is probably best for a beginning picker to practice on. Manufacturing tolerances appear to be better than in the notorious Master Lock #3, so a picker can get predictable behavior. It has no security pins (just standard), which is to be expected for less-expensive locks. Security pins are generally serrated or spools, and they are designed to make life difficult for pickers. This probably makes no difference for practical applications, since thieves are lazy. They don't bother to learn lockpicking (fortunately), and I have never heard of a lock being picked by a thief.",
        "Nice small sturdy lock. I use it mostly just to keep a locker full of my things safe at my gym. The mechanisms work smoothly and the key inserts and turns nicely. Feels like it would give a thief trouble if they tried getting through it.",
        "Exactly what I was expecting. Needed something lightweight to lock pistol & ammo cases for trips to/from the range. These little aluminum locks cover my specific bases quite well. Only withholding a 5th star because obviously these are not going to offer Fort Knox-like security, and this should really not be expected of an aluminum padlock. But they work very well while being lightweight enough to not make a portable load any heavier than it has to be. It's great that they're available in multiple colors with matching key handles, so there's no fumbling around to find the right key. I may buy more of them, and would definitely recommend this product.",
        "When I was in high school, they always made us use these terrible combination Gym lockers where getting into your locker was like cracking a safe at ft. knox. I vowed that I'd never put up with awful locks again. Now that I'm a big boy, I bring this padlock to the gym and it makes life easier.",
        "This lock is a disaster, it would be fine for a very basic practice lock for lock-picking, but not for ANYTHING else. Takes seconds to pick even for a beginner, heck you can use the tension wrench to pick it open.",
        "It was much smaller than I expected, especially from a Master lock. I tried to get an idea by the measurements given, but they were very confusing. It's inbetween a mini lock and a small size lock. The keys are cheaply made... The key already wiggles in the light plastic base. I could probably pull off the plastic or break it in half if I bend the key and base. The blue plastic surrounding the lock, is made aof an extremely thin and cheap material, that if dropped may shatter. The locking mechanism once locked isn't stable. I think I could break it with just pulling on it with my fingers. It definitely wasn't worth the price I paid.",
        "Although this is a well built solid lock.... I'm a beginner in lockpicking, I bought this to practice. First, let me inform you this is the recommended lock for novice lockpickers to practice. As a beginner I can pick this lock in 10 seconds 9/10 times and I'm still very bad at picking. So this is either bought as a practice lock for beginners in lockpicking or you are using this lock purely to create an illusion of security.",
        "I've had locks that seize up after only a couple months of outdoor activity. I'm happy to say this smoothly operates after 6 months in the elements. It was slightly stiff when I got it but that's expected and some 3-in-1 oil fixed that right away. I especially like that the keys are color coded. It makes it easy to manage multiple locks. It would be easy to cut with boltcutters; I have no doubt of that. But that's expected at this price point. For a low-security door (such as a shed) these are perfect.",
        "Picked up a few of these to practice lock picking (which I’m new to) since they were cheap and Masterlock is notorious for having easy to defeat cylinders. They are perfectly easy enough for a beginner like me, and are helping me get the feel for the tumblers and understand when I’ve got the pins in place. The 4 pin design makes its easy and fun to quickly pick one open, followed by another and another for some time in quick succession, and feels quite satisfying. I would never use these to secure anything I really cared about, but they’re a lot of fun to pick.",
        "I bought this specifically because it stated for outdoor use..well after a few days its a pain to lock. Not sure what exactly happened to it, if the weather played a factor in it, but I'll be staying away from this brand.",
        "This lock is insecure and can easily be lockpicked by amateurs to lockpicking. Within 1 minute of trying I was able to use 0 lockpicking skill to open it. I stuck 2 random lockpicking tools in, from a cheap kit, and then proceeded to shake it unskillfully and opened it. That's how easy it is to open.",
        "It's a small unit, but it works fine for my needs. Just enough of a deterrent that only people who REALLY want to steal from me can. It does a great job keeping my lazy nearly worthless bro in law from using my lawnmower without my permission while I am gone at work. HAHA you fat loser! Won't get a job eh? Just want to smoke pot and get drunk all day eh? Then you can clip your grass with scissors you fat lazy man child! I like the keys for this lock. Pretty fancy.",
        "Lovely little lock. We placed it on a bridge in Paris to announce our daughter while I was pregnant. I love that it came with two keys, one was tossed into the river and one is in the baby's jewelry box.",
        "I had this lock on my outdoor shed and it didn't last a week--it was ruined after one rainstorm. The key would not turn at all and I had to use WD-40 and my hammer to get it open. It would probably work fine for an indoor locker, but don't trust it outside if it's going to rain or snow.",
        "I bought this as a spare thinking this lock was exactly like the one I'm already using. My original lock is sturdy, solid, and has a smooth key operation. I couldn't even get the keys all the way into the opening on this lock, therefore cannot use it at all. It's cheaply made, lightweight, and a piece of useless junk that's going in the trash as the return window is closed.",
        "This product is well made and priced very reasonable. The key inserts easily and unlocks smoothly. Also, the blue color makes it stand out so I can identify my locker at work quickly. I would definitely recommend this lock. I started to get a combo lock b/c I lose stuff and was afraid of losing key; however, it comes with 2 keys so I put one in a safe place and the other I have on a lanyard I keep around my neck.",
        "Bought this lock because it LOOKED like my last identical Master lock I lost. However..........removed lock from adult proof packaging and immediately noticed a difference in the weight of the item and how the outside felt. I was rewarded with confirmation of my suspicion because it is NOT a metal lock exterior, it is PLASTIC! That’s why it is lighter and does not feel like metal, because it is NOT metal. Since I’ve been fooled once now, I wonder how much of it is really Master and not Bejing simulation?? Will follow this with a call tomorrow and see what’s up.",
        "I bought this lock for my wife to use at the gym. Even though almost any padlock can be picked or shimmed in a short amount of time.... A keyed one like this with a double lock detent, is a bit more difficult than a combo lock, they are so easy to open it’s ridiculous! This should work fine for it’s purpose.",
        "Cheap in price and materials. I wouldn't entirely put my faith on this lock to prevent theft, but it's enough to detour and make someone think twice. It's cheaply made and does the job, but nothing impressive about it. Quality locks by MASTER isn't what it use to be. The price you cannot complain too much, but it's not an impressive lock with it's weight and material construction. It does the job.",
        "This lock to me is cheap and not solid at all.. only bought to test the security of it and it failed everything",
        "Buyer beware these locks are mass-produced which means there are hundreds of thousands of people that all have the same key to the same lock there is a 6/10 chance that someone else has the same exact key to your lock.",
        "See, I'm conflicted. I bought this as my first lockpick practice lock. I've never picked a lock before and armed with a few youtube videos and cheap Chinese lockpicks, I got this open in 1 minute 33 seconds. First try. If I \"rake\" it, takes me 10 seconds. So, 3 stars as a practice lock, but 1 star as an actual lock.",
        "I purchased this to use on my locker at work. The lock is well-built and sturdy enough to keep your item secure and the key is small enough to keep on a badge reel which is very convenient considering I only use it at work. For the price it's really hard to beat.",
        "Great that the keys & lock are the same color. I live in an area that we have multiple gate openings & locks. So the color match makes it easy to find the right key at a glance instead of fumbling with a key chain looking for the right one. Only think I could see improve is to provide 4 keys instead of 2. I had to have 2 more made at the local Home depot. Not a big concern since they have the blanks, but I would have liked to have 4 provided.",
        "I was looking for a lock that had some padding as to not beat up the paint on my trailer toolbox from metal-to-metal contact. This lock does the trick. The only drawback is the coded color plastic cap on the key makes for a very tight keyring and too much for the pants pocket when you have multiple keys like this one.",
        "Pros: light Cons: Weak, can be locked without key inserted, keys are bulky, keys fit other locks of this type (of which I've discovered there are many at my gym). All of us can unlock each other's lockers. Lame.",
        "I bought these for our garbage cans out back at my office because the other ones I bought were freezing shut, but since these have a key they open super easy & are sturdy when locked. People kept using our garbage/recycling bins, so we got locking ones & I use this to lock them. Got black for Trash & blue for Recycle so nice I can tell the locks apart easy as well.",
        "I bought this lock for the brand name. I've been using this brand since I was a kid in school, I trust the brand to make safe, working locks. This lock is perfect. Don't lose your keys ;) You get two of them. As advertised, 5/5, Would recommend.",
        "Not too much you can say about a lot -- it does the job. I like the pretty pink color, and I use it for the lockers at the gym. Easier to just hang a key around my neck than try to remember a combination. I guess it is a sign of old age because sometimes I even blank out with the Wordlock-type combinations -- cannot remember what clever word I chose! Duh. LOL Anyway, this is a pretty and inexpensive way to keep my things safe while I work out, or at least as safe as they can be in such a situation.",
        "Excellent service & fast delivery! Great product for my use, a very low risk application. It’s on a locking cabinet in my basement storage locker. Nobody is ever gonna even go in there, but it has a lockable cabinet, & me, being highly anal retentive, just have to get a lock for it, even though there’s little in it.",
        "The spring stopped working after a while, so you have pull down on it instead of having the clasp pop up, but it still works. It is easy to lock, and key still works. As for as security, it does the job, but the bolt size would be way to cut with a bolt cutter, and a bit thinner than expected. But it deters about as well as any other lock really, and is a good price.",
        "Bought this lock for my 6 year old son’s treasure chest to keep his 2 sisters out of it. Other than that I wouldn’t trust it to lock much. Couple of smacks with a good hammer I feel like it would break apart. But for locking up my kids toy treasure chest it does the job! Just don’t expect it to secure much more than that!",
        "After One week my key would not go into lock and therefore I can’t unlock. I called customer support and was told I’ll just have cut it off and the lock isn’t for outside (I have it on a gate for my backyard). This should have been advertised and I think is just an excuse for a defective product because our weather has been mild. I’ll have to pay someone now to remove this defective crap🤬",
        "Using this outside is a mistake. Mostly my fault for not looking at the features. A 10 year-old could break it with a rock. Whatever trinket inside they designed this to protect could probably be safe until the culprit makes enough noise for someone to hear them. But it's not strong enough to keep anyone out.",
        "I use this lock for my locker at work. I like that it comes with 2 keys & is available in a color other than gold/silver & the keys match in color. I’m pleased overall. Doesn’t feel super super sturdy but good quality for the cost and effective at its function.",
        "I purchased this lock to go on my back fence to keep kids and burglars from going into my backyard and it fit perfectly. I was skeptical that it might be too big to fit you know without actually being able to see it before purchasing. But yep, it was perfect fit.",
        "This product accurately list its security at 4/10 and I'd agree it can be opened w comb picks, racked w no skill and spp'd in seconds. But if its securing something in plain sight and of little value I'd say its okay. It is a good lock for the price. But you get what you pay for",
        "I don't think it wasn't meant for outdoor use, it first it worked great but after like 3 months it started to become very very difficult to lock. I used to to lock a chain link fence with chain because every once in a blue while I get amazon delivers to my mudroom which is inside a closed fence. I didn't like that during a pandemic",
        "Thought it would be good. Maybe its the one I got but since first time I locked it and opened it the key always gets stuck in the lock and I have a hard time removing it. This happe ed numerous times. I was not expecting this. Will need a new lock now. Wish i could return this after opening the packaging it was in. Poor quality lock",
        "It's more likely a thief will cut the lock than pick it, but - this thing doesn't provide much (ANY) resistance to picking. Good news for me, I specifically bought this lock to teach a 5 year old to manipulate locks. If that's your aim - perfect!",
        "I have heard that my local gym has an issue with locker room theft, so I needed a strong lock that I could easily spot. This lock is super secure, and the color makes it easy for me to remember which locker is mine. The keys are also pink, which makes them easy to spot inside my gym bag. Overall, this lock is fantastic and I would definitely suggest it!",
        "I love this lock! It has a very cute, bright color and the keys work very well to easily open it. Having the pink boarder on the keys make them easy to find on a ring with other keys. I am completely satisfied with this purchase. I put it on a locker at work, and it is the perfect fit. It is skinny, so it does not feel too bulky and also the top is long enough that I can easily open and close it when I lock or unlock it.",
        "These are very thin locks that could easily be broken if somebody wanted to force their way in to what you are protecting with them. That being said, for minor tasks they're an excellent deterrent. Tool boxes, small lockers, lock boxes. One of the two keys provided doesn't function with half of the locks, while the other key works perfectly with every lock.",
        "DO NOT BUY. I just received my first set of lock picks today (i.e., I am a total n00b) and was able to open this thing in under 15 seconds. I didn't even have to try very hard. Almost felt like I did it by accident, but I can do it consistently in under 15 seconds without raking.",
        "I knew this lock was insecure. I ordered it specifically to learn lock picking as a hobby. Unfortunately this lock is so easy to pick I had it open within under 5 minutes of trying, despite never having used a lock pick before so I think that, even as an education tool, its usefulness is pretty limited. Obviously you shouldn't use this lock to actually lock up anything.",
        "Even non-masters of locks will appreciate this simple, sturdy key lock from Master...Lock. Four stars because it just works (it keeps my things in the gym locker room from being stolen! I'm looking at you, guy who stole my ratty ten-year old hoody!) and an extra star because it comes in tasteful, vibrant royal blue. Comes with two keys, perfect for the kind of person who likes to share lock keys with someone else or frequently loses keys to locks. CAUTION: Not recommended for protecting high security facilities or locking ancient evils in crates.",
        "After about a year and a half of having this on my shed it was getting really difficult to turn the key to open, and I needed to really push hard from the top to close. If you need a short-term outdoor lock this will work fine, but anything over a year I'd recommend you look elsewhere",
        "I bought this lock to mess around with. I taught myself to pick a starter lock a couple weeks back, and within 2 minutes of getting this lock, I was able to pick it. I'm by no means an expert, I'm a beginner. This lock is _not_ secure",
        "Very easy to pick. Bought it to practice lock picking and was able to do so pretty quickly with no prior experience.",
        "I use this for my college gym locker. It’s great and does the job. It’s very easy to use & comes with a spare key as well. I always tug it after I lock it so it’s pretty sturdy but I have never tugged with full force so I don’t know how sturdy this is...",
        "Perfect fit for our shed. Definitely would be easy to cut but we just needed it to keep the doors close. The lock loop isn’t too long which is nice. And came with two keys.",
        "It works well for something small around the house. Wouldn't use it for anything valuable as it is pretty tiny. The locking mechanism works smoothly and it is easy to lock and unlock with the keys.",
        "This is a great lock. I much prefer it over the one that I had in high school, which was a combination lock. So far this has been super useful for work, and with the extra key I was able to give it to the office in case I lost my own. It's durable and doesn't seem to scratch up the locker at all.",
        "It’s cheap and gets the job done. It does not weather well. I use it to lock my shed and it is a pain to open and close. Only reason for two stars is because I added some wd40 to the key and lock itself and it seemed to help. We’ll see how long it lasts.",
        "Very small! Easy to cut through it break. But I mean it is a small lock. If that's what your looking for for something maybe inside vs say a garage door or fence lock... Get a bigger one!",
        "Let's be honest if you want a great lock avoid a key lock. I use this at my employee break room with a camera in it so I am not too worried. Honestly just use this as a way to mark where my jacket and snacks are and for that it's great.",
        "Stopped work after got wet, impossible to insert the metal piece inside, must have got rusted.",
        "Using this as lock for the lockers at work and so far has been a great lock the key easy to keep track of and the price was right. This is not going to stand up to anyone with snippets but it's a honest lock not one meant to stop a determine thief.",
        "Great quality and very strong. You will never go wrong with master. Perfect size. Keys are coming with rubber around. Hard to lose, easy to keep safe...",
        "Not that there is anything wrong with; I should have paid more attention to the size. I bought this for my big shed and it's thin enough that I could cut it with my bolt cutters fairly easy. I'll use if for something else and buy a larger size Master Lock.",
        "I use this at the local climbing gym where people often just leave their stuff in open cubbies by the walls so it's not about to be picked there. But apparently it can be picked very easily. So use it to keep your kid out of your stash of sex toys, not thieves from your gold.",
        "Bought this for locking up my big bag at the gym. Works great but for me I had to make a habit of locking it with the key in the lock. I'm the forgetful type and would probably lock my keys inside. That would be embarrassing so make sure to lock it with the keys outside the lock then you'll be in good shape.",
        "I brought this lock for the gym works well for what I needed it for, lock open and closes easy I like that its in blue that way I can recognize my locker at the gym, I will buy again.",
        "I could not easily find this on the local level. This brand is one that even elders in my family use. Fantastic purchase, high quality and trusted. I feel better about having my storage unit secured with this one.",
        "Bought the lock for school so I could easily find my locker. It is not bright and cute like the picture at all. More like a dulled red. Disappointed. Only gave it two stars as I'm sure it will function as a lock I just haven't tried it yet.",
        "Works great just what I would expect from master lock. It is easy to use and very simple to just without a key and unlock something. I’m sure that someone could probably break the lock if they really wanted to get in but at least it is easier than trying to remember a combination.",
        "Pretty sure someone with a hammer could come along and break it but if it's somewhere inside of another locked thing it will work great",
        "Bought for my work locker and it works great. Only downside is it’s so popular it looks like my coworkers locks and we get mixed up sometimes. Key is small enough to clip to my work badge so I don’t loose it. Good for a gym or work locker but wouldn’t recommend for heavy duty or outdoor use. I could probably snip it easily with bolt cutters.",
        "I needed a lock with a key- and this one does the trick. Truth be told- I didn't want a lock with the numbers because I can't see the numbers with out my glasses on. I use this lock at the pool (where of course I don't have my glasses on). And I liked that it was pink- it pops out when looking at all the other lockers with silver locks.",
        "I needed something that was easy to unlock in the dark, and virtually with one hand. This item does both. The key is short and stubby, which allows me to be able to insert with one hand in the darkness. The mechanism turns smoothly and easily.",
        "This lock is perfect for my need. It's very light weight and dependable. This lock is good for gym lockers, lunch boxes, small tool boxes. If you are looking for a heavy duty, weather resistant lock, this isn't it.",
        "Haven't used them yet due to the c word but I was planning on using them to put a lock on a hatch on my solarium door. They're locks not much else to say",
        "Does what it's designed for! It's not priced or designed for high security. Typical locker it's perfect. So someone will move onto the locker that's unlocked. Remember locks are just to help keep out the honest.",
        "Needed a lock when I joined the Livestrong program at the YMCA for the lockers. Opted for this rather than hiding a combination lock in public - not that it's usually even necessary, not really in close quarters, but hey just easy this way. Works fine, no problems so far.",
        "Nice little lock for lockers at work. Great to keep an honest person honest. Not sure I would use it for something robust like a gate lock but that’s not why I bought this one.",
        "Exactly what I needed to secure my work locker. Reminds me of when I had this exact lock on my middle school locker 11 years ago. Sadly, that lock lived a short life as I forgot my key at home one day and it had to be snipped off so I could access my school books. Hoping I won’t lose the keys this time!",
        "Used this lock for my husband's work locker. He liked it so much, we ordered another to have on hand around the house.",
        "I got this lock to learn lock picking as a hobby. It was a great beginner lock for that. But if you want this lock to actually secure your valuables I wouldn’t suggest it. It was the first non clear lock I opened and it was super easy. So great for beginner lock pickers. Terrible for security.",
        "I use this lock for an outdoor storage trunk, but I wouldn't trust it for security. I was able to pick the lock fairly easily and quickly with a basic lockpick kit, and I never use my lockpicks. It was cheap (kinda) and basically works.",
        "This is like a feather and, aside from it arriving damaged, (I returned it) it's so cheap that what's the point having a lock that is so poorly made?",
        "If you are thinking of buying this lock to secure your valuables, think again. This is quite possibly the easiest lock to pick on the market. It's a pretty cute lock.....that opens for others waaaaaay too easily.",
        "This lock is easy to use and fairly sturdy. I would not use it to protect the Mona Lisa or anything particularly important; however, it does a very good job protecting my college art locker. The keys slide in smoothly and turn easily so the lock pops right open. The two keys are ideal because I can keep one in my backpack and one on my key ring as a back up. It's been banged around quite a bit and still works perfectly! This is a great product for those of us who absolutely cannot seem to remember the combination to other locks.",
        "This replaced an old one that jammed after too much time outside in the sun and rain. It was faster to add it to an order than to go to stores and look for one--lazy.",
        "Love Lock! Yeah this was bought as decor to hang out in the world. It's a Master so rock solid and the color coded keys (2) would make it easy if you hand different locks for different uses. But like I said, bought this to hang outside never to be opened. Hopeless romantic...",
        "I like the blue and the rubber on the key. The lock is perfect, exactly what I am looking for. There are 2 keys included. Very happy",
        "I use these locks for my sheds in the backyard and for the gate in my front yard. I like that there are different colors since I color coordinate them so I know which key goes to which lock.",
        "Good size lock. Not very strong, and it is wrap by plastic. It can be cut by a large cutter, so don't use it for very expensive items. Over all, it is a good lock for a gym locker or tool door at your back yard.",
        "This key is exactly as stated. Works well and its easy to use. This lock is as secure as it states; I wouldn't be putting it on anything that you're paranoid of someone stealing but it's perfect for my shed that hold few valuables."
    ]
}