{
    "entity": "Wine Glasses",
    "text": [
        "I've had these glasses for a couple years. I really like them. They hold up well in the dishwasher and the stems tend not to break if you bump them on the edge of a granite countertop. Honestly, we have broken a few, but sh!t happens. The thing I like the most is the thin lip to the glass. Thick lips, or edges of any glasses or cups can annoy. I found out about these glasses when eating at a local, high end restaurant where these are used. I hope this helps!",
        "These are marvelous and will be our wine glasses for as long as Schott makes them. But we may not have to buy them again because they DON'T BREAK! The 25 ounce size is perfect for all wines -- great for enjoying the nose but not insanely big. Several times I have accidentally banged these against our stone counter edge taking them out of the dishwasher - no other wine glass would withstand it. Otherwise, they're beautiful, pretty close to lead crystal in appearance but without the weight. This is an amazing innovation.",
        "Gorgeous glasses, very high quality. I have other Schott Zwiesel glasses, and they are not only beautiful, but extremely resistant. They fell from counters, they were hit by cutting boards (!), and not a single scratch in any of them. They also have a very thin rim, typical in crystal. I strongly recommend them.",
        "I wanted 12 of these and ordered 6 due to some of the reviews indicating poor quality. I am familiar with Schott Zweisel and was surprised at the negative comments. Well these glasses are great. The feel good - nice and light - and look good as well. I accidentally knocked one over on a glass shelf and it didn't break. So it seems pretty sturdy. I will be ordering the next set of 6 right away!",
        "I've worked in the restaurant and wine industry for 12+ years so I've had every glass known to man, all Riedel types, Zalto Denk'art, etc...these are the best glasses for the money. I have the champagne, red, white, and stemless...they are perfectly weighted, crystal clear, incredibly hard to break, and wash beautifully in the dishwasher. Wish the red and white bowl sizes were a little more differentiated...they are close in size. When they do break, they explode...I mean EXPLODE. You won't believe where you'll find glass the next day. But they are well worth it.",
        "I have several of their products and overall I am happy. The champagne flutes are 4 star at best. There is a noticeable seam on the stem. The thickness is medium, not real thin but not too heavy. I am confident that they are durable based on previous experience. BUT, there remind me more of what I would get at a hotel catered event than fine crystal. If you are looking for fine crystal, you will need to look farther. If you want reasonable price and utilitarian, these probably meet your needs.",
        "I do like the size and shape of the claret burgundy glasses. They are perfect for swirling, smelling and tasting your wine. They feel elegant and you’ll be proud to pull them out for company. That said, they are extremely fragile as others have already mentioned. I have broken them at the rim and even the stem, usually while washing them. I don’t wash them in the dishwasher, always by hand. We aren’t exactly rough on them. I have one glass remaining from my first set and had to purchase another. Although I like the experience of drinking from them, I don’t think I will be buying them again.",
        "I like them a lot as far as tasting wine, they are perfect for almost all types of wine, however, I think it's important to point out that they are not unbreakable... In fact I bought these on October 13th and it is now December 11th and I have one glass left! I have been through many different sets of wine glasses both fine and inexpensive, including riedel, and have never had so many pieces break so quickly... Oh well, will probably order a new set just for the quality of taste they provide.",
        "I bought this set to go with a previous set of Schott Zweisel glasses that I really like. My older set has held up beautifully over about five years. In fact, you can't distinguish the frequently used glasses from the newly purchased set. They are all crystal clear. For those who prefer a large bowl glass, they might not work for you, but we love the size. Perfect size to hold in your hand easily without danger of dropping or spill.",
        "These are entry level \"quality\" wine glasses. Those who say they break too easily may not know how to handle crystal. My half dozen were double boxed with a layer of bubble wrap between the inner and outer cartons, no breakage. You'd have to seriously crush or fling the shipping box to break the glasses in transit. I give them five stars because they're fairly priced and exactly what they represent themselves to be.",
        "thin but able to be put in dishwasher. Lower height means they actually fit in upper rack! My hubby liked them so much we ordered another set and gave away some of our older ones.",
        "Not exactly the shape I was going for but they’re quality glasses. The glass on the left is what I typically use, the one on the right is from Amazon. I like that the edge of the glass is thin and they are sturdy. I tipped one over by claccident and not a scratch or crack on it! Nice for the clumsy (like me) wash up super nice in the dishwasher and by hand. If you like the shape or need water glasses they lose are great!!",
        "Glasses came well packed w/ no delivery issues. Overall, these are nice glasses, replacing an old Riedel set that were far too easy to break. Nice clear glass, good weight and feel. Only dislike is the foot has some uneven parts and it seems a bit small in comparison to the glass. But for the great price, these are excellent every day wine glasses and do look great. Happy with purchase.",
        "These wine glasses are absolutely stunning. They look delicate and feel sturdy at the same time. I've never put them in the dishwasher as they clean easily in the sink with soap and water. Highly recommend! Edit: Can confirm they hold up well in my dishwasher!",
        "I got these in November, it's July now. I use them a fair amount and I never put them in the dishwasher and I've never dropped one. I am not rough with them by any means. Well, today while hand drying one after handwashing it, it just cracked. I wasn't putting any force against it at all. Just normal drying. This is super disappointing since they are supposed to be very durable. That is the entire reason I bought them.",
        "I was debating between Ridedel wine glasses and these. The reviews seemed fantastic, and they were definitely more affordable, but they are just a little blah - look like any normal wine glass. I was expecting them to POP! And be a bit oversized, but they aren't. They are fine, but I'm just not crazy about them.",
        "The quality is not the best but they look ok. The only thing I didn't like is the quality, they are super fragile.. I have broken 2 drying them with a towel..how? I was trying to dry them inside with towel after dishwasher and putting my hand inside they break. Now I just dry them outside to avoid break them.",
        "My 4yr old son got ahold of my drink glass tonight (one of these) and threw it from a chair height down to the kitchen ceramic tile floor and it spilled milk all over and made quite a noise but didn't break. This is the first time I saw a true test of their strength and was amazed it did not break. Maybe I got lucky on the angle that it landed, but I would think most other glasses would have at least cracked with the impact that it took. If you look at the photo, that's ice that you see on the ground (yes I am a rare person who likes to put ice in their milk).",
        "We bought these because I was tired of handwashing our fancy Riedel-brand stemware and too many glasses bit the dust with everyday use. These wineglasses look like high-end glass or crystal, but they are incredibly durable. We have only broken one in a freak accident in the seven years that we’ve owned ours. And the fact that they are dishwasher-safe is simply awesome",
        "So far so good, I haven't had the issue of the stems breaking like some of the other reviews on here. I really like these, they look great, and I use it to serve my guests and myself wine all the time.",
        "Had these about 2 months and 2 glasses left. 1 broke (my fault) when it slipped out of my hand washing. The other, I put a couple of ice cubes in it. The glass shattered in shards, various sizes and very sharp. I kind of expected more at this price point.",
        "Riedel daily user for years 2 years. Had 8 but down to 3 - easily breakable. Needed to try another route. These are less expensive but near Riedel quality - slightly thicker but after a few uses I can’t really tell the difference anymore. Just as classy. More durable - have tipped over from a standstill (empty) onto quartz countertops and haven’t broken.",
        "These are very nice glasses. You can use them for every day things or you could use them when you’re setting a more formal table. They are also very versatile: you can serve water in them or wine or a cocktail.",
        "Terrible quality. Glass itself is clear but stems have ridges that detract greatly from the product. Hard to believe they run $60. Returning immediately.",
        "I do like my Pinot Noir and want it in the right glass. This one fits the bill. I have mostly used Spiegelau or Riedel, but these have now become my go to every day choice. They feel well balanced and are a good size. Really happy with this purchase.",
        "These glasses break more easily than my regular ones that don't claim to be chip/crack proof. They are made of such a thin material so they are nice to drink out of but 4 have already broken and I've only owned them a couple of months.",
        "These glasses are a great deal for the price. They feel nice in your hand and are great to drink from. However, we have broke 4 of these since we bought them and when they fell on our wood floor they shattered into a million small pieces. For the price, we can afford to break a few, but beware around small kids and dogs.",
        "They dont last at all. Easy breake. They are really weak",
        "In a little over a year of use these have clouded badly in the dishwasher, unlike the other glasses that we use regularly. We've also broken a few, they don't seem to be any more resistant to breaking than regular wine-glasses. Not worth it.",
        "I love these glasses. The mouth is the perfect size to capture the aroma of your wine when you make that first swirl and lean in to inhale. They balance perfectly in your hand and despite their elegance, they’re strong and well made. These glasses compliment the wine. They’re not an impediment to the enjoyment of wine—they enhance the experience.",
        "Love the wineglass. It is fragile but it doesn’t matter to me. Feels good in your hand. I broke one at first use but that’s on me. They are not thick, cheaply made and therefore when you bang it on a granite countertop it will break! What can I say, I’m a little clumsy.",
        "Love this glassware ... Light to hold and not tall yet holds so much ... The thin lipped rim is such a nice feel when drinking unlike most traditional glassware ... I will be purchasing another set ... Never thought I could love a daily glassware this much ... Exceptional value for the money.",
        "These glasses are beautifully made by a great German company, however they are too large for the hand or the table. t They are almost comical in their great size. May hold half a bottle of wine. I bought the box of eight and immediately returned them. Another example of the vague and incomplete descriptions provided by Amazon. The 8 for 6 marketing ploy is probably because nobody wants them",
        "Not the quality I was expecting. I have looked at Schott wine glasses in the store and always admired them. These are not the same quality. I suspect these are more commercial/restaurant quality than the stuff the have in retail stores. Thick rims, seams on the stems, and most frustrating of all, 7 out of 8 bases were uneven and wobbled. We have ikea wine glasses and they are of much better quality for $3 a piece. When we are ready to replace those, we’ll be going with Riedel.",
        "We own these glasses and also bought them for a friend's wedding present. They are beautiful, durable and suitable for white or red wine. I originally researched them because I saw that many wine bars here in NYC serve their wine in Schott Zwiesel glasses. They are almost unbreakable, which is astounding - I have hit them on our granite counter tops on many occasions and they don't break! We put them in the dishwasher and they don't etch. I highly recommend these versatile, classy, strong (yet elegant) wine glasses!",
        "These champagne flutes are quite stunning. They have small accents that make them stand out from other glasses. I noticed that champagne in these glasses have a lot more bubble flow than in other glasses and I've read that this was by design. Good design Schott! I must say that these are incredibly durable! They do feel more durable than the last set I purchased but I have banged them on my counter top many times and learned that I no longer have to worry about my glasses breaking with the smallest tap. These are perfect!",
        "I looked high and low for these to replace several broken wine glasses from a set purchased at Sur La Table several years ago. Sur La Table has since discontinued them. They are wonderful wine glasses, perfect for every day use yet dressy enough for a dinner party. And they even fit in the dishwasher. I bought 2 sets of 6. Highly recommend.",
        "Great glasses, they really are relatively hard to break. Can't throw them on the floor, or bang on them, but they last much longer than lead crystal glasses of same nice thinness. I drink a lot of wine in a lot of different places and these are the best glasses than are at all durable. Yes you can buy $35 - $100 a piece hand blown glasses that are thinner and finer, and break if you look at them the wrong way.",
        "These glasses are beautiful and perfect for use as stemless wine glasses or even cocktail glasses. They are pretty wide around the base so if you have small hands they might pose a challenge. They are durable and dishwasher safe and we use them for company and any time a stem might prove unstable. Highly recommend.",
        "These are now my favorite all purpose glasses. I use them for wine, water, soda, tea and just about everything else. They appear fragile but they are surprisingly durable. Other fine glasses are always hand washed, but I feel comfortable putting these in the dishwasher. I've started giving these as gifts - they are that great.",
        "Sorely disappointed. I purchased for the durability but they seem to break even if you just look at them. They look nice, but so do the much less expensive and comparable glasses that you can buy at Target. Really disappointed with this glasses.",
        "I purchased this set of wine glasses 4 years ago as a Christmas gift for my mother. The glasses are of the highest quality and still look brand new. The Germans' are known for their expertise in creating fine stemware and beer glasses. With this set; the test of quality happens when you do a toast. If you hear a continued DING... from high to mid to low decibel within that single toast, you know you are getting high quality. For the price, this set is good value for what you are getting.",
        "We have replaced all our wine glasses (except the Austrian crystal) and most of our drinking glasses with Schott Zwiesel. They are lovely and practical. I run them through the dishwasher daily. After a couple years, they still sparkle. I have broken only one, the stem snapped upon extreme abuse. (No, I wasn't out-of-control. I was having trouble with an improperly installed new dishwasher that required strongly slamming the door in order to engage. My dear husband has since resolved the problem with the dishwaser and we've broken no more glasses.)",
        "Whatever you do, do NOT put these in the dishwasher. Wash by hand with a gentle touch. All that being said, they are gorgeous.",
        "I love these high quality glasses. They look elegant, feel good in your hand, and are crafted to produce constant streams of bubbles. Very impressive. They were packed in a sturdy box and arrived safely.",
        "They were very fragile. One tipped over on the counter and the stem broke in half. I would expect this if it had dropped to the floor, but it from just tipping over.",
        "I bought these in April 2012 it is now December 2012. I thought they were wonderful. A joy to drink from, the feel is wonderful. I had 6 now I have 3. They break very very easily. I only entertained with them once. I hand wash them. Know matter how carful you are when washing them they break. The bowl on two of them broke while I was washing them. I was washing another and when I set it on the towel on the counter the stem broke. I am so sad. I realy like these. Now I don't have enough of them and forced to buy more I guess. Treat like fine crystal.",
        "These glasses are beautiful, and well made. The are not as durable as they claim: The empty glass was knocked over on a formica counter, and the stem snapped, as shown. Perhaps a slight increase in the stem diameter would do the trick.",
        "The best wine glasses we've had! We live full-time in an RV and have limited space, which means we accidentally knock glasses off the counter or bang them around in the sink far more than one ever should. So far, we've only broken one out of our set of 6 in the past 9 months. That's impressive for us! Unlike metal alternatives or the wine glasses that come in the rubber protection, these feel classy. They have the right weight, sound, and taste. They make great presents too!",
        "These are beautifully designed and perfect size and shape for white wine, Very elegant. I have paid this much for one glass of this fine quality. One of best purchases on Amazon!",
        "Exquisite feel and wine does taste better in quality glass. I purchased a few sets of these in Germany many years ago so I'd have plenty as they broke because I planned on using them daily... well... over the last 12 years I only broke a couple leaving me with a surplus!... who ever has a surplus of fine wine glasses that are used everyday? You will if you buy these! I now buy these for friends just to experience them falling in love with them and I'm an instant BFF...lol",
        "Sabotage this Crystal, but it does not say anything about it on the box being Crystal",
        "The stem is forged so it has a distinct seam that is very apparent when held. Makes them feel like a cheap flute.",
        "Nice looking glasses except for the fact they are paper thin. Two glasses broke by just hand washing, and another broke while taking a sip of wine! I got cut both times! They will sit in the cabinet for show now. Not worth the money, you’re better off hitting the dollar store and buying wine glasses from there. At least those are durable.",
        "You can’ Go wrong with this glasses It adds style to your daily table",
        "Let me start by saying I only hand wash these glasses. Within 5he first few months of using these glasses one cracked while washing with a spong. Another while empty had a 2” piece break out of the bowl while being slid on the counter while being held by the rim. They clearly do not meet advertised performance. Definately not worth purchasing.",
        "One arrived broken at the base so only have five useable ones instead of six. A little disappointing. Otherwise amazing stem wear.",
        "Terrific glass for everyday use. It has exceptional clarity and a nice feel in the hand. After multiple washings in the dishwasher, there's no evidence of clouding. We also own the forte wine glasses and stemmed pilsner beer glasses...no clouding after hundreds of washings in dishwasher. Only complain on the tumbler is that is shows finger smudges...a small annoyance to be expected on a glass of this shape and clarity. Overall, the tumblers are the best all-purpose glasses we have ever owned. We are sold on Schott Zwiesel.",
        "Beautiful wine glasses and were sent before the estimated time. All were intact!!",
        "High quality all purpose glass. We will use as a water glass paired with our wine glasses to entertain family for the Holidays. Great purchase!",
        "These glasses are break resistant and have the balloon feel but are more petit which allows me to put 18 of them on the shelf where 12 of the larger ones fit. Also twice as many can go in the dishwasher where they come out beautifully. These are a keeper",
        "These might be seconds or have a manufacturing defect. Stems had a ridge running up the length of the stem. Some very noticeable and some very subtle, but all annoying and not smooth to the touch. I expected more form Zwiesel.",
        "I bought these because they were the same size as our delicate, breakable Spiegelau wine glasses. Knocked one over in the cabinet putting it away, just bounced. The Spiegelau would have been history. Looks remarkably like the Spiegelau, not heavy or thick. Just saw a nicer shape by Schott Wiesel at Sur la Table for $9.95 each, taller more elegant, much like the wine glasses in 4star restaurants. Will buy those next time.",
        "We really love these wine glasses! We're really not very hard on our stemware, but we went through a couple sets of another make of thin-walled wine glasses very quickly and they were much more expensive than these Schott Zwiesel Forte glasses.",
        "Second time drinking my precious Riesling from this wine glass. The first thing I did upon receiving the glasses was feel, and listen for the proper \"ping\" when I tapped the glass. Tonight it accidentally fell from my relaxed fingers. It bounced off the brick hearth and onto the carpet, totally unscathed. These wine glasses are everything everyone said they would be. Thank you! Amazon continues to deliver...",
        "Love these glasses. Simple, elegant, and perfect for dinner parties.",
        "LOVE these glasses. Great shape, easy to hold, and so far seem very durable",
        "love schott zwiesel! this glass is so elegant! i feel like im in fine dining each time i use it!",
        "Have not used them yet, they are very nice. I gave them a 4 because the opening is not as wide at the top as I thought they would be for wine glasses. They feel good, so maybe have better idea once used.",
        "Thesew look and sound like real crystal wine glasses, but hold up so well. It's kind of fun to see the expressions on the faces of the few friends who have dropped or knocked them over. They are VERY break resistant. The price is good too. Compare to price at places like Sur la Table, etc. If they are going to break, the weekest spot is in teh stem. We've lost one glass this way. They even hold up in the dishwasher.",
        "These short-stemmed glasses are perfect for everyday wine drinking. Nice quality glass and they fit in the dishwasher without breaking the stems.",
        "Good looking glasses, especially the white wine ones, but thicker-lipped than expected. Comparable to other glasses in their price-range but with the added bonus of being dishwasher safe and one-too-many-glasses-safe. I did not fear breaking them when washing (I did it by hand out instead of waiting for dishwasher). Packaging was good and glasses arrived in perfect condition except for the sticker that left a small amount of glue upon removal. Pro: Strong, does not chip. Con: Somewhat thick lipped (not thin).",
        "That’s one thing that I think is funny when I’m doing a review and it asked for durability. Ha! FC been stemmed red wine glass. Doesn’t hold up to the smashing around backseat of a car.",
        "We bought these first at a kitchen store in Austin, TX and loved them. Then I was \"testing\" the shatter resistance (don't do that) and broke one, and chipped another. Shatter resistant does not = shatter proof. They are great and serviceable while still being elegant.",
        "Love the elegant lines of this stemware. Small for a white glass but no real complaints",
        "Not as durable as expected but a quality glass and I use them daily.",
        "Very nice glasses, very fine edge, great for reds. Not NEARLY as shatterproof as I expected, I'm down to 1/4 in a few weeks, not from normal use though, from tapping them on something, but point being, they're very breakable/shatterable still so do treat them with caution. They're still a great, thin crystal.",
        "On the small side but ok as a wedding gift",
        "One of the glasses was already broke upon arrival. All 6 glasses have been broken. Certainly not indestructible.",
        "Have used these glasses for years, this size glasses are better for rosé or white than reds in my opinion, I like the larger size for reds.",
        "i saw these glasses the first time at a trendy restaurant. i like the glasses so much i had to order them when i get home. they are usually $10 each when you buy it elsewhere. without breaking my bank account, these glassware make me feel a bit more sophisticated when i am serving them to my guests. (they also love them too!)",
        "Wow these are great glasses. I used to have really cheap thick glass ones and you can really taste the wine a lot better with these. They're very thin and delicate. Highly recommend",
        "Have had these for a few weeks now and they seem to be holding up to daily use.. great glasses for reds.",
        "If you read my reviews, it looks like I rate everything high or very low (I just don't rate things unless they are great - or they ticked me off). My wife loved these !! You could pull these glasses out to use for any guests you might have come by, and be comfortable doing it (we use them all the time ourselves - why should only the guests get a chance to use them?)",
        "Had to sent back /many glasses had defects in stem/apparently seconds; have many of Schott Zwiesel products/excellent glass ware",
        "Fed ex broke 2 glasses. It was obvious with all the glasses shaking around in the box.",
        "Factory defect on one glass; melted (not broken) had to have happened during manufacturing.",
        "I recently bought 6 more of these flutes. For $8 a piece, the value is high, and it doesn't matter to me if they're accidentally broken. I have two very nice flutes that I keep for special occasion use. These are every day champagne flutes that I'm very happy with. I also have several other Schott Zwiesel glasses: tumblers, and snifters.",
        "Beautiful, elegant, simple glasses - also seem very sturdy. I have run them through the dishwasher several times with no issues.",
        "Have had these for about a few months. Great glasses. Resists streaking and buildup. So much better than our old chap ones. Looks good when company is over.",
        "Excellent all purpose stems - use them regularly and have recommended them to friends. High quality - perfect size and can be used for both red and whites. Cannot go wrong with the quality.",
        "Great glasses. Sipping wine from them makes you feel like the lord of the manor - elegant and sophisticated - even if you're wearing jeans and flip-flops.. Seriously, though, this is a great product. They look and feel like fine crystal but they can safely be put in the dishwasher. Would purchase them again.",
        "Bought these as a gift for the wife after breaking one of here previously prized set from another reputable maker. Didn't want to buy the same thing, so spent the time to research, found these, and they're really great. She loves them, and so do I. Great product. Would recommend to anyone.",
        "This is my second order of these glasses, though they are a little tougher than most fine crystal glasses they will break, so I had to replace them. I like the just right size and shape and they help the wine taste better because of the thin lip. ( your getting less glass and more wine on the tongue.) I originally bought these on a recommendation by a wine writer who like their durability vrs Riedel for every day use. Of course they will break if you knock them over on granite but can handle a lot of accidental knocks that put other glasses out.",
        "Love these wine glasses. Use them every day and get lots of compliments from friends and guests. We like the idea that they are titanium and not lead based. We bought 6 and then bought 6 more.",
        "relatively sturdy. they are quite large so that even a substantial pour has a lot of surface area. can be hard to gauge how much you've poured for this reason. sometimes i prefer smaller glasses for tasting but these do allow you to give a vigorous swirl!",
        "Very good value for the quality of the glass. It’s nice to have some alternatives to stemmed glasses!",
        "We enjoy the Schott Zwiesel Stemware and this one is just he right size. The glass will hold 13.6 oz however the 5 oz pour is just right in the glass. The glass is light, easy to handle, and quite durable. Our guests enjoy these glasses as well. It is my wife's favorite wine glass and therefore it is my favorite wine glass. We received them on a Sunday as stated, and were quite pleased with the packaging. In fact we used the packaging to store older glasses (not as favorable as these). The glass is great, the price was right, and the shipping was as we expected. Thank you... I would highly recommend these glasses.",
        "Buy six get seven, not eight. The box literally says buy 6 get 8, and I open it to find 7.",
        "Absolutely love these. Large and luxurious. If you like a large wine glass, these are nice to hold in the hand."
    ]
}