{
    "entity": "Wine Glasses",
    "text": [
        "You're going to think you're getting something like a Reidel glass when, in fact, you're getting something more like a Libby glass. I have had a lot of Schott glassware in the past and it's been great (thin, delicate, stylish) but this is just like the stuff you'd buy at Walmart.",
        "These wine glasses were treated with kid gloves: no temperature extreme, drops, never in the dishwasher and always hand washed carefully, and never banged against another object. One shattered in my lap after touching the rim, another I discovered cracks in the rim after taking one out of our cabinet. I e-mails the manufacturer to request a technical explanation on the spontaneous shatter but never received a response.",
        "Got the 4 glass set and 3 glasses had bubbles either in the cup area or stem. One of the glasses had a huge defect in the joint between the street and cup. Very disappointed in the quality.",
        "Beautiful wines glasses! They are so elegant to drink out of and I get many compliments. I even gave these as gifts. Very great value for what your get. They are delicate so handle with care",
        "I saw these in a nice restaurant in San Francisco and loved them immediately - they have nice weight to them, a clean shape, and are clearly high-quality glass. I liked them so much I actually called the restaurant to ask them who made these glasses and they were nice enough to find out for me so props to EPIC in San Francisco!!! They are a nice size and while not big and bulbous like a \"typical\" red wine glass I use them for red and white and they are fabulous. They are dishwasher safe (although I hand-wash them) and they really have a nice balance and feel to them.",
        "I have been looking for wine glasses of this tall, tapered style for years but could only find them in restaurant supply stores at outrageous prices. I just happened to stumble on these on Amazon one day, took a shot and I couldn't be happier. They are absolutely beautiful, crystal clear glasses that are just the right height and lend an elegance to your dinner table that makes you feel like you're eating at an expensive restaurant. My wife and I have gone through dozens of different styles of wine glasses over the years, not happy with any of them. Now that we have these, all the others are being donated to a thrift store.",
        "Beautifully shaped, perfect size, and very strong I knocked one over on my granite counter top and was sure that it would break but it amazingly didn't. The only complaint is that some of the steams have a very small seam that you can feel with your fingers when you pick them up in the right spot. Overall I am very pleased I would buy them again.",
        "Excellent quality wine glasses. Got the Bordeaux... We drink big reds typically, but will work well with most wines. Superb quality. Highly recommend. Be warned, these glasses are not only beautiful and made of wonderful glass, they are bigger than most wine glasses the average wine drinker will encounter. We are a big fan of this, but others may not be. The size not only adds visual impact, but also gives the wine more space to breath. After nearly 60+ bottles of wine through a set of 6 glasses, not one chip or crack, let alone a broken glass. Overall, this is better than any Riedel glass I've ever drank wine out of.",
        "Beautiful glasses but the Bordeaux is gigantic. They need something sized between the Cabernet and the bordeaux.",
        "Ordered these as a gift for my hubby. They look beautiful and feel nice to hold but both of the glasses broke within 2 weeks. I'm wondering if they aren't actually Schott glass since they are supposed to be very durable. They broke when very lightly and carefully washing them, and were never dropped or anything like that. I'm extremely disappointed.",
        "Once I was tossing a ball at the dog and the ball ended up knocking over my new Schott Zwiesel Tritan Crystal Wine Glass that was sitting on the granite counter top and nothing happened to the glass. I was shocked.. Another time a friend knocked over her glass of wine and again nothing happened to the glass. Any other wine glass would have been in a million pieces.. I love how the glasses feel and look. I usually like switching up my wine glasses, but since I got these they are my go to wine glass. 🍷 I love them.",
        "Best wine glasses I’ve ever owned. These glasses feel high end but sturdy. Any wine looks beautiful in them. I have had these for a while now and I have two toddlers running around and a dog. I am irresponsible and leave the glass on the driveway while I play with them or out all night on our deck during storms. I still have all of the glasses! They are strong and beautiful!",
        "I've enjoyed Schott Zweisel glasses for many years. That's why I was shocked and disappointed with the ones I ordered from Amazon. After opening the box, the first one broke in my hand while drying. I was shocked (and bleeding). My disappointment was superseded when it happened with the 2nd glass!!! Needless to say, I let the next two glasses air-dry.",
        "The non broken glasses are beautiful! However, the box that had the \"fragile\" stickers on the box was put with another heavy order in a larger box. The large box was delivered with a dent in the side... There were no \"fragile\" stickers on the large box.... Really sad to not have a full useable set. I still would recommend buying this product. I would have rated 5 stars if all glasses were intact.",
        "These are my first real wine glasses. I decided on the stemless because I eventually end up breaking a wine glass when loading the dishwasher. I use the Bordeaux Red Wine Glass for white wine and the Burgundy for red. The burgundy glass is a bit harder to grasp, but it beats drinking out of a mason jar, which I've done for many years. Once I have more kitchen space I may order the ones with stems.",
        "I like the size and shape of these glasses (Cabernet), but there is a very noticeable seam on the stem (noticeable to the touch) and there is some other minor imperfections that look like scratches. I’m not sure I would purchase again.",
        "We bought the Schott-Zwiesel Triton Pure Cabernet glasses about 6 months ago and have enjoyed them, so I ordered the Burgundy glasses and I am very pleased. The crystal is brilliant and I like the aesthetics of the angles on these glasses. The rims are pleasantly thin, wine swirls well and at roughly $10 per stem, I am happy to use these for everyday and for entertaining. While I suspect the Zaltos or the hand-blown Riedel glasses are thinner and more elegant, the Schott-Zwiesel glasses are such a nice combination of elegant and affordable that it's easy to recommend them.",
        "one glass broke inside a dishwasher (it's been washed about five times in there). Actually it broke when I put it in like super super gently it leaned against the soft plastic thing and cracked. I know I know. It's super thin and should t go in there. But I just hate the marketing saying it's dishwasher safe, it's NOT! Each time it goes in disshwasher it wears down. The ones that never went inside are very functional still and don't crack easily. I got 5 glasses left, what a bum, doesn't justify buying another set but it's an odd number. Good beautiful stuff, but seller should not market it as dishwasher safe.",
        "As a former wine store owner, I've sold 100's of Schott Zwiesel glasses. Now that I'm out of the business, I'm buying them for myself and my friends. Put Riedel to shame.",
        "We Love these! The cut of the glass is sturdy and just the right angles to perfectly hold. I love them so much i use for Red and White. They clean very easily and dry without water spots. I have been getting compliments on them every time I use to serve guests. Best Stemless Glass in my opinion, and yes we have the Riedel ones as well, still always go for this one.",
        "Expensive, nice, but BE CAREFUL! I broke one of these glasses in the first week I had it simply because the side of it barely grazed the side of the sink while I was hand-washing it (since you don't want to ever put these in the dishwasher). Gotta be careful with the $14 glasses!",
        "I ordered these last minute for a Christmas gift. I was nervous about how they would be but I know my wife loves that shape and all ours had broken over time. I received them and they are way better than I expected. Very nice. Very good looking, perfect size very pretty glass. She will love them. I think this item is great.",
        "Stunning! Beautiful presentation that always makes our wine taste that much better ; ) We realize these are red wine glasses but we are now using them with white wine because they’re so lovely. Highly recommend. Beautiful crystal clear glass that makes a great sound when gently clinking them together. Cheers!",
        "We ordered these glasses early September & by the day after Thanksgiving 1 of them broke. Mind you my guest gently clinked her glass with another & it cracked. She was mortified..i ordered these on the notion they were durable & crack resistant. Very disappointed!! Keeping an eye on the other 5 now...not trusting them",
        "I have been very pleased with my wine glasses so far. Originally I thought I would prefer a more rounded shape but the design does allow you to create the 'perfect pour' based on the bevel. Although I haven't dropped them, they do seem surprisingly sturdy. I have been very happy and would recommend them.",
        "Our set of 6 arrived with 1 broken. The box was in good shape with no visible damage but rattled like all were broken. Seems like a waste to return all 6.",
        "Pretty nice for the price! Love the shape too! Lightweight hoping they’ll last",
        "I was really excited to receive these wine glasses, since from my reading of reviews, they were a major upgrade from my old wine glasses. Upon receiving the package, one of the glasses had snapped at its stem (see picture). I was very disappointed about the quality, as I wouldn't expect this from a rather expensive set of goods. Note: the other non-broken glasses do feel nice, and seem high quality. I'm pretty concerned with their durability, so I don't use them as much as I'd like.",
        "I thought after reading the review on Serious Eats that these might be perfect glasses for everyday use but very quickly these glasses have proven to be of very low quality and easily break. I just broke my 3rd glass in the 3 weeks we own them and this one broke while hand washing. Not sure how you can easily use these glasses at all if they break with very little effort. I will be requesting a refund asap. In the meantime save your money - I bought 2 sets, yikes!!",
        "I was amazed they were not delivered damaged considering the scan amount of padding in the box! They arrived as shown, no outer box. But all glasses perfect, intact, true clarity to the glass, a nice ring when flicked. It may not appear from the shape that there is enough swirling room if accustomed to rounder glasses. But these glasses swirl nicely and place the wine at the appropriate area of your tongue for full flavor assessment. They look beautiful on our table. Thus far none broken even with hitting the sink or counter edge.",
        "I have these and their red wine glasses. Both are awesome. Very light but durable. Looks luxurious. The design is great. I've put these in the dishwasher and haven't had any issues. People that come over compliment them all the time.",
        "These are amazing. Way more stylish then my old ones and the glass has held up! I had read reviews about people receiving them broken but these were fine. Be actually banged them a few times and they have stayed out (versus more dainty ones I’ve broken). Perfect for every day use and stylish.",
        "Beautiful glasses. You can tell by the clink of glass they are high quality. LOVE THEM!! I’m ordering another set and Chardonnay sets as well. You won’t be disappointed. The bend in glass is the perfect pour. And it’s far from a small pour.",
        "I have ordered various sizes of this lovely crystal & first became aware of it in Brunei, France. I have a problem with the largest 23oz ones. I was away all Winter so hadn’t used them until this month(June). I washed them and when I went to dry them(gently w/a soft micro fiber, they broke in my hand. I thought the first was my fault, but in the 2nd one, I barely touched it and as I was gently wiping the rim it also broke off in my hand. Wondering if they will replace them for me?",
        "I like Schott Zweisel wineglasses and have the Burgundy and Cabernet glasses. I had to return the Bordeaux glasses because of their absurd, dysfunctional height. They tower over everything else on the table and seem over-the-top and pretentious. Awkward. Plus, the bowl is too deep to wash by hand. You'd need a brush of some type to reach all the way to the base. I wouldn't trust these in a dishwasher. The Cabernet glass is an excellent universal glass; get them rather than the Bordeaux glass.",
        "We like the Zwiesel glasses over Reidels for durability and price. We were getting low on our wine glasses so we ordered 12. They arrived quickly and none were broken. We have used them quite a bit and they are still doing great. We even put them in the dishwasher and have no issues.",
        "I thought i was holding a styrofoam cup because they were so light. How can anyone call this an elegant glass. It just doesn't feel like glass. Feels like something Toys R Us would sell. I've had other wine glasses that are actual glass which is thick, durable, and shiny.",
        "These wine glasses have a contemporary look, feel good in the hand and to sip from, and have been sturdy thus far (we've had them a few months and use them regularly), both hand washing and in the dishwasher.",
        "These are amazing! They feel so nice in your hand and look amazing. They make drinking wine even more enjoyable. The glass is very thin, but sturdy, and feels as though it belongs at a 5-star restaurant. I have been washing them in the dishwasher and not being careful with them at all, without any problems so far.",
        "Arrived broken which does not led me to believe they will survive the dishwasher. Will try one more time",
        "Glasses look great, are easy to clean, and work really well with both whites and bold reds. Unfortunately, one broke in a freak accident (which is isn't supposed to do). Company immediately sent a replacement set of six, even though only one broke. That is world class customer service by any standard. Happy to recommend this product and the company behind it.",
        "These are perfect...exactly what I wanted. Info in the description is accurate, they are high quality. I have received many compliments and have bought them for friends. Beautiful!! Suggested care: 1. Always always always hand wash! 2. If you’re drinking red wine and unable to wash them right away, rinse them thoroughly so it doesn’t stain the glass. That’s a no-brainer!",
        "The price is a little high but reasonable for the quality you get. My wife can careless about wine, but she was very impressed by these glasses. The glass in clear and even, proper thickness, nice nice geometry. Wine wine look and taste amazing with them!",
        "We love the way these glasses look. However, they are not durable. Upon toasting last evening, one glass shattered. Really shouldn't happen if these are break resistant.",
        "I love these glasses, and my guests love these glasses! Everyone wants to know where they came from. And the reinforced glass is no joke. I dropped one of the water glasses on the kitchen floor, and just bounced across the floor without a single chip or scratch!",
        "Beautiful, sturdy glasses came well packaged. Clear, elegant, supposedly dishwasher safe though we haven't tried them in there yet - got them as a gift for my boyfriend after I saw him serve prosecco in a wine glass. My only complaint, and yes the dimensions were included in the product info, is that they are too tall. Had to move a shelf in our cabinet to accommodate them. But they are beautiful, elegant and classy.",
        "These are fine. But I find the stems to be too thick for my liking. Feel a click or two below the typical marquee names that lead in this space. One of the glasses was broken on arrival - got a partial credit back. Wouldn't order another batch - over-rated IMHO.",
        "Lovely deep bowl, thin stem, thin crystal....I enjoy drinking wine from these glasses and my guests all ask me where I found them....architectural shape, well made, not heavy.",
        "My favorite wine glasses for savingon blanc. We still break them once in a while but operator error. Highly reccomend.",
        "I was very excited to receive my order, but unfortunately I was very saddened and disappoints to see the glasses quality. Even worse, two of the glasses have flaws and appear like magnifying glasses and one can even feel the waves holding the glass. Did not expect this from this brand and of a Germany product. Unless they are not genuine.",
        "Title says it all. Beautiful glasses perfect for reds. (The design actually lets one fill the glass more without looking overdone :) . ) Hopefully they will withstand their stated claim of 'dishwasher safe'. I'm about to find out.",
        "Quick delivery, packaged meticulously, and just beautiful glasses, from the unique shape to the subtle etching on the bottom. Would not hesitate to purchase again.",
        "My husband loves these wine glasses. They do break easily so I bought him a second set because he loves them and he says that the shape makes the wine taste good.",
        "These glasses are gorgeous, allow for great breathability, and feel high quality. However, after three uses of the set, two of the six have shattered while gently hand washing. If these were of better quality, I would absolutely recommend for personal use and for gifting. If you order for yourself or others, warn them that a soft sponge can cause the glass to shatter. Not sure if I received a delicate batch or if this is the usual experience.",
        "Absolutely gorgeous glasses. I bought the Burgundy red version. They felt very comfortable in our hands, opened up the wine beautifully, and I do like the contemporary, beveled shape. They are also a lot sturdier than I thought - one of the glasses fell out of the box on my granite kitchen counter and it did not break! I will be buying the white wine glasses too.",
        "Received damaged. Reached out for product support and got told it wasn't their problem. Will not recommend or buy again. Waste of money.",
        "Very disappointed. 1 glass broke in the dish washer. Given the price, will not purchase again. 6/12/2020 Update: Base of second glass chipped. Better off purchasing cheaper wine glasses and replacing as they break. Normally a set of discount wine glasses last us almost a year of regular use (3 to 4 days a week). These wine glasses are not more durable than crystal stem ware.",
        "My headline pretty much says it all. They arrived with zero damage, clean easily. They seem durable enough. Exactly what I expect from Schott.",
        "These flutes are true luxury. I actually cried when one of my children slammed a stem in the dishwasher door and broke one. Lesson learned! I have knocked them over a few times and they seem quite robust (what glass can withstand the dishwasher door slam?). The feel good in the hand, hold a generous pour, and they are really very striking. An amazing gift from my husband, I would buy another set without hesitation. My favorites!",
        "These glasses are amazing! They have the definite sound of crystal, but are extremely tough; upon opening the package, I took one glass out and gave it a small knock on the table-- not a chip or crack! This stuff is super strong. It also went through the dishwasher without issue, and came out sparkling. This is some seriously great stemware at a wonderful price. I look forward to getting years of use out of these.",
        "Pretty big but they're more break-resistant than any other glasses I have. Plus lead won't leach out into your beverage as in old-school leaded wine glasses. Also they ring like the dickens when you run your finger around the rim...!",
        "They are okay glasses. However, their boast that they are dishwasher safe is not correct. I've had two glasses break using the dishwasher.",
        "Great product. Put it in the dishwasher (correctly) and glasses come out sparkling. Very sturdy and great for a formal dinner or a glass of wine by the fire. Enjoy",
        "Very pretty. Love using them. They seem just a little more fragile than I really wanted, but i had read that in a review so I expected it. I hand wash them.",
        "Love this glass. Elegant light weight. We use it for both red and white (gasp!) 😱",
        "I LOVE these wine glasses! They are a true treat for rose and Chardonnay. I wouldn’t put red wine in the smallest size, but other than that, they are absolutely modern and fabulous!",
        "Great birthday gift for a woman who appreciates a great wine presented in a lovely glass.",
        "I’ve had these glasses for about 2 months and one has already cracked. We’ve only hand washed these glasses and they still cracked.",
        "Beautiful. Elegant. High quality. Do not intend to use every day: they seem fragile. Recommend!",
        "Beautifully shaped, and very well-balanced. As with many high-end wine glasses, care necessary when washing as these units are fragile. Still, they someone elevate the drinking experience. Highly recommended.",
        "Fantastic glasses. Good for cabs but also white wine. Very elegant, light and also feel sturdy. Easy to clean as well because the rim is not too tight. Dishwasher safe.",
        "These are beautiful glasses and seem to be durable. Even though they are pretty tall you can use the dishwasher on the bottom. My guests love them as well because they’re so unique and modern!!!",
        "These things are great. They are well crafted and fit the hand very well. The sound is just like good crystal but they are tough enough to put in the dishwater and come out clean with no water marks. I am not sure about all of the hype about the different types of designs for the specific types of wine but the glasses are some of the best I have ever owned.",
        "These wine glasses are absolutely gorgeous! I have the red and white and now all of my friends have them too because they loved mine so much! They are extremely durable as well! I have knocked them over many times and they haven’t broken! I highly recommend these beautiful glasses!",
        "As advertised... beautiful LARGE red wine crystal glasses. Great with the carafe decanter from Schott Zwiesel.",
        "whether you're into red or white wine, these glasses are great. every time I serve wine in them, someone wants to know where i got them. starting to think I should get a commission!",
        "Nice quality wine glasses at a fair price. Cool shape does seem to enhance the nose of the wine. Seem little more stable and harder to knock over than typical shaped stemless glasses.",
        "So far so good. We’ve been using them for about 2 months now and they hold up really well! After reading reviews before I purchased these classes, I was a little concerned about putting them in the dishwasher. However, I took the risk and we wash them in the dishwasher probably every two other times we use them and so far so good.",
        "They are EXTREMELY fragile. I rarely break wine glasses but wanted some that were more durable in case guest broke them so I got these as they were advertised as break resistant. One arrived broken the first time ordered some my roommate pushed one very lightly and the stem snapped. One got hit with another dish and got a huge crack. DO NOT BUY.",
        "Too tall for dish washer. Nice if you are willing to hand wash",
        "These glasses are the perfect combination of classic and modern. They feel good and look awesome. I've received so many compliments on these glasses. Wish the entire product line went on sale.",
        "One of the glasses came with a defect almost like a crack in the glass. It's looks very weird. Will not purchase again.",
        "I had them since February and 2 of them just broke at the stem when I picked it up. No customer support.",
        "GORGEOUS! I want more and all of them! Seriously, these are beautiful (clear glass, not smoky like the image seems to indicate).",
        "I was acceptable but they are quality glasses and nice to use. Very happy with these.",
        "Feel like a prince with these SZ wine glasses Pros: Lite weight Fun to hold Easy to wash by hand (have not tried in dishwasher) Cons: Appear harder to break but still one did break",
        "a friend had these at a dinner party i went home and ordered them very nice",
        "I will buy them again for myself. This was a gift and they are beautifully done.",
        "One of the glasses has an uneven bottom which makes it unusable. We contacted the manufacturer but no one has responded. Will need to return the exchange the entire set even though we only need one glass. For the other glasses, they are great. Large, durable, pretty.",
        "Perfect shape for Sauv Blanc. Very thin rim, which is lovely. Nice shape and weight.",
        "Wife loves the look and quality of these, very impressed with the quality.",
        "I wouldn’t say the rims are thin on these glasses. Very disappointed.",
        "The bottom isn’t even!! I Love the look. I love the feel. But it’s wobbly.",
        "I like pottery barn design choices. Wanted these after saw them there near Xmas. Too lazy to go back to PB. So I ordered online for same price. It’s same glasses PB was selling. Love them.",
        "I LOVE these glasses, but don't love that I only have 3 because one broke the first time I took it out of the box! At that point, it was too late to return them, so I felt like I wasted money on a product that I wasn't even able to use. But the three remaining glasses I absolutely love!",
        "These glasses are not durable. They are as fragile as the IKEA glasses. I bought them some time back and this was the first time I was using them. They are very thin and weak and were never even put in the dishwasher.",
        "Love the shape and the weight. Not so thin that the glass breaks easily. Great buy!",
        "This is my second set of these elegant glasses They are delicate and beautiful",
        "Nice stemware although on the pricier side. They are very nice to drink from. They feel quality.",
        "These arrived in a flimsy, dented box and one of the glasses was broken. The glasses themselves are nice."
    ]
}