{
    "entity": "Cables & Interconnects",
    "text": [
        "This product has major bugs and Belkin knows it. If you are upgrading from another card or Belkin product, it will not work. An attempted upgrade from a Belkin Pre-N card cut my throughput in half (from 108mbps to 54). The N1 will not uninstall and Belkin customer service cannot fix the problem without an engineer going into the System Registry on my computer. I've spent hours on this and am worse off than before the \"upgrade.\" Belkin indicated it would be 2 days before an engineer can call me back to attempt a work around so the card can be uninstalled without crashing my wireless network. The product should never have been released. STAY AWAY.",
        "Over the years I have had several wireless notebook cards. The Belkin N1 card is the worst I have ever had. With my laptop on my lap in the living room about 15 feet from my Belkin N1 wireless router it gets only a fair signal and can't connect at full speed. 50 feet away in my home office it gets no signal at all. My older pre-N notebook card gets a very good signal in my office so this the one I use even though it can't take advantage of full N1 connection speeds. Don't buy the N1 wireless notebook card, the pre-N is a much better device.",
        "I read a lot of reviews and lean on them when I buy something, so if you are like me then listen up. I have had few bad belkin products and this is one of them. I could never connect it to the laptop and it took 99% of the resources, so it basically locked it up. It worked great for about a month but then it took a nose dive. I tried to update the drivers from belkin but it locked up my computer and I had to reinstall windows and all my other programs. DO NOT BUY THIS!!!!!",
        "My older Acer laptop's built in wireless card quit working, so I got this to be able to go online using my Belkin N wireless router. I just followed the instructions and loaded the driver software before initially plugging the card in. When the laptop is powered down, I did find that it's best to wait until the laptop is fired up before inserting the card. As soon as the card is inserted, it connects to my network in just a few seconds with no issues.",
        "I have the Belkin G card because I mostly worked in the room where the wireless modem sits. Needless to say as I ventured out into the rest of my house I wanted a stronger signal that wouldn't drop off. This card is great, it was basically a plug and play set up and my signal carries outside in my front and back yard. I will probably upgrade my wireless modem so that I can stream in my garage but really this card does exactly what it's supposed to. Belkin rocks!",
        "I have a Dell Latitude laptop, one of the old ones, with only two USB's. A USB card, and a webcam would not work together. So I decided to get a card for the Cardbus slot so I could ooVoo, Skype, etc. Works with no problem, and costs much less than the USB card I bought at Walmart. The USB card didn't support wireless N, and this card does. Installation was hassle-free, and range is better than that of a USB card. Be careful, as it doesn't work on some IBM computers.",
        "Well, first off, I'm not sure if it's the card, or the N1 router itself, but ever since I installed the new N1 serious wireless in my home, I have had nothing but problems and poor connectivity. They clam that the N1 has extended range, I went back to my Pre N wireless and got twice the range and way better reliebility then with the N1. The concept seems good and the descriptions are great, but i can't say I feel the product is what they say it is.",
        "I have always used Belkin products but these wireless notebook cards are a great disappointment. I ordered 2 of them just to be on the safe side and I have tried to load both of them into my laptop and neither of them will work. So I will be sending them back and checking out other wireless notebook cards.",
        "wish I had more laptops that could take this card but nope no more it's a great fast card and helps your computer not have to work so hard connecting to sights online",
        "I had to order this product 4months after my 7 yr old broke my logitech card. My Logitech was acting up anyways. And would not allow me to connect to the internet. Got the Belkin home. Put in the easy to install CD. followed the directions. Worked fine. NO issues. Always stays connected.",
        "I purchased this for a Linux Ubuntu Notebook. In Ubuntu this worked by just plugging the card into the computer and setting up my security. The WIFI reception is excellent and my upload / download speeds rival a cable connection. I could not be more pleased. I will buy Belkin products again from Amazon.",
        "The card worked flawlessly on my older dell laptop. I plugged the card in, inserted the cd rom and with a few clicks of the mouse I now have wifi on it! Connecting to my router and browsing speed has not been a problem either.",
        "I used this because, it was the only way I could connect to the internet with my old Toshiba laptop.",
        "This add-on wireless Internet receiver has increased the signal strength from my modem in one room to another room on the other side of the house. It adds at least one bar over my laptop's built-in receiver.",
        "better than USB stick wireless, usb can easy break due a weak external connection. It's easy to configuration. great option for older computers.",
        "I ordered this for my nephew that bought a old laptop off line and didn't know that you needed special adapter card to use the Internet on it. This worked great for him and only took a few minutes to set up.",
        "I cannot fault this card i have had it a long time given it a lot of abuse still works very good,Better than some ,I got it for a cheap price,Came with software,I would buy again from this vendor",
        "Upgraded old laptop. Installation CD that came in sealed box with this new card was incorrect. It was for a USB wireless network adapter. A call to Belkin support solved the problem. Card seems to be very susceptible to interference from 2.4 GHz devices, but is giving good performance as long as the cordless phone doesn't ring.",
        "I BOUGHT TWO OF THESE AT A VERY RESONABLE PRICE. FAIRLY EASY TO SET UP AND WITH VERIZON FIOS I HAVE UP TO 15 MBPS DOWN AND 7 MBPS UPLOAD ON WIRELESS. NOT BAD. INSTALLATION WAS FAIRLY SIMPLE. GOOD PRODUCT, GOOD PRICE, GOOD AMAZON.",
        "I ordered a Belkin N1 wireless card and was surprised when I received it much earlier than anticipated and brand new in the shrink wrap. Suffice it to say it is working beautifully. Many thanks!",
        "I've had good luck with this wireless card. No dropped connections. The install was very easy and fast. I get great range and very fast download speed. I am very happy with this product and would buy it again if I needed another.",
        "I have Windows XP Home edition and I installed the wireless adapter software with no problems. However, after buying both the new Belkin N router and adapter at the same time, I was unable to connect the adapter to my wireless connection - the adapter wouldn't even recognize my connection. The few times it miraculously found the connection and connected the service would last seconds, at best. I called tech support and after spending 30 minutes on the phone, they were unable to help establish a connection and I eventually returned the adapter. However, as the other reviewers have mentioned, the Belkin N Router works perfectly - I have had no problems connecting it to my other, older wireless adapter.",
        "The installation was a snap. But when I was done, the adapter would connect to an existing N network at only the slower 54 Mbps Wireless G speed. There is some confusion as to what model I have as well. One sticker says N, one says N1. I tried the drivers for both, neither got me up to the speed my Linksys WUSB300N gets. I had wanted something smaller which fit the express slot, but this is not the one. I have received an RMA to return it. BTW, customer support is pathetic, they just didn't get it when I called",
        "I, too, experienced the \"Blue Screen of Death\" on my laptop which has XP pro on it. I had to uninstall the card software in order to stop my system from continuously rebooting. On another note, the install of the router was GREAT, regardless. I didn't get anywhere with the Tech support group and had to return everything. Anthony",
        "It does not deliver. Range is so low do not bother. In this case \"N1\" stands for \"not this one.\"",
        "This product is unstable. I have spent numerous hours on the phone with Belkin tech Support to no avail. One time they left me on the phone on hold for over three (3) hours. I need to pack these items up and mail them back or to Belkin. Gladwin Bailey",
        "This was my worst purchase ever. Does not keep a connection well and does not stream video well. Much better options out there!",
        "This notebook card is great, it upgraded my internal card from 54mbps to 300mbps. That is amazing. The router is the best out there period."
    ]
}