{
    "entity": "Cables & Interconnects",
    "text": [
        "I liked the price of this unit. But even after repeated calls to Belkin support, I could not get the router to work consistently with Call of Duty: Modern Warfare 2. I put it outside the DMZ, turned off the firewall, downloaded the current firmware and everything else the tech from Belkin offered. I even double checked my ISP to make sure the issue was not on that end. I purchased a netgear router and have been golden ever since.",
        "This Belkin Router sure done a great job and I never thought it would but it did I love it and if anyone is looking for a good one this in my point of view works perfect for what I needed Thanks to all",
        "i am very happy with this router. i previously had a linksys router which, because my computer is a macintosh, was a nightmare to set up. belkin's cd worked with the mac and gave good instructions. their manual was also in a form that i could download and open up on my mac. i was able to hook everything up with no problem.",
        "This router was received as previously used, therefore had been setup and assigned a password. This was sold by Amazon (not by a third party vendor). Amazon should be more aware of items returned - then sold as new. No problem getting the credit - but no more in stock so had to find another router in a hurry elsewhere.",
        "I've owned this router for about 2 years now. It worked correctly for about 3 months, then immediately started having tremendous problems with any packet data being sent from PCs on my network. I constantly have disconnects while gaming, MMO, and no firmware upgrades or settings can be changed to resolve. DO NOT BUY.",
        "This router drops my connection every few minutes. I've spent hours on the phone with Belkin and replaced the whole thing. A quick internet search finds dozens of people reporting the same problem, with no solution offered. It's just no good.",
        "If you play WOW, or use skype, or do anything serious on the internet, pls do not buy this router. It has a mind of its own, and frequently drops your connection. Calls to Belkin tech support are a waste of time. Just throw it out and buy a different brand.",
        "I recently purchased one of these to replace my now dead Linksys router. At first I was losing connection every minute or so; I contacted customer support twice, which was in itself a horrid nightmare (as with any other company). I eventually called my ISP and I was told there was something wrong with my line, and after that conversation with them, I haven't had any disconnection problems since. There's nothing really wrong with this router; in fact, I like it...to some degree.",
        "I use this router currently and have had no problems with it. Setup was easy and I have plenty of coverage throughout my entire home. The CD that comes with it, provides an easy setup (tells you what to plug in where and when as well). It took no more than 1 hour to have access on 5 different pcs (1 desktop, 3 laptops, and a mac).",
        "Just bought this router thinking that it was a steal but absolutely not worth it as the wireless is not reliable for general surfing itself. Just bought a second router (linksys n-router) as this one was beyond the 30 day return period. If you are a casual internet user then this maybe the product for you but you are better of buying a Netgear or linksys g routers which cost about the same. To add to this Belkin support is abysmal - tried contacting them a week ago and they are yet to follow-up with me with a response of any kind.",
        "We had nothing but trouble with this router. We kept getting kicked off the internet when we were using this router and had to spend hours talking with tech support. We also couldn't hardly understand the people at tech support because they are from another country and didn't speak English very well. After having it only two months, it finally quit working completely and we have to buy another router.",
        "Used the supplied software with my Mac, set up was easy. I get good signal strength throughout my house without dropout. Not really much else to say-it's a wireless router, it works.",
        "today, i just got a used one from frys, which costs around 20 dollars. setting up this router is easy and everything works promptly. this is a G router and the wireless speed is good for normal web browsing use, and i updated firmware v3... no drop out internet connection at this time. the cost and benefit of this belkin router is great!",
        "Extremely low wireless speed and I did confirm it on the Cox Las Vegas test. Skype dropped calls every 1.5 min or so when it was ran wirelessly using this router. Poor range not as advertised. I have had good luck with other Belkin products but what a disappointment :{{{{ ( The set up was about an hour including unpacking, rebooting etc...)",
        "I've been using this router for more that two weeks now, and I stream video, audio, network, etc., without drops or loss between one wired computer and two wireless using the MIMO usb adapter 9050. It solved may connectivity problems that plagued us over several months. The router itself is upstairs and the two wireless computers are down stairs. Huge thumbs up from me.",
        "I am a tech savvy teenager who has been setting up routers for years. Now, after 4 years of service, my Linksys router craps out on me. I go and spend the money on this thing. What a joke! The router randomly decides when it wants to connect to the internet and simply rebooting the router resets ALL of my settings. DO NOT BUY THIS or any other belkin G router. I have not tested their N routers. Also, if I try to restore my saved settings it fails with no error message and blocks me from the admin interface.",
        "I also have the problem of random disconnects. We had a techie come in and try to set it up for us, he got it working, but the thing still randomly boots us off. It does the job, I guess, of giving us a connection, but it's got almost no reliability. I hear it's got a lifetime warranty; good, we can return it.",
        "Easiest wireless router setup that I've come across. Works great and has a very good range. I get a very good signal at the opposite side of my house and on the floor above the router. I highly recommend this router.",
        "The router that I purchased was unable to keeps it PPPOE connection for more that a couple of hours. Now I have to constantly reboot the router to reestablish a connection."
    ]
}