{
    "entity": "Chef's Knives",
    "text": [
        "They say this knife is stainless steel but after using it for only a few months, and not using everyday, it has started to rust. For $100.00 I would have thought it would have lasted much longer. It said it has a lifetime warranty but it is impossible to get it taken care of. I would never buy this knife again or recommend anyone to buy it.",
        "Great knife when it was new but as others have mentioned the blade is awefully brittle. I have both the g2 and g48. I’ve had the g2 for 12 years and the g48 11 years. The edges on both are chipped to no end. To put it into perspective I have a Chinese made sabatier set that I purchased about 10 years ago and the chefs blade is flawless. Dull but flawless. On a good note... all of your chef friends will be impressed that you own a global",
        "I bought this as a gift for my husband and he loves it. It’s also my favorite knife to use. We love it so much that we’re buying the whole set. The handle is not glued on, it’s apart of the knife if that makes sense so it won’t break off. This is something that you invest more money in and you will be glad because you won’t be replacing them every 3-5 years because they hold up. We have used this for 8 months and it looks brand new and performs the same as the day we received it.",
        "Worth it over similarly priced knives, comes sharp and holds an edge fairly well. A great knife for chefs/home cooks who like lightweight cutting tools. Integrated forged handle with grooves that won't let your hands slip, slim profile and standard blade shape. My favorite 8 inch to date.",
        "Global is as good as it gets when it comes to knives. Just make sure to wipe them perfectly dry before storing. These knives are very prone to water spots that cannot be removed. I consider this a small price to pay to have one of the best knives on the market. I've used this knife basically daily for the past year and a half and it's still very sharp. Don't wash this in the dish washer and store it completely dry. If you're going to have one great knife, this is the one.",
        "Super lightweight and comes out the box super sharp! If you know how to handle a knife you shouldn't worry about cutting yourself. This is the best knife purchase I've ever made. It is not heavy and cuts through food like butter. Red bell peppers are my least favorite vegetable to cut since they have such tough skin and the cut pieces sometimes tend to stick together until I separate them with my hands. With this knife, the first thing I used it to cut was a bell pepper and it sliced through it with such ease. Don't hesitate, buy this knife!",
        "This is a knife that I got after seeing that it went on sale. After going thru IKEA knives, Farberware, and KIWI knives... I figured it time to start adulting and get a legitimate knife. Boy this knife surprised me! I've used it on so many things and have sharpened it twice a year. The others that I had before were just piles of replacement garbage. So far I've had this knife since 2016 and still going! I got another set with the sharpener in Japan and gave them to my in-laws for a X-mas gift and was so ecstatic to use them everyday!",
        "A great chefs knife for all your basic needs. Quality steel and sharpness. I have had mine now for 4 years and it takes a nice edge every time i sharpen it.",
        "I'm an every day cook who was in desperate need of a solid and sharp knife. This one is exactly that, it only arrived this week but I've already used it to make several meals and I couldn't be happier. It's definitely super sharp and I hope it stays that way for a long time. Also bought the smaller knife from Global and that one is a thing of beauty. I'm very impressed with both so far.",
        "I ordered this knife expecting it to be very sharp. From the onset, it wasn't. It can barely cut through an onion or meat without getting stuck. A complete disappointment. I've tried sharpening it, I hand wash it and use a wooden cutting board. I have cheaper knives that do the same job as this one. Global won't exchange the knife and their warranty doesn't cover much (I don't even know why they even have a warranty program). Terrible customer service.",
        "Fantastic. A quality knife that holds it's edge well. It really making cooking so much easier. The grip in comfortable for my hand, and won't swell or crack like wood. I'm saving up to buy a whole set.",
        "Great knife! I bought it on a tip from a cooking book that said have at least one good knife in ur kitchen. The book suggested the Global brand n I choose the knife from there site, then checked on amazon n it was same price n with prime I got it in two days. I also picked up the sharpener. Love it.",
        "When I first saw the item I added it to my list because I found that it was a bit too pricey, but after a few days I bought it. Best decision I've made on Amazon! I love this knife. I don't really need any other knife anymore. I was so excited to use it on spaghetti squash since my knives wouldn't slice through it. As soon as I received my order I sliced through the squash and it was the easiest thing ever.",
        "I really want to love this knife. The blade is very good. The weight is fantastic. The only drawback is the size of the handle. If you have large hands then the handle is going to feel very small to you. I can't use this knife very long before my hand starts to cramp. Hey Global, how about some kind of grip cover that can make the handle larger?",
        "You won't go wrong with this knife for the quality and value. I have been searching for many years for a great all around knife for the kitchen. This one works well. It hasn't let me down and I actually look forward to cutting up vegetables and cooking.",
        "I Love this knife. This is my second global. I owned a Global Santoku before and loved it. This chef's knife is well balanced, good size and nice hard steel that holds an edge. It also looks beautiful if you are in to that sort of think. One good chef's knife like this one is better than any of those high price sets. Buy it.",
        "Nice knife. Well balanced, not too heavy, stays sharp, nice grip. I have used this everyday since I got it about a month ago. I wash this separately and do not put it in the dishwasher. I also dry it off after washing. It's worth the price and the small effort to maintain it. It's my go-to knife for just about everything. I will most likely buy other Global products.",
        "I bought this knife after seeing Anthony Bourdain called it his favorite. It's lightweight and stable, with an easy grip and perfectly shaped handle.",
        "Excellent knife. My friend who is a chef recommended the brand as \"legit; but not fancy.\" She slices well; I was surprised at home easily and smoothly the blade practically melts through vegetables. Definitely a noticeable difference compared to the knives I grew up using. Unique handle adds some beauty as well, and love that the function-focused design still manages to add that touch of art.",
        "My favorite thing in my kitchen. I through away every single knife I had. No kidding. Reliable, Perfect weight, Easy to clean, sharpen. Beautiful, the whole package.",
        "we've always been impressed with Global knives. We have owned several different brands, and Global seems to be sharper than all of them. We invested a lot of money into Cutco a few years back, and after using Global knives over the past 12 months, we regretted putting so much money into the Cutco set.",
        "Lifetime Guaranty is no good, impossible to find a way to send knife in for warranty. No Global service centers in Houston,TC to return to.",
        "Great knife for the home Chef looking for Unique design and elegant style. However, Global’s are not the easiest to keep sharp. A ceramic stone works best keep knife sharp.",
        "This knife is superb. I am an at home cook who has used it daily for about one year, have yet to get it sharpened (honed before/after each use), and it still cuts through tomatoes effortlessly. It looks fantastic, is well balanced, light, but not too light. The only downside I can think of is that using any other brand for a chefs knife just seems awkward after becoming accustomed to the Global.",
        "Wonderfully made and durable knife that I have used for 6 months and gave to 5 people as a holiday gift and they all rave that it is the best kife in their drawers. SHarpens very nicely and holds a sharp edge. Feels great in the hand and cuts like a champ.",
        "Best knife I have ever owned. Perfect heft, grip, sharpness and versatility.",
        "There is nothing else to add. I have all the expensive German knives. I have switched permanently to Global. It is light, strong easy to sharpen and stays sharp longer. I can cut tomatoes that look like transparent paper when I am done. I use it for almost everything.",
        "Being a Chef, and a knife aficionado, this is a great knife for home or professional use. The edge stands a long time, and is rather easy to bring it back to razor sharp with minimal stone effort.",
        "This is the hands-down best all-purpose knife on the market. When I bought it as a Christmas gift, it was 50% off, but I would have paid full price. If you're only going to have one knife, this is the one you want. We've had ours for five or six years and it's still just as great as it was on Day 1. 100% recommend.",
        "Handle way to small and slippery feeling for my man hands. Nice edge that sharpens nice.",
        "This is a really good knife, perfectly balanced, is sharp, not the sharpest i've seen (Miyabi and hattori are sharper) but still razor sharp out of the box, the handle is kind of funny, thin but still comfortable, maybe not for someone with big hands. I would recommend this knife to anyone that know how to take care of a quality knife.",
        "Great blade, retains a great sharpness. What else is there to say?. ***A little over 4 years in, and this knife is still kicking hard. I've since learned how to sharpen a knife and this boy is amazing and slicing and dicing. The price has even inflated because this thing is that good. If you're on the fence, get it before it goes higher.",
        "Bought this knife as a gift for my mother 6 years ago. I sharpen it for her every 6 months and it holds a great razor edge. I has a great weight and look. Would recommend if you are looking for a good long lasting kitchen knife.",
        "I've used this knife for 8 months and am very happy with the purchase. It cuts beautifully (I do sharpen it occasionally on my steel rod), cleans just as beautifully, and it fits well in my hand. This was recommended by a chef, and I am very thankful for his recommendation.",
        "This is my baby. I researched knives for quite some time before deciding on this one. I am a vegetarian and cook all three meals every day. So, I use this guy pretty much constantly. It is great for vegetables, but I have read elsewhere that it is not recommended for cutting through bones. I would highly recommend it to anyone who does a lot of produce chopping.",
        "Wish the handle had some weight to it. It's so light that you don't feel in control as you should for the price of this knife.",
        "I have never had a knife that works this well as I'm used to getting box sets as gifts from other people. I forget which chef said it but you essentially can use one knife to do way more than the average person realizes. This knife can be used as such. Skip the sets. Buy a knife like this.",
        "Best. Knife. Ever. I was looking for a great knife and tried this one out at Sur La Table and fell in love. To make sure I was making the right decision I went back again and cut some veggies they allow you to cut up and tried the knife again. As expected, I instantly fell in love again. Super light, razor sharp, amazing, amazing knife. I have Wustof and Henckels and I always find myself reaching for my Global now. The only knife you'll need. Be careful...it's SHARP.",
        "This is my first Global knife and I am very pleased. You need a sharp knife to do many kitchen tasks safely and this well-balanced, sharp knife does it all. As expected, it was extremely sharp right out of the box. Although I've only used it for a couple of weeks, I feel that it will maintain its edge for a long time. I'm trying to decide the next Global knives that I will add to my kitchen repertoire.",
        "Thin, light, sharp as a razor - they are for professionals who want the best. And as a professional cook, I can attest all one needs is a chef's knife and the cook's knife.",
        "I bought this knife for my wife one year ago. She is a chef at a fast paced restaurant. It's her go to knife. She brought it home the other day to use for some Holiday cooking. This thing was still as sharp as the day she took it out of the box!! I got to use it for a bit while it was home and it's just an amazing knife.",
        "I take back my initial review, this is a great knife and the blade is solid feels secure in my hand and I was incorrect in my first assessment. High quality, very sharp and not flimsy like my yoshihiro that the blade broke while chopping carrots!",
        "My brother purchased this same knife for me as a wedding gift and since I have purchased the same knife as a gift on 5 separate occasions. The grip is outstanding and I love that the knife is one piece with no attached wood/other material. We do up-keep on the knife on a regular basis, taking it to our local professional. Every person I have purchased this knife for has loved it, and it is by far one of the best gifts I ever received.",
        "My son loves this knife. I purchased it for him on his B-Day. 🥳",
        "Great knife. Sharpens easily. Bought another style of same brand/model and love it also. Will buy paring knife next. As the daughter of a barber who grew up with sharp cutting tools, this is the best knife I own",
        "For those working with smaller kitchens and therefore less storage space, this thing can cut just about anything and cut it well. I highly recommend this knife.",
        "Before you buy any knife though go hold as many as you can. I Love this knife. If I were wearing chef whites every day I'd use the heavier model, but for home this bad boy is awesome. Pretty monstrous hands I've got and this sucker is like and extension of my arm. Love the balance. The blade is gorgeous. Can't help but feel super cool with how 1990 chic the handle looks. I recommend the Kyocera ceramic honing tool and a boos block cutting board to party with this purchase. Kitchen cutting congregation for success with those three.",
        "I purchased 2 of these knives last year for Christmas presents and found them to be of very good quality. because of the difficulty of sharpening the hollow ground knives, I would stay with the regular edge knife. I purchased 2 more of these knives for gifts this year..",
        "Anthony Bourdain recommended this knife and he was totally correct..It is a great knife",
        "My grandson is an executive chief in a fine food restaurant. requested a 12 in version of this knife and loves it. I bought an 8\" version for my wife and she loves it. This kinife will be a Christmas gift t one of her daughters. It is extremely sharp and keeps it edge with some honing.a fantistic knife.",
        "I've had a Global knife for about 5 years now and they are great. I've since bought two more for Christmas presents. If you will get a nice ceramic skill and keep this knife sharpened, it will last you a lifetime and more. I just like the feeel of the knife handle better than the wustoffs and others.",
        "This is the first of this set I have purchased and it is wonderful. The balance is exactly where it should be the edge such that I will only need to hone it for some time. It's name is Manakaze.",
        "Bought this product as an xmas present for my dad after reading Kitchen Confidential. He hasn't stopped using the knife since he received it and finds any excuse to display its slicing capailities (on food items, of course). So glad I was introduced to this brand and plan to be a loyal customer going forward. The price was excellent during peak shopping season and shipping and handling was on point. 5 stars all around",
        "Extremely sharp knife. Good for cutting fish with very sharp edges. Good anytime of cutting. Love this Knife. However, this is a very sharp knife and must be careful in handling it.",
        "Keep your hands and feet inside the ride. This knife cuts! It is seriously sharp",
        "Outsatnding knife - believe the hype and experience a wonderful way to cut things up.",
        "My daughter requested it for Christmas. She is a chef.",
        "fantastic knife on all counts, the metal is good enough to keep a razor edge and the design naturally fits the hand with your fingers pinching the blade (my favorite grip)",
        "stays very sharp for a long time and is a great knife to cut watermelon with.",
        "Excellent weight and sharpness to this knife. My new favorite.",
        "Awesome knife! This is the only knife I use in the kitchen now. I thought the handle would be slippery when wet but it is not. Super sharp. Perfectly balanced.",
        "i checked out reviews before purchasing this dandy knife for my wife and it had great responses from everyone who owns it. from the first time she saw, and tried it, she was in love. i think she loves this knife more than me ;) it's worth every penny... now we have to match the rest of our knives with this one.",
        "Wonderful knife. The biggest downside I found was how fragile it is. I bumped it against a glass bowl and a small piece broke off of the blade. Apart from that, its a great knife, easy to handle, and maintains an edge really well.",
        "I have two Global (G-2 and G-46) and various other knives in different price range. I sharpen all of them \"razor\" sharp, but the Globals still feel much easier to cut than the others. After some research and experiment I realized that not only the blade of the Global is sharp, but its convex bevel shape also contributes to the ease of use. I reshaped some of my cheap knives to have the same convex bevel and the improvement is obvious. They almost feel the same as Global now, though not quite as good. Now I use Global to measure my sharpening skill on all the other knives.",
        "This is a very good knife, i bought two of the same kind. Long lasting and sharp to any use.",
        "What’s not to like other than when I have to sharpen it. Love it for day to day work.",
        "Love These knives - well made and very sharp. I really like the handle, it works for me.",
        "The sharpest tool in my shed of a knife roll. You will love how light this knife is, seriously! Highly recommended for home cooks and proffessionals alike.",
        "It look me a day to get used to the light weight and thinner blade, as I was used to the heavier, tanged German knives, but now...I prefer it. I'd buy again. Paid $99.",
        "Very versatile and durable. Easy to clean and maintain. Great product!",
        "Got this to partner with my Henckle's chef's knife and love the lighter feel. The metal shaft is a narrower than the Henckle's but I got used to the shape quickly. Super sharp, cleans easily with no spotting.",
        "OMG. SHARP, sharp sharp.! And lightweight. ! Review I read online was spot on. Best knife for cutting and chopping. Will look for one a bit smaller as well.",
        "Just right. Couldn't be happier. It's the right size and the one piece construction makes it easy to clean. Did purchase the ceramic rod sharpener to keep it sharp.",
        "This is my 3rd knife from Global. They are extremely sharp and durable. I would recommend them.",
        "I didn't get to try this knife before buying but a friend recommended it so I decided to give it a try. I was worried that it might be too heavy or big for my small hands. It's actually very light but feels solid and comfortable. I've had no trouble cutting all sorts of vegetables, fruits, and meat. A good purchase.",
        "My go to knife . It truly makes food prep enjoyable when one has good tools. Feels good in the hand, just the right weight and very sharp .",
        "Got this as a wedding present. My cousin loves it. It’s so sharp he can’t use it everyday, which just makes using something he can look forward too.",
        "lots of research for a great barbecue knife and I came up with this one. Perfect!!!!!",
        "Best knife i have ever used. Puts Cutco to shame. Its grip is the only down side. when cutting something greasy the grip gets slippery.",
        "I bought this to replace a Henckels Pro S 8\" Chef. The Global is MUCH sharper. I had no idea it would be this good. The reviews were all great, but so are the ones for the Henckels. This thing is super sharp and beautifully balanced. The blade is nice and thin, making this knife useful for just about anything. Add a bread knife and a parer and thats about all you need. Highly recommended!",
        "Well balanced, extremely sharp and holds an edge real well. It's used at home, not in a professional setting, so it probably comes out 3-4 times a week. We keep a dmt steel to hone it with a few times a month and it keeps its edge wonderfully.",
        "Great all around knife; I own this one and the 7-inch. I will be adding more over time. They cut extremely well and have held up well thus far to daily usage over the first two months.",
        "I work in a kitchen it’s my go to knife from my roll, co workers like it as well",
        "Light but firm very sharp blade. Use it every day and it has maintained its edge. Highly recommend.",
        "This was purchased as a gift for my husband. It has quickly become his every day, go-to knife. Highly recommended.",
        "Absolutely love this knife! It's so lightweight that I can use it all day and my wrist doesn't get tired. Its sharp and feels good in the hand. Excellent purchase.",
        "This knife is sharp and frankly awesome. I have used several other expensive knifes and honestly never got the hype except that it was a name brand. This knife however, completely and totally understand why people spend money on good products. I have been on big juicing (fruit+veg) lately and use it cut most of the produce to go into the juicer. While this does not seem like a big deal, I tell you I think the knife scares the oranges enough to split them (because I do not feel it cut them at all). It simply slides through them and there is not even juice on the cutting board from them being cut.",
        "Being my first real kitchen knife I am nothing but impressed. It was exceptionally sharp out of the box, and with the global MinoSharp it is able to stay that way. With the quality of this knife I will definitely look to Global for my future knife purchases.",
        "This knife kicks a$$! It's very sharp and sturdy! Cut through a \"log\" of pepperoni with ease!",
        "Globals are one of the best for the money. I have a set (individually bought knives) of 12 Global knives. It matches or bests my Shun Traditional, Shun Edo series knives.",
        "I am very satisfied with this product, and arrival was quite timely.",
        "Great knife. Very sharp and holds an edge. Use it all day at work and usually only take it to a steel once a week. Haven't had it long enough to have it sharpened though. Doesn't rust like people say either. Less you leave it in a vat of degreaser or something. It's molybdenum so you must realize that it will react with certain substances. Know your tool and it will reward you.",
        "It is a very sharp knife . I love it",
        "I have never had this happen to me with a knife but something hit it and the blade became bent at one end and then just broke off. So now I have a very expensive knife, less than one year old, with a U shaped chunk missing from the blade. What the heck. I bought these because I didn't want to have to buy another set for a long long time.",
        "Everything about this knife is positive. First, it is light-weight. So when you are chopping for an hour, preparing for a stir-fry, you do not get tired. The knife is perfectly balanced and holds an edge. I cannot think of a task it does not perform well. I could not be happier with it.",
        "I bought one for my daughter a year ago and finally bought one of my own recently and it is the most amazing knife imaginable. As a vegetarian, I use it constantly for chopping and so on and it is simply effortless. Money very well spent as I know it'll last a lifetime.",
        "My favorite GO-TO kitchen knife. Tricky to sharpen but it holds an edge longer than the traditional high-quality german knives.",
        "Great knife for the home chief that wants to up their game. I love it.",
        "This was a gift to my chef son who so far hasn't cut anything he wasn't supposed to but I can see where it wouldn't take much, this thing is beyond sharp!",
        "great kitchen knife. nice balance and super sharp. so far so good."
    ]
}