{
    "entity": "Chef's Knives",
    "text": [
        "I received my \"new\" knife today and the tip is bent and there are water spots on the blade like it was already used! This knife is too expensive to have a defect. I haven't even had a chance to use it. NOLA girl",
        "For an expensive knife, this is a big disappointment. We haven’t even had this knife for a year and treat it correct (no dishwasher, hand wash only, keep it in its cover, etc). There are so many chips on the knife and some rusting. Very disappointed.",
        "I've used this knife almost exclusively for cutting meat and making charcuterie plates for the past couple years. The fine edge cuts very well and holds it's sharpness requiring infrequent sharpening. However the narrow edge does chip more easily than I expected so I would recommend using this knife only with a professional cutting board and avoid heavy chopping, around bone, or jobs requiring good durability.",
        "I ordered this knife last January and had been very happy until now. While cutting potatoes the knife chipped. I use a wood cutting board so this is even more surprising. My Amazon warranty expired in April but I may try to figure out how to contact the company. I saw other reviews regarding chips and should have listened. I’ve never experienced a chip and have several good knives. Can not recommend this product. I gave all of the other ratings a high one since it is very sharp, but the metal is too thin.",
        "While German knives like Wusthof (which I also own) seem to be based on heft (the weight of the blade doing the work of cutting), Japanese knives like Shun (which admittedly are adapted for the Western market) are about the fineness of the blade. I feel like my Wusthof chef's knife is better for cutting sturdier things like meat while the lightweight Shun chef's knife is suited for vegetables. I did drop this Shun knife pointed end first on the kitchen floor and the tip broke off. I simply took it to the knife sharpener and he put a new point on it.",
        "I bought this for my husband on his birthday. First couple uses were wonderful! But, this knife didn’t last longer than a few weeks before the edge chipped (luckily I found the piece that chipped before it ended up in our dinner) and started to rust. (See photo). For the amount of money this one knife cost I am so upset. I would not recommend this to anybody.",
        "Now this is a knife. This thing slices like no other knife I've owned before. I even had our resident sushi chef in our family try this thing and he approves. Also he told me that the proper way to slice raw fish is to use the entire blade, starting from the handle and pull backwards towards the tip. I can't wait to get my hands on some more fish to put this thing to use!",
        "It cuts everything like butter... I now understand why people kept chipping this knife. One simple answer, people are not smart and abusing the tool. It is a very polished product, and can feel the amazing hardness of the steel right out of the box. I literally cut myself touching the blade! Also, for most people who gave 1 star complaining about the quality of the knife. I would not even both reading them as 99% of them are poorly educated about the use of this.",
        "My 8 inch Shun chef knife was mishandled by someone at work and the blade was broken so I decided to replace it with this 10 inch Chef Knife. I work in a very fast paced kitchen and this knife is a no to use! I have no problem cutting an entire stalk of celery at once... huge time savor and it keeps a nice sharp edge. I def recommend!",
        "This knife was great, but it has chipped after 5 months of use. I got this for my wife for Christmas, and we have been careful when using it (never left it in the sink, washed it immediately, kept it sheathed, etc), but just in the last day the blade chipped, and the tip broke off.",
        "This Japanese knife is made from extremely hard steel, thin and lightweight, compared to European knives, and is hand-sharpened to a much finer (16 degree) angle and stays amazingly razor sharp if used correctly. The cutting technique required of Japanese knives is NOT the same as for western style chefs knives, so don’t expect it to replace your German steel knives without doing a little research- watch some videos, and know what you are buying before you purchase Japanese steel knives. That said, Shun is 1/2 the price compared to other hand-made Japanese professional knives that I have...I’m extremely satisfied.",
        "Just buy this knife. It's my work horse and my go to for 80 percent of my day to day tasks. I was hesitant to sharpen it myself because of the unique angle of the blade. After practicing on less expensive knives I felt confident in giving it a sharpen about 9 months of heavy usage and just honing. I used a wet stone with multiple grits and posted a video of the knife after I sharpened it. It's absolutely surgical. This knife is an extension of my arm at this point, and I can't recommend it enough if you are looking for that \"next level\" knife.",
        "I love this knife. It is my second professional grade chef's knife. My first is an 8\" Wallop and I really love it. The problem with it is that it is a bit heavy. I wanted something that allowed for a bit more precision in the kitchen. This Shun is a perfect answer to my problem. It is light and extremely sharp. It is also pleasing to the eyes like the Wallop. I love it and am looking forward to years of kitchen joy with my two new friends.",
        "I've never had a Japanese made knife, let alone a beauty such as this. To properly work with it and to make sure it'll remain undamaged, you must work properly: 1. Don't apply pressure - it's made to take advantage of its supreme sharpness, so it's lightweight. For cutting through boned, shells or anything hard - use European knives. 2. Learn how to work with a Chef knife. It's made for slicing, not chopping. 3. Buy a softer cutting board - Hinoki is best. It's pure joy working with it.",
        "I had this knife for a little over a year. I have the Premiere Santoku so I don't use this one so much. Even though it is babied and I don't use it much it has huge pits on the blade and the tip broke off. I don't know how this could have happened since it is barely used. I hand wash it and dry it with a soft cloth. I store it away on its own. It has never been used close to the bone or anything remotely hard. I truly think its a manufacturing defect of bad steel.",
        "I've had mine for months now and still look forward to using it, each time. Fit and finish are superb. Balance is perfect and sharpness is outstanding. I've more or less retired my Victorinox and Henckels chefs knives now.",
        "As I have small hands and a lefty to boot this knife needs some time to get used to. Its D shaped handle made more for right handed use is not a problem for me as I am not using it for hours on end. Its really very sharp and I hope with the VG MAX steel it can retain its sharpness for a good while before it needs sharpening on a whetstone. However something very intriguing is that this Japanese knife was send to me from Yang Jiang Shi, GUANGDONG, CHINA.. Yang Jiang is China's knife producing center.",
        "I bought this knife for my mother and somehow after one use chopping vegetables and putting it in the dishwasher it got a chip in the blade. I wouldn't even expect this from a cheap low quality knife, but far more disappointing given the price tag for this one. I would recommend buying a different brand.",
        "This is my second Shun knife, both are amazing. Very comfortable to hold and use. Had the other knife (Shun 6\" classic utility) for a few months now, still sharp as new. Just hone occasionally. Also have a Wusthof 7\" santoku which I like a lot, but I think I enjoy using the Shun knives a little better.",
        "This knife is very sensitive. If you are a sushi chef it’s perfect for you. However for everyday kitchen cooking it falls short. It’s like a formula 1 car. Good for race track but can’t drive it on local roads. It’s also a very well balanced knife. But it’s very light weight and easily breakable. I ended up breaking it while cutting a large carcass of meat. I ended up returning mine. My feedback to shun company —- make it a tiny bit sturdier.",
        "I wouldn't say this is the best knife I've owned but considering the price it's a great knife for specialty needs. I have the long blade slicers for meats but I wanted something more agile for lamb chops and this fit the bill. Nicely balanced which is important to me due to my small hands. Not great for vegetable chopping, or doing fine chopping. Overall, much better than any products you can buy from most retailers in the U.S.",
        "A truly gorgeous blade. The handle shape works so well for my hand. I was able to handle one in a big box store... and as soon as it touched my hand, I knew I had to have it. I have Wurstof classic blades and they are true workhorses, but this Shun is a dramatic step up in quality. It really is amazing how much nicer this knife is considering it is very close in price to similar Wurstof offerings. Mine came razor sharp right out of the box. I truly appreciate that they took the time to polish the edge grind to a mirror finish.",
        "So I work in a volume kitchen. I cut close to 200 lbs of boneless tenderloin everyday. I bought this knife because my current knife, which I love as an inexpensive option, dulls before I get done cutting everything. I used my new shun classic today and I tore through the chicken. It was the most effortless chicken cutting session I've had in the past 4 years of working in this kitchen. It comes razor sharp and I love the ergonomics. I use the pinch method for holding my knife and it was so comfortable. The edge didn't even seem to notice that I cut anything.",
        "Love the knife, it's light and very sharp, but it's more delicate than I would have expected for Shun. We've had it about a month and it already has 2 knicks and the tip broke off - and we're just standard home cooks, nothing fancy or wild. Our old cheap chef's knife, while not as sharp, has held up better over 15 years than this has in 1 month. It's a shame because, if not for that, it would be getting 5 stars from me.",
        "Lucked out and got it in sale.... I've been cooking at home for 15 years with chef friends telling me that I need sharper knives. 1) they were right 2) this is the knife that showed me that! I diced a full bunch of celery for no reason the night I got it. It was just so much fun to use a knife that actually performs. I enjoy prep work again. Get this knife. It's worth every penny!",
        "...to move up to Shun knives. I like my 6 inch as much as my 8 inch, so much that I bought another one as a gift. They're beautiful, perfectly finished and function like a dream. The Shuns have been a game changer in my kitchen.",
        "This was a great knife. I bought it in June and was an excellent prep knife and very flexible. Until the knife chipped in the cutting side of the blade. So it lasted me just over two months...",
        "This thing is sharp and feels great to use. It's exactly what I wanted in a knife at home. The blade is thin because it's Japanese which helps for precision cutting. So far it has held up well.",
        "This is my first Shun knife and is a beautiful knife. It is very sharp right out of the box as it sliced a large piece of sponge completely off when I cleaned it the first time. I was not sure if I would like the handle or not as I prefer contoured handles, but this knife is very comfortable to hold and use. I will probably be purchasing more Shun knives in the future if they are all like this one!",
        "I was able to shave hairs off my arm with this knife right out of the box. It’s considerably lighter than the Wustoff that I’ve been using for the last 6 years. I was concerned that I’d grown so used to the weight of my old knife that this one might feel cheap because of the weight difference. This did not happen. The Shun is just light enough to be nimble, but heavy enough that you know you are holding a quality product. I love this thing.",
        "Looks and feels great. Tried to slice paper with existing knives with no luck. Tried it with the Shun 8” classic chef knife and it slit the paper with minimal effort.",
        "It’s a razor sharp, perfectly balanced tool for use in the kitchen. The Damascus design is lovely, and shows that the steel is very, very hard. Should you graduate to this level of tool, never drag the blade edge along the cutting board. This knife doesn’t deserve to be dulled in that manner, and never put it in the dishwasher.",
        "I’m not a knife expert, but this knife is totally amazing! Very easy to hold, sharp like a samurai long sword and it’s design (damn damn damn!) rocks. Finally my salad is chopper better then a machine and im not scared of any tomatoes no more!",
        "This knife is amazing. It is sharp and beautiful. I'm glad I pulled the trigger and bought it. You definitely aren't slicing through chicken bones or hard veggies with this blade, but for your average everyday chef knife, this gets the job done.",
        "It's everything I hoped it would be. It's beautiful, sharp, and durable. The steel is extremely hard and holds and edge very well. Out of the box it re-defined my entire notion of what sharp was. Frankly it takes some getting used to. The knife glides through hard foods like raw potatoes or beats. It's easy to slice wafers so thin you can practically see through them. I liked this knife so well that I bought other Shun knives.",
        "Let’s chop something up! Perfect blend of style, balance and function. Makes food prep fun, fast and, easy. Changing out all of my German steel for Japanese Damascus. Shun is next level kitchen tools.",
        "It’s very hard steal and sensitive first bone I hit chipped the blade of placed in my tool box and tip is chipped looking for more durable blade",
        "I absolutely loved this knife when I first received it. However, it has developed like 20 little dents in it & chips & I use it carefully on a wooden cutting board and do not even own a dishwasher so it's always washed by hand by me. I don't understand how cutting onions & hand washing it has let to it being so dented & rough. I try to gently sharpen it but it just doesn't help.",
        "Wow! This knife is sharp! This bad boy has a wonderful heft with a nice, strong blade. You can slice and mince your way into cutting history - if you don't cut off your finger first. I really love this knife but take time to get used to the length before you start cutting everything in sight.",
        "I purchased this knife for my husband for Christmas, as he'd been wanting on similar to this! For the price, this knife is perfect for him! He buys whole pork and beef tenderloins and slices/freezes them, himself. This knife has made it so much easier for him to cut the tenderloins! Smooth as butter!!",
        "Purchased a 10\" a year ago, poked myself with it on the first use lol, decided an 8\" was more my speed. May have neglected it, cut a lime or two without cleaning it right away, maybe hacked at a chicken bone like a bad boy (don't do that), but never tossed it in the dishwasher or let it bang around the sink or cut on plates with it. Still pretty and sharp. Haven't sent it out to be sharpened just yet (Shun does it free!) so will update it that's a nightmare.",
        "Our Chef of the family was given this as a Christmas Gift and he used it Christmas Day to carve brisket and other meal favorites and he loves it and will get a lifetime of joy using it at every step of the way!",
        "Right out of the box its easy to tell, it's not real damascus. Sanmai maybe, does have a nice hard edge and the feel is good to the blade. But to my ultimate dissapointment thou, the \"damascus\" pattern is printed on. Real damascus really doesnt have a different schene not texture to the blade patterns, this is clearly an ingraved pattern. You broke my heart Franky......you broke my heart.",
        "Got this for my boyfriend who is a chef. He loves it and says it’s his favorite knife. It’s durable, sharp and good looking.",
        "The top is slightly bent so it catches on hand towels when you wipe. Also, when you try to slice cherry tomatoes it crushes them before it cuts them. Not as sharp or as good of quality as I expected.",
        "I own several Shun knives but this is now my favorite for everyday chopping. It is just the right size and weight for my hand. I intend to purchase this again as a gift.",
        "Great feel and balance, it's very sharp initially, but as with all Shun's it has to be maintained in order to keep that crazy edge. The balance is perfect and it feels great in the hand with good weight and no hard edges on holding surfaces. Love it.",
        "I've apparently been delusional with my concept of what a sharp knife should be. This Shun knife EFFORTLESSLY glides through vegetables and meats (no bones!) This knife actually makes me chuckle in disbelief while dicing onions... it's that sharp. I purchased the Shun DM0750 Honing Steel to tune up the edge when necessary, but haven't had the need to yet. The D-shaped handle fits my large hand well and the knife has an excellent balance point. The bevel on the bolster makes for a comfortable grip in your hand with little fatigue during long prep sessions. The Damascus steel looks phenomenal. I've dedicated a whole drawer just for this knife in my kitchen. You will not regret this purchase!",
        "This knife is amazing! It slices through veggies unlike any other knife I've ever used in my life. I'm not a professional chef or anything but its good to know that I now have a world class chef's knife.",
        "This!!! This is an amazing knife. I never knew what I was missing until I bought one and prepped my first meal with it. Wow. I can never go back to cheap kitchen knives again. The fit and finish on mine was excellent and it came razor sharp.",
        "Bought this for my meat master boyfriend. He said it cuts meat like butter.",
        "I have the 8 inch version of this knife and it is great. Sharpens to a fine edge and is silky smooth cutting almost anything. I bought the 6 inch and had a completely different experience. I always cut on a end grain wood cutting board, but the leading edge of the 6 inch kept chipping, rendering the knife useless. Tossed it out. A 50/50 experience at this price point is not acceptable.",
        "Bought it for mom for Chanuka since she mentioned wanting a 6\" chef's knife earlier in the year. It's now the one she uses most of the time. Well, other than the 6\" [Shun Classic] utility and now 3-1/2\" paring knife. Shun Classic are my 'go to' knives when it matters.",
        "This knife makes me wonder why I didn't buy it sooner. It is super sharp and makes cooking so much more fun. I look for excuses to use it! The knife is beautiful. The weight and feel are just right for me. They are expensive, but after years of fighting to keep a mid-grade chef's knife sharp, it is worth every penny. I use it every day!",
        "I had given one of these knives as a gift, but this one was to me from me, with love. Razor sharp and holds an edge as long as it is used properly. I expect this will last me a lifetime, and plan to add a few others to my kitchen collection.",
        "We love shun knifes. They hold there edge. They are extremely sharp. We recommend them to everyone they are awesome knifes",
        "Used this knife only a couple of times in 3 weeks, and already it had multiple rust points on the edge, in addition multiple chips on the edge, never happened with any knife i owned.",
        "This knife has been used less than a dozen times. The brand character is already mostly unfinished and there are several micro chips along the blade of the knife causing rusting in some areas. I am extremely disappointed that this is the reality of this expensive knife. I had previously bought one as a gift and now I’m concerned that knife has damage as well. It has been handled with care and hand washed.",
        "I have now used this knife for multiple cutting tasks, and it performs exceptionally well. The grip fits my hand perfectly, and the knife cuts through tomatoes, meat, hard squashes cleanly. I highly recommend it.",
        "Great knife, being a chef u need a knife that’s sharp and easily honed and this is, the price was perfect because in the last 17 years shun chef knifes has never dropped below $130, so that’s a plus too, my coworkers ask to use it too because it’s such a easy knife to use.",
        "Amazing knife, well balanced and super sharp. In fact my wife with no skills cut her fingers 3 times already in the first day. Wish it came with a sheath.",
        "This was definitely the knife that I wanted to buy. I can make it very sharp and keep it that way if I am careful. It is a slicer. Not to be used for chopping into a hard acorn squash, or the like. The extra steep angle on the edge makes the knife sharper, but also more delicate, so it really needs to be used for slicing softer foods such as steaks, tomatoes, fruits and veggies, etc.",
        "Great knife, extremely sharp. Gave as gift to son on Christmas day. We tried it out and I can say unequivocally that this knife is sharp as I severed EPL tendon with it to the bone. Christmas day visit to ER and a surgery a week later to reattach it so be careful!",
        "While we love how well the knife cuts, within a week or so the blade started to chip (even though we followed all washing, cutting, and storing options diligently. This was the most expensive knife I've ever bought and super disappointed.",
        "Purchased for my wife to replace a Cuisinart or Kitchen-Aid chef knife. Much improved. VG-10 steel is wonderful and well worth the cost. As with anything, maintenance and care is key to making it last. Will purchase more from SHUN.",
        "The unique angle of the bevel on this blade makes it very very sharp. It is the best chef’s knife I have ever used.",
        "He worked in restaurants, this is far better than any knife he's used. Well balanced, makes cutting easy and fast.",
        "Shave outta the box sharp! Very lightweight knife. Definitely worth the price (even though I’m left handed) for a chef. If your using at home keep superglue on hand for your hands type sharp. Plus pay for shipping and they professionally sharpen it for you, what’s not to like?",
        "I love to cook. This knife is fantastic for chopping, slicing (thinly), and dicing. Lightweight and thin, this is a jewel in the kitchen. Its very sharp though, I have never cut my hand on a knife before and did it twice. I won't blame it on the knife, just the fact it is lighter than I am use to. Highly recommend.",
        "I HAVE cut myself with this knife, but then again, i have cut myself with every knife i own and love to use. This is truly a special knife, still not my go to knife, but it sure looks like a waste having it on the wall and not using it... i am starting to use it more... oddly enough probably because of its expense i don't use it for the heavy duty tasks it would excel at, such as attacking a whole chicken; however there is no doubt that i have never owned anything even close to perfection as this instrument is for its purpose.",
        "I bought this little number thinking it was a different knife. Don't let the four stars dissuade you, this is a four point eight two five out of five stars kind of giddy up. It is fairly thin, like most Japanese knives it will wreck your callous (If you work in the industry) if you have been using non-oriental knives but I guess these are games we play when we order knives online. Um, yup, cut stuff with this thing and you will like it more than than whatever you used to use.",
        "My new favorite knife!!!!! My wife got it as a Christmas gift for me. Using it is like an extension of my arm and feels perfect. It is well balanced and you barely need to put any pressure behind it to cut. The weight of knife does most of the work.",
        "I really like it. Wish I had gotten it sooner. I do all the cooking in the house and this knife slides though the food with ease",
        "Compare this to my Fibrox chef knife this Shun is super sharp. I've enjoyed Fibrox and other knives before but this is my new favorite.",
        "I love this knife and use it daily, the box came damaged (issue with shipping not product), but the knife made it through alright",
        "It’s a small shun chef knife. It’s really nice for anyone who gets uncomfortable with the larger shun chef knives.",
        "Hands down best knife I've owned. I didn't care about consistent knife cuts before, turns out I just never had a knife that could produce them. Absolute dream to work with",
        "My boyfriend was like a kid in a candy shop once I gifted him this knife. It is VERY sharp. The first day he got it, he cut a water bottle in half with it. It slices everything like butter. I don't have knowledge about knives, but my boyfriend who does loves it.",
        "We never knew what a good knife was until we opened the box. Not only is it a very attractive knife (Damascus look, wooden handle) it cuts perfectly right out of the box and is very well balanced in the hand. Already looking at getting another Shun to replace another knife.",
        "Solid and very sharp. Lighter then it’s German counterparts, we will see if it holds up as well as the other 8” I’ve been using for years. I like the feel and weight.",
        "I can't believe that I waited so long to purchase this knife. It is my favorite chefs knife. No more consumer knives for me. This knife is well balanced, sharp, and is fun to use. The shape of the handle is designed for right-handed people and feels good in my hand. I also purchased a Shun honing steel for quick touch-ups.",
        "Disappointed that for the Shun brand and the high price the blade chipped so soon. Otherwise, it’s a great knife - very sharp and feels good in the hand.",
        "Very nice quality knife and was recommended by a chef. She told me I can send it in to sharpe knife annually but I didnt see that on the packaging or the warranty info. Otherwise it cuts meat really easily and easy to clean .",
        "Couldn't be happier with this knife. We had been using Chefmate and other strange knives we picked up during college and this made them look like I was trying to cut stuff with a stick. It actually looks like I know what I am doing now. Chopping and mincing onions is a breeze. Slicing tomatoes is way better and it doesn't smoosh it.",
        "My fiance is a pastry chef and loves this knife. He says it's easy to hold and likes the handle.",
        "Love this series of knives, this is my second shun chef knife. It's light, super sharp, and comfortable. Only drawback is as a thin knife it's not good for every task you might use a heavier German steel chef's knife.",
        "I love the feel of a Shun knife. I have smaller hands and the fit works for me. The 8 inch is perfect for larger food items; i.e., deboning, squash, larger potatoes. I highly recommend.",
        "Got this for my dad for Father's day. I have one myself and I love how durable, easy to clean, and comfortable to use they are. For most home cooks, 2 of these and a few specialty knives (paring knife, bread knife) is all you really need!",
        "sharp it is a bit expensive for the regular price. So just wait for so discount",
        "This is the 4th one I’ve purchased. I gifts these to my friends and family as they are beautiful knives. Insanely sharp. Only caveat is that beginners should learn knife care before buying these. They need very little upkeep to sharp but some knowledge is recommended",
        "This is a very sharp knife. Good size. Good ergonomic handle. Pricey, but worth it.",
        "this was my first professional knife and I am so impressed. I can't believe I spent my whole life working with the wrong tools",
        "This knife is the best ever. BUT beware it is very, very sharp. I would say it is as sharp as a razor and easily cuts through produce and fingers.",
        "Great knife the craftsmanship is excellent you feel and see it with every cut.",
        "This is a franchise member of my kitchen cutlery; I expect to use it for years to come.",
        "This knife is extremely sharp and will go through anything. The ergonomics of the handle make it super easy to hold and maneuver through anything you’re needing to cut. It is definitely worth the price and one of my favorite chefs knifes",
        "Beautiful knife and fun to use but watch what you are doing or ouch.",
        "My new favorite knife! It is so sharp, be careful! Cuts through everything like butter.",
        "Well balanced, and can't be sharper. Very happy with the purchase.",
        "This is used for all my prepping needs and cutting meats in my home. This is for my personal use as I do all of cooking for my home and church. Needed a very sharp edge knife that will last a long time."
    ]
}