{
    "entity": "Chef's Knives",
    "text": [
        "Great Henckel knife, with a caveat** Henckels makes great knives - except when it comes time for warranty work. But aside, this is a great knife. Well balanced, great steel, handle has amazing fit into my hands. Upon inspection, the knife is not made in Spain as advertised, but in China. The Henckels 'Classic' lines is transitioning into Asian markets for their knives. This advertiser posted pics stating their knives are 'Made in Spain'. My collection of Henckels are all Spanish knives. So I was a bit disappointed the advertiser did not tell me the truth about where the knife was truly made. I wish this retailer would have been honest, because their pictures of their product was blatantly ....***",
        "This is the WORST Henkels knife ever... frankly I’m shocked it carries their name and wonder if it’s even authentic. The knife completely oxidized and discolored after the first washing. I hope to attach a photo showing this. Next, the TOP edge of the knife (not the cutting edge), IS SO SHARP IT CUT MY FINGER DEEPLY WHILE JUST HOLDING THE FOOD WITH MY LEFT HAND AND THE TOP EDGE OF THE KNIFE GRAZED IT. I have exclusively owned Henkels knives my entire life (I’m 59). Honestly, I could’ve brought a cheap, crap plastic knife from Ross that was higher quality. I hope I can reopen this sham produce of a once great knife company.",
        "I actually use this knife more than my wustof I paid 3x as much for (I got this on sale!) It's a very sturdy blade and I have not even sharpened it once since I got it two years ago because the blade is stiff that it only needs to be rubbed on a steel. I rarely grab other knives because I know this will be reliable. Best 30 dollars kitchen product I've ever purchased.",
        "This is my wive’s chef knife which we’ve had for over a year. She mainly chops vegetables with it. I own a sharpening service out of my home and what I’ve noticed is an excessive amount of chipping at the apex. The steel is X 50 CR MO V15 which is respectable with a Rockwell hardness of around 58 so I don’t know what the issue is. My problem is that for the third time since I’ve owned it, I’m going to have to take off an excessive amount of material to get below the chipping and I’m already seeing a curve in the blade just forward of the bolster which really degrades the quality of this knife.",
        "6\" stain-resistant carbon steel that's hot drop forged (not stamped). Full length tang. Very strong blade holds the edge well. Should be hand washed as with most knives. This has become the go-to knife in our kitchen for \"small projects\". It's easy to handle and well balanced, but you'll still want to keep a larger blade around for big cuts of meat etc. While this works for veggies, the veggie knives with non-flat surface keep the slices from sticking and are also recommended.",
        "First off, Let me say that we are Henckel knife fans and have been for a couple decades. Some of our knives are getting old so, I ordered this one. While the design itself is nice and it's easy to hold but, the product quality is so bad that I returned it. After just a couple times of washing and use, The Henckel logo almost completely came off the blade and the handle started to look a little discolored and maybe like it was getting some cracking lines - Leaving me wondering if this is just a really bad Henckel or a fake knockoff.",
        "Bought this at end of 2017. Had my other one since 2008. The older one had half of the handle break off after it was dropped (too many times). The new one arrived very sharp. I have a bandaid on my ring finger to prove it! It's nice to have a new one again. Makes quick work of my cutting and sharpens well. I use the JA Henckles hand sharpening tool that came with my set.",
        "I just realized that I bought this 2 years ago and it's still working beautifully. I bought a the 9 inch sharpening rod and a \"cover\" for it and still works like new.",
        "I just got my Henckel's eight inch Chef Knife, ...the spine was sharp enough to cut. I dulled it as best I could with a file. The reason being sometimes a pinch grip is used. I have actually seen a review or comment stating that the spine was finished or some such. A lie. The weight written was 11.2 ounces (from Amazon?) not true. My scale indicates 8.5 (or so) ounces. My guess is maybe some number of the comments are by shills. You know the cliché \" Buyer beware\".",
        "The back of the blade was so sharp, both sides of it had a raised edge like a snow ski, and cut us very easily. Either this was not really a Henckels knife, or that company has produced an inferior product for a discount site. I will never buy a knife from Amazon again, and I will never buy a Henckels knife again.",
        "If in doubt, goto a store and compare with the high end line. Mine was very roughly manufactured.. The steel still has that nice heft and holds an edge well, but the finishing on the knife is below par of even the cheapest forged blades from china. Sharp back edges and suspect burr lines along the cutting edge. This is a quarter of the cost of the real German blades, and as such, is a fair price.. But lets keep it real. It isn't anything like as nice, and if you intend to use them in a commercial setting, you'll have to ease the unfinished edges or ruin your working hands on them.",
        "I bought this to replace an older Henckels 8\" chef's knife, and I have not fared well with it. I find the weight very unbalanced, the sharpness is dollar-store grade, and the top edge of the blade is oddly very rough. I keep scratching myself on it. It arrived with minimal packaging and no care instructions. I'm not convinced of its authenticity, although the price is similar to the going rate on mfr-approved websites. Basically, I don't recommend this knife at all.",
        "This knife is great. The blade weight distribution is great, a bit on the heavier side. It's super sharp and stays sharper than a lot of my other knives of the same price range. The curve of the blade works very well with the way I cut. The handle is kinda squared so it doesn't fit too comfortably in the hand. For the average at home chef, this knife will probably be one of the best ones you'll have in your kitchen. Also, amazing price.",
        "Blade was not quality I expected, was rather dull. I was very disappointed. Should not have to sharpen a new knife blade before use. Wish I had kept the original box longer, I would have sent it back.",
        "I've had this knife for just under two years now and I've never been displeased. The blade is nice quality and sharpens up nicely and holds an edge for a long time. It has a lot of weight to it so its good for chopping and dicing. If I had a complaint, it would be nit-picky: the handle is squarish and the edges can wear at your palm with heavy use. Its not something that keeps me from using this knife though and I've gifted friends and family with it. Good for the price.",
        "only the second better-grade chef's knife i have owned (the first was Chicago Cutlery or something like that, i bought over 20 years ago). i couldn't afford the top henckels but i opted for this model as a compromise over those constructed in china (this line is made in spain). i'm VERY happy so far. very comfortable in the hand, solid construction, good weight; if it holds an edge, it's all i could ask for. i take good care of my knives, and i expect this one to last a lot of years.",
        "This has become my favorite knife! I just love it. I've always appreciated a good sharp knife in the kitchen. I'm the one that has to sharpen the knives in my sister's kitchens ... Or I bring my own knife with me for holidays. I've recently become more serious in the kitchen, it's a real pleasure to work with tools that are acceptional, and this knife is just that. If you want a good knife, this is it. I've spent some serious money on knives in the past, this one is better for a really reasonable price.",
        "The biggest issue with this knife is that it doesn’t cut as expected. I expected a sharper cutting knife based on the reviews and the brand name.",
        "This is my second one of these knives. It is a great size and shape for every day cooking chores. Stays very sharp for a long time. Minor touch up on the steel and it's good as new. Really great knife.",
        "This is a very sharp knife. States \"Spain\" on the blade but no idea if it's actually made there because it does not state as such. The only thing that I don't like about this knife it that the top of the blade is very sharp making it a bit tricky to hold it without cutting myself. I may have to file down the edges to make it safer to hold. Otherwise I'm quite happy about the purchase.",
        "This is my second Henkels 8\" chef's knife. I still have the first, over twenty years old now, but it has a few dents in the blade where I have abused it over the years. It is still honed to a razor sharp edge though. Used the replacement to slice some ripe tomatoes very thin, and it arrived with an edge sharp enough to make 1/16' slices of tomato and cleanly cut through the skin. For the money, I don't know if there is a better chef's knife.",
        "Bought this as a gift for my mom. She cooks with a lot of root vegetables and winter squash and this cuts right through all of that. Did a lot of research before settling on this one. I've had my own for about a decade and it's just now needing sharpening. Heavy enough to cut help with the cut, but not so heavy that it's hard to handle. As an amateur chef, I find this design very easy to work with. Would definitely recommend.",
        "Please read the reviews closely. The knife was in a box with very little packing material. It is very small and lightweight. The biggest concern is the entire top of the knife has a sharp edge to it! You could possibly cut your skin along the top of the knife. Unbelievable. Bottom line? Don't waste your money.",
        "I’m in love with this knife. Honestly, for me, this knife is so expensive (my old ones cost less than $10). But after using it, I realized it was so worth it. It is very inspiring to cook and prepare your food if you have a good one. The size is so perfect for my hands (not small, not too big). I juice everyday and used it mostly to slice fruits and veggies. I told my spouse to never use it on meat. I take care of it and doesnt want to have any sort of chip on it.",
        "i received a gift card from my niece just in time to buy myself a new chop blade chefs knife. So far so good. I haven't run into the problems of this knife staying sharp at all. Quite the contrary. I am happy with my purchase.",
        "I've always had knives from big box which have never been great. I purchased this after looking for a decent chef's knife at my son's request. I wasn't ready to spend hundreds on on knife and after researching I thought this was the best lower cost but still good quality starting point. All i can say is WOW, a decent knife cuts amazingly. I will be looking for a good paring knife soon and will purchase J.A. Henckels again.",
        "Good weight balance and quality knife, but it doesn’t hold an edge very well. I sharpened using a 1000 and 6000 grit stone, and while the edge was very sharp, I needed to sharpen again in 2 weeks even with light use and daily honing. There are better knives for the same price. Try Misen.",
        "If you need a great knife and don't want to spend a lot of money this is the perfect knife very sharp easy to use all around awesome. I did some research prior to purchasing this knife and it had gotten great reviews I am not sorry I purchased this knife I'm now going to start purchasing other knives by this company now that I know this is the right company don't be fooled by the price range it is absolutely worth every penny",
        "Manufactured in India and sold as Henckels International -- meaning that Henckels is selling a knife made to Indian standards. They don't even claim that it's engineered to German standards. So the blade thickness and robustness seen in all European knives is not there. These knives look like those imported from Red China or Hong Kong. So, you're getting a Chevy when you may well have thought it was a Cadillac. Since my usage is strictly light duty, I'm going to keep them, but a heavy user would be disappointed.",
        "I already had one of these knives that I bought years ago, but most of my knives are no name $20 knives that long ago lost their edge and do not sharpen well. So, I decided it was time to buy one more decent knife. I can't afford $200 for a top brand knife but this Henckels knife is a good knife for the money and it isn't made in China.",
        "We have now had this knife for a number of years. It is not our every-day choice simply because it is so large. But whenever something of size needs cutting, it is my first choice. Pizza, winter squashes, melons, pineapple, splitting a head of romaine, are all easily done.",
        "Its a little smaller than I imagined and the blade wasn't as sharp as I thought it would be but it is nothing a little sharpening won't take care of. Feels really well made and overall a good quality knife.",
        "LOVE THIS!! I can’t believe how fabulous this Chef’s knife is! I had previously bought all Pampered Chef but a friend suggested this is the ONE and ONLY knife you will ever need. Believe me, she was right! I just sliced up tomatoes for our breakfast sandwiches and just about died watching how slick and smooth this knife slices through...just like butter. It dices, minces and chops like magic. One key seller for me was mincing up parsley, that was unbelievable.",
        "I've been using this for over three weeks now and it's a great knife! I'm a little surprised by the price, but honestly, I was just looking for a good, cheap knife and didn't want to spend over $100 on it. This fits the bill perfectly. I wash it by hand and ensure that I don't leave it dirty for a long time, and hopefully, those two factors will enable the knife to last a long time.",
        "this make in spain stuff sucks. I cut a rabbit bone and it pretty much destroyed the blade. buy the pro german stuff made in germany. pay the extra cash.",
        "Bought this as a gift for a basic at home cook to start off with something better then cutco. I didn’t have to sharpen it out of the box. He loves the size. He’s not doing big work with it. Just basic cutting and couldn’t be happier",
        "I have a paring knife, a chef knife and a meat cleaver which I purchased when I bought my house in 1972. They have lasted all that time. They are easy to sharpen, very easy to hold because they are all very well balanced. I bought this one to give as a gift.",
        "I have used this knife now for several weeks. I normally use it for chopping vegetables of one kind or another. It makes quick work out of that job. The one drawback to this knife is I realize how dull my other knives are.",
        "Love this knife. I've owned a few restaurants in the past and have great respect for my knives. Henckels always deliver and are always part of my culinary tool box.",
        "J.A. Henckels is a great knife company, but this knife was a bit disappointing. The handle is lighter than I would expect for this size. Also, the box said that the knife was made in Spain, not in Germany. I didn't see this note in the description - I wrongly trusted the brand name. The blade is sharp and good so far.",
        "I abuse this knife. I smack it with the palm of my hand to force it to cut through frozen meats and it takes it (tried this with other brand and the knife broke in half). I don't always clean this knife right after use and leave it out with water on it and it has never shown any signs of rusting. Knife handle is very ergonomic and comfortable. Balance is good, not perfect. Edge retention has been phenomenal! I run edge on a hone once in a while and have yet to sharpen it after months of use. Excellent knife for the money!",
        "Greatly impressed with the quality of the knife. I wavered between the Victorinox and it. So i purchased a 8\" JA henkels and the 10\" Victorinox. The Henkels is a much sturdier knife",
        "Had this same knife 20 years ago. This new version is much lighter and bends way too easily. Does not feel right in the hand. Buy something else. Garbage.",
        "Bought these knives as a housewarming gift can’t say anything wrong about Henkel knives these are a great start for a new homeowner. These knives are well-balanced good guard to protect the hand of slipping as always Henkel makes great knives.",
        "Great knife. Knife was razor-sharp upon arrival. Chops and cuts well. I'm used to Santoku shape knives so am still getting used to the up-curve on the \"chef\" style knife. Only gripe is that the knife didn't come with some kind of case. Would definitely buy this again though.",
        "Finally got a really good kitchen knife. I love it. The shorter (6\") length fits my small hand. I now understand what 'well-balanced' means in a knife. I look forward to years of appreciative use.",
        "this is a great knife, the second one I've owned. bought it back in Oct. ( I think ) & is still sharp as new & use it everyday at work as Chef in local restaurant highly recommend over those japanese knifes that cost more $$$",
        "Bought this 8\" chef's knife, as I was getting tired of using a cheapo knife that came included with a cheap knife set. Overall, the knife is quite sturdy, balanced, and most importantly, sharp. I am able to cut and dice onions without crying, and had no trouble slicing vegetables and fruits very finely. I've owned a Henckel before (it was stolen :( ) and I loved that knife. This is a great replacement, and should last for a long time and stay sharp with regular maintenance.",
        "Bought this one for my daughter. I have another one for the past 10 years and it is great. I sharpen and hone it every 2 months and it holds very well until the next time. Great price too",
        "This knife has quickly become my favorite knife for slicing, dicing, and cutting through just about everything. It's razor sharp, and it's the perfect size for me. Love, love, love this knife!",
        "Most of my kitchen knives are Henckle's going on 30 years now. A keeper that keeps it's edge but like most good knives requires honing often and sharpening occasionally. Price $$-$$$",
        "After crying my eyes out trying to cut onions with a dull chef's knife, I decide enough was enough. I did some quick research and found very positive reviews of J.A . Henkels International Classic 8 inch. The knife is by far the sharpest blade I've ever owned. It makes quick work of potatoes, onions, garlic, you name it. Time spent in the kitchen is no longer a chore but a real enjoyment.",
        "I'm happy with this knife. I was concerned about knuckle clearance, but the blade is just wide enough that my knuckles don't hit the cutting board. Overall, I'm happy with it. It has a nice edge, and is the perfect size for general use.",
        "I lost my favorite Henckels knife in a move. This exact same knife cost me $135 12 years ago so the value here at Amazon is amazing! The weight distribution is perfect. I have small hands but it’s very comfortable to work with. Easily debone a chicken or slice up a fresh pineapple. Easy to sharpen. If you take care of it, it will probably last you a lifetime.",
        "My parents gave me this knife for Christmas and I loved it so much I bought one for my boyfriend as a gift. It slices through even the most annoying items to slice (like tomatoes) with ease and makes meal prep/cooking a joy. Definitely recommend the smaller 7 inch size if you have smaller hands.",
        "I work in a kitchen, and i use this knife for everything. I would recommend this knife to anyone who does a lot of prep work. The thing i like most about this knife is how thin the blade is and how well balanced it feels in your hands. It's so light weight and small (compared to my old 10\" knifes) that i just want to cut anything. I even use this blade at home even though i have 3 other chef knifes to choose from. I just love the way it feels in my hand, it's so natural.",
        "Not heavy at all, so I wasn't expecting much, but it's as good as any of my other knives. This went into my home, but I'm considering buying another one just for work.",
        "Nice as always! A brand you can count on! I love the way the metal goes all the way through the handle. Even their best competitor knives have broken from dropping.",
        "I bought this to replace one that broke, when it dropped on a hard tile floor and broke in half. The knife is well built and sharp enough to shave letters off a newspaper without making a hole! Very fast shipping and the price was good.",
        "Spine of the knife is to sharp and makes it uncomfortable to hold with a proper grip. Left my skin in bad shape after a lot of chopping veg. Should have been rounded a bit at the factory.",
        "I really like these products. Now I’ve picked my two favorite knives and bought a duplicate of each so I always have a clean one. Good job.",
        "Got this for my wife for the holidays as she is a big cook. She absolutely loves it, solid all around kitchen knife for most tasks.",
        "Great knife for the value. If you’re looking to get one knife but don’t want to spend big money this is your guy. It’s good enough in all areas for me. I cook with my parents a lot at their house and they have terrible knifes. I bought this just to live at their house so I had something usable.",
        "CLASSIC Chef's Knife, 8 Inch...very nice...real like this knife...sharpens very easy and works great",
        "Bought this knife to replace my wife’s knife that got lost. She loves it. Uses it everyday almost and has had it for over a year, still has a great edge.",
        "I received this as a gift to replace the old one that had been put in the dishwasher way too many times over many years and the handle started to come apart. I love this knife. I think its better than the old one. The slightly thinner blade doesn't take away from the over weight and handling but makes slicing more precise. Great product.",
        "Like I've read in other reviews; the top of the blade is sharp enough to cut oneself, if not careful. I simply took the edgde off with a bastard flat file. Feels fine now. Other than that, it's great for what I use it for.",
        "I love my knife. It's the sharpest knife I've owned by far. I'm happy to say I'm enjoying it. I brought a ball of sirloin beef & I butchered it myself into steaks, striped beef & cubed beef. This knife is going to help say me some money on groceries. Great but!",
        "Up until I bought this knife I had cheap crap bought from Walmart. I'm sure there are fancier knives available but at the price point I absolutely love it. Solid build, feels great, and sharper than any knife I've ever owned. I've prepped about 2 dozen meals, veggies and meat, still super sharp. As an entry level knife at a great price, it's perfect for me.",
        "Not the quality I am used to from Henkel. Handle feels cheap and balance is disappointing.",
        "Great design. Fits nicely in my hands. Razor sharp. I have bought several Henkels knives in the past and they have never let me down. They also have a \"lifetime\" warranty in case you run into any problems.",
        "I bought this chef knife to go with an old Henckels set I inherited. Not only is it a perfect match, but it definitely does its job. It slices meat cleanly and quickly and chops right through tough vegetables with no see-sawing. With enough pressure, it can even chop the ends off an entire bundle of asparagus in one shot. There's a reason people pass J. A. Henckels knives down through the family and the quality is IT!",
        "This knife, the grinding workmanship is so poor you can not keep an edge on this knife, i spend more time re-stoning this knife than using it. Don't waste your money",
        "After reading reviews about this knife I was concerned about the quality. Having owned German made Henckel knifes I can say that the quality of this knife is reasonably good. The metal quality of course is not the same as the German made knives. But it is still a very good knife. I don't know how people had tips break off probably from dropping them or prying with them but that would break any knife. They need to be sharpened regularly but sodas any other knife.",
        "Fantastic budget knife for working in a prep kitchen. Sharpen it after every 5 or so uses with a 1000/6000 two-sided stone and it should hold for years.",
        "My husband was looking for a knife like this. He was so happy when I found this one. Good knife and price was good too!",
        "This is the second Henckel 6-inch knife I purchased for my mother. I purchased a second knife so she wouldn't have the wash the first one. Though a bit pricey, they are excellent staples in any kitchen. They are not in any sense flimsy and because of their heavier weight, makes cutting and chopping so much easier.",
        "My favorite knife now. I have lots of shapes for different jobs, but this is the most useful, all around.",
        "Our family loves to cook and we all take turns using this knife. It's a great, solid, all-purpose knife. J.A. Henckels is the best!",
        "I own several Knives in both Kitchen and Survival form, With the Low End starting at 20 Dollars and the High End hanging around the 200 Dollar mark. I originally bought this Knife for a friend and have since bought one for my own Kitchen, Its Sharp, Has a great Weight to it and looks nice, I personally suggest it to anyone looking for a decent Kitchen Knife.",
        "This is a good starter chef's knife. Not too bad on the wallet and pretty sharp! So far no complaints",
        "Excellent. So sharp. Feels amazing to hold and cuts through even the hardest veg like butter. Very pleased with this. Only wish it came with a sleeve.",
        "Work in a professional kitchen and this is a goid bladeto have. I like the weight and it hilds and edg well. Only down fall is that back of blades edges are really sharp and have cut me a few times when applying pressure to the back of the blade with my hands.",
        "This knife is great. This is our go to daily knife. It is sharp and feels very solid. Best part is that we can run it through the dishwasher.",
        "I love using this knife. It's easily my go to for just about everything. It has stayed very sharp. I would definitely recommend this knife as your workhorse in the kitchen.",
        "Didn’t stay sharp for long. It’s about as sharp as a butter knife now. Even tried to sharpen it and it’s a little better but still dull.",
        "Maybe it's just that I had been used to cheap and dull knives, but this is unquestionably the best knife I've ever used. I still can't neatly cut tomatoes to save my life but my issues are all user error now.",
        "I get all of my knives from them. Very sharp and stay that way with very little maintenance. Was worried about quality as they are modestly priced for nice knives, but really top notch.",
        "I bought my husband this for a gift after researching and seeing it was good quality. Come to find out, we had the exact knife already that I got him a few years ago. It is very sharp and he loves to use it!",
        "Purchased this knife for my wife who is a smaller lady and it fits her hand perfectly. She really likes it.",
        "Great every day knife. Replaced an old favorite. Was worried about it being sturdy enough, so far so good.",
        "What a fantastic knife. It's the sharpest blade I've ever owned. I do 80% of the cooking in our house and I use the knife every day. Slicing and dicing is a pleasure!",
        "feel great in your hand, no slipping and cuts everything like butter. Keep em clean, no washing machine and hand wash and dry no abrasive surfaces to keep the blade shiny.",
        "Waited along time for this knife and I am happy so far only one month in.",
        "Nice curve to blade allowing good rocking motion for mincing/dicing .",
        "This purchase is a gift but I am very pleased. The quality is excellent and the feel and weight are just right. The engraving adds the finishing touch. Wish I had one!",
        "I like the weight of it and how easy it is to handle. The finish of the handgrip is pretty nice and gives you a good grab of it. Factory sharpness is not so great and that's why I'm giving it four stars, overall is a good value for the price.",
        "Why did I wait SO long? At 53 years of age I finally decided to splurge on a good knife and what a difference it has made!! This knife feels great in my hand, nice balance and REALLY sharp. WISH I had known 30 years ago how important and wonderful it would be to have a sharp knife - but i do NOW! Onward!!",
        "The knife came in a very well packaged box to protect it during transit. The warranty registration was super easy to do. The knife has a good weight to it. I find the handle to be very ergonomic which makes the knife easy to use. It is on par with our Wusthof and other Henckels knifes we already own when it comes to quality.",
        "This is a good knife for the price. Came sharp and I use it every day. I only need to hone it with my Accusharp once in a while. If my kitchen had one knife this would be it."
    ]
}