{
    "entity": "On-Ear Headphones",
    "text": [
        "Bought these years ago and still use them. Durable and sound great. Over time the foam ear pads disintegrate, and it's hard to find more the same size. Also the adjustability gets a little loose and the ear-pieces flop around while handling the phones. These are minimal things one might expect with wear-and-tear, however. I use these every single day with my computer. The sound is wonderful. These are also indispensable when traveling. They drown out airplane noise quite well, and work on crying babies too.",
        "I had a older pair I paid much less for, but still loved. Husband finally stretched out my pair and I went looking for my own again. The Amazon Warehouse pair came in excellent shape. Happy buy. This is a excellent headphones, wired. The noise canceling is so so, really just a slight white noise hiss, but it seems that is all most of them are. The little button on right side gets forgotten to shut off u till the battery is gone, - but the great sound and comfort for wearing far offsets the. Noise cancelling disappointment.",
        "When I fly I hate it & the last thing I need is a person next to me that can't stop talking. These tend to do the job, that & a couple of Rum & Diet Coke.",
        "These are wonderful. They don't make these anymore, but they are absolutely the best. Newer versions are not near as powerful, and don't totally drown out outside noise the way these do. And they last years at a time. Battery life is excellent. Sound couldn't possibly be better.",
        "They'd be a lot more user friendly if they were a folding design. In my normal working environment they do a good job of taking out most of the noise of cooling fans, but they don't remove the higher frequency hiss of air and they either leave or add a low frequency thrumming. I tends towards them adding it because I've never been aware of it even when all the air cooling systems are off. Audio quality is OK, I wouldn't go further than that. I have yet to find a consumer offering, including the Bose headsets, that comes anywhere near to the combined active/passive effects of a good aircrew headset. Still searching for a good solution.",
        "For the price, these headphones can't be beat. Noise cancellation function works well. I've used it on airplanes, in front of my computer and in a hotel room with an a/c blower going 24x7 and it helped significantly in all situations. Of course it would be nicer if its effective frequency range included higher frequencies. It has some of the problems mentioned by others -- the somewhat uncomfortable hard plastic head piece -- however I find them to be fairly comfortable overall. The people who are complaining about smashed, uncomfortable ears are wearing them too far back on their ears. It's not necessary to cover your entire ear with them.",
        "Read all the reviews. These sound great! even my best friend who is an audio snob agreed that these sounded very nice. They too did a pretty good job of getting rid of the air and engine noise. (airplane) Warm on the ears as some complained? yes a little, but what do you expect when you have something covering your ears. Overall comfort is fine. Battery compartment being on the head band posed no problem to me or anyone else that tried out my heaphones. Going on a long flight next week. I will only re review if I find something negative to report. Great savings buying online on Amazon.",
        "I bought these for two main reasons, walking around noisy neighborhoods and mowing the lawn, both while listening to my MP3 player. While they cut noise significantly, they had the tendency to cause a whooshing sound when wind hit one of the earpieces, probably caused by the noise canceling circuitry becoming over excited. That made noise canceling mode useless for walking around. In an inside environment, like an airplane, where breezes won't excite this problem, they work very well. Sound reproduction quality was very good, bith with and without NC enabled.",
        "I've used these primarily on airliners. They are great for the money and worth buying. Pros: A clear value and comfortable enough for a couple of hours wear at a time. Cons: A little bulky compared to Bose QC3 and the headphone bag doesn't offer any protection. Not as quiet as Bose QC2. Don't let the comparisons with Bose discourage you. If you have a few hundred dollars to spend on headphones and you use them all the time, go with Bose. If you want something less than $75, these are a good choice. Just find one of the semi-ridged Bose cases to store them in.",
        "The Foam around the ears was really worn out, but I knew it would be. What I did not know is the clip that held the AAA battery was broken & missing! I had to use Electricians Tape to hold the battery in.",
        "I used these phones with my MP3 player (Sansa e250) in several circumstances. 1. They reduced airplane engine noise to level that was noticeable but not annoying. I was not sure if the residual sound was conveyed by vibration or heard, but the difference, when I took the headphones off, was astonishing. If it matters, I was in tourist class over the wing on Boeing 737s. 2. I used the headphones several times while shopping in a large noisy supermarket. They blocked the background hubbub out completely. 3. I used them walking on a main street. They blocked out most of the traffic noise to the extent that I was able to enjoy my music.",
        "Very disappointed with these headphones. After 1 week of using with my ipod, the right side stopped working. I returned to Amazon and they graciously gave me another product (expedited). The noise canceling was not very good but I lived with it. Now after a few more months, it is again not working properly...for songs, you can no longer hear lead vocals, just the instrumentation and background vocals. For audio books, there is no sound at all. It's weird and I'm baffled. Don't think it's user error, as there are no settings on the headsets. Even cheapy headphones that I've had for years still work. I used these for running so maybe they were not meant for that?!",
        "I used these on three air trips until on the 4th one they suddenly started delivering low-volume, distorted sound. This happens both with the noise cancelling on and off, and with any type of source (iPod, computer, etc.) Basically they are now unusable. True, I didn't pay Bose prices but I'd still expect any set of headphones to last more than 4 uses. I believe this is more evidence that Sony quality has dipped significantly compared to years past. I would recommend saving your money and buying a higher quality product--at least one that will last more than a few months.",
        "I brought these on board a prop plane on a trip over the great lakes and I could not believe how wonderful a difference these headphones made. I brought along another set of standard ear phones (buds) and I could not even hear the audio from my iPOd. I switched to these and what a difference! I could barely make out any noise outside the cabin and the music came in nice and clear. They are also \"OK\" headphones for daily use. My wife has no idea that they even have that NC feature. She likes them just the same as any other pair, so for the price, its totally worth it!",
        "I love these headphones 🎧 they lasted a couple of years before I had to lay them to rest (Sad day 🤦🏽‍♀️😭) rip...... Very loud , noise cancelling on point, and very durable.I would definitely purchase them again.",
        "I like the way the headphones sound. We have a noisy central heating system in the house and when it is running they seem to be able to filter some of the rumble from the forced air heating system. Unfortunately, when the heating system is off and the house is relatively quiet, there seems to be a background hum introduced by the noise cancellation. I typically switch off the noise cancellation when the heater is off, since I prefer the music without the background noise. I haven't yet used them on an airplane, but that day is coming soon.",
        "I am a medical transcriptionist and wear headphones daily. These are the best I have ever used - and I have tried a lot. They are comfortable (a little tight when you first buy them but that only lasts a few days), lightweight, and the sound is unbelievable. I have to have good quality sound to be able to understand what my clients are dictating. I rarely use the noise cancelling feature - the sound is so good that I don't need to. If you need good quality sound through your headphones, you won't be dissappointed with these.",
        "I travel a lot and hate the constant buzz on an airplane, either from the plane or the other passengers. This headphone set is my first noise-canceling type and I am very pleased with its performance on a plane. When switching the noise canceling feature on and off, it is very apparent of the background noise that is eliminated. I actually need to turn the unit OFF to speak to the flight attendants when they come down the aisle. The headphones could be more comfortable though. I would give these a 3.5-star if based on comfort alone.",
        "These headphones are comfortable but I have not used them for extended time yet.The sound quality is great but everything I've had from Sony is better than most and this price was excellent for the refurbished unit. I saw places selling new ones over $100. They look brand new. The noise reduction,(nothing cancels all noise)is better than my previous ones. The real test is when I get on a diesel tractor this summer. They fold flat but the other models folded once more at the top of the headband making them even more compact. The real test is long time comfort.",
        "I picked these noise canceling headphones mainly for their price. I could not justify the cost of the Bose units for the small amount I need them. They are very good as earphones. I have worn them for several hours and they did not become uncomfortable. The frequency response is as good as my ears can pick up. The noise-canceling is OK, just as others have written. I have not yet tried them on a long flight. That will be the ultimate test of their ability. Overall, I am very satisfied with these earphones.",
        "For the price (under $35), these are a bargain. The sound quality and noise reduction compare favorably to sets costing much much more. Pros include: Turning noise reduction on doesn't change volume or equalization of the audio Very good sound quality Good sensitivity Price Cons include: Not the most comfortable set to wear - after several hours, my right ear hurts from the pressure Giving it 5stars because of the price/value.",
        "I tested this item at Sony store before purchasing it online. I am extremely happy and satisfied with this headphones. I use it alot when I'm at work (to avoid noise and hear personal conversation) and also when I am on public transportation. The sounds and especially the bass, which I like, are great. I cannot wait to use this when I'm on vacation (airplane). The only con: since it is new, my ears get sore (squished) after awhile but I think it will be ok if I continue to use it. I highly recommend this to everyone.",
        "I have owned them for about a month. I purchased them for a long jet flight. The noise cancelling was MINIMAL in a jet cabin enviroment. I was just as well off using my ear-buds. I also tried them while operating a 2-cycle snow blower, no good for that either. They do work VERY well on low level, low frequency noises. i.e. in the car, in front of an A/C or fan, computers etc.... And the \"open\" design does permit hearing voices quite clearly. The sound is fine, no problem there. I found them to be quite comfortable.",
        "Now I do love Sony products, and when I saw these headphones that were noise-cancelling at a good price I had to try them out. The headphones work well, sound is good and clear and they are pretty comfortable. The noise cancellation is okay, I took them on a recent business trip and they did block out some noise but not nearly the quality of some other noise canceling headphones. For the price though, not too bad. I use them on a daily basis at work and they seem very durable and up to the usual Sony standards.",
        "I love my headphones. I use them with my IPOD nano and they really deliver the kind of sound that I want to experience. I feel they are comfortable and do use them around the house and when walking a little bit. We own 2 sets of these headphones. One for me and one set for my husband as we both have our own IPODs. Bought them on Amazon as reburbished at an excellent price. The headphones looked just like brand new and would buy refurbished again. Very happy with product, price and service.",
        "I bought these headphones to listen to my Creative Vision M which I use in the New York City Subways. The noise canceling works mainly to eliminate low frequencies and works well with subway rumble. In addition when the noise canceling is turned on, the volume is amplified and that is great considering the noise in the subway that is not cancelled. For $35 you can't beat these very high quality headphones with excellent battery life. If you really want noise cancelation, pay over $300 for Bose :)",
        "I have had these headphones for a couple weeks now and they are very nice. The sound quality is beyond good and the noise canceling feature is unbelievable. They are great for removing the hum that most motors and fans make. You can still hear sounds in the room pretty clear but not the motor sounds. The computer makes a lot of noise you can tell this when you use these headphones. They also twist to allow them to be placed into a suit case or laptop bag. Hope this helps.",
        "i've had a pair for about a year and always take them on flights, which is the only time I use them. As with all noise cancelling headphones, they remove only the low whoosh of the airplain noise, but this makes a huge difference. When I first used them, my ears got sore after about an hour, but now I can wear them for five hours without any discomfort. They have been very durable and the battery seems to last forever, or at least longer than I expected.",
        "Got these as a Christmas gift. Very happy with them. I find them to fit comfortably and the noise cancelling works pretty well. I use it on the bus each day and it does a great job of cancelling out all the road noise and a good portion of the bus engine. It doesn't filter out all noise, but I seriously doubt any product does. While other models that cost a lot more may provide more noise cancelling, I find these headphones to be just fine for the most common uses.",
        "I only used these for flying, which I do maybe once a month. After less than 10 flights, the noise cancellation feature stopped working. Passive noise cancellation is almost nonexistent, so I was forced to get a replacement. Sound quality is pretty good for the price, but I was looking for something to wear while flying. There are plenty of other noise cancelling headphones in this price range. I recommend trying one of them.",
        "I bought these headphones to block out noise when I travel and they have worked very well. I used them recently on a 10 hour flight to Italy and was able to block out 85% of the noise including a screaming baby. They are suprisingly comfortable and I was able to wear them while I slept on the plane. My only complaint is that the battery is in an odd place and the battery housing is very flimsy. I have already broken off a piece of plastic. They are still usable, but I am afraid they will not last through a lot of battery changes.",
        "Disappointing headphones. I still use Bose Quiet Comfort headphones. Former girlfriend lost my newest generation Bose, so I bought the Sony as I like not having a separate piece for the batteries. Used part of one commercial flight. Headphones do reduce some of the aircraft noise, but are fairly uncomfortable. The ear piece is hard. The sound from my audio device was harsh. I do not recommend the headphones.",
        "Great deal for the price. I paid $31.99 including the shipping. These work nicely and act as passive headphones also. I've tried similar and much more expensive headphones and found very little noticeable difference for my applications. (Including the Bose noise cancelling headphones which are not passive) These Sony MDR-NC6 Noise Canceling Headphones are a great purchase but don't take my word for it. Get a pair for yourself. I'm going to get a second pair for home since I use the first pair for work.",
        "I bought these specifically for business traveling, but find that I can only tolerate these earphones for an hour on the plane. They work very well in noise-cancelling, but then they start to hurt my ears after only an hour! Plus, they aren't as compact as I had hoped. The ear pieces swivel inward, but the band doesn't fold at all. That means they're still a bulky item to bring with you. If I had known these things from the start, I wouldn't have gotten them. My next earphones will have those cushioned cups that enclose the ears- those look so much more comfortable.",
        "Due the price of the Sony product vs. Bose I went with the Sony to see if noise cancelling headphones were worth it. For the price these work very well. I have used them on a number of flights and I am very pleased with the performance. The included two prong adapter is also very handy. I have listened to Bose head phones and they do seem to cancel better but for the money these work just fine. Five stars!!",
        "I have the more expensive Sony in-ear design as well, and I like these more. My previous in-ear headphones kept slipping out, but they were more for size and fashion style. On the MDR-NC6 the bass, mid range, and treble is extremely clear, giving new life to my NetMD walkman. The earpad cushion felt comfortable during a 3 hour flight, and there is only one audio cord to deal with. Engaging the NC circuit seems to also boost the bass frequencies, nicely done Sony. The NC circuit hiss someone mentioned is a moot issue if you are truly in a noisy environment: airplain, laundry room, hotel air conditioning, computer server room, etc.",
        "This one is my first headphone which I purchased separately, did not come free with some audio device. It has a noise elimination feature which is pretty slick technology and works perfectly in flight. They also provided the two pin adaptor to work in flights. I am not claiming that this product is the best since I can not compare with other head phones but for the money it is perfect for my budget and it completely serves my purpose.",
        "The sound quality of the headphones is pretty good. Bought these with the intention to use of flights to watch movies on a dvd player...while they do eliminate some of the noise on the plane they do not block all. For the money, these headphones are a pretty decent deal...I would recommend getting a volume booster to go along with these headphones (or any headphones for that matter) if planning to use on flights. One huge benefit to these headphones is unlike the plug-in ear type, after a couple hours of use my ears did not hurt.",
        "These earphones perform about as expected. On a crowded airplane, you still hear a lot of people noise as well as the rumble of the plane. You can, however, hear the audio fairly well, although it required a little more volume than I like. As long as you aren't expecting really great sound, they're fine. They are a good option for the price, but don't expect Lexus sound on a Kia budget.",
        "They're heavy, no head padding, and noise-cancelling works but the white noise is too loud for my taste. Don't get me wrong, they're good for the price but I found it worth it to purchase a higher end pair. I purchased the Phillips shn9500 and I'm very happy. The Bose being a 10/10, the Phillips is an 8/10, with this Sony NC6 being a 5. I ended up returning this pair. Conclusion: good looking pair but falls short on execution.",
        "I suppose whether you like these or not depends upon whether you want to be seemingly \"surrounded\" by music (turn the volume up to 30 - that'll do it), or you want comfort. I tried these on a flight from Minneapolis to San Francisco just last week. They didn't cancel out the 2 year old behind me, and after 15 minutes, my ears were hot and my head was flattened from the sides. After an hour, the \"pain\" took my mind off any emotional problems. In other words, sounds good but uncomfortable as wearing two scrubbies, rough side in.",
        "I've owned this since 2006, and it still works! Sound coming out of it is still crisp and the noise-cancelling feature, though lacking when compared to more pricey units, can be claimed as decent and gets the job done. Obviously this is too old to be recommended, but Sony has done a good job with this headphones.",
        "Not worth the money for sure. I bought a pair of Maxell headphones at Walmart because my order didn't arrive in time for our plane trip. Amazon customer service was fantastic to reship to our hotel in Hawaii and they arrived in time for our flight home. We compared Sony vs. Maxell side by side and Sony was no better than your average $5.00 pair of headphones. A real bummer!",
        "I can't believe that I got these Sony Noise-Cancelling headphones for under $30 with free shipping. They have got to be one of the best bargains at Amazon. The noise cancelling feature is really nice - it filters out a tremendous amount of ambient noise and allows the music to come through pure and strong. They could be a bit more comfortable after a long period of use, but this is not very significant. My Ipod and my computer never sounded better than through these Sony headphones. What a a bargain - I may buy a second pair for my wife.",
        "I bought these headphones for my college son who was having a hard time concentrating in the noisy dorm. He loves them and even brought them home with him over vacation because he wanted to use them on the airplane. As far as I can tell, they are as effective as the very expensive pair with the big name I already own and are actually less bulky. I'm considering buying another pair for myself.",
        "Have four pairs for a long time. They were a bargain and work great. These do not cup the ear. My next ones will cup the ear so the passenger next to me cannot hear. They cut out airplane engine noice nicely.",
        "I couldn't afford the high-end noise canceling headphones and they are doing construction near my cubicle so I needed something. I took a chance on these but I wasn't expecting a lot. These earphones really work well for my needs. I can certianly see a difference and when I've got my music turned on at a medium level, I can't hear much of anything else.",
        "I sat next to a gentleman on the plane the other day with noise blocking BOSE headsets. He was surprised that my headsets blocked the same amount as his. Pretty cool. My only issue is that the headsets are a little uncomfortable after an all day wear. I must say I do prefer the cushioned ear cup style, but for the price & noise reduction, these are awesome.",
        "I purchased these headphones to use on flights with my mp3 player. It does a pretty good job of cancelling out the drone of the engines, and the sound quality is very good. When powered off, the quality of the sound decreases but that's not what they're for. One rechargeable AAA battery lasted for a round-trip trans-Atlantic flight with power to spare.",
        "These headphones do produce satisfactory sound. However, they do not satisfactorily reduce ambient noise. Also, these headphones do not have a sound level control on the plug-in line. Turning on the ambient sound filter increases the sound level of the earphones. Finally, the earphones are large, cumberson, and look ridiculous worn in public.",
        "The MDR-NC6 doesn't quite compare to the Sony MDR-NC50, but this is a great deal considering the price. I use these for the train ride to work, which is 1 hour each way and the noise canceling works well with the train noises, but does not block out peoples voices very well. I had been using the standard ear buds that came with my mp3 player and in comparison there is, of course, a considerable difference. After wearing these for about an hour I do begin to feel the pressure of the headphones on my ears. Other than that, no complaints.",
        "Initially the headphones sounded like crap (no bass and no high end, everything was washed out), but after 2-3 hours of use, the bass response was really good, i felt like my head was vibrating. the high end also became alot better. I guess these headphones required breaking in. the noise reduction works decently. there is a slight hiss when its on and when theres no audio. but the hiss is virtually gone when the music starts playing. I bought this for $25 on amazon so i didnt expect too much. But for $25, it sounds pretty good, comparable to some slightly more expensive headphones.",
        "For very short periods these headphone work well... good sound, reasonable noise reduction. BUT there is no well for your ears so the foam pads press your ears flat and for extended wear (as in anything more than about 30 minutes) they hurt. The battery compartment also presses against your head. It doesn't matter how great the sound quality is if you can't wear these for more than 30 min at a time. I expected more from Sony. This is the first time I've been really disappointed with a Sony product.",
        "The only thing noise-canceling about these headphones is the fact that the ear pads are larger than my previous ear buds. In fact, with the noise-canceling feature turned on there is a distinct white-noise hissing sound, reminiscent of those old cassette tape Walkmans. Very disappointing, but now I know why they were fairly inexpensive. They do sound decent, hence 3 stars. But to call these noise-canceling is false advertising.",
        "The headphones are lightweight. They don't take up much room (we use them for air travel). Watching movies or listening to music on a plane is so much better, even just sitting and reading is great. They block out the plane's droning noise wonderfully and you can still hear people speaking to you while you're wearing them.",
        "The sound quality is not as good as the Bose Quiet Comfort 1, 2, or 3. But you know what? These cost 10x less. And on an airplane you won't really notice the difference. Also, if your battery goes dead, these will still output sound while your Bose will go silent. I bought these as a replacement for my stolen Bose for that reason alone. I don't like carrying a whole giant pouch of batteries \"just in case.\"",
        "Since I bought them at a good price and they function well overall I guess one can't complain too much, but they do hurt your ears with time. Perhaps streching them out a bit would help, or buying a thicker padding for the earpieces. Obviously Sony has moved on from these but thought I'd post the review anyways...",
        "These headphones deliver great sound. The noice cancellation feature is cool, but it doesnt do very much, and isnt very noticable when music is playing. The only real drawback is that they put a fair amount of pressure on the ears, so after a long duration of having them on, they kind of start to feel annoying.",
        "I wear these headphones 6-8 hours a day when working. They not only eliminate extraneous noise, they give great sound reproduction of recorded media. I was a bit concerned that some reviews I read rated them low on comfort. I find them very comfortable. I have recommended them to several friends. A great buy!",
        "I bought this as a cheap option for a noise cancelling headphone. Unfortunately this one doesnt reduce the noise that much, In addition it adds its own hissing sound while the noise cancelling option is enabled. If you need a good quality one and have the money to spend, always go for a Bose.",
        "The noise cancellation of these headphones works quite well. The construction is sturdy, and the value is good. My only complaint is that there is no padding where the top of the headband rests on the head. Oddly enough, there is a rather pointed strip of hard plastic that sticks out there. I taped some padding on that spot, and the problem was solved (in a kludgy, but effective way).",
        "These noise-canceling earphones are terrific. They substantially reduce the background roar of jet engines while in flight. The added bonus is they nullify the squeals of unhappy jet-bound babies and small children. They also work well for airline movies and DVD players. Sony makes a quality product. These headphones are comfortable and you can't beat the price. I bought several sets as gifts too.",
        "I have used it on my flight this week. The headphones do cancel out back ground noise effectively at the airport and in the plane. I was looking for a reasonable product with good price and this fit my qualifications. If you are looking for a high performing one, buy Bose but if price matters, you can not go wrong with this one.",
        "These headphones, while not the quality of a Bose (and certainly not the price!) do just what I ask. They cancel outside noise fairly nicely and produce a nice sound from my iPod. In addition, the headpieces turn so that they lie flatter than if they were 'regular' headphones. Worth the price!",
        "The ear pads have to be replaced all the time, and now they don't make those anymore so I had to toss the headphones. Sucks, because I paid big bucks for them. They don't work on airplanes, though.",
        "The noise-cancelling feature on these headphones is not all that spectacular, but what can you really expect from a set of headphones this cheap? I think they're a good buy for the price and would probably buy them again. I also like how the cord only connects to the one side, making them a very comfortable and easy to wear fit.",
        "Great headphones that worked as expected. Very comfortable for the long haul and the noise canceling feature was greatly appreciated when we had several crying children on our flight. We used them for a portable DVD player as well as for the inflight movies. The price was outstanding for the quality.",
        "I fly a LOT for work and was looking for some good noise cancelling headphones without spending a fortune. I have a lot of Sony products so thought I would give these a try. These were comfortable to wear on long flights but the noise cancelling was really poor. I returned these and instead have the sennheiser PXC250. I've only had them a short time but they seem pretty good.",
        "My reasons for purchasing these was simple, I wanted to be able to hear the movie while on airplane flights and these worked perfectly. So for the price you can't beat them. Remember though, these are not Bose so don't expect the same quality as these will not provide that. But, if you just want to hear the movie then these will work for you.",
        "I purchased these headphones for use on a recent trip to Europe. Noise canceling? I am no longer sure what that means for it didn't seem to make any difference whether I had the headphones turned on or off. However, these headphones are far better than those supplied by the airline",
        "I was very disappointed with these headphones. The ear pads are rigid and very uncomfortable after a short period of time. The ear pads do not surround the ear so they do not \"cancel out\" noise in the room well at all. The sound was good but they didn't do what I needed them to do which was cancel out the noise in the room. I returned these.",
        "I use these for my work which is transcription. I love them! They are comfortable and the sound is very clear. I also love the noise cancelling function as I have a husband who likes playing the TV loud and two small children. Would recommend buying this product.",
        "The Sony MDR-NC6 Noise-Canceling headphones are OK as headphones go but the noise-canceling circuitry is what makes them good. I know there are lot better units out there but not at the price I got from Amazon. If you are interested in headphones for traveling, you should give the Sony's a shot.",
        "Great product at a reasonable price. They definitely helped cut the noise on our cross country flight. Occasionally, I would get some kind of static in the left earphone but other than that, they worked perfectly. I could hear the flight attendant, my iPod, but not the roar of the airplane. Such a deal.",
        "I've been using these headphones for about a week now. I'm pretty impressed. The sound quality with these is great. If I could change one thing, it would only be the length of the cord. This is about 12\" shorter than my older headphones and I was used to having more room to move. Not a deal breaker and the sound quality still outweighs that drawback.",
        "Still the best. I have bought 4 pairs over the years.",
        "Not only did this set of headphones not deliver muich noise canceling, but one of the earphones quit working. The replacement headset fared no better. Check out a Brookstone product that used to be $150, but now is between $60 to $70. They may not isolate you as well as either of the super-effective (and super costly) Bose, but they come very close and do a credible job for a lot less money.",
        "Don't be fooled by reviews that talk about a hiss noise. It's very minimal. I have used these on several flights this month and they perform as you'd expect a SONY product to perform. The engine noise on the plane is almost gone completely when you have these on. I watched several DVD's using these in my laptop and I could hear every word at half volume. Can't do that with a regular pair of headphones. Go ahead and purchase these, well worth it!!",
        "There is a slight reduction in regular, low-frequency noise as in air travel, but these are not nearly as effective as Bose or Audio-Technica. Additionally, these are very picky about how they are positioned on your ears -- it has to be Just So to work.",
        "This was a gift so all I know is these specific headphones were requested and they are happy with them",
        "I use these at work when the natives get restless! The noise canceling feature blots out most of their conversation, and then I turn on a Pandora channel to take out the remainder, and get back to work.",
        "Really nice, noise cancelling headphones. You would have to spend $100 more to get anything better",
        "There is really not too much to complain considering the price I spent on it. The headphone works fine, but it didn't meet my expectation on the noise canceling part. It does cancel maybe 40% of the low frequency noise. However it also creates a fairly loud static noise of its own, and it appears to amplify the high pitch noise a little bit. It's over the ear design also cuts down the effectiveness. If you are really serious about eliminating the noise and don't want to pay for a Bose, I'll say get a Panasonic RP-HC300. I got one myself after the Sony and it does much better job.",
        "The Sony MDR-NC6 noise canceling headphones are great for the price. I use them in a noisy work environment and they cut down a lot of the outside noise around me. I can then listen to my music at a much lower volume. When I have used other headphones I have to turn the volume way up just to hear my music over the machine noise. After a short period of time, my ears would begin to hurt. With the volume lower on the Sony headphones, I can listen at a comfortable level and still get a great sound.",
        "The noise canceling does not do good. You still hear the sound from outside. I feel the same as regular headphones plus when you turn on the noise canceling button, you will hear some kind of noise from your headphones. If you are looking for the noise canceling headphones, it won't work. But it is fine as using a regular headphones.",
        "These kill the low frequency back ground noise and they do that very well. They are not the most comfortable headphones, but not bad. The battery compartment is a minor pain to get into. All that said, for the price, a good buy.",
        "This is my second purchase of the Sony MDR-NC6. I had the first set for over a year. The second set went to my son who is 13. All his friends want him to sell... He uses these with an iPOD and has outstanding results... Excellent purchase.",
        "Sound is good; suspect the Noise Canceling works, but with most small headphones, there is No adjustment to the head to make it comfortable around my ears, which means that what I really need are those Big, soft, gentle Sony headphones.",
        "I am a frequent flyer and rely on headphones for a peaceaful flight. These were certainly NOT the ones for that purpose! I've actually started using my old ones again. I've given these to my son for his DVD player in the car.",
        "The headphones are OK in substantially reducing the noise in a cabin, but I expected much more. This is probably not so much the fault of this particular headphones, but rather the problem in canceling plane engine noise in general.",
        "As a frequent traveler I had want a set of noise canceling headphones but was far too cheap to spring for the $300-400 ones. I bought these on a whim for my wife and I and we used them on a non-stop from Atlanta to Hawaii. They were great particularly on the red-eye back! I highly recommend them as a great value.",
        "This is my second pair of these. First pair got caught in vacuum and torn. I use them on airplanes and to listen to TV at night with sound off. They are perfect for those uses and I am not audio techi. At 64 my ears hardly could benefit. My only issue is the on off switch. It you are not careful you can forget and keep them on by mistake. The noise reduction is not needed except on planes so I sometimes remove the battery to avoid the issue. I would recommend them and the price is right.",
        "I wanted something better than ear buds for my treadmill work outs and these filled the bill just fine!! Cancels the treadmill and fan noise AND an on the ear ( not around the ear) comfort level. Good sound quality too.",
        "I would call these \"noise reduction\" as opposed to \"noise cancelling\". These headphones cancelled most of the engine noise on my flights. I didn't even have to crank the volume on my laptop and cd player. Only complaint is that these headphone felt a little tight, unless my head is too big.",
        "They are all right. Nothing spectacular. They aren't sleek. The noise cancelling feature doesn't work as well as in ear phones or phones that completely encase your ear. Also, after wearing them for a few hours, they hurt my ears.",
        "I bought these after my daugther broke another pair of inexpensive noise cancelling headphones. My old ones worked better on Lawnmower noise. I haven't tested the Sony's with airplane noise yet. The headphone cord also lacks a volume control, a feature I miss from my last pair.",
        "For the amount you pay for these headphones they are worth it. I'm sure that ones in the 100.00 range would be better, but these work for those not wanting to break the budget. They have a switch on them that when flicked drowns out all the noise around you, its great. Perfect for airplanes!!",
        "There is absolutely no noise canceling to these headphones. As headphones they have decent sound, but the noise canceling actually increases the noise at times. Short cord, okay for travel or walking but not much use at home. Do not buy for the noise canceling. Definitely $35 headphones.",
        "They didn't last long. No longer have. Moved on to another brand.",
        "Some reviews complained that these were uncomfortable after using them for a while, but I took a chance. The ear piece is flat and does hurt your ears after a while. Sound is OK and they work fine but uncomfortable."
    ]
}