{
    "entity": "On-Ear Headphones",
    "text": [
        "Step 1: Buy the Porta Pros Step 2: Open the box and plug them into your preferred listening device Step 3: Play your favorite tunes Step 4: Let the sound melt you into a puddle Step 5: Write a review Step 6: Spread the word Step 7: Buy a pair for a fellow music lover Step 8: Realize you can’t do any of that because you’re a puddle now Step 9: Realize they’re compatible with glasses and have all these intuitive, useful features no other headphones have Step 10: Begin to believe that aliens visited Koss in the 80s and provided them with this technological masterpiece because they’re still cherished after 35 years",
        "The key word to associate with these headphones is EQUALIZER. Out of the box they're too bassy and the treble is muted. Boost the treble at 1kHz and over and lower the​ bass at around 200Hz and they sound good. I almost sent these back thinking they were just junk until I decided that all the positive reviews couldn't be so far off, and I worked to tweak the sound (certain websites giving info on their frequency response helped also.) After that, I'd say good headphones for the price. [Edit] I have attached a screenshot of the equalizer settings I use on the Pi Music Player as a reference.",
        "I expected better sound for the price range. Bass is both overpowering and slightly muddy. They have quite high impedance for being mobile headphones and you'll have to turn them up quite loud to get the best sound reproduction. You can get ear buds that sound twice as good as these for the same price range. The metal strips WILL tear hairs out of your head. They'll also fall off of your head without fail if you bend over. These might have been the pinnacle of portable headphone technology at their inception, but they show their age. They certainly aren't worth the 40 dollar price point that they're currently at.",
        "I am a seasoned Audiophile with some pretty nice gear. I like a nice warm sound, which most humans do whether they realize it or not. I do not like how you have to worry about keeping bluetooth headphones charged and all the annoying beeps they make and how bluetooth audio sounds overall. Also \"noise canceling\" makes me feel sick. These headphones are simple and they work really well. They are light, easy to carry on the go and have a nice sound and don't stick out and make you look like a doofus like 99% of headphones do these days.",
        "I read the reviews but frankly can't understand the hype. These phones deliver very modest performance, aren't very comfortable, appear to be easy to break. When they break I won't ask for the free replacement. I have $6.00 earbuds that offer better sound. A real disappointing purchase. At least I got them at about $10 off. The sound is muffled, like listening through a wet towel. No detectable bass.",
        "Great pair of headphones. I needed to be able to hear what was going on around me in my caregiver situation and these worked great. I must say that I am very picky about the sound quality of my music and wasn’t expecting their sound to be as good as a pair of Bose headphones, but they surpassed my expectations by a long shot. I would definitely recommend them and I will purchase them again if and when this pair wears out.",
        "Background -Own a pair of Hd 280 Sennhesier and have tried other headphones in this price range. -l listen to classical music and new retro wave. Feel, Style, and Build Quality I think these feel a little fragile, but they feel great and look good. They sit lightly upon the ears. Sound Quality For Classical These headphones have way too much bass. They block out the highs and ruin the structure of the music. The edifier H650's sound much better for classical music and they are cheaper. For Rap/Pop/etc I didn't give these a 2 star because most people do not like classical and these headphones do deliver good bass.",
        "This is one fine headphone that has an optimized tuning that is so enjoyable, and non-fatiguing. The headphone is light weight, stylish, and is a must have in closed environment. Being semi-open, it is not ideal for external environments or where the sound leak will be a problem. Having used ksc-75 and portapro, I can say that I prefer PortaPro easily over the former. Having owned multiple audiophile grade headphone and earphones, I consider this to be a great value and must have.",
        "This is not a high dollar noise cancelling wireless set of cans, and it isn't trying to be, and that is quite refreshing. The market is littered with junk headphones with all of the 'features', but totally ignore the base function of headphones: accurately reproduce sound. These headphones do that, and do it remarkably well. These were purchased to be used with the Oculus quest, which has downright horrid sound. These bring in an amazing sounds stage without any of the added weight or discomfort of larger cans. Great value for the money. This is the way that inexpensive audio should sound.",
        "Long ago, in the late 90s, I had a set of PortaPros. When they died, I wasn't able to find anywhere to replace them. A stalwart set of Sennheiser PX100s took their place, and still chug along today. I needed a good but inexpensive set of 'phones for a friend, and found these. With the improved quality of new portable players, the PortaPros shined even brighter than they had in the old days. While not quite the screaming deal that the KSC-75s are, they are still far better than headphones in this price bracket have any right to be.",
        "Bought these just because I saw several videos talking about how good they were. They went on sale for $29 so I pulled the trigger. Those reviewers aren't joking, these are very solid headphones. They're comfortable enough, they fold up small, and they pack a ridiculous punch for looking like crappy cheapo 90s headphones. I was pleasantly surprised and wouldn't hesitate to buy them again. I waiting for a different Koss model to come in to compare them to and depending on which are better, I'll probably buy a set for family members.",
        "I had a pair of these that lasted from 1986 until they got irreparably broken a year or so ago. They sound awesome, but sometimes pull your hair. Replaced them with a small set of Sennheisers - those sounded like they were smothered by a pillow (very dark sound). Bought another pair of Porta Pros and couldn't be happier. I can't imagine better overall sound close to this price. These even hold their own for punch and fun-factor compared to my AKG K-702s and my Bowers and Wilkins (not for sound-stage or imaging, but hey, they're $30).",
        "First of all, the bad news...This is probably the most cheaply \"made\" headphone I've ever seen. They didn't even try to make them feel like a quality product. \"But, hey, you gave them 4 stars, you say!\" Here's the caveat,...they have a limited lifetime warranty, so I won't belabor the \"fabrication quality\" point.. Now, that being said.....they sound incredible, and are amazingly comfortable! A little bassy for my taste, but that's easily fixed at the source. I've owned a number of different Koss models over the years, including pro studio models, and for sound quality these rate right up there...Solid bass, transparent mid-range, crisp highs....For twenty-some bucks? Are you kidding me?",
        "Very good sound quality, however the hook that is used to store the headphones is in a bad place. I had to bend mine a bit because it dug into the top of my ear. The hook is a good idea, but I wonder if there is a way to do that where it doesn't push into the ear. Also.. they take a lot to drive compared to other headphones I own, volume has to be near max on my phone vs other headphones where volume is lower. Be aware of that if you listen a lot on your phone.",
        "I don't know how to feel. I've had many portapros and they've all been awesome. In fact, I bought another backup pair to use at my office. To my horror, at first the box appeared to have already been opened and used. I plugged in the headphones, and NOTHING. NO AUDIO. Not sure if this is a manufacturer error, an Amazon warehouse error, or perhaps it's truly a new, defective unit. I've seen one channel be bad, but both? That's weird. Anyway, it's 5 stars when they work, but in this case, it's 1. So I'll average it up and give it a 3. Sending these back, and might bite on the kph30 instead. Not sure yet.",
        "First the good: good sound quality, fairly comfortable. The Bad: A tangle of cords, no replacement cushions for rectangular side foam; band springs back to its original position and has to be readjusted each time you put it on. I wear mine for over three hours most days and by the end of the time I'm more than ready to remove them.",
        "The best pair of headphones I have ever owned. The sound quality is crisper than my Senheiser PXC 550's and I can wear them all day long without worrying about my ears sweating (a problem with many enclosed over-ear headphones) and without pain. With the lifetime warranty on top of the low price point, this purchase is a no-brainer.",
        "Great sound headphones and there is nothing to complain at this price. The style is very cool looking (very 80s) and they are super comfortable to wear! I wear glasses and these work very well. Sound quality is easy on the ear and never sounded harsh. Not the most detail or open sounding headphones, but the sound signature of these headphones is very interesting. They do sound very musical and will fit many people's sound preference. I am very glad they are still making headphones of this quality in this day and age. These are probably the best headphones under $50. I would be perfectly fine if these were my only pair of headphones.",
        "I really tried to like these. The sound is very good. Very clear treble, and decent bass. My complaint though, is in the durability. On my first pair, the left side stopped reproducing sound. It was within a couple of weeks, so Amazon (great customer service, by the way) exchanged them for another set of PortaPro headphones. I then started using the second set, and within a couple of months they stopped working. The problem, apparently, was in the 3.5mm plug. When I would move the plug around, I could sometimes get sound. So overall great sound, poor durability.",
        "I picked these up, because of all the good reviews, but i was skeptical, I am so glad i did. I love these headphones. I camt imagine anyone not liking these. Any genre of music sounds good. So im going to list the pros and cons Pros Very inexpensive Amazing sound quality Portable Comfortable Wide Soundstage Good for gaming Cons Non detachable cord No mic Not the best looking headphone The metal headband will pull out your hair very easily No isolation I definitely recommend picking these up, even if you have to pay 50 for them i think they are worth it.",
        "Having bought a 3D printed headphone holder specifically for these headphones, these sound great and make up in the bass department while also still being comfortable. They're immersive and great for music. A big upgrade if you're looking to get these as a Rift S accessory or just as a pair of headphones.",
        "I owned a set of these probably when they came out back when. I started gravitating towards ear buds and these went by the wayside. I finally got around to purchasing another set of these just to have a set of open backed phones to use outdoors (to hear through while having a walkabout) and found myself impressed all over again. Plenty of bass without being muddy, fits in a coat pocket and they hug my sizeable gourd of a head. Best on-ear phones at this size. [update] I tried pairing these with my Fiio A3 headphone amp and they rival the Samson SR850 headphones I purchased a few months ago. A very versatile little pair of headphones.",
        "The sound quality is phenomenal. Period, you can absolutely not do better than this at this price point and beyond by up for $50 in some cases - wherever Grado picks up. HOWEVER, the comfortability of this device is just what you'd suspect by looking at it - nonexistent. I've had friends that have hacked off the headband and done some interesting things with microphones, but in the end, this is a great device that never went away when it should have. They've been selling it forever and it continues to sell because of the quality, but man - that metal needs to go pronto.",
        "Really good headphones if you're either just sitting in your room or riding the bus, but I wouldn't recommend them for walking or jogging. I'm on my second pair, which I got replaced via the lifetime warranty (although that cost me about $13 for the shipping and handling, plus whatever the shipping was to return the broken ones). And the new ones click whenever I walk because of the way that they're constructed, which is extremely annoying. I don't recall having the same problem with the original pair, but I'm also not sure if I ever walked with them. One of the earphones broke off of the first pair after about a year of use.",
        "Three stars for the fit. My head measures 22\", not especially large, and these are tight enough to give me a headache. The \"comfort zone\" adjustment won't stay set at light. It has no impact on fit either, but maybe it would on a smaller head. The sound is good, especially considering the price. My ears stay cool. The semi-open back design means no earache. I haven't worn them for an hour yet, due to the headband. But even if extended wear did give me an earache, I can shift these to other spots on my head to give my ear a break. I'm keeping them because the headband it metal. I'm trying to reshape it for a better fit.",
        "Love these headphones--made in U.S.A., great price and they are super good! I watch alot of e-sports and the current game I watch has moved to purely digital broadcasting because of COVID-19. These headphones legit make the announcers sound like you are the room with them! Really impressive and surprised. Update: I wrote the above after using them for like 10 seconds.... It's about 60 minutes later and I can't stop listening to music. Listening to songs I've listened to 1,000 times everyday and these headphones bring back that spine tingling feeling you have when listening to a great song for the first time. It's like a completely different experience.",
        "I have been buying these guys for I don't know how long. This model came out back in 1984 and they still are a killer set for the price. Big bonus is they fold up for travel; I hate wearing ear buds. I am a working musician and I wear in-ear monitors onstage and I prefer stuff out of my ear as much as possible. Also, $300- $500 in-ears make all the stuff out there for consumers sound pretty lame. I highly recommend the protection plan, $4 will save you $ when those thin cords break. One warning, if you're a long hair like I am these suckers will pull your hair if you're not careful.",
        "I had high hopes for these Koss headphones but, ultimately was disappointed in both fit and sound quality. Adjustment of size is quick and easily—simply pull the plastic tabs on the band. And the tension adjustment—how tight it squeezes your ears—actually works. However, they hurt my ears even after adjustment for size and with a loose tension setting. While sound quality was not terrible, the midrange and bass were a little weak and unconvincing. If you have a small head you might like them but I couldn't stand them on my head for more than a few minutes. So back they go...",
        "Fantastic sound and comfort for the price. The main problem I ran into is that my ears stick out in such a way that these do not sit very well on them. Also, the KSC75 sound roughly the same, and possibly a tad cleaner with less bass. the adjustment to less/more pressure on each side is nice, but is very sensitive and needs to be readjusted often. The headband also retracts on its own, which is cool for transporting, but is annoying for someone who takes headphones on and off all day. Overall I recommend them, and they sound pretty good for the price, and (for most people) are pretty comfortable. The bag it comes with is a nice touch.",
        "I compared this one to Sennheiser HD 202; this one is much better. HD 202 is a popular affordable earphone. I listened to some youtube videos that are intended to test earphones: hd 202 sounds ok but muddier than this; using this one, I can sense the subtle \"shake\". I can hear 30hz - 15200hz using this earphone. Bass is not too heavy, but welcome. Just please enhance the cable! The cable is very thin; the feel is like the ones on $5 earplugs, or just a tiny bit better. I wish it be to stronger and more durable.",
        "$35!? The sound quality is better than most headphones in the $100+ range. Build quality is decent but not great, be careful with them and they will last. Limited lifetime warranty with KOSS, epic! Pair them with a BT3 and you have a blue tooth set up for on the go and taking calls! It would be five stars if the cables were of better quality. Also, add the YAXi pads for added comfort and better sound!",
        "I can’t believe these are are Amazon for the exact same price as when I first started buying them in 2010. The sound quality hasn’t diminished either; I have a go-to song to see if the quality of speakers pass the test for bass and depth (goth trad- sunbeam), and the headphones don’t disappoint. The foldable mechanism is convenient for carrying in your bag and they provide a nifty little drawstring bag to put headphones in when you’re not using them (which is also larger than the previous bag sold, might I add). Overall, I can’t deny these headphones and I’ll keep coming back to them, and I’d also like to be sponsored but 🤷🏽‍♀️🙇🏽‍♀️",
        "I purchased these headphones when they were $35 and honestly, that's the most I would pay for them. While the sound quality and style are quite good, they're very uncomfortable on the ears. The clasp that's meant to hold the ear parts together while in compact mode sticks out and irritates the ear constantly. Also if you have short hair the headband will pinch your hairs and rip them out if you're not careful. Not quite what I would expect from a $50 price tag but $30-35 is fair.",
        "I purchased 2 of the Koss PP and throw one in the workplace with the other one as a backup. Classic is classic. I enjoy using them if I don't have the time luxury at home to use my professional setup. Never worry about breaking them or losing because the low price is so affordable for its sound quality. Never need to carry a headphone while transporting any more. BTW, it is so light and comfortable. Not designed for noise cancellation.",
        "One of the great bargains in headphones. They are light and sound as good as sets that cost over $100. Remember these are open headphones, so the sound leaks out and in. Not so good in loud environments like an airplane. Great for walking around where you need to be aware of your surroundings. No mike if that is important to you, but you can buy a model that has that feature. These are my favorite lightweights when I just don't feel like shoving in a pair of in ear phones.",
        "No kidding - I've owned & used Airpods, Bose Quiet Comfort, Beats, etc. I keep going back to these for the sound quality! They also fit great, w/ 3 levels of \"firmness\" against your head & they're not as big & bulky as full over the ear headphones. Customer service is superb. They've sent me replacement ear covers when they get worn & have even fully replaced them after they gave out, after a couple years. Lifetime warranty!",
        "These headphones are very small. The band that joins the headphones is metal and it hurts to wear them, not only on the head but on the ears, too. I like a lot of Koss products and their warranty is excellent, but this pair of headphones is an exception to their usually good quality. I missed the return period but I would have returned these. Not worth the money. Look elsewhere for good headphones",
        "I've been using these over the ear headphones from Koss for quite a while and they're great!!. I can't use earbuds and was so happy once I discovered Porta Pro style. They're so comfortable and fit great. I bought the extended volume control device and that works great. They used to have one with a clip attached to this device and I still wish that had that attachment. But it still works great with out that piece. I highly recommend these earphones!",
        "I'm not sure what it would take for these to earn a 5 star. They could be more comfortable if you try to fall sleep wearing them? That'd help. The flat superaural earpads aren't really comfortable, but they're not offensive. Another drawback is that while they collapse, it's not really an elegant or secure solution. It's not super compact, and it's a pain to get in and out of the bag. On the other hand these have a lovely, satisfying sound. Plenty of deep, enjoyable bass and good overall presentation with clear details. It's no wonder I keep a couple pairs of these around.",
        "These are my favorite headphones for working out. They are light, stay over your ears, and produce incredible sound, including low base without distortion. The headphones come with a leather case and include a life-time warranty which I have used with a past set for a cable that had started to wear out. I perfect choice for those that can't keep the in-ear headphones actually in their ears when running or lifting weights.",
        "The ear piece came off the product. The item is cheaply made and broke after 5 total uses while I was exercising. The ear piece can snap back in place but then fall out within a minute. HORRIBLE! The sound is pretty good for the price point, but definitely as good as the sennheiser px100 that some guy wrote about. I had those headphones and the are far the best sub $80 headphones I have ever used. I'm going to be ordering those on Cyber Monday. I returned these cheap pieces of crap.",
        "Lightweight, with Great Sound. Adequate cord length and thickness, and very comfortable to wear. I use the Buhl X25 HygenX Sanitary Disposable Covers to keep them clean, and they were a very good investment too. The Koss Porta Pro Headphones come with a case, and they fold in half and clip to hold that position too. There are more expensive versions, but these are very adequate for everyday use. I'm very happy with them.",
        "These headphones just arrived today and I'm not normally the type to immediately jump online to write a review, but these things blew away my expectations. I needed something for my work-at-home station during quarantine, so I could put on spotify and tune out my wife's countless daily zoom meetings. At $25 I wasn't expecting much and just hoped they weren't terrible, but I was pleasantly surprised by rich, warm sound with surprisingly deep bass. They're pretty comfortable too, but I don't have a large head, so your mileage may vary.",
        "These headphones arrived in perfect shape externally, but had no sound in their right channel. I tested this set with different top-quality audio devices with perfectly good stereo output ports. Nothing helped. I had to send this item back.",
        "WOW. Is what I said to myself when I put these bad boys on. I have numerous pairs of headphones, Audio Technica, Hyper X (gaming), Superlux HD668B, Apple ear buds, Beats and some other vintage sets. These are the best damn over the ear headphones I've come across in a long while! The sound is amazing, you simply cannot hate the sound they make. They are very comfortable, fold up nicely into the little pouch and they look cool as hell! For the price they just cannot be beat. You won't be disappointed just grab em. I will be getting another pair or two as I am interested in some of the other colors they offer.",
        "I have owned 4 pairs of these Koss Porta Pro headphones since they first came out many years ago. Before I could afford good noise cancelling headphones I used them on long haul flights to listen to music and movies. Now I just use them around the house to listen to music when i don't want to bother anyone else. Very comfortable for extended periods of use. Excellent sound quality especially for the price. The foam ear pieces eventually degrade (after years) but are easily replaced. For simple, inexpensive headphones these can't be beat.",
        "My first impression out of the box was that these are cheaply made. My suspicions were put to shame when I tried them on. Great sound quality, excellent soundstage, solid bass. Very surprised by the value of these. They are one of the most comfortable headphones I own as well; I can wear them 7+ hours without discomfort. If you’re looking for noise cancellation or volume control, these are not the headphones for you. Koss does have a limited edition version (which I also bought) with volume control, just not these.",
        "These are my favorite headphones. I've had 3 pairs and I keep getting them. These are not noise canceling at all--they're completely open and just sit on the outside of your ears. Sound is clear and well balanced, about as good as possible for this style of headphone. The all-black version looks great too. This is the wired version. There's a bluetooth version that's also awesome.",
        "I have always loved Koss Headphones and respected this companies innovations with there headphones sound. It has one of the best frequency responses of all the headphones I have use in the past. Now, I would like to suggest a another design for your headphones and that is design one the behind the neck which I would use for bike riding while wearing a bike protection helmet.",
        "Great headphones for the price. Very noticeably better for instance than the factory headphones that come with Samsung Galaxy S6 smartphone. Lifetime warranty is a great bonus (though Koss does charge $9 for shipping/handling and you have to pay for shipping you old headphones to Koss). One of the wires went loose, I sent the headphones to Koss and got a brand new pair within 3 weeks. Update: Koss are great! I pulled one of the wires by accident - Koss told me they will still do another warranty replacement, no problem. Got a new pair from them, they even included an extra carrying case.",
        "Best Headphones for the Cost AND better then those Beats. Designed i think in the late 80s. Trust me. They have DEEP BASS. These headphones have been updated over the years. go ahead i challenge you - compare the sound with 100-300 dollar headphones. YOU WILL BE SURPRISED. Do be a sucker and get those WAY over Priced Beats headphones",
        "Good, compact headphones. Please note that my rating on sound quality may not be accurate as I listen to books much more than symphonies. They are foldable and one of mine - I have both the beige and black models - came with the round, hard case which is useful protection. I also have larger, normal-sized headphones, but these are great for taking outside, air travel, etc.",
        "... and feel really, really fragile. Compared to my 200$ fidelio l1s, these sound fairly similar, in terms of sound signature, but (obviously) a completely different build. These are very smooth and clear, with no siblence, but they aren't incredibly detailed. I would listen to Lymbyc System's \"Narita\" for a highlight of everything these do right, and for what they do wrong \"Fly By Wire\" by S.S.L.Y.B.Y. has a different effect.. Stats: (compared to Sennhieser and Phillips headphones) Comfort: 5/10 Sound Quality: 8/10 Build Quality: 4/10 (with a lifetime warranty) Style: 7/10 Portability: 9/10",
        "THE PERFECT HEADPHONES FOR GLASSES WEARERS. Yes they seem cheap, but the sound quality is amazing and the design is the only style I've found that puts no pressure on glasses frames (even thick frames!). These are amazing headphones and are so comfortable. The style is open ended however so others near you will probably hear your music at normal levels; it's just the way they are designed. These are not going to beat your more expensive headphones in terms of \"audiophile\" quality, but they sound better than the overrated beats garbage and are so much more comfortable.",
        "I got these for zoom because my higher quality headphones were too large and hot for working long hours, and small headphones didn't have good enough quality. I am totally pleased with them. First, they are very comfortable and light - I forget they are there. Second, the sound quality is much better than I expected. I even use them to watch movies. They are a great buy.",
        "These are durable and light. They're good in situations in which you want good sound but do not want to block out outside noise. I plug them in often and drop them from desk height to the floor frequently. I use them for listening to music and podcasts. I'm not an audiophile so I can't testify to their frequency response. Koss sells inexpensive replacement ear pads for this model. I have a pair at the office that I've had a few years, so I bought a second pair more recently for my teen.",
        "Best thing about these headphones is the good sound quality compared to the price. Very portable and doesn't take up to much space, noise canceling isn't great but you probably aren't getting these for that anyways. I like the retro-ish design and blue accents. I also like the 90 degree jack and hear the warranty on these is also good if it gets damaged. What makes this a 4 instead of a 5 is that the slidy top part sometimes gets caught in my hair and pulls it, I could probably tape something there to block but haven't yet.",
        "I own three of these headsets. We use them for our home theater when we don't want to disturb others in the house. We have other headsets but these are the ones we look for when we are watching a movie. They are comfortable and have excellent sound. I want the low end frequencies to be there when the movie produces it and these deliver. I have never had one go bad, well except when we left it to near our guinea pig and he ate the cord, but Koss came through with their life time warranty and replaced it. Need I say more. I will always buy Koss.",
        "OK, so these Headphones look 80's retro and people may make fun of you because they think they are cool sporting their Beats headphones (which by the way are highly overrated and just trendy in my opinion). However these little gems are lightweight, comfortable to wear for extended times and sound really good! These Bass response is really good for this type of headphone. I bring these with me on trips and plug them into my phone that I have loaded up with music. I don't really care what others think when I'm wearing them because I'm not about looks, I'm about sound quality and these headphones have a lot for their price point.",
        "I had low expectations, but this came highly recommended from an audiophile buddy, as it met very specific requirements for use at work. I mainly use it for the gym now, since earbuds feel odd for me while running. Lightweight, the heat/sweat buildup is low, and not at all bothered by the sound quality. Yeah, it clearly cant compete with a $300+ set, but its easy to brush off and still get into the music. My only complaint is that the cable feels fragile. Everything else feels right.",
        "I bought this headphone to use with a cheap portable music player (SanDisk Sansa Clip Jam). It is a very good fit for this player. It is crisp and clear with decent though not great bass. It is pretty good at not having the sound seem right in the middle of your head. In general it sounds much better than headphones at this price should. Note: These headphones are ugly. They seem a bit flimsy. These are on-ear open-back headphones that do not block sound going in or out (not really a problem for me). For the money these are great.",
        "3rd pair of these I've purchased. My wife has a pair and I now have a pair in the glove box of each car so when I drive to a nature center or the gym/physical therapy I no longer forget my phones. Same lifetime guarantee as the other two. We've had one pair almost 10 years now and it still sounds great. Its been sent in twice for the cord pulling out, not manufacturer problem but Koss fixed it anyway. The Guys in Wisconsin are great at repairs. Item was shipped quick and secure.",
        "Never stops amazing me the value and sound you get from Koss! More bass (they both get so low you will wonder how that's even possible on either) and more efficient than the KPH30i's. I own both and if you was only getting 1 I would get the 30i's to be honest but these are still amazing. Another benefit of the Porta Pros is they fold up nice and small.",
        "I had a set of porta pro’s years ago. I still like the styling and the sound quality is amazing for the price. I’ll probably order another just to have a spare. Anyone thinking of a higher priced set that doesn’t feature noise cancelling needs to give these a try. You won’t be disappointed",
        "These sound as good as always, but the cord is cheaper, flimsier and more prone to failure that before. A little tug and the connection goes out. Mine failed close to the mini-plug. Managed to solder and replace the cord end and plug. The wire is the flimsiest, cheapest I've ever seen, even for a headphone. The weakness of the cord and failure rate makes the PortaPro not a good choice for use with iPad or smartphones, with which it's otherwise well suited. They need to fix this. The lifetime warranty is great but the S&H fee makes it not worth it for a cord replacement.",
        "The good: This is a great set of headphones for something like an MP3 player or phone. They are very portable and lightweight. They are perfect for on the go applications. Soundwise they excel for certain types of music: jazz, rock, pop and the like. They are a bit pricey for what you get. Alan Parson's \"Tales of Mystery and Imagination\" was quite enjoyable through these. The bad: They are not for what I would call for serious listening. For example, if you listen to classical music, duck! A solo piano recording I auditioned really struggled with pedaling noises on the recording, turning everything to mush. As long as you are not expecting an audiophile experience, give them a try.",
        "First, these sound fantastic. The bass production and fidelity you get with these is incredible. It really is a treat for the ears. The ONLY gripe I have is the wiring, which stiffens and kinks over time. These exact same headphones but with more of a strong, cloth-like coting for wiring are available in the PortaPro 25th Anniversary Edition. They are $20 more but the cable holds up so much better. They are also a little sleeker without any blue color and being mostly black. Can't go wrong with either model in regard to sound quality, but for build quality the Anniversary Edition is worth every extra penny.",
        "I purchased these headphones May 4, 2014 and am writing this review June 6, 2020. They have been used a ton and we have replaced the flimsy pads more times than I can count. I am giving them five stars for hanging in there with us for so long and still playing like new even if they have gotten a bit beat up over the years.",
        "Absolutely stunned by these headphones. I've been looking for some good headphones for a while, and even tested the Bose QC 35 II and other much more expensive headphones then these, but the Koss Porta Pro convinved me out of many others. Not only the price to quality ratio, but I actually believe that this is my preferred sound, which I can recommend for people who like their headphones to sound a bit more muddy and not as clean as for example all bose headphones. The sound is great for electronic music as well as R and B/Hip Hop, and the base is impressive for these. Also, it comes with unlimited warranty. What is not to like! Highly, highly recommend!",
        "Great sound. I bought 4 of these for all my family members and they all love them. Base is rich , and accurate. Highs are crisp , overall you not going to find anything better at this price",
        "I'm on my 3rd pair of Porta Pros. I use them for my daily 5 mile walk. Sometimes on vacation, I also use them to listen to music on a laptop. They may be light and insubstantial looking, but these headphones have seriously good sound--far better than any comparably sized & priced mobile headphone I ever tried. The Porta Pro is a true sonic over-achiever. Like other good headphones, it yields even better sound if you upgrade to different pads (the larger diameter Yaxi pads). Don't think twice about getting a Porta Pro.",
        "Sound quality is fantastic for this style of headphone However, I'm not sure what sort of role they fill these days -over the ear headphones are better for home listening -earbuds are more portable, less prone to being damaged, and are more isolating for when you don't want to hear or bother other people, like on a plane -on ear bluetooth headphones are better for runners who want to be aware of their surroundings and not have wires get in their way Aside from that, the only real complaint I have is that the cable is very thin and twisty. A thicker cable would be more durable and wouldn't twist as much.",
        "I wanted to love these headphones. The sound quality is actually decent. I even purchased two pairs. But they are very cheaply made. The connection gets loose at the 1/8 inch jack and one channel keeps cutting out. This is such a shame. I'd have gladly paid a bit more money for them not to make this with the absolute cheapest, unreliable parts on the planet.",
        "Koss has always been a trusted name for me. These headphones are really good sounding for the price. When I listen to music I hear sound that is rich, round and smooth. It does lack the brilliance that you would find in expensive headphones. Nevertheless, the sound quality in general is good. Worth purchasing.",
        "This headset is quite good, better then I expected. Though not noise cancelling the quality of the sound is very good. They are comfortable to wear and fold up well. I am most surprised with the quality as I have a pair of the Koss fluid filled noise cancelling headphones, which I'd rate as poor.",
        "They are surprisingly comfortable and have a surprisingly good amount of base response. They sound amazing for jazz music. And overall have a more pleasing sound my much more expensive Sony Mx4s. One drawback personally is I found the high notes such as those found in a lot of piano tracks i like to listen to sounding a bit screechy and hard to listen to. Everything else though sounds really good.",
        "These have a crazy following and now I see why. These are great. The sound amazing for the price. Low end is punching but not too much. All other ranges are very good. They are more on the warm side which I like. They are cheap but definitely will Last a while. Wish it had better cable or at detachable but for the money, it’s ok. Totally recommend.",
        "Best sound of any headphone in this price range, still the best bang-for-the-buck out there! Very deep bass down to 10 Hz, and highs up to 20,000 Hz. Koss has been making that same diaphragm design for quite a long time, it's tried and true. Be careful when moving the headset tension pressure adjustment softer...you must push the switch against it's spring FIRST, then move the ear-peace gently outward, do not force it or it may break. Folds up compact and has a carrying pouch. Otherwise nice comfort, nice price, GREAT sound.",
        "I used to have a pair of these years ago but had to get rid of them when I was moving at the time. I've been really missing them, I've always loved these. They are one of my most favorite headphones. I love open backed headphones, as the bass always sounds better to me and they also have a more open, airy sound to them, the music just breathes better, not so much compression or congestion (I only use open back headphones indoors, as they don't block outside noise). Koss Porta Pro headphones look really cool, too, in a retro '80's sort of way. They're an excellent value for the money. I would highly recommend these.",
        "Really comfortable headphones that i wear basically all day at work. They’re perfect bc you can have one ear covered and the other ear cup up above your ear and still hear what’s going on around you if needed. Or just tune everything out. I love the aesthetic and the black discreet headband is awesome as it doesn’t draw attention to itself. Recommend to everyone considering these!!! Nostalgic and great value",
        "I bought my first set of these from Amazon.com 14 years ago. I am not sure that there is a better pair of earphones under $50 to be found. The audio quality is simply fantastic. With careful use, these cans last for years. They're very ugly but the sound is amazing. Highly recommended.",
        "These came out in '84 and I had them then paired up to a Panasonic 5 band EQ portable stereo/cassette and was hooked on the bodacious audio they produce. Had several over the years but it's been 10 years or so until now, I just got my black set in and the sound on these paired with my LGG7 phone is breathtaking. I really love these headphones. They're a real treat to lidten too without breaking the bank.",
        "Holy Moly! The sound is fantastic! Just out of the box, loaded up some music from Amazon music...wow. Goosebumps. Super lightweight. Comfortable and light weight. I am thrilled with this purchase. No more earbuds for me. No batteries. No charging issues. Just good old easy working lightweight headphones. Thank you Koss.",
        "I’ve been buying this model for 20 years, they look hideous & do not fit all that great but jeesh, the sound quality is fantastic!",
        "My favorite headphones ever. Sound quality is very good, good dynamic range. solid bass, clear high notes, easy to understand the dialog when watching movies. Also, they are very light. the \"on the ear\" design, using open cell foam pads means that my ears don't get hot and sweaty, even after several hours of using them. No complaints at all.",
        "I use them with my DAP great for walking. For $30 you can't ask for more. The other KOSS HEADPHONES I like is the KPH30IK, again around $30. They look cheap, feel cheap, and are cheap at $30 but sound great. Sometimes it's not a good idea to break out the $500 headphones.",
        "These are incredible. I use them at work almost every day. The comfort zone feature really is amazing and I can wear these for very long periods of time. When it comes to sound, these sound better than anything at the 30$ price. They've got nice lows and mids and the treble is a little rolled off, but not too much. I would definitely recommend these if you're in the market for some cheap headphones for traveling or for use in the office.",
        "Rich and deep bass, better than Bose! And extremely portable. The leather-like case that comes with the headphones also works great for protection and other small items. I took it on a business trip and couldn't be happier... For this price, it is a must-have for audio enthusiasts!",
        "GOT THESE SITE UNSEEN.... to use when I travel (Airplane). Tried them on and Fell in Love with the fit and ability to adjust the ear tension and head size.... Ezzy Breezy And when I turned on my music to see how it sounded... I was astounded at how clear and wonderful the sound it. For the price or even IF they cost much more..... they are F A B U L O U S..... The fold up into a little ball for easy packing and stow away. I am thrilled.......",
        "I own several pair of headphones that I use with an MP3 player. None can match the sound of the Koss Portapro. Great Bass, Clear vocals, good overall balance and very loud.I have tried Sol Republic and Sony, Klipsch, Beats and others ( I've spent a lot on headphones over the last few years, but I keep coming back to the Portapros.",
        "Love headphones right out of the chute. I hate bulky over ear padded headphones, they get hot and always seem to run shocking energy across my head from one side or the other; not so these headphones and much lesser cost than many prior other brand. I will be gifting these as well. Thank You. I don't know about \"battery life\" so 3-stars there.",
        "Excellent portable headset. Just got mine in the mail. Was suprised by the size and weight. I recieved the box package instead of the blister package unit. The case that comes with mine was clothe and not faux leather. Not dissappointed though. The size is nice and compact, the wieght is very light. They fold up nicely, small enough to almost pocket them comfortably. As far as sound quality, I'm not a pro, but theyre very clear with a little extra bass. My only comparison is compared to my Sony MDR7506 that i use at home. The portapros are just as clear with a tad bit more bass, but of course a lot more convenient to pack for carrying.",
        "I love koss headphones! Personal opinion, I believe these are some of the best sound quality headphones you can buy. Now, I must agree with a YouTuber I saw reviewing these headphones. He mentioned that they are kinda \"bass-y\"; they do have some bass to them, more than I'd like them to, but it's not really a deal breaker. In my personal opinion and experience, these are not as good as the KSC75 Koss headphones. Now those, sound superb!",
        "I am an audiophile and own several high end pieces of audio equipment including a few excellent headphones. These have the best clarity and 3D presence you can buy for under $50. They are a bit awkward to put on and don't look that great.But when they are on, they are comfortable and the sound is absolutely premium. Koss hasn't changed this design in decades and I hope they never do. There is a particular mojo to this design that opens the music up to anyone's ears. I've given these as gifts several times and nobody is ever disappointed.",
        "For more than 5 years I have used this hearphone on my office computer. I have tried many other models attracted by publicity. Finally I decided to buy it again to use it at home. I am very happy with my purchase. I am sure it is the ideal headphone to avoid heat in the ears and enjoy high quality sound.",
        "The sound quality from these is quite good. These are not noise cancelling and include no inline controls, but for what they are, they're really good. If you need headphones that can fold up for transport and will provide decent quality audio, these will do the job.",
        "I love the size and portability - I was rockin' these for a few months and then they just fell apart when I put them on my head. Super bummed because I like these, but I'm hesitant to buy new ones if they are going to break after light use over a few months.",
        "This is the 2nd one I bought. Best of all kinds in this price range. Light and easy to bring on the broad - I don't like the noise-cancelled function cause I need to have some minimal input of noise while outside. So this one serves my purpose very well. The wide frequency give much more enrichment sound than any other products. Life duration of it ranges from 1 - 3 years: My 1st one last only 1 year, but they have a very responsible customer service, so they replaced a new one for me. That one last for 3 years, I enjoyed it very much.",
        "These are the best headphones I have ever used. They fold up for easy portability, they allow air to flow around your ear while you're using them, and they allow one to hear what's going on around one in the room when it's necessary. Their sound quality is better than any others I have tried.",
        "A real standard, particularly for the price. I use Grado SR-60 headphones for \"normal\" listening, and Etymotic ER-4S for critical listening. The PortaPros are great for travel, almost as good as the Grados, comfortable for walking, and very easy to drive. The only drawback is that the carrying case (drawstring bag) is cramped. The cables are a bit thin, but if you're careful it should be OK, and Koss has a lifetime repair/replace warranty no questions asked, so if you have a problem and have kept your receipt you'll get a new pair for a modest (less than $10) handling fee. My wife also uses these, very happy with them as well."
    ]
}