{
    "entity": "On-Ear Headphones",
    "text": [
        "You must try these. It takes a while to stretch out the headband if you have a large head and the plastic construction isn't that impressive. But, once broken in, these headphones reveal more details and are clearer sounding than any I have heard at anywhere near this $29.95 price. And they don't sound harsh like a lot of inexpensive headphones do. Try them, let them break in for several days and see if they are comfortable enough for you.",
        "Bought these for my church soundroom. We record our services and these are great for monitoring the sound being recorded. I've always been partial to Koss headphones, and these do not disappoint.",
        "I'm not a headphone expert but I wanted something for home use besides stock headphones from my delphi myfi radio and a pair of $1 jet blue headphones from a flight a year ago. I didn't want to spent $65 or more on headphones, and for the money I feel like I made a good decision, these have impressive bass, sound good through all frequencies, fit well and are comfortable to wear for over an hour at a time. I can't say anything bad about the headphones, and they are a huge improvement from stock headphones and those looking for something a little better without stepping into the more expensive categories of headphones.",
        "Cheap plastic and it broke. Tried to get Koss to give a credit and match Amazon pricing (with me paying the difference) while under warranty but they only replaced with another of the same. Don't expect that one to last either.. Disappointing for such a reputable American brand.",
        "Bought my first Koss Pro4A headphones in the 70's, if I remember correctly. The Pro3AA's are more comfortable and lighter than those. Fidelity is excellant and I'm quite pleased with my purchase. The lifetime warranty is a bonus as is the fact they're made right here in the USA. I did \"break them in\" by having them play on my receiver overnight per some suggestions on websites.",
        "... or at least thats what it seemed like to me after purchasing 2 of these on 2 separate occasions. The first pair lasted me 4 months. The last pair broke recently after 2 months. The problem part is the plastic used to connect the ear cup to the base. It's too thin, especially on a noise cancelling design that requires the cups be placed firmly on your head. If you buy these, one day, when you go to pull the cups apart to place on your head, the plastic will snap. From reading other reviews here. That seems to be a guarantee. It's too bad since these headphones do sound great when they are not broken.",
        "I love these headphones! Very clear sound.. Great for critical listening. They seem to be built very sturdy and they don't feel cheap. They aren't heavy and bulky, and they aren't light and flimsy either. These headphones have great passive noise canceling. The earcups form a tight seal around my whole ear while still remaining comfortable. I take my headphones off every 45 min just to let my ears breath some fresh air. But that is to be expected, and is no problem at all. I still consider them to be comfortable. Also, these headphones look cool, and I wouldn't mind wearing them in public.",
        "Great set of headphones! Comfortable, great sound, long cable...love them.",
        "They sound good, even at way too high of volumes, they fit nice and snug, and the person sitting next to you can't hear a thing. The build quality however left much to be desired. Suddenly one earpiece just snapped off the headband after about 6 months, then the second one. So the MAIN PROBLEM is too weak and thin plastic of earpieces. PROS: Good sound and design. CONS: Breaks VERY easily. Beware!",
        "I like the sound from these headphones and use them for critical location monitoring.",
        "I bought these for my daughter because Koss offers a lifetime warrantee on all their products. The headphones are not for the audiophiles but provide a great sound for the price.",
        "I bought these as a gift for my husband last year. At the time, I don't remember seeing any reviews warning how many pair had broken. If I had, I would have steered clear. My husband's pair lasted about 9 months but break they did and now they're completely unusable. Do yourself a favor and find a pair of headphones with good sound quality that doesn't have a clear history of breaking after a few months of use.",
        "These headphones had: VERY good sound. Koss headphones of all models will have a great sound. What they also had, which nullifies any positive points, is cheap and crappy materials/construction. If they made the headphones' headband assembly totally out of metal like they used to, the earcups would not suddenly snap off while putting them on or taking them off, like every single pair of Koss headphones I've used in the past ten years. Make these phones totally out of metal instead of plastic (of course keep the plastic earcups) and keep the price the same as these, THEN you'd have an acceptable bargain.",
        "I love these headphones. Use them often. Smooth balanced response.",
        "This was a gift to my mom; they apart after a couple uses. I should've listened to the other reviews that said the same thing. Again, you get what you pay for.",
        "Most of my computers and the TV my kids use most often are in the same large room. The noise was too distracting. I decided a pair of large cushioned headphones was what I needed. I tried several pair at Best Buy and chose these for great sound, comfort and price. When I found this same pair on Amazon.com for a little over $20 less I pulled the trigger. These are exactly what I was looking for.",
        "Worked okay for 3 months then the headband broke, sent in for the \"life time warranty.\" They ended up sending a different model that is satisfactory at all.",
        "I love these just because they've lasted for so long. My uncle got them for me as a christmas gift along with some recording equipment YEARS ago, and I've only just started the process of working on an album (the recording aspect, anyways) and they still work great. They're not perfect, but considering the price, you're getting a lot. Of course, the ear cushions have deteriorated and I need to get new ones, but that's to be expected for headphones you've had for a DECADE. Happy Listening :)",
        "Fell apart for no apparent reason after a few months of careful, limited use. Warranty requires a payment of $9 for return shipping of repaired or replaced earphones, added to the $9 to send them. So the warranty is worth $11, as New ones sell for $29, shipping included. Some warranty, huh?",
        "Got these \"free\" in an exchange with a 30 year old pair. Very comfortable, very heavy and very boomy. Can't wear for more than an hour. I need phones I can wear for watching films and work on my PC, These are not them. Bought a pair of Bluetooth for about $60 that are way better and do everything I need them to do.",
        "I received these as a gift a couple of years ago. I find the sound to be satisfactory. Mine have not broken down as others have reported. However I have two complaints. 1. The coating on the ear pads broke down and turned into black specks creating a mess. 2. They don't seem to block out outside sounds at all. Listening to outside sounds with them on and with them off is nearly the same.",
        "I bought my KOSS PRO3AA headphones at an electronics store. They last about 2 months, then the right headphone attachment broke while I was putting them on. They were not abused, and after much closer inspection I could see that the swivel is a very thin part, made of plastic, and had broken under normal usage. While the sound in these are great, they only lasted 2 months. That isn't very long for $50 headphones. Koss wants me to ship them to their repair center at my expense, and pay for the return shipping costs as well. I am just going to spend that $10+ on something else more durable.",
        "The sound quality was as I expected... Much better than ear buds but avarage to low for full sized headphones. The build quality however left much to be desired. I imediately noticed that the connection fro the speaker muff to headband looked questionable... And sure enough after regular use they failed there...I was actually extra careful when packing them up and they still broke...I will not buy a replacement.",
        "Got these about 11 months ago. They were great at the start, but after about 5 months the adjustment bar inside started to crack on the outside. I had to brace it with some metal wrapped in black electrical tape. Really annoying because now it is too big because the metal prevents it from retracting to the proper size for my head. It is usable, just very disappointing. I use this at my workstation, and am always taking them on and off every 20-40 minutes, so maybe that had some effect on its life. I will say the sound is great though.",
        "Outstanding sound (that comes first); somewhat flimsy construction; not really collapsable as we would expect them to be; and thank goodness for Koss' lifetime warranty. I do expect to use it. (I'm saving my receipt.)",
        "Tried on many Koss headphones at the Koss Outlet Store and thought these sounded the best - I've been using them daily for work (~6-8 hours of daily wear), fairly comfortable and no issues after 6+ mos. If I have any issues, I can call up the Koss Headquarters and go pick up a replacement pair within a couple business days.",
        "What's with all the positive reviews on these headphone's sound? Maybe I just happened to buy a defective pair(bought them at 6th Ave. Electronics for about $50.). But I have a small suspicion that most of them, if not all of them, sound this bad. The trebble sounds way too thin, tinny and steely at a normal setting. Even with the bass from half-way to all the way up, there isn't much of a difference. Only with some recordings, these headphones sound okay. But it's certainly not enough for me to keep them or exchange them for the same product for reasons I stated above. Sorry Koss, but I'm going with the Sony V6!",
        "thank your stars, I bought these in the dallas airport for over $90. audio quality is tinny at best, and lacks a full dynamic range. the rubber headband is uncomfortable and pulls at your hair. its hard to justify the extra money if you haven't heard it before, but spend a few extra bucks and buy a pair of comparable Sennheisers. koss here are not the worst, but really only worth about $23.",
        "I bought the Koss Pro3aa after having a couple of pairs of cheap Panasonic headphones. They sound good, even at way too high of volumes, they fit nice and snug, and the person sitting next to you can't hear a thing. I use mine almost exclusively during game playing. I wear them for 2 hours at a time, except when I run to get a re-fill on my drink. For low to mid priced headphones, they are perfect. I would recommend them and I would buy them again.",
        "I had these headphones for over 5 years and they worked wonderfully. It was only after all those years, with use on a majority of days, that they unfortunately snapped. They provided great sound quality and equally great noise cancellation. They were so good, I'm considering buying the same pair to replace the first.",
        "I've had them for over and year and have had no problems with them breaking. They sound incredible, probably the best pair of headphones I've ever owned. I can hear so much more in my music with them. Great buy!",
        "These headphones are great. I am in disbelief after reading all these reviews. Something is fishy because these headphones have great sound and are quality built.",
        "I used to have a KOSS headphone, TD-51, which I really belived to be very good. So I decided to buy a new KOSS, chosing a better one. In fact this is only a little below the best headphone they have. Well, I am very happy with this headphone, that is very superior to TD-51, with extremely good bass, very nice response in all frequencies, allowing to hear every detail of good music... rock, classical or jazz. Recommended!",
        "Great sound. Fantastic sound. Then one day, you'll try to adjust them, and they'll just shear off at the post. Not worth the money."
    ]
}