{
    "entity": "Popcorn Poppers",
    "text": [
        "I am only giving out this information to warn other customers, that have this product. I received it this week. I started to use it like the instruction said to do. I watched it very carefully. I looked and there was fire in my microwave. It blew a hole in the side of my microwave. I called Amazon, they were absolutely awesome how they handle the situation. They are the best!",
        "I'm very pleased with this popcorn popper. I've used it several times. Perfect popping every time. No burning. No more than six unpopped kernels.",
        "My buddy got this for his birthday and shared it on Facebook for how great it was. I LOL'd and he admonished me. I called his bluff and ordered it. Got it today. Amazing. Simply amazing. Light, fluffy, perfect popcorn. Perfect. No oil, no butter, nothing. Just light fluffy popcorn. I don't know what they did, but this is the only way I will ever eat popcorn again. Perfect snack that is almost calorie neutral. Did I mention it is perfect?",
        "Most of the kernels don't pop and it burned the bottom. I always used the popcorn setting and stop it as soon as I don't hear anymore popping",
        "Love this bowl! 1/4cup of kernels and 2min 20 sec in the microwave and I have a wonderful snack! You must clean everything out of the bowl between uses. If you leave butter in the bottom of the bowl and pop popcorn the bowl will bubble up and melt from the high temp of the butter.",
        "I used a glass microwave popper for years and was looking for one that could be utilized in my trailer. I've used Nordic Ware products before and this popper received great reviews so I decided to give it a try. It fits nicely in the microwave and pops 1/2 cup of popcorn which enough popcorn for 2 people. Most of kernels pop within 3 minutes. I'm so glad that I found this microwave popcorn popper. I will never go back to the glass one again! This one is easier to use, less waste of unpopped kernels and the results are perfect each time.",
        "I used to own the old version of this with the flat lid, that like with everyone else it began to warp over time so I decided to upgrade. As a popcorn device it works great; using 1/3 cup kernels and 1 tbs coconut oil it pops just about every single kernel. But it's starting to do something strange on the bottom of the bowl... there's texture there, now. Almost like the plastic bubbles in the heat of the oil. It doesn't seem to be affecting anything but it's quite odd. not sure if others have experienced this? hopefully it will still last the test of time.",
        "After 5 years of use our original microwave popper, the lid no longer fits and kernels fly out of the popper so we purchased the Nordic ware popper. First three time it worked great and pops almost every kernel, but the lid started going out of shape. After the 4th use the lid warped completely out of shape and it no longer will stay setting on the popper. I found that if you put the lid in the bowl upside down, immediately after taking it out of the microware you can reshape it back to where it will fit the bowl. But be VERY careful as the lid is hard to hold onto and it will be HOT.",
        "Edit: 3 stars down to zero. The horrible lid just literally cracked to the point that a corner is barely hanging on. 6 stars for the bowl. It pops popcorn well. I use plenty of oil and or butter. The lid is horrible! Zero stars for the lid. It warps badly due to the heat. It fits the bowl very poorly and is a pain to wash. It's so warped that popcorn kernels fly past it. I paid $8.15 for mine. It's more than twice that as I type this. Crazy!",
        "Had one of these bowls for years with no problem. FIVE + STARS! However, lost the lid in our move. I couldn’t find just a lid to order, so order another bowl. Using the microwave popcorn setting, the lid warped after two uses. It now sits unevenly on the bowl AND now we have a lot of unpopped kernels and only half a bowl of popped corn. Only used the bowl twice after the lid warped. Another high quality item down the tubes. Very disappointed.",
        "Wanted to try a microwave popper after a friend told me how much she liked hers. Decided on this as it is made in the USA. First use seemed to pop a little slower, but subsequent uses are fast. Much less hull left than when I cooked it on the stovetop in oil. I've only used without oil. Popcorn comes out light and fluffy, not an excessive amount of unpopped kernels left.",
        "It works and easy to use. I have a small old microwave and I do need a good bit of time beyond the recommended time. But none the less it pops my corn! Unit does get very hot from microwave so always use a a towel or holders to remove unit from microwave and lid from bowl. Very few \"old maids\" left and yes, any too tough to chomp I just throw back in and try another round.",
        "don't know if it is because my microwave is small but the bowl wouldn't fit without taking out the glass tray that rotates in the microwave. Then, when I popped the popcorn not all of the kernels popped........I have a feeling it is because my microwave is smaller....I am thinking if someone has a larger, normal sized microwave it might be fine. I am only sharing my experience which wasn't great.",
        "This popcorn popper works well for about the first month and than the plastic lid warps and you've got popcorn kernels all over your microwave. I bought a second one thinking the first one was defective, but it did the same thing. I called Nordic Ware and they told me I would have to buy another lid and pay for shipping. Not worth it. Now I just put the kernels in a brown lunch bag and roll the top and it pops just as well.",
        "I got one for each wrist and they work well. They are a little loose on my tiny wrists, but they are snug enough to do the job. I got the small. The Velcro seems like it might not last forever, but it's still working well after a week of taking on and off several times a day. I'm not worried about it. I can type, drive, and do most other things with these on. If I use large rubber gloves, I can wash dishes or prepare veggies with these on. I usually take them off when dealing with food or anything that is dirty or wet.",
        "This thing pops popcorn the way it is advertised. I used organic popping corn from Shaw's supermarket. I did not add any oil before popping. You simply put 1/3 cup kernels to the bowl, put the lid on, set the timer and listen when for when the popping slows down. I'd suggest listening the first few times you make it, that way you don't burn it. Also, then you can figure out the exact time that works best for your microwave oven. After popcorn is done, give it some salt and you've got yourself a healthy snack.",
        "I used a small bit of clarified butter while popping and did several batches to take on a camping trip. The bowl melted, turning some of my popcorn partially pink from the red bowl. Meaning we would have been eating plastic. So the popcorn and the bowl went in the trash. If you only make one batch at a time and add the butter after, maybe you’ll have more luck, but it’s still a material that melts in the microwave. I ordered one of those silicone ones next.",
        "This replaced our other Nordic popper, 12 C white with FLAT lid. We we excited because we love this popper and were looking forward to the larger volume. However, the domed lid creates an issue of trapping moisture under the dome and then the popcorn gets a little wet from the condensation. Not too much, but enough that you can touch and taste it. The flat lid doesn't create the same condensation phenomenon. So I ordered the smaller flat lid after using this one for about a month.",
        "My wife loves homemade popcorn, but hates the clean up. This microwave popper makes fluffy, light kernels without the mess of hot oil. You can add oil or butter to the popper before putting it in the microwave, but we find the air popped version is just as delicious with just a shake of salt or a bit of pepper. We've been using ours for months and love it so much we bought several for family members at Christmas. It easily outperforms other counter top and microwave based poppers we've used in the past. Just 1/4 cup of popcorn kernels makes an entire bowl.",
        "My 40 year old Rubbermaid popper sprung a leak on the bottom, retired to the scrap heap. I tried to buy another but only used for sale, no thanks. I bought this Nordic mainly because of the reviews and couldn't be any happier. It is BETTER than my old Rubbermaid----- two features, the removable lid make it easier to eat the corns right out of the popper without having to turn it upside down, and the funnel shape make it easier mixing melted butter. I highly recommend this popper.",
        "I bought a red one to replace an old one I had of another brand. I never knew you could make more than just popcorn in it but the packaging showed the bowl used to make a cheese salsa dip. I tried it for that purpose and it make the bowl discolored. I'm very disappointed that my brand new bowl is now discolored and less than a week old.",
        "I love the fact that its easy cleanup. You have to figure out your popcorn kernel portions so they will all nearly pop. Also, I use a little olive oil in mine for added flavor and to keep the container from drying at the bottom. Popping time may vary depending on the wattage of your microwave. Nordic Ware as some awesome products. I think this popper has been around for years. I love popcorn but hate the cleanup of larger popcorn makers. I purchased two. I have an extra as a backup :-)",
        "So much better than those silicone poppers. I bought one of these many years ago and it lasted until I broke it. I made the mistake of buying one of those silicone poppers. It was hard to clean. The soft sides made it awkward to handle. I tried different quantities of popcorn; with oil and without; making sure to watch the time. Many bad results, not to mention using oil made it greasy. I have made popcorn many times since purchasing this Nordic popper and it’s turned out perfectly.",
        "After 6 months the red dye from the bowl started to transfer to my popcorn.",
        "Bought this in January of 2018. Used less than 50 times. As you can see by the pictures the plastic is getting scorched. The bowl plastic turns hot during cooking, even if you put the bowl in empty. Also, the plastic lid is a mess to clean. it warps during microwaving, so I dare not put it in the dishwasher. DO NOT BUY.",
        "I received my Nordic Ware Popcorn Popper and when I opened it, it was evident that it was used. There was residual food product caked on the bottom of it and the wear and tear was so obvious. When I double checked to make sure I didn't accidentally purchase a used product, it was confirmed that the one I purchased said Condition: New. Disgusting! I will be sending this back immediately.",
        "We've been using these poppers for years. Depending on your microwave generally works with the popcorn setting. Pops well with no added calories. Can add a bit of popcorn oil if wanted but not required. Does dis-color over time and will get more brittle. Dropped a previous one, not surprised that it cracked, especially considering that it was 10 years old. To prevent burnt corn, listen for popping to slow down. May leave a few un-popped but the rest are white and perfect. Forgetting it, as we've done and not using the popcorn setting, will burn the kernals and discolor the bottom of the popper. (Not to mention the aroma that will permeate the house.)",
        "Pops well but too hot to touch for several minutes after popping. So have to leave it in the microwave until it cools. Narrow lip doesn’t provide enough to grab if using oven mitts (due to being hot). Using butter or oil to add flavor makes a coating on the lid and bowl that are hard to clean. Definitely sturdy and looks like it will last.",
        "It doesn’t work. I tried popping twice but some of the kernels just don’t really pop. The ones that popped are a lot smaller in size compared to the packaged microwaveable popcorns. The container is super hot after microwaved. Once we poured the popped corns into the mixing bowl, we poured in the melted butter and somehow some popcorns got really soggy. .The kernels are hard and they didn’t taste good at all. Very bad experienced.",
        "This is a really terrible popcorn popper. It leaves many kernals unpopped, and any attempt to extend the popping time will result in burnt kernals. I'm not sure how this compares with other microwave poppers, but it's not nearly as good as something like the Stir-Crazy, which is what I use now. It's a self-contained, plug-in appliance.",
        "I followed the directions first using the times specified. Hardly any kernels popped. Figured maybe my older microwave was not so powerful. Slowly increased time, monitoring the popping carefully. Every time fewer than 1/3 popped, and the item got so hot it scared me. I threw it away.",
        "This does a pretty good job of popping my popcorn. So I take it out (using oven mitts as the base gets very hot). When you take the lid off, the steam that comes out is very hot. I have been taking and flipping it over and taking the base off the lid. But now I noticed that the old maids have pitted the lid. So that is probably is not the best idea. Overall I am satisfied with this popper.",
        "We discovered these bowls a few years back and they are the greatest! Forget the expensive and toxic microwave bags. This is the best way, and it's highly recommended. I bought another one for the camper.",
        "My husband bought the Presto bowl but after we received it we discovered it required the additional purchase of disposable cardboard discs which adds up to a lot of money and waste over time, so we returned it and got this. I realize we could probably just use a bowl we already own, but it's nice that this one is the right size and has the vented lid and can be used as our dedicated popcorn bowl. We eat a lot of popcorn. Usually 2-5x per week. I also use this to pop popcorn to take with us when I take my 3 year old to Disneyland (we go often) so she doesn't ask me to buy popcorn there.",
        "Easy to use, easy to clean and results are great with having fresh popped corn. I recommend this and it has my 5-star rating! Enjoy!",
        "I loved this bowl the first four or five times I used it. Pops well, and super easy. I was cleaning it and noticed the red is starting to come off. Which of course means My family and I have been consuming little pieces as we are eating the popcorn. Really disappointing",
        "I don't use oil. I just through the suggested amount of kernels into the bowl. I turn on the microwave and wait until a few seconds have passed between pops. The bowl will be full of fresh popcorn with no artificial flavoring or anything else added. Add whatever you choose for flavor (butter, salt, etc.). It makes a good amount for 2 average popcorn eating people at a time.",
        "Well, the Nordic Popcorn Popper has quickly become an essential in my kitchen. It's tough and gets the job done efficiently. No muss, no fuss. Just wipe the insides of the bowl and the lid and it's ready for the next use. Package directions caution against the dishwasher because it \"could discolor the product.\" I've used the dishwasher with good results. Let your microwave decide how hot and how long to cook your popcorn. The popcorn setting on my microwave is too hot for too long. It does an almost complete job (only 4-8 unpopped kernels!) for me at a manual setting of 3 minutes at cook power 8. Good gadget.",
        "I was over at a friend's house one night when she pulled out this popcorn bowl and changed my life. I never make popcorn at home because I dislike the oiliness of microwave popcorn. This is an AIRPOP microwave popcorn bowl. Wow, mind blown! We don't need our airpop machine anymore! I bought one that night. We have used it several times since then and I'm in love. It's so easy!",
        "These are great bowls. I have bought them for myself and others for my kids. They make great popcorn. They work best when you pop the corn with no oil or butter and put it on afterwards. You need to watch the popcorn until it stops popping to avoid burning it. There is some waste but it’s much healthier.",
        "Me and my husband love this popcorn popper. We've tried several other ones but this one pops the most and tastes amazing without using oil. It can crack easily if dropped while it's hot. But totally worth buying it again if it happens.",
        "Nice pop corn popper and it does not use those inserts other do. You have to add a lil extra time to the nukems for it to pop all/most kernals but one you got that it is no problem. Bowl is not flimsy and should go the distance, lid could be a little thicker but seems ok right now. Nice to toss into the dishwasher to get cleaned up.",
        "I got a perfect pop! I just followed the directions on the package. I did nothing fancy or different from the instructions and got perfectly popped popcorn.",
        "Works great. I do always have some unpopped kernels, but I've never had one of these that popped all of them. The bowl feels sturdy and the color is what I expected. The lid does get a little bendy after popping, but it's held its shape and still looks like new. I gave it four stars because I had a wet Ziploc bag sitting in the bowl in the sink and it somehow discolored it. I have no idea why. Otherwise, I'm happy with this item and it's MADE IN USA!!!! :D",
        "This is the second one I've bought! It's a good, average size; bowl has some depth; and clear lid is domed. You can get more in it that you might think. It's NOT just for microwaving popcorn. It's for microwaving LOTS of different foods. The clear domed lid has a groove around it, so it REALLY fits the bowl when you put it on. My absolute favorite bowl in my kitchen cabinet!",
        "I opened the box and there was just a red bowl. No top was included. How am I supposed to pop popcorn in an open bowl? Heck, I already have a plethora of open bowls. And I now have to figure out how to package it to send it back. I got it in a big box with three other items. I now have to pay $ to buy a box to send back their defective product. That's crazy.",
        "The AW loves that she can make microwave popcorn simply and easily with this popper. Popcorn flavor is good and this pops up a quick bowl. Cleanup is a breeze. Would buy again. This review is Unpaid, Uninfluenced, and popcorn fueled...",
        "Half the price of the imports and works better. Buy this Made in the USA for half the price of imports and it works perfect. 3 minutes in my older microwave and it popped beautifully without oil. Vegan heaven",
        "I bought this Microwave Popcorn Popper over 4 years ago and certainly got my money's worth. I've used it often and have had delicious popcorn each time. Recently I noticed a few hairline cracks on the side, so I emailed the company to ask if it is safe to continue using it or is it time to buy a new one. They asked for further details and then said they would send me a free replacement. They even paid for the shipping. A friend who manages a kitchenware store said this is typical of the high quality customer service Nordic Ware always provides. She said Nordic Ware always has excellent products which they stand behind 100%.",
        "We needed a healthy and simple option for making popcorn. After reading the reviews, I was very interested in this Nordic Ware popper. Have only made one batch so far and it was great. Added a slight bit of oil and seasoned it later with Mrs. Dash products. Encountered no problems and would only advise to use necessary common sense for each user to determine just how long the popcorn needs to pop in your own specific microwave, as they are all different wattage.",
        "This is an excellent bowl for a single serving of popcorn.",
        "This popcorn popper does it's job superbly. You can add oil to the kernels before popping, or you can leave them dry and it works just as well. It takes a little trial and error to figure out your exact popping time, so you definitely need to listen near the microwave the first few times. Also each brand of popcorn seems to pop slightly differently. We like keeping our unpopped kernels zip locked in the freezer to keep it nice and consistent and to keep the freshness. Just scoop 1/3 cup of kernels into the popper and put in the microwave. Really enjoying the healthier alternative to snaking on chips.",
        "This is an awesome popper. I got away from microwave bagged popcorn because I always burn it. I started popping corn in a saucepan which worked fine but cleaning the pan was a hassle. This Nordic Ware popper does an excellent job. I toss in the popcorn, some coconut oil and Flavacol seasoning, microwave for a few minutes and I have perfect popcorn. The bowl is easy to clean, too!",
        "Simply the best if you like crispy popcorn!! My husband and I have been making popcorn almost daily for years with varying results and dreaded cleanup. That is until 5 months ago when we purchased this Nordic ware. Excellent popcorn in no time and super easy cleanup. The cover has become to warp with daily use for all these months but we are determined to figure out a solution. If we can’t, we’ll just buy another one ! We couldn’t be happier with this purchase despite the warping cover.",
        "I like popcorn but microwave, bag popcorn doesn't taste good. I've had air popped popcorn but that tastes like styrofoam. I was looking for a low-cal snack when watching TV. Using Coconut Oil and a bit of salt with this popper gives this popcorn just enough flavor without too many cals. Still have to pick husks out of your teeth, though ;) Downside (minor quibble): bowl isn't dishwasher safe",
        "We love this popcorn maker but it's already showing signs of cracking after just a couple months of light use. I was hoping it was higher quality coming from Nordic Ware. We've only used it about a dozen times since it was purchased.",
        "I'm giving this 4 stars because the red runs off from the heat. I wish I had bought the white one. But I use the Bob's Red Mill Popcorn and nearly all of the kernels popped. I have a Bosch microwave & 4 minutes burned w/the butter in the bottom. I'd try it at 3:45-3:50 on your first try. 1/2 cup of popcorn doesn't sound like much but when they nearly all pop & Bob's kernels are big & full the bowl's lid just starts to overfill. Get the white bowl & Bob's popcorn then it's 5 stars!!",
        "Like all Nordic Ware products for microwaves, this one is great. My first batch of popcorn I added a tablespoon of oil with the kernels (the directions said oil is not necessary) and I microwaved on high until the popping virtually stopped. Too long! and the popcorn burned. Left a dark, stinky mess in the Popper; however, it cleaned up very easily. Tried again and followed the directions better, and the results were perfect. Oil really wasn't needed at all. More unpopped kernels than I like, but I attribute that to the brand of popcorn I used. I am very happy with my purchase.",
        "Other than some weird bubbles in the plastic of the lid and not being able to find the perfect Power Level/Time options to cook every kernel it is perfect. My Microwave cooks around the 3:30-4:00 mark and a Power Level of 7-8 the best. Still always seems to be more kernels left than I'd like though, but any more time or power burns it. My Air Popper usually pops all but 2-3 kernels, but I like the crunch that this makes more. Works really well with some melted Real Salted Butter in with the kernels too and the White Cheddar powder for popcorn is amazing. I ended up getting 2 so I can cook more while the bowl cools.",
        "While we are bombarded with all of the negative information regarding microwave popcorn and the chemicals attached thereto, I've given up and started seeking something more simple and reliable - and without an expiration date that causes you to have to throw out expired food. I FOUND IT!!! This popper is a great size, it does a perfect job - get this - with or without oil! So, if you like the \"air popped\" type of corn, you can cook your popcorn without oil. Or you can use a small amount of oil and pop it. It pops almost every kernel. (And I don't have the best of microwaves, either!) ... Easy to clean, too. I absolutely recommend this popper!",
        "Excellent popcorn maker and you can't beat amazon's price. Some popcorn with a little bit of oil and 2 minutes in the microwave you have perfectly popped popcorn that tastes like it was popped on the stove (cooking time may very based on amount of oil added and microwave wattage). Very easy to clean and the popcorn tastes much better than air popped popcorn and the bagged popcorn people buy. Just add a little salt and maybe some melted butter after popping. The only problem is now I am eating popcorn almost every day (lol). Wish I had discovered this sooner and highly recommend it to others.",
        "I was skeptical that this would actually pop popcorn. How could a bowl make microwave popcorn? Well, it does! I mostly kept to the directions. My only deviation was to microwave the empty bowl for 30 seconds before adding the popcorn. From there I set the microwave for 4 minutes and monitored the popping. 3 minutes 10 seconds later the popping dropped to 2-3 seconds between pops. I stopped it and to my amazement I had a PERFECTLY popped bowl of popcorn. No burnt popcorn. There were less than 10 kernels unpoped. Drizzel on a bit of butter and toss with salt and I will never go back to prepackaged microwave popcorn again.",
        "Microwaving popcorn with this device is just as easy, but much cheaper and healthier, than using those microwave popcorn bags. Now I can control how the popcorn is seasoned (esp how much salt goes into it!); and try different combos of oils (butter? olive? coconut?) and seasoning mixes. The size and cover of the Popper make it handy for other microwave jobs, like cooking frozen edamame to snack on, or heating some soup. The only drawback is that it stains easily, but I don't mind that minor cosmetic flaw as long as the popcorn's good!",
        "I've become addicted to popcorn since I've bought this. I'll never purchase the microwave popcorn bags again, because this is far better, much more convenient, and very much more versatile, since you have more control on the amount you pop, and how much butter and salt you use, plus you can choose WHAT butter you want to use. It's a great all-round popcorn popper, and I definitely recommend it. I cook about 4 tablespoons for a little over 3 minutes, and have no burnt kernels, and fewer uncooked kernels than I had with Orville's bag popcorn.",
        "got this based on reviews, and am very pleased. My kids were overdosing on microwave popcorn, in all its buttery, bad-for-you goodness, so I decided to make a change. I set the time for 4 minutes the first time, and just listened very carefully. 3 mins, 15 secs seems to be our magic number (for 1/2 cup of kernels); there are very few unpopped kernels at the bottom. I bought Pop Secret premeasured mini bags for the kids, so no one has to worry about measuring incorrectly, and they have been experimenting with sprinkling on flavors. Cheaper and better for you, a win win",
        "Wasn't expecting much from this popper considering the price but after using it, I was sold. Like most others regarding microwave popcorn, you really don't know what all of the crap is that is in prepackaged microwave popcon, so I though I would give this a try. Followed the directions except I did put a small amount of popcorn oil in the bottom for some extra flavor. Placed it in the microwave and in about 3:10 minutes it was done. Popcorn wasn't super dry like the air popped corn poppers produce. Added some salt and some butter seasoning of my own. Will be using it quite frequently. Get yourself one!",
        "I bought this in 2010 and it still works perfectly. I love it! The only concern is shipping. The first one Amazon shipped to me was cracked due to packaging. They threw it in a box with a single air pillow for cushion. I returned it and Amazon reshipped a second one with better packaging. I'm glad I went to the trouble to return it because it works brilliantly, pops almost every kernel and makes fluffy popcorn with or without oil. UPDATE: Still have it 6 years later Still works perfectly. It takes 2 popcorn cycles of the microwave usually and a third cup of popcorn. Works like a charm every time. I love this thing",
        "I used this all through college so I could have natural popcorn without chemical butter. It was great and worked super well!! Just watch it carefully so you don't burn the popcorn, you get the hang of it after a few times.",
        "Fantastic results! I went through a couple failed batches, but once I'd lowered the power level to the right setting it's prefect every time. And I pay very close attention to the popping, removing the bowl and shaking the popcorn immediately after manually stopping the microwave. I've tried it with various kernels as well and works the same. It's a different popcorn than what I get from my well seasoned, old school and much loved stovetop popper, is lighter and drier, and I use an oil sprayer to coat the popcorn and use my usual seasoning creations giving me a decisively better, cleaner, and faster result.",
        "I've had microwave popcorn poppers before, but this one has some issues. First, the bowl gets really hot (like burn your fingers hot!) Then the lid doesn't fit on securely or well. Once it got knocked loose in the microwave and I had runaway popcorn all over the inside. Finally, with the recessed middle in the lid, it looks as if it might be designed for melting butter, but i don't recommend it. It becomes very hard to remove the lid without spilling the butter, and chances are there will be spillage anyway. I am not impressed, but it does do the job it's intended to do.",
        "It's amazing to me that more people aren't popping corn this way. Works exactly as expected. The results of dry popping are light and appealing. Eat as is or add whatever topping your heart desires. You'll know exactly what you're getting, no additives or other junk. My favorite is olive oil with fajita seasoning and a little powdered chipotle. Loose popcorn is actually becoming hard to find. Big stores have only one or two choices buried at the bottom or top of a huge section filled with in-the-bag products, most of them unhealthy.",
        "Had been using brown paper lunch bags; this works much better. Still have about 20 kernels ( est) unpopped, but less expensive than buying individual bags and tastes better than using an air popper.",
        "There is a not a better popcorn popper out there. Times will vary with microwaves. With mine, I use 1/3 popcorn kernels (Amish red is my favorite) and approximately 1 tablespoon of coconut oil. I set the microwave on high for 2 minutes and 52 seconds to avoid burning. At this time, there will be several leftover kernels. I shift those through a fry basket and put those back in the popper for 1:15. Doing this, virtually every kernel pops. Of course, you do not have do the second step. Popcorn is amazing. The most crisp you can make.",
        "My husband and I really like this popcorn popper. It makes great popcorn in the microwave without all of the chemicals, fat, and waste. We actually have two! We have found that as it ages, it is harder to clean, but a quick soak takes care of the stuck on kernels.",
        "I've used the popper two dozen times and it's perfect. I didn't care for the processed chemical feeling of bagged microwave popcorn and wanted to give this a try. I have a 1500 watt machine and the native popcorn setting works fine -- just follow the directions. I even add the tablespoon (or a little more) of olive oil and the bowl works perfectly. I can see why you may want to play with the settings, as putting less than one-third may result in burned popcorn or more may result in too many unpopped kernals but this should be fairly easy to adjust. Great product!!",
        "Like other reviews horrible, horrible chemical smell from bowl and popcorn itself. The red dye is mostly the culprit, not microwave safe or safe for your family! I never had such an experience with a product for a microwave.. Also, impossible to take lid off, they made it with a small slippery groove to grab handle with, impossible to pull off cover, you have to dump popcorn and lid directly into bowl to get lid off. To be fair, prior to this purchase I did buy there white popcorn popper and it works perfectly, with no chemical smells.",
        "This worked really well the first time with 2 tbsp ghee and 1/3 c Orville Reddenbachers popcorn. I set the microwave on 3:00 minutes and paid attention starting about 1:30. When the popping slowed to a couple per second (and the bowl was ready to overflow), which was about 2:45 I turned the microwave off. Results: very airy, light popcorn with less than 10 kernels unpopped and NO burns. Next time I may try letting it go a couple of seconds longer...",
        "First of all, I was extremely disappointed that this item arrived and it was plastic... I didn't read carefully and when I saw \"gemstone\", I assumed it was some sort of ceramic. But this is just good ol' #7 plastic. I could forgive that, but this thing just didn't work for me. I put the popcorn in and into my microwave, and after 4 minutes, nothing popped, but the kernels started burning and withering up. I probably could have tried harder, played with different temperatures, different minutes - but frankly, doing it in a pot on the stove is so much faster and easier.",
        "I bought this popper after spending what seemed like a fortune on pre-packaged microwave popcorn. The Nordic Ware popper has performed very well, producing excellent popcorn at a far lower cost and much less trash. I would never have guessed a simple device like this would work this well, but it does. My microwave's sensor doesn't work properly with this popper, so I have to stay close and listen to the popping to cease, but that's not much hassle. And the popper did develop a couple hairline cracks (not sure how, but maybe the dishwasher?), but they don't affect popping performance or cause any additional mess (i.e. no oil or steam leaks out). Otherwise, it's been a perfect popper.",
        "I am a popcorn freak. I eat it almost every night. This is so cool! Just add the popcorn, pop it and eat it. One dish, no pan. You cook it and eat it. Love it!",
        "has worked well in medium power microwave. I found you have to use either fresh or better grade popcorn, and use a little olive oil (very little) in order to get most of them to pop without burning the others. I have not been able to get them all popped without burning some, so I usually have 5=10% unpopped. If you are makin a large batch try stopping the microwave around 2 minutes, taking out the popped popcorn and then microwaving the unpopped ones for another minute. .",
        "Best microwave corn popper that I have found. Nearly lit the kitchen on fire trying to use paper bags to pop corn! Never a fear with this product. The pot and lid will be hot when you first remove them from the microwave. I don't use any oil at all. Swish it clean in the sink or in the dishwasher.",
        "Finally got around to reviewing this. I Love this Red Bowl. I first used an electric air popper which worked fine but left the popcorn tasting dry. Then I had a microwave popper that used special paper liners in the bottom at the cost of 8$ a pack. I purchased this and was surprised how heavy it is. I can (optional) put flavored oil and salt on before microwaving. I put it in the dishwasher several times and used it for other things as well. No problems at all. The lid sits on top with air vents. I would have loved a second lid for storage purposes.",
        "This item was delivered the next day after ordering and was packed very nicely. I opened it and washed it and used it immediately. It works fantastic! Very happy with this purchase. I did not use oil when I popped the corn, and I set my microwave to 3 minutes, but stopped it at 2min and 39 sec. because the popping was slowing down. There were only a few kernels not popped at the bottom. I spritzed the finished popped corn with olive oil and added just a touch of sea salt. It was delicious, and I left some in the popper over night with the lid on and it still was fresh the next day.",
        "We like popcorn, just the way it is in our house. As such, we've tried every brand of plain kernel and microwave popcorn, as well as many of the various popping devices. First, it's hard to beat Nordic Ware on anything. Second, this one holds 12 cups - a lot of popcorn - and does a great job of popping evenly all the kernels without burning in spots. It isn't glitzy or fancy, just does what it is supposed to very well, consistently and with a lid. :-)",
        "I wouldn't attempt to guess the number of popcorn poppers I have bought over the years, and they all turned out to be real disappointments for one reason or another. Usually, they were such a bother to set up and so difficult to keep clean. The first time I used this Nordic Ware product, I liked it so much I ordered one for each of my children. PS: The popcorn is great--every bit as good a theater popcorn.",
        "While this makes great air popped popcorn, it also works great to microwave veggies. Just throw cut broccoli, cauliflower, mushroom, etc. in without adding any water and this works as a steamer using the moisture present in the vegetables.",
        "Too much left over popcorn plus the bottom of the bowl has been stained and warped after less then two months of use. Lid warped after 3 months and the bowl has cracked after 5 months. You can do better!",
        "The biggest design flaw is the flimsy plastic lid. After about 10 batches, the lid will warp and no longer fit the top of the bowl. I wish the lid was made of the same material as the bowl. Now I just use a paper plate to cover the top.",
        "I heard about all the dangerous chemicals that go into bagged microwave popcorn so I was looking for an alternative. This is it! I have been making popcorn in the same amount of time it used to take to pop a bag. I usually make it plain and then add salt and sometimes butter or olive oil and parmesan cheese. It is also nice that this popcorn popper works as a serving bowl once the popcorn is ready. Easy to use, easy to clean. Just the way everything in the kitchen should be.",
        "I was skeptical, but this actually worked great. I started with a half cup of popcorn and let it run for exactly three minutes. It was completely full of popped corn when the timer hit zero, though about half the kernels didn't go. That said, it may work better to use a quarter cup. I'll just have to experiment. One issue I did find is that oil-less popcorn doesn't hold seasonings at all. I may need to add a small amount just so salt/seasonings stick.",
        "We had one already but I couldn't find another one locally. I wanted to be sure that we had a replacement popper; we eat a lot of popcorn. It takes a little trial and error to determine the right combination of popcorn kernels and microwave time but it's great for a low-fat snack.",
        "I use this every single day. The popcorn is so good and you can put anything on it not like popcorn in a bag. Only 1/3 cup of popcorn and 1 tablespoon of oil (I use grapeseed oil) fills the whole bowl with fluffy popcorn. Delivered very quickly,",
        "Awesome. So much cheaper than buying packaged microwave popcorn. Can pop without oil but taste aweome when you add a little butter and coconut oil and pop. Delicious.",
        "So--to be clear, I'm an extremely heavy user of this product. My girlfriend and I make some popcorn about 5 nights a week -- so it's fair to say this thing takes a bit of a beating. It works wonderfully and we couldn't live without it -- the 4 stars is only because the item started to form cracks in all of the corners. I'm not sure why (we hand wash everything, gently, and this has never been banged around) but it hasn't yet effected the functionality of the product. That said, this definitely isn't a BIFL and will need to be replaced sooner rather than later.",
        "This thing works great if you are a microwave popcorn person (I am not), and you use normal corn so you don't get exposed to the lung destroying chemicals found in bagged microwave popcorn (Google it). I usually make popcorn in a pot on top of the stove and popcorn from this popper obviously can't compare but I still use it when I don't feel like the hassle of making popcorn on the stove. Most of the kernels usually pop although it seems to vary with each batch. The instructions say don't re-pop kernels that don't pop the first time but it seems to work fine.",
        "just tried today, worked great i bought it to replace a hot air popper that never worked. the nordic ware: - popped most of the kernels - popcorn stays in the bowl - easy to clean - no moving parts, nothing to break - makes a nice serving bowl - did not burn the popcorn - makes small servings if you want, no problem works similar to, but way better than those microwave popcorn bags which smell bad, burn the popcorn, and make a lot of waste",
        "This is the best way to pop pop corn short of using the old fashioned stove top kind. I use a couple tablespoons of butter put in the microwave for 4 and a half minutes though I of course don't leave it for that long. Just until the pops become less frequent. Then I sprinkle sea salt and nutritional yeast and toss. Family favorite as a healthier snack and a must have for movie night. Had one before this one that my husband accidentally left in the microwave for too long and scorched the bottom. A new one was necessary.",
        "As always, considering the price this is a good buy. It makes easy to make popcorn, it is versatile since you can use just the corn or add seasoning, butter, oil, etc. It is also very easy to clean. The reason I am not giving it five stars is because usually there are more kernels that do not pop than I would like. I will try other types of corn and increase the rating, if I get better results. Overall, I recommend this product.",
        "I purchased this item so that I could make homemade, fresh, healthy popcorn at home for my family. It works perfectly. It is very well constructed, washes easily, and I love that it also doubles as the serving bowl. It is easy to store and is just wonderful. It is one of the best investments I have made. I love making homemade popcorn, it is so much healthier and cheaper. My favorite is organic popping corn with a bit of coconut oil and sea salt. So tasty! Very good product, hightly recommend if you want to save a lot of money and enjoy the freedom of changing your popcorn flavors to suit your mood."
    ]
}