{
    "entity": "Popcorn Poppers",
    "text": [
        "I bought this based on the reviews and am convinced they must all be fake. This is the cheapest, flimsiest pot, total garbage. Tried using it for the first time tonight. It will be the last time we ever use it. It's paper thin and gets extremely hot very quickly, feels like it will catch fire at any moment. The spinning mechanism feels like it will snap off within a couple uses. We've made far better popcorn in a normal pot. This thing is just a cheap gimmick.",
        "Awesome popper. Was easy to use. Make sure you season the pan before use with 3 table spoons of vegetable oil and let it get hot then cool off. You simply throw all the ingredients in according to how much you plan to make and put in the burner on medium high heat and hold the handle with one hand and crank with the other. I started slow at first and just kept going until it got hard to turn. I didn't want to force it cause I seen others showed their turning mechanism broke. But in two min the popcorn cake out perfect 😋",
        "Burnt my other Wabash and wanted to replace with the same. It looks the same BUT we had to spend a bit of time bending the tabs that keep the lid on. First time making popcorn, as we were dumping into a bowl, the lid popped off and contents went on the floor. (dog loved it). It took us three tries before we finally got tabs bent to the proper strength. Makes the same great popcorn, and this is, overall, a minor inconvenience.",
        "This goes beyond popcorn. Yes it's great for popcorn. We use coconut oil in the bottom and just keep turning that handle until the popcorn pops. You get perfect popcorn every time with very little unpopped kernels. It's extremely easy to use and versatile. This is actually my secret weapon when roasting my own coffee. If you can find some place to buy green coffee beans, you can roast them in here for the freshest coffee you've ever had. I love this whirley pop and it really has some great and unexpected uses, I haven't found anything else that has multiple uses like this one does.",
        "I recently purchased this with the package including\" popcorn, coconut oil, and Flavocol Popcorn Salt\" and couldn't be happier. So simple and most importantly clean up is a breeze. Usually, I find purchases such as this slowly making its way to the \"out box\" but this one has an outstanding chance of staying in the starting line up. Just made some last night and it's all about you as to how much oil, popcorn, and salt is best. It is very light weight and heats up fast. After pan cools I add some water(never use soap personally) and give it a few twirls, rinse well and dry. Get one.",
        "I liked the novelty of the Whitley Pop and the color changing pan, but my popped corn comes out a bit tough and the Whirley gig that turns around in the bottom of the pan crushed a lot of the kernels. I've been using this popper for a little over a month and color has changed permanently on the bottom couple of inches so it always looks hot, even when sitting on the cabinet after cleaning it.I'm going back to my Dutch oven pot and lid. I make an 8 liter container of popcorn each day. Same corn in Whirley Pop that is tough, is crisp and crunchy in the Dutch oven.",
        "I really liked this at first until I started noticing all the oil and grease buildup. So many nooks and crannies, cracks and creases, the lid is hard to hold onto to really scrub, and always think I’m going to break off the thin little mixer devalues, the wooden piece on the crank came off, haven’t tried reattaching yet maybe I’ll just toss the dang thing! Kinda grosses me out I can’t get it super clean",
        "Purchased this for a Christmas gift. I did open the box and there were no damages or defects, and all included items were there. This is an aluminum pot and lid with stainless steel stirring system with wooden handles. The gears \"appear\" to be made of the same material as the pot or it's silver painted nylon. Style name: nylon. The lid fits very snugly. The clip on the half-lid should be unclipped before attempting to disengage the clip beneath the handle and lift.",
        "We've used a Whirly Pop for over 20 years and it is the best way to pop corn. We had one with nylon gears that worked fantastic. We only got a new one with the metal gears because I burned a batch by accident and decided to by a new Whirly instead on tiring to clean it. If you love pop corn popped fresh (not microwaved like a heathen) this is the only way to do it.",
        "We had one of these years ago, then went through every other popper type from automatic to air. We have returned to this one as the best popper around. The major point is CONTROL: of the amount of oil, amount of popcorn, when to stop popping, etc. It is a little harder to clean than some solutions, but nothing is perfect and I believe it is still the best.",
        "This is the second one that broke: The gear at the top cracked. How to find one of getter quality?",
        "At first, upon my initial inspection, the popcorn popper seemed a little flimsy. I expected the materials to be thicker and heavier. However, it is actually perfect. The construction is very sound. The wooden handle and knobs are very well-made. When washing the entire popper after use, I recommend handling with care and drying all parts right away. As far as for how the popcorn popper pops corn, well it does the job very, very well and in 3 minutes or less we have a big, big tub of great-tasting popcorn, every single kernel having been popped. It's fun to use and it does a great job.",
        "Pros: Makes consistently good popcorn, and it's pretty fast. You have to stand there turning the little crank to get the best results, but it doesn't take much time and I don't mind the personal involvement. Cons: Made of very light gauge aluminum. But, it's held up under frequent use for over six months, although the inside bottom has gotten scorched and it will never be bright and shiny again. It's definitely more difficult to wash than a simple pot. The crank rod, gears and corn swirler all collect oil/butter during use, so there's lots of nigglly little parts to wash. But, it's really not hard work to clean it, so I'd buy it again.",
        "Before ordering the Whirleypop, I researched the daylights out of it and read and watched countless reviews. My concern was that it would be another useless kitchen gadget. I bit the bullet and ordered it along with the butter flavored oil and the flavacol popcorn salt. I'm so glad I ordered it! It is super easy to use, easy to clean, and most of all...absolutely delicious!!! I highly recommend the Whirleypop.",
        "This is my second purchase of one of these. I thought the first one I'd gotten was defective because it worked great initially, but then the popcorn started to taste funny--like it a weird chemical or burnt taste. Purchased a replacement and the same thing happened. Followed instructions and did not overheat the pan, so not sure what is causing it. We have an electric range, so perhaps it works better for others who have gas? Will not purchase this product again.",
        "Makes great popcorn, fun to use, not too many un-popped kernels, my only disappointment is that the lid doesn’t stay on when emptying contents and I end up spilling popcorn. I’ve tried several times, the first time I figured I hadn’t placed it on properly before cooking, so I was careful the following times, but this continues to be an issue for me.",
        "Replacing my first whirley pop after 10 years and it’s honestly the best way to pop popcorn. I love that it doesn’t scratch my stovetop and it’s so easy to get that perfect pop every time.",
        "This is the 5th Whirly Pop I have purchased. My original one is 16 years old and the rest were gifts for family. There is NOTHING like fresh popcorn made in the Whirly Pop. Its even better than movie popcorn because you know exactly all the ingredients. We always use coconut oil and white popcorn for simply amazing results every time! A perfect house warming or wedding gift. Mine is still cranking along after 16 years of not so delicate handling. I will never try another brand of popcorn maker. What would be the point?",
        "I know you aren't suppose to, but I use this to roast coffee. It works very well. Just fill the bottom with beans, put on medium high heat, and keep slowly turning it. In about 5-7 minutes you will have a medium-dark roast of oil covered coffee beans. I have roasted about 15 pounds so far with mine and it is still going strong.",
        "We loved our popper - unfortunately, the plastic gears wore out twice during our first year of use. (Yes, we love our popcorn.) Happily the company sent us new gears and we kept on popping. Just the same, I'd recommend getting the more expensive pot with the metal gears. I think Whirly Pop makes one as does another company. It's a sweet popper, but for those plastic gears. (As others have said, us medium to medium high heat rather than high; coconut oil is great, you don't need much! Worked fine for kettle corn. And we just loved it. We also use the microwave to make popcorn in those brown lunch bags - works a treat.)",
        "It works very well and as advertised. The best part is that every single kernel pops! I have been a pan on the stovetop person for many years, and consider myself very good at popping corn. But I never got all the kernels to pop until using this popper. My only problem with it is that I wish it were larger, but I could not locate a bigger one. Having said that, it is a perfectly fine size for normal humans with normal popcorn-eating needs! It takes me about 2 minutes to wipe it out when only oil is used.",
        "This is a cool gift if you love popcorn and don’t have room for an airpopper, or simply enjoy a more hands on approach. It was SUPER easy to use! We made a large bowl of popcorn in about 4 minutes. As for the pesky unpopped kernels, there were less than 10. It did a great job popping! I do reccomend reading the instructions before starting. It popped 1⁄2 cup normal size corn and that was the max, but once popped, it filled an large mixing bowl (think movie theater size medium to large popcorn).",
        "The stirrers do not stir the popcorn. They just glide over the top of it subjecting the popcorn to be burned. Cant seem to find anywhere to complain about it. Guess I'm just stuck with a defective product.",
        "This was a gift for a person who admitted to making terrible popcorn. He followed my instructions as per oil, amount of kernels to pop, etc. Only thing left had to be the pan. Bought him the Whirly Pop and he called me the day after he used it. He was impressed and that is not an easy thing to do with this person. So thank you for a useful product that keeps a popcorn lover happy.",
        "Plastic gears. Please realize that the lid clips on both sides instead of inserts on one side and clips on the other. Wood is varnished very well. Arrived in great condition, but box showed signs of being a returned item. Will test a lot over the next few weeks then update review, unless something breaks before then. I don't have faith in plastic parts. At all. I only bought this because someone said they were metal. Untrue statement.",
        "This is so much better than the rubber microwave popper I had purchased which burnt the popcorn & left so many kernels unpopped no matter what power level I put it on. The stove top popper starts popping within about a minute & finishes in about two. All the kernels pop. I first add oil for flavor. I love it!",
        "I cannot say enough positive things about this item, It is super nostalgic and quality is A+. There is not substitute, the whirley pop is the best popcorn maker on the market. I love the color changing feature of this item, but I have also owned the regular red one for going on 3 years. We use ours frequently and it is a nice change from microwave popcorn.",
        "I've only had this item since Christmas. Loved the way it made my popcorn fast and popped every kernel . But one of the plastic gears on the top broke already. They should be made of metal.",
        "I am in love with this product! I was a bit apprehensive upon opening the box, cause aluminum is extremely lightweight metal, and looked, well...cheap. It performs like a beast though. Every kernel pops and is delicious, plus my stovetop stays so clean! You don't even have to wash this pan between uses - just wipe it out and it is good to go for the next time. It truly is as fast, or faster, than microwave popcorn and is far tastier. Important to wash and season the pan before using so it stays clean and shiny, and to read the manual so you know important stuff like to not force the crank.",
        "I have had a few whirley pops over the years and given them as gifts too. I love popcorn and this popcorn maker makes wonderful popcorn. I make at least two pots a week. I use the pot until it wears out. The popcorn maker I ordered on Amazon in September has been difficult from the beginning. The crank is difficult to turn. I stuck with it as I thought the oil from making the popcorn would fix the problem. It certainly has not gotten any better. I gave it time to fix itself but it's not working. I'm asking for a replacement for the product I now have.",
        "I've had a version of this for over 20 years and couldn't imagine making popcorn any other way. I never do microwave popcorn as it has way too much oil in it. bought a second place and needed this for the weekends...great quality. better than the one I have had for years",
        "Okay...we got this whirly pop and it changed our lives! Not to get too dramatic, but it's true. We got it during the Covid quarantine time and have had popcorn almost every night since it arrived. It pops up popcorn in the best way possible.Keeps it from burning. And, it's just fun to use. Maybe for some, it'll be a little big to store in a cabinet, but we just keep it on our stovetop because we're going to use it again and again and again! Hope this helps!",
        "I've had the Whirley-Pop for 6+ years now and I haven't had any faults with it yet. Hands down the best way to pop movie style popcorn. After years of experimenting the best recipe for popping is: 1/2 cup popcorn 2 tablespoon coconut oil 1 tablespoon butter (salted or unsalted) 1/2 teaspoon Flavacol popcorn season salt",
        "We got rid of our microwave a few months back with no plans of replacing it but we miss making popcorn. I went back and forth between this or a popcorn maker and I’m so glad I choose this. The popcorn is super easy to make and really does taste just like the one at the movies. Don’t think I’ll ever need a microwave again!",
        "I absolutely love this popper. At first I was a little concerned because the central stir function didn't seem to reach the bottom to stir the popcorn however after some use it works just fine. This is the second one of these I have owned. I had the other for a really long time--couple decades before it died on me. Stovetop popcorn is a true love of mine and this allows me to make it with ease.",
        "I really used to love this type of popper BUT this one only lasted me three months. The handle broke and the gears that turn the 'whirley feature' also broke. Actually, after popping a pan of popcorn and emptying into a bowl I found the gears in amongst the popcorn. It simple just fell apart. I put it back together every time we popped popcorn until I was so frustrated I wanted to throw it out the window. I have had several of these over the past twenty years and never has anything like this happened before. A huge disappointment! Stay away from this disappointing product.",
        "This thing actually does a really good job of popping popcorn. I am a traditionalist and I always make popcorn in a pot on the stove which works really well, except there are quite a few unpopped kernels. With this thing I never have more than 2 or 3 unpopped kernels. Some other reviewer commented not to use high heat. I use high heat and it works fine and pops quickly. I tried medium heat at first and it took forever. The only issue I have with it is that it is kind of cumbersome to store in the cupboard.",
        "Love this! For some reason I had never made homemade popcorn in my life, my husband introduced me to it but we had been doing it the old fashioned way in a pot on the stove and shake shake shaking it for a long time until the kernels pop. I saw this recommended on Facebook and decided to buy it for my hubs for xmas. It is so quick and easy to use, kernels and a little olive oil went in, turn the crank for a couple minutes and presto - beautifully popped popcorn, hardly any kernels left at the bottom. Highly highly recommend!",
        "I was visiting a friend for a few days and her teenage daughter made herself popcorn nearly every night. Being a popcorn fan (meaning real popcorn, not microwaved chemicals) I was intrigued by the Whirley-Pop and asked what they thought of the contraption. They gave rave reviews which was enough for me! I bought this a little over a month ago and have used it at least 20 times, all to my great satisfaction. I put in less than a teaspoon of oil and 1/2 cup of kernels. Virtually no unpopped \"old maids\" and the process takes less than five minutes. In my experience, this is a great product that I can highly recommend.",
        "Contacted seller with photos of defective part then heard nothing. This is UNUSABLE. The gears will NOT turn. Now I’m stuck w a 40. POS. DO NOT BUY FROM THIS SELLER/ find a different popper that doesn’t have plastic gears. Would be happy to change this review if seller would follow through and make this right. I paid for a WORKING popcorn maker with working gears.",
        "Difficult to clean. Not heavy duty like my Grandmothers. Of course, this was 60 years ago. Also Grandmother's was also easy to clean. I was only going to give this three stars but I do like it and it works as it was intended. I just don't use it as often because of difficulty in cleaning. Don't think I'm lazy, I'm old. I did exactly as the instructions said about pre-use and there are no burnt popcorn nor any that stick on the bottom. Maintenance is important as well when cleaning. No one should complain about the fact that not all the kernels pop because that depends on the type of popcorn and quality of it. Not the popper.",
        "***UPDATE***The company has replace our lid/handle and gear assembly at no cost to us. They were great and quick to resolve this potential hazard by re-introducing a metal geared unit. The ones being sold by Amazon were the old style. Check gears before making your purchase to make sure they are the newer metal kind. Old Review:The recessed bolt that holds the plastic gear set on the handle had been tightened in such was that the thread was stripped and the handle would not stay in place, but pull out leaving you unable to turn popping corn. I attempted to re-tighten the recessed bolt but the plastic gear thread had been stripped at the factory.",
        "We've only had the opportunity to use this once, but it worked very well. Followed the instructions and only put in 1/2 cup of kernels. It pops very fast. Much faster than our old Teflon-lined dutch oven. I was concerned about popping corn in a Teflon kettle - Don't know if that is good at high heat. This one is aluminum. And you don't have to use high heat - We used medium on our gas stove. Popcorn did not stick and almost all of it popped. Not very many unpopped kernels.",
        "Our grandaughter and her family had an old popcorn popper similiar to this one and it broke and we replaced it with this new one for them. The first day it arrived, they were all so excited to have a popcorn popper again and made popcorn very soon after it arrived. They love it very much.",
        "The reviews are spot on and I should have followed their advice - the plastic gear will break and then you have a useless aluminum pot. Mine took 6 months. It was only used 10 to 15 times. Do not buy - find one with a metal gear. Update - If you buy this popper, make sure to register online for the warranty. I did that and called Wabash Farms today. They said that they will send out 2 replacements gears with instructions immediately.",
        "I purchased this item in mid to late October 2015. Within 2 months of purchase the pieces on the cover came off (screws and all) causing the 2 flaps on the cover unable to latch and remain closed. While researching popcorn makers I noted this had a 25 year warranty. I took a chance and called. The rep had me look for a number on the inside of the lid- which was \"11\". She then offered me a replacement cover for $8.00. She then asked who I purchased item from and I told her Amazon LLC. She then advised that the \"11\" meant it was made in 2011! Shame on Amazon and shame on Wabash Valley Farms.",
        "I loved this for the time that it was functional. Then the little plastic piece broke and now the pot is unusable. There isn't a way to get just that part fixed or replaced. I checked the company website to see if I could get just a lid because I really loved it. Because they use crappy plastic and the potential for this to occur again, I will not replace my popcorn popper with another one of these. I didn't have it/use it long enough to feel like I got my use out of it...therefore I don't recommend this product.",
        "Haven't tasted popcorn this good in ages (except for movie popcorn, but that's in a league of it's own). Yes, like many reviews state it's fairly thin-but it doesn't need to be a thick, bulky thing to get the job done. Takes a bit longer than the 3 minutes it says, but still fairly quick. Cleaning is not as easy as some of the reviews said (\"no need to clean\", \"just leave it\")-mine has been pretty thickly coated with husks, etc every time and needed to be taken apart and wiped down (or cleaned depending on which oil medium I used). Did have to contact Wabash customer support and was not at all impressed with their promptness, response.",
        "After 3 1/2 months of light use, both gears at the set screws broke and the popcorn popper is now unusable. Considering I had another similar popcorn popper that lasted for more than 25 years, this is VERY disappointing. The item broke on February 18, and the window for returning was January 31st. Will this manufacturer replace this defective product? We at least need new gears. UPDATE 3/21: I contacted the manufacturer (Whirley-Pop) on Feb 21st. After multiple emails back and forth they ordered new gears which we received about 3 weeks after the initial contact. The repair was very easy.",
        "I started using this as a kid (parents had one) and bought one for myself years later as an adult. It's survived several international moves and despite getting a bit dented in the process, still works great. This one I bought my boyfriend, and he loves it. Makes excellent popcorn with minimal kernels left over.",
        "I bought this for my wife as a gift a few years ago and she says it's one of the best gifts she's ever received. It's still going strong; she's back to using it almost nightly again. It is simplicity defined, and fast. She cooks a large bowl of popcorn, fully and crisply popped, in about three minutes. She removes it from the heat as soon as she's done and it's as intact as it was the day we bought it. We buy large bags of popcorn for economy and she uses coconut oil to get a true movie theater flavor. There is no substitute.",
        "Love this popper, got it as a gift for my husband and was nervous since he is picky about popcorn. Our last popper was fine, but never popped enough for all of us. He had to do two batches. This popper solves that problem and allows us all to sit down together on movie night. It is fast and makes great popcorn with hardly any unpopped kernels. Also, it ranked #2 on Consumer Reports list of best poppers, behind Orville Reddenbachers air popper, but we don't care for the taste of air popped popcorn.",
        "Second one bought. My husband loves popcorn, and this is go to gadget. His first one lasted almost 2 years. But an FYI, he used it every weekend. So I bought him another, and he is popping away. This is the best popcorn maker because it doesn't take much oil, and the lid lets the steam out so the popcorn is always crispy and tasty.",
        "Worked great for 5 times. I loved it! Then it broke. Like other reviewers had said, the mechanism on the top let go. It wound up in my popper (don't ask me how), and it melted into the pot. Of course since I don't eat popcorn every night, it's long past the return policy, and I am stuck with a useless popper. Lesson learned, when other reviewers say it's a piece of junk, I need to listen. Incredibly disappointed, because up until the time it broke, it worked great. DO NOT PURCHASE!",
        "I decided to buy this version because of the cost. I already have one of those small (1⁄2 cup) movie style popcorn machines. I wanted to make kettle corn so thought I'd try this. first batch of popcorn I made was the sample pack that came with the popper. It was GREAT! Just like out of the machine. Today I made my first batch of kettle corn and I am pleased as can be with it. Easy to make, easy to clean up. And absolutely delicious. i used the \"mushroom\" popcorn which I highly recommend as well if you're making flavored popcorn. Nice big pieces of popcorn which hold a lot of flavor.",
        "This is a great popcorn popper. Using medium- low heat, good quality corn and coconut oil, the popcorn is delicious with just a little salt. It reminds me of the \"olden days\" back in the 50's when my mom cooked it on the stove in a covered pan and moved it back and forth over the heating element on the stove. But a whole lot easier and better for the stove. Makes microwave and movie theater popcorn tasteless in comparison. And no unpopped kernels although that might be the quality of the corn, too.",
        "I bought this after watching a you tube video for roasting green coffee \"beans\" (seeds, really). Arrived quickly as usual for amazon, nicely packaged. I pour about 4 oz of green coffee inside the popper, and within 10 minutes I have nicely roasted, fresh coffee. The handle works well, except it makes a bit too much noise when cranking, and long popping times do get old and tiresome, but for the purpose, has worked very well now for over six months. Other than some color changes in the bottom, it looks as if new. I cannot comment on popcorn making.",
        "The great thing about the Whirley-Pop is that in my experience, it pops all the kernels. Unpopped kernels are more than an unpleasant nuisance. They can damage teeth. Using this popper with 3 oz Orville Redenbacher 's Original Gourmet Popping Corn plus 3 tablespoons peanut oil and 1 teaspoon of salt, I consistently have no unpopped kernels or burned pieces, after turning the handle for about 3 minutes using a medium flame on a gas burner. I've had my Whirley-Pop for four years now, and last night I used it again. Absolutely a great product.",
        "I LOVE this popper -- it's the best popcorn I've ever made at home and tastes so fresh and healthy! AND it's great quality compared to the alternatives AND it's made in the USA!!! WAY better than microwave popcorn and just as quick. I like that you don't have to wash it between every use if you use it often enough. I know it's not dishwasher safe, but I run it through there anyway. The seal on the wood is undamaged and the aluminum only slightly matted, but we use citrus-free dishwasher detergent, so I think this helps prevent that awful oxidation aluminum normally gets in the dishwasher.",
        "Best results yet for popcorn. I have used the microwave, standard kitchen pan and the Whirley-Pop to pop from the same package of popcorn. it took a couple of batches to figure out the best heat setting on our stove, but this works great. Once the stove temperature was correct, it truly does pop a batch faster, and more thoroughly, than the microwave popper. No burned sections like those I occasionally have with the Microwave, either. Not the heaviest of pots, but it does the job very well, and at the savings over the microwave packages and/or waste of other popcorn, this will pay for itself rapidly.",
        "Follow the instructions and it works perfectly & quickly - very few leftover seeds, even when using cheapo store-brand popcorn. I use only 2 tablespoons of oil per half-cup of seeds. Easy to use and easy to clean. I've owned three of these in the last 35 years but we make popcorn A LOT so figure on at least 12+ years of good use.",
        "I had one of these when I was growing up and remember using it regularly. I was happy to discover it on Amazon. Although it is a much lighter weight than the one I used 45 years ago it works very very well",
        "We have been using a popper of this type for many years that finally fell apart. This one is nothing like our previous one. The metal is very thin. Unless your ratio of popcorn to oil is perfect, it's awful. We just had to turn fans on and open our windows with smoke pouring out of the popper. We hope that over time it will start working properly. As of right now, we're not happy with it at all!",
        "Like the ease of use and easy clean up. The first two batches of corn did not have as good of taste as my old stove pot. It might just need to be seasoned. I still like and will use often I wish they would have included some of their products to test.",
        "Makes great popcorn but the build quality is questionable. I've bought 4 of these now and it this one will be my last. The plastic gears on two units have now cracked and made the lid/handle worthless. The unit has a warranty but only if you fill out the paperwork contained in the box when you receive it. Doesn't matter if you have proof of purchase or not, you can not warranty this item unless you fill out the paperwork that includes a special code.",
        "Gotta love the Whirley Pop. I e had one for years and bought this as a gift. Only thing I would change is replacing the plastic gear with a more durable material since they tend to break and wear out rather quickly.",
        "It's pretty lightweight material so it heats very quickly. Have to be really careful not to burn the popcorn. I made the mistake of not turning the handle fast enough and burned the bottom of the pan. I could never get it really clean after that. However, the crank worked just as it should and held up very well.",
        "It is great and I use it often. When I tried to register and receive my free gift the system would not let me place the order. That was disappointing. The starter pack was simple and easy but way to salty for my liking so I will stick with just kernels of my own. All in all I had been wanting one of these for some time and with my new glass top stove I had not been able to have popcorn in months. Now I can!",
        "The way popcorn was meant to be.I had purchased this as a memory-trip, and also because microwave popcorn really isn't that good or good for you. Certainly, it's a bit more labor-intensive than throwing a bag of microwave popcorn into the microwave, but the use of recognizable oil for popping means that very little additional flavoring is required. Certainly, you can go crazy with your flavorings, but using olive oil for popping plus a bit of salt is extremely good. If you're feeling wild, try some parmesan cheese and black pepper, or even some barbecue rub. It's well worth the arm-work turning the crank!",
        "Once I started popping corn with this pan, it quickly became a yummy habit! Card group friends love it! Can't believe how fast if works...BIG bowls of perfect popcorn in a very short time !",
        "I love popcorn... so much I could eat it almost every day. However bag popcorn is just so greasy. This changed making popcorn at home. It's simple. Easy to clean. I love that the whirly pop pops every kernel in just a few short minutes.",
        "I loved this pan at first, but after only a few uses it broke. The top parts that make it spin are just plastic. I have only used it about 4 times. When I went to use it last the popcorn burned. When I looked at it to see what the problem was I saw that one of the plastic pieces was cracked and so it wasn't actually turning the part inside the pan. When I washed it the piece completely split in two and fell right off. The popcorn burned so badly to the pan that it is unusable. I am so disappointed in this product.",
        "Well, I had to use it three times before I got the hang of it, but it's great! I found I wasn't putting the heat high enough at first, for fear of burning the popcorn. First batch took over 20 minutes!! Next time I turned that baby up and within 3 minutes I was eating fresh, fluffy popcorn. I was surprised at first that the pan is very light and seemed kind of flimsy but it really holds up well. So far, nothing has burned and the best thing - NO UNPOPPED KERNELS.",
        "I don't know how I haven't owned one of these before now! We tried the packaged samples that came with it initially, and it popped up perfectly with very few kernels left unpopped. But THEN we experimented with our own creations and I may never turn back to microwave popcorn again!! Try this with butter, fresh minced garlic and creole seasoning and you won't stop eating it! Anyone on the fence of whether it takes \"too much work or time\", at most it took 5 minutes to pop the entire container on the stove top with minimal effort churning. Can't recommend enough!",
        "Friend suggested this to me & has been one of my favorite gadgets in my kitchen. My daughter loves popcorn & this makes it easy & fast . Even bought a few as gifts for popcorn loving friends. The pan is easy to clean but grease builds up on lid but still worth it!",
        "I've only used this popper a few times, so I can attest to its long-term reliability or durability. I can, however, say that it makes some of the very best popcorn I've ever tasted! Big, fluffy popcorn that isn't overly oily and nearly every kernel pops. It's fast, easy, fun and convenient. I tried an air popper, which worked fine, but with no oil, it just didn't crisp up enough or have the right texture. With just a little oil, the Whirey-Pop makes delicious popcorn on my flat-top range. Popcorn perfection!",
        "Got this out of the box washed and seasoned according to the instructions. Says the popcorn takes 3 to 4 minutes but ours was ready in 2 minutes. First let me say this popper is light as a feather so when your hand gets tired turning the knob you can simply shake the popper over the heat. I would not recommend letting kids try this even older ones with out a glove. There were times when I felt the steam which was really hot but by no means unbearable. Popcorn was delicious!! Thank you to the company for including some movie theater popcorn and oil with the popper. It was yummy.",
        "I've popped corn over the years in just about every way imaginable, but this popper is without a doubt the VERY BEST corn popper I've ever come across. In fact, it would be hard to beat it. The corn all pops and the flavor and texture is perfect (I use Great Northern Popcorn Premium Quality 12.5 Pounds Bulk GNP Original Yellow Gourmet Popcorn & Paragon Coconut Popping Oil). It would be hard to buy a better corn popper as this one is as near perfect as you could ever get. Clean-up is easy & fast too. I could not be more thrilled with this corn popper and use it almost daily.",
        "This is the only way to make popcorn. This is our third or fourth one of these. They typically last about two years before the crank mechanism fails, but for the price it's worth it. Once you get the hang of the temperature, oil quanitity and timing, it makes perfect popcorn every time. One tip: clean it when it's still warm, especially the top with the crank mechanism, as it makes it easier to get the grease off.",
        "I can't say enough good things about my Whirley-Pop! Do your research, microwave popcorn is very bad for you with all the preservatives, and stuff they line the bag with. This combined with Orville Redenbacher Pop Corn kit found here:  You will never go back to microwave stuff again! If you like pop corn like I do, buy this now and get ready for better than movie theatre pop corn.",
        "We do highly recommend this old fashioned popcorn maker. It really makes popping some corn fun with the kids. We also throw some sugar in and make some sweet corn. Excellent!",
        "I bought this on a friend's advice and am really glad I did. All the kernels pop and you don’t need to use very much oil (one teaspoon works for me). You won’t be disappointed!",
        "We have been using an air popper, which isn't very satisfying. The Whirly Pop is easy to use and makes quick, effectively popped corn every time. I was concerned about the oil, but have discovered that coconut oil is the way to go to avoid unhealthy fats. It pops the corn and gives it a richer flavour without having to add butter to the corn (coconut oil does not taste like coconut on the popcorn). It only takes a couple of minutes to pop. Of course, there is a pan to wash up (compared to the air popper) but it is quick and easy since nothing sticks to the pan.",
        "I liked the Whirly Pop and used it for years without any problems, but the first time we used it after getting a new smooth surface, glass cooktop, it scratched it. We threw it right in the trash and will have to buy a different kind of popper. I'd imagine if you were super careful while cranking the popper you might be ok, but it's just too risky. And with kids it's guaranteed to scratch at some point. So good product but only use with normal burners and not glass.",
        "My family is a popcorn family so we have popcorn 3 or more times a week. I am glad I got this and would get it again. Good: Pops just about every single kernel. Seems to make the popcorn lighter then our old stove top in a typical pot method. It is hard to burn the popcorn. Easy to clean, just wipe it out. Kind of like a cast iron skillet. You will make more popcorn, more often. Bad: Plastic gears. The lid can be a little hard to get off. You have to turn the handle the whole time. You are going to go through a lot of popcorn.",
        "Works great! Just like my grandma had 50+ years ago. I use a little less corn than it calls for. Good price. Even if I have to buy one a year, it'd be a savings over microwave....plus taste is \"cleaner\". Some things should never change. Glad I found Addendum: have had for a year now. Still love this. Perfect working order. We use once a week and have had no gear problem. We do turn the handle slowly and take care when we wipe down...if that matters. Have bought more for gifts.",
        "The flavor you get from the popcorn is fabulous!! The cooking time is about the same as a microwave, and the clean up is pretty quick. I use olive oil for my popcorn. I used to spend $$$ at Trader Joe's on their version, but no more!! This popper is simple and fast. Plus....... You can customize your popcorn by type of oil, seasonings, etc. The popper lid snaps off for clean up. I usually wash mine, but a few times I have just wiped it out with a paper towel. I bought 2 more of these for Christmas gifts.",
        "comes clumsily packed; no complaints from gift recipient so it seems to not have affected its function",
        "I have never owned this style of popcorn popper. It heats up fast and once it starts popping, it is all over in under a minute. It's fast! I just add the coconut oil, the corn, and the flavacol on med-hi heat. Start stirring with a slow turn of the crank. Sometimes popped kernals get under the twines that are rotating along the bottom of the pan which prevents the crank from turning easily or at all. But it usually occurs right at the end of the popping phase so I remove the pan from the heat and dump it into a large bowl or container.",
        "I bought one of these years ago and loved it. Bought a different popper from Northern Popcorn Co recently because I wanted a stainless steel popper instead of aluminum. Big mistake. Wasted my money. Went back to Whirly Pop and bought one for my sister, too. We both love how fast the corn pops and there are virtually no unpopped kernels if you follow the instructions. The corn doesn't stay in contact with the aluminum very long and we wipe them out as soon as we're done using them. No soap and water required. Just wipe out with a paper towel and you're good to go.",
        "This makes the best popcorn. When I was a little girl the air poppers used to make good popcorn, but try as I might (I've bought 3) they all have tons of old maids. Not a good thing when I'm making my \"crack\" caramel popcorn. (We call it crack popcorn because you can't stop eating it and after you have eaten the whole bowl, you still want more.) This makes delicious fluffy popcorn that you can butter or candy coat SO easily. Warning: This may not ever leave your stove top because you use it so much.",
        "This popper performs as advertised .... pops quickly; popped corn is perfect; cleans easily(since I do the dishes, that is a big plus!).",
        "This popper arrived today along with a box of the Great Northern Popcorn tri-packs and we made the best popcorn we've ever made - almost identical to movie theater. Many reviewers complained that this popper is made of really thin material and is not very tough... it's true - when the box arrived, it was so light I thought it was empty! But I suspect that it's the thin aluminum material that actually makes it produce such good popcorn. All our thick-bottomed pans just burn it. Just be sure to follow the directions and not use too high of a heat.",
        "We've been making popcorn every night since we got this. Super easy. Easy to wash (by hand, not sure if the lid goes in the dishwasher)",
        "Works acceptably, but is utterly unnecessary if you have either a 2- or a 3-quart heavy-bottomed saucepan which actually works better than the Whirley-Pop if shaken over the stovetop. Simple can be better, and you'll have fewer items in your kitchen. Plus, a saucepan is good for making sauces and boiling other food while the Whirley-Pop is a one-trick pony.",
        "Doesn’t appear to be well-made. The little twirly piece that moves the popcorn kernels inside the pan would get stuck at times. I wasn’t very impressed with it.",
        "Have done several batches of popcorn with the Whirly and result not as good as the REDENBACHER Microwave variety, even though I am using the Redenbacher original dry popcorn. Had one of these 15 years ago and it worked great. Will keep trying to get the right temp (electric range) setting and oil quantity. Good design and don't see a problem with the plastic gears so far. Will go back to trusty YouTube for help and hints on use. Update 6/20.2013 Last night I increased the oil to 2 Tbsp and used 1/2 cup of Redenbacher Corn and the batch turned out very good (according to my \"Chief Taster\").",
        "Had owed and been very satisfied with this popcorn maker for about 6 months when one of the plastic gears broke. It always felt a little cheaply made. I contacted Wabash warranty department and talked to Amy, who was very helpful in getting my product registered, and is sending me a replacement gear kit. This is fine for me as I am pretty handy, but the parts are small, and if I didn't have great vision or dexterity, it might be problematic. For some people, it might have been nice to have the option for a replacement unit.",
        "I bought one of these almost 20 years ago and we loved it. This one was bought as a replacement and given to me for Christmas. Everything about it is fine except that the stirring mechanism is not set correctly in the bottom of the pan. Popcorn gets caught under the piece and burns every time it is used. Extremely disappointed.",
        "Im pretty much.... a \"power better is better\" kinda guy... but when I saw this little gizmo... I was all woo hoo analog!!! it just works... takes about 3-4 min... fairly easy to clean... its feels a little steam punk and cranks out great popcorn... yup its pretty light weight as a few folks have mentioned.... but its popcorn.... Im not making chili in it.... it doesnt need to be heavy. it simply does what its supposed to without any pretense or bs... I like it a lot! If I had to be an appliance... Id want to be one of these!"
    ]
}