{
    "entity": "Cookware Sets",
    "text": [
        "the little saute pan edges are as sharp as a knife!! i was washing the edges with the sponges and it cut my whole hand open. I was bleeding everywhere. Edges of pans are way to sharp!! Be careful people",
        "I bought this set on the recommendation of Wirecutter and I could not be more disappointed with a cookware set. The pots overheat and everything burns, and sticks to the surfaces. I have a gas stove and even on the lowest heat setting with the gigantic pot, all the contents scorched beyond recognition. Lost many meals and had to ultimately throw the pots out. A waste and a shame. Terrible product.",
        "Bottom of the inside pan looks melting...I cooked very low flame even .. after washing by hand with soft sponge I notice the color of bottom got Changed...then I use vinegar to clean the melting kind of got completely went become very clean as new...now happy with the product ...",
        "I purchased these back in 2014 and each piece has pitted and started to rust. I have thrown out all but 2 pots. I would save your money and purchase something else. I didn't use harsh chemicals to clean and never overheated any of them. Poor excuse for stainless steel.",
        "Had to return these...black marking and discoloration after using on the inside of the sauce pans. Not normal quality for Cuisinart.",
        "This is my second set of these and I’ve used them on every type of cooktp- halogen flat top, electric burner and commercial gas. They are perfects. Heavy solid core with even heat distribution, excellent finish, stove to oven. So so SO much better than nonstick!! . They’ve upgraded and have measurement lines inside them now- just a plus. I’ll be back for more.",
        "I started off ordering an 8\" skillet by Cuisinart from Amazon. I liked it so well that I ordered this set. I am VERY, VERY PLEASED with this set! It is top quality! Since then I've ordered 5 or 6 of the 8\" skillets as gifts and everybody loved them too!",
        "These are a good set of pans, with a nice mix of sizes and volumes for a really good price from a reputable company. However, they are just hard to clean. It had marks on it from the first go using it and it has been impossible to get rid fo them. The handles do stay cool when cooking and they are light to carry and cook well, but it's just the marks and difficulty in cleaning them that make them look older than they are.",
        "solid construction. we use these every day. we wanted to get away from non-stick pans that eventually peel and have to be tossed in the landfill. These should last a lifetime. Seems like they will. We shall see. We've had them for a little over a year now and have used them pretty hard. They're still great.",
        "These are very nice - just like the pics imply. They are not too thin, the lid fits well, the cooking performance is perfectly suitable, and they're generally very nice. I deducted a start because one of the pots sliced my roommate's finger open when he was washing it! That's not very cool. Had it been my finger, I might deduct two stars! I only give five stars to products that don't cut fingers. except for knives. But these are pots. They shouldn't be sharp.",
        "Fast shipping. I give these Stainless Steel Cookware 4 starts because, even if i use under low heat, still everything sticks to the bottom. I thought that Cuisinart is one of the top best quality products, but a little disappointed.",
        "I bought this set over 10 years ago and then bought it again for a 2nd home since we've liked the first set so much. These are not the same product and definitely not as good, even though they call them \"Chef's Classic\" so that's disappointing. They don't seem to cook as evenly and we've heard some weird crackling sounds while we cook. I read some reviews before getting them and was hoping I'd be getting the same product I'd initially bought, but seems like they've cheapened the quality of them.",
        "There are little white spots that appear on the bottom of the pot. All I've done is boil water in it for oatmeal or eggs. The white spots appear every time when I am finished washing the pot. At first they were difficult to get out with a scouting pad. Now they just wont come out.",
        "Never thought I could really dig a set of pots and pans, but these are very cool. If you pay attention to the cooking instructions and the cleaning tips these are like magic..I will get more. ( maybe not tomorrow, but soon) I had the teflon coated sets and they were ok but never really liked them . I decided to get rid of all of those before I bought these just so I would not fall back into old habits, glad I did. follow the tips about cooking and cleaning, you will not be sorry.",
        "Purchased this for grown son to replace mismatched pieces. He is more than thrilled with this set and has been inspired to really learn how to cook better now. Ease in cleaning is really important to a single young man. This set should last him a very long time.",
        "I've bought this product at least 5 times already. It's so amazing I had to have my mom, niece, friend and a client, all experience what a thrill it is using this product. Cuisinart never disappoint?",
        "I am not a big cook. I’m not cheffing it up every night on the regular. But these pots and pans inspire me to. They’re so pretty, easy to clean, distribute heat evenly and are very durable.",
        "This set was bought after getting some pieces from this series second hand, the quality is fantastic, the measurement inscribed at the sides is very helpful, it has a good weight to it, not too heavy neither too light, love the simple, minimalistic design. One point to notice, one of the pans from the old set did cheap a bit, but it might be due to the use of harsh degreaser for a long while, thought the larger pan the received the same treatment appeared to be just fine. All in all it is a great set, and I would have loved to have the larger set but the shipping and taxes to/in Israel are just way too expensive.",
        "I just tried the saucepan- throw some shaved potatoe on it, tossed it with veggies, and topped it with cheese and cream- loved it! It's light, durable, with a simple design. I was a bit skeptical at first because it was so shiny and light, I thought it looked cheap. It held up and proved to be a great buy. I like all it's features and the set has all the cookware I'd want and need without buying a trailer full of pots. Like with all cookware cheap or expensive- make sure learn how to use it correctly and treat it. This is a low maintenance product with professional quality.",
        "Love my new pans. What can I say? My old ones were given to me when we got married 43 years ago. It was overdue to replace them, and this set is the perfect solution. Food cooks well, and the pans clean so easily. Highly recommend these pans.",
        "Wow you can tell the difference between this high quality cookware vs cheap stainless steel cookware. They are easy to clean and very durable, and are great for cooking. The shiping was quick! I placed no rush shipping it was supposed to arrive 7 days later but arrived 3. 5 stars! 🙂",
        "I ordered this as a lightning deal for $74.99. Pros: looks really nice - very shiny and professional looking. Would look nice on a rack. convenient sizes - good starter set to do the basics It really is stainless - my husband burned the bottom of the pan cooking bacon and it all came off with a brillo pad Cons: I have a gas stove top, and the handles get really hot on these pots - you definitely need to use a pot holder with these",
        "I purchased these in my effort to remove unhealthy cookware in my home. They took some time to get used to cooking in (no high heat for example), but we have all adapted and do not have to worry about nasty Teflon flaking off in our food and getting into our bodies.",
        "Very happy with my set! I've had them for 4 years now and I continue to be pleased. These cook evening, and clean up well. If there is any staining inside I heat with a little bit of vinegar and it cleans right up. Handles stay cool throughout cooking. I've used these on glass top and gas stoves. Glad to have cookware that doesn't not contain any nonstick; I'd rather not risk the exposure to those chemicals. I would buy again!",
        "They look nice, they came quickly in a practical package. But as other people mentioned it creates black spots after using them only a couple of times, which is really frustrating. It affects my cooking; at the black spots the food becomes overcooked even at moderate heat and sometimes it gets burned even though the rest of the food is not done. And yes I am an experienced in cooking. I do not recommend this product!",
        "We LOVE our new pans. Well made, easy to pour with rolled edges, perfectly fit lids. The large pot lid fits the 10\" pan, which I couldn't confirm before buying and am relieved to find it does. Perfect for our new glass stove top.",
        "I bought these a year ago and I still love them. They look as good as the day I bought them. Easy to clean with a magic erase or boiling vinegar.",
        "The first time I used them black spots appeared, not good with very high heat. They are pretty!",
        "They look outstanding coming out of the box. Almost a year later, and after lots of use, they still do. They work just fine as my primary cooking set. I use daily. The saute pan is just the right size for most dishes I cook. A light spray of Pam before cooking meat is all it takes to avoid any sticking at all. I wash them in the dishwasher, and it hasn't faded or scratched any of the set. The lids fit great, and the lip on the edges of the pots make for a super easy, clean pour. I didn't realize how bad my old pots were at pouring cleanly until I used these!",
        "It’s nice looking set . But very thin , nice set to have as a starter ... if you want your pots and pan to last years and years spend little extra . I have a good quality pots and pan set this makes every day cooking little easier . Because sometimes I find my self needing another big pot . For cooking pasta , making soup, is excellent. I would definitely recommend as a second back up set .",
        "Everything I've made so far has been better than with my last set of pots/pans. They are super easy to clean, and can put them in the dishwasher.",
        "I spent $40 on just a stock pot, here in Hawaii... therefore this bundle is a wonderful value! I especially like the measuring lines in these pots!",
        "This is my first set of pots/pans that aren’t non-stick and I love them. They’re really easy to clean and they come out of the dishwasher shiny and spotless. I’ll probably buy another set just so I have more pieces when I’m cooking for a holiday.",
        "This is a great set of cookware and couldn't wait to put it to the test by whipping up a batch of pasta sause. I have a glass top ranges which tends to overheat, so kept the temperature low so nothing burned. It worked well and was a breeze to clean up. I was only looking for a couple of saucepans to replace a couple of Circulon sauscepans that were well worn. However, buying individual saucepans was more expensive than buying the whole set. As always happens with my Amazon deliveries, they were delivered as promised with no damage. I'll have these for a lifetime for sure.",
        "These pans are more aesthetically pleasing to the eye than they are functional. The pan doesn’t do well at all when cooking on it. Eggs come out funky. Everything sticks to these even with butter or pan spray.",
        "Bought these to replace TOTAL TRASH 1yr old peeling sticking gotham steel thats been nothing but CRAP since day one!!!",
        "This is a great set of cookware and I love everything about it. Very durable at an exceptional price. Very pleased with the set.",
        "This is the perfect set for a boat, RV, or a starter set for moving away from home. These pans are from chinch. They have a nice weight to them and they heat evenly.",
        "I've now used these on several occasions and I'm very happy with my purchase. Even with acidic red sauces, these pots cleaned up nicely. They should only be used with medium heat. Using high heat overheats the pot and food, leaving stains and discolorations. Great value, too!",
        "I was kind of disappointed when using my new cuisinart pots. I heated pasta sauce in very low heat however when I went to clean it the pot, it had white specs in the bottom and those would come off. I was expecting such a high quality. I saw another review with the same complaint. I wish there was a recommendation of how to remove the specs!!!",
        "This is actually a great set to add to your current cookware. It is surprisingly easy to clean and the weight of each pan is good. I am buying 2 more sets for Christmas gifts.",
        "I purchases these pans because we were looking for a good set of BFOA free pans. There were well reviewed and fairly affordable compared to other options. We mostly use them for items that wouldn't stick anyway (pasta sauce, boiling water, etc) so haven't had any sticking issues. They do seem to stain very easily though. After boiling salted water, they start to show strange stains that don't come off. Not a huge deal.. they still work.. just don't look as nice as you'd like them to after a few uses.",
        "So far after 6 months, these still are brand new, easy to clean, and we are happy with these.",
        "Excellent brand! incredible price! Perfect starter set for a (newly on their own) person's kitchen Need a non stick 12 inch fry pan, baking sheet for cookies, biscuits, etc. and a baking pan for cooking roasts and whole chickens.... done!!",
        "I was new to stainless steel cookware so was a bit intimidated at my first purchase. Read the reviews on numerous sets for days trying to decide. There were a few bad reviews on this set but I don't understand why. It works great, cleans easy, and has a really nice shine to it. Glad I didn't listen to the bad reviews!",
        "My wife and I have really enjoyed these pans. They are a really affordable way to get into all stainless steel pots and pans. They do tend to show wear on the finish if things get burnt to the inside, but it has been my experience that it does not change the way they cook in any way. They still function flawlessly regardless of how they may look. They clean up really nicely and have easily met my expectations.",
        "I wanted to give this set a five-star review, until I found out the pan sticks every time I fried an egg or frozen dumplings. Considering how much time I have to waste scrubbing the pan each time after I cook, I don't recommend it.",
        "Product came used. What the heck. It has obvious burner rings in the bottom of the largest pot. However, the other 3 things don’t seem to be used from looking at them. Gross",
        "This is my first stainless steel set. It is much harder to clean even with bar keepers cleaner that was suggested by reviews. I know that stainless is better than non stick in regards to health and safety to I made the switch. I think i should have gone with porcelain instead because I am personally too busy and tired to scrub out pans. I know overtime I will adjust",
        "I am so happy with my purchase!! I wanted to replace a pan set that was over 25 years old. The set was Aluminum with a Teflon coating which was flaking off. Aluminum cookware causes BPA's to leech into the food cooked in it just as BPA's leech into foods packaged in aluminum cans. The beauty of the Cuisinart Cookware is that the aluminum is encapsulated and it allows heat to be evenly distributed in the pans. I don't have to have the heat on the stove very high at all and they clean up beautifully. The price was great too!! I know that I will be healthier because I am now cooking with stainless steel!!!",
        "I like it much better after I used it than when I first opened. It isn't as heavy as I thought it would be. My other SS cookware has a much better and heavier base on it and a rolled lip. I really do like the skillet. I didn't use it for awhile.When I washed and dried it the skillet had a nick on the lip or edge. My cloth hangs on it. The lid to the pot fits the skillet and I like that. Over all it is a good deal for the amount of money that it cost. I would recommend it to others.",
        "I like this set, although I need to get use to stainless steel after more than 6 years of using the same set with the nonstick coating. gave it 4 stars just because I happen to put my hands on a frying pan of All-Clad and immediately sensed the differences. in quality. (yes, I know this frying pan alone cost more that the whole set... just to encourage Cuisinart to aspire to better and better quality).",
        "This was a great purchase at a great price. Everything heats evenly and very hot. I have a couple non-stick pans and after using these stainless steal ones for so long - I noticed a huge difference right away in how hot the different pans cook. I was actually surprised. This is a great gift : wedding, graduation, etc..... I bought a set for my little sister's Christmas present ....... who is living on her own now and her 20 something friends all think she is fancy with her cooking wares. ;)",
        "Not happy with the quality! Stainless steel pots got black spots on the bottom and tried to clean it so many times even with bar keepers friend but nothing helped! Don’t waste your money.",
        "These cheaply made pots and pans have rusted out after 5 months of use.Don't buy this imported garbage.Wish that they could be returned.Cuisinart should be ashamed of them selves for selling this trash.",
        "I've had non-stick pans for a while (really good ones!) and after a bit they are hard to clean, food sticks, and the coating peels off. I got a Cuisanart large stainless skillet about a year ago and was so pleased with it that I bought this set of pots. They are just as good as my skillet. They cook evenly and are a snap to clean. Even if you burn something onto them ( which I haven't done yet but did once with my skillet) you can always resort to the S.O.S. pad and everything will be good as new.",
        "i'd give it 5 stars, but that intimates perfection. it's a great all-purpose set, very versatile, all the pots are lidded, and the biggest lid also fits the frying pan. nice weight, nice grade of stainless, nicely clad, fast conducting bottom, good heat distribution. handles are well-designed, don't get hot on stovetop. ok for stovetop, oven, and broiler. 3 qt. pot is very versatile, good for 1/2 lb. of pasta, also nicely accomodates steamer insert for veggies. it's a whole-lotta-bang for the buck. allez cuisine!",
        "Great starter set.. Handles do not get hot, requires little oil or butter to prevent sticking and cleans up nicely. It should also outlast Teflon coated pans which lose their slipperyness after a few years.",
        "Quality and gets the job done. Yes, I've already stained the bottom by making popcorn in it... but hey, it still works just the same and I don't plan on displaying the inside of them to my guests.",
        "Highly recommend! I've only ever used non stick frying pans but will never go back to them now, the entire set is great. There is no problem with food sticking and the pots and frying pan heat up much more quickly than non stick cookware. Food cooks like a professional chef is making it, you won't be disappointed! Bon Appetite!",
        "Despite not having a non-stick coating my usually eggs sticky mess was easy to clean up. I have put two of the pots in the diswasher and they have come out beautifully. Water seems to come to a boil faster than my other name brand pots, perhaps because the bottom is conducive to heat. The top of the biggest pot fits on the frying pan which one would assume but it is hard to tell from the picture.",
        "I love this set of pots and pans. Both my mom and I bought a set, then we gifted a set to my sister-in-law. They have lasted great, despite the tough and rough use I've put them through. Solid, heats up nicely, toss them in the dishwasher with no issues... I say a great investment!",
        "i always like Cuisinart products. Their product is durable for a daily heavy cooker like me. i used other brands, the inner cookware which was burn is uncleanable. The black burn spot is still there. However, for Cuisinart cookware, you can clean the burn black spot. I highly recommend Cuisinart cookware. Good Quality, Durable!!!",
        "I've been using this set for about 5 months now and am completely satisfied with it. My needs are simple: 1) how well does it heat up, and 2) how easy is it to clean. They heat up quickly and evenly, and clean-up is very easy...virtually nothing sticks! I always let the pots soak for a little while before I wash them by hand. The only thing that actually took some scrubbing was scrambled eggs. They look very nice, too. They have gotten a little scratched on the bottom, but that's not a big deal for me...after all, I use it every day!",
        "THIS WAS A GIFT FOR MY DAUGHTER...SHE SAID SHE LOVED IT",
        "it is the worst buy for me ever, very poorly made and the quality is horrible,",
        "So far, I am really pleased with these pots and pans. They are an excellent value and so far they have been easy to clean. Overall I would say they are good quality. They are not 5-Star quality, but very close, so I give them a 4.7.",
        "As the headline says, it's a great mother's day gift. the lids fit perfectly, and are great for cooking. however, since they do not have \"stay cool\" handles, you do have to use a mitt or cloth when using it while hot. the pots aren't heavy (which is great for mom's arthritis) Mom is very happy and I the price is fair for what was given.",
        "This set is great for the price, would be perfect if 18:10 stainless, but still a great deal for the price.",
        "This set was great. I wanted stainless steel but didnt want to piece together a set or buy a huge 14-piece set. I was cautious to buy online because I was afraid of getting this bottom cookware that didn't cook evenly. This aluminum core set heats very well even on my gas stove.A bit tougher to cook eggs, and cleaning just requires a little soak and it cleans up easy. If the pots ever lose their original luster just hit them with a bit of Barkeepers friend.",
        "Waste of money! These pots starts rusting and showing spots especially on the smallest with the first month of purchase.",
        "It's beautiful to look at. It's sturdy but not too heavy. And very little sticking. Just follow the clean up and cooking directions, especially about the heat. The set is adequate for my husband and I. I've owned it for about 2 months and I got rid of all my Teflon cookware!",
        "Good weight and even accidental get burn, it’s easy to clean. The quality is nice. I loyal this brand.",
        "These are good for college kids or as a first set of pots and pans. They are made of thin steel, so boiling water with gas or traditional stovetop takes longer because of this. The non-spill lip is thin and hurts your hand when washing them - feels like you're going to cut yourself.",
        "This nearly perfect cookware set is worth the investment. I use them nearly dail for cooking most any meal! A few spots have black specs as I noticed mentioned in other reviews, but it hasn't impeded the performance of these pots one bit! The construction is solid! I prefer plastic-free and non-stick coating free cookware. These will be in my kitchen for a long time coming!",
        "Manufacturer's Description on Amazon says, under The Coolest Touch in Home Cooking, \"Further, glass lids equipped with wide, easy-grip handles fit tight to lock in flavor, texture, and nutrients.\" The lids are stainless steel, not glass as advertised here. Otherwise, the pans are nice.",
        "I love this cookware so easy to clean and the price is great other companies their prices were way higher",
        "Arrived scratched with a black stain on one of the pans.",
        "Chef quality. Inside measurements. I love the lids. What I want 💗💗💗",
        "These pots and pans got here fast and seem to be great quality. The only reason I'm giving it 4 stars instead of 5 is that the first think I cooks was an egg with canola oil and it stained the bottom of the pan. This may just be the learning curve because I've never used stainless steel cookware before. I'm currently looking for solutions to prevent this in the future. In addition, cooking without a spray or oil does not work for me.",
        "I just checked my account to see when exactly I purchased this set. It was 2013. We used the sauce pans pretty frequently on a gas stove, but I guess you get what you pay for. Two years later, the rivets that attach the handles to the pots are loose -- and when you boil water, it makes a weird burning sound because the water gets behind the rivets inside the pan. These do get heavy use, but.... two years? I wish I bought a set of higher quality. I did have another Cuisinart set for about 10ish years -- this set replaced that. But I guess the quality has diminished.",
        "I love them, they are beautiful. I moved and had to left the same ones because I was moving to my mom's.",
        "This set was a gift to my son-in-law. According to my daughter, he loves them and even has forbidden her to use them. So even though this is second hand informaiton, must rate it a five! :)",
        "I doubted a lot before buying because of some bad reviews but I'm glad I buy it great size for my needs and beautiful sturdy set. I will buy more for sure",
        "This is a nice entry level Cuisinart pot and pan set. They are solid and easy to clean. Completely stainless steel, so there is no need to worry about peeling non-stick coating.",
        "This small set has all the necessaries for a new apartment. Easy to clean, great heat distribution, and the handle doesn't get hot. I'll have these guys for the next 10 years at least.",
        "I wanted an alternative to my heavy All Clad pans for days that my hands hurt. These work very nicely and distribute the heat well on my induction cooktop.",
        "What a product! I don’t cook much, but when I do, I use Cusinart. Easy to clean, light weight, but sturdy. Beautiful set, and hasn’t stained or scratched. Get this!",
        "Never had quality cookware before. What a difference. Everything cooks evenly. Less likely to burn. No teflon or other plastic to get in the food. When the water is boiling, the handle is still cool. Built to last. Would recommend.",
        "love cooking with these pots an pan. easy to wash, handles don't get hot, machine washable and durable. If its Cuisinart its great quality. way better than the non stick pots i replaced them with.",
        "Better quality than many sets we have seen. Cooks well. Cleans easily. The thin side walls are not so nice for gas stoves, but we have a ceramic cooktop, so this is perfect for us.",
        "Good product using it for more than 6 month. It is sturdy and good, we used it for Indian cooking’s. A complete set, I like to carry while traveling back to India.",
        "I love the brand and all its products. For this set of cookware, I want to say they are of great quality and with a quite reasonable price. The only thing that I have to complain is that they are hard to keep as clean as they were. They will turn yellow gradually. But I still love them!",
        "I liked the set a lot, but I needed more pots. I started looking for couple more to add to the set, but instead end up buying the same one again. The price of the set (under $75) is so good, that individual ones would always cost you more. Plus, when I tried another set by Cuisinart I had to return it because the quality was really bad.",
        "This is THE best quality cookware! I left some beets on the stove by mistake on low overnight and because the seal on the lid was so good and the heat distribution as well, the bottom burned but never ignited. I soaked the pot for several hours then cleaned it and it looked like new. Performance is absolutely tops!",
        "After being fed up with the non-stick coating coming off in my pots and pans I came across these after searching for a stainless steel pot set. Cuisinart is a tried and true brand in the kitchen and for the price I figured it couldn't be beat. My parents purchased this same set almost 10 years ago and the design and quality are exactly the same. They feel sturdy and I know they will stand the test of time.",
        "Great set. I grew up using stainless steel on an electric range and had been wanting my own for a long time. I have a gas stove now, so the only thing that took me a while to get used to was cooking at the right temp on the gas range. I don't have a dishwasher so I can't comment on how they do there, but they're easy to clean up by hand, even if you stain a bit (just heat up some vinegar and scrub as the care guide suggests). Will post as I use them more.",
        "The value of this set is incredible. The pots themselves are very high quality....compare to All-clad...the difference is the shaping at the top. And, the other big difference is the low or poor quality of the lids. They are very \"tinny\". So, as far as cooking capability the performance is there but the fit and finish is not.",
        "I have really loved the pots that come in this set. The skillet not so much - it always seems to get stuff stuck to it/stained on it, etc. I guess with stainless cookware - it's best when you're making stuff in water (which is how I use my pots).",
        "It's cookware ..... So only so much excitement can be captured by this narrative. I'd like it even more if they could fit one more '7' in the product description."
    ]
}