{
    "entity": "Cookware Sets",
    "text": [
        "I have been using this set for about 8 years now and it's great--so much so that I bought this one for my just-out-of-college sibling. It can accommodate almost any dish you'd want to cook and can endure some abuse without degrading in quality, a perfect \"starter kitchen\" box. Until/unless you want to upgrade to some seriously fancy cookware (copper, etc), this set is your best friend.",
        "I had previously ordered a Cuisinart pot about four years ago, which I absolutely loved so much, it became my preferred pot for most uses. I bought this set as a gift for my son and love the welded handles, which eliminates the issue of handles that become loose and need constant adjusting. The set cooks and heats food evenly and the pots are incredibly easy to clean - just put them in the sink (even if still hot), add some soap and soak for a few minutes and they wipe clean - even stuck on food! I highly recommend them!",
        "I was so excited to receive my cookware from Cuisinart. The first set I've owned in more than 30 years! When i opened the box, I saw that the cookware looked exactly as pictured online. I am very pleased, except for one thing. The inside of one of the lids has a lot of small brown spots on it after using it to cover a pot that I boiled potatoes in. This did not happen to any of the other pot lids that I boiled food in so I don't know why this happened. The warranty is for a lifetime, however the warranty does not cover spots that come on the cookware after using.",
        "I love these pots, they take a beating and are super easy to clean. We have learned techniques for how to cook a couple more tricky foods in Stainless Steel as this is our first set, but I love them. Sometimes you can see spots after cleaning, the booklet has instructions to clean these types of spots and it worked! They came out like brand new and it was VERY easy. They are heavy and great quality and come with a lifetime guarantee from Cuisinart. I love them and would definitely recommend.",
        "After only 2 or 3 uses the finish started to come off--this was after boiling water and making oatmeal or rice in a pot. The frying pans can only be heated to about medium heat or they are impossible to clean, so you can't sear anything in them. We had this set less than two weeks and had all these problems. We returned the set. Why there are any good reviews is a mystery to me. I do not recommend this product if you like to cook.",
        "Absolutely horrible pans! We got these pans on a recommendation because we wanted to stay away from the harmful chemicals in non stick pans. These pans are the worst! Everything sticks to them no matter how much oil you put in them. They are also really hard to clean. I have to leave them soaking hours and sometimes overnight just to be able to scrape everything off that has stuck to them. These pans are horrible! They are pretty to look at but not good to use.",
        "We cook every day & have been using the ‘non-stick’ cookware which always ends up badly scratched/deteriorated. Decided to go just stainless steel & I LOVE these pots: 1st: not too many, just a few & in most useful sizes; 2nd: must follow directions regarding level of heat you use as the heat conduction is amazing (truly, never use high heat except bringing water to boil); 3rd: they have never been a problem to clean....& they can go in the dishwasher! Perfect!",
        "I love cooking now! Old cookware was nonstick and mostly scratched, losing bits of toxic stuff in my food. I have found, after 20 years of nonstick pots and skillets, you can cook with stainless steel and not have a problem with food sticking and pans being hard to clean. I love this set. It has everything I need. It comes packed very well. You can use these pans as a mirror if you need to.",
        "I have been using this set for almost 10 years. My only complaint is that one of the pans split in two places. When it was just a split in the side, I ignored it, but now the bottom has split as well. The rest of the pans have no issues so I’m guessing some sort of defect. Positives - easy to clean, look great even after 10 years- and do a great job with everything I cook.",
        "Both pots and pan deform or warp over time along with mention of the aluminum bases separating from rest of the pan. This is a manufacturing defect not a shock from putting a hot pan in cool water; I know how to care for my cookware. I prefer cast iron and stainless steel over all else, but will buy in the future a one piece unit or go enameled cast iron in future. In my opinion this is a waste of money in long term.",
        "Bought for daughter at college. I've had and loved my set for years, so purchased for her. They clean up well, and can look marvelous if you take the time to really scrub the outside every few months with Bar Keepers Friend and a scrubby.",
        "I bought this set to replace a very heavy set. As I age I don't have the strength to lift heavy pans, especially full of food. These are a reasonable weight and sturdy. I like them. I use SOS pads to clean the frying pan and it works beautifully.",
        "I am disappointed in these pots and pans. I guess I didn't do my research but these are non-stick pans. Everything sticks and you really have to scrub to get them good to get them clean. Everything that shines is not pretty.",
        "Follow the instructions. No need to turn dial to 'high' to get it to sear or boil... which was a hard habit to break. Able to pick up handle and lid without pot holders. Able to clean with just soap and water - through I had to let it soak a few minutes a couple of times. Very good investment.",
        "The 10\" saucepan leaks where the handle is attached. Also, I thought that I was purchasing the same set that I had purchased previously as was indicated in my purchase history. This set was not the same. It isn't as heavy and obviously not as well made.",
        "I bought these after reading all of the great reviews. I however have been disappointed with them. I've had them for several years now and continue to have problems with food sticking to it. I had Revere ware prior and loved it...wish it was still available. The large pot is WAY too big unless you're cooking for a huge crowd, but just to cook some spaghetti, it takes too long to heat up water in. I purchased a couple non-stick pans and use them much more - although trying to go with the \"healthiest\" option?!? When I do order a replacement, it won't be this set.",
        "Bought many years ago, my first stainless set. Went cheap to learn to use stainless. There still in great shape although I believe that the rivets inside hold soap? Too often a clean pot full if water on the stove turns soapy.",
        "I purchased this cookcare set after searching for a stainless steel set to replace my teflon-coated pots and pans. The chemicals given off by traditional teflon was a no-no for the little ones in the household. As promised, this set is fully stainless-steel. No teflon, no non-stick coatings, no chemicals added to coat the cooking surface. This does result in some changes to my cooking: need to be patient and wait for pans to warm up, need to cook at a slightly less intense heat level, and often add a bit more fat to avoid quick burns. Very satisfied overall. The quality is superb, the pots and pans are durable and well made, but overwhelmingly heavy like some sets.",
        "These are really fantastic. My first attempt at buying decent, non-Target cookware and I enjoy them. I still have a a small non-stick pan to cook all of my eggs and a non-stick griddle for pancakes, because I still haven't found a way to keep them from sticking on one of these. (If you know of a way, feel free to comment on this review because the fact that I can't makes me feel like an idiot.) Other than that, these are great. Sometimes if I overcook or burn something it leaves a mark on the pan, but another review suggested using Bar Keepers Friend to remove the stains and that works just great.",
        "These are great pans. Ive had them a few years now. I love the solid tops. Very sturdy and good heat distribution. Still happy with my purchase.",
        "First Cuisinart purchase. Have always heard Cuisinart associated with quality and value...and so far, I have found this to be true.",
        "I'm so pleased with this set. It is study without being too heavy to handle. The shape of the handles works well for moving pans off the stove and into the oven. And, the lids fit well. Clean-up is easy. Follow the short instructions that come with the set. Very simply, soak and scrub a little - no different than any other pan I have used in the past. I did buy Barkeepers Friend to help keep my set shiny, but it's not necessary. I also found that soaking in diluted vinegar helps with some of the discoloration that can occur. I am extremely pleased with my set.",
        "I had revere ware for 30+ years and gave them away when I moved to Cambodia. When I came back I wanted a new set and found these and liked the reviews. The folks who cannot get these clean or cannot figure out how to cook with them should stick to your microwave and frozen pre made food. These are true cookware for folks that know how to cook. The barkeepers friend does a great job of keeping them clean and looking new. They will be with me for many years to come.",
        "Love Cuisinart products. Love that they can go from stove top to oven. I bake bread in the stock pot, casseroles in the sauce pans, and more. Clean inside with Bar Keepers Friend or a little bit of Comet.",
        "So disappointed after reading all the great reviews. Discoloration after being used only twice. They should be charging half the price for this crap.",
        "As soon as i can i am buying something different. do not like the way these cook. you have to be very careful when cooking, things burn very easily. Never in the 39 years of my married life have i had so much trouble cooking a meal.",
        "This cookware set is the best set I have ever owned. I read a lot of reviews on here about them. They do not stick. I cook at all temperatures with them and have no sticking issues. I soak them immediately in the sink with a little dish liquid as recommended and have no problems. In fact they clean up so easily that I just use my dish wand and clean them in a minute. They are just as beautiful and shiny after having them for several weeks as when I first bought them. You will love them.",
        "So far no problem putting in dishwasher, the bottom of last different brand separated from pots.",
        "I bought these for my wife for Christmas less than 6 months ago. I thought they were a tremendous deal at the time. However after spending time using these pots and pans we both thoroughly dislike them! We heat them and cook at medium heat per the instructions and we properly oil or butter our pans when using, to no avail. We have to use sponges to clean them because anything else will scratch the surfaces. We found that Barkeeper's Friend works well, but I don't feel that I should be having this sort of issue with these pans.",
        "I have been searching for a good set of cookware to use on my smooth top range and found this set. It's a pleasure to cook with; the encapsulated bottoms on the pans are an excellent heat conductor and the weight of the pans is comfortable-not too heavy. After using the set for about a month I purchased an identical set for my daughter for Christmas since she has been admiring mine. The lids included can also be used on both of the skillets, which I have found very useful. The pans clean up beautifully without scrubbing if you follow the cleaning instructions included in the box.",
        "I recommend also buying some Cuisinart non-stick to pair with this. They are the same size so the lids can be used on both. But this is a very nice set. Very thick and high quality. I use this for normal day to day cooking. But when it comes to things like eggs or anything that may stick easily, I switch over to their non-stick ones.",
        "Pans are wonderful, they clean easily and evenly cooks ! I would buy these again, but I expect I wont need to buy new pans for a long time since they seem to be a great quality.",
        "After 15 years, I needed new cookware because I had one pot remaining from my first set. I came to Amazon, checked out prices and reviews, and decided upon this CuisinArt set. I have used all of the pots, but none of the skillets at this time. I love the post. The pots with the long handles do not get hot when you use them. The stockpot's handles, unfortunately, do get hot. I have also not experienced the lids getting hot, and this pleases me. For the price, this is quality cookware. I am extremely happy with my purchase.",
        "I can't believe I considered the All-Clad set for five times as much money! I love this set, it is as easy to clean as my non-stick Calphalon pans and you can really scrub at them if need be since you won't scratch off the finish. I am completely satisfied. I saw this set on clearance at BedBathBeyond for twenty bucks more than Amazon has it for- that made my day:) If you want to keep the set looking sparkling new then you will have to spend extra time shining/buffing them, but they do fine in the dishwasher for me.",
        "I was expecting something different. I think they are not worth the price. They look great at first but everything stick way too much.",
        "Service and delivery from company was excellent; very fast and professional! The cookware itself is very nice looking coming out of the box, and does do its job correctly as far as heating up the food in it. I only mark it down because it does not clean up well at all. One use, and you can tell the set has been used. Maybe I'm not cleaning it right (kitchen sponge and dishsoap)? Beware: this is not non-stick cookware! I would rate this set as great for a starter set for someone setting up a new home/apartment, but if you LOVE to cook, this is not the set for you.",
        "I have tried a large range of cooking ware, including a single stainless steel pan that cost $80, and various \"ceramic\" and \"green technology\" type frying pans. So far this is the best set of pots and pans that I have ever used. I am a lazy cleaner, but I have found that if I soak the pan, and then use hot water and soap, I am able to clean the surface back to a mirror finish with just a hard-medium brush. Really quite easy and excellent!",
        "The best thing about these pans is being able to return them. First thing I did was wash them and start boiling water and already the inside bottom of the pan started getting weird marks like the pan was chipping or burning? Pretty pathetic pans... glad I could return them, don't waste your time!",
        "This is a five star purchase for this price point, and would remain a five star purchase even at twice the cost. Excellent set for the cost. Unless you are a professional chef with outrageous expectations, this looks and cooks fabulously. Heat the pans prior to adding anything, and they will release the food perfectly. Easy to clean, especially if you use some Barkeeper's Friend. This set looks like a luxury purchase and cooks like a dream.",
        "I always wanted to buy Viking cookware but i couldn't afford it. So, i was looking for the next best thing and bought Cuisinart after reading a ton of reviews. I am very happy with it. Looks great and works great. However, it may be that my water is not clean enough when i wash it either by hand or using my dishwasher it kinda discolors the interior. Especially if i hand wash, i see some kinda purplish colors on the interior of my saute pan and frying pans. I need to do some research on how to fix that. Other than that, i just love it.",
        "They are nice and heavy. We have had them for about 6 months and we cook every night. If you fill them with hot water and let them sit for 5 minutes, they wipe right out without scrubbing. They still look brand new! They are a beautiful addition to my kitchen and I have thought of ways to hang them off the walls, both as art and something I use.",
        "This has been my daily cookware for over 7 years and I couldn’t be happier. The set shows no wear despite daily use — nothing is loose or dented or discolored. I absolutely love the drip free rims — I didn’t know such a thing was possible. They are indeed drip free. The handles always stay cool.",
        "So Beautiful!! Shiny and bright!! They replace a big conglomeration of assorted pots and pans that just wore out over the years!! These are so pretty and useful! Love them!!",
        "I was looking for a stainless cookware set that was good quality and looked nice without the \"professional\" price. Settled on this and very pleased with the purchase. Really enjoy cooking with this set. Bar Keepers Friend works great for keeping it looking like new.",
        "I have cooked in so many different stainless steel pans, but never experienced so many discoloring like with this set. They do their job, but I spend more time cleaning them than cooking with them. I wouldn't recommend this set, for not so much money you can get better quality, even with this same brand. Also I was expecting a more solid-fancy looking set and I was disapointed, they are not as solid and strong as they look in the picture. I misread the part of the steel lids, I wanted glass lids, be sure you notice this.",
        "Typical outstanding Cuisinart product. Very well made and should last a long time with proper care. I recommend using Bon Ami to clean them as it is least abbrasive and cleans very well. The slight discoloration that occurs on the bottom cladding of the pans is perfecttly normal and doesn't effect the performance of the pans in any way. The discoloration is very minimal. They are well balanced and easy to handle and cook superbly.",
        "This set came all ok but one of then came with scratches and some other things inside including a sound like something has broken inside the cookware specifically the piece of 2,8L. I would like to replace this piece as part of the guarantee I don’t know if this possible. I really like the set but came with these faulty.",
        "Built to last. Great on the stovetop. Just take care of the stainless steel and you should enjoy these for years to come.",
        "I'm used to using an old copper bottomed revereware pot that was a hand me down. I thought this set would be a big step up! The conductivity is far worse. The heat needs to be up much higher, and it still takes much longer to heat up. Cleaning is more difficult, too, though I'm not sure why. My old set is beaten up and scratched, and yet it functions better than this set. I can't return the new set because I've used it, but I am sorry that I bought it. Cheryl",
        "an excellent value. I didn't want to get non-stick because I don't have a dishwasher, and I'm pretty rough on my dishes when I wash them by hand. that being said, these pots and pans are solid. for anyone who isn't a professional chef, these will do just fine for most cooking purposes. I use them everyday and they have performed beautifully so far. as the manufacturer says, don't use excessively high heat. short of that, they'll take anything you throw at them.",
        "I have had many cookware sets over the years, and none of them have lasted well. I have always gone with Teflon, since I am not a super chef or even a great cook. But this cookware is so wonderful, it makes me want to cook! It cooks evenly, and works well on my glass top stove. It cleans brilliantly, just follow the directions that come with it. I have had them a month, and they still look great! They are dishwasher safe, but I just hand wash them because it's so easy. I think these will last a long time. Don't use metal utensils or they will scratch. Love 'em!",
        "durable set of pots and pans --- when cooking the first time with the saucepans/stockpot, they tended to form spots on the inside only, which resemble stains or rust, but this seems to not have gotten worse, so perhaps it is not so serious",
        "Wow... whatta deal! Super fast shipping & a great product. Im only sorry I didn't order the 14 piece set now. Cuisinart has succeeded in giving us a quality, durable & gorgeous set of pots/pans for a good price. Use as a starter set & add pots/pans as needed (Ill be ordering the matching teakettle soon.) And yes, stainless cookware does require some extra care, but if it makes these beautiful pots/pans last for 10 yrs or more, isnt it worth it? I will be recommending this Cuisinart set to my family & friends, thanx Amazon.",
        "I thought I was ready to switch from non-stick to stainless steel pans after reading all of these reviews. The cookware set was beautiful and I was excited to try it. Unfortunately the first dish I cooked was eggs & hashbrowns and even though I followed all of the suggestions (warm the pan, add some oil, etc..) I found it very difficult to cook. Everything stuck to the bottom and it was very difficult to clean- even though I followed the directions and soaked it right away. Also, I think people should know the directions suggest using wooden or plastic utensils- NOT STAINLESS STEEL to avoid scratches. I am going to sell this set and go back to my non-stick.",
        "I am satisfied overall with my new cookware. This was my first time buying stainless steel instead of non stick. I don't like the little \"rainbow\" colored markings left after washing them, but they actually are easily removed with a little warm vinegar. Once, I figured that out, I kind of stopped worrying so much. Who really wants to clean their cookware with vinegar after cleaning with soap and water. Seems a little much.",
        "I've had this set since 2010 and it is going strong with heavy dailyuse. No pits, stains, dents, or other indications of failure. Best investment I ever made! A great starter set and very easy to supplement with open stock pieces!",
        "Well, I just received my set and I am surprised at how solid they are. I have several big Farberware stainless steel pots that I got from my mom, so when I decided to expand my set I did EXTENSIVE research on all brands. The Cuisinart seemed to have more pros than most. I haven't used them yet-they are really too pretty to use lol! I will update after Christmas dinner. Did receive in record time!",
        "I read reviews & talked to friends before buying this set. They are gorgeous pans, that is until you actually use them. I heated slowly, used low heat & cleaned by hand. After 1 use the pan is stained & pitted. I want pans that wil last & decided to return them quickly. Amazon is great with the return. I may try the Caphalon set my husband wanted. Don't waste your time or money with this set.",
        "great pans!!!!!!! I followed the instructions that came with the pans about cooking on med heat they came clean very easy",
        "I love these pots and pans! I have owned my cuisinart for over 33 years , they still look and cook amazing! I decided to buy both of my children this set, now that they live on there own. I consider them to be best value. The copper bottom makes them great heat conductors. Easy in the dishwasher, they clean right up! Highly recommend, cuisinart offers different set combos or buy individually.",
        "We decided to step up our cooking skills and needed oven safe cookware. These have done the trick. Note: Read the care and use instructions. These do not work like non-stick pans. We used to cook on High, but with these we cook on Medium. When things stick to these pans they really stick. Put them back on the stove and boil soapy water in them.",
        "Great set! I am so glad I threw out all of my toxic non-stick pans and bought these. You need to learn how to cook a bit differently with your heat when using these. They seem to get much hotter than non-stick, but once I figured this out it was just as easy to cook with these. I just use extra oil spray or butter. I LOVE THEM.",
        "These are great looking, easy clean pans. Only regret is that the lid handles get very hot with high heat cooking so one must use potholders when removing lids...but the pot handles themselves always stay cool as promised, which is a great comfort when cooking. I'm very pleased with this set as it had several size pots to handle any meal and the exceptional good looks of them almost eliminate needing to use other \"serving dishes\" for casual dining with guests...we serve right off the stovetop with pride. The price of the set was actually quite low compared to other sets I had compared, so that makes it even better! I definitely recommend this set.",
        "I chose this particular set because I like the stainless steel lids over the glass ones. They are very sturdy and easy to clean. I really love the large deep skillet. I've never had a versatile skillet like this one before. This set replaces a Revere set that's been in use for 25 years I am looking to get 10- 20 years out of these pots and pans.",
        "Few years after buying this set, I am very disappointed by the poor quality of these pans. Some becoming yellowish over time because of the heat, and one even splitted while preparing soup... I will definitely avoid this brand in the future.",
        "Very nice set of cookware. Definitely recommend if your looking to upgrade what your cooking with.",
        "I wanted a basic uncoated good quality stainless steel cookware set - and I got it at a great price. Cuisinart has a good name in the cookware industry, so I know I got something of good quality, and the price was that you might spend at your local Walmart for some generic non-stick pots and pans. I was also happy because I felt I got a decent amount of pots and pans, and that the size of the cookware wasn't skimped on.",
        "These Cuisnart pots are rather disappointing. The material is light weight. Food burns easily as the pots and pans do not distribute heat evenly. If you bought this cookware and expect it to last for many years, as certain other brands, think again. I would be surprised if I got even five years out of them before they need bo be replaced.",
        "Wonderful and a great savings. Heat very well, and cook quickly & evenly on a gas stove. They are also beautiful, and the handles resist heat. Very pleased; had originally bought them for a girft, but kept for myself as the gift had already been purchased by another person (but they were not these pans and no where near as nice). I saved $300.00 off the original price!!",
        "I finally bought these so I could have grown-up pans and pots. Super easy to clean, cooking is easier and more predictable because things cook evenly, and they look pretty hanging in my kitchen. I was finally able to get rid of the random teflon stuff I'd gotten in college.",
        "It's probably the best cookware you'll find at this price range. I have used these for many months now and they have been durable, reliable, they transfer heat well and evenly. I have no complaints about them and glad I invested a little more money for nice quality.",
        "I was pleasantly suprised at the quality & good, heavy weight of the pots & pans in this set for the price I paid. I would highly recommend this product to others. I was so impressed that I ordered other Cuisinart Chef's Classics pieces to add to to my collection from Amazon. I have done price comparisons for this product from home shopping channels & department stores and Amazon beats them all for the best deal!",
        "These are beautiful pans/pots. They work very well and are very high quality! Love the fact that I finally have some stainless steel pans, insead of the teflon non-stick ones that have been discovered to leave harmful, damaging chemicals in your food!Get the stainless!!! Make sure you follow the cleaning instructions and your pans will stay bright and beautiful!",
        "the handles were too heavy on my walmart brand of pots. i love how everything evenly cooks now. I feel like a pro when I take the pots from the stove to the oven. I think these pots will encourage me to try different styles of cooking and become more creative in the kitchen.",
        "I am a bit worried....I just got my set today and immediately washed and dried them....I used two of the pans to make dinner, one to boil potatoes, and one to fry up some mushrooms...when I went to wash the pans I noticed in the one I boiled potatoes in has some black marks that looks like it pitted even tho I can't feel any roughness. I just wondered if anyone else has had a similar experience. I know the set was very inexpensive but I only boiled potatoes....tomorrow I am going to call Cuisinart and see what they say...",
        "My wife and I really enjoyed this 10 piece cookware. We didnt need anymore than the 10 pieces because we dont do anything to fancy. It cooks well and it cleans really well. We have no complains.",
        "The weight of the pan are just right (not too heavy, not too light), the pots are big enough to cook a whole chicken for a chicken soup + 6 carrot and 2 large onion. All of them are oven safe. I could have said \"I like it\" aka 4 stars. but lets be honest, for the price I don't think I could have found a better deal.",
        "We just love this cookware. We had to replace ours when we moved and our original had seemed to have gotten missed placed. We searched for about a week and decided upon this set. It seemed to be reasonably price for a decent product. They are fabulous to use, easy to wash and look so shiny! We love them...",
        "I purchased these pots in September. I tried to be very careful, cooked on low heat, washed by hand. Nonetheless, the pots burn and stain very easily. After just a couple of uses they looked like old, worn pots, with burn and stains that I cannot get out. I am very, very disappointed with them. I have been pleased with other Cuisinart products, so I am especially disappointed about these.",
        "This is the first set of stainless steel I've owned. They are way better than non-stick. I feel like my food is so much cleaner since it doesn't have the possibility of teflon pieces in it. I have not had any problems with food sticking, but I still use a non-stick for eggs. These pans will boil water on medium heat in about 10 minutes. The only downside is that they get horrible water spots on them if you don't dry them right away. They also get some spotting on the inside from food, but I would tend to think that's normal. Overall, they are a very nice set and I would recommend them.",
        "I've become a stainless lover after purchasing this set!!! There's a learning curve but id never go back to anything else! This set came with a lot and everything is nice and heavy quality!",
        "Read the instructions and follow carefully. They will burn your food if placed them in high fire. The food sticks to them and it's almost impossible to get it out. Better invest a bit more for higher quality set.",
        "Love me this set and love me this set with some Barkeeper's Friend and Coca-Cola when I space out and burn something to the bottoms of them (used to nonstick before these bad-boys). I'd recommend them a thousand times over.",
        "I like my new pans. I have had them for a while now and they work pretty good. I wish that at least one of the large lids were glass so that I can see when my sauces and broths are done with out having to loose my heat from opening the lid. Sometimes there are little spots on the inside of the pans after I let them dry but I was able to remove them with a little white vinegar.",
        "This product is exceptional for the price. It received great reviews on consumer reports before I bought it and is less than half of the price of some of the other brands. It is a very sturdy, nice looking mirror finish stainless steel 18/10. I have had no problems cooking on it and things sticking, it is easy to clean with hot water right after cooking. It is, however; hard to keep highly polished unless you dry it so there are no water spots. Scrambled eggs were no problem, fried eggs are more challenging. I would highly recommend this product, save your money and buy Cuisinart over the other pricey brands.",
        "Don't expect professional quality but it works well for everyday stuff. IMHO, I think the price could be less and I do wish I had seen them in person first. Had that happened, I would have reconsidered looking at other sets since the price was a bit much for the quality.",
        "Got a good price on the ten piece set recently - but I was unaware of the eleven piece set, which I believe includes the extremely important steamer basket... so a little mad at myself for not being more aware. Not even a hint of magnetic attraction, so no good for conduction cooking. Handles feel good and I like the light weight.",
        "I have had this set of pots and pans now for 2 years and I love them. About a year ago I added the 12 quart stockpot to my set and now will be ordering a 12\" skillet in the near future. I keep my set hanging on a rack so they don't get scratched and it is an attractive addition to my kitchen. Even though my family is grown I still do a lot of cooking. I do not put mine in the dishwasher even though the information states they are dishwasher safe. Right after cooking, I put hot soapy water in them and put the lid on, which makes them easy to clean. Great set!",
        "These pans are wonderful. I no longer have to worry about scratching a non-stick coating, which recent studies show cause for concern. Plus they always look nice. Cooking with them is wonderful also. It takes some getting used to in terms of gauging the temperature so you don't get the pans too hot and cause burning, but once you get the feel these pans cook beautifully! Foods cook evenly and quickly. I am now going to look for a bigger frying pan to replace the old non-stick skillet.",
        "I bought this several yrs ago and they are still shiny and cooks really well. Just don't use the glass top stove on high to prevent warping. This is in the directions of use and I followed it and they have not warped. Love the weight of them.",
        "I bought the set to replace a very old set of pots and pans that i had been using for years. I had never had stainless steel cookeware before so it took a little getting used to but after i learned the tricks of cooking with stainless steel its all good. I can cook anything in these and clean up is very easy! Love them!",
        "We had been on the fence about these for a little while and finally got them (during the sales around the holidays). Why use non-stick pans with chemicals? A little cooking spray and these are fine. Anyway, we know these will last us... probably won't have to buy any other pots and pans (we have a larger stockpot and larger sautee pan that we bought separately and enjoy those as well). Well worth it.",
        "I purchased this set in 2010 and LOVE it! On the average, I use some of the pots and pans about 4 times a week. The handles are still tight, never loose, still looks like new and does the job!. Love this set, would but it again but I think this set will last forever!",
        "My wife had cooked with her old cookware for over 20 years and the bottoms of the pans had become warped. I researched new stainless cookware which was affordable. The Cuisinart set received great reviews and was priced very well. She has been very happy with this cookware. The pots and skillets heat very quickly and evenly. Very low heat must be used in the skillets in order to prevent sticking. It would be nice if the set came with another pan and one less skillet. All in all, this is a great set of cookware, especially for the price.",
        "Just coming up on 4 years of use and they still look great! Very happy.",
        "PROS: stainless steel so I suppose minimal chemical reaction compare to non-stick, not too heavy CONS: non-transparent lids, high heat transfer, must cook at low tempratures which lengthens cooking time not too heavy, not to light. this is my first \"stick\" cookware and I must say that I am not disappointed. It would not stick if you cook with moderate to low temperature. slight outside discoloration after few uses which does not bother me. This is replacing my Calphalan cookware as the non-stick turned slightly brown and looked weird after about a year of use. I kept the Calphalan lids though because they are glass which is definitely better than metal top lids of this Cuisinart set.",
        "This is a great set of cooking-ware. They clean easy and retain their luster. The rims on the pots and pans will dent somewhat easily but as long as your not running a restaurant you'll be OK.",
        "Love this set of pans ! I ordered a set for my granddaughter when she graduated from college and she loves them too. No concern about aluminum or peeling Teflon. Clean easily. An SOS pad will remove a more stubborn stain",
        "These pans are gorgeous. And sold at a great price!",
        "This was a wonderful gift, they love the set. I wish the price was a little lower though, I bought a different brand much cheaper, same look, functions the same so far ( almost 1 year of use)"
    ]
}