{
    "entity": "Cookware Sets",
    "text": [
        "Purchased this product in 2015 and now in 2018 we've tossed all of the pots and pans in the trash. In the beginning these were great, non-stick, easy to clean, etc. But after a couple of years the non-stick coating on the handle rivets started peeling away and we all know where it most like ended up. In our food. And soon after, the coating on the pots/pans themselves started peeling away. If you're looking for something that will last a long time, this isn't what you're looking for. We've gone back to all stainless steel cookware because there's nothing that is non-stick out there that is guaranteed not to chip or peel after a few years of use.",
        "All of the pots and pans are failing: the non-stick coating is pealing off. It's happening consistently. We're not heavy cookers, we eat out most of the time. We are a small family. The pots are washed in an ordinary dishwasher. I've heard that non-stick coatings are toxic, although I don't know if that is the case with T-Fal. But we are stopping using the set, just to be safe. It is disappointing for pots and pans to last only a year. They would otherwise be nice.",
        "Very impressed with T-fal quality and a assortment of pans and pots. I picked these pans for the quality and was not as focused on price. For us, this was just the right combination of cookware as the other T-fal sets seemed to have items we would not use. I use to cook food that I do not want to glaze, although when cooking pork and morning sausage, it does sear them enough to allow for creating a sauce. Still surprised at the price point though. Very inexpensive for what you get.",
        "I purchased this set in May 2017 but the cheapest T-FAL I OWN hasn't failed like this set. They appear as tiny white spots after a few months then progress to the non-stick failing!! Can't believe it!!! I have an entire set of these plus other extra pieces purchased at Amazon and Target. I have been faithfully hand washing the pots and pans, and adhering to no salt until the water was boiling. Now I can't even give them away , I don't want to be responsible for poisoning other people... SHAME ON T-FAL!!!!",
        "I've had this set for 4 years now. I'm satisfied as far as cooking with them goes, but they easily scratch on the outside and get nicks in them so that they show against the black. I have used felt cookware storage separators between them ever since I saw the first nick. Why can't T-fal make their products durable on the outside, too? Disappointed.",
        "The T-fal pots and pans are holding up well, keeping that new look. We use only non-metallic spatulas and cleaning materials when cooking or cleaning them. The nonstick surface, after a couple of months is still perfectly intact. The rubberized handles are excellent and all the pots/pans are well balanced to sit flat. So far they have been well worth the price paid and we have been giving them a good workout. Would recommend this product to those who cook either ocassionally or regularly.",
        "1st way, I bought this set for $58 in 2017, and now its 149? It was worth 58 not 149. 2nd way, the inserts on these have gotten WAY thinner and cheaper that the original professional set that had a massive insert and was twice as think from 2000. Both work on induction ranges, but the original ones still heat better and are easier to clean after nearly 20 years. Wisgh they woulnd't have cheaped out on the materials. shame on them",
        "I really like the T-Fal cooking set I bought. The non-stick qualities are excellent and cleanup is very easy. They're honest enough to inform the buyer the pans should be seasoned with a little oil occasionally to keep the non-stick qualities in just purchased condition. The pots, pans and glass lids are all insulated so you can easily handle them while cooking. The description says you can use metal cooking utensils but I prefer not to test that feature and use the non-metal variety.",
        "We have used this set since June 2016. As of November 2017, the non-stick covering is wearing away and food sticks. I will be purchasing a new set of cookware, but a different brand. The set works well, though, on the induction stove. If you don't cook a lot, it may be okay for you.",
        "This is my second set of T-Fal; the older set had started flaking over the years and since they have improved the types of non-stick coatings I decided it was time for a new set. I am pleased with the purchase, although I do wish the larger skillet came with a lid. The lifetime warranty is impressive and I probably had it on the older set and didn’t realize. I haven’t used all of the pieces yet, but the ones I have used have been easy to clean, heat up quickly, and work as expected. Overall I am very pleased with this purchase.",
        "Really disappointed in this set. After less than six months I had to throw one pot away, as it was so worn and peeling that it was unsafe. I bought this specifically to use on an induction cooktop, for which it is supposed to be suited, and two of the pots don't work on it at all, for reasons that are entirely unclear. I do love the frying pans and uses them frequently, but I was not happy with the quality.",
        "Wonderful Pans! Easy to clean up, cooks food well and seems to be quite easy to maintain so far. Caution though: Pans and dishes MUST be seasoned properly as noted in booklet with them before use. And it's not reccamended to use teh dishwater as you'll have to re-season them and their non stick will wear out. Worth every penny and really cuts time cleaning dishes. Fear eggs, pasta sauce and such \"messy\" foods no more. a simple wiping with a wet dishcloth and detergent and rinse clean. no scrubbing required.",
        "I'm very pleased with this set of nonstick pots and pans. The grip on the handles is very good, and they are comfortable to handle. The pots and pans are weighty and do not feel flimsy. The nonstick coating appears thick. I was expecting a lesser quality for the price I paid, but was pleasantly surprised. This set is a better quality and price than what I was finding in the stores. My order arrived promptly.",
        "I've used these for a couple of months now, and have absolutely nothing negative to say about these pans. They are so much better than the other non-stick brand I used previously; it's amazing how easily they can be cleaned. The food doesn't stick at all and they seem to be good quality. I shopped around and the price on Amazon was good, too. Hope they will last me for a number of years.",
        "I bought the 12 inch skillet and it cooks great! So, I ordered the 10 piece set today because it just dropped down in price to $79.99 with my Amazon Prime membership! I was going to buy it last week when it was $100.... so happy I waited! I am having my new cooktop put in and this cookware is induction ready which will be perfect. You really cannot go wrong with that price......it really made my day! This cookware is heavy and so well made. I love this set so much and the price is wonderful so I purchased two more T -fal Professional 10 piece sets for family members for a Christmas gifts!",
        "Decent product for the price, but the smaller pots and pans do not work on my induction cooktop. Since that is why I bought this set, I am a bit let down. They may work if your induction has a smaller sweet spot than mine. They are magnetic. The product quality is consistent with the price. Since they are non-stick, be sure to avoid metal utensils.I have had previous good experience with this line of TFal, and if tested right, they should last some time.",
        "very nice cookware. they did not work with the first induction cooker i got but i think it was because there was a problem with the cook top... i have since gotten a new on that i paid more money for and it is working great with all my new cookware. the only thing i am a little disappointed with is that none of the glass covers fit on the frying-pans... i am going to write to them and see if they carry covers that fit the frying-pans. Steve",
        "After 6 months of use, the finish is coming off the inside.",
        "I have been buying specific professional pieces I.e. flat large pans with curved edges large saute pans large pot (not professional big difference) & small fry pan . All super!!! I am equally as happy with this set. I have traded my all clad VERY EXPENSIVE!!! & much TOUGHER TO USE. I am very happy with all of my t-fal professional cookware. I was reading reviews and learned about the the professional wok & ordered it immediately. I DON'T THINK You can do any better at any price. The low price is great bonus.",
        "These T-fal pots and pans work incredibly well on my electric stovetop. They are nicely made, sturdy and look very sleek. Although it states they are dishwasher safe, I haven't ran them through the dishwasher but only have hand washed them.",
        "Frying pans bottom are not flat, it's concave. Is it design like that so it will be flat after of many many uses? For a while, oil settle at the edge, non in the middle unless using a lot of oil. When frying eggs, it does not cook evenly. T-fal still has to develop flat bottom surface on their frying pans. However cleaning and washing them are easy.",
        "These are excellent and work nicely on my ceramic cooktop. I have used them daily for several months and they clean up easily. I have put them through the dishwasher and then show no signs of adverse wear. The only negative is there is not a covered saute pan and I didn't realize how much I needed one until I didn't have one. I bought the matching T-fal 5 Qt and am now quite happy.",
        "T-Fal is a great brand, I always buy this brand and I've been very happy with. But I got some upset with these ones. In a few weeks I could see scratch marks inside on it. It was supposed to be more resistant.",
        "The surface is so nice on these, that you can fry an egg without cooking spray, oil, or butter. I cook no higher than medium-high, use soft utensils, and clean with dish soap and a light sponge. Almost a year of use, and they are like new.",
        "I bought this set based on the recommendations of the show America's Test Kitchen but I am beginning to think they get paid for their endorsements of products because I don't think these pans are all that great. I like to cook and I find these pans difficult to clean.",
        "They say they are induction ready. We have a samsung induction cooktop. We bought this set to replace a Racheal Ray set we have had for 6 years, but was not non stick. Decided to break down and get these. For some reason, they do not work on our cooktop. The nonstick seems great and the reviews were mostly good, but we will be looking for a better product.",
        "Not bad for a cheap set of cookware. Easy to clean, just have to be careful not to use metal utensils at all. I've noticed the outside paint chipping on one of the pots along the rim, but since I paid about $5-10/pan and they're induction compatible, I'm fine with it and it's not going to touch my food at all.",
        "My children recently introduced me to these total nonstick pots and sauce pans and I can't believe how evenly they heat the food and how easy they are to clean. I appreciate the red spots in the middle of the skillets that tell you when they are hot enough. The glass tops with steam hole are also a plus. I love them!",
        "I hadn't bought new cookware for 20 years. I love the weight of this set as well as the size choices. I wanted glass lids and nonstick surfaces and I recently bought an induction cooktop. This cookware works great with both the induction cooktop and regular cooktop. I looked for T-fal because it was highly rated on Cook's Country (one of my very favorite cooking shows). Five stars!",
        "Excellent quality cookware. Nonstick coating is truly “nonstick”, at least for the 1st 100 uses. I also loved the sizes and shapes of all the items. A great collection.",
        "Gave these highly rated pans to my daughter and liked them so much that I am thinking of buying some for myself.",
        "I have used many pots and pans over the years. Expensive, mid-grade, infomercial, you name it! These are, bar none, the best bang for your buck. My Calphalon pans can't hold a candle to these. I saw a comparison demonstration on America's Test Kitchen. They give things a real test drive. These impressed me. Don't let the fact that they are inexpensive fool you. Even though they are offered at a great price, the quality is great too!",
        "My husband and I purchased additional set of magnetized pots and pans for new induction cooktop. All of them functioned properly except for smallest one. Luckily, T-fal is replacing it but it won’t match what we have. The nice thing is we do not have to return the original one and it is fine for our regular cooktop. A lesson to always register for the warranty.",
        "If you have an induction cooktop, you need these T-Fal pans. They work great with the cooktop and cleanup quickly and easily.",
        "I’ve never been a big “cook” guy until recently. Bought this set based on reviews and had no issues. 4 months later I tried to cook a couple eggs as normal in it and all of a sudden the place smelled like a burnt rat! The non stick part on the bottom seems to have come off, burnt and mixed with my food. Glad I wasn’t trying anything fancy and wasted ingredients but now I’m out a frying pan! I didn’t plan on needing a back up.",
        "I purchased these for my induction cooktop because they stated they were compatible with induction. THEY ARE NOT!!!!! They are not working on my induction cooktop. Money wasted......",
        "This is probably the lowest cost nonstick cooking pan set which works with induction. As other reviewers have noted, the pans are a bit on the small side, so we ordered a larger skillet and stockpot separately. I have some very expensive Demeyere pans which are obviously higher quality, but a single Demeyere skillet costs twice as much as this entire set, so I am not too concerned. The T-fal's \"work just fine\", though I wouldn't use them with delicate sauces.",
        "All of the cookware set, after a few washes in my dishwasher, are now covered with these white stains. They do not come off easy at all. I assume it has to do with hard water but no easy way to keep them clean. Anyone else have this problem and have a solution?",
        "I recently bougjt an induction sooking system and needed cookware to use on it. I thew away all of my old cookware. I love using this set. I have changed my diet and am cooking more often. These pans are a joy to use. Cook evenly .and quick and easy cleanup.",
        "Great pot n pan set! Down in the South (Louisiana), for our indoor cooking we use and trust \"Tried and True\" cast iron and Magnalite, but in our outdoor kitchen we bought this set to try and they are lite and cook well. Great for the $",
        "Pots nonstick peeled within week of using not quality of tfal I expected",
        "I'm very happy with every aspect of these pots: sturdiness, easy clean, heat distribution, price. I would recommend these.",
        "this set is incredible and lives up to all claims. non-stick, easy to clean, even heating, not too heavy and overall very easy to own and clean, and I abuse them each. America's test kitchen rated the frying pan but the whole set lives up to the review given.",
        "Best cookware I've ever owned. I've had this for a while now and still no scratches. They heat so evenly. The pans have indicators to let you know when they are hot enough to cook. They heat so well you don't need to use the high setting on burners. I have a ceramic stovetop and they work very well on it. They are completely non-stick, I just dip them in the soapy dishwater and wipe them right out, no matter what I've cooked in them.",
        "Love this cookware. It is great. I have a glass top stove. My other cookware slid all over the top. This cookware stays put, it is heavier and also made for glass tops ranges. It's cleans like a breeze. Small frying pan makes the best eggs. Love the fry pans let you know when it's hot.",
        "I am really happy with the pans except for the 5 quart Dutch oven—-it is only a 4 quart. I filled it with water to be certain because it seemed small to me. That isn’t big enough for soups,etc. so I ended up ordering a 6 quart separately. That is irritating!",
        "I bought this set as well as the larger frying pan and stock pot. I had first bought the small fry pan as a separate item many months ago and lover it so much I decided to get the entire set. Such a nice non-stick surface compared to TFal set I had for 10 years and was looking to replace. I like that it's dishwasher and oven safe, but I haven't really tested that out much yet - too worried I might damage it in spite of their claims",
        "I bought this set in hopes that it would work with my induction stove (Samsung NE599). Finding induction capable non-stick cookware sets is difficult. In the past I have been very happy with tfal sets. However this set did not work very well. The only pots that worked with my stove where the 8\" fry pan, and the 2/3Qt sauce pan. These only worked on my smallest hob. Everything else were not detected by my stove. It was work a shot, but this cookware set did not work out.",
        "I bought these for my mother to work with her new Max Burton 6200 induction cook top. They all work wonderfully with it except the smallest pot for some reason. I think it might not have enough metal to make it magnetic enough. Otherwise the set is perfect and wonderful to use as is without the induction cook top. Also the price is just right for this set!",
        "This is probably the best set of pots and pans I've ever owned. Easy to clean. Even burned on food comes off with a swish of a sponge. I have an induction stove/oven and they work perfectly. My only complaint, and it's not a big one, is the handles on the glass covers can get pretty warm. You may want to use a potholder.",
        "Good quality material and doesn't peel off. Works very well on induction, electric and gas stove tops. Love the non stick part and is very efficient at it. Easy to clean. Perfect sizes. Felt slightly overpriced but would definitely buy again.",
        "It is mentioned that it is metal scratch resistant. But it is not. I bought this Professional set assuming it might be of better quality than the cheaper T-fal products. waste of money for this price.",
        "I ordered this set after I found out that my smooth top stove in my new house needs stainless steel to cook correctly. It works really well and cooks food evenly, though I hate my cooktop stove!! This is my first time cooking on one and I do not like it all. Especially when I was using the wrong kind pots on it! But these pots and pans do the trick!",
        "Haven't used it as it's a gift for our cottage. I'm sure it will meet my expectations.",
        "I previously had an expensive set of anodized cookware, which I was disappointed in because food still stuck to it. However, nothing sticks to this cookware--noodles, rice, eggs all slide right out of this cookware with no sticking. This \"Professional\" series T-fal cookware also has a heavy aluminum bottom which distributes heat evenly. Love it!",
        "over the years i have tried many nonstick pans, to include green pans, todd english pans and most ceramic coated pans. and over time they all began to stick. the other teflon pans scratched way to easy. these pans are so nonstick nothing sticks. i like the fact i can use metal utensils in them if i want too. clean up is effortless .......... need i say more",
        "Owned T-fal pots and pans before liked them the first time. like them even better the secomd time. Always easy to clean, like the thermal spot, and these worked great on an induction range.",
        "Bought to use with our induction stove and they're great. Does need fry pan lids.",
        "Previous reviews stated that the small egg pan didn't work on their induction cooktops. I was OK with that, but when I tried the largest pan on my large burner and that didn't work, I had to send the set back. FYI: All pans except the egg pan worked on the smaller burners.",
        "The gift that keeps giving. I wish I would have bought these long ago. The manufacturing quality is top notch and they produce a nice even cooking heat. Purchased here for under 90$US. Received it with Prime shipping before I got hungry, : )",
        "Love. Love. Love this cookware. I formerly used Calphalon on my gas range and wouldn't trade it for anything else. Now that I have an induction range this T-fal cookware has performed wonderfully. Heavy weight which I like and the glass lids are what I prefer. I think this is a fantastic set of cookware at an affordable price.",
        "Dishwasher safe. My Fiance' and I love the heat indicator. A little heavy and the handles get a little hot,, Doesn't burn you, it just surprises you that's all. That is the only reason we are not giving it 5 stars. Love these pots and pans. Great price. Fast shipping. Well Packed.",
        "This a very nice set of cookware. We have a 10 inch skillet that we use on our induction burner, we like it so much we decided to purchase this set. We have not been disappointed.",
        "Great pots and pans. Very, very well packaged.. They work fabulously on my induction stove!! Very happy with them! And they look cool too!",
        "LIke others who have purchased this item, I am disapointed that the lids do not fit the two skillets. I have an older set of T-fal pans and all the lids fit all the pans and skillets. The old ones also fit the new ones I ordered. As I looked at the Excite pots and pans sets, it looks like all the lids fit all the pans. When one buys a better set it would seem to me that all the lids would be interchangeable.",
        "Very pleased with the cookware. I was surprised how substantial the construction is. I would give them five stars if the pots had lids designed (sized) so that they could double as lids for the fry pans. Overall I'm very satisfied.",
        "I have been buying T-fall for 20 years, rather than Calphalon. I have found then very durable. I used the same saucepan for 15 years almost every day and the non-stick coating still worked. I would recommend these to anybody who is looking for an everyday, durable, inexpensive pans.",
        "I bought this set because I have an induction cook top. I have always loved T-fal and this set is wonderful! It works great on the induction cook top and the price is so reasonable.",
        "We needed some new pans to work with our induction stove, and these are great. Heavy, good quality pots and pans.",
        "Got it to use on an induction stovetop. It works on induction. The nonstick is starting to come off where the handle bolts to the pan and it has only been a month. We've never used metal utensils. The rest of the nonstick still works great.",
        "Work fine and you can use with induction stovetop. Not much to say, T-fal is well known, these are well made and I am happy it works on my induction cooker. Great price, I think, and does the job. If you can afford better buy it, but for us budget conscious people, ie cheapskates, this is a deal.",
        "Nice pans. Supposed to be able to use on induction cook top one did not, it turned my cook to off and sent strange signals to the other burners",
        "I really can't say enough good about this set. It's super easy to clean and regulates temperature very well on our half induction cook top. I've yet to have anything stick to it or burn.",
        "These replaced some old non-stick pans. These are beautiful, not too heavy and all the pieces that I wanted.",
        "Works great with my induction stove! Using a NuWave induction stove with no problems at all. Easy clean up even after burning food on it!",
        "My introduction to induction cooking and find these to be all I need for stovetop cooking.",
        "This is a great set. I love it. I only have one complaint. The One Quart Sauce Pan would not work own my two induction cooktops. I would get the error sign every time on both cooktops, even though a magnet would stick to the bottom. That was the last item of the set that I tried to use and by then amazon said it was too late to return. All the other items in the set worked great. But I still Love this set. Buy it!!",
        "Very nice and most of them work on the Duxtop 9100 Induction cooktop. The smallest sauce pane does not so apparently the iron target in the bottom of the small pot is too small. I doubt I would ever use the small sauce pan so no loss. Everything else works fine. 5 decent pots for $85 is cheap.",
        "I had a set of T-fal for about 20 years and loved them. My husband has wanted to replace them for a while because we re-did our kitchen and he felt it was time! I resisted because I had not found a set that I thought I would like as much as our old set...and then we saw these. He convinced me to order them and we LOVE them!! So well made and a great price - I highly recommend these!!! They are awesome!",
        "Purchased for our new induction range and they work fantastic. Couldn't be happier, one of the least expensive solutions we found as well.",
        "T-Fal professional pans are the best inexpensive pans you can buy period. You will not be sorry if you buy this set; they just work so well. They come up to temperature so fast, they burn evenly and are very durable. Don't hesitate just add to cart!",
        "So far so good. Have only owned for a week so I can’t comment on durability but so easily to clean. Love them.",
        "Great cookware. Nonstick. Durable. Only drawback for an older person is they are pretty heavy. I gave some away for Christmas gifts to a young person.",
        "Non stick on 8 in only lasts a few years this is my 3rd one tired of replacing every 2-3 years for occasional eggs. pan still looks new but even with oil or butter eggs stick badly.",
        "The set is fine - good weight and good feel - but the small covered saucepan is too small to work all on the Ovente BG62B induction cook top, even through it is the online one recommended by Amazon.",
        "Just received the item and have used it three or four times. So far, it is as advertised and appears to be an outstanding purchase. Only time will tell if the non-stick coating holds up as expected. I plan to purchase more T-fal Professional pieces.",
        "Very pleased with this set. It performs as advertises and doesn't weigh a ton or require special hand-washing.",
        "High-Quality pots and pans at a great price. The heat temperature indicator is a bit silly as in general the pan is usually too hot by the time the indicator says it is hot. however, the thickness of the pan is nice for keeping a nice even heat, they won't ding or dent, and the Teflon is resistant to scratching. By far one of my bets amazon purchases.",
        "Probably the best kitchen set I have ever bought. I have four roommates and aside from a few minor scratches from people using metal where they shouldn't, this set has stood up remarkably well to wear and tear. I especially love that it's dishwasher-safe.",
        "Love this set. Would recommend it for those who cook very often. Am using the saucepan and the large soup pot for stir frying vegetables and rice too. Heavy duty set and I have to used two hands to lift up the pot sometimes.",
        "Bought these for my induction stove, it takes longer to cook in these pans unless you do it at a higher heat. They will work for now but I am looking for a replacement set.",
        "Very happy with this set the price was fantastic Only have had about a week but I do believe it will get 5 stars if all stays the course",
        "These are the best pots ever! My daughter burned some pot stickers in the fry pan and the pan wiped clean and no problem with damage. I like popping corn in the saucepans because they have a vent to let off the steam as it pops.",
        "I ended up with an induction cook top with no pans that would work with it. The only type I could find was T-fal Professional and I purchased these for about $30.00 less than I could buy from a local source. Also they work great.",
        "I bought my son a cheap set of pots and pans...but when I saw that 'cheap' really meant flimsy I told him to donate the set to Goodwill and use this T-fal set instead. He loves them - and so do I.",
        "Excellent! Would like the larger skillet and more lids that fit every thing. They do not stick, Still haven't discover how to use the red dot. If you cook a lot get a larger set. I am not the normal cook here but the nonstick feature is great.",
        "Great set of pots and pans! I have no issues with them so far. I mostly hand wash them to save the teflon but I have put some in the dishwasher and they did fine. Nice thick metal to maintain temperature but not too heavy. All around nice pots and pans :).",
        "I do love them. The non stick is very good. I only wish the glass tops fit the frying pans, they are for the pots and fit those well.",
        "Great pan but for some stupid reason there is a vent hole in all the lids. If you are trying to cook with less oil beware because these lids do not seal due to that stupid hole. What moron doesn't know what a lid is for and engineered the lid with a hole?",
        "Purchased these for our new induction cook top, they all work fine except the dutch oven, it does not heat well."
    ]
}