{
    "entity": "Mice",
    "text": [
        "I needed to replace my optical mouse 3000, so ordered this. Couldn't make it work with Windows 7. When I plugged it in, it found no driver. When I downloaded the driver from the Windows site, it wouldn't load because it said I had a newer version of the driver installed. Quite frustrated, as I use the magnify feature all the time.",
        "This was my 6th mouse of this type I have purchsed for 4 different computers. It has oulived some computers and is a very nice size fitting in the palm of the hand as it is a laptop mouse. This ;last purchase is to replace one destroyed by grand kids by them losing the battery cover and usb device.",
        "This mouse is of very good quality. The only reason I didn't give it 5 stars is because the range is very limited, but if you are using it with a laptop, then it shouldn't be a problem. The buttons are easy to push and the scroll wheel is very nice. The laser sensor works on a number of surfaces with no problem. Once the USB adapter is plugged in, the mouse is connected in seconds. Plus, the price is very good!",
        "They should have noted this in the description. This is NOT compatible with Windows 8. After finally reaching the seller, he confirmed this. Very disappointed because I have used this same mouse with Windows XP with no problems and I really miss having the magnifier feature now. The mouse works without the magnifier, but what good is that! I bought it for the magnifier feature.",
        "This mouse is not very comfortable to use. It was designed to be ambidextrous, and there lies its fault. It is not very comfortable to use for long stretches of time. Microsoft will do better if they would create a left handed mouse, to complement the right handed ones, instead of these ambidextrous ones.",
        "I just needed a new mouse for one that went south. I had another just like it and this one works just as well. Microsoft mice are MUCH more programmable than Logitech. I use them on desktops. Batteries last a long time, and it only takes one AA rather than 2 AAA's like some. It's a good buy.",
        "buttons are too hard to click and clicking the WHEEL is so stiff, it will destroy your finger within minutes. I bought for my laptop, but now I carry a MS intellimouse exporer 3.0 as it is the most functional mouse I have found. do not buy this.",
        "This is an excellent accessory for my laptop--not too big, not too small, but just right! The usb dongle is a bit of a distraction, but the reliability compared to the Bluetooth rodent makes it easy to forgive and forget. The magnification button is icing on this little cupcake.",
        "Was in need of a new mouse and after using the basic corded where the cord would be in the way, I thought I'd try a cordless with a reputable name. Was great to program as far as the set up, had good option functions, was smooth for navigating, but over time say a couple of weeks later, the thing would EAT through batteries, the scroll wheel became sticky and the clicks were unresponsive. Was good but not for long...only 2 months ?...sorry Microsoft.",
        "Purchased mouse without first handling it. It work very good, but is much smaller than average mouse so am having a bit of difficulty getting used to it. Other than its' size I am very satisfied with it.",
        "This is a good product. The magnifier is really cool but I dont really use it since I never needed to magnify anything on my computer screen. The mouse is simple and easy to use. No problems so far.",
        "I bought it because it suppose to allow me to selectively zoom in. The software didn't install and a download from MS also didn't work. I returned it.",
        "I've read all of the reviews here, and can agree with most of the complaints. My main problem the lack of precision in graphics programs, it's difficult to control. I tried uninstalling Intellipoint and that improved the situation somewhat. The magnifier is indeed almost impossible to turn off. The most frustrating aspect is the vertical scrolling. Even at the slowest setting, images fly by too fast to see (in some graphics programs, ACDSee for example). Other mice have a click/stop with the wheel, this does not, and that may be the real problem.",
        "This is a fantastic laser mouse: wireless, quick, magnifier, compact, fast movement (adjustable, of course), very long battery life, light, and simply a pleasure to use. I'm so impressed, I'm buying a third to use with my new notepad on order.",
        "This mouse has a zoom built in. My husband needs the zoom and few mouses have it. If you have limited vision this may help you, also.",
        "I love this mouse! It has the magnifying feature and it works great for my tired eyes when I need to see fine print. I'd buy it again and the seller was perfect. I would buy from him again!",
        "This is my second mouse like this. I love it for work. I don't get tangled in cords under my desk and it fits just right without cramping my hand.",
        "Overall rating: good. Shipped very quick. No complaints. PRO'S: Very good working mouse, excellent connectivity, works great simply by plugging into a Windows 7 pc, RECOMMENDED for a pc or mac user for ANY purpose OTHER than gaming. CON'S: This is NOT a mouse for gaming! The middle button rolls too smooth and when you scroll through any inventory it is very difficult to select your intended item.",
        "Bought this little gem of a mouse for my wife to use with her laptop. She loves it, and it works great. Love the magnify feature. Battery lifespan is also good.",
        "I ordered 4 of these for me and some of my co-workers and we think they are great. I am peson that lives a fast paced day and I love the quickness and accuracy of the functions. We have no problems with the range even if the USB is on the left, right or rear of the computer. I like being able to make small movements and have maximum screen movement. This is mouse is great. I have gone through 7 different mice and finally I have found a mouse that meets my needs.",
        "This is a small but not Minnie Mouse. Works very well, Linux picks it up (USB) and it works great. Windows requires drivers (provided) to use all of the features. The magnifier is one of the most useful features. Convenient for travelling. I bought another one so I can have a home and an office mouse that are identical.",
        "I love this mouse, just wish it were a tad larger to fit my hand. Precise, works under most surfaces, the receiver design is excelent.",
        "Moves easy and smooth. Can be turned off and on. Very portable and can carry anywhere my laptop goes. Perfect!",
        "The mouse works well; but, I find the \"buttons\" to be quite stiff. there's not much weight to the mouse, so sometimes the force required to press the stiff \"buttons\" will cause me to mouse away form whatever I was attempting to click on...other than that, the mouse is great :)",
        "The mouse is easy to use and just the right size for my hand. M",
        "3 trys by MS Support couldn't make it work on my Windows 7",
        "Excellent mouse for my laptop. Works great, easy to use . Convenient for travel or even for just desktop use",
        "They keep breaking whan they fall. I am going to get another type. That's about it. Nothing else to say.",
        "Would have been good to know that this product doesn't work with Windows 7 before ordering. Just sayin'.......It would seem like that would be worth mentioning since it is what people still have.",
        "Easy to install...easy to use.....comfortable in hand....rate it 88% got it 3 weeks now and still havent had any problems using it..sleek and very comfortable to use....good buy for your money....",
        "This seller sent me a non-working product and when I sent it back he said he didn't receive it. He did not refund my money. Ginny",
        "I bought this as a replacement to one that just broke on me. And, it was exactly what I ordered. Didn't have to wait too long either. It's perfect!",
        "Didn't work at all I had to send it back. Waiting for a new one to be sent back to me.",
        "This mouse is very functional, very precise, but the designer should have thought about another design.",
        "This mouse is just OK. You need VERY small hands to feel comfortable using it. The wireless feature is great.",
        "I BUY THIS MOUSE AND IN 20 DAYS STOP GIVE PROM. AND TWO DAYS MORE STOP WORKING , DO NOT LOST MONEY IN THIS IS .",
        "I'm a CAD jockey, which in laymen's terms, means I make computer-aided drawings. This was a backup mouse for my laptop, but it's barely adequate. If all you're doing is browsing the web, it's fine, albeit a bit small, and only 1/10th the functionality of my MacBook track pad. However, the scrolling is jumpy, and in AutoCAD, it's completely unusable for panning, zooming, and orbiting. The useless magnifying button isn't programmable, but that's not unusual for MS. I don't recommend this mouse, because you can get a better one for less $ that lacks a useless button. I must say it does feel comfortable, which is about the only thing MS seems capable of doing.",
        "this is a good travel device and well designed. the usb connector tucks almost flush into bottom of the mouse body and shuts down power to the mouse (1 AA bat). smooth control of pointer. nice, because i'm not a big fan of notebook touch pads. never met one i liked. software loaded without a hitch (xp tablet os). screen portion magnifier (off/on button, not in the way, is on left side) that follows the pointer works with precision if required. marginally useful. all in all i recommend it highly and i am not a big microsoft fan. only caveat is, have only used it for a few weeks, cannot comment on durability.",
        "I purchased this mouse over a week ago and I've already put it away for good. It doesn't work most of the time. It constantly is losing it's signal and even after repeated efforts to reinstall or get the usb plug and the mouse to recognize each other it won't work. I tried downloading new drivers and that didn't solve the problem. I've given up on these wireless mouses as I haven't found a single one that works properly or stays working for longer than a month. I'm going back to a wired mouse. I've bought even the most expensive high end wireless mice and non of them work right either. I'll stick with the wired from now on.",
        "I purchased the Microsofts wireless 6000 this June 06. I noticed right away the scrolling wheel was not rolling smoothly. I ignored it thinking I was overly sensitive being this was my first wireless mouse. Fast forward 4 months and the rubber grip separated from the wheel making it nearly impossible to use. I haven't notice any other complaints about the rubber grip so this just may be an isolated incident. However the mouse is a little on the small size for everyday use especially with pc games.",
        "This is the worst mouse I've ever bought! Returned it right after I received it! Problems: 1. Mouse Buttons feels too hard! You've to press hard and hold to make it work. (Design flaw, IMHO) 2. I hooked up the receiver to the usb port on my notebook and put the mouse on my keyboard space, which is below my notebook, on my computer table. Tha...Da.... The mouse didn't work. Placed the mouse next to the notebook and it worked. 3. Mouse feet height's unlevel! Too odd! Great things I've found out: 1. Light weight 2. Works on glossy surfaces too. Anyone experienced the same problems? Or is this is just an isolated manufacturer's defects case?",
        "From reading the other reviews, it appears as though I'm not the only one who is disappointed with the ergonomics of this mouse. While I have had it for a while, this issue became apparent only recently as I've begun to use it several hours a day. I've just placed an order for the old BX3-00008, and believe that it will better suite my needs. Also, I must say that I am forced to use a mouse pad on my desk (a shiny laminate-topped surface), because the mouse does not accurately register my movement without it.",
        "This mouse is riddled with problems. The pointer tracks erratically, the scroll wheel has no tactile feel and has a dead spot where it doesn't scroll at all. Batteries last less than a month, as indicated by the software popping up a notification balloon on the Windows taskbar. It frequently looses its wireless connection to the computer. Microsoft used to make a good mouse but this one is junk. I feel like a sucker for buying it. I won't buy anymore hardware from Microsoft. I'd let Microsoft stick to making software and get a Logitech mouse.",
        "I read some negative comments about this mouse but I still decided to give it a try. After I got it, I do find some tracking issue as claimed by some other people only when I change the cursor speed to very fast. When I use the default setting the mouse works greatly. pros: compact laser precision ergonomic design more buttons pretty good tracking cons: some tracking issues when speed is very fast more effort needed to click right button than my old MS 3000 mouse not all buttons customizable relative short receiver range(~1.5m) In all, I would say it is a pretty good mouse and worth buying",
        "I have owned this mouse for 2 weeks; so far no problems. After plugging it in, it takes 5 seconds for it to \"find\" itself, and after that it is fine. Maybe 1 out of the last 50 times I've used it, it loses its signal, and takes 5-10 seconds to \"find\" itself again. But this is rare.",
        "used this mouse for 3 months before changing it. waste of money. tracking isn't good. build quality is not up to expectation, no solid feel. I ditch this mouse for a Logitech VX Revolution. Logitech VX Revolution & Nano feels so much more solid that this mouse.",
        "This mouse has great features and software. However, it's made very cheap. The housing is very weak and the battery compartment keeps popping open on its own. Clicking does not always work. The buttons creak like you're bending them instead of getting a distinct click. Finally after having it for only 1 month the scroll wheel quit working. The cursor was also very erratic. You would think it would be better with a laser but it's actually worse. I finally had to stop using it completely out of frustration.",
        "I got this to supplement the touchpad and I am finding it much easier to use, at least for my clumsy fingers. The AA battery lasts a long time, even with all day use. A nice smaller size mouse for everyday use. Recommended!",
        "I read about these complaint about this mouse a lot, which almost make me not buying this terrific laser mouse. It is a wonderful mouse that works on every, EVERY surface I can think of, on carpet, on very shiny surface. The only surface it wouldn't work is on a glasses!!. which is obviousely normal. I don't see any problem with the thumb bottom, it works as a magnifier perfectly with out any problem. I think when they say they can't turn this magnifier off is because they hold it too long. Precision is incredible amazing, absolutely perfect for everyone. I love this mouse.",
        "I have only recently had a laptop of my own to use and first thing I missed having was a traditional mouse. My friend had one of these and I used his a few times first before buying one for myself. I works well and doesn't seem to need a special pad or anything like that to use it. I like the fact that the wireless usb part stores nicely with the mouse and is not likely to get lost in my moving around with the laptop from place to place. It installed on my winxp machine with ease needing no further drivers and it just seems to work really well. Ken L.",
        "I just received it today and immediately plugged it to my laptop. I'm on my bed and I've been working with it for a couple of hours and the mouse feels extremelly well. My hand is big but the mouse fits very well. The installation was very easy although you need to install the IntellPoint software in order to get all the features offered by the mouse. With basic drivers only the wheel and the middle button works. The horizontal and magnifier buttons doesn't work without the drivers. Great product.",
        "Yes I'm over 13 and I said \"clicky\" and \"rolly\". Only 4 stars because the rolly wheel is a little too sensitive and lacks the clicky sound/feel of the wheel as you roll it down a page for instance that my older MS wireless notebook mouse has. Anyhow I have no other complaints; I've been using one at work for a year with no problems.",
        "Bought this mouse for a new Thinkpad that was supposed to arrive already but was delayed in shipping. So, while waiting, I hooked it up to my IMAC. I am thrilled with this mouse. So much better than the mouse that came with my Mac. Very responsive and fun to use. No problem holding the signal and I love the responsiveness and the scroll wheel. Suppose I will have to buy another for the Thinkpad since I can't see giving this one up! A very excellent product that I can highly recommend.",
        "I agree with most of the posts here that state that the mouse is not ergonomically designed. It's hard to left-click even after I had adjusted the settings. After installing this wireless laser mouse, my screensaver would not work. I have Windows XP Media Center. I searched the microsoft support page and found a temporary fix that I have to do every time I want my screensaver to work. You would think Microsoft would have a permanent fix to this since it's their operating system and mouse. It is just typical of Microsoft. So, I'm returning this product! It was such a waste of time!",
        "This product deserves no stars. With the receiver in the USB port on the left side of my notebook computer, the mouse stops responding if I move it to the right side of the computer. That's less than 16 inches. I am restricted using it in an area in front of the laptop. Pretty dismal. I guess if I were left handed the mouse might be ok. But then the third button is on the wrong side of the mouse. For a right handed person the product might be useable if their laptop had usb ports on the right hand side.",
        "I live outside USA and for me was a very good opportunity to buy this Microsoft Notebook Laser Mouse for this price, who was very good. Here in Brazil the same mouse cost more than U$ 120,00. It took approximately 20 days to receive the product here in São Paulo (Brazil), but I received it with no damages and working fine. I recommend this seller and with possible I pretend to buy with him again.",
        "Pretty horrible. It works for a while, and then buttons start to go bad. And on day, you will find that you can't click on anything, 'cause the button is not operational anymore.",
        "This is a huge disappointment. I have used the latest driver v5.5 and this mouse does not have anywhere near the type of smooth pointer control that you would expect, even compared to the original ball type mice. i have tried many types of mice over the years, including the optical usbs, wireless optical usb, logitech mx1000 laser, and of course the original ball driver types, and this one is by far the worst i have ever used. NOT RECOMMENDED!!",
        "I was loooking fot the COOLEST looking mouse out there, and I FOUND IT and THIS IS IT, I wanted the best looking mouse for the PC in my store, but I tought this one wouldn't have the range for a desktop pc because it was designed for laptops and the receiver would be naturally very close to the mouse (i had problems with Logitech wireless products because the receiver has to be TOO close to the mouse/keyboard); I was wrong, it works FLAWLESSLY in front/rear USB ports in any of my desktops. Get it, you won't be dissapointed with this BEAUTIFUL little mouse.",
        "There are two problems with this mouse, which are enough to throw it to garbage: 1) the buttons are not easy to press, it takes more effort than most other devices 2) the shape is not ergonomic. I have a large palm, and it gets tired very quickly with this mouse Logitech is the way to go, confirmed...",
        "Bought this a few days ago. First of all, this is very uncomfortable. Their is a ridge down the middle and that bites your palm of the hand. Also, the scroll wheel is so narrow and it also bites your finger. I have had the intellimouse for a while and have always liked. This and the Microsoft Optical mouse 4000 share the same id. I found both very uncomfortable. Dissappointed.",
        "The microsoft lazer mouse 6000 is probalbly he worst mouse I have ever owened. The mouse is hard to click on the buttons and the manifier button constantly sticks so that if you use it it is almost impossible to turn off. Unfortunately I have had great luck with microsoft hardware before and I discarded the packaging so I'm stuck with a piece of junk. I would advise anyone considering this mouse to not buy it and if you do save all the paperwork so you can return it. The mouse chasis is not even solid which probably is leading to the other problems",
        "I have used my wireless laser mouse 6000 for about a year and have had ZERO problems with Windows XP ...... it works out to about 3 feet from my Dell laptop easily ..... not sure how it works with VISTA ..... make sure you have a good battery",
        "Good mouse for laptops. But a but too small for an average hand like mine. It takes effort to click right-button and feedback from the buttons are not that tactile (great). I recommend Logitech mice for its ergonomics and feedback.",
        "I purchased this mouse for a co-worker, per his request. It looked so fragile, that it actually broke! He used it for less than a month and it did not work anymore. We were not very happy with this purchase, but I guess we had a bad luck getting this specific one out of thousands out there which would probably work just fine. He decided to buy a different mouse after this happened.",
        "The mouse was much too small for my hand and my girlfriend's hand. Its quite uncomfortable to use for more than 15 minutes - but it is small. I ended up giving this to her and buying a Logitech VX Revolution instead...what a difference! The VX Revolution is about 2x the price but well worth it.",
        "I bought this 2 weeks ago and had problems installing this. Finally got it to work and then it started going crazy. The cursor is erratic and the wireless connection is one of the worst of all wireless mice. If you have the USB port on the other side of the notebook, it does not work well.",
        "Good device, make things easier while using a wireless mouse like this one from Microsoft. Looks cute and functionable. I'm happy for my purchase. I would advice people to buy it if they don't wanna use their computer's touchpad.",
        "Microsoft finally releases a laser mouse !! and its worth the wait. smooth scrolling wheel, good reading of surfaces, and ability to turn off mouse (switches off automatically when you snap in USB wireless adaptor onto underside of mouse) woohoo !",
        "I have always been a fan of Microsoft mice and this mouse continues to confirm my belief. Very easy installation, smooth-as-silk tracking, great horizontal and vertical scrolling. The best notebook mouse ever made!",
        "This is a very good ergonomic mouse. Don't listen to all the skeptics.",
        "It's nice---when it works. Produce is very picky about location. It also eats batteries at a pretty good rate. I'll stick to a $5.00 connected mouse next time. Very expensive.",
        "I have been using this product for a week now. I am very unhappy with it. Does not perform even core mouse functions like click, double click. The cursor keeps jumping all over and loses connection with the base very often. Do not recommend.",
        "Pros. Very good travel mouse, works on every surface, good battery life. Cons. Mouse buttons sometimes randomly are missed.",
        "1. click is very firm... 2. if the mouse is little far from USB port, It doesn't work. 3. I feel pain in my wrist with 2 days use.",
        "One of the worst pieces of hardware I've purchased in the past two years. Short on features/functions. Short on range. Suggest buyers consider Logitech.",
        "This would be a real nice mouse except that the left click button doesn't work smoothly except at the very tip.",
        "The Mouse simply doesn't work, i try to contact the seller with no answer, Try not to buy to this seller.",
        "a compact wireless mouse with laser technology. No driver needed. No tracking problem. Maybe MS fixed it?",
        "I bought the non laser wireless version for notebooks and it just stopped working after about two weeks. I was about to buy this laser model and then I read the reviews and figured that the reliability disease carried over to the laser model. Stay away!",
        "Not very good for a house with impatient people. It was a little sticky at first, by the time I contacted seller, they broke it."
    ]
}