{
    "entity": "Mice",
    "text": [
        "I've had this mouse for almost five years now and haven't had any complaints. Granted, I'm a little addicted to the touchpad on mynow, but I still use this at work because I hate my mouse cord getting caught up with my phone cord and just generally being in the way. It's a great addition to a desktop set-up to simplify your wires. It's comfortable to use, though I've used the multi-function buttons less lately (haven't taken the time to set them up with a new computer). They're nice, but the mouse also works fine without those features if you don't want to use them.",
        "My computer is located on the floor on the left side of the desk, and I use the mouse with my right hand. The transmitter for this mouse was mounted in the USB port in the back of the computer. The cursor was reacting slowly and wasn't very smooth. I finally used a USB extension cord to move the transmitter up to the table next to the monitor and everything works fine now. The mouse and all the special features work flawlessly. I like being able to custom program the buttons for different applications. Excellent product, but be aware that if the distance between the transmitter and the mouse is not optimal, there could be some problems.",
        "A great cordless mouse. I now have two of these. Comfortable in the hand. Laser reads movement accurately. Scrolls nicely, clicks accurately. Shuts itself off when not in use so battery life is excellent (on the order of months). Wakes up by just moving the mouse a bit. I'm not a \"power user\" of mouse buttons and have no interest in the email button and other custom buttons and disabled them. But for me, this mouse performs the key functions of a mouse very very well on all fronts without the cord and without constant battery changes -- which is just what I wanted.",
        "The feel of this mouse is very nice. The functions all work well. I read other people's reviews - they noted the mouse has a tendency to stutter. I noticed the same thing and had to move the receiver closer to the mouse to solve the problem. I don't know if the wireless hub or cordless phones compete, but something does. Once I moved the signal closer, I had no more problems. That being said, if you can't get the mouse within about two feet of the USB connection, you may find the mouse action unreliable.",
        ". I purchased the Logitech MX 610 Laser mouse because my optical mouse (Microsoft IntelliMouse Explorer 2.0) would not work on a new glass mouse pad (the IceMat) that I had bought. I contacted IceMat and asked the Tech's what they would recommend and they said the Logitech MX 510. I thought that if the 510 was good than the 610 would be better.I was not disappointed. The mouse works better than any mouse that I have owned, and with all the features that it has I would definitely give it 5 stars",
        "This is a wonderful human interface device. the mouse itself is extreemly precise and the extra buttons are very convenient. the only downside is that the IM button doesnt work with many instant messengers, however by using the included software, u can set hem to do other things like open a browser or .exe file. battery life is phenominal. i would highly recomend this mouse to anyone. I have used a G5, a G7, and an MX revolution, and i feel that this mouse is a far better choice for the money.",
        "This mouse has a long lasting battery life, which can be supplemented by remembering to turn it off overnight. The shape and feel are perfect and the extra interface buttons automatically work with no installation - just plug in the USB receiver. The customizability of the buttons if you do decide to use the CD is also very convenient. I'm in love with this moue because it offers me the freedom of a wireless laser mouse at a good price and with just the right amount of bells and whistles. It was a great purchase.",
        "I purchased this mouse because I wanted a cordless mouse. The fact that it was a \"Laser\" cordless mouse didn't particularly impress me until I installed it and started using it. It is the most precise mouse I have ever used. By precise, I mean the slightest movement of the mouse tracts exactly on the screen. If you use it for games you really must be sure where you place the pointer, there is no room for sloppy movement. It is the best mouse I have ever used. Period.",
        "In the past, I held MS mice in higher regard than Logitech. Well, MS mice these days are awful, so when I needed a new one I went on a search and came up with this little gem. Nope, you probably won't find it at your local Staples, Office Depot and the like. But, it's excellent. It's feel and function are very good and it doesn't really eat batteries, though no wireless mouse is kind to a battery. The wireless receiver is a little plug in for a USB port and it even works through a wood desk without a hitch. Way to go Logitech for a really really good mouse for a reasonable price (roughly $50).",
        "If you're a gamer or a graphic designer, look elsewhere. The power saving function of the mouse makes it shut off until it feels motion. So if you're not using the mouse for just a little bit, it powers down and waits for movement. It's a very ergonomic mouse, with responsive buttons and nice LED indicators, but if it can't let you move around the screen when you need it to it's not much more than a (bad) paperweight. Move along.",
        "I use every feature of this product and would change very little. It fits my hand, the buttons are well positioned, the email and chat indicators are great, the curve fits nicely. I would like a more ergonomic shape, with recessed finger slots, more hand lean and possibly a tacky surface. Kind of like Microsoft mice. But with this mouse's functionality, it's the best current option.",
        "I went from using a wireless optical mouse to this mouse & it is such a huge improvement! The only problem I've had with it is once in a while there's a little bit of interference from my wireless network, but the mouse works so smoothly that it's worth the occasional interference! Even when working with graphics, I am amazed at how smooth the performance is! I don't care to be notified by mouse when I have new email or a new IM, so I programmed those buttons to do other things. Very simple!! Logitech has another winner!",
        "This is an absolutely great mouse, but probably overkill for a lot of people. The configuration utility for the buttons is a breeze to use and extremely powerful. I usually detest cordless mice, but this one performs great. I use the full 12 button spread for gaming and it works beautifully. However, unless you're a gamer or a power user, this is probably overkill for you. I've seen others complain about the email and IM buttons not working with certain mail clients, but I should point out that the mouse configuration utility can easily fix this if you are willing to dig into it. Overall, this is a great mouse, and I can't live without it now.",
        "After being tethered to a mouse wire for the last 15 years, I decided to try this Cordless Laser Mouse. It set up simply and works great! I've been using it daily for weeks and the battery is still fine. There is no hesitation or skipping when I pull the mouse across a page. It also fits nicely in my hand. I highly recommend.",
        "The logitech MX 610 works well with no impact on the notebook's battery life and excellent battery life on the mouse. Mouse is very comfortable to use and tracks smoothly and accurately. Only disappointment is that the mouse does not work with AOL Instant Messanger to light the mouse when new messages are received.",
        "I have an older ergonomic logitech mouse and it was showing it's age --slow, hard to clean trackball. I do not use the gaming features -- this is for my office. It is very comfortable and very responsive ---- I am going to purchase 2 more for my other PCs. The longer battery life (sleep mode)is a big plus",
        "The most comfortable mouse I have encountered, the laser seems to work on any surface, the batteries last a very long time. The battery indicator goes on with enough time to get new batteries. I bought one for home, then bought one for work, and have bought several as gifts, and received similar rave reviews.",
        "I love the extra button on it but the thing eats batteries so buy a good supply of rechargeables, I have to replace the batteries about every month. I have found that this mouse is not very comfortable to hold for extended periods, it cramps my hand and I feel it is a bit too heavy also.",
        "This mouse was recommended to my by an IT consultant in to fix a problem on my PC. He said he liked it because of its accuracy for work on graphics. All I know is that it is easy to set up, comfortable, responsive and intuitive. The audio controls/mute button is really handy. [...]",
        "I loev this mouse, have had 3 of them....too bad Logitech stopped making them, i have not been able to find a mouse like this anywhere! :-(( loved having the speaker volume and ability to to mute right there on the mouse.",
        "I hate to complain, but Logitech welched on their rebate offer. Amazon offered a limited time mail-in rebate on Logitech and I did it all right--no rebate. I emailed Logitech to ask why and they did not respond. I like the mouse--nothing special--nice to be cordless.",
        "Only had it for a few weeks but it does a good job and the buttons are easy to program. I like the part about being able to change the batteries when they run down. The other logitech I have has to be put in a cradle and recharged because the batteries can't be replaced. That's alright too except when you forget to recharge them and have to drag out another mouse to use while it is recharging is a pain. Now I have two logitechs so I never have to worry about low batteries. Good mouse!",
        "I love this mouse! It just feels great in your hand. My husband tried this mouse and also ordered one for his computer. It works without installing the software and wireless is the way to go. This is a wonderful investment and the mouse is very smooth.",
        "A very nice mouse . I really like the cordless feature . Thanks Marv",
        "This is my favorite mouse ever because of the way it fits my hand (size 8.5 glove), the ease of use of the progammable buttons and the ease in using the provided software to program the buttons. I bought several of these and apparently they have found their way to the USA from China through Mexico. One of the best things about this mouse is that it is available in a left handed version which is unique (not the same as this one so search around for it if you're a southpaw.",
        "Bought a cordless notebook laser mouse by another manufacturer which worked thought a regular size cordless laser mouse would be even better. Wrong, like the other Logitech cordless mice I have had it tracks erratically, and can not be used near other cordless products. Do not plug receiving unit in the back of a PC because it will not track at all (only a maximum of three feet.) Do not waste your money on a cordless mouse from Logitech especially if used for games.",
        "Please check the size of the mouse before buying this. It's height is half the width of my laptop. I thougth it would go into my palm by seeing the picture. But finally returned the product due to the unexpected bulky appearance. But it have a very nice modern look !!!",
        "The mouse is very comfortable, and the software it comes with allows you to reprogram the buttons to do what you want. You can even set up differnt profiles for differnt programs. It was so good, I bought another for my laptop",
        "Love this mouse. Have been using it for a few weeks now and see no problems. The only issue I have with the design is the volume button is awkward and I use that a lot, but I guess it might not be important for some.",
        "i needed an inexpensive wireless mouse.. this is it. because i am an older guy i do not need and did not load any of the extra features. i like the size ...fits my hand.. a value product all around",
        "This mouse it great I have 2. I have never seen a mouse that fits in your hand as well as this one. Some people say the email button and some other button don't work but I don't use those so it's no big deal to me.",
        "But it lags a little sometimes , but this is only limited when the system is doing a lot at once otherwise its great. No major problems , possibly the best budget laser mouse out there on the market!",
        "Purchased this Laser mouse based on review and it is a top of the line mouse. Too many features to mention but it is considerably better than I expected. Receiver for mouse plugs into lsb port on back on computer which is located under desk back in the corner but no problems with reception. I am also a ham radio operator and have no interference from ham radio equipment with the operation of the mouse.",
        "I've been using this mouse for the past 6 weeks. Just put the batteries in and start \"mousing.\" No problems with the tiny USB receiver and no complicated setup. This one is a winner.",
        "I bought this for my wife, and she loves it. It's a great cordless mouse for use with a laptop. She uses it for CAD and says it's the best mouse she's used. The only complaint I would have is that you can't store the USB adapter in the mouse. But it's that not big of a deal to me.",
        "mouse is good for 25 bucks. email button is working. IM once worked but stopped working.",
        "When using this mouse you have all the controlls you need. Speaker valume, email button, instant message button, back and forth internet buttons. Great item.",
        "Great mouse....now if they'd just put ONE more button at thumb position for double click, it would be perfect.",
        "I have owned this mouse in the past and just wore it out. I bought another to replace it and talked another person into getting the same one. Awsome!",
        "Get one quick! just make sure it's left handed. Same model number can be RH as well",
        "Works just like the one that it replaced that worked loyally for many years. This one does seem to have better battery life. Great mouse.",
        "The Logitech MX 610 cordless laser mouse is a top-notch product. It offers choices which can be programed to meet the need of each individual. I highly recommend the purchase of this product.",
        "I can use this mouse on any surface what so ever! The mini receiver is so compact, without clutter.",
        "The product is working great and just what our designer was looking for. Thanks.",
        "The Mouse works very well, and I mainly purchased it for its onboard volume controls to use with games. There are other controls but I don't use them."
    ]
}