{
    "entity": "Mice",
    "text": [
        "Had to convert to using left hand on mouse due to shoulder problems. This is only one available with a BUNCH of buttons, similar to top-end right-handed ones. Indeed the transmitter in this mouse is WEAK, and needs the receiver within a few feet. At 2 feet, my mouse pointer still jerks over the screen sometimes. That is only drawback to this mouse, and is really annoying when happening. But for lefties, I can recommend with some reservations.",
        "Lefties of the world unite, at least, around this mouse. I am ambidextrous but have always preferred to mouse left, settling on less than satisfactory solutions now that most mice are more or less ergonomically shaped. The Logitech MX 610 is crafted for lefties (and feels quite odd in the right hand, by the way). The feel and function are terrific. It comes with email and instant message notification lights, the timing of which may be varied - not particularly useful IMHO but do not detract from otherwise excellent function. Heavy enough to feel solid, light enough to allow quick use, overall, a \"just right\" (or should that be, \"just left\") product.",
        "This is a decent wireless mouse. The back/forward buttons by the thumb see lots of use and are appreciated. The volume/mute buttons are by the index finger and are comfortable to access. The mail and IM buttons are further back and so not as easily accessed, but I hardly use them (I don't IM, and my Yahoo page is my homepage, so I usually bring that up, then click to go to mail). What I'm really waiting for is the day Logitech realized there are left-handed people who want a left-handed thumb-based trackball. I'm not holding my breath on that, though...",
        "There are two kinds of \"lefty\" mousers in this world -- those who are naturally left-handed, and those who prefer to mouse from the \"short\" end of the keyboard. Lefties usually have to use either an ambidexterous mouse or adapt to a right-hand ergonomic design. The MX 610 Left-Hand is an excellent ergonomic design that provides a natural fit for \"lefties\" - so score one for Logitech! It could be improved, however, by adopting more \"tractable\" side panels so that dry hands do not slip during mouse maneuvers. Logitech already has this feature on its ambitexterous wireless MediaPlay mouse.",
        "Only true lefty mouse I'm aware of that has extra bells and whistles. It's a bit heavier than what I'm used to, and it could be lighter if the Li-ion battery were used in place of two AA's, but I suppose having standard battery is not necessarily bad. Overall, very satisfied. Comfortable and easy to use. Connection (i.e. for my PC to recognized the mouse initially and after reboot, etc) is reliable, and I've not had any problem since the purchase. Would recommend to those who are looking for a left-handed mouse.",
        "I love this mouse. First-ever Left-handed mouse. I was sick of all the Microsoft right-handed mice that wrenched my wrist in the wrong direction. The non-handed straight mice were ok, but this one is much more comfortable. Problem is, my employer won't buy one for me! The wireless part: I need to have the USB receiver (transmitter?) somewhat nearby - if my cat sits between it and the mouse, it works erratically. So be sure to buy a USB extension if that is necessary (like at work where my 5 computers are all under the desk and the USB device is totally confused down there). (That is the reason for 4 stars vice 5).",
        "I've been looking for a quality left handed mouse for a while. I've been using my Logitech Mx Laser w/ Bluetooth for a while. (that is a great mouse) I was very dissappointed with the MX610. For starters its not Bluetooth compatable like my keyboard other peripherals, so it takes up one of my 2 USB ports. Secondly, the thing skips seemingly loses it's signal and thats with transmitter 3 feet away!. I got so frustrated that i switched back to my old mouse. It did feel very good,(now i know how the righties felt all this time), but that doesn't really matter if it doesn't function properly.",
        "This works great. After trying 7 or 8 LH mice and track balls I have to say that this is the best. The only reason I gave it 4 stars and not 5 is that as a MAC user there is only set up for a PC available. It still works but I cannot use all the extra buttons. The Logitech MX 620 has the disk for the MAC but does not come in LH. Yes I did try to use the 620 set up but still not go. Come on Logitech how hard can it be to either make the 620 in a LH or adjust the Mac software from the 620 to work on the 610",
        "This laser mouse fits the hand well, has many programmable buttons, and responds precisely. Some people may have found the USB adapter to not get good reception if using a port on the back of a far away computer. A simple solution would be to use a short USB extension cable. The box and instructions were in Japanese, but who cares when the price is about half normal retail. Note that the software on the CD was in several different languages, including English. Summary: Very Good",
        "For Lefties, this mouse gets the cats MEOW! I bought 3 other Left Hand Mice before this one came out. Those others were a major disappointment with many faults. The Logitech MX610 never fails to activate right away, has the best battery life of any I've tried. The auto off feature works great. And this MX610 left Hand mouse is just the right size to fit you hand perfectly. Scrolling up-down, sideways, forward-back, e-mail all work very well. Convient size for desktop or laptop. Easy to program the buttons too. Absolute WINNER! Thank you Logitech.",
        "I'm normally right handed but I have severe tendonitis in my right hand and wrist and cannot use a mouse. This is a great solution. It only took me a couple of hours to adapt and now I have the added bonus of a free right hand for taking notes. All right handed computer users should consider switching to a left hand mouse and leave the right hand free for more complex tasks.",
        "Yeah! I think this and another brand creates the only left handed mouses so I HAD to support the cause because I'm left handed. It feels great to have a mouse contoured for the left hand and having the extra buttons other mice don't offer. I only recommend buying if you can find it on sale though. $50 is a little steep!",
        "this mouse reflects a rare attention to southpaws like myself. however, it has to be on the level as its USB computer connection. Otherwise it won't work as well. you have to have a USB hub (or your computer) placed on the same horizontal plane as the mouse for it to function properly.",
        "I have used Logitech mouses for years. They keep getting better. I like the ergonomics. The buttons on the side are hard to push accidentally. I like the scrolling left and right very much. I just have to remember to use this new feature. I am missing the independent \"double click\" button. I can still set it to double click, but I have to either replace a button that functions for some other useful purpose or use the simultaneous two-key click, as I have it set now. I'm going to just have to get used to that. Overall, I like it. I haven't seen anything better.",
        "I have a very small hand and it still fits fairly well. I am very pleased with it. Sometimes I have to click twice to get it to respond but I've had the same issue with other cordless mice. And I consider it a good trade-off to the great convenience of no cords!",
        "Bought this for our left handed daughter. The box said, \"Logicool,\" all over. She was worried that it was a knockoff but looked online and that's Logitech's Asian name. The instructions weren't in English but she's very happy with the mouse.",
        "Well, it is a mouse for lefties.... I don't use the huge software that has to be downloaded, because I don't need an email button on my mouse or a volume control. It has a lag time and uses CPU cycles. I run it on my second computer and it does the job ok. It is NO good for gaming! I thank Logitech for the design, but feel they could have offered more of their products for \"we of the Left\". I do use their excellent G3 gaming mouse for my main PC as it is ambidextrous.",
        "This mouse is great,I am so happy that Logitech came out with a mouse just for lefties. I am left handed and it has been a little painful on my hand. I have tried many mouses and this one is absolutely the best.",
        "Overall, very good hardware as all the Logitech mice I own. However, Logitech needs to improve its Setpoint driver that loses the configurations, such as button assignments, all the time.",
        "Excellent! Finally a mouse that works for those of us left-handed geniuses like Leonardo deVinci & Picasso. Imagine what they would have accomplished if they only had this flawless product..",
        "The universal mice are OK, but nothing is easier and more comfortable to use than a contoured mouse fit for your left hand. Logitech hardware is always reliable and easy to install - highly recommend this for any lefty out there!",
        "Ordered for my son who is a lefty and he started using it right away. Very pleased with the product and it's performance.",
        "i always dreamed with a 'real' left handed mouse, and logitech make this a reality. extreme resolution, nice design, configurable features like Email and Aim button with led ( blink/pulse when mail or aim message arrives ), there's only one complain: the middle button is a little hard to click, isn't problem for all. The wheel works fine. So, if you want a left handed mouse, this is your best choice !",
        "For years, I have managed the tendinitis in my right wrist by switching hands when I use a mouse - now with my new cordless left-handed mouse, I can switch back and forth without thinking! Hurrah!",
        "Good Product.... Does get some interference from time to time. Double the cost of a right handed mouse. Left Hand descrimination...",
        "Lovely mouse, works well, except before I bought it the Logitech telephone guy told me the Logitech Control Center (LCC) supports this product. It doesn't, and a subsequent call to them confirmed that the first guy was wrong. If you're a Mac person you will have to settle for basic mouse functions only. Worth $60?",
        "Works as advertised. Fits my hand well and operates easily.",
        "If the rest of the world were so adaptable to lefthanded folk! No complaints, works great, very responsive. . .",
        "Product did not work and wrote a review that item was defective. Customer service stepped up and immediately responded by phone and email on how to return the item. Got my money back in less than a week. So, item sucks, but customer service is excellent!",
        "I had been looking for a left handed mouse for awhile, they seem to have stopped production of them. I was lucky to find this Logitech MX 610 left hand laser cordless mouse. It fits my hand like a glove, is perfect in use, moves easily and I am glad I found it.",
        "If you are a Lefty you can't live without this mouse. After two weeks of use I could never go back to a regular mouse. As a lefty you all ready know that the whole wide world is wired back assward!!!",
        "Before I ordered this, my hand was constantly sore from using a regular mouse. The ergo effect made specifically for left handed people is great. It has stopped the sore aching feeling in my hand from using my mouse all day. Love it!",
        "I use one at home and one at work -- could not be happier",
        "1. bought it back in 2009, grey plastic rubbed off down to black 2. click mechanism is really bad, not for heavy use like gaming 3. notification buttons are useless nobody is using msn anymore or email manager 4. volume buttons were amazingly placed, form factor was perfect, laser was first time introduced in this mouse 5. ultimately it failed after a few years -- the buttons failed, then the radio transmitter dongle",
        "Considering it's one of the only mice (mouses?) designed for left-handed people, that alone recommended it to me. That Logitech designed it, was enough to induce me to break down and spend my own hard-earned money for it. It works smoothly, is attractive and fits my hand nicely. It has more bells and whistles than I really need, and too many buttons for my taste, but--WOW--what a relief to have a mouse that fits my hand! I usually have to settle for a 'universal fit' (ie symetrical) mouse, but that's not a reall solution. Come on, Mouse-makers! Make me a mouse! Make me more inexpensive, simple, mouses that fit those of the left-handed persuasion!",
        "We south-paws have it rough out there. Here is an item that will make computer use for the left hander much easier. It is very comfortable, it seems to take shape of your hand and it just moves around effortlessly. The many buttons on this mouse are programable, you can start messenger, open your e-mail, adjust the volume, and go back and forward on web pages, just to name a few. Very handy!!! If you are left handed or know someone who is that uses a computer, this would be a great gift!! Can I give it six stars??",
        "Erognomically this mouse is OK and performs as advertised. The main problem with it is that it does NOT integrate with Logitec cordless keyboard receivers which is really stupid. To use the mouse, I need to have not only the receiver for the keyboard, but I also need to have the silly USB port dongle/receiver plugged in. Right-Hand mice are fully integrated with the keyboard receivers. Logictech should either integrate keyboards with the USB dongle, or integrate the mouse with the keyboard receiver. This isn't rocket science. Once again, left-hander's are getting the short end of things.",
        "I've always wondered why Microsoft mice are mostly right-handed when BillG is a lefty. I stumbled onto this Logitech mouse when Googling without even knowing that it existed, and I love it. I have to admit that I don't use the little side buttons on the right side much, and I also use the main buttons in standard configuration of left and right clicks (too many years of using standard mice...) But overall, I find this a very comfortable mouse. I wish it could be purchased in conjunction with a wireless keyboard using a common USB dongle, hence my rating of 4 rather than 5 stars. But overall, if you're a lefty, you'll love it.",
        "It's great to finally have an ergonomic left-handed mouse on the market, and overall Logitech have done a fine job on this one. It feels very responsive and easy to drive. Being wireless is great and the little USB adapter makes it suitable for travelling with a laptop (although you'll need a pouch to avoid scratching the metallic finish plastic). A few minor points: * It's a little on the heavy side (mostly due to the 2 AA batteries). * You can't configure the mail and messenger buttons. * Occasionally the pointer seems to jump on my laptop. I'm guessing that's driver-related, so hopefully the newer drivers will have a fix? * Not available in Australia!",
        "Very easy to set up and install, comes with its own AA batteries, looks sharp on the desk, this has been a good solid peripherals investment. The left wheel / right wheel bit I may never use but with the otjer buttons on board it has more than enough features to satisfy. Only one area of additional expense, the price one pays being a Mac User, I suppose, but I found myself having to purchase \"SteerMouse\", a 3rd-Party Mac mouse driver from this Japanese shop. This gave me all the functionality of SetPoint, the Logitech PC driver. SetPoint, BTW, worked just fine with my XP-controlled PC. Bottom Line: 3 to 4 Mouse Turds.",
        "Despite the fact that 14% of the reviews poo-pood the MX 610, I decided to take the risk and purchase one. It has an extremely nice feel and I thought that I was going enjoy using it and was glad I purchased it. Unfortunately, within 3 weeks of delivery, the mouse became erratic and inconsistent. It would skip 3 or 4 inches across the screen and was impossible to select a specified point or text. I returned the MX 610 immediately and Amazon immediately refunded the total purchase price. I wish that it had worked.",
        "It is probably the best mouse for left-hand users. There are a lot of extra useful buttons, such as Back and Forward for Internet Expolorer, the scroll wheel (excellent, very responsive), and the volume controls are also must-haves. However, I bought this product hoping that Logitech's included software would allow me to program any mouse button I want, but the software does not allow you to do that for the two main Mouse buttons (which is very crippling in my opinion).",
        "At last a mouse for left-handed! Been using the Logitech MX610 Left-Hand Laser Cordless Mouse for about 2 weeks. The unit arrived in protective packaging. Installation is a breeze and the receiver is rather tiny. The size of the mouse itself is just right and well built. Excellent experience so far. This contrasts with my terrible experience with Logitech Bluetooth mouse from the erratic charging to the break, delay in communication.",
        "I bought this mouse for my brother who is a lefty and a computer geek. This mouse doesn't work for short or longer (less than 5 ft) ranges without skipping all over the place. The form factor is ok, its on the big side, so I recommend you save your money and buy a mouse that works since it's not that comfortable to use either. Substandard product at a premium price",
        "MX 610 performs as described and even better. I'm right handed and use a left handed mouse. If you haven't tried it, do it. Frees up your right hand to write as well as type on the number pad. No problems whatsoever with this mouse. I have the USB remote on the CPU under the desk and have no problems with connectivity. I would recommend this to anyone.",
        "It was a great thing some years ago when Logitech came out with a mouse for the only people in our right minds. But they fell far behind and left us with the early stages of development of computers. Ergonomics is important to all of us plinking away at computers. Logitech has finally given us some of the bells and whistles of today's mouse abilities. I sold computers for now almost 20 years in southern Oregon, and have written emails to Logitech a few times and never received a response. Nice mouse.",
        "I know some of y'all have wireless issues but I plug mine into the usb port on my G15 keyboard. Solves the problem. I love the mouse, FINALLY a lefty mouse. Now if only they made the g series in lefty.",
        "If you are a lefty, this is the mouse for you. PROS: Great placement of buttons. THe weight is also very good. Fits into my hand perfectly (average 5' 10\" person). So far I havnt needed to change the batteries, which the set point program still rates as \"good\" in terms of battery life (2 months of non stop use). CONS: None so far",
        "I have used many mice - usually universally shaped mice for either hand, but to get more control i have had many right handed mice. THIS HAS A GREAT feel and touch to it. Very smooth operating. I just sold an MX5000 bluetooth mouse/keyboard, and switched to this MX610 ,,,, It has a much better feel to it ,,,,,,, A GREAT PRODUCT ,,,,,,,,,, tom",
        "As with P.Sullivan's experience, my mouse had erratic movement problems. At first I was using a rear USB port and switched to a front one hoping this would help reception - it didn't. Upgraded to latest software and performance seemed to improve but still not acceptable. I noticed my cordless phone seemed to have dramatic bad effects on the mouse when phone was in use. This was not the case with my previous cordless Logitech mouse. I'm returning it to Amazon for a refund...dissappointing.",
        "best ergonimic mouse I've ever used! feels comfy in my hand and works great!",
        "This mouse is difficult to find and is the only good solution for a left handed computer user. I bought it for my wife and she is tickled pink. Thanks Logitech and thank you Amazon.",
        "I'm sorry but $399 for a MOUSE is idiotic. I imagine it probably costs them less than $10 to manufacture one of these. More of the population would be able to move forward in technology if companies weren't so enormously greedy.",
        "If you use a computer and are left-handed here is your mouse. It is designed anatomically for your left hand. Logitech makes fine products and this advanced mouse will do everything and anything you wish plus the batteries last. J.B.",
        "I got the mouse in the sugested time frame. It works very well but did take some getting use to.",
        "comfortable, easy to use. great mouse for left handed people. Looks nice, too.",
        "Skipped badly. Very difficult to control curser. Tried all suggestions from help sites to no avail.",
        "Fast delivery!!! The product is in perfect condition, I'm very happy with the whole transaction."
    ]
}