{
    "entity": "Mice",
    "text": [
        "This is one of the few ergonomic mice I can grip comfortably with my wrist-brace on. Other than that, it is garbage. Cheap plastic, the thumb-buttons feel fragile when I click them, and the only surface it works on is my own pants leg. I tried it a variety of surfaces, even making a custom mouse-pad out of the same jean-cloth, and it literally only works atop the leg of a pair of pants that I am wearing. Wierd. I love the shape, but its flimsy outdated hardware makes it completely unusable to me.",
        "I have neuropathy in my hands and have tried numerous mice & alternatives over the years. This mouse is an option for those with neuropathy that have trouble with standard mouse. It takes some time to get used to clicking with your thumb -I'm on day 3 three and it is becoming more natural. Using a third party app like X-mouse to disable the third button on the side of the stick is must for me - beware there is no scrolling which is not an issue for me. Very comfortable grip. My biggest complaint is the cable in the wired version is way too stiff and interferes with movement sometimes - probably would go wireless next time.",
        "I am a programmer and I was suffering from wrist pain and I tried many mouses some vertical ones. None of them alleviated my pain except this. This is really great to prevent and reduce wrist stress. Only downside tho is the scrolling button does not work on text editors in windows. It will not at all work on the Mac. Left and right click work as normal. This is kinda of big drawback but still I use it since so good for wrist movement. 3M does not provide any software to go along with this mouse so that is sad.",
        "I've been buying this product for years and really helped my propensity to get carpal tunnel symptoms. HOWEVER - they have significantly cheapened the materials and it isn't nearly as sturdy as it once was, especially on the scroll button. I've now bought two where this button fails within 2 to 3 months of use. I won't buy again. Shame as this was a very good product, but penny pinching has made it an inferior product.",
        "Even though this product was recommended for arthritis sufferers, I found it to be extremely uncomfortable and certainly not big enough in circumference (handle-trigger portion) to provide a comfortable grip for my arthritic right hand. The buttons were awkward but I imagine that one could \"learn\" to operate this mouse in time, without the \"search and find\" efforts for the buttons on top of the trigger and also on the side. I thought the scroll feature was \"tricky\" and could not settle it down per over-scrolling when I stopped. I tried this mouse for one day, found it didn't \"fit the bill\" for me, and used Amazon's wonderful return policy to send it back for a refund.",
        "I read the poor reviews, but thought I would give it a try since I am desperate for relief from hand numbness. Surely the other one star reviewers do not know how to adjust the speed of the mouse. I tried everything to get this to work and it is terrible. You have to move the mouse back and forth, left and right multiple times before you finally very, gently and very, very carefully click on your desired selection. Then you get to repeat the same thing again. Very frustrating. Why is this on the market wasting resources and the packaging and postage and fuel that was used to send a very worthless product?",
        "My wrist feels much better if I use this but since I am on computer a lot for an action game it is quite a limitation. It does not FOCUS in on game elements like a regular mouse and is inherently slow and clumsy with having to move the whole unit around to move instead of the small hand movements you use with a conventional mouse. So I have to switch back and forth in game using this and reg mouse depending on what I am doing and how much speed and accuracy I need. Also not being able to scroll is a huge annoyance. Wonder why this thing has not been updated??",
        "The clicker is incredibly slow in general, and the left mouse-button-equivalent literally sticks most of the time. and you have to click right to get it unstuck. 60% unresponsive. And the remaining 40% it's incredibly slow to respond as you move the mouse around. Unworkable. (Other than that, I love the ergonomics concept. I used to have a wired version of this mouse years ago; I will try that instead. The delay with the wireless receiver is unacceptable.)",
        "Comfortable and good for casual use but absolutely not for gaming because there isn't a scroll wheel. I'll be changing over to something else with a scroll wheel and hold onto this for when the carpal tunnel really flares up.",
        "This is the second one of these I have bought over the course of 8 years. I love it! I have had carpal tunnel release surgery on both hands and this is the best mouse. It is a plug in via USB and they have a wireless version but I like it regardless. I only replaced my old one because I broke one of the buttons or it would have still worked great! I cannot use a regular mouse since I have gotten so used to this one. One note: I use the Small/Medium and I have average sized hands but it is offered in a L/XL which may be more comfortable for some.",
        "I used this mouse at work and found it very helpful for relieving pain from a hand injury. Consequently, I bought one for home and found that it worked inconsistently. I contacted 3M about the problem, and they got back to me promptly. 3M told me that the device is not Windows 10 compatible. I returned it and received a prompt credit.",
        "Mixed reviews are justified because it is difficult to use if you've been using a normal mouse for decades (like me). Take the time to re-learn how to mouse and it's really helpful from an ergo pain perspective. Also, the default mouse speed is \"max\". Change settings to a slower mouse movement speed and it's much more manageable. Once you get used to it and get the settings right, it's a godsend! Has 2 buttons on top (shaped like 1, but each side is a different button). Scrolls with a button on the side. Takes time to learn and get used to, but once you get there you won't go back!",
        "This mouse is very comfortable and has helped with the pain in my hands. Unfortunately, this device consumes alcaline batteries like crazy, even with a proper use of the on/off switch. I’ve had to replace them several times during the same week. I have other wireless mice that are way more energy-efficient, so the extra cost of batteries or the apparent need of rechargeable ones is unacceptable for me.",
        "Such a cool concept, I was excited to try it out. After just a day, the pain in my wrist and elbow worsened by more than any other mouse I've used. By the 2nd day, just grabbing it hurt. Only reason I used it for even a 2nd day was because my vertical mouse wasn't working anymore, but I'm definitely going to use a vertical mouse from now on.",
        "The handle does NOT move. You have to slide around using your arm the same way with a traditional mouse. xxxxx You trade a traditional palm-down mouse with a mouse where the side-of-your-hand is down. The buttons are confusing i.e. left mouse, right mouse, and NO scroll wheel. I was personally hoping for a joystick that would anchor to the table, and I would 'drive' the stick while it remained in place.",
        "I wish I would have thought to purchase this years ago. The economics of being able to hold my wrist in that position along with my fingers had been great for my carpel tunnel and much less fatiguing to use at the office. I with highly recommend anyone to try it out for at least a week.",
        "Definitely overpriced because it's the only mouse that is completely vertical, besides that I still get the same pain in my wrist and haven't noticed any significant difference other than the fact the sensitivity is horrible. I have at least 20 misclicks a day which can be devastating depending on your job.",
        "This bluetooth version is poorly constructed with cheap materials. The thumb button on top of the mouse catches on the handle and often doesn't respond to clicks, which renders the product unless. 3M has a great design for an ergonomic mouse but the construction quality of the product is ridiculously poor. I have the corded version which in my case seems made with slightly better precision(still flimsy- Ive gone through a good number of them.) and I can't live without it.",
        "I purchased the mouse to see if it would alleviate some of my carpal tunnel symptoms. Using the mouse required me to rest the side of my arm against the keyboard tray which put pressure in a different, more sensitive location. The scrolling mechanism is unnatural and I couldn't get used to it even after two weeks of use. The movement of the mouse required more manual movement than a normal mouse and the USB device was larger than normal so it may be difficult to use on computers where the ports are spaced closely together.",
        "$56 for junk plastic. No features, really. Just a hunk of plastic in a difference shape that you drag around. Most notably, I didn't find it comfortable of able of providing relief to my mouse hand. I returned it.",
        "This has been a good product for me over the last 10 years. I get tendinitis around the metacarpal on my index finger that runs up my forearm. I tried other ergonomic mice but really benefited from the whole arm movement that this one provides. I recently converted to Windows 10 and it didn't seem to work at first. I tried it again after everything settled down and it works fine. I've been very happy with this product. I have three of them for different computers in my house. I started with the wired model but the wireless version is nicer because I can easily move it out of the way if I'm not using the computer.",
        "I’ve had one for the last 2 months. So far so good. I bought the small size. My hand is small - I wear a size 4.5 ring to give you an idea. The small size is still just a tad big for me for which I give it 4 stars. It just gives me a little bit of discomfort which is not pain but more of awkwardness from the size issue. But as far as pain symptoms, it’s gone since I switched to this mouse. For now this is good. Maybe someday the company will make a size XS.",
        "This odd-shaped mouse has saved me many hours of hand pain from long days at work on my computer. Just after the first day of use I felt 50% better and now do not have any of the hand pain I used to endure. I recommend this mouse to anyone, probably most of us, that spends at least 8 hours a day on our computers.",
        "Great for neutral hand position. Has helped attenuate RSI on my wrist extensors. Also forces larger motions instead of \"flicking\" the wrist for mouse motion. Helps keep hand relaxed between mouse clicks (i.e. no finger-hovering) Wireless connection works great on both Mac and Windows. I have the wired version at work, and the wireless version at home. You need to have VERY large hands to get the large version. I have large hands and the Small/Medium version is fine. Scroll wheel might be useful, but I have yet to find an application that doesn't support scrolling with the middle button depressed. All in all, much more comfortable than regular mice.",
        "After visiting my doctor for possible nerve damage to my right hand, I was advised to get an ergonomic mouse and found that this one relieved my pain the quickest. The joystick design ensures that your hand always remains in a safe position and after a couple of weeks, the pain was gone from my arm. This product has been a godsend and allowed me to keep working as intensely as I had before by keeping my wrist and arm in a healthy position despite the number of hours worked.",
        "The mouse speed is way too fast, and it is not adjustable. Even with the OS setting at the minimum, this mouse moves too fast for precise control. It does feel comfortable in my hand, though. I am returning it. I would buy it again if they would make it slower or provide an adjustment button. They also need a left-handed version.",
        "Took a bit to get used to but now I love it! Natural and comfy. Make sure you get the right size for your hand (I made sure to read up on it before buying) recommend to all my friends with arthritis",
        "Get the wired version. Wireless is very frustrating. It sometimes doesn't register actions. So sometimes you find yourself clicking on things several times in order for the click event to happen. Or sometime it gets stuck on a down-click, so you end up dragging windows or other items around. It's very frustrating. This never happened on the wired version. Maybe they used some cheap components during the conversion.",
        "This is for elderly people who doesn't move their wrist very well. If you try to use it to scroll or point any web link it will frustrate you. It is very inaccurate and because it forces you to use your arm it's very cumbersome. Afterawhile it hurts the shoulder more than the arm so it's not really well thought out. Too slow, inaccurate, and tracking is a bit jerky because it needs your arm to precisely navigate.",
        "Great product that does help to get rid of carpal tunnel pain. It's far less accurate than my trackball, but there are no truly ergonomic trackballs. Pros: -ergo grip -moderately easy to adapt if you're a mouse user -wired or wireless options -looks really cool on your desk (everyone wanted to use it, seriously) Less than pros: -thumb clicking is an interesting trick to learn -grip click only works on certain Windows applications (I'm a Mac user) -using your hand to control the movement compromises accuracy Bottom line: if you have wrist pain, it WILL help you, it just takes some getting used to.",
        "I love this mouse, but I only had it for a few months when it fell, about three feet, onto a wood floor, and broke. This happens because it sticks up higher than a regular mouse, which means it doesn't fit under the desk on my keyboard tray the way another mouse would, and so it hits the desk every once and while and drops. My previous iteration of this mouse I had for five years and it fell the same distance regularly and never broke. They should have a return policy for such an expensive mouse that extends beyond having to purchase $12 worth of additional coverage, or build a better product. Ridiculous!",
        "A must have device to save your wrist and fingers from repetitive stress. I tried using the wireless one but it wasn't very responsive. I had this device recommended to me by a hand therapist many years ago when I had carpal tunnel and I've been happy ever since. I tend to break one and replace it every couple years.",
        "I use to have a lot of pain in my middle finger which radiated to my index and ring fingers. My right hand was always stiff in the morning. The issue was primarily a repetitive injury from using the wheel to scroll using a standard mouse. I also had a lot of pain in my right shoulder. It took several months for the pain in my hand and shoulder to go way but it has since using this ergonomic mouse. The one issue that I do have is that it is very difficult to control the pointing accuracy. I'm frequently missing my target even after more than a year of use. But I'm pain free, which is much more important.",
        "When I use my computer for a whole day, I'll have wrist pain with a regular mouse - but not with this... It does take some time to get used to (you won't be as efficient at your Mousing). When looking at it, you might think it moves like a joystick (and the joystick jokes at work will quickly get old), but the top and base are fixed - which forces you to move your entire arm - which is how you should move a mouse apparently. Between that and the neutral position of your hand (i.e. handshake grip versus facing a table), it works wonders.",
        "I have inoperable nerve damage in my right forearm, and the pain from operating an ordinary mouse is unbearable, due to the finger and hand movements required. This mouse allows me to work, surf, and even play Minecraft without aggravating my nerve. I can see how it would also help with tendonitis. I tried a number of high-priced popular mice from both Microsoft and Logitech, but this one beats them all for pain relief. Don't hesitate to give this mouse a try if you're in the same boat as me. The control scheme took a few minutes to figure out, but then all was natural. Highly recommended. Please note that a wireless version of this mouse is also available.",
        "Have used these for many years and I keep buying them. I do tech research and design and it helps keep my wrist strain to a minimum. I usually make my employer buy me one, but now I'm self-employed. Still worth the price...I'm petite and the small is perfect for me.",
        "I've been using this mouse for a week now and it has helped a lot with the arthritis pain in my hands. The scroll function is a little fiddly to get used to, but having the middle mouse button on the handle has helped a lot. My most painful joints are in my right index finger and this mouse has greatly reduced my pain. The base of the mouse isn't the most comfortable to rest my hand on but otherwise this mouse is great. The mouse is even responsive enough to use for computer gaming. I am still fine tuning my control but I've adjusted much faster than I was expecting.",
        "I am a computer gamer, and used this mouse for several years. During this time my thumb developed tendonitis and it got so bad I needed to wear a brace and pay for several doctor visits. After a year of not using the mouse, my thumb stopped hurting. Now ok, before you rush to conclusions, yes, obviously if I used it for years I thought it to be good, but like all things you have to watch yourself when it comes to repetitive motion. I still haven't found a mouse that is perfect (or provides minimal risk for repetitive motion injuries). I think the best way to control this is by limiting the amount of time you use a mouse!!",
        "Tennis elbow meant I needed mouse help, since I'm on the PC allllll day. Went through a couple cheaper attempts before hitting this one. Forget the shark... the clear win here is that the side of your hand rests on the mouse, instead of dragging the mousepad (which my largish hand was doing with the other type... which meant constantly lifting my arm, making my shoulder hurt instead of my elbow). Plus people stop, stare, and think it's the coolest mouse they've ever seen. Only thing that would make it better would be if it was actually a joystick instead of a mouse. And came with Top Gun sounds effects.",
        "Works great for me. I had some discomfort in my right index finger and this took care of it. I use this at home and at work",
        "My last purchase was my third of these to buy. They haven't worn out. I just tend to drop them from time to time. I love this mouse and won't use anything else. It's worth the cost with regards to my wrist and repetitive injury issues.",
        "This style of mouse relieves tendonitis and carpal tunnel. Well worth the money. Wireless version is also good.",
        "conceptually, its not bad, but it has one fatal flaw, there is only one physical button under your thumb, which can be rockered left (for left click) or right (for right click). There is no way to hold the right button while activating the left, as many software programs assume this ability. So, for straight vanilla usage, it works, and it may help save your wrist, but I can't use it with about 1/3 of my normal programs.",
        "Just received the new mouse. Install went smooth but it did take a full 5 minutes for the drivers to install. Getting used to the right and left mouse button is easy. The scroll function buttons are on the stalk and requires a button push and then a repositioning of the mouse to scroll up or down. I wear a large glove size and noticed my hand feels cramped on the stalk so be aware if you have very large hands this might not be for you. Not sure I will be able to do fine grain mouse adjustments for PowerPoint, Visio, etc. due to the hand position but time will tell.",
        "I'm giving this a 4 star though I really like it. Had a wired large, so bought the wireless large. My hand started cramping within hours. Bought a small, and the fit worked perfectly. Weird that that the large wired -- which was bought years and years ago -- did not match up to the large wireless. That's why i took one star off. But, as I said, the small worked perfectly. It's my mouse of choice.",
        "This mouse is definitely more ergonomic than the Anker one I own however the lack of a trackpad kills it for me. Not a very innovative design at all as you can easily mix up right and left click and the second button is simply designed to allow you to scroll in an impractical manner.",
        "Works good. Takes a bit of time getting used to it, but it has really helped my \"mouse elbow\" problem. It keeps my hand sideways and I now have to use my thumb instead of my fingers and this helps alot because when I was always using my fingers to click the mouse, the conventional mouse put stress on the muscles connecting to my elbow.",
        "these definitely help for carpal. my problem--mouse clicking hurts the heck out of my wrist area. of course, these give you \"carpal\" type pain in your elbow area although not too bad. the main problem with these mice is they deteriorate typically after a year of use. things that happen: --the cursor will suddenly shift to the far left of the screen. --the mouse won't select correctly. --clicking on something doesn't click--it either just doesn't work or it will do something else. that said, these mice have been a HUGE help. you just have to replace them much more frequently than a regular mouse.",
        "If you have wrist/elbow pain, or carpal tunnel syndrome, you can try using this. I tried because of tennis elbow, caused due to improper posture while handling mouse. This is of good quality and definitely the change of position relieved the pain associated. PROS: * Encourages the movement of shoulder and whole body instead of just the hand or the wrist * Game device like hold My suggestions: * Become ambidextrous (using both hands) * Switch hands for a few days while using mouse * Change to a natural, pain-free position * Build up the muscles in the forearm",
        "I'm a software engineer who uses the mouse constantly. I have used this since 2001 when I was having to leave work early do to excruciating pain in my arm. I saw this on a store shelf and bought one with an old mouse ball in it. Since then I upgraded to the optical version about 8 years ago and this continues to be my daily mouse. It's one of the few products I own which was life changing for me.",
        "This mouse really reduces stress on the wrist. This mouse is a great mouse, but it could have been much better. Would have been 5 stars if it had a scroll wheel. Don't realize how much you use something until you lose it. If they come out with a model that adds a scroll wheel for the middle or index finger would buy again.",
        "I've used the wired version for years & love it. When it died a few weeks ago I figured it was time to try the wireless version. It worked great for a little while, but then it started freezing. Not sure if the mouse loses contact with the USB connection or what--I've tried pushing the \"connect\" buttons but nothing changes. At first I could remedy the situation by restarting my computer, which is a pain but at least it bought me some work time. Now even that doesn't work. I'm returning this one & going back to the wired version.",
        "Absolutely love this mouse, it's a life saver. I work as a CAD Designer so I use a mouse atleast 40 hours a week. The pain was so unbearable it pulsed from my shoulder down to my finger tips, especially below my elbow. I had lost feeling in my finger tips and was scared I would have to quit my job. This mouse, solved all my problems. Unfortunately 2 months after purchasing it it stopped working. 3M hasn't got back with me on over 2 days, and the pain is unbearable so I am opting to purchase the wired version of this.",
        "Seller accepted return even though it was past date. Item stopped working. I'll be rebuying. Really like it.",
        "While this can serve you as your alternative mouse this product doesn't provide the accuracy needed for modern gaming or fast enough to support quick rotation. Buy it only if you are planning to use it for office and low intensity works. Yet even that's your purpose, you still are paying way too much for just a 10 bucks quality mouse that's just shaped differently",
        "I started using this mouse several years ago because I was having carpal tunnel type pain in my arm and wrist. The pain went away after a few weeks, and has not returned. Getting used to this mouse was easy; in fact, I don't even think about it anymore, and wonder why the IT guys stop before working at my computer. There are some products which just work. This is one of them.",
        "I purchased this mouse to alleviate my carpal tunnel pain. The ergonomic design provides immense relief!! I can stay on my laptop way longer with this product.",
        "Works great, relieved strain in one part of my forearm from index-clicking. Ended up causing strain in my thumb tendons and extensor carpi ulnaris tendon though.",
        "This doesn't work, I owned the wired one since 2010 and it works just fine, this one is really bad not sure if the overall quality dropped or just the wireless ones. i tried it on windows 7 and windows 10 machines and it keeps having short freezes",
        "I used one of these I bought years ago until it died (I dropped it too many times!), so this is my second unit. I love the fact that it minimizes wrist & finger fatigue. What I don't like is it takes a bit of concentration to make sure your left click is an actual left click, an issue I don't recall having with my first one. Also, the front button which replaces the scroll wheel doesn't seem to work on this one, either. Since I rarely used this feature anyway, it's not a big deal- it just ought to work.",
        "Coooomfy! One of the few mice that really gets what ergonomic means. Your hand is held in a neutral position with any pressure being actually put on the wrist. Feels soooo nice. I use it with one of those beaded mouse cushions and can use this thing for soo much longer than a soap-bar style optical mouse.",
        "Purchased first one July, 2013. After a few months the computer started freezing and slowing down. Initially thought the computer had a virus. Computer finally quit working altogether. Did a complete format and new installation of software. Computer worked fine until this mouse was installed. Tried the mouse on another complete...same problem. Order a new mouse Jan 2014. Defective out of the box. Right click button activated the scroll menu and could not be changed. 3M support site for this product is USELESS.",
        "I alternate between a apple mouse and this one and it really helps avoid the wrist (and sometimes arm/shoulder) pain I was getting when I used just the regular mouse all the time. I bought one a little over 3 years ago & it's starting to not be as effective (left click not always responsive), so I am buying a replacement.",
        "This fits my hand perfectly & allows me to maintain my hand in a rested, fist-like position. Other ergonomic vertical mice (e.g. evoluent) forced me to hold my fingers extended (particularly my index finger), which caused me discomfort within few days.",
        "My old 3M ergo-mouse eventually died on me and it lasted me quite a while (4-5yrs). I've grown so accustomed to the design and couldn't go back to using the standard mouse for work. In my case, this product TRULY did reduce strain on my wrist at the time when I initially started having the pain several years ago. I've used this product ever since then. I have the mouse at work since I'm there most of the time. After all these years of use, my wrist has been pain free. I highly recommend this product.",
        "Had that carpel thing going at work. Lots of computer work. Elbo and arm starting to take a beating. Our HR would deal with the after effect...(surgery/therapy), but I decided to pop for the less than $50 to see if this new type of mouse would work. And I had confidence, because of Amazon, that I could really return without a hassle. DANG, it took about a week and things got alot better over time. It DOES take a little getting used to, but then becomes as normal as the other mouse (mice?) out there. Make the move. Today I am ordering a second one for my home use. Lovit.",
        "I've been using this mouse for about 8 years and I just recently picked up a new one. It's a great mouse for clearing away any mouse-related RSI issues. When you initially get it, you do have to go through a small adjustment period to learn how to click down with your thumb, though IMO, it's easier than adjusting to something like a trackball.",
        "I bought it for my wife for some ailments in her right hand!!! She loves it!!! She and I are very happy with it!!! Though I don't use it!!!",
        "I bought this mouse since I started getting some pain in my write from extended mouse use. I wanted to buy something ergonomic. This mouse itself is ergonomic. The palm and wrist positioning is good. However the bad part was having to move the mouse just like a regular one. It is uncomfortable and clumsy. I found positioning the cursor accurately quite difficult. The mouse would also fall off often from my tilted tray. I returned this and bought a Logitech Trackman. I find the trackman much easier and comfortable.",
        "I've tried other ergonomic mice and didn't feel any improvement in hand or arm pain. After looking at other alternatives, I settled on this one. It was amusing to adapt to it after using other mice, but the technique came soon enough. Pros: *excellent quality. *liked it better than other vertical mice. *intuitive to use after short adaptation period. *definitely reduced hand and elbow pain. Cons: *some adaptation period required. Highly recommended.",
        "I suffer from chronic wrist pain and tennis elbow and by using this ergonomic mouse I have reduced the amount of pain I feel. I do a lot of photo editing and online work but due to my chronic pain, I am unable to use the mousepad. My physical therapist recommended this mouse. While it has eliminated most of my pain, I have noticed that other areas are starting to hurt a bit when I spend many hours working. No fault of the mouse, it is just overuse of my fingers and arm. All in all I would recommend this mouse if you have any chronic issues.",
        "I purchased this for my mom because she has arthritis. This mouse isn't for people with serious arthritis like my mom. This mouse requires intricate thumb function to use the left and right buttons and people like my mother will have a very difficult time using the thumb buttons. I had to return it because she was unable to use the thumb buttons at all. If the buttons where elsewhere on the device I think it would work better.",
        "This ergonomic mouse allows the hand to rest in a natural position, relieving the wrist and greatly reducing the need to use the index finger for clicking (which is one of the reasons I bought it). It is shaped a bit like a joy-stick, so that one uses the thumb for left- and right-clicking (the button is on the top of the \"joy-stick\"), while a button further down the handle allows for double-click and scrolling. This button is sufficiently long to be operated by either the index, middle finger or ring finger (or all together). I am quite satisfied, and would certainly recommend it for someone with wrist pains or pain in the index finger.",
        "I've had this mouse for years, just ordered this one to replace my current one as it's been knocked off of my desk a few times (thanks to the cleaning crew at the office!) and it's now cracked. I have carpal tunnel and this mouse has made a huge difference in the amount of discomfort I experience after working on my computer for 8+ hours/day.",
        "I had a 'career-ending' injury 8 years ago. I had severe bilateral tendonitis from fingertip to shoulder; at one point it felt like I had sparks shooting from my fingers to my shoulders. I started using this mouse 2 years later while in school (to 'retrain for a new career') and I simply cannot live without it. This is the ONLY mouse I can use. Today I have minimal elbow discomfort and work full time, all of which is spent on my computer. I cannot tell you how important this product is for people with RSI. Most of my coworkers now use it as well.....",
        "This is tge most waste of money. It does not help at all. In fact it caused more pain.",
        "Comments 1. product is durable and clicks like any other mouse, except with the thumb. Bit goofy at the beginning perhaps, but it takes about 10 minutes to get used to 2. no issues with battery durability; no issues with compatibility with Vista or Windows 7 on a Dell Latitude. 3. would be nice if the USB wireless receiver was smaller 4. design is based on published ergonomic studies. Better yet, my tendonitis in my index finger went away. 5. kind of a conversation piece...which works",
        "My wife spends many hours a day on the computer and the use of an ordinary mouse was straining her index finger (no wrist problem). I bought her the small size and within a day or two all of her finger pain disappeared. However I did have to insert a piece of foam (about 1 inch thick) around the handle at the base to support her hand since it was too small for the small size. Easy fix. I've just ordered one for myself.",
        "I really liked this when it worked. Stayed working well for a couple years, then died, never to be resurrected by a battery or anything else. Would love to purchase another someday.",
        "After experiencing wrist pain at work from constant computer use, I tried this new mouse. I was surprised how easy it was to adjust to. My wrist pain has diminished, and I have recommended it to all my co-workers. The only thing that has been harder to get used to is the scroll feature. It doesn't work on all of my programs, so it can be a little annoying to have to use the scroll bar on the side of the window in some software programs. Overall, I love it and think it was a great value.",
        "Purchased to help with shoulder/wrist issues. Seems to be helping.",
        "The mouse fits one's hand as advertised. However, the scrolling mechanism on the side of the shaft is extremely difficult and clumbersome to use. I have since been advised by my doctor that my carpel tunnel syndrome was not caused by the over usage of a mouse or typing. The high price of this device is a rip off for the function which it is supposed to assist. I would not buy this product again.",
        "I ordered a vertical mouse in order to relieve the pain in my wrist. This one didn't do anything for me. I found the absence of a scroll button very irksome especially because I am used to Apple's Magic mouse which makes scrolling very easy. I was trying to use this with a Mac and ran into various compatibility issues. I had trouble reprogramming the buttons. Too troublesome a product for me. I've returned it and am sticking to my magic mouse.",
        "It takes about 1-2 weeks to get used to but after that it's the best feel on your hand. It uses the shoulder and some wrist extension and flexion (rather than side-to-side) movement to operate. I would recommend this to people who have a problem using the index and middle fingers on a standard mouse since most of the action on this mouse comes from the thumb, shoulder and wrist.",
        "The device is good at relieving wrist strain. Unfortunately, the fancy two-way button (left button and right button combined) has started malfunctioning after only 10 days. This has been reported by other reviewers. I wish they'd quit trying to make it fancy and just put in good old-fashioned buttons, which are easily available, cheap, and reliable.",
        "Have been using for about 5 years. Was experiencing some weariness, not really pain, in my right forearm. 2 weeks after using this mouse, problem was gone, so I continue to this day. Quality build, dependable and durable, was plug and play so easy to install. Originally had a wired version, but wireless is so much better to reduce clutter on desk. You have to use what works for you, but try this one out.",
        "The grip is great for my small hands and I have suffered from Carpel Tunnel for years so I like this option. This mouse will just stop working periodically. I got to the office many a days and this thing just won't move. Today being one of the days.",
        "If you have any issues with your wrist or arm,this is the mouse for you! I started using it when with my stand up desk, but now I use it all the time, sitting or standing. Its great. Takes a bit to get used to, but I wouldn't do without it!",
        "My desk is 2.6 feet from the floor. This fell off one time and the top began swiveling. It feel off a second time and the top broke off. It is held on by two tiny tabs. Also, though it helped my carpal tunnel, on the mac there is no easy way to redefine the north south access to something different which led to my shoulder getting out of positon and 4 weeks of chiropractic visits to correct the pain. Thanks, but not thanks. Perhaps the PC software lets you address this, but for me it is a nonstarter",
        "I have just started using this mouse, so I cannot comment on how effective it is at reducing pain. However, I can comment on which \"size\" is best: small/medium, or large. My hand is approximately 3\" across the palm (not including thumb), and I originally bought the small/medium version (3M recommends small/medium if your palm width is 3.5\" inches or smaller). I must say that I found the small/medium one a bit too small for my liking. However, the \"large\" one does feel a bit too large as well. I think if your palm is 3\", then you can probably go with either one and get used to it. I ended up going with the large one.",
        "I purchased this product on the recommendation of my physical therapist, since traditional mousing was aggravating my \"tennis elbow\" significantly. It provided immediate relief while mousing. I have used it for about 3 weeks with no problem, other than the learning curve associated with buttons being located in different places than I was used to. I have not experienced the problems that I've read in some reviews (so far). The \"receiver\" that plugs into the USB port is a much larger size than those found on other modern wireless mice, but it is not inconvenient.",
        "Love this thing. My first one lasted 10 years of use. Like M-F use. I have RA and my right had had some damage in the early goings, so this keeps my fingers from being split and stretched all day, which is painful. It is easy to adapt to and you will not want to go back to a traditional mouse.",
        "I wanted to love this mouse, but it took the overuse pain from my wrist/forearm and moved it into my shoulder. To move this mouse, you have to move the entire thing; it's not a joystick that tilts, just one solid object that slides on the tabletop. Keeping my thumb on the top button (to left/right click) meant my hand was suspended above the desk, and I had to slide the mouse (and my entire forearm) around using my shoulder, neck and pectoral muscles.",
        "Took a little getting used to, but my mom is again able to use the computer even with her RA. Thank you!",
        "This mouse cured my aches and tingles in my wrist and fingers. Its a miracle and I highly recommend it for anyone feeling signs of carpal tunnel syndrome. within 1 week alot of my symptoms stopped! no need to keep my old mouse anymore- this one is it! it takes a little time to adjust to the movement and dexterity I knew with the old mouse but day after day it feels more natural and I am back to my normal speed and efficiency. great purchase!",
        "This is the 3rd 3M product I have purchased that has been a serious disappointment in quality. The large sized mouse is actually pretty small. I knew that going into it based on previous reviews. Everything said previously is correct about the size. Also, the button some the thumb button has begun to stick. I have only been using it for a few hours and it is already beginning to not function well. I hope that 3M actually reviews what people say about their products. I am not sure I would ever want to buy anything from 3M again. Quality is no longer their forte.",
        "Worked great for 2 days then would get stuck and would not continue when trying to go up and left. Randomly would not allow me to left click. Felt good in my hand. Did not have long enough to have any battery issues or concerns. Company was horrible to deal with during return.",
        "This mouse definitely helped the arthritis in my index finger from overusing my traditional mouse; however, because control of the mouse is done with your entire hand, it doesn't navigate smoothly on the screen and is slow to react. It's ok for now, but I'll continue doing research for something better.",
        "My wrist tendinitis is cured! I’m an engineer and spend many hours each day on my computer. This is so comfy and easy to use.",
        "This vertical grip mouse can help relieve pain caused by postural injuries of the wrist and/or arm."
    ]
}