{
    "entity": "Mice",
    "text": [
        "MS wanted hundreds of dollars for their product, I purchased Logitech for under $20.00 and it works just great.",
        "I have a lot of pain in my hands/wrists that is especially exacerbated by computer use. This mouse does help somewhat, but it's not built for small hands (female size X-Small/Small hands). After using it for a few days I felt a strain in my index finger because I constantly had to reach over the big mouse to click. I wish the mouse was a little smaller all around / less bulky. But, the overall positioning of the hand on this mouse helps A LOT with wrist pain. You can feel it right away. If you have Medium-Large hands you will probably love it. The mouse software installation took maybe 2 minutes, and was very easy.",
        "I'm on a PC several hours a day and have been for more than 20 years. While carpal-tunnel had not become an issue it was a concern so I decided to try a mouse with an alternative hand position. My wife bought another brand \"potato\" mouse a while back that I personally found awkward. CT had become a serious issue for her and she found the grip style mouse alleviated her discomfort. I gave the MS Natural 6000 a test run run and after about a day or so, found it comfortable and easy to use. A \"normal\" mouse now takes a few moments of adjustment. Try it!",
        "I like this mouse a lot and was disappointed I couldn't find it in the local stores (Office Max, Best Buy, etc.). I had the same model for a couple of years and ended up breaking it when I moved my office. Amazon came through with a great price and quick delivery. This is a very comfortable mouse if you have big hands and/or use a mouse a lot for work. It keeps your arm tilted at the proper angle to reduce any CT in your wrist. It makes a fairly loud 'clicking' sound when you hit any of the buttons but overall it's a solid mouse that will last.",
        "This mouse was very comfortable and relieved my wrist discomfort immediately.(believe it or not). I was in complete disbelief that wrist problems would arise from usinga computer. once I began video editing the pain began along with a some stiffening. this mouse relieved it. it is an all around good buy. I would recomend it for the price i payed($35). It is very accurate for photoshop as well. The only con i have is that it doesnt have an on off button or rechargeable batteries(although myh power is still as good as new for a month now with moderate use.",
        "This is, truly, the last mouse that I will buy!! It may be larger than you would like, as I thought, but in this case \"bigger is better.\" It is contoured perfectly, for my hand. The batteries seem to last forever; haven't changed them yet and test shows them to be A-1. Can't say anything negative about this mouse!!....It is all as advertised and more. Top center buttons are for magnification and page back. This is, without a doubt, the best mouse that I have ever tried. The \"Gladman Said That.\"",
        "I needed a mouse that would stop destroying my wrists at work... and I found one in this mouse. It takes about 5 minutes to get used to the slightly altered way of holding your hand, and suddenly your wrist is no longer being strained. I love the trackball -- it's subtle and I don't feel like it's going to stop working (though I suppose this remains to be seen). It has great sensitivity. I haven't yet set the other 3 buttons.. but I'm sure once I do I'll love those too ;)",
        "I developed Carpal Tunnel after having wrist surgery. I was forced to use my left hand to use the mouse. When I discovered the Natural Laser Mouse it was wonderful. I can now use my right hand with the mouse and suffer no problems with my carpal tunnel. The mouse fits my hand perfectly. I find it allows my hand to rest naturally on the mouse with my fingers falling perfectly into the proper place on the mouse. I will not go back to a normal mouse since I have been using this mouse.",
        "I purchased a defective unit that would stop working after a few minutes of use, but it got replaced by microsoft for newer model since the 6000 was discontinued. While it worked it was a very nice mouse. I bought it because I suffer from tendinitis/carpal tunnel. The major con is that it is a bit heavy with the two batteries on, so my suggestion is to use only one battery(it will work). The shape is great and the click is effortless. It is probably twice as tall as a regular mouse, but suits the purpose of keeping your wrist in a comfortable position.",
        "I had this mouse before and it worked great for several years. This one came in original packaging but stopped functioning after only 2 months. I was allowed to return it and I was given a refund but with a whopping $30 re-stocking fee! I find that objectionable since the only reason I was returning it was because it didn't work....at $149 ...it should last for more than 2 months!! Not Happy...;-(",
        "This mouse is a lot better than most others, but it's still not perfect. My hand rests at a more natural angle, but the thumb rest is sort of awkwardly placed. After trying to get used to it for a week or two, I just started holding the way that felt most natural. I don't know if I'm doing it ergonomically or not, but it feels a lot better to me. One complaint: the wheel is very difficult to click down on. I use that middle click constantly in Firefox, and it's very irritating that it takes so much force to do so.",
        "After reading all the reviews on amazon for this mouse, I decided to go with it. I got the mouse and touched it for the first time, and it is my far, the most perfect, most comfortable, and best feeling mouse I've ever used. Its honestly like the creators finally understood how a mouse is supposed to go into your hand. It cups your entire hand perfect and feels amazing. The buttons are fully customizable. All in all, this is the best mouse I've ever used and at 40 dollars (retails for 80), its a steal, so buy it.",
        "I sit in front of my PC at work for 8-14 hours a day & my wrist has been killing. I went to CC to try out some mice and this was by far the nicest, but very expensive. Jumped on Amazon and found this mouse at a great price and bought it. I was a little leary about it being wireless, but it has worked flawlessly. My wrist pay is definitely much less and the mouse performs exactly as I had hoped!! Going to purchase another for my home desktop!!",
        "As mice go, this one aggravates my carpal tunnel the least. I tried some of the joy stick looking ones, and they were awful. This one is similar enough to a \"normal\" mouse that other people who may have to use my computer aren't lost by the mechanism. The tilt is subtle yet steep enough to encourage ergonomic movements. Other wins - Good battery live, decent range, impressive precision.",
        "I have owned and used this mouse for about 1 month. For me it is very comfortable and was easy to get used to. I did not have any wrist problems before buying this and used to use a MS 6000 wireless laser mouse (regular). Looking at other reviews I was worried that it was a hit or miss with respect to comfort. I am 6 ft 3\" and my hands are not overly large but I do have long fingers. For me it fits like a glove.",
        "This is a perfect portable mouse for anyone who has a bit of arthritis, larger hands, or carpal tunnel. It's extremely comfortable to use for hours. I highly recommend.",
        "Pro: comfortable grip, good wrist position, lightweight. Con: extremely short range! Literally, if more than 5 inches away from the receiver, the mouse pointer movement often becomes erratic and jerky, 2 feet away -- loses the signal completely. I haven't seen a worst range from a wireless mouse/product ever, and I've used a couple dozens of different ones over the years.",
        "My product came defective. That is not my complaint -- it could happen to anyone. It took a lot of writing back and forth with customer service reps with few manners to convince them that it was, indeed, defective. I have used a Microsoft ergonometric mouse before. I love the feel in my hand. However, this latest model is so flimsly. Too bad, it's a good product idea.",
        "Got this four years ago and still using it eventhough I'm thinking of a replacement. The batteries last long. I can recall only replacing them about once a year. I love the multiple buttons and customizing for gaming. my only gripe is that clear gel-like substance above the Microsoft wording as seen in the picture has absorb a yellow tint from my thumb.",
        "I'm not as fond of this mouse as I was a previous 6000 model but it's growing on me. Due to the increased height of the mouse it almost forces your hand/wrist into a more relaxed or natural angle, thus less stress on wrist and elbow. It took a bit to get used to but again it's growing on me. I use rechargables in it which don't seem to lose power any faster than throw aways.",
        "This mouse fits my hand really well. My wife likes it, too. It keeps your wrist at the right angle so you won't get carpal tunnel. We had one for about three years that died (actually, the left click button started going out), and we were using a Logitech for awhile, but we missed our old mouse too much, and I just got another one! Very comfortable!",
        "Both my wife and I have hand or wrist problems and this mouse is extremely comfortable and has completely alleviated our hand/wrist pain associated with using a computer mouse. They are also very long lasting. The one I have has lasted for over five years. I got my wife one last year and she loves it! Highly recommended, durable, comfortable, outstanding product!",
        "While very comfortable to use, it's got a bit of a learning curve after having used standard mice for so long, despite it's natural holdability. (I doubt that's a real word) My biggest gripe with the device is how stiff the center button is to depress. I often use this scroll button while browsing, and force it to open links in a new tab. Hopefully it will get more loose with repeated use.",
        "To make this short and to the point. This is a great mouse aside from two flaws. The ergonomics are great. It definitely helps out with wrist pain. I have no pain now since I started using it. Flaws: As others have mentioned, the wireless range is pretty short and it seems to work a lot better with line of sight. Eats through AA batteries. Started using rechargeables to solve that issue.",
        "I've been using this mouse since it came out. It's extremely comfortable, the battery life is decent (several months, at least), and I've yet to really have an issue with it. The gel thumb-grip became discolored after a while. I contacted Microsoft directly, and they just sent me a new mouse. Great customer service!",
        "As an RSI sufferer, I have been trying different mice and keyboards to find the right combo. I recently purchased this mouse along with the Microsoft Natural Ergo Keyboard 4000, and after several days of use my RSI has disappeared. What makes this mouse special is the way it tilts your hand to the right and takes pressure off the wrist. I use it along with a Fellowes gel wristwrest (used as a palmrest in my case), and it works very well. I needed the gelpad to give some elevation in order to keep my wrist straight (this is a fairly tall mouse).",
        "This is the most comfortable mouse I have ever used, and I have used one for many years. It lets you wrist rest at a natural angle and when used with a small wrist support eliminated my wrist pain. Too bad Microsoft got tired of this design. This purchase was for backup units in case one of mine wears out.",
        "It took a little time to get used to the slant of the mouse, but I grew to like it, and any wrist and finger pain I suffered is a thing of the past. However, this mouse is terrible using it on any surface. The tracking is choppy, and very, very inexact for pointing and selecting - it is driving me nuts. I had always used Logitech mice, which scroll, point and track very smoothly. I am very sorry I purchased this mouse. I plan to replace it with a Logitech. Unfortunately, I waited too long, and cannot return it.",
        "Perfect for my hand. I would recommend this mouse for anyone who would be using a computer in a day-to-day basis. In fact, I bought this one as a backup to my current mouse which is of the same model. This thing goes away fast so I bought the second one to keep.",
        "I work as software engineer so I have to spend hours and hours working on the computer at some point I was starting to get problems with my carpal tunel so started to worry and got this product recommended a few days after I started using this product everything went away, it's a bid odd to get used to the way of using this mouse but once you do you can't go back to others, I am not a fan of microsoft at all (software) but with this one I gotta say they did a great job, if you work a lot on the computer and care about yourself get this product now.",
        "It is a definite improvement over a standard mouse, but not dramatic enough for you if you are already beginning to feel discomfort in your wrist. I would recommend this mouse to someone who uses a computer alot and wants to prevent discomfort issues, but if you are already to the point of your wrist hurting I suggest a more radical mouse. Pro: takes little to no time to get used to Con: not dramatically different enough from a regular mouse to be of benefit if your wrist already hurts.",
        "This mouse worked well for getting rid of my sore wrist and I have no complaints about it. The only reason I'm giving it 3 stars is because I just couldn't get used to it. I would need to use this mouse everywhere, and I didn't want to buy 3 of them.",
        "Stopped working after awhile the scroller was sticking.It lasted for a long time tho.",
        "Item delivered on time, was as described, great customer service. I would Definitely buy again and I would recommend to my friends",
        "My co-worker was looking for a mouse to relieve some strain from their hands and wrists. It is designed in a way to help in their situation. I'm not sure it will fit as comfortably for very large hands but if you wear a Medium or Large glove it helps.",
        "I bought this as a replacement for a smaller notebook mouse that failed. I have a larger hand and my wrist always hurt with prolonged use on the smaller notebook mouse. Since using this mouse I have had no pain in my wrist and it is very comfortable and allows for a longer usable time.",
        "My doctor told me I had tendonitis from a non-ergonomic work space. I bought this mouse and it helps to keep the hand at a more natural angle. It takes getting used to (it's a very different mouse from the mighty mouse i am used to). But I've been using it for less than a week and already I'm comfortable with it. Also, I work on a Mac with Snow Leopard and it works with no problem. I didn't have to load software or anything, just plug it in and go. I recommend this mouse if you are having wrist pain from using the computer.",
        "After trying it in the store, I just had to get this. My coworkers can't seem to get used to it but it seemed natural within the first 30 seconds. I can't go back to regular mice. Only ding is that after a year, the gel under the thumb rest bubbles and looks odd. Doesn't affect comfort or functionality.",
        "I bought this thinking it would be a more ergonomic mouse to use with my laptop and carry around (I didn't care about the large size). I didn't even use it because it comes with a huge corded USB dongle for communication - not a tiny one like most wireless mice these days. This is intended for a permanent desktop install where people don't mind an extra mouse-size corded dongle sitting on the desktop.",
        "Although the typing is a bit noisy this keyboard is extremely comfortable and within a short period of time the pain that I had been experiencing in my wrist was gone. Best thing I could have done. I haven't tried many other keyboards like this but I'm very pleased with this product.",
        "One of the most enjoyable \"mousie\" experiences you can have. The tactile response to this device is almost consciousness inducing freedom.",
        "I have used a logitech trackball for 14 years, so it is difficult for me to make the transition to this mouse. I like feel of it in my hand, but not as much as i like my trackball. There were no instructions in the package, so maybe i am not using it to its capabilities? until i do, i will stick with my Logitech trackball.",
        "If you use the middle mouse button a lot you will find this mouse discouraging. The middle mouse button is significantly harder to push and spin than my Logitech. If this is not an issue for you then this mouse is nice. Cheers, Vin",
        "was having some serious problems with wrist fatigue and pain and this has really helped over the last 3-4 months. am using this in combination with a tilted mouse pad to get a much more upright hand posture.",
        "This mouse is wonderful if you spend a lot of time using your mouse. I am a typist and type 6-8 hours a day and use my mouse quite often. The mouse allows you to position your hand in a very natural position when you are using it. I had tendinitis in my right wrist (my mouse holding hand,)and this mouse completely relieved all symptoms within a very short time. The mouse is large, but it's large size is well worth it's comfort-offering features. I would recommend this mouse very highly.",
        "A little brief: Pros: -Beautiful -Elegant -Good position of my wrist -Perfect size Cons: - The reciver is very big - The software for magnification image have problems whith AUTOCAD 2009 and i have to uninstal - The scroll is very rugged and hard",
        "Have used this type for over 10 years. No more Carpal Tunnel. This is a very high mouse. There are others that look like it but are lower.",
        "I was under the impression this had a small USB input. It has a large sized mouse reciever that is obstrusive. I have small hands and found the size of this very hard to use. It was not comfortable at all.",
        "I have been using this mouse now for several weeks and I LOVE IT. The shape is much better for my hands. A lot more comfortable to work with. I have worked as a computer programmer for many years. I spend 6 - 8 hours on the computer. My hands and arms would just ached at the end of the day. I purchased this mouse along with a microsoft egonomical keyboard. I would highly recommend this mouse.",
        "My only real problem with it is that its dongle is very large, making it inconvenient to carry around. It's mouse wheel isn't so great either (it's not clicky or smooth, just kind of... slow, and overly resistive). My wrist does feel more comfortable using it.",
        "I bought the wireless keyboard and mouse set initially, but could not handle the delay with the keyboard... So I bought the wired keyboard, and ordered the wireless mouse. Everything is working great! The mouse is a good shape, size, and weight. Very satisfied!",
        "I've found this mouse really helps when working long hours - the orientation of the wrist for this is much more natural. it would only suit a larger hand as it is a large mouse and it does have an old style bulky transmitter compared to other laser mice like Logitech Vx Nano mouse so I've rated it at 4 stars.",
        "This is a great mouse. The only problem I have is that I accidentally hit the magnify button on the side. That gets a little annoying but it is easy to click off. It has really helped my carpel tunnel problem.",
        "The only thing I don't like is that they don't offer a wired version. The mouse is so big I keep knocking it onto the floor. Update 4 August 2008: I've been having problems with the scroll wheel. Sometimes it doesn't want to scroll, other times it does, or the sensitivity is weird. Maybe it's because it has fallen many times to the floor. I don't know.",
        "I love using the this mouse. I actually have 2 in use every day, one at home and one at the office. I love the ergonomics of this mouse. No more wrist pain and it fits my big hand great. Just wish this mouse weren't getting harder to find.",
        "Great ergonomic mouse. Drives my RAM-hungry software. Relieves tension in my hand...Best mouse I've ever used.",
        "I bought this mouse because regular ones hurt my wrist. It's a great mouse and cuts down drastically on the stress on my wrist while using the computer. It does go through batteries every 3 months give or take but I think it's worth it.",
        "Have two and am delighted with them. A pity Microsoft seems to no longer make them.",
        "I bought this mouse because I'd been diagnosed with mild carpel tunnel syndrome. The mouse makes a world of difference, and my pain has gone away. Mouse is a quite large, and \"thumb\" buttons are difficult to use if you have smallish hands. I think it's designed for a man with larger hands than I have. However, even so, I'm really very happy with this product.",
        "Great mouse if you're having pain in the wrists or shoulders...I paired it with the Microsoft Natural Ergonomic Keyboard 4000 and I am pain-free even after hours of typing.",
        "If you get wrist/elbow/shoulder pain from using a normal mouse try this Microsoft Natural mouse. It helps alleviate the pain that I was feeling cause it lets your hand rest in a more natural positing putting less tension on the main veins that run through the inside center of your wrist. The wireless freedom is a must but the receiver is one of those huge old school ones.",
        "Best mouse i have ever used. This is a right handed mouse and i am left handed but have not had any problems useing it. I even take it to work with me!!",
        "This mouse is fantastic. While the wireless feature is becoming fairly standard, its ergonomic shape is without parallel. I work all day on my computer, and using this in conjunction with an ergonomic keyboard means that my hands never hurt at the end of the day. If you use your computer for several hours each day, ergonomic products are well worth your money. You will be impressed.",
        "This is a very nice mouse. Seems a little large setting on the desktop, but the feel is very good. Your hand lays comfortably and the buttons are about right.",
        "This is the World's GREATEST mouse. Feels great,easy to use,long battery life.Has many extras and anyone can use it with ease.",
        "this is my 4th wireless mouse and while it took a bit to get use to by way of grip, it very comfortable to work with .. i love it.",
        "Although this mouse isn't the top of the line gaming mouse, or the highest dpi mouse, or what have you. This is the best mouse I've ever owned. I'm a power user, I play MMO's, FPS's, and RTS's, and this mouse has done the job for everything. I originally bought this mouse back in 2007, and it has lasted me to this very day. It is the only mouse I trust to work well, and to be durable. This is a great mouse.",
        "This large mouse is a must for people with RA. It cradles the hand so that I don't have cramping. My only reservation is that it doesn't have a off switch to help save the batteries.",
        "I placed two separate orders at two units each. These are the best mice I've ever used. Ergonomics and function are without equal in my experience. I was very lucky to find these as they are no longer being produced. I could only give the supplier three stars as one of the mice came with the box broken open, and some sort of dust or debris on the mouse. This unit should have been listed at a reduced price and marked clearly as Open Box and discounted as such.",
        "The mouse was awkward at first but is a lot easier on your wrist once you get used to it. The center click is harder to push than most mice. The Magnifier and Instant Viewer features are nice. This mouse is more comfortable than the traditional design but there is room for improvement.",
        "Generally a very well performing mouse. Very responsive and precise but uncomfortable as the side buttons are too far back. My hands are just medium male size - I find that I have to lift my hand off the mouse to use the side buttons in reality that makes the mouse a real pain to use. What could they been thinking of when they designed the location of the side buttons.",
        "These are really great mice. Fits a right handed person very well. Buttons are perfect fit. Batteries last a long time.",
        "Perfect for Age of Empires, Starcraft, Warcraft, or any other long term RTS playing because your hand wont get cramped.",
        "Excellent product. The ergonomic design takes about a day or two to get used to, but after you do you will never use a mouse the same way again.",
        "Something about it causes the batteries to drain very quickly. We are changing them every week, this can add up quickly with the price of batteries these days. We are going to get a wired one instead and retire the wireless one all together.",
        "I purchased the mouse because I thought it would reduce the strain (carpal tunnel?)on my wrist. It did not, however help me with that problem. I returned the unit and have been told that a credit is in the process. The mouse worked well, but did not do what I bought it for.",
        "I am VERY plesed with this wireless mouse. I have tried them all and find this is the BEST.",
        "I have larger than normal hands, and have to use a mouse for 8 hours a day or more sometimes. After using several other mice, all which caused hand and wrist pain, I tried out this mouse with great results. The pain in my pinky and ring fingers went away, as well as in my wrists. I have also recommended this mouse to 2 other people who both have loved it.",
        "CONFORTABLE, ERGONOMIC!!! ALL MY FRIENDS ASK ME ABOUT IT BECAUSE THEY WANT A SIMILAR ONE!!!",
        "just like what the reviewer below says - left click fails. its been good only for two years. just like what the reviewer below says - left click fails. its been good only for two years.",
        "this mouse is the best. it is easy to use, responds great, and is 100% better for my carpal tunnel. i bought several expensive mouses before finding this one. i love it!",
        "The mouse is way too big for small hands, if you're petite then DO Not buy this mouse, it is way too heavy for a small hand, it is noisy and not easy to adapt to its shape, it takes some time. This mouse is so heavy and big, that should be marketed for men only... I got rid of the box so I couldn't return it, otherwise I'd would.",
        "the mouse worked as described in the ad. however the wireless receiver was broken luckily I had another one.",
        "It might take a little to adjust your hand to it but then will be like you are one thing!",
        "I bought this mouse because I needed an ergonomic mouse it was a great price. I have been using at work and I have noticed a significant decrease in the the pain in my arm and shoulder. I recommend this mouse especially if you are on a budget.",
        "This is the most comfortable mouse to use and it has all the extra buttons I'll ever need.",
        "My hand always cramps from hours and hours of mouse use except with this mouse. I have one at home and one at work. I will never use another mouse.",
        "The package seal had been broken and the item had been, \"Re-Packed.\" There wasn't evidence of damage or usage, but it was not brand new (as the vendor stated). I still use it because there are very few of these available any more.",
        "microsoft must increase the sensibility on this mouse because it's feel a little beat slow even adjusting the software speed. i tried the version Wireless Laser Mouse 6000 V2.0 and it's really impresive.",
        "This mouse is one of the best mice I have ever used! It has a wonderful easy-of-use and fits perfectly for the countless hours that I spend on the computer. Love it!",
        "Not very comfortable to hold in hands. Laser sensor is so-so.",
        "my carpel pain went away within a couple weeks, but i use XP, probably SP3, and even though i keep the pickup less than 6 inches away, the mouse sticks as you pan around the screen making it incredibly annoying and i am thinking that i need to look for another one before i go crazy.",
        "After a couple of months with it, I am very pleased with every function except one - the select of the scroll wheel. It it rather finicky and seldom works.",
        "My wrist never felt so good after a 6 hr. run on line gaming, great product",
        "Overall this is a good and comfortable wireless mouse. The main problem is that it requires a very large transmitter/receiver to be attached via cable to the computer to operate. Most modern day wireless mice use an easily transportable USB wireless adapter that does not require cabling.",
        "I hated this product. A mouse is only as good as it responsiveness and usability. I felt that I was physically dragging the pointer around the screen. Would not recommend to anyone!",
        "Mine worked for a year or two and then stopped working. I tried changing batteries, rebooting, etc. I liked it, but it should have lasted much longer than it did.",
        "This item was delivered extremely fast. It works fine and I really like it. The only drawback with this supplier is that item was not brand new, although it is in very good condition.",
        "this is a fantastic mouse, it fits in your hand perfectly and is wireless, which I love :) recieved product right away. I will look forward to doing business in the future :)",
        "The shape of this mouse is very unique. Its almost like a tennis ball. It allows you to hold your hand and wrist at a much more comfortable angle. It feels very natural in your hand. The software that comes with it is easy to use and configure, and it allows you to customize what each button does. I am an IT professional and I have installed several of these for my clients that have arthritis or carpal tunnel. Everyone loves them. Highly recommended."
    ]
}