{
    "entity": "Mice",
    "text": [
        "I love this mouse. It's an absolute workhouse - lots of options that even work with Mac and comfortable. I've been using it for probably a decade. My only issue is the USB receiver that goes into the computer is about two inches long so if you're using it with a laptop you move around you have to unplug and plug it in again. Also it's an old style, so one USB port will be used for this mouse and nothing else. But the performance is fantastic.",
        "I bought it 3 years ago and still love it. I've never found another mouse with buttons as functional or in the right places like this mouse. I use recharable batteries and have to charge them every 3 months or so. That's with 8hr/day of use. I don't use a mouse pad and the only problem I've ever had was the mouse sometimes gets confused when used on tables with wooden patterns (like a mahogany, etc table). So, I just used a piece of paper as a mouse pad. I've noticed those tables confuse all optical and laser mouse. Only ball mouse work on them, but who wants a ball mouse anymore?",
        "I love this mouse because you can change volume, next track or back track, and you can set the buttons to whatever you feel like. Its great for playing games and just chilling and relaxing. Only thing I didn't like about this mouse was the plastic around the lower side. A lot of the newer mice out there dont have this hard plastic on bottom, they have some cushion or something for your thumb to rest on. Otherwise, this is a great product!",
        "it's an old mouse, and doesn't run on 2.4GHz (so it doesn't' have the range). That said, it makes a good portable mouse. I wouldn't spend more than $10-$15 on it though.",
        "The mouse is awesome. It looks cool, the range is also unbelieveable. The only drawback is it doesn't support all media programs. I like to use Dell Media Experience but it's not fully supported. The video just won't pause when I click the play/pause button. Actually, the Dell Media Experience and Logitech's media life are all from CyberLink, but Dell Media Experience looks a lot better.",
        "I've used Logitech items for years particularly this mouse works great with all versions of the SetPoint software as long as you get it from Logitech's web site. I also have other mice and Keyboards from Logitech and Cameras and I've never had any issues with their products. I bought a second MediaMouse to replace the one I have it seams after 5 years of use the left-click button is going out on it (seems to double click when I hold it in) but other then that it's been a GREAT mouse...",
        "I had the problem with the cursor jumping around or not moving along one axis intermittently. Driver upgrade helped but did not eliminate the problem. I exchanged it and the new mouse works perfectly! So if you have these problems, it's not you or your PC. Just exchange it for a new one.",
        "I have owned this mouse for over 5 years now and love it. I've never had a better mouse no matter how expensive. This mouse is worth every penny.",
        "everything is ok, i offer this mouse to everybody. long range, no interference, good looking... i love logitech, i love amazon...",
        "This is the best mouse ever, they do not make them any more! This one turned up with the wireless usb dongle so was useless.",
        "I have had one of these mice for at least 3 years and love it. If mine dies I will be buying another. I bought this unit for my mother who wanted it for media control so she could control media playback from her computer from some distance. It is working great for her too. Features I love: -Long battery life on NiMH rechargeables -The media controls (play/pause, skip next, skip back, FF, REV, volume control) -The internet browser forward and back buttons -Range for mouse operations (<10 ft) -Range for media only operations (<30 ft) -Well shaped to fit in hand as mouse and as remote -4D scroll wheel Cons: -transmission range does decrease with unit age",
        "I had this mouse for years. Bought it for 40-50 bucks a long time ago. Loved it. I really love having the volume control so easily at my fingertips, and the symmetrical design is perfect as I hate the funky fancy shapes that some mice have. I was very sad when the LED burned out on mine recently and I find they now cost a heck of a lot more. I want another one so bad but I don't know if I can afford the price on Amazon! Why, Logitech, why? Dangit I loved that mouse!",
        "I would probably be the true test to a mouse being i use it constantly in an emergency communications center. It has been my go to mouse and prize possession since purchased in 2004.. i believe i bought it from a display when they literally were first put on the floor at CompUSA. I use the mouse literally 8 hours a day or more for the past 10 years. clicks are probably in the millions. batteries lasts about 2 months but i am a power user. Hands down best ever and should be made current by Logitech",
        "What can I say that hasn't been said already? This is a great mouse. It's very comfortable. Though I don't use the multimedia controls often, having them at hand is extremely convenient. What I love best is the range. I like being able to push away from my desk, mouse in hand, and control media applications... I've been using my particular mouse for a year and a half at least. Since purchasing it I've bought one for my brother-in-law and two for other coworkers in my office. You can't go wrong by purchasing this mouse.",
        "This is the only mouse I found for a laptop that had back and forward buttons and was wireless. I also enjoy the fact that the batteries are user-replaceable, which I personally prefer. I have not gotten around to using all of its media functions however, and, like all Logitech products, has a fairly weak and clunky software. However, if you don't install the software it is actually quite nice (though, to my knowledge you can't use the media functions without it).",
        "This mouse is perfect. Plenty of programmable buttons, a scroll wheel that doesn't skip, strong signal strength... I can't understand why Logitech stopped making this. It would have made more sense if instead they made all of their other models more like this one. I bought a few of these once I heard they were discontinuing it, so I should be okay for at least another 10 years. Yes that's crazy, but it really is that good.",
        "I just bought this mouse and yes the thing works as advertised! It's nice and accurate, the media buttons work for Windows Media and iTunes, and it's a nice ergnomic design! Installation was a snap! I would have kept it but I usually dont use my PC for entertainment and so the buttons aren't for me in my situation. But if you use your PC for all your tunes, then this mouse may be just what you need. ALoha!!",
        "This mouse is great! Not only is it cordless, it has all windows media controls, including volume and forward/backward buttons for internet browsing. There is a small device that plugs into your usb port and an on/off and reset switch on the bottom of the mouse. And thats all there is to it! It has decent range and is so easy to use. It should be your top choice when purchasing a wireless mouse!",
        "This is one of the best mice I have ever used. Much faster than MX500, very convenient for Laptop owners, comes with a USB key, connect that key to your USB port and you'll in business. If the mouse is away from Laptop, tauchpad takes over without any interaction/config. change. Weight is reasonable and I am still on original batteries.",
        "I personally really like this mouse.It has a nice feel to it,the responsiveness feels just right to me not too much or too little it's also real nice not to have the wire accross the keyboard.I hope you never stop making this model,I know sometimes companies will discontinue an older model when they come out with a new one,but like I said I really like this one just the way it is.Based on my experiencnce so far I would definitly buy other prducts of yours,also the customer service from amazon has been excellent.Thank you keep up the good work.Bill",
        "I really like this mouse..I've had it for 3 months. The things that I like most about it are 1. The media buttons can be used just like a remote. Many (but not all) music programs are compatible. You can skip through tracks or change the volume instantly 2. Battery-life seems excellent 3. Scrolling is excellent, very accurate on almost any surface 4. Mouse feels very comfortable when navigating the cursor or when using as a remote. The only negative thing is that it is a bit large...but comfort would be sacrificed if it was made smaller. Also, is a bit heavy. Still portable. Would definitely buy again!",
        "This is the best Mouse for music, has next , back songs and web buttons. Works with windows media player or Itunes. whatever you have open. the led lights look great and battery life is very good, just keep a spare pack of rechargeable batteries near by. and you are set to go",
        "I have always used Logitech mouses but this one is driving me insane. After reviewing all the other reviews I am the 3rd person to have the same problem. Erratic mouse behavior and the volume increases spontaneously! Logitech site suggested that I don't connect through usb but even using the traditional mouse plug it still does the same thing.",
        "I've had this mouse for over 13 years now, and it still has kept up with technology and I can't find a better mouse than this, especially one with volume buttons right there at you fingertips. I just keep my Setpoint software updated, and I run it on Windows 7 with an I7 gaming setup. I cannot express my love for this product....I guess that's why they're still selling for around $140 for a new and above $90 for a used one. This product made me a Logitech lover, and I'm still loving it",
        "It was ahead of it's time with media-specific buttons for HTPC's, but this mouse was excellent. One of the most comfortable mice I've ever used. I wish Logitech would bring it back.",
        "I bought this mouse to replace an aging wireless Microsoft Mouse Optical. It is nicely shaped but it scans poorly. My wife and I have had problems with the cursor jumping several cm up the screen so that we click on unintended objects. Different surfaces do not improve matters, including a high tech mouse pad. I have changed back to my old mouse. This is not the first time I have had a bad experience with Logitech mice, despite what others have written.",
        "I have had this mouse on my computer since 2004, and I truly love it. I have had many mice in the past, products from other companies like Microsoft and Belkin, and nothing is better than Logitech. I would recomend this mouse, works great with any media program like Rhapsody, iTunes, or anything else...wonderful!",
        "I had this mouse for 3 years. I broke the USB that makes the mouse go wireless but I love this mouse and I can't give up. Doesn't anyone know if I can buy only the USB I sat one and broke it. I still have the mouse.",
        "The buttons of the mouse are really awkward. You have to push hard. Your fingers will suffer fatigue quickly...",
        "I would have to say that his mouse is amazing. The only problem I have with it is that it didn't come with a charger (I am sure there is a more expensive version that has a charger). For the price I paid for it, it is definitely worth every penny. Buy it!!!!",
        "It works fine. Extra buttons prove very useful with Dell 700m fully portable which has no media keys. Batteries last long, no need for rechargeables. Transmitter is very small, easy to carry. I use an MX1000 with my desktop, but get soon used to the MediaPlay Cordless when change to the laptop.",
        "I'm sure this mouse would be great if you are right-handed, but not for lefties. For one, the mouse does not support left-handed capabilities. You can't even swap the click buttons. Left-handed people should stay away from this mouse. Is it too much to ask for mice that support left-handers and have some extra buttons like the right-handers have?",
        "i like the classic logictec mouse feel, with all the buttons straight ahead. this one feels funny since its crimped in the middle (the casing). old style mouse users beware, this is not your classic mouse with new features and buttons.",
        "Amazon shipped me a used one of these mice, it didn't work right so I shipped it back and the replacement they sent was also used. The second one worked ok but it was only a matter of minutes till my hand/wrist hurt because of the bad ergonomics. The batteries are in the back of the mouse near the \"butt\" of the mouse which makes the mouse feel imbalanced when you pick it up. As if that wasn't enough of a reason to avoid buying this mouse the pointer stops moving or jumps across the screen so frequently that I couldn't stand it and quickly returned the mouse for a refund. Consider yourself warned, don't buy it.",
        "This baby has worked well from day one. It has a nice range, good batt life, and works on Windows and Mac. I don't know what else I could ask for?",
        "The mouse is great most of the time. However, it seems to occasionally it stops moving on an axis. It happens in both the x and y direction randomly. It is not a receiver problem either, it happens no matter how i place the receiver.",
        "This is a great mouse with a good amount of buttons. However, I would like this mouse slightly more if all of the buttons on it were programmable, not just most of them.",
        "Awesome mouse, never had any issues with it. Liked it so much I bought a second one.",
        "I got mouse. Decided to test it for a week. I love media buttons, also forward and backward buttons make reading web pages comfortable. Mouse is light, looks great. BUT ! - Device is ergonomicly so wrong - I couldn'd believe. You have a hard time presing left and right button. You can not pick up mouse - because is slim in the midle. Mouse is not balanced - so when you pick it up - back go down. Just Terrible. I am waiting for hybrid of previous version of mouse and current one. For now I recommend NOT BUY IT.",
        "Powerfully convenient and comfortable. Well orchestrated availability and delivery. A great product for all."
    ]
}