{
    "entity": "Mice",
    "text": [
        "Works perfectly, pads on the bottom are hard plastic so they don't tear, come unstuck, or other crap, and they slide better than any other mouse I've had. Having the equivalent of 10 buttons (left+right click, side button, resolution up+down (if you change the settings in Logitech utility so they're not bound to resolution change), scroll wheel left+right+up+down+ scroll click) in games is great. The cord is wrapped in nylon so it doesn't won't get twisted and bent and break the wires inside. Nice and heavy with the weight discs in, and doesn't glow in the dark at night so I can sleep! (No red glare coming from my desk when I leave my computer on) Great mouse.",
        "I use Photoshop keyboard shortcuts in my job. I've programmed five of them into this versatile mouse: I accept the defaults of most dialog boxes with \"Enter\" or complete a lasso selection (thumb button), nudge the scroll wheel left for \"b\" (brush tool), right to swap foreground/background colors (x), use another button to select the Lasso tool (l) and the one below that to de-select my selection (Control/Command-d). I've added soft plastic bumpers to my [ and ] keys on my keyboard for increasing/decreasing brush size/hardness by touch (I don't have to glance at the keyboard). This mouse has really increased my Photoshop efficiency.",
        "Did not come with the Adjustable weights it was stuffed in a box no Logitech packaging not what was pictured scam and a ripoff as the pic shows its dirty and cob webs in the roller do not buy, its shipped from OMJAMT not Logitech And did not get a full refund ( Bait and Switch )",
        "This mouse is really nice. The laser tracks well, the mouse feels good, the speed is incredible and Amazon's price was the best on the market. My favorite feature is the ability to change the dpi setting. Slow for using the scope up to fast for using a tank turret. The programmable buttons are easy to use and well-placed. The extra thumb button is programmed to \"hit-the-dirt\" so now I don't get shot as often. Logitech makes a great sturdy product. I've been using them for years and they've never failed me. If you don't game, don't bother with this mouse. It'll be more then you need.",
        "I bought this for low end gaming. Mostly my problem was trying to play games with a wireless mouse. This one is wired and I think all gaming mice should be. I am not a high end gamer because I do not have particularly great coordination or tactile sensitivity, so the weight balancing aspect is completely lost on me. The best aspect for me is being able to adjust the motion sensitivity to one of 5 settings, depending on what I am working on: lower sensitivity for spreadsheet and database work; higher sensitivity for photo work and what games I do play.",
        "My older logitechs were fine for general use but fell short on gaming. I've reached a skill level now where precision is key to making the shot as it were. My 510 was a bit jumpy and too light. I went to the G5 and was not disappointed. The weights help in controling the precision movement needed for sniper shots and the laser is fantastically smooth and accurate. I still wish it was bigger to fit my hand better without parts of my hand rubbing the mouse pad but that's life. Don't forget to get a smooth and monolithic mouse pad for best performance.",
        "I've only had this mouse for 24 hours but I can tell you that for CS1.6, Czero or CS:S, if you don't have this mouse you might as well not have one at all. What I thought were registry problems between my PC and servers on which I played turned out to be tracking and precision problems with my $17 microsoft optical mouse. The G5 is limitless in its sensitivity and weight customizations and has notibly improved my play in the short time I've had it. However, the shape and size of the mouse is a bit awkward for my hands and I foresee cramping issues in the near future before my hand gets used to it. -PS \"waltzing matilda\"",
        "I really love this mouse! Fast tracking and adjustable sensitivity level. I didn't care too much about the weight adjustment idea. I like to keep my mouse as light as possible to move around quickly. This is why I don't believe the wireless mouse for gaming since the batteries weight a ton! So gamers, forget about the G7 wireless version of this! I played quite a bit of Counter Strike. This mouse definitely enhanced my playing! Can't go back to regular optical mouse once got addicted to this mouse!",
        "This mouse is extremely responsive, having the 2000dpi engine onboard. The layout is smart, and I never accidentally press the sensitivity buttons. My only qualm is the scroll wheel's left and right buttons. They're a bit of a hassle. Other than that, I love this thing to death. It works on many surfaces, and is very nice for photoshop - where you need very fluid mouse movements. It is made to be tough, I couldn't break it if I tried. I'd recommend to everyone I know!",
        "I thought my dual optical logitech was good, but this thing beats it by a mile. It is extremely precise and the DPI changing feature is pretty unique. I am an avid gamer, but honestly, I have rarely changed the weights cause its just too cumbersome. I've stuck with the same amount of weights I had in there when I installed it. I'm really impressed with the cord of the mouse, its not that lame plastic thing that i've seen on other logitech mice, its a nice tough twist resistant wire.",
        "If you're a righty, you'll love this mouse. The precision is very good and being able to switch on the fly is great when gaming or even when you happen to find yourself in limited mouse space. The weight cartridge which allows you to change the heft of the mouse is nice as well. Being \"heavy-handed\", it's nice to be able to feel the mouse under my hand. I think Logitech could have added a few more buttons but otherwise a very good piece of hardware as ususal.",
        "Still use this mouse to this day. Got it as a gaming mouse years ago and loved that it had interchangeable weights. Still use the mouse to this day and I still love it. I don't do much gaming anymore but it's a very accurate and comfortable work mouse.",
        "While I do play games, I try to avoid producs tagged as \"For Gamers\" as they usually have a price tax just for the \"Gamers\" tag. However I wanted a nice mouse, and this is. Very confortable, feels very nice on the hand, the buttons have just the perfect click as does the wheel. I dont use the DPI switch, but it dont stays in the middle of get pressed by accident, so its ok. The thing with the weights..come on..not needed..but very impressive, no one I know around have a mouse with an eject button on it. Be the first one in your block ;-)",
        "I really like this mouse, the ability to add weight to it makes it feel really good in my hand. I don't use this item for gaming, but everyday computing. The selectable resolution is great for photo editing. The only thing I think Logitech could do better is make the weight cartridge a little more secure, it tends to come out easily if you pack the mouse up with a laptop(like I do).",
        "The precision of this mouse is amazing. The only complaint I have about it is it's lack of buttons. I play City of Heroes/Villains and WoW, and use the side buttons constantly in these games, but this mouse only has one, which is it's major downfall. I miss that extra button a lot in the games. For other uses, though, it is great. I gave it a 4 for the lack of at least one more button.",
        "I've had this mouse for over ten years, and it's working perfectly",
        "I love this mouse! It's able to switch between three levels of preset dpi allowing you to go as quickly or as slowly as you need to at the touch of a button. Also handy is that it comes with interchangeable weights that really give you the opportunity to customize it to your liking. I use it with gaming and in the creation of digital artwork and it performs very well in both. Installing the software is optional, but it allows you to alter your preset dpi levels to better fine tune it.",
        "I have been using this as my main mouse for years now. It is solid and works on about any surface. It comes with weights, but I don't really use them. It is very accurate for anything intricate like Photoshop or lining up the cross-hairs of your sniper riffle. I would definitely buy this again.",
        "Wow...its 2014 and I did not realize that I have been using this mouse for seven years. It is comfortable, accurate, dependable, and if you can find one on ebay or something, buy it. I doubt they make these anymore.",
        "I like the ability to add/remove weight, and the precision of the tracking. I do think, for the price you pay, that it should have another thumb button(forward & back thumb button, instead of just the back button), and maybe even a button on the right(pinky) side of the mouse. Otherwise, great mouse!",
        "This mouse has a nice feel, the weights in it are adjustable so you can make it slide around however fast you would like. The adjustable sensitivity is kinda neat. I mainly purchased it because I was tired of replacing my other mouse's AA batteries every month or two, and wanted a wired mouse. This was on sale here so I bought it. Only con so far - it's still expensive for a mouse even with the sale, unless you're looking for a gaming mouse, then it's reasonable.",
        "- It has extremely High precision (which is a must have for vector drawing apps); - The buttons for increasing or decreasing the precision is a nice touch for FPS games; - The interchangeable weights actually help to increase the user comfort; - It has a long cord which is a good thing for someone that hates laser cordless mice that run out of battery every few days. - Perfect ergonomics; - Great design; - Extremely high quality built.",
        "This mouse feels right in your hands. The materials it's made of are durable, and help to alleviate natural problems like sweaty hands. The rubber grips are nice. The mouse is extremely precise when the dpi is turned up. My only gripe is that there the Logitech control panel doesn't work with OS X, and third party utilities are required to make the most of this mouse.",
        "Reliable mouse for gaming. This was bought for my teenager who plays online games. He tried the cordless but came back to this one because of its reliability. It is a quality mouse with weights included to adjust to his preference.",
        "I've been using this for 3 years now and it still works perfectly. I wish they still made them in this color combination, that blue one they switched to looks sad. I don't know what to get when this dies.",
        "I have gone through countless mouses in the past. This is the best one I have ever owned. If you are like me and spend 10-12 hours in front of the computer per day doing everything like work, games and graphics, this mouse is worth every penny.",
        "very good mouse and not just for gaming. I have 1920x1080 screen res. so precision of that mouse is really matter. If you use less then 1024x768 res you might not see any difference, but if you have more then you will see that difference right a way.",
        "This was an excellent mouse that worked exceptionally well for about 3-4 years until it died. I gave it 4 stars because it died.",
        "This is the best mouse I have bought in my 20 odd years of owning computers. It has a great feel, the weights that come with it are an awesome feature and the movement is perfect. It works perfectly in Linux too. The only gripe I would have is the cord could be another 5 inches long.",
        "Bought the mouse for my wife to use with her favorite game. Works very well, installed easily. Did not use the advanced features as the default setup worked quite well.",
        "This has been the best corded gaming mouse ever. The adjustable weights helps in controlling the mouse. The laser tracking is flawless. You just can't go wrong with this product.",
        "Pros: the mouse looks great. The grip is exceptional. While the weights are not that functional, they are pretty cool. And just about everything else is great. Cons: the only real bummer about this mouse is that the scroll wheel is choppy. It does not have the smooth scroll with the quick buzz sound you would expect. Instead it is choppy and makes a deep \"grut.grut.grut\" sound. Other than that i have no complaints",
        "I debated and debated... So many of my younger friends told me this mouse was good. So I finally tried it out. The differnt speeds made it fun. Not to mention the weights that come with it to give you that custom feel. Great mouse.",
        "This mouse has never missed a beat! The weighting system works well and lets me fine tune the mouse to my liking. I don't mind the cord and this way I don't have to recharge it.",
        "Love the \"back feature\" to back up the webpage. Can be adjusted to different weights for your convience. Husband loves it for gaming.",
        "This thing is still going strong after 7 years of continuous use, including heavy MMO playing. Balance and feel are great.",
        "This is the best mouse I have ever used. No comparison. The tracking is perfect for games, and I can set the weight. most a to light for good sensitivity.",
        "Great mouse, until eventually the scroll wheel started to work on it's own. But that was after over a year of regular use.",
        "This was a great mouse for about 3 months until erratic behavior. Either playing games or daily activities, my G5 has resorted to freezing and resetting itself every 30 mins or so. Logitech support is very lacking and they can only tell you to update the firmware and setpoint software. By the way, neither has cured the problem.",
        "Nothing better for 1st person gaming with the sensitivity adjust on the mouse and the asjustable weight ...",
        "I was used and not dirty! It works to this day. bought 6 years ago. Still revered as a good gaming mouse.",
        "really perfect mouse for gaming my skills Got better than ever ! great accuracy,fits your hands quickly,softy.",
        "This is a great expensive mouse, the whole \"adding weight\" feature is an interesting but useless feature for me but cool none the less. The mouse has been 100% accurate since the time of purchase (almost a year now). This mouse is truly overkill though, just find a cheaper laser guided mouse if you can or if it even exists. Or just buy this.",
        "The price was great,it came fast,its ,by far,the best mouse for gameing I've ever used.",
        "This mouse is excellent if you are a gamer or even if you want to replace your old mouse is great, with the weights and customizing the dpi sensibility plus laser it makes so very easy to handle. Worth it. The size is a little bit big, but it's ok.",
        "Will not install on a new, fresh, PC with nothing else installed. The first thing I needed to install was mouse & Keyboard. Key board no problem. Setpoint software will not install NO MATTER WHAT! No help from Logitech, did everything in FAQ..... THREE TIMES. WILL NOT INSTALL. I have thrown it away. Installed Razor copperhead in 2.66 min., wasted 6.25 hours and could not get Logitech to work. I have been using PC's since they were invented and never have failed to install anything, software or hardware. Until now. Never owned a keyboard or Mouse that were not Logitech, until now.... I support Razor.... they install, not lockup. They are not trying. Good Luck to you with yours.",
        "Mouse itself is great. But, the driver is giving me fits!",
        "it still works great after 4 years of me slamming it around getting pissed off at Counter Strike!",
        "I only play a few games but it is a very good mouse. It is a good size and it is very smooth.",
        "It's too big for my hands. I guess its because I have small hands.",
        "I bought the mouse and had high expectations. However, I did not think its worth $30 more than a standard mouse. Well, I would not try to buy a gamer mouse again.",
        "This item has more than lived up to my expectations. The multitasks that can be performed with the mouse alone, provide an added convenience to the completion of work products...",
        "This mouse is the jerkiest I've ever used. It is just not possible to actually reach any particular place on the screen because the mouse jumps 10 or more pixels in random directions. I will never buy another logitech mouse."
    ]
}