{
    "entity": "Mice",
    "text": [
        "I love this mouse, and over the years I have bought several of them. Good value for the price: a well-built, well-designed product that works flawlessly. I customized the left-side button command as \"back\" and the wheel button as \"forward (browser)\" -- as a result, browsing on the internet with this mouse is a joy -- click, click, click! UPDATE 2-26-12: After years of using the Microsoft 3000 mouse, I recently switched to the Logitech M305 Wireless Mouse ($17-$20), which I quickly concluded is a much better notebook mouse! In my opinion, wireless is the way to go: However, if a wireless mouse is not your thing, I would definitely recommend the Microsoft 3000.",
        "I have small hands so while others may consider it tiny, for me it is just right. It's very responsive and I do - er, did - a lot of Photoshopping with it. After 14 months, however, the wheel stopped working. I did just buy another one to replace it even though I would have hoped for a longer life span on something I will have to wait until god knows when the Boy Scouts have their next electronics recycling effort to rid myself of this non-working mouse. Amazon customer service suggested I could give calling Microsoft customer service a call. We had a good laugh over that one.",
        "I ordered this mouse because I love the other Microsoft optical mice I have, which are both wireless. Nowhere in the product description does it warn customers that this mouse is about half the size of a normal MS optical mouse. I opened the mouse and didn't even bother using it because it is so absurdly small. I would have to hold my fingers in an awkward claw-like grasp and contort my thumb to be able to use the buttons on this thing. Amazon wanted $8.50 to return it. If you have a child, this mouse might be great. If you are a grown man, do yourself a favor and skip this one.",
        "I far prefer a wired mouse to a wireless one - replacing batteries or recharging them is a drag. This tiny mouse is my preferred mouse for all uses (when at my desktop, or carrying it around with my laptop). Microsoft makes a similar one with a red laser, rather than blue - I like them both. Unfortunately, these are hard to find in stores (wireless mice seem to be dominant). I recommend this product - I really like the small form-factor and find it much more usable than larger mice.",
        "For those who don't want to take up a USB port for a wireless mouse, or who don't want to pay for a Bluetooth mouse, this is a great mouse. It is small, which makes it good for traveling, but it fits my hand perfectly. The cord is long enough for a laptop. I liked it so much that I bought a second one for a second laptop. I don't like most wireless mice, because the batteries fail at the most inconvenient times, especially when traveling. This corded mouse never has that problem.",
        "I'm a medium sized woman with average size hands and this mouse was way too small even for me. It is not ergonomic since you have to cramp your hand just to be able to press the buttons. The wheel is too smooth, it almost feels loose. The buttons feel flimsy and you can feel the springs pop when you release the buttons. Feels really awkward in your hand. I ended up returning mine. Disappointed, since I like the look of this mouse but did not realize until it arrived it was too small and uncomfortable.",
        "I had received a free cordless laptop mouse, and it works great, except it is always running out of power (AAA batteries), so I ordered this mini mouse to replace it and it has been a wonder, works very well and no more batteries (smile) saves me money. So if you want a practical mouse which is small but doesn't seem small, ( I am a large man with large hands and sometimes those smaller mice don't feel right) this mouse feels normal even with its small size it has a big feel and operation. Very happy. Highly recommend. Many thanx",
        "I am lost on my laptop without a mouse. The touch pad supplied with the laptop causes the computer to do weird things, probably because I am not technically up to date. When my 5 year old optical mouse quit I used my Amazon Prime to locate a replacement. I chose Microsoft based on brand recognition. The mouse arrived promptly and installed easily on my laptop. This mouse has the standard right and left buttons, a wheel, and a second wheel on the left to magnify. It has worked flawlessly. I highly recommend it.",
        "I generally use a cordless mouse for my laptop but most airlines consider it in the same category as cell phones and won't allow their use when taking off, flying or landing. This one fits my hand comfortably, does what a mouse is supposed to do and does it very well. The instructions that came with it says the default functions can be changed (left click instead of right click, etc.) but I was happy with it the way it was and didn't bother to change anything.",
        "I got this in case I needed more features than just the touchpad. I use it with my Dell Inspiron and it works just fine. It is much smaller than a regular mouse and is great for packing away in a laptop bag or case. If you want a mouse for your laptop, this one will work fine, but if you are a more frequent user and want a better mouse for a desktop or a laptop, I suggest getting the Logitech MX400. It is a great mouse and I doubt I'll use any other mouse again. Logitech MX400 Mouse:",
        "I use it with my MacBook Pro when I'm not allowed to use bluetooth at work. (I have the Microsoft Wireless Notebook Presenter Mouse 8000 that I use when I am allowed to use bluetooth.) I use USB Overdrive to designate special features to the 4th mouse button (I suppose I wish it had a fifth like my wireless one, but 4 is just fine.) It's a great mouse, comfortable in the hand, and portable. Get one for yourself already!",
        "I purchased this notebook mouse for my new Macbook Air. Although you don't need a mouse with this laptop, there are times that it is useful. I have owned at least four or five Logitec notebook mice previously, and I find they usually only last a year. I find this Microsoft mouse is very precise. It seems smaller than the Logitec notebook mice I have owned. I have a large hand for a woman, and I don't have any problem with it. I would purchase it again.",
        "Comfortable enough for a laptop mouse. Styling is nice. Even though I dislike blue LED's, the blue LED across the back is actually kind of cool looking. I dropped 2 stars because I really dislike the \"smooth\" scroll wheel. It doesn't \"snap\" through it's positions, and as such has poor feedback. For the price, it's much better than my previous mouse, but I'd have trouble recommending due to the smooth wheel.",
        "I initially got a bluetooth mouse and hated the poor connectivity. This moues, however, works great. It moves precisely and the cord is just the right length so it's not restrictive and it doesn't get in the way. The included drivers allow you to program specific buttons for tasks if you wish to do so. Overall, the design is great. The blue light is a nice looking addition. It's on the small side (which hasn't been a problem for me--easier to store) has a side button, and a vertical/horizontal scroll wheel. The middle click is a bit stiff at first, but it loosens up eventually.",
        "Mouse is small and works \"ok\". I went through about 3 logitech wireless optical mice already. They were pretty expensive and worked great, but didn't last very long. Only got a few months out of each of them. After that, I decided to try a cheap mouse. Functionality and comfort can't compare to the more expensive ones, but I guess you get what you pay for. Scrolling is a bit jumpy, but other functions work well. If I take price into consideration, I would give it another star.",
        "This Microsoft mouse cost about 10 bucks through Amazon & it has as many features as I desire. It is compact in size while large in applications. It's got a cool little blue light at the rear & it has a button that allows for magnification of what you wish. It's wheel allows scrolling up & down as well as left to right. The software is on a CD & it's installation is a breeze. It has a cord about 3 feet long & for a surface, I use the arm of my La-Z-Boy. All's good.",
        "I originally bought this mouse to use with my laptop while traveling, but I've been using this mouse on my desktop for a couple years now and I love it. I don't have small hands, but I prefer a smaller size mouse. I especially like that the scroll wheel has no 'rolling notches' but simply moves freely. One criticism I have of this mouse for full-time use is that the rubberized coating on the sides picks up grime and eventually sheds and peels. (I'm talking about years of active use here).",
        "My only problem purchasing mice online is you can't test it in your hands. This mouse is tiny, my mother, who has smaller hands feels it is a bit on the small side as well, but it all worked out in the end, a guy at work has a wife with tiny hands that needed a new mouse and this worked for her. It is a good product at a good price, but just avoid it if you are like me and have regular, human sized hands.",
        "I suppose I should have been tipped off that this was a small mouse because is says it is a notebook mouse, but I think this is the smallest \"notebook\" mouse I have ever come across. It is no longer than my fingers and I have trouble holding it at all because if I put it even near the palm of my hand, my fingers have to be curled back uncomfortably. Also, I have to pull my thumb back to bush the side button. I ended up giving this to my seven year old daughter. It fits her perfectly.",
        "The size and feel of this mouse is typical of a laptop size and felt very comfortable. I actually enjoyed the scroll smoothness, but the click function of the scroll wheel is inconsistent and hesitant. That alone makes it very difficult and annoying for use with any applications that require frequent panning by depressing the wheel. I had to return it because of the panning issues. Other than that, it's a beauty.",
        "Good mouse for a Notebook or keyboard with USB connection 2 foot cord is just not enough an extension is required for most desktop situations...but otherwise excellent reaction sensitivity...click wheel needs a break in period, new tilt wheel is a little awkward and CAN get in the way sometimes...rubber bumps (grips) on the sides seem unnecessary as theres not many times im holding onto my mouse for dear life but anyhow, i wish i could turn off the annoying BLUE LED on the back (palm area) of the mouse its VERY BRIGHT and always on...you can see it from across the room, really..the new SMOOTH scrolling wheel is cool some wont like it though...nomore clicks while scrolling....",
        "This mouse is comfortable and worked well for six months. It was a practical companion to my netbook. I like it enough that when my first one stopped working, I bought another one. Now after seven months it has also broken in the same way. On both mice the cord frayed at the USB connector and the mouse eventually ceased to work. For this price I would expect a product to work for at least a couple years. I am going to try a wireless mouse that is about the same price.",
        "I'm contant with this laptop mouse. It's big enough where I can use it for work (photo editing) and not become tired. The construction is solid (doesn't feel hollow) and the accuracy of the optics is superb. I'm also not a fan of Microsoft but they do make great mice (computer mouses?). I'm looking into buying its bigger brother for my PC. () Highly recommended mouse for notebooks at a great price.",
        "Not exactly a gaming mouse, but it has the standard two buttons plus the scroll wheel acts as a button, and also has side-to-side activation, and there's even a button halfway up the left side. The mouse is half the size of my medium-sized hand, so it's not the sort of thing you can rest your hand on, but it's very sensitive and responsive. I've been using this one for at least 5 years without a problem.",
        "This mouse is perfect for me but I have small, petite hands so keep that in mind. I love the wheel because it rolls up and down and even side-to-side. I also like the button on the side. If you download the software from online you can even choose what you want each button to do on the mouse. (I use the side button as the \"back\" key which is very continent when surfing the web.)",
        "Reasonably priced & well performing, it scrolls well with the scroll button and has smooth \"mouse-action\" on all surfaces I've used it on. It fits comfortably in my hand & I rather like having a corded mouse that I'm not constantly replacing batteries in. My husband's favorite mouse so far & I'm ordering another for our other laptop. I definitely recommend it! UPDATE*** I recant my further recommendation, as this little mouse broke in about 4 months - blah!",
        "I really like this mouse, works great, doesn't need batteries or recharged because its corded, it has a side button and tilt scroll wheel that you can change the functions of, but FYI there are no disks, you have to go on the Microsoft website and download software. Windows will recognize the mouse but you wont have the software to change the functions of the button and click wheel.",
        "Good as a generic mouse but will not be good for 3D modeling programs where you need the middle scrolling/clicking function. The middle scrolling on the mouse locks up a lot and is extremely hard to use. Would not recommend for people who need a middle scroll function. I love the design and feel. I am a girl, so I really like how small it is, also it makes it easy to travel with. It's a very good mouse if you're not using it for the middle scroll wheel. I would recommend the Razer Deathadder for fellow artists in digital fields. It is a bit more pricey, a bit bigger, but still feels nice and works awesomely.",
        "Love it! I have small hands and find the others cumbersome as well as in the way of my multi-system desk. This one is a keeper. Had to use a USB extension, but get that it was suggested for a notebook thus the short cord! Don't mind the scroll at all...seems smoother to use and less page jumping per click! A welcome addition to my cluttered desk.",
        "I love these mice. They are getting more difficult to find with the usb cord. I dont like the battery operated ones because I use mine almost all day long. These are small and work great on a small piece of mousepad in the lower corner of my laptop. I hate those touchpads, they are too slow and inaccurate. These also seem to hold up a very long time considering how much I use mine.",
        "I'm using this mouse right now. I like how it's a small easy to grasp fit to the palm of the hands as I have smaller hands. If you're a gamer, it can be problematic though. In certain map editors for various gains, the mouse wheel doesn't work for zooming in and out.",
        "I am extremely happy with this mouse; it's small, compact and light, the scroll wheel is smooth and precise along with the pointer, the buttons aren't sticky or loose, and the blue LED light on the back is a very cool detail. It also comes with a button on the left side that can be used for zooming and a CD to install the software, though I don't personally use this feature. I will definitely purchase again.",
        "The key to a good mouse is buttons that don't click out loud. This is a very well made mouse and very quiet too. Smooth scrolling and mouse action makes it fine for precise games or paint programs. Using it now and have been for several months. My wife has one now for over six months without issue. For the price, you can't beat it.",
        "I HATE wireless mice and have never been happy with most that I have tried. This compact little wired model is the one that travels with me. I know alot of people out there microsoft bash, but even they have to admit their hardware is first rate. This mouse is very comfortable in your hands and tracks well with good fluidity and very comfortable dpi. The downside is that there is no \"clicks\" in the scroll wheel making vertical scrolling less than pleasureable. If the mouse just had clicks in the scroll wheel, it would be a perfect mouse.",
        "I have three computers and use this mouse on all of them. I know it is supposed to be a notebook mouse, but its small form factor just seems to work well in my big mitts. I have owned these since they first came on the market and have a stockpile of them in case they are ever withdrawn from market. Get yours while you can.",
        "I had killed several wireless mouses. I like the smaller size of this mouse. It fits my hand better and is more comfortable to use for longer times. It is fast and I like the scroll wheel on this one. It scrolls smoothly with clicking. I have been using this mouse for over 6 months and it still works great. Would buy another one if I kill this one.",
        "The first one I got from my dad...and I got this second one for my other laptop. I love the size and shape and it moves the cursor well. I've had another brand that doesn't fit well in my hand. I don't like it even though it was cheaper.",
        "This is my second, wore the first scroll wheel out after 2 years. I am a computer programmer and spend 10 to 12 hours a day on the computer, so my mouse gets a lot of use. I have tried many different wireless models but cannot get one to last more that 2 or 3 months. This little mouse fits very nicely in my hand, is very precise and has none of that \"lag\" that I experience with wireless mice. It will probably last me another 2 years and I do hope it is available come time to get another.",
        "Like the reviews stated, simple mouse that is stable. Has good quality cords and I have no problem with it. The zoom feature isn't very important for me but it can be for those who have trouble reading small fonts. The scrolling wheel was uncomfortable at first, but now I prefer it to not have a clicking noise or resistance. Great purchase for the price, wouldn't spend more for any better.",
        "Pros: * Not too big, not too small. I have small hands, and this fits just right, but it's not a mini-mouse. * Great zoom. Easy to use. Cons: * Not wireless. Personally I prefer the cord over a mouse where you have to snap the USB thingie into it to turn it off. If they made a cordless mouse just like this with an on/off switch, I'd be first in line. * If you use with Vista the screen flickers some. I use it with Vista anyway because I love the mouse. (Although it's pretty annoying that Microsoft didn't bother to make their OS backwards compatible with their own equipment.)",
        "There's a good reason I bought another of the same device... it's great! The old cable is fraying a bit due to abuse. So, I stashed that in my desk as a spare and swapped it out with a new one. I'm no gamer, but I do use a mouse 10 hours a day, and this one is solid.",
        "For travelling from place to place, it's great. It packs small and I don't have to worry about it losing power. It seems to be pretty precise, so it suits my needs. Not very good for the plane, though. Space is crapmed (if you're in the Economy ection like me) and the wire gets in the way. But I just use the touchpad on the plane anyways.",
        "Positive: well-made, smooth scrolling, software readily available online, perfect length of cable for laptop (meaning not long enough for desktop, but I use this for laptop), accurate, doesn't feel cheap, good size for traveling Negative: a little smaller than what I prefer",
        "I prefer to use a mouse, at the worst possible time if I am using a BT or a wireless mouse the battery fails or I cane find the other side of a wireless mouse. This is small , easy to use and is my favorite mouse to take with me. O and I use it on a MAC",
        "Mickey, I mean Microsoft has done well with this mouse. It's small, but not too small so it's portable and easy to use. Plus it's very responsive and way easier to use than a touch pad. Keep your wireless junk, in some things wired is always better and this mouse is one.",
        "Really like this notebook mouse for travel. It doesn't take up much room in the case and works great. Unlike some reviewers the blue light doesn't bother me when working, as the light is covered by my hand and if it did I would follow the simple advise from another reviewer, cover it with black tape.",
        "I was looking for a mouse to use with my laptop. Decided to try this since a lot of people liked it. At first it's small size took some getting use to but I soon began to prefer it to larger mice and wound up ordering a second one for my desktop as well and a couple to give to my daughters as Christmas presents so I guess you can say I'm pretty please with this mouse. One caveat- if you plan to use this mouse with a desktop you will likely need a USB extension cable as the cord is only about 30\" long- fine for laptops but too short for most desktop installations.",
        "The main reason I bought this mouse was because I constantly had to replace batteries on my other wireless mouse. This mouse that I have now is extremely ergonomic and the scrolling is really smooth. The blue light on the back of the mouse looks cool. Using it right now.",
        "I have one of these for my laptop and I liked it so much that I just ordered one for my mother... It's compact and efficient.. and for those who have trouble seeing text on the computer it has a quick magnifying button that works perfectly.. even with windows 8..",
        "I like this mouse. It is small, stylish and inexpensive. Plugged it into my laptop and the drivers were automatically installed in Windows 7. The placement of the side button works well. My only gripe was with the scroll wheel. At first, scrolling tended to be imprecise. Using it in games, for instance, would rapidly scroll through all my items and then end up back on the first item. I found out later that this annoying little \"feature\" could be disabled: go to the control panel, click mouse properties, go to the wheel tab, click advanced, and clear the \"enable accelerated scrolling\" option.",
        "Best Laptop mouse ever. I hate wireless mice, with this never replace a battery. The wire is JUST the right length, 1 inch shorter and couldn't plug in on opposite laptop side and use freely. Microsoft should never discontinue it.",
        "I had a wireless mouse, logitech, that came with my laptop. It caused a lot of problems. Finally, I decided to get a new mouse. This one is 100 times more responsive than the horrible Logitech thing. I'm very happy with this mouse.",
        "left/right scroll cannot be used as forward / backward. Which makes that feature useless to me and the purpose of this mouse useless",
        "This one is little smaller than a standard mouse but not too small. My daughter loves this. The buttons and scrolling wheel are soft and smooth. But the cord is short. Product clearly said that it was a Notebook mouse but I didn't know that meant shorter cord. I can't connect this to the back of my desktop. I have to connect to the front of my desktop, which I normally use for other USB devices. So I am going to buy another standard mouse (not a Notebook mouse this time).",
        "So far so good. It's just a bit on the small side but for the price, a good deal. It is better than the last cheap mouse I had-- seems very accurate and responsive. Works with no problem on new MacBook Pro, no need to download any software or install anything-- just plug & go. Scroll wheel tilts sideways too, works great.",
        "The mouse replaced one of those ultra micro mouse that failed on a laptop. The size and comfort level is good; not too big or small. This is a corded mouse; got tired of replacing batteries on those cordless ones. Just plug and play; the way it should be.",
        "Comfortable mouse for sure. My hand are pretty large, yet this is still comfortable to use when on the road. It's small enough that it doesn't make my bag bulky.",
        "Years later this mouse still works and works flawlessly, I love it",
        "Arrived in time as expected ,not in an original sealed plastic container but just an small plastic bag like covering and no software ,which microsoft online via updates automatically downloaded what was needed,etc...",
        "Used this one for a few years, still working. The only pron is its size is small. Good for girls.",
        "Bought this Mouse to replace the one I had for my Desktop. First thing, was that the cord was shorter than my old one and wouldn\"t reach. Then noticed that this was labeled for a notebook. DUH!. Now only use with my laptop.",
        "These are small, but are intended for laptops. They work well, but are a bit small. Wish the information on the site would have provided the size information.",
        "i tried using a wireless mouse but it did not always work. i bought this one and love it. no roller ball, but there still is a wire which is no problem. i do wish the wire was about 2' longer. great service",
        "I should read the specification more because when I received it the mouse was very small. It felt odd using it. It did work as intended. The magnifying glass software was sort useful to play around with. I ended up trading it for a mouse that was bigger.",
        "Too bad it is not available around (needed to search), but, this is probably the best small corded USB mouse out there. No risk of running out of battery, or, loosing / breaking the wireless dongle.",
        "I've been looking for a optical mouse forever that I didn't have to pick up and slide it to get it moving. This mouse does an awesome job and moving a great distance on the monitor without big movements with my hand. I borrowed this mouse from my coworker when we were traveling for business and am hooked. It's light and precise, and perfect for my needs. I've bought 3 of them, one for travel, one for the work office and one for the home office.",
        "I like this mouse because of these reasons : - comfort, it fits my hand - precise, when use it in windows you can't tell the different.but when comes to games ( shooting game for me),it show how precisely it is - good price - love the light :)) But there are something not helpful : - scrolling wheel : doesn't need to scroll 4 directions. up and down is ok - zoom button : totally useless In conclusion : great choice to buy this mouse :)",
        "Maybe because of the settings, maybe because it's a piece of c***, the wheel brings me up before going down, very surprising... I like the size, the optical is cool, the button and design great though. for a decent price.",
        "A good companion to the back-lit keyboard I got. It's kind of small for my hand, but my girlfriend likes it. zoom button is nice, horizontal scroll takes some getting use to, but isn't that noticeable if you don't use it.",
        "Impossible to find in electronics stores, this nifty little mouse has the back button for painless surfing--a feature most manufacturers seem to have dropped. Plus, I was tired of buying batteries for wireless mice when my MacBook has a free USB port.",
        "Ordered this a few weeks back along with a cooler and bag. Love it's size nice and small to easily to fit in a pocket in my new bag but not too small to work with. Great price too.",
        "It is very good mouse .Touching is enough softly to select something,It is light and almost same size with other laptop mouse maybe smaller.But there is only one drawback,it cant work on some colored surfaces.",
        "The mouse works very well. the only problem it's a bit small, and I don't have a huge hand. This is a great mouse for a kid.",
        "We use it on our laptop and it works great. I have a mini-mouse, but it was too small for my husband's hand. So, I purchased him this mouse and it works great.",
        "Mouse isn't wide enough, forcing my pinky to move in closer then it normally does. The buttons press down much too far then needed. Scroll wheel doesn't click, which is extremely annoying. Also the drivers/software for OSX is rather buggy, I can't change the scroll speed. I would suggest looking else where for \"the perfect mouse\".",
        "died on me in less than one year. had a Dell mouse for five years. did not buy a new Microsoft one.",
        "I use these with my portable - and my girlfriends - they are the right size and Microsoft too - and the price was good. Nice units.",
        "The mouse came in the allotted time. When I opened the package, it looked like someone laid the wire for the mouse on a piece of hot pipe about 2 inched in diameter. It melted a whole lot of the wire. It was actually still attached by just a very small piece of wire.",
        "ok. it is a notebook mouse. I didn't realize that means its small and has a short cord. otherwise it's ok",
        "This is a very good mouse. I have used it (plug & play) on 3 computers. No problems.",
        "I use this with my desktop and love the response and accuracy. Windows 8 found the driver itself when I plugged the mouse in.",
        "This is the second one that I have purchased for travel. It works great. I installed it on a new Sony Vaio Laptop and it almost installed itself.",
        "This is a great little mouse for packing with the laptop. About half the size of a standard mouse and is perfect for use in my RV.",
        "Just as all Microsoft optical corded mouses I've had, is good for a Little hand person, portable and Works ok",
        "Really like this mouse. Small with plenty of features. Best of all, no batteries to worry about, or wireless connection issues.",
        "Pleased, nice and compact, but it does wear down, but that's fine. Will probably order more if available.",
        "This is a good little mouse if you need one for your computer. It works real well and is great to have.",
        "If you don't need all the bells and whistles of all those higher priced mice,you can't go wrong with this item. Works very well!",
        "I was looking for a mouse for my notebook, and this mouse is perfect for it. It is corded, easy to use and light to carry. It is small enough, yet easy to hold.",
        "It's functional but it's small. I bought a slightly larger mouse Logitech V100 which feels a lot better, more comfortable, responsive.",
        "But the wire is still too small for my liking. The mouse itself is petite, and gives off a nice blue glow, so that's cool. But I still really do wish the cord was a few inches longer. Either way, it works great!",
        "I like my mice to be just a little bigger then this is. It works well there are no issues with its performance i just like them bigger.",
        "This is a great mouse. Not too big or too small. Comfortable to hold with the grip strips on the side. The best thing is the tiny fifth button that is mapped to the included mouse driver's magnifier feature the blows up a section of the screen around the pointer. Great for us old geezers.",
        "My favorite cord mouse for laptops ! Stylish and practical, never gets old. Way cool.",
        "It appears that the ball in the center did not work properly. but for the money one can not complain.",
        "My wife has small hands and this fits her perfectly. It is also very light-weight so that is another plus.",
        "This is a great mouse that's compact and durable. It makes a great companion for any laptop. A great value!",
        "I absolutely love this mouse. I liked it so much the first time I bought it that I went ahead and bought it again. It's small but perfect for what I use it for. Its also possible to use it for gaming",
        "This mouse is wayyyy too tiny. I'm a short guy(5'6) and my hands are not that big. The mouse is uncomfortable for its tiny size. Oh and I use Photoshop a lot, so I do a lot of mouse clicking.",
        "Tracks well and you can't eat the price. It is a nice size too. Not too small and not too big."
    ]
}