{
    "entity": "Mice",
    "text": [
        "This lasted till 2016 . Man how much I miss this. It was cheap and balanced. The newest version just don't feel the way this felt. Now this is x10 the price it had way back. I wish the new g900 will be the real succesor of this item. Logitech really made a good mouse on this one! No bias reviews here. Bought it with my own money.",
        "This is by far and away my favorite mouse. I have one that I have used for over a year. It is a dream for gaming. The accuracy is nearly as good as any wired mouse - without the hassle of wires! I love being able to change the resolution on the fly to get the accuracy I need for sniping, and then have the quick reflexes for traveling in games. Get this mouse, you can't go wrong. Believe me, you can ignore the clowns saying the mouse doesn't work. They should have checked their computers before they posted.",
        "I was replacing a wired G5 mouse when I purchased this one. The ergonomics of the mouse are excellent; it really feels comfortable in your hand (sorry lefties.) Further, they include two batteries so you never have to 'dock' the mouse...you can just swap out the batteries when it stops responding. I also like the ability to change the tracking speed on the fly. All in all, I would repurchase this mouse and recommend it to anyone looking for a wireless solution. (Tracks as well as any corded mouse I've ever had!)",
        "I purchased this mouse to replace another older Logitech MX-700 cordless and I have to say that I'm not overly impressed. While being able to swap batteries on the fly is great, I've noticed a few issues that I did not experience with my other cordless. First of all, the overall pointer movement across the screen is quite jerky at times which is very annoying. Additionally, while battery life is very good for general mousing, it depletes much more rapidly during moderate gaming. Not a bad mouse, but for the money, it's not really that much better than my old MX-700.",
        "They feel great. The only negative is that batteries do not last very long.",
        "I used this mouse for yeas. Hot swap batteries was nice as was the ability to switch sensitivities.",
        "Too bad they don't make these anymore. Loved this mouse but it had issues with wifi interference for some reason. Wish they would have been able to fix that and remake this mouse. I loved loading the battery mid battle like reloading a gun and killing fools online!",
        "Before I bought this mouse I had a Logitech Mx700. The Mx700 was still fully functional when I bought the G7, but I was tired of my mouse dying while I was playing a game. The G7 lets you swap batteries while you are playing. That is a great feature even if you don't play games. You don't have to put the mouse back on the charger when you are done using it. Just slap in another battery when you get low.",
        "Well I had the MX 518 before this mouse, and was completely satisfied. Having said that, this mouse blows it out of the water! The 2000dpi is sooo nice. My only complaints are the texture of the sides of the mouse (my MX had soft rubber sides, and this has rough plastic sides) and the battery life (typically about 7-10 hours on a full charge). Now, you are never without a battery if you straight exchange the batteries in the charger, but you are having to change the battery quite often, which can get annoying. Other than that, I would highly recommend this mouse if you are looking for wireless freedom and gaming quality.",
        "You can't go wrong with this mouse. I was using it in under five minutes after opening the package. My son uses one for gaming and I use mine for general PC operation. I will be buying a third one for work. Highly recommended. Update.... Almost four years later and I now have five of these babys all humming along under heavy use at home and at work.... The best mouse ever.",
        "I bought this in 2006 when it was new and top of the line. I used it daily and constantly. Being able to swap batteries in the middle of a game was great. The application allows for speed and sensitivity settings which help depending on the game played. It lasted until earlier this year when it just went on the fritz. I think 2-3yrs is good for a mouse.",
        "Best mouse I've ever owned. It's a shame Logitech stopped making them. The mouse wheel eventually broke and rendered the mouse unusable.",
        "This is the best mouse. Great value for what you get never hunting for battery s, it comes with two. One is in the charger the other in the mouse. You get a pop up on your screen when you need to change the battery in the mouse for the one in the charger stand, oh by the way the charger stand is very small which is also nice if you desk is full like mine.",
        "Liked my first one so well, I bought another one for my wife's computer. I have no problems with the batteries. By the time one runs down the other one is already Ready to change it. I seen some reviews complaining about how long it takes battery to recharge. But, I have had no problem with it. It charges using a USB port, and you should use a port directly on the computer. Some USB routers do not supply extra power of an AC adapter. That could cause a problem, but I do not know for certain.",
        "I bought replacement in June 2008, because I thought sooner or later my mouse was gonna crap out(probably had this a couple years before that?), but...I still have not had to replace it. I love not having to set the mouse in a cradle to recharge battery, simply switch it out for a charged one, awesome. I use it on a daily basis for surfing the net, and I play WOW, a lot of WOW. I usually switch out the battery once a day depending on the useage, more on weekends :D. I haven't had any issues with the mouse not working or being picky. There is no indication that the batteries or the mouse are going to die...",
        "I've been through 3 of these G7's and each of them ended with the same problem - the left button always wears out and gets stuck. One did end up suffering from a scroll wheel problem, which was fixed after disassembling and cleaning all moving parts and reassembling.",
        "I would've given this 5 stars, except for the typically crappy software. Despite its claims, this mouse works just fine (actually, great) with a Mac. Just use USB Overdrive, and you're good to go. I actually find the battery life just about perfect. It's a great reminder to get away from the computer and enjoy life!",
        "I love the mouse itself, but not the way Logitech constructed it. The left button always start double clicking after a couple of months. I usually try to replace the switch, but this time I bought 2 refurbished mice from Amazon. One came with a non-working wheel, but a nice left button. The second one had a very flimsy left button, and a very loud wheel. The first started to double-click after 3+ months, the second dissolved in oil and tears after 2 weeks. Great mouse, but a crap shoot to buy",
        "This mouse is just a great little mouse. Very clean feel, accurate, and a welcome upgrade from my previous Microsoft wired optical mouse. Only problems are the short battery life (only 2 days?) and the lack of being able to use the left/right middle button switch in multiplayer games. (it doesn't register as mouse4 or whatever)",
        "I've been a gamer for over 20 years now and have gone through a number of mice over the years. This is my favorite by far. The accuracy is spot on, the cordless convenience is great without needing to sacrifice gaming performance. The time before battery swaps depends on usage - with a heavy day of gaming it's once a day. With normal home usage its over a week. The black version of the mouse has a better surface feel compared to the first generation.",
        "The battery concept is ahead of its time. Anyone with a cordless mouse can tell you the recharging is a pain. Especially if you work with your computer for long periods of time. Simple swap and go battery and there is no down time. After two years the batteries are down to 1-2 day swap. Nice mouse speed adjustment right on top. allows you to click adjust the speed of pointer movment. Over all.. best cordless i have ever used.",
        "Excellent mouse but stutters while gaming evey once in a while which is unacceptable to me.",
        "I use this mouse for screen-based trading, and it works great. The only thing keeping me from giving it 5 stars is that it would be nice if the battery lasted a little bit longer. In general, I have to change the battery every day, but at least Logitech was good enough to include 2 batteries so you can use one while charging the other. All in all, a great mouse with excellent capabilities!",
        "This is by far much better than the MS 6000. It has a light, yet firm feel and the movement is great for games. The clicking is very comfortable, the grip is good and clean-feeling. Overall, the best wireless mouse of the four that I have owned.",
        "I've been using this mouse for several weeks. It's such a delight to sit down to this comfortable, stylish mouse. Not only does it look good, it works great. I have to change the battery every day or so. It would be nice if that weren't the case. However, there were two in the box and it's not a big deal to swap them. I even got it done in the middle of a game without getting killed (and I was being attacked). Great Mouse, I would buy it again in a heartbeat. Logitech always does it right.",
        "The second set of batteries is a great idea. The batteries take no time at all to change. The spare set is always ready by the time the set in the mouse indicates it is low. After many months of heavy gaming the switches have become intermittent on my first one and I have ordered a new one as a replacement. That is a pretty good indication of how much I like this mouse.",
        "I like the feel (not as well as the MX1000) and the two battery setup is a good idea, but it is going back to Logitech as the batteries don't make good contact with the charger and consequently they don't get charged. It stinks when your battery dies and you plug in the spare and it is dead also. Logitech is supposed to be sending me a replacement but I haven't been to impressed with their customer service. The logitech forums do have a few other users that have had the same problem so just be aware of it.",
        "This mouse is excellent, the ergonomics are great, it works well at far distances, and is very accurate. I love the aspect of not having to worry about batteries anymore with the wireless mouse, while using one, the other is always charging and is always ready for the extremely quick swap. I purchased this when it had a rebate, but I am really happy I did. Used to have a wired mouse logitech mouse, and I even like this one better, was a little concerned that the accuracy might not be good because it was wireless, but it wasn't. And it looks great.",
        "Working only half the time. Coulda bought a new better mouse for the same cost.",
        "Well, I am a serious gamer. I bought this mouse for all the options it offers. It has great abilities, however, I noticed my mouse would skip across the screen. I tried changing the DPI, bought two different laser pads, cleaned surfaces, everything to no evail. Finally I sent this back to Amazon (great return ability!!) and bought the wired G5. I have not been disappointed going back to the wired G5. Could have been just the mouse, but I did not want to take another chance on another wireless mouse. Made gaming accuracy go down, as well as irritating when trying to cruise the internet due to the mouse skip...",
        "The Logitech G7 is well worth the money. I have been using mine for about an month now and I am thrilled with the seamless performance. The USB port that is on top of the charging deck is a really great feature so you're not tieing up all of your other ports. The fast battery switch is extremely convient, especially for emergency times. Turbo charge is reliable and allows a decent battery life, while the normal charge time gives a fairly long battery life. Best mouse I've owned. Wonderful for casual use and daily gaming!",
        "I just got it and I love it. I play alot of online gaming and pair it with the Logitech G15 keyboard, WOW its an awesome combo! I have seen a big improvement in my games. I highly suggest you get this and the keyboard.",
        "The lazer went out within three weeks after purchasing the G7 but Logitech stood behind it and sent a G700 which is a much better wireless mouse as a replacement. WOOT! for Logitech and their customer support. I'm still a Logitech customer and fan.",
        "after getting a laser mouse, i won't be going back to optical any time soon... this baby works virtually on ANY surface, flat, round, rough, or even glass... i'm not much of a computer gamer, so i can't really give the feedback on that, but i must say that the extra battery it comes with is a great convenience... it's a quick switch compared to those that utilizes AA batteries... overall, i've had great experience with the mouse thus far (bought two because of it) and it's a recommended buy from me...",
        "Still like it more than my G700... but unfortunately resolution is almost a third of what the G700 is doing.",
        "I still own and use this mouse. It's been around 7 years or so and the batteries still work perfectly in it. I am extremely happy with it. I wish I could buy another one.",
        "I have about 5 mice right now. Two of the Razors, and multiple Logitech versions. While I like the way the G5 feels for most day to day activities the most the G7 is my mouse of choice for FPS games.",
        "I have been using this mouse for 3 years now, and it has been excellent. I just purchased a second set of batteries, and I'm getting ready to purchase another G7. So I highly recommend this product.",
        "Mouse worked great for 1 month. Then would freeze for 5-20 seconds. Logitec said it was magnetic or wifi disruption dropping the signal. I turned off my wifi and cordless phone with no luck. Please do your research on any tech site. Same problem abounds more times than not. If this issue was fixed I would give it 4 stars, now its an expensive paperweight.",
        "I usually hate to go cordless - constantly having to change the battery or having to \"re-synch\" the thing. This mouse is great I have had it for over six months, haven't had to re-synch and the switchable batteries makes life so much easier!",
        "Awesome Mouse, well designed and ultra comfortable to use. Too bad the receiver doesn't have a place to plug into the bottom of the mouse for portability. I am a Very satisfied customer with this item so far. Logitech makes reliable products.",
        "The extra battery that is always charged makes this mouse incredible. You see the indicator go red and you swap the charged batterry from the reciever to replace the one in use. By the time it goes dead, the one you sent back to the receiver is ready to go! Great reaction time and a great mouse, the spare battery makes it priceless.",
        "This is the best wireless gaming mouse I have used. You cannot tell this apart from a wired mouse as far as connectivity is concerned. My only complaint is that you have to swap out the batteries too often. However, since it comes with two you can always have one charged and ready to pop in. It only takes 10 seconds to slide one out of the mouse and snap a new one in.",
        "Logitech really excelled with the G7: confortable, light, extremelly responsive and with nice looks. Excellent for gaming and any office applications (the dinamic dpi change really adds a lot of value), improves precision in games and work. A must have for anyone looking for a new mouse. Check it's \"brother\" G5 if you prefer a wired mouse.",
        "I do a lot of multi tasking. I've never had a wireless before, and recently one of my buttons fell off my Microsoft Blue, and I had to get a new mouse, after some reviews of the MX1000 I figured i'd try the new G7. The mouse works fine until I have a few programs running at the same time. Photoshop Solidworks Quickbooks, and then the cursor seems to jump around the screen sometimes.",
        "Excellent deal, the Amazon price was the best, I looked everywhere for quite a while. Very comfortable, great grip, long battery life even in gaming mode, super sleek design.",
        "Its an awesome mouse especially love the ability to change resolution on the fly. The only downside was that the spare battery that I got in the box never worked. Just woudnt charge and wont work. Except for the that its a great mouse for gaming.",
        "I bought this wireless mouse a few months ago and the only complaint I've got is if you have a WiFi in your house DO NOT GET! Wireless connection interferes with the signal from the mouse. Other than that, it's most impressive. No lag, and perfect for fps games. The battery life is short, so be sure not to take off to a lan party without both batteries and the charge station. Overall. Well worth the buy.",
        "This is a great gaming mouse. If you're a gamer, buy THIS mouse. It has the best reaction time for fragging and first person shooters. It comes with 2 batteries, so one can be recharging while you use the other. You'll never have to be sidelined while the battery recharges. If you are not a gamer, though, consider the Logitech MX 1000 mouse for more features, a better feel and never having to change the battery (it's built in).",
        "This is a good mouse, but the battery life is pathetic - I have to change the battery every few hours. As the batteries get older they wil hold even less charge, so I expect to be replacing this expensive item within a year.",
        "This was undoubtedly the worst money I've ever spent on any mouse. While the mouse started out performing decently, it quickly degenerate into disconnects and cursor locks ever 4 to 5 minutes. Effectively rendering the device useless for any game or professional application. The quality of the mouse was abysmal, the support from Logitech abysmal, and worse, after looking around, I found that regular disconnects are not at all uncommon for this mouse. I strongly recommend that anyone who is looking to purchase a mouse simply look elsewhere. The G7 is a poorly made product that guarantees little more than frustration and frequent interruptions.",
        "Logitech made a great product here. With the second battery being charges while you are using the other was a smart thing. It is very confortable to your hand and the Setpoint software is great.",
        "serious gamer or casual gamer, this will be the last mouse you will ever use. it's the best.",
        "This was a nice mouse. Don't use it anymore. The batteries kepy wearing out. Came with a charger unit built into the receiver. Very fast and accurate. Technology keeps evolving andwe must keep up.",
        "The mouse itself is a great idea, but the battery life is horrible. I guess that is why you receive two batteries with this mouse; they resemble cheap cordless phone batteries. I work from home, and can tell you the battery will not last through half a day of continuous use. I find myself having to switch batteries at the worst possible moments. - Sure it has a battery indicator, but it is covered by the palm of your hand. So for what I paid, the previous Logitech MX Laser is a much better deal. The battery life on that mouse lasts almost 3 times as long as the two combined which come with the G7.",
        "I absolutely love my G7 cordless(I've owned it for over 2years)! I was reading the other, less generous, reviews and they're mostly complaining about, \"omg, I have to change the battery every other day, with heavy use!!!\" But I don't mind replacing the battery one bit, especially because it's got that \"outta ammo, gotta re-load\" kinda feel on the quick release. As far as general performance goes, I've never had a problem, it's Logitech. In my experience, Logitech = Quality.",
        "I like this one easy to use battery easy to replace even during a game. I like the extra button. I use it with cod waw",
        "This is the best mouse I've ever owned. Hands down the best mouse for wireless gaming.",
        "The G7 mouse is by far the best one I have ever used. Extremely fast and easy to use. No set up required, just put the disc in and in a minute you are ready to go. I had bought a Microsoft cordless mouse before this one and I had to take it back because it was horrible. Logitech did a great job on this mouse, I would highly recommend it.",
        "This mouse is very good and you can't beat the rechargeable batteries. The range is good and the sensitivity button helps to customize the feel for games.",
        "The mouse is very heavy, and the worst part it keeps freezing on me. It periodically does not respond to movements and commands. The battery needs replacement very often. The shape of it is also strange, it does not fit well into the palm and is rather hard to manipulate. I ended up donating to the Salvation Army. I do NOT recommend this product",
        "I never have to worry about batteries. There is alway one charging to put in when one is low. It gives a warning which makes it easy.",
        "I purchased this as a gift for my 16 year old grandson because it was on his wish list for Christmas. This along with the Logitech G15 Gaming Keyboard just about completed the computer he built for himself. These gifts truly brought a smile to his face and made his eyes sparkle like I haven't seen since he was five years old.",
        "This mouse offers exactly what I want in a gaming mouse. Fast response time, no cord to muck up my shots, adjustable sensitivity on the fly, and swappable batteries. I can usually make it through a couple gaming sessions before switching batteries (about 6 hours of intense use), and the warning light gives me enough chance to get somewhere safe before swapping. If you're a gamer who likes wireless mice, this is *the* mouse to get.",
        "This is the single best mouse that I have ever used. The battery life is about a day, which is a very good life span for a rechargable mouse, and when it dies, i simply swap it out for the other one. I have used many other mice, and this one is the most comftorble to hold, and is nearly frictionless. The wireless range is great. I can be sitting on my bed and controlling my computer about ten feet away, which is great for watching movies. I would reccommend this mouse to any computer user, not just gamers.",
        "Fell in love with this mouse within 10 mins of starting to use it. The clicks and wheel feel very nice. Looks bulky but is not heavy. All buttons are completely configurable and would greatly improve your performance with the mouse. Highly Recommended.",
        "Good grip, lightweight. I can sit on the couch 15ft away with no line of sight to the unit and it still works good. Great for gaming. Having a battery always charged is nice.",
        "Going strong for five years now!....No problems! This mouse has taken abuse from many nights wasted glued to battlefield 2!!",
        "This cordless mouse is very comfortable; I know because it is in my hand for 8to10 or more hours 24-7. I am disappointed that Logitech has discontinued this model and I had to look high and low for a new old stock replacement. But I found it and I got 75% off by applying for Amazon VISA at time of purchase. How cool is that??",
        "This mouse is amazing for gaming. It is totally a must have. battery life is nice and you can recharge one battery while you game with the other. The feel is great and the DPI settings are amazing. This mouse is revolutionary",
        "I like the mouse except for two things. the backspace button on the left side in placed too high, and the batteries need to be spapped out more often than I would like. God product though.",
        "I bought this Laser mouse because I wanted to try and go the wireless mouse rout, what a big mistake, the mouse either (in a program) moves real fast or it moves real slow and the control buttons on the mouse are limited as to mouse speed, and the rechargeable batteries don't retain there charge very long about a day and a half and the recharge bay only works when the computer is on. I am going to wait a long time before I revisit the idea of a cordless mouse. Do your self a favor and stay with a corded mouse.",
        "This is the second G7 mouse we own. Both of my sons are using them all the time with very little problem if any at all. Probably one of the best Logitech mouse ever.",
        "Love it. I had the first one for over 5 years use it everyday. Would recommend it to anyone who asks.",
        "I've wanted a wireless mouse for a long time, I finely got one that is my dream of a mouse that has two batteries 1 in mouse and 1 in charger at all times, and I got it for what I felt was a bargain price through Amazon.",
        "The styling and feel of the mouse are great but the quick pop-out battery does not last more than a few 8hr days. The mouse comes with a battery charger and a spare battery, but it's kindof a pain. a cradle would be better - the LX1000 is better",
        "Works great! Have to change the battery every day, but that's the price you pay for cordless gaming. Fortunately it's very easy.",
        "Logitech mouse fits comfortably in your hand and very easy to use. I would recommend to anyone.",
        "I have accidentally dropped my G7 many times on the floor due to tight operating room. It is rugged! I just pop the battery back in and keep operating.",
        "My son pointed me to this particular mouse and I am very appreciative. It is everything I expected and more.",
        "Do not buy if you have other wireless or cordless items. The mouse stops working because of interference and the battery life sucks. It can really get frustrating during the middle of a important situation and your battery dies/loses connection.",
        "The batteries were completely over looked by Logitech. The mouse might function well but I can not get the batteries to last more then a day. I will not buy another G7.",
        "Watch out. The mouse seemed to work fine. However, all of a sudden the pointer motion became sporatic and jumpy. Turns out any time my wireless G network got heavy traffic (a different computer running a backup to the server) the mouse got interference. I tried it several times and confirmed 100% this to be the case. Back it goes.",
        "recieved a new one with same problem. tech support said its a common issue with this model. pretty useless.",
        "Product was delivered before the expected time. The G7 is an excellent product and much better than other mice that I have owned.",
        "I'm a gamer, and I picked what I feel is a great gaming mouse. You will not regreat this purchase.",
        "If you on your computer all the time,.. then you have to swap out the rechargeable battery at least once a day. Waste a lot of time,.. I swich back to my original Microsoft mouse and that used 2 AA batteries and it last more then one month. Don't buy, you will get tried of changing battery everyday!! TRUST ME,.. YOU WILL GET TRIED OF PRESSING THE BATTERY RELEASE BUTTON ON THE CHARGER BASE,..AND IT GET STUCK HALF THE TIME. AND THIS LASER MOUSE WORK JUST LIKE ANY OPTICAL ONE,.. DON'T THINK IF YOU GETTING A LASER IS BETTER,..ITS SURE NOT,.. I CAN'T TELL THE DIFFERENT. FINAL NOTE,..BATTERY LIFE STINK,,,LASER IS NO BETTER THEN OPTICAL"
    ]
}