{
    "entity": "Mice",
    "text": [
        "I bought this mouse to use with my laptop because I hate a touch pad and I wanted a five button mouse. This mouse is great. It performs well and the battery life is unbelievable. It works well on any surface and while being very compact it is still comfortable to hold and easy to use. It connects instantly and required no software installation of any kind. All you will need is a free USB port for the wireless mini USB adapter. The USB adapter stores in the mouse so you don't have to worry about losing it.",
        "This is the second one I have owned. Very comfortable and easy to use.",
        "This is a decent mouse for the price. I paid $19.99, no tax no shipping. I bought this mouse to replace the Laser 6000 mouse I had. I have the Laser 6000 mouse/keyboard combo. After 4 years the mouse has been defeated but the keyboard is still great. I bought the Laser 5000 and was able to sync it to the Laser 6000 base. The Laser 5000 Mouse and the Laser 6000 Keyboard work perfectly together.",
        "My son knocked the last two off my desk and they stopped working. This mouse is great and I have come to search for it when I need to replace it. It is not too heavy, yet heavy enough to not feel cheap. I put Duracell Ultra in there and it has been almost a year with the old batteries still going strong. I just put them in from the old mouse to the new one. Great deal on this!",
        "This is a GREAT mouse!! I enjoy using it. I like how it fits my hand, I like the extra buttons. The only thing I dislike about it is that the range from the signal box is not strong enough. The instructions say up to 6 feet, I am lucky to get 2. Other than that I am very pleased with my purchase. I would recommend this to anyone who needs a wireless mouse as long as range of signal is not an issue.",
        "Good and reliable, my last one lasted 4 years of everyday use. I wish this one be the same or more. The feel is smooth and fantastic. Like the first one, the installation is straight forward and can't be simpler. I purchased from Amazon, which means from my desk to my door. Save in gas and hassle (traffic and salesman ignorance).",
        "Good overall, just mention aspects that I am not comfortable with 1. The balance. When the battery is installed it feels slightly not balanced. 2. Huge receiver. Almost as large as the mouse it self...not good 3. Tight middle button. Hard to push. 4. Computer could not automatically sleep as I set up. This could be easily solved by installing the latest driver on Microsoft website, not a big deal but still made me annoying for some time. Anyway, nothing could be perfect. This mouse is good and the price is reasonable.",
        "I love the feel of the Microsoft Wireless Laser Mouse 5000. Some people may not like the size of the transmitter, which is about the same size as the mouse. But it is the most comfortable one I've had. Too bad they are not being made anymore.",
        "Loved the mouse, only paid $20. But now it is old and worn out, so I tried to purchase a new one and they are all $50 to $80 now. WTF?",
        "I've had the 5000 mouse, 4000 keyboard combo for years now. Absolutely the best kb/mouse combo I've ever had. I have 3 sets at home (one for each PC and one for the PS3) and one for my desktop at work. I know there are more advanced keyboards and mice out there, but these have everything I want and are the best I've found for the money.",
        "Nothing but great things to say about this mouse. The first one broke when I moved (my fault) and i replaced it with the same one. I use a tv monitor as my computer monitor and most of the time i am far away from the receiver and it still works great. The zoom feature is a great add-on.",
        "I purchased this microsoft mouse as a replacement. It works very well And I love the magnification feature. I would recommend this mouse. It is a very large mouse So if you have small hands You may want to pick a smaller option.",
        "My daughter is left handed so requested that we switch to a mouse that was left-hand friendly. I don't like cheap mice, and this was the best ambidextrous device i could find. Put in the included batteries and plugged it in and worked with no issues on Windows 7.",
        "I purchased this mouse for myself and was very impressed with the magnifying feature. With one click, your pointer turns into a magnifying glass which can be increased to cover most of the computer screen. I was so impressed that I purchased another one for my sister who has vision problems. The mouse was very easy for her to install, and I look forward to my sister having fun again when she uses her computer.",
        "Get what you pay for. It's $11 for a reason. The wheel was flawed in the one I used. Oh, you could scroll through documents, if you spun the wheel with your free hand. It didn't matter what the settings in software were, same result. So far MS has made the best mouse I've ever used, the wired Laser Mouse 6000, and the worst, this mouse. Don't buy this mouse.",
        "I love that this mouse has the buttons on either side to go back and zoom. However when I ordered this mouse I anticipated that the left side button would go back, which it does and the right side would go forwards, which it does not. I'm not sure if this could be a software thing or what. It would be 5 stars if both buttons worked as stated above.",
        "I love this mouse and for the price, in my opinion, is a great value. I've had two of these mice for several years and have used them extensively. Just lately I've had to push a little harder to get the right click to work. Still use them every day.",
        "I usually prefer Logitech mice but this one was a great buy. Looks good, works great and I got it at a decent price.",
        "Had a little trouble receiving, due to communication problem. But product was in good working condition!!!",
        "it's good. But it's for desktop. If you want to use it on you laptop, the bluetooth receiver is too big and the mouse is not so small. it's very comfortable in a man's hand. there is no switch button on the mouse, i wonder how long the two AA batteries will last.",
        "I'd recommend this product. It's design is very comfortable in my hand. It has a navigation button on each side, plus the wheel that you can click. I've had fancier mouses (mice?) before, but this one gets the job done.",
        "So, I have to admit that I had this mouse at my old job and was already familiar with it. Once I moved to my new job, I missed my old mouse so much I was willing to fork out my own money to buy one just like my old one. I'm as blind as a bat, so I really enjoy the option to set a button as \"magnify\" which acts as a magnifying glass on your screen. It quite literally saves my poor eyeballs. It works just as well as I remember.",
        "Works great operates from a very good distance easy to install easy to use the best I ever had just a great mouse",
        "It's a replacement for my Microsoft wireless laser mouse 5000. Great.",
        "Bought this for my brother for her collection. She loves it. It's been years and he still uses it. I highly recommend it.",
        "If i were to buy another however, I would go with a mouse that just needs a usb drive instead of a whole separate unit that must sit on my desk. oh well!",
        "Not sure why others have a problem with this mouse. It was easy to install and easy to use. Works great. Love the magnifier button.",
        "I had a logitech wireless mouse and it worked great, but battery life was poor. This mouse works great and battery lasts much longer.",
        "When compared to the several prior Microsoft 'mice' I've had, this one is pretty sad as far as performance goes. It is not responsive and it is not accurate no matter how you change the settings for it. The 'invisible laser' feature of it, makes it necessary to use a mouse pad, where prior ones with regular lasers, worked excellent on any surface. This mouse will quickly be replaced.",
        "As good as most of the other cordless optical mouses and the price was right. You would have to spend a lot more for one with a greater range.",
        "I have been very satisfied with this product, and as always the battery life is wonderful. One flaw, I found is the mouse is more sensitive than its previous versions. The pointer needs to be slowed down (from Control Panel). Apart from that, this product is simply the best in its class.",
        "I am an adult female and this mouse is too big for my hand. After a very short time, my hand starts to ache and I have to go back to my previous, smaller mouse. I have both of them active. I switch to this one when I need to magnify something - as that part works fairly well. I just wish the magnifying window was larger. I have to keep moving it around on the page to read anything - often just to finish a sentence.",
        "I love this mouse; this is my second of these. I ruined my first one, so I just had to get another.",
        "This mouse worked well for a couple of months but I began experiencing low battery signal messages, low signal quality messages (even though the receiver is less than a foot away and I replaced the batteries many times). The software on my computer is the latest Microsoft offers. Then, I began seeing huge delays in response to scroll wheel movements and clicks, although mouse movements were normal. Something is wrong with this mouse or the software it relies on. I am running Windows 7-64bit. I'd look elsewhere.",
        "mouse works. the device to extend the signal from the usb port is the reason i bought this wireless mouse",
        "This product works great for me. Right out of the box, batteries are even included. Easy to plug in, the driver installed quickly. I realize there are more sophisticated mouse(s) on the market but this one does the job for me at a reasonable price.",
        "Works quite well.Was a replacement for the same mouse that died after several years.",
        "I am a small person and this mouse is too big for my hand. Everything else about this mouse is great but I wanted to share my opinion for all of you with small hands.",
        "I received the mouse weeks after forgetting I ordered it. It doesn't work that great. The USB receiver is gigantic and has a pathetic range. (Its almost as big as the mouse, yet can't maintain a decent signal.) The mouse isn't accurate, and the same is true for the identical one my friend ordered. If you want to do anything other than web browsing, get a good mouse. If you only have fifteen dollars, you can probably still get a better mouse with it.",
        "My Laser 1000 broke so I bought this as a replacement. Then I bought the Laser 7000. Then I bought the Laser 6000... Someday I will learn not to buy a physically-used device w/o physically trying it first, lol! (You can always buy it online when you get home.) At least now I know I have working spares.",
        "This is a great wireless mouse. It is easy to install and works fine without any signal interruptions. It is comfortable to use and so far I have not had to replace the battery. I would highly recommend this!",
        "i have to replace the battery every four to six months. I use my mouse every business day, sometimes on weekends. This mouse works great. IT looks good and it feels good.",
        "I was looking for a wireless mouse for my den and this one is just great. Easy install, comfortable etc.",
        "I would highly recommend this product. It is very comfotable, and it has a very long battery life.",
        "mouse works fine except signal strength routinely comes in low and generates a \"low signal strength\". r2 batteries, relocate rcvr, reposition rcvr, invert rcvr ect take care of the problem, till the next day...",
        "First of all this wireless mouse eliminates \"The Wire\" which is a big PLUS. This mouse is comfortable to use and very reliable. A fantastic product for the money.",
        "I have been using this mouse for around a week now and so far I love it. I have found the precision is very good which makes it easy to navigate with. The design is very comfortable and I can actually move the mouse easily without constantly hitting the 3rd and 4th buttons. Overall I highly recommend this mouse.",
        "I RECEIVED THIS MICROSOFT PRODUCT D.O.A. ! THE LIGHT NEVER LIT AND I DON'T KNOW IF IT'S THE FAULT OF THE BATTERIES OR THE MOUSE. I WILL BE RETURNING IT AS I HAVE ORDERED ONE FROM BEST BUY THAT WAS ON SALE. IT DOES NOT USE STANDARD AA OR AAA BATTERIES. SO GETTING BATTERIES FOR THIS MOUSE WILL NOT BE EASY. AGAIN - I WILL BE RETURNING THIS MOUSE. A.S.A.P.",
        "I'm happy about being able to use it with either hand (carpal tunnel). It's very comfortable to use.",
        "Stopped working after less than 2 months. This is the 2nd MS mouse in a row that's gone bad. On my earlier 3000, the ratchet on the wheel went out almost immediately after I bought it. No more Microsoft mice for me!",
        "I'd just go with another mouse. Even at 15 dollars, this mouse isn't worth it. It comes with a huge ass receiver, not good if you want portability. The sensor is super jumpy, jumping about 15 pixels every movement. Waste of money.",
        "It may have been a fluke, because Microsoft is generally a good company, but the thing never worked out of the box. The red laser thing on the bottom never lit up. I returned it, but since it was shipped by amazon, i couldn't exchange it for a new one, so i don't know if a different one would have worked better.",
        "I killed my lsat one. Was so happy to get a new one. Love the old man butten (the magnifier button)",
        "THIS IS NOT A WIRELESS MOUSE.The pictures in Amazon are so misleading. To make this mouse work, it needs a bulky transceiver, with a wire. So when you're mobile, you have to bring one mouse and its mother. I don't want to express my anger here, but I give other customer a warning to stay away from this mouse. I will return it however cheap it is.",
        "This piece of junk comes with a wireless receiver almost bigger than the mouse itself! And this big detail is NOT mentioned in the product page. It is completely useless as a wireless mouse unless you want to carry around a huge wireless receiver with a long usb cable around, why not use a wired mouse instead? Total scam, shame on you Amazon!",
        "I kept changing batteries to see if I could get it to work better but nothing helped IT WOULD WORK FOR 24 HOURS AND THEN DIE I tried to give it back but amazons WEB PAGE MADE IT IMPOSSIBLE TO FIND there RETURN SECTION I wrote them and never got an ANSWER. I BOUGHT A LOGITECH FROM COSTCO AND IT WORKS GREAT"
    ]
}