{
    "entity": "Portable Air Compressors",
    "text": [
        "The instructions are not clear on this point, but DO NOT neglect the break-in period. Before the first use, run the compressor with the pressure valve open for at least 15 minutes. Only then, close the valve and allow the tank to come up to pressure.",
        "I bought this Porter Cable Oil Free Air Compressor to use with my finish nail guns. I got tired of lugging around my old Craftsman 33 gallon air compressor for small jobs and I needed something that's more easily portable. This Porter Cable Pancake Air Compressor fits my needs, works very well and is much easier to carry. It is still somewhat noisy, but it does maintain good air pressure, which is not bad for a 100 Dollar air compressor. It arrived in excellent condition and on time. I am very pleased with my purchase.",
        "Great little unit for the price. Manual/ directions are almost useless. Dont forget to do the break in period, no much mention if it in the manual. Open pressure valve on bottom of tank and run tank for 15 minutes. Then close it up and your good to go.",
        "AWESOME compressor! I absolutely love this pancake compressor, and the ease and convenience it provides is remarkable. Make sure you hold your compressor on an angle to drain any water build up each time you are done using it. You don't want any rust to form inside your tank and cause it to burst later on because of misuse. This tank builds up pressure quickly and doesn't need to run for very long to keep constant pressure. I use this for 3 main purposes, a 3\" framing nailer, a 2\" finish nailer and for blowing dust and dirt out of various items. I highly recommend this air compressor.",
        "this review is for the compressor Originally bought 2x of these, after 2 months of minimal use one of them had a bad pressure switch which would not tell the unit to turn off. I brought it to a local authorized repair shop who was backlogged 1 month, after calling in a month they said it would be another month. decided it was not worth the time and purchased my 3rd compressor. Wouldn't you know that after using it 3x to fill up tires I'm in the same position. the compressor will not turn off when full. Of the 3 compressors only 1 is still working.",
        "Junk. Worked well for a few months until the house cracked and now it will not build enough pressure to shut off automatically. Too late to return now apparently. Stay clear!!!! See picture.",
        "returned this compressor! I had high hopes, 4th day the compressor would not pressurize to the appropriate PSI. It was too much of a hassle to continue to troubleshoot. One problem resolved then another seem to arise. Bad product! I'm disappointed.",
        "We used this air compressor with a nail gun. We'll satisfied with the performance. We did use Lucas Oil with the nail gun. Probably wouldn't have needed to but we felt like it was cheap insurance to keep it running well. Built our pole barn with it and plan to build a house using it next. As a matter of fact, one of our general contractor friends was so impressed with its performance that he bought one after seeing it in action.",
        "This product has exceed my expectations, worked right out of the box, and fits nicely in my trunk. New to the compressor game, I didn't know what to expect, but I was able to plug it in and fill my car tires while it filled the tank. No leaks, the gauges work, and it's not loud (was worried about that). It's about as loud as my friends HDX 3 Gal. compressor he purchased from Home Depot for $130, but twice as efficient. I will update as time goes on, but was blown away by my first impression.",
        "I used this compressor along with a new brad/staple nailer I purchased at the same time. After reading the instructions and setting up the compressor, it ran like a champ and cut off when it was supposed to. I must say the compressor is a bit noisy but I expected this to be so. I love how portable it is, that it was easy to set up and operate and it will be a great addition to my tool collection. I cannot yet speak for the durability of this product but the initial use was great.",
        "I just received my compressor and read all the instructions in the manual. Some reviews insist you must run a \"break in\" period. Nothing in the manual and can't find the link referred too....asked a friend who's used many compressors in his life and he thinks it's nonsense. So..I just ran it briefly and it works great! Very simple and easy! My needs are very minor and I'll only use it occasionally...air in my tires, my tank for my water pump etc. I posted a question about the \"break in\" and waiting to see the answer. Any way; I'm very happy with this little compressor!",
        "The compressor works great. Ran it with the value open for the first 15 minutes as recommended. I have to say that the Porter-Cable instructions which came in the box are almost worthless! All it contains are warnings and not much useful inform. What bothered me the most is the paper claims that the tank has a limited life and that there was a sticker on the tank showing that date. There wasn't a sticker on the tank and this is a compressor not a carton of milk. Can someone explain what the concern is?",
        "Bought this thing 2 years ago and hadn't gotten around to setting it up until today. It won't hold pressure right out of the box. Porter Cable = Never again for me.",
        "Good compressor, but DO NOT ORDER THE ACCESSORY KIT. It’s cheap Chinese metal that broke as I screwed in the quick disconnect adapter.",
        "As others have pointed out in reviews, don't neglect the break-in of the compressor. Run for 15 minutes with the pressure relief valve open then ready to rock and roll. The sucker is loud, but is not advertised as a quiet unit as some others are. I'm using in a 2 car garage and it's not bad, but would wear ear protection if using indoors in a small space. It fills the tank in a minute or two, maintains pressure with no problems and does exactly what it's supposed to do. Good unit, would buy again.",
        "It's pretty loud, but you would expect that from an air compressor. It does what i need it to do and then some. Don't forget to tighten the knob on the bottom of the can for the air release or it wont work when you get it. More then enough force to clean and fill anything ive needed to so far. blown out multiple electronics and filled several vehicle tires. saved probably $50 in duster already and cleaned more items then i have ever had the ability to in the past prior to this. dont know why i waited to long to pick one up.",
        "I bought a 1 gallon compressor for $35 from Walmart. If you are new to compressors, don’t buy a 1 gallon. I am guessing even a 3 gallon would still be a huge improvement. Go for a larger storage unit like this one. It took me 15 minutes to adjust 4 tires (not even that low) with the original compressor because of how long it took to recharge (could just barely fill 1 tire.) I love this new compressor and can fill 12 tires (there are 3 cars in the household) in less time than 2 tires (probably 1 if I didn’t have to take the nuts off each valve and replace after filling) with my original compressor.",
        "This is quite ironic...I bought this compressor this week after a LOT of research - the key differentiation was that it included a small accessory kit unlike some other products at a similar price. Clearly, one of the pictures showed the included kit. I had waited an additional 2 days to see if the kit was going to show up separately. Today, I looked back at the product on Amazon and found they removed the picture of the kit and added an option button to purchase WITH the kit. Now I have to buy a kit but won't be buying from Porter Cable! So the product is now $99.99 WITHOUT the required kit. Not happy!",
        "I used this air compressor when I first got it . Worked my impact wrench just fine. The other compressor I had sometimes it would and sometime it wouldn't. Used it four days later and the thing still had a full tank of air. the other one would have lost pressure in the same day. This thing so far was one of the best investment I've made. I love this thing.",
        "Cannot recommend at all. After just one year, the air release nozzle on the tank is leaking, and the compressor probably only has two or three hours of use on it at most. This is a fundamental part of the compressor, and cannot properly function if it leaks. It is really inexcusable that it has failed this early. If possible, spend a bit more and get a higher quality compressor, probably worth the investment.",
        "For the price, this is an excellent DIY'ers small tool compressor. This will work for air nailers or paint sprayers. For high air flow requirements, this is NOT your compressor. It's only rated at approx 2.3 cfpm @ 90 psi and approx 3.6 @ 40 psi. This will not keep up with even a mini-grinder. These usually fall into the 4.0 cfpm rate @ 90 psi. Far too under-powered and too small of a tank for even such a light load. I still give it 5 stars for value for the DIY'er looking for a really good compressor for a nailer or similar tool. I love mine and know other's who have the same one. It's a good deal.",
        "I was disappointed. I live in a very rural community. I went to brick and mortar to see a box (which i found none) to research an air compressor not knowing how they work, what's needed, etc. I researched on Amazon a few days and made my choice based on value, name and what came with the compressor. Q&A asked if what I bought came with accessories, YES, it stated, the description also says it comes with accessories, but IT DOES NOT COME WITH ACCESSORIES!! The description is false.",
        "This is a solidly build portable compressor cabable of driving a nail gun or other tools—at 2.6 cfm it won’t run a paint sprayer but it will drive pretty much anything else including my nail gun. Best of all, the price is right! I’ve used it for about a week now building an 8’x16’ shed...framing, sheathing, roof, and siding. It’s worked flawlessly. Note: when I bought it 2 weeks ago, the price was $89...it has gone up about $30 in 2 weeks...I don’t know if this is because of the steel tariffs or what, but that’s a significant increase in a short time (mine as new at $89, rebuilts are now $79).",
        "High quality compressor, Has easily adjustable maximum pressure convenient for different jobs. Comes with a long hose, a tire pressure gauge, and an assortment of hose tips easily changed even under pressure. Maintains pressure well cycling on and off as needed.. Has a pressure release port on the bottom. The instructions recommend using this port after every job as it also spits out any moisture which accumulates in the tank from the compressing process. The instructions warn that failure to do this could cause rusting of the inner tank wall which could result in tank wall failure. In addition, the tank has a \"tank warning label\" which shows an expiration date after which the tank must be replaced.",
        "Louder than excepted, Keeps spitting out lots metal shavings, it's out put is lower than specified.",
        "I’m not sure how any homeowner survives without an air compressor. Luckily, I got a good one. It has been used each and every week for over nine years and it’s still going strong, as you can see from photos. It truly is maintenance free. No issues at all with leaks or the regulator. The air hose it came with did not make it that long, but I would recommend upgrading it anyway in order to get more flow for a good impact. I upgraded to a 3/8” hose and removed the quick connection to get that little extra torque in order to remove some stubborn bolts.",
        "A very nice compressor, especially for the price. Be aware that it came with bottom bleeder open. Didn't realize until I had waited for it to fill for 3 minutes! If it lasts, I can't imagine what more you could want for $100 bucks. I you are looking for power stapler/nailers, I saw this or a similar (Bostich) compressor being sold on Amazon that had a large and a small nailer, and a stapler for $200. Pretty good price for 3 nail guns.",
        "Decent air compressor. I feel like I got what I paid for. (Not cheap, but not expensive either.) It's pretty loud, and I probably should have gotten a larger one for the amount of nail gun usage I was planning on doing. That being said - it is very easy to use, holds it's pressure nicely, is pretty light, and nicely compact. Good buy for the money.",
        "Have only used it a couple of times so far, to top off auto tires...those small air pumps, no matter how impressive looking, are for roadside emergency only. Ordered this one, had excellent reviews, in a fit of exasperation...firing up shop size compressor, crawling over fire wood filling the bulkhead to unlock the doors and throw a 50 ft airline outside...grrrr...enough. Overkill for this purpose, but problem solved...charge it up outside, wheel it around in a wheel barrow (it's only 30 lbs, but at age 71 I defer to any mechanical assistance). I'm sure it will find other uses.",
        "All of the positive reviews are not surprising, this compressor is clearly a well-built, economical product. Unfortunately it was simply not powerful enough for the applications I needed. The 6 gal tank was exhausted quickly, even at only 15psi, however the compressor was not pushing much CFM at all. The motor on this unit is also really loud for such a small piece of equipment, sounds like a lawnmower engine and I ended up using ear protection because the duty cycle was so short I was exceeding 60db pretty frequently within a 90 min period. Again, really well built, but just not enough power. I ended up spending more for a 20gal unit which is much much quieter.",
        "I was a little surprised when I saw this compressor. I assumed it would be the size of the one in Home Depot. Much! bigger. The unit weighs 30 pounds and is balanced well at the handle. The compressor is not quiet, but much more quiet than my older Campbell Hausfeld. The two hose connection points are also handy for more than one tool. The operating pressure of 150 PSI is handy for any job from light sandblasting to inflating tire on my truck. I like this compressor.",
        "Bought this to replace an earlier model I've had for 14 years. Solid little device–very, very powerful for its size. Love the addition of the second output and the redesigned switch is a very welcome upgrade. The only lament–and this almost brought the review down to a 3-star–the power cord is WAY short. I placed this item in the same exact spot in my shop where the old one sat and it no longer reaches the outlet. By a good margin. Very poor choice–the cost savings per unit could not have been great enough to justify wimping out on the power cord. Still and all, a very good device.",
        "I have another bigger 12 gallon compressor but needed one to fit in an SUV. I really like it so far. I did notice he left side screw that holds the whole top assembly on was hanging on by a thread because when I lifted the handle it wobbled. I’m sure anyone who can use a compressor can use a screwdriver for a repair so not a big deal. I was happy there wasn’t any assembly needed other then the loose screw. I also had to tighten up the bottom moisture valve but I assume they are shipped that way on purpose/safety. Cheers",
        "I got a little nervous when I saw some comments that it was not a high enough cfm to use to blow out sprinklers. But it did an awesome job blowing out my 1.3 acre residential sprinkler system. I set it to 40psi and ran through my 7 zones in under 30 minutes. My local sprinkler company charges $55 bucks to winterize. So this pays for itself in 2 years even if I don’t use it for anything else.",
        "Great value for the price. It takes about 2 minutes to reach 110psi from an empty tank. Depending on what you used it for, but it had allowed me to complete framing a 2000 sqft basement using it primarily for a pneumatic nail gun shooting 3inch nail without the nagging wait between shots, shooting texture on sheet rock, all trim works, and finally, painting. And now it's a perfect tool to have around the house for a variety of jobs. Strongly recommended!! Get the Ampro A1460 18 piece air tool accessory kit too while you are at it. Perfect match between them.",
        "The compressor itself is awesome! The attachment air nozzle is SUPER cheap. It split in half while I was attempting to tighten the fitting... note that I used very little force.",
        "This compressor does a great job. We were able to air up lots of basketballs and bicycle tires in just a few minutes. I also topped off all our car tires. I really liked the long hose, and the use of quick-connectors. The included pressure gauge isn't great, but it works. We could also inflate our camping air mattress or just about anything else. Being able to dial in the output pressure is helpful. I am happy with this purchase and would not hesitate to recommend the Porter-Cable compressor.",
        "I had an older version of this that worked reliably for a number of years. I got a new one on sale for less than $100.00. It arrived and is basicly the same. I found out what was wrong with the old one and fixed it or replaced a pressure switch. I now have 2 of them that work well. A con I can think of is when running it is a little noisy. In reading the ratings I found how to 'Break in' the new one but in reading the directions, I did not see this. Overall a good reliable product for the money.",
        "The add clearly states 13 pc accessory kit for a variety of inflation and cleaning tasks but this was not included its hard to not infeer it was an error on in prof but unless a provision should be made as a consumer I was misled regardless and it would be an act of bad faith to not honor what would be reasonably extrapolated by any sensible person whom orders from your add.- Joshua bissot",
        "This was purchased for use in the garage. My son does a lot of motorcycle work, This unit is a good size, light weight. It keeps good pressure. The one problem is how LOUD it is. I was disappointed with the noise. We have a larger compressor that is noisy, One of the reasons we got a new one was because of the noise, this didn't help.",
        "Tank is smaller than I expected, works better than my other one of another competitor. Fantastic for every home garage, finally got a good compressor for the garage for dinking around. The perfect home garage tool, for: tires, air nailing, blowing off fans, anything you would ever need when you need compressed air at your house..... My only drawback, I wished I would have bought the same compressor but the one with the 2 nail guns and air fittings that was $60 more..... But that was on me, the compressor is great......",
        "Bought this to fill tires on my fleet of cars and motorcycles. Is a bit of overkill and clunky for the job. Worst features is no way to read air pressure on tires. I've found another (better) solution, but I'm keeping this in case I want to spray paint or drive nails.",
        "I have a compressor that sits under my workbench in the garage. It has a 20 gallon tank. I *CAN* drag it out and take it to my upstairs rooms when I have a baseboard job to run my brad nailer for... but that's a pita. There are many other times when I don't want to fill up a 20 gallon tank to 50 psi so I can add 3 psi to a tire that's just slightly low. This small compressor is portable and 6 gallons is enough for most jobs. Five Stars!",
        "Super little guy that meets all my needs. Between the tractor, cars, bikes, toys and balls, we use this thing at least four or five times a week. Reliable, good volume, sturdy and practical accessories. ****Update - Jan 2019 the release valve on the under side of the control panel broke. Super difficult to access, had to order the part cause no one carries this and aggravating after less than a year of use.",
        "Love this.Easy transport works like a charm.Would advise using Plummer’s tape on fittings.Have no air leaks.Just open release valve before first use.close it let air pressure build up and you are good to go.If not in use open release valve till next use",
        "I have used this compressor on multiple projects over the last 4 months and have been quite impressed. It ran a roofing nailer for a 10 square roof and kept up beautifully. It ran a staple gun for installing underlayment for about 300 square feet with no issues, and it has been great for finish trim. It's lightweight and very portable, as long as it gives me several years of service this was a fantastic purchase.",
        "I liked the portability. Specifically, you can fill the tank with air take it to your car, or where ever and use it. Just set the tank pressure and use pressure correctly and you can fill two to four car tires to 32 PSI with no probably if you cannot bring the vehicle close to an electric plug or have an extension cord. What I do not like, nothing, but since they ask - it is loud. (but what portable air compressor is not loud?)",
        "As expected, except the tire pressure gauge accessory did not work- the tool kit is pretty cheap- in hindsight I would have just bought the compressor by itself and selected my own hose and tools. Overall it is great- be sure to close the drain valve on the bottom before you try to air up.",
        "I needed to fill the tires on a golf cart and a garden wagon with pneumatic tires, at my county fair. Prior to buying this I used an air tank that I filled up at a gas station. Sometimes half the air would leak away while I was transporting the tank to the fairgrounds. This compressor eliminated that problem & now I don't have to run to the gas station for air. It's solidly built and works fine.",
        "Needed a compressor to remove lawn mower blades on my garden tractor and this little guy couldn't handle it. I ended up returning this one and buying an 8 gallon hot dog unit from Home Depot for $100 at Christmas. That unit works great. This one is probably OK if you don't need much capacity such as inflating tires, etc. but you'll need a larger one for more indepth tasks.",
        "fine compressor but disappointed when i opened to use and no accessories, the description i read when purchasing stated 13 piece accessory kit. So off to home depot at 9 pm to get accessories to finish my project. Other than that compressor itself is fine just make sure of what all your getting so whether or not to include the cost of accessories",
        "Like most light-duty compressors, this is one noisy bugger but that's to be expected. Great for pressuring up car/truck tires quickly. The accessory set is difficult to figure out as some operations like filling up a football or basketball require two different attachments to be used together. My purchase had no instructions for the accessory bits so it was like Rubik's cube to figure out. Pretty easy to carry around.",
        "I use this to blow my microfibre polishing pads clean while detailing my car. It’s my first air compressor and I’m very pleased that it’s so easy to move around and transport. It’s obviously loud but that was expected. The regulator knob works good at setting the pressure I want. I use a coiled hose and the whole thing fits nicely in the trunk of my car.",
        "Purchased to run a hopper to texture our ceiling ourselves, and used with nail gun to install crown moldings. This worked great! It is super noisy, but I think they all are. Easy enough for me and my husband to use, it worked great for our projects.",
        "we used this compressor a lot! for the car and for painting, it was super easy to use, and noisy, which is normal in all compressors! after few years still works amazing! I love how I can put it away back in its box to keep all organized!",
        "Very happy with the machine. The only reason I am only giving it four stars is that the drain valve leaked upon arrival. We had to send for more valves immediately. The drain valves are cheap enough, but I simply think you should not have to replace part of a brand new product.",
        "I bought a pancake from Harbor Freight...what a mistake. It didn't work first time out of the box and those crooks charged me $11 restocking fee for returning a defective product. Knowing I could count on Amazon and having some Porter-Cable products, I ordered this one. WOW! It worked...I followed the break-in procedure suggested by other reviewers and it works to perfection.",
        "Hard to make an air compressor motor quiet so no stars off for that. It's in the garage anyways. Works great. Turns on at about 120psi and turns off when max 150psi met. Couple quick release adapters on the air outlets already make for easy release and plug and play. Although you'll have to buy a separate air hose and tools for full capabilities.",
        "I purchased this compressor for use with airbrush, and my small sand-blaster. Also the usual checking air in tires and blow nozzle for cleaning. Works well so far. Can't beat the price for this quality.",
        "Just bought this on 3/24/18 and used it on 2 jobs and now it doesn't work at all, won't even turn on. I think it's under warranty? Anyone now how to get a replacement?",
        "GREAT buy! I am more than happy with it. Came in good packaging and without and damage. Perfect for light air compressor needs! Easy to use. Plenty of connections and controls. Rubber bottoms help prevent it from moving when the air compressor is running, but it still hops around over time so keep an eye on it. Perfect beginner buy, would buy again!",
        "For $99 this is an amazing little air compressor. I bought it to use in re-flooring my back deck using 2x6s. It ran like a pro and never fail to drive the nail perfectly. Now I was only shooting 26 nails per board then rest while I cut the next board but I could not have asked for better performance. I have no problems recommending this to the weekend project person.",
        "Received on right time and package was well protected. Quality is good. Value for money spend. Its my 2nd year and I have been using it for my Remodelling throughout year. No issues so far. I do recommend this sincerely. Appreciate much if you could provide a response if you feel this review is helpful. I’m trying to be honest in my review.",
        "OK its really loud. Wear earplugs if you're working next to it. It gets pretty hot. When you first set it up, make sure to close the drain valve under the tank. The instructions kind of suck. Other than that it does the job. I might update this after I've used it a while.",
        "Product arrived in record time. Was delivered the Post Office and they were not p0leased. Amazon is still NOT delivering to our door. I have tried several times to resolve. Hope it is soon. Product works totally as advertised and is good to move around. A little better moving tray would help with lifting. Longer or battery life would help with using outside garage area.",
        "Great little compressor. 2 air connections. Filled the tank from empty in about 30 seconds. Used with a brad nailer and drove about 50 nails and it only came on once for about 10 seconds. So much quieter than my old compressor. Very light and easily carried with one hand. Dialed in the pressure and never had to readjust. Highly recommend",
        "I've had this compressor for a few months now and have used it several times. I will inflate a tire very quickly (the reason I wanted it with higher CFM that most small compressors). Good quality and I can leave it set for weeks with the tank holding pressure (so absolutely no leaks). I can inflate bicycle tires with the air left in the tank without even plugging the compressor in between uses.",
        "Got this for my husband, he uses it to pump up tires on the farm and for blowing off equipment. This fall we are going to use it to blow the water out to our out building. We see not problems since our last one was half the size and it was able to do the job. In all he really likes it. It is not heavy and on the whole not too loud. We would buy again.",
        "WHILE MY UNIT CAME WITHOUT AN AIR HOSE, THAT WAS NOT A REAL PROBLEM AS I HAD A HOSE FROM ANOTHER COMPRESSOR WHICH DECIDED TO JUST DIE FOR NO REASON. THIS COMPRESSOR IS HIGHLY PORTABLE AND MANEUVERABLE AND, AS LONG AS YOU DON'T REQUIRE A LOT OF UNTETHERED AIR VOLUME, IT IS PERFECT. AS LONG AS YOU ARE PLUGGED IN, IT WILL SERVE YOU WELL.",
        "Louder than I expected. No prefilter for moisture, so not a good unit if you plan to keep pressurized. But, easy to carry (for a 59 year old) to the shed to re-inflate tractor and cart tires. Have used some accessories with this, no problems. The tank volume is small so when using tools, the compressor tends to be on almost constantly. Recommend you use hearing protection.",
        "My husband simply love this item, I surprised him with it, he said that he asked someone which was the best one out there and they told him this name brand, he has another one but It's much bigger to lug around, he said that they were selling quite fast at home depot so I decided to surprise him and was he surprised when the mail lady hopped out of the truck and handed him the box while he was outside lugging around the other one lol.",
        "To all weekend mechanics and honey do list heroes, you truly will enjoy this compressor! I fill my tires, use my air wrenches and nailers. It doesn't take that much room. All in all a great purchase!",
        "Love it is small and compact, it is pretty noisy so I had to extend a cable and put it in another room, but worked fantastically! Fills pretty fast and shuts off. Super easy to move around and lightweight for the HP. Highly recommended for price and production. I can use this for multiple uses around the house.",
        "This was a great purchase! It’s a wonderful portable air compressor as it’s light weight and can take care of multiple small jobs on one full tank. When it’s filling with air it’s quiet based on my personal experience with other compressors, but still loud enough to wake up the neighbors if you live in tighter housing units. The biggest value is its price and flexibility to take on myriad of jobs around the house.",
        "It’s the best value air compressor in its class. Perfect little machine except that it’s very loud. However, I would say that it makes up for the noise volume by being very light and easy to move around. So, go ahead and let the neighbors know when you are getting something done in the garage! This little red curling puck is the best choice and it’s bulletproof!",
        "Very happy with this purchase. The tank isn't huge but it works very well for my needs (mostly cleaning my room air purifier dust filters, removing dust from my hiking shoes, etc). It's probably paid for itself with the savings of not having to replace my purifier filters alone). I have no air tools so can't speak to it for that (though I imagine it's fine if your fine with it running a lot). I'd recommend getting a moisture filter if you need super dry air though as at least here in SoCal it condenses moisture.",
        "Easy to setup and use. Seems durable and well built. Far cry from the massive one my father used when he owned his own business but for the average home owner or hobbies/ running nail guns this is more than adequate. The tire gauge that is included is trash. Throw it away as gas station 99cent ones are better. Other accessories are solid. Worth the bundle.",
        "So far it works great!!! Used if for a framing nail gun & brad nail gun. It blows like da dickens!!!",
        "I got the set without the accessories because I'm picky. Follow the break in instructions like the other reviews say. Run for 15 minutes while the release valve is open. Good construction overall. comes with two quick connects. I ended taking one of them off and putting a recoil hose on it. One less point of failure.",
        "Works awesome. 2nd time purchasing this last 1 lasted 6 yrs until hubby left it near the street after filling tire & someone took it. My nail guns work great w/ it. Lots of power & I can move it around job site easy w/o having to extend & trip on hoses. It also fills the tires wonderfully. Just dont leave it unattended or neighbors get a hell of a steal.",
        "This is the third of these compressors I've bought in the last two years. Never had an issue with any of them. The first one i bought kept getting \"borrowed\" by my sons so I bought them their own. Very portable with good recovery for spraying texture, building fences etc. Only drawback is they are quite noisy but so is every other oil less compressor.",
        "Really did like this little guy. Had it for about a year and then the compressor stopped working. I did like how easy it was to tote around. Used it to run a braiding gun to finish my basement. Did the job. Wouldn't recommend for topping off the tires, unless you have 30 mins to spare.",
        "I've used this model compressor for at least 10 years and my old one finally gave up. Figured it would take both time and parts to fix if it was even fixable. Decided that the price of a new one was worth my time. I use it for everything; nail/brad guns, sprayers, cleaning, you name it. Works really great. Highly recommended.",
        "I waited for a week for this delivery and they sent a unit that is trash. Not working damaged unit, these people are starting to take their customers for granted and sending trash. I found out that the problem may be with a Company called CPO Outlets they are supplying these bad units to Amazon's customers.",
        "This is a great small compressor, builds air quick. A little loud but works great for small jobs around the house",
        "Works as advertised but depending on what you need it for try to get a bigger one. I bought this to dry off my cars and motorcycle after washing them to get those hard to reach places and the tank just isn’t big enough for me. But it’s all relative",
        "I had to return my original compressor for a replacement because the tank was not holding any pressure at all. Then the replacement had the same issue, so I had to google the problem and found that the item ships with the drain valve completely unscrewed (on the bottom), however the instructions do no tell you to tighten the valve before using. The compressor works fine now, but I had to really search the internet to fix the problem.",
        "I purchased this product a few months ago, and used it a few times before writing this review. Verdict: It works just fine. The included accessory kit was very handy as well. If I had to give a demerit, It would be the tire pressure gauge included in the kit. It's worthless; but I didn't buy this for the gauge. Filling tires and using compressed air to blow dust is all I've used it for, but it pressurizes rapidly and doesn't seem to need to run often to maintain pressure. I followed the break-in procedure described in other reviews posted here, so it is my hope that the product will provide years of trouble free service.",
        "Replaced a larger compressor that gave up the ghost. Only needed one that I can use for home projects and hobby work. After reading the reviews on a few other compressors, I decided this was the one for me. Works great for filling up tires on my vehicles. And will use it to paint some guitar bodies I am putting together. Runs my little nail gun as well. Perfect size, as I am not getting any younger, and the old one was bigger and not very easy to move, even though it had wheels. Thanks to all the other reviewers who helped me make up my mind on which compressor to go with.",
        "Can't believe the quality for the price. I'm not easily impressed, but this compressor incredible. Bought it for my deck project and it was plenty for my pneumatic framing gun. The regulator and two connector features is way above the price point!",
        "We compared this to the one at home Depot. Exact same model. With our points using our Amazon card we got an extra $20.00 off buying it from Amazon. Free shipping with Prime. We are happy. Takes up a lot less space in the garage than the big one we just sold.",
        "Needed another compressor in my barn since the one I have in the house is a huge beast and too hard to move. This works really well on inflating a tire on my lawn tractor that keeps going flat. It would be nice if the instruction manual gave you a little bit insight into which attachment is the best to use for each purpose, but I guess they expect you to figure it out on your own. Great quality. Light enough for me to move around.",
        "Exactly what I wanted. Was a father's day gift. However my wife did not know it required a hose so future buyers for gifts keep this in mind!",
        "I got this for my husband for Christmas but had a flat tire this week & it was so easy for me to air it up enough to drive to mechanic (had a drywall screw so needed plugged) -- very portable, easy to use, love it! We use it for bike tires, basketballs, car, etc. So handy & versatile. Highly recommend!",
        "I love this compressor along with the 50 foot hose I purchased. I have been using cigarette lighter air pumps all my life, and after using this one time I wished that I bought it sooner. The compressor is in my garage and with the 50 foot add on hose I am able to fill my RV tires with the RV out on the street. My truck rear tires need 80psi and the RV tires need 65psi and this fills them effortlessly.",
        "I've had this compressor for about a year. I use it for blowing dust out of computers, blowing sawdust off the work bench, putting air in tires, etc. Small tasks, but lots of them and making the use of canned air much too expensive. It works perfectly. But it's L.O.U.D.",
        "This thing is a workorse. It will make it to 150 PSI as advertised. You can adjust the PSI, but you have to re-adjust it a lot for longer projects. Works great for all the odd jobs (filling tired, blowing sawdust, etc...). I even used it to blow out the sprinklers. Other than having to recharge often, it did the job.",
        "It’s loud, but is to be expected. Works well otherwise. Has to connections for two different hoses at the same time. That was you can have one for mechanical connections and one for industrial if you want. It does not come with a mechanic connections though, you would have to buy it separately.",
        "Great compressor for what we use it for (light shop work, tires, etc) wouldn't be something it base my living off of but for a good compressor that gets used 1-2 times a week I couldn't be happier!!",
        "Very happy with the compressor. If I purchased again I would leave off the accessory set. In comparison to the compressor the 13 pc. accessory kit contains low quality parts and I would have purchased upgrade items in hindsight. For my usage of filling up bike tires, inflatables and blowing out my car the unit will be more than enough. Without the accessories I would have given 5 stars for the compressor."
    ]
}