{
    "entity": "Portable Air Compressors",
    "text": [
        "I would give this 5 stars, but i still need to see durability. I've have about a dozen compact air compressors that have been ok, but popped breakers and caused a few situations. This thing is as quiet as any large or small compressors. We were running 3 bostitch roofing Nailers. Shooting 40squ in 2 days with 3 Nailers going full time is usually allot to ask of compact compressors. The makita is WELL worth the $ to add this tool to your small business. Update-So I've had this all summer now. I used it to put down about 30,000 squ off shingles. We've ran up to 3 guns without a hiccup. Great tool, get one!",
        "People please don’t buy it. I’m a flooring guy and my purpose installation a hardwood flooring. The compressor from Makita so weak!! I can’t do my simple job, please don't repeat my mistakes and buy other brands! The price 320$ and I’m so angry because why i can’t return after one month?🤬🤬",
        "I can't believe how quiet this thing is! Such a VAST improvement over my old compressor that was loud enough to disturb people over 100 yards away! I can stand right next to this thing while it's running and carry on a normal conversation. This is very portable, but not exactly \"light\" to move around by the hand-hold, but I strapped it to a small lightweight wagon and I can easily wheel it wherever I need it. Best compressor I've ever owned!",
        "Was going to spend about eight hundred on a compresor to run a small shop but I really just needed a smaller one to run roofing nailers and other air epuipment for home remodeling. I LOVE this little comp. Runs so quiet you can talk on the phone standing right next to it. She only has a 4.5 tank but cycles and keeps line pressure up for no miss fires or jams in nailer or staple guns. If I ever do buy a larger one it will be a Makita. Customer for life. Plus this one came double boxed from the factory and is the most beautiful tool you'll ever own. $299.00 on Amazon money well spent.",
        "compressor arrived packed in two boxes one inside the other and there was no visible damage to either box. However, inside the boxes was a bottle of oil required to operate the compressor. There was no visible damage to the oil bottle but it had leaked about 90% of it's contents all over the inside of the box ruining the manuals and warranty card. Had to buy buy oil before trying out compressor but am very happy with the unit itself. It is quiet and pumps up to pressure very fast.",
        "Bought a DeWalt compressor from a local store and returned it after a week. Reason being is that it leaked. Badly. I should have known better as the reviews warned of exactly that problem but I rolled the dice and lost. I then decided to buy one online as the selection at the box stores didn't have what I was looking for: High CFM, low noise, and durability. The Makita fit the bill perfectly and I couldn't be happier with my purchase. It's quieter than what the online videos portray. I was really shocked at how quiet it is. All in all I highly recommend this compressor and have no regrets.",
        "Purchased in October 2012 from Amazon. Just buy it .. cry once. You won't be disappointed. I've also purchase two of the 2 horsepower models .. they are all awesome. I still have my 40 year old Campbell Hausfield 3hp 220v monster if I ever need to run a 3/4\" impact driver, or sand blaster, but at this stage of my life .. quiet matters .. I bought the CH new btw. DO the Break-in procedure as instructed. The oil comes packaged outside the machine. Cheers!",
        "I like the machine but if you try to use air tools ie cut off tool, air drill you are not going to like they state fast recovery but not good if the tank size is under 6 gallons, forget using a media blaster. My opinion is if you want something to run air tools this not the compressor you want even if they say it has fast recovery I wasted 300.00 for something that does not work",
        "What can you say about Makita. It is a well made, quality product. It is surprisingly quiet. Even though many people here have noted that, I was still surprised, compared to other compressors I've heard. As far as functionality... I have a HD 2500 Dodge 4x4 that requires 60-pounds pressure in the front tires and 80-pounds in the rear. Although ultimately successful, it struggles to fill the tires to that level, taking about four - five minutes per tire. I am supremely confident that on more routine tasks, such as running common air tools around the house, this would be more than the average homeowner would ever need.",
        "Just got it today, tried out the brad nailer and works great, pretty quiet. Takes about 2 mins to build initial pressure from startup which is nice and fast. I will update review after some more use. I suggest completely draining oil before putting in new oil. Take a look at the picture with the dirty oil that came out. Also don't forget to Break in the motor, after filling with oil before using.",
        "My compressor came damaged and it suspiciously looked like someone had tampered with it. The plastic wrap and straps looked like they had been removed, the top tanks paint was worn down to the metal on one side and the protective dust cap for the air filter was missing. Other than that it seems to work fine. I put oil in it and did the break in procedure, but only time will tell.",
        "I bought the mac2400 to replace a 20 year old craftsman that was too big and too loud. This thing makes me smile when it’s on and doesn’t kill my mood when it cycles. It does quite well with my ingersol impact wrenches for diy car maintenance. I am confident it could run probably 2 or 3 framing nailers as well but I have yet to see in person. This is a high quality high compressor, my only gripe is it is a heavy sob and if they could make the tanks aluminum that would be tight.",
        "This little machine is a workhorse. The only problem is the reservoir is a little on the small side for medium to larger projects. Filling car tires will drain it pretty quickly as will any heavy duty pneumatic tools but the compressor does a good job keeping up with the air flow. It is also pretty quiet compared to other compressors of the same size. I will caution though that this thing is a little heavy, so if you can, buy or build a cart for it for easy movement. It has a carry handle but the odd shape and weight make it a little difficult to carry around.",
        "I ordered this compressor on Amazon around 2015. It’s a fine and dependable machine and I highly recommend it. At the time I wasn’t aware how much this company was held in high esteem. If you ever lease equipment from Home Depot you will find this company’s products in use due to their durability and performance.",
        "Great unit. It is quiet compared to other compressors and it is portable. But both of these issues are relative to your level of comfort and ability to carry 50+ lbs. To my hearing it is not a high pitch level of discomfort that I used to have from my big 30 gal. Craftsman and I can still carry this unit to a job site.",
        "Replaced a 20 year old Porter Cable compressor with similar form factor and specs. Tank welds finally cracked due to rust. Much quieter! A little heavy for frequent portability. Robust basic construction and fittings. Nice drain valve. Manual recommends draining and leaving open between uses. Needs oil, but that probably makes it last longer and run quieter vs. the oil-free options.",
        "This Makita MAC2400 is powerful and fairly quiet. The directions are simple and the shipping box contains the necessary oil to get it working. The compressor easily stays up with my nail gun. I should have gotten rid of my noisy PC pancake compressor years ago; after 10 years it finally died.",
        "I bought this compressor thinking that I would use it as a small shop air system and if it was not powerful enough, use it as a portable compressor for running my nailers. In the end, I found it inadequate for either. Most tools need more than the ~4+ CFM and or 4gal tank (except nailers) but it is too heavy and ungainly to really be portable. It appears well built and is nice and quiet, but I question it's utility except in specific uses. Also, the return shipping is $70 so that was not a fun exercise.",
        "This was a great purchase. I don't use it every day but do change the oil every year. this is running smooth for last 4 years with absolutely no complaint.",
        "This one replaced a 2004 model, different brand. I am very surprised how much quieter this unit is. Crankcase holds a small amount of oil. Even with the recommended oil change every 3 months, a quart of oil might last a couple years.",
        "A bit heavy to carry around, but works great. This unit can also do a little more hard work than the cheap compressors. It isn't meant for large jobs or air-intensived tools, but it will run a lot of different equipment for a quick job.",
        "This thing is QUIET!!!! (at least for a compressor). I can run in the garage and I can barely hear it in the house. I can also use it inside with out being annoyed at sound. Its cycles quick and seems to be very quality. One grip is the air intake sticks out the side a little, so i could see that getting damaged if bouncing around in a work truck. It's also a little bit unwieldily to carry, but manageable by a fit person. I wish there was an optional dolly/cart for this. I plan on making one soon with wheels to make it east to wheel around.",
        "Wait till you see the cart I built for this fabulous compressor. I invested considerable time researching compressors and this one fits our needs to perfection; the most amount of compressor for the least amount of money. Love Makita for this excellent machine that speaks of solid engineering design. I must commend Makita for the superb job of packaging this unit. I cannot remember anyone doing a better job. Zero disappointments.. Speedy delivery (thank you FedX). Will post pictures later.",
        "With all the outstanding reviews on this compressor it is hard to further praise this product without duplicating what has already been said so I'll keep it short and sweet. The MAC2400 compressor arrived on time and in perfect condition. After the break-in period I put the MAC2400 through some tests and I must say, I was totally impressed with the capacity, short recovery time and the quietness of this compressor. I use this compressor for my nail guns, an HVLP spray gun, inflating tires, using an impact wrench on my cars and blowing off tools. It's everything I need! It is powerful, quite and has a small footprint which is an important consideration for my small shop. Great tool!!!",
        "I wanted a compressor big enough to drive flooring nailers or spray painters, but small enough to be \"portable.\" Small enough to just plug into a standard wall outlet. This meets my needs. It's not a lightweight by any means...anything heavier would be a challenge to lug up and down stairs. I can manage this one on my own. It drives my Bostich flooring nailer at 90-100 psig easily. Also convenient to have around for keeping tires properly inflated. I built a small rolling cart to make it a little easier to move around areas where I don't need to lift it. Oh, BTW... compressors are noisy, so get yourself some of those foam earplugs and use them!",
        "I am a big fan of Makita tools. This compressor runs very quiet. Pumps up fast. Not too heavy, was able to lift it up to a shelf about 6 feet off the floor and it doesn’t take up much space either.",
        "Arrived on time , no damage , complete package including the oil. This compressor is so quiet compared to my old one . runs smooth , no leaking down ! It is a little heavy ,so I made a little coaster with locking wheels ....no more problem . If your looking for a smaller unit that 's well made , quiet , maintain psi. At a good price , This is it ! Dave",
        "The output of the compressor is rated at 4.2 cfm @90psi and my hand grinder is rated at 2.1 cfm @ 90psi and the pump could not keep up. Within a minute of using the grinder the pressure dropped below 90psi and operated around 20-30 psi at low rpm's and once stopped the recovery time to repressurize took forever. For the cost of this unit I expected much better performance. I have had great luck with Makita tools until this experience.",
        "I received my Makita air compressor and was glad it arrived in good condition. I was worried after reading the negative shipment reviews. The air compressor is very nice and feels solid. The compressor is not as quiet like a lot of people make it to be. So far I’m pleased with it. I give it four stars! Would of like if the cord was longer , since it’s recommended from the manufacturer to connect it straight to a outlet for better performance and protection of the machine.",
        "I liked the fact that my purchase arrived in less than 2 days! Thanks Amazon! They even brought it in the garage to protect from porch pirates! The quality of the air compressor is very evident from the flawless paint to the quiet running compressor motor. The compressor fills quickly and is ready for use. I’ve only had it for a short time but look forward to working with it.",
        "Bought the (used one, returned) and saved enough to make it worth while. The machine will be used in a non-commercial environment (home/auto). It arrived quickly and very little packaging damage. The item is packaged GOOD by Makita. Slight damage (minor) that I assumed was caused by the return from original owner. The MAK2400 looked like it was NEW and never used. The only minor damage was the plastic gauge lense was slightly broken (no big deal) and one tank with a small dent, no big deal. I was very satisfied with the overall packaging and transaction. Would do it again, if fact, I have on several other items and very satisfied with all transactions to date.",
        "Purchased this compressor to replace a twenty year old Emglo. I read the reviews on Amazon as well as other sites and chose this Makita. I am not at all disappointed. I use this compressor professionally and enjoy the quiet operation as well as the capacity and scfm rating. While true that it is heavy, I would not want a light weight when using it day in and day out.",
        "I have tried to own several compressors for home and light construction uses, trying to get by cheaply. (One can spend a lot of money in such a pursuit.) This Makita is, in my opinion and for my uses, a perfect low cost air compressor solution - and an end to the pursuit of lower cost cost compressors down the money hole. It is a solid machine which is portable, but not so portable that everyone and anyone will want to lug it around (and consequently abuse and misuse it). I purchased my unit, the, from Amazon. Shipping to Alaska was easy and the unit arrived in perfect condition in a very heavy-duty factory shipping box.",
        "A bit heavier, but so much quieter than my recently retired oilless pancake compressor. Much easier to use in my home shop which ranges from light duty tasks to continuous nailing. Gauges and adjustments are spot on. The upgrade in quality appears well worth the price. Well engineered product.",
        "It's portable, sort of. It's got a handle, but it's heavy. You can skip the gym after moving this out of the basement and into the back of your pick-up truck. Quiet, which is great. Quality unit all the way around. I really like this compressor.",
        "Easily powers Bostitch floor nailer and so much quieter than my Bostitch oil-free compressor. Has carrying handle but I don't find it all that \"portable\" (especially at end of day - but I'm older and gray haired). A nice, sweet, well built unit.",
        "This is a portable Air compressor, however it isn't light. It is a work horse and very dependable. Extremely heavy duty and last for years.",
        "Excellent! Very fast charging. Not very noisy at all. Best quality you could expect. Runs a framing nail gun like nothing. Blows air hard and long. Great purchase",
        "Compressor was delivered without oil filler/crankcase breather, part number 324003-E. I have not been able to find a way to get Amazon or Makita to send me the missing part, so I'll try this. Readers: This is a superb product, quiet and strong. It's definitely five star, if you receive all of the parts.",
        "I think I have purchased my last compressor. This thing is nice and quiet, refills quickly, and can be carried with minor grunting. If I used it more I'd mount it on a cart, but for my homeowner needs I can use the exercise. I'll be following all the care instructions and expect to have this thing for a long, long time. It looks and performs like a quality product. The two air line connections on front are very handy. It works so well and refills so quickly that I will probably try to use this for sprinkler blowout (with a larger external tank inline).",
        "Awesome compressor, I put this compressor threw the ropes and it just took everything I threw at it no problem I’ve had it for over a year now with no issues",
        "Very quiet. Love it. Love it. Love it. Reliable. Extremely quiet air compressor with tons of power. Can easily run three to four guns.",
        "Very quiet, and dependable. I bought this one to replace one just like it that I've used with my airbrush business for ten years. When this one wears out , I will purchase another Makita.",
        "Arrived almost immediately from Amazon, in perfect condition. Filled with oil, ran it with the valve open for 20 minutes to break it in, and it works flawlessly. I don't find it actually all that quiet; you still need to basically shout to carry on a conversation within about 25 feet of it. It also vibrates the entire floor when refilling. I guess this should be obvious, but it comes with an air filter packaged separately. This needs to be installed before you can use it! The filter housing seems quite cheap and flimsy, but seems to be doing its job just fine. Very happy with the purchase, and with Amazon's service. Would buy again.",
        "Great, quiet compressor. Builds up pressure in a couple of minutes due to small air storage tanks. Compressor shipped with great packing. This was the easiest heavy item to unpack that I have ever received. It is great that the packing did NOT have to be destroyed to remove the item. I don't plan on sending it back - but I will keep the shipping carton a few weeks just in case. I am VERY happy with this compressor. I sold my loud 5 hp, Craftsman air compressor with a 40 gal tank. It would take 8 minutes to build up to cut-off pressure with it.",
        "Works great. Have had no issues with it. Wish it came on a cart to wheel around. Pretty heavy. Made my own cart, but would have been better if it had been made with wheels.",
        "Makita’s claim of a lower noise level for this efficient tool is accurate. The compressor is not light weight, but it is luggable. I keep it in a workshop corner and use a hose and reel long enough to reach any location in the room.",
        "I bought a MAC 2400 to replace the second Porter-Cable 6 gal pancake compressor I've worn out. Several things jump out at me right off the bat. Without scientific measurements, this compressor seems about half as loud as the PC. And the noise isn't as high-pitched and piercing. The machine is much beefier; gauges and drain are better protected Has an air-filter (doubt I need it) Weighs a lot more. This machine cost 2x's the PC, but it appears to be well worth it. I hope to remember to update this review after I use it a few months",
        "I received this compressor in excellent condition, except for a little external packaging damage. I am totally pleased with this unit's performance in my home workshop. It does everything that I need and then some. A close friend of mine has a comparable Dewalt unit, and both of us have noticed that the Makita is substantially quieter, which is very important in small enclosed work area such as mine. I highly recommend this compressor to anyone who is a home hobbist or for less demanding construction site applications. Also, it was delivered to my home sooner than the projected delivery date,... a big plus, for an impatient soul like me. Thanks again. GJM",
        "Works great but tank rusted. I even opened to valve after each use. I would buy again.",
        "I purchased this compressor basing on the reviews which rated it highly for low noise level, and it did not disappoint. I keep it in my basement shop and use it for hobby woodworking and house maintenance - it re-charges quickly, the noise level is not too high. The shipment arrived very quickly and w/o any problems. I prefer a oil-lubricated compressor because of better longevity and lower noise level. So far I used it with a brad nailer, finishing nailer and a stapler, soon I plan to purchase a framing nailer and use it for basement finishing - framing interior walls. The compressor is portable, but on the heavy side (a good thing, does not wander over the floor).",
        "Not quite as quiet as I expected from other posts but it is a tremendous improvement over our oilless unit. Makita must have listened to the packaging criticism as it was in a sturdy cardboard box with good support and the air cleaner was in a protected area. Not a scratch. It won't handle an impact wrench unless you go in bursts but since I was forewarned of this an auxiliary tank will be added. All in all it is a good purchase and fits my needs exactly. This sucker is HEAVY and I keep it on a dolly so the drain valve is easy to access.",
        "After reading all the reviews,I ordered this compressor. It seems so far to be exactly what I expected. I have mounted it on an old two wheeler I never used,so it worked out pretty well. Like another review, I also hooked it to a rapid reel. It is very quiet compared to my 25 gallon one! The reason I gave it a 4 star rating was a gauge was broke when I received it. From the other reviews I would think Makita would start packing their units better. One call to Amazon took care of the gauge and it was very fast service. As far as the operation of the compressor ,great so far.",
        "Best compressor ever! Pancake (reed valves) compressors burnt up in 10 years, 3; ALL were not oil bath large piston. Should have made this move after first read compressor burnt up!",
        "Heavy but puts out a steady supply. Can run air tools briefly. Not enough for continuos grinder operation. Have 150 feet of hose so can run it anywhere in/around the house without moving. Quiet. Also quite a nice compresser.",
        "Works great. I wish there was a compact readymade factory accessory to purchase enabling carting it about at the jobsite.",
        "So far it has worked perfectly. I used it to put on my new house roof with a Bostitch roof nail gun.",
        "The unit is quiet enough for me but I should have been more careful with my capacity needs. I thought I'd be able to run a die grinder for more than 30 seconds.Admittedly it was due to my lack of research. I probably should have looked at something in the 8-12 gallon range.",
        "I was concerned from some of the previous reviews, but it arrived today, I plugged it in, broke it in according to the manual, and it works great. It is quieter than any of the other portable ones I looked at, although you still can't hold a conversation next to it when it is on. Some of the reviews indicated broken plastic, mine wasn't broken, and by looking at the packaging, don't see how it could break. I did have to change the air chucks as mine wouldn't fit what was provided. It is heavy though, you will need a wheel barrow to move it around the yard. You won't be taking it on top of roofs. June 2013.",
        "Powerful Excellent Compact, Extremely quiet!! Heavy for its size.. Definitely recommend and would buy again...",
        "An all around good product. Heavy but only because it’s built so sturdily",
        "Great product. Works well and is heavy duty. Not as portable as some units due to the weight, but it is exactly what I was looking for I appreciate the stability.",
        "refills from 0 to 140 psi in 45 seconds, quiet enough to work in the same room, nice finish, heavy man! Absolutely love it",
        "Purchased this compressor, ran it a total of 4 times to air up tires and only owned it for a total of 18 months. Now it needs a new pump for $310, which is essentially the price of the unit. Makita won’t help. WHAT A SCAM! I will never own another Makita tool. You’ve been warned: Makita equals zero quality.",
        "After enduring cheap, loud, and annoying compressors, I figured it was time to save my ears and nerves by investigating and purchasing a quiet and portable replacement. This is a great product and is truly quiet and efficient. It is somewhat heavy, but manageable because of the well padded and placed carrying handle. I decided to handle the extra weight which I feel is offset by the added features (higher capacity, twin gauges and outlets) as compared to Makita's lighter MAC700 model. The compressor arrived in pristine condition and without any shipping damage.",
        "I got this when I was renovating our basement and needed to do framing and finish nailing. I purchased this to run my two nailers and it works perfectly for that. Now that we're in a new house with new projects I've already used it to finish nail trim and to air chisel tiles and an underlayment. Great pressure and no leaks so far. Works great to quickly fill up tires too. It's noisy but it's a compressor so I just use the 50' hose and stick it outside.",
        "what I like nice and quiet you could work in people house with out dragging out of the house. what I dislike to heavy to Transport need to stay I garage just get one you won’t be disappointed",
        "Excellent, well built compressor. I had a Husky, which I finally just gave away. This is so much better. Quiet, does everything it's supposed to, and does it well. New, it arrived with a cracked case, which means it leaked oil like crazy. This was fixed under warranty, no problem. I love this unit.",
        "Arrived well boxed. Quieter than our old Emglo which has worked hard for 15 years and continues to chug along, but definitely not made in the U.S. like it. The oil level indicator window is more convenient than a dip stick. Silver paint flakes were all over the inside of the oil fill cap. Time will tell more than anything.",
        "I bought this compressor for use with a Lotos LT5000D plasma cutter and it works great - it is able to supply the cutter indefinitely. This compressor is very sturdy, which is my favorite feature. I'm willing to bet I could throw it down a few flights of stairs without damaging the motor or most of the important parts. It doesn't leak at all. It still makes a significant amount of noise but is much quieter than most compressors. The air filter is a cheap afterthought and it hangs off the side just waiting for someone to accidentally bump into it and break it but that's really the only minor flaw in an otherwise perfect product.",
        "Bought as a gift for my handy son in law. He uses it to craft and support home improvements. High quality machine. Very quite.",
        "Much quieter, and sounds smoother than my old compressor. Don't expect it to be too quiet though as it is a compressor after all. Quality seems very good. I love the little window that shows the oil level at a glance, as opposed to pulling out the stick and squinting at it for 5 minutes to find oil. Its a bit heavy, but is pretty well balanced and compact, so carrying it doesn't seem that much harder than my previous compressor, which was quite a bit lighter.",
        "I am using this in my upholstery shop with 2 staple guns connected. It is quieter than the craftsman I had for years and the quick connects do not leak! I love it. The packing was superior. Triple layers of cardboard. She came out of the box looking perfect. I feel like I just had a baby and can't shut up about how perfect she is.",
        "Outstanding! Works extremely well! I tested it with a pneumatic impact wrench. It removed and put back on 12 lug nuts before needing to recharge. Then it only took 45 seconds to recover. Less than 1 minute from 0psi to full pressure. I also ran it off of my generator and it was able to start and run it without any issues. Very Pleased!!",
        "The quietest air compressor i have owned. You need to add the supplied oil before use. You also need to install the muffler and oil cap. Easy process.",
        "Great compressor. Supplies enough air for my gravity feed spray gun. Quiet",
        "While the Makita is slightly more expensive than other names brands, I will tell you for the short period of time I've had this unit it is money well spent. And when people talk about the low noise level of this unit, ITS TRUE! Amazingly quieter than any other unit I've owned. I broke in the unit as the manufacturer suggested. I ran for 30min+ UNLOADED after adding the oil. So far I think I made a really smart, long term decision here.",
        "After about 4 months I noticed paint had flaked off the end of the lower tank. Other comments mentioned paint issues, thus I deducted a star from the rating. I touched up the tank with a name brand anti rust paint and have had no further issues. I had to snug up the fittings to stop some bleed off when it was new. Otherwise, I am quite happy with the compressor.",
        "I bought this from amazon.com about 7-8 months ago and I was replacing a 2 gallon air compressor so this was definitely a step up. I was looking for something that wasn't too noisy either. MAC2400 is quiet in comparison to some other compressors but it's still pretty noisy. Seems to have to refill often too. Very sturdy and heavy. If you're a professional and had to bring this to a job site you most definitely could. I use it in my woodshop(garage) for multiple purposes. So far so good, I am a Makita fan.",
        "great compressor keeps up with my texture hopper with very slight drop off on pattern",
        "This is my second makita mac2400 off of amazon! The reason for a second one is because my girlfriends dad who owns a roofing company and loved the compressor he stole it from me! (Not really) he paid me for it but its so nice when u can listen to music over a compressor. Be able to communicate and not have that crazy motor running all day . Absolutly love this compressor and would buy another if mine ever quit",
        "I got this for Christmas 2018 and I did the whole start-up thing and found it to be what I had seen on a video on it. It was not that heavy to move, not that noisy and all around, pretty much what I was looking for. It, I think, will come out to be better that my craftman's compressor that it replaced.",
        "This is a great air compressor that is much quieter than the porter cable pancake. It fills quickly and appears to be very well built. If you've never used an air compressor before, be sure to read the instructions all they way through carefully before turning it on. This unit is oiled so you must add the supplied bottle of oil first. The tags on the unit itself remind you which is good, but they could have also added a sticker to show where to attach the supplied air filter.",
        "Great compressor i replaced my PC Pancake with this fine product and i know there is a differance in the size and weight, but i was alittle shocked how heavy it was. that being said it is still very portable - i just bought more hose so i don't have to move it as much. I love the 2 outputs - it has come in real handy on the job site. runs framing and finish nailers at the same time with no probs. It is also quiet compared to my old one. Overall I love it!!! great work Makita!!!",
        "I am thus far impressed by this unit. It is compact and efficient. It is NOT a work horse. If you are looking for a work horse consider a much larger compressor. This unit is enough for many \"air blowing\" jobs in the hands of a handy person. It is heavy at 85 lbs. but the design allows you to pick it us easily and move it short distances. Consider a wheeled cart for working in large areas.",
        "A little heavy but definatly worth it for the performance.",
        "Very nice and quiet, perfect for work or just around the house use . A bit heavy . Works great",
        "Received this unit in February. Followed all prep instructions, and unit runs like a swiss watch!. HOWEVER....... One area of the double accumulator tanks, has paint pealing off!!!! I would bet, that there was oil on the tank, that was not cleaned off before the unit was painted. So much for quality control!!!!",
        "I was worried about this because of the so many varied compressors out there. I wasn't sure if I chose the right one. I got it and I am completely happy. It is just wonderful. Well made and compact. It is so quiet, my wife is very happy also. The old one I had was so noisy all the neighbors could hear it.",
        "I bought this unit to use in a carpentry business I recently started. This units quickly recovers, and has no problems supporting two framing guns working hard. The unit is quiet enough that while it is running while located in my cargo trailer I can easily work inside the trailer and even carry on a conversation without shouting. This is one of the most efficient and quiet compressors I have been around.",
        "Very happy with this unit so far. It's very quiet so I run it right in the garage while working and can carry on a conversation with it running. Have used it to seat the bead on motorcycle tires, run a rattle gun, air ratchet, blower and tire inflator.",
        "After retightening all the friggin screws I'm still getting vibration noise from the top and bottom front face plate. Other than that it's a top notch unit. Arrived in great condition and cycles quickly.",
        "I didn't fully understand how heavy and powerful this unit is.. As a senior citizen, I had to mount it on a hand cart for portability...Check the weight. Heck, it even supplies a small sand-blast cabinet with storage tank, and every other pneumatic tool in the shop.. Love it. -pp",
        "Bought this compressor for fencing and a casual framing. Couldn't be happier with it fills up in less than a minute. Noise level is even lower than expected. Weight it the only thing I would warn people about if you have a bad back this is not the compressor for you",
        "Great compressor, lots of power, not too loud. a bit heavy, but worth every penny.",
        "After listening to others complain about receiving their compressors damaged, I was concerned. However, the problem seemed to be with UPS, not Fedex. So I ordered the compressor, next day delivery. The unit arrived today via Fedex and was in perfect condition. The compressor is everything folks have said. Quiet, powerful and quality built. I can add nothing more nor praise it more highly than others before me. Absolutely 100% satisfied.",
        "I love my compressor. It is soooooooo much quieter than my last one.",
        "Perfect. Just as I expected. Arrived in great packaging. Quiet, powerful, looks good. Even my wife thinks it looks nice.",
        "Excellent little compressor that perfectly suits my small woodworking shop needs. I use it to drive brad nails, blow off things in the shop and to inflate various things. Works flawlessly for these tasks without the need to constantly fill the tank and at a very reasonable sound level.",
        "Fills very quickly. Significantly quieter than any compressor I've ever used. With the garage door closed you can just barely hear it from 25 feet away. That said, bear in mind that it's heavy and somewhat awkward to carry. My wife can't lift it, and my 16 year old son really struggles to move it with two hands."
    ]
}