{
    "entity": "Portable Air Compressors",
    "text": [
        "I was initially put off by some of the posts, regarding trouble with cool, and/or cold starts. Sure enough, the unit I ordered started having start issues at +/- 65° f. It is 37° F outside right now, and this compressor has been outside so it's good and cold. I have been draining the oil out for two days. Today I added the full synthetic oil in the picture, and began trying to get it to start. After three resets of the thermal load switch, the unit started, and ran like a top. It's just as I suspected. After changing out the factory fluid with 100% synthetic, it starts much better. Hope this helps.",
        "I gave this 5 stars so people will see this I wanted to give it three stars because since the day I unboxed it if it was slightly cold(below 70 degrees Fahrenheit) it would not start for more then a few seconds and throw it's own overload switch I don't know if it was a faulty switch or what but I finally had to bypass the switch because I couldn't take it any more now it works fine and I know not safe to bypass a switch but you have to do what you have to do in a pinch",
        "Just got in a few weeks ago. RELATIVELY quiet for a compressor. I like it a lot. The brass drain valves seem a bit inexpensive and need to be tightened down moderately hard or they leak. Gauges are plastic but well protected. Compressor on pressure set at about 97,98, shut off at 125. About the heaviest portable that you would want. Don't get this is you want a light portable. Very compact which has been nice.",
        "I use to own a porter cable pancake compressor 150psi and a 12g craftsman compressor and this little guy blows them both out of the water. If your looking for a quieter compressor go with this one. I owned 2 oil free compressors and the biggest issue I had with them was that they were so loud. I work out of my garage and that noise scares the crap out of you. This compressor is quieter \"due to it being oil run\" but I really like the recovery time. On empty the tank refills in about 1to 2 min. The recovery time is something like 18 sec. Great compressor highly recommend",
        "worked great for the 1st 6 months. Now it runs constantly, kicks the breaker, and can't keep up with even the lowest cfm air tools. Because it runs so much trying to keep a nailer going it will over heat after 20-30 mins and then you just got to wait awhile before it will reset.",
        "This compressor fills up in about 90 seconds to 120 psi. It keeps up with demand very well also. Would not be good for constantly on with say a blow nozzle but great for home use",
        "Best compressor for the price. Best thing about it is,' fast recovery time, 4+ cfm, oil lubricated and being able to order any part,' pistons, head. rings etc, online.' Some other brands of compressors you need to go thru a dealer to get them fixed. Just something to consider before purchasing..",
        "Works as advertised. Supplied with appropriate amount of oil in reservoir. Has brass quick connect fitting already in place and is airtight. Started it in heated space so cannot comment on operation in cold temperatures. However, if you read the manual and operation of all compressors in general, you would know that function could be compromised if ambient temperature is below freezing. Use full synthetic oil if you want reliable function at cold temperatures. Manufactured in China and branded by company out of Cincinnati.",
        "Crazy loud, and won’t run on a 2000w generator, other then that after u find a powerful enuff source of power it runs and works amazing!",
        "This is modeled after the Emglo that I had for twenty years and used every day for the first 10. A real die hard. The only improvement that is needed is it is very cold natured and hard to get going on cold mornings. Mabye a larger start up capacitor would solve this problem.",
        "I'm a professional. This was a replacement for the similar Emglow that lasted over 2 decades. So far, so good!!! Hopefully won't need another compressor for another 20 years!",
        "Had it shipped to my ranch in Kansas when I got back there and tried to use it it would not work. I let it temp warm up and still didn’t work at 68 degrees. I hade to go buy a new one to get the job done. Brand new out of the box still does not work.",
        "I don't have a lot of experience with portable compressors but so far I've loved this thing. It's small enough to haul anywhere(unless you can't lift 60lbs), and kept up with the floor nailer I needed it for. The instructions mention you can't use this in cold weather which in my experience I've found to be quite true.",
        "trips overload switch several times on cold start very disapointed",
        "Compressor arrived flawlessly, bit confusing on if oil was in it or not (it ships full). Ran it for about 30 minutes with all valves open then went to town. Handled my touch up HVLP spray gun perfectly, and I think will run a lower CFM full size HVLP gun perfectly fine. Its portable but a bit heavy, still its a much better build than you'll get from a big box store in this. A must have for the avid DIY'er.",
        "Does not restart after you use some air. Called customer support and was told it had to be plugged directly into 20 amp circuit with nothing else on the circuit. Had to be warmed up if it was less than 60 degrees. How often do you have a job site with a dedicated 20 amp circuit for your compressor? Oh and for 6 months of the year you can't use it.",
        "First use out of the box, compressor tank had a hole in the side, it also spewed oil while in use. Senco has plummeted as a brand a completely worthless compressor!",
        "I really like this compressor! It's built great, refills quick, easy to drain water, just an overall nice product and worth the money. The one thing stopping me from giving it 5 stars is the fact that is wont start in cold weather (below 40F) which is a bummer... Had I known that when I was shopping for this, I would have bought a different one. That being said, this thing is really nice in above 40F weather!",
        "I have purchased lots of smaller air compressors for my shop thru the years. Porter Cable, Dewalt and other brands. None of these lasted more than a few years and were very noisy to work around. This Senco is much quieter and works great. Fast recovery dependable operation. I have found it to be the best compressor available in this size.",
        "This compressor will not run in cold weather. I have had numerous oil bath compressors but they would all run unless it was extremely cold. This one continues to throw the motor protection switch at 60 deg and below. Throw away item.",
        "I bought this compressor and the second time I used it, the motor chugged a few moments then stopped. It will not start, I've tried everything. I've done all the usual fixes, still, will not start. Piece of junk.",
        "The product arrived with the oil plug out and the box was full of oil. There was a little or no oil in the compressor. We were waiting for this to finish some work that will have to wait till we can find some compressor oil.",
        "The compressor works very well. My only issue that at my home, the thermal protection keeps kicking in, when starting the compressor. I think the issue is due to the low amps in my plug. Elsewhere it works fine. I recommend it!",
        "this compresser is great only thing its heavy but dont waste no time getting to the pressure u need to run your gun i wanted a compresser that will do all my needs from framing to finish and so far i have no companints other than it heavy and it is a little nosie but ha good stuff has to make noise and im good with it u need a compresser look no more it weigh is 66 lbs",
        "Great compressor. Only drawback is it’s heavy and awkward to carry.",
        "I had hoped to use the compressor to maintain tire pressure for small AG equipment - tractors, mowers, etc. However, trying to start it in temperatures below 50 degrees is a \"no go\". Senco should place the breaker button right on top, as it is the most used feature of the compressor. I should have read the reviews before I bought this.",
        "I am having trouble with this unit and I can't get anyone to answer warranty questions on how to get it repaired",
        "Works pretty good, I've noticed it doesn't like to turn over when it's below 45 degrees. Other than that, it works great.",
        "Working very well so far ,I agree with the assessment of another reviewer:this is identical to the roll-air unit and some $50 cheaper....A no-brainer!",
        "Great great great compressor. Don't get wrapped around oil or oil less...\"Oil less maintenance free\" is a marketing term...Oil bath compressors last longer...and the maintenance is minimal, changing the oil is simple and not needed for a long time with normal use. Oil less compressors have a lot of friction and the motors wear out a lot sooner.... This little compressor is a work horse, buy good air house and air chucks and it will last you a life time.",
        "It needed cleaned out when I got it, but so far I'm very happy with it. I've been using this model compressor for years and finally decided to get my own.",
        "Sorry, it took so long to post. I wanted to make sure it worked. I did and I love it. Great product...it works great and the delivery was wonderful. Thank you so much.",
        "Worked once day for about 3 hours, then electric motor burned up!!",
        "The Senco is everything I wanted and needed. We are running roofing guns off it daily and are getting great performance.",
        "First, I do a lot of research when I buy a product. Many reviews stated that this is a quiet compressor. It is must louder than I expected and I was looking for a secondary compressor (smaller) that was quiet. Second, the manufacturer states it is portable. You can hand carry it, but it is heavy. Why the 4 Stars - it is well built. The recharge of the pump is relatively quick. Hope this is not confusing, but wanted to give my view.",
        "Received compressor and the oil that was supposed to be included was missing.Contacted seller and was told to contact senco directly we’ll all the info I found was either a bad email address or phone number that is closed on the times I can call.You would think a seller would actually try to figure out a solution instead of just washing their hand and passing the buck to someone else to deal wit. Makes me wonder how they would handle something more pressing.Would not recommended",
        "Great little compressor. Runs two guns a once no problem. it is also pretty quiet for an oil bath as well.",
        "So far, I really like this compressor. I've only had it for a couple weeks and I haven't had a chance to really give it a workout, but my initial perception is that it is well built and surprisingly quiet.",
        "Very powerful, recovers very quick. Very lightweight for its sizes. 100% satisfied.",
        "The compressor appears as it will function, however the item shipped to me from amazon is NOT as pictured. Note the gauges are pointed up so that you can actually see the pressure of the tank and the tool, however the item that ships is the previous revision where it is hard to see the images. I could have purchased the item I received from another online vendor for 10-15$ less, but I specifically bought off of amazon due to the picture so that I could get the updated gauges. . . . not happy.",
        "Great product...quickly shipped, well packaged. Very happy with the compressor. It's very heavy, still pretty loud,",
        "I haven't had this compressor long, but have used it to run a single framing gun for framing a basement, which went pretty rapidly, and never had to wait for the air to \"catch up\". Additionally, I ran two trim guns simultaneously and had no problems. It is a little loud, but I've heard worse. It was a hurry-up purchase to replace an older twin-stack that threw a rod on the compressor head, I ordered it on Friday and Amazon had it sitting at my office Monday afternoon ..",
        "My Husband got this to use with his nail gun. He loves it. Helps him out in his huge array of projects that sometimes get finished.",
        "This compressor is hard to beat for the price. I compared it to the Rolair Bull, which was my first choice as an all-around contractor compressor, but this one has very similar features and the same MK pump used by Rolair and Jenny, for about $100 less.",
        "Great compressor, it replaced a lower cost chinese pancake compressor that dies after a few years.",
        "So far so good. Keeps up with nailers and small air tools. Not as light as others but hopefully it is constructed better and will last awhile",
        "Great product, very powerful for its size, I did lots of trim work with very little cycling of the compressor.",
        "Great compressor! Very pleased! Runs like a champ and has plenty of air volume for all contracting applications!",
        "Got this compressor and two sides of the box were torn open and the styrofoam packing was crushed. Luckily no damage to the compressor. Works great so far.",
        "I am a remodler here in houston and not only do I make a living by tools a love good tools. This little compressor is built like a tank. I got to use it for the first time today, loved how quiet it was and how fast it recovers. Look forward to whats sure to be many years of use.",
        "This is a great portable compressor. The recovery time is impressive.The unit is fairly heavy. It arrived to my house on time and undamaged.",
        "Needing to replace a dead oil-less compressor I selected the Senco after lots of research. My use is for hobby and home improvement projects. The features that attracted me to this model are that it is compact, the CFM is high for the size, the PSI is high enough to handle the tools I use and, most importantly, it's oiled for a longer compressor life. It's a little heavier than what I am replacing but that's a reasonable trade-off for an oiled machine. The only CON would be that it doesn't have wheels. BTW - NEVER BUY and oil-less compressor except if your use is VERY infrequent.",
        "As a professional in the trades I am very impressed with this compressor. It has a very short refresh rate and is actually quiet enough to be used inside. Not at all sorry I purchased this unit and would recommend it to anyone.",
        "My husband used it to lay hardwood floors. Works great only complaint is weight, quieter would be big plus also. Overall a durable, dependable tool",
        "have similar problem with my other compressor----they trip out when trying to start in cold weather,,,,usually leave in the front of the truck for half an hour in winter so they will start up, but if sitting too long without running the problem returns. company says to not use an extension cord, but that doesn't help. also told to make a box and put a light bulb inside.....nice idea but running a generator to heat a light bulb isn't really practical on the worksite!",
        "Arrived right on schedule and has performed perfectly without any hiccups for the last two months of daily use on the jobsite. Also a plus that it's sized just right to fit between standard 16 in. O.C. studs.",
        "for the price you get it on Amazon you cannot pass this deal up. Wonderful quality and a wonderful by all those carpenters for construction workers if this is what will you need to buy it on here you won't be sorry.",
        "Pros: Easy setup (just remember to remove the air intake cap which isn't mentioned in the instructions). Fairly quiet. Fast charging to desired pressure. Inexpensive for what you get. Good build quality. Includes one quick disconnect. Cons: A bit heavy. No wheels. Can be loud to some. Doesn't include an in-line water filter. Buy one and install it between the compressor and the hose to capture moisture so that your hose and tools stay moisture free. No built in hose wrap.",
        "No complaints so far. It works like its supposed to. Most of the complaints mentioned are minor to me and I can deal with them. My only concern is the cold weather performance which hasn't happened yet. I will update if there are major issues.",
        "I bought this compressor to drive a framing nailer and smaller finish nailers. It handles the job without any problems, but it is very heavy. I've also discovered that it draws a lot of amperage. In the garage where I am plugged directly into a 15 amp outlet, things are fine. While working on a garden shed with the unit plugged into a longer extension cord, the unit would struggle to start and frequently pop the built-in load switch. That probably means I need to buy a heavier gauge extension cord.",
        "Everything was as if I walked into a store and bought one right off the shelf. I will also say, I have been working on our church roof (16,500 sq') and this thing just keeps going supporting two nailers at the same time. Only gripe is shipping as they nailed the side of one tank with the forks and scratched the enamel off (small, no dents) of one of the cylinders.",
        "Great compressor and quiet. Handles framing nailer as well as gun to spray texture. The only downside is that it's a little on the heavy side. Would be nice if it had wheels.",
        "It was a replacement for a cheaper one. This is a real compressor and works great. I would recommend this one for any one",
        "Compressor did not work right out of the box. The unit appears to be leaking massive amounts of air from the compressor motor area. Also, have had a Hitachi EC-12 for about 14 years, and the unit was always strong. The Senco doesn't sound as if the motor wants to turn over on start up (and that was on a hot day). Not what I expected from Senco.",
        "This a great compressor. Light and easy to use. Good price and great value. It has a short run time between charging and is not very loud when it does run. Plenty of power to run framing guns.",
        "Used one time and it died. Don't buy. Only had it 14 days!!",
        "its really nice compressor but the picture is not the actual one thats misleading. But it is a nice compressor. alot more quite then the oilless ones.and more power.",
        "runs my framing gun well, it's a quiet compressor with quick re-charge. the compressor arrived undamaged. It was out of the box and working right away.",
        "Works well. I've been using it for a few months now. I carry this on my truck and I was looking for max CFM and didn't need a big tank. This is a compact package, but wow it's heavy. Heavy enough to cringe when I have to carry it very far, or even get it out of the truck. The gauge is turned in at a funky angle to protect it, but it's a little tough to see it.",
        "It was everything I expected and more, Great tool! . I use it for my job everyday very dependable and portable.",
        "I purchased this to put in my 5th wheel. Fits in one of the front compartments well. It's fairly light. I wouldn't want to carry it up a flight of stairs though. Holds pressure really well. I mainly use this to inflate dirtbikes tires, or if I get a flat while driving. I think it's overkill for my personal application, but that's what I wanted",
        "I'm a professional tradesman.. This compressor is keeping up with everything I do plus!",
        "Dependability and Performance are the name of the game. Compare with others and this one comes out on top in all categories including price."
    ]
}