{
    "entity": "Side-Cutting Pliers",
    "text": [
        "this is my second time buying klein dikes and the jaws dont line up and it sucks at cutting. was hoping that this second purchase would be better than my first purchase but i was wrong. complete waste of money. i do not recommend anyone purchase this product!",
        "I'm a carpenter and all around construction worker. I use it mainly for pulling and cutting nails. Cuts wire great just make sure it's not hot, they don't work well after that.",
        "After wasting countless dollars on cheap, ineffective wire cutters, I invested in these. I use them primarily in cutting through heavy wire artificial floral stems and they work perfectly and have saved my hands and my sanity.",
        "I cut a tap con withthis and there are no dents or chips. If you get a bum One its worth a return and rebuy because its the best diagonal cutter out there. Wide mouth, big leverage, strong cutting blades. The price is crazy. I got mine for like 21. These should be priced at 40 at least. I bought three",
        "Broke the first time I tried to get a knockout out of a 4 square special.",
        "I have been using this cutter for the last 8 years or so they last me for a long time . I use them to cut chainlink fence wire when I'm installing they work great",
        "I use these daily at work. All of my Klein hand tools are great. I like the extra leverage with the longer handles.",
        "The extra 2 inches of leverage makes these cutters easier for almost anyone.",
        "These looked great for cutting stainless pins on industrial washer mat. From new the hinge was binding and took extra steps to open. No amount of lube or use loosened 'em. Cutter held up only a few dozen uses before chipped and dull. Some of my cheap Chinese side-cutters held up longer and were easier to use. I bought these for two reasons: the longer handles for leverage and Klein's reputation. Ergonomics earned some stars, but otherwise cheaper Chinese stuff were a better deal",
        "These work great! I work as a residential electrician, and I also install traffic lights and roadway lighting as well. These wire cutters have handled all kinds of challenges I have thrown at them. Truly a good buy!",
        "Buy klein, cant beat the performance, they work great and they stay sharp. I cut nails, staples and wire all day.",
        "One of the best quality cutters/snips you can buy, I own these diagonal cutters and a pair of their linesman’s and they are both amazing.",
        "I’m a carpenter. I bought two of these pliers because they lowered the price in half and I consider Klein to be the best, they are sharp and fit good in my hand. I also like the longer handles because I get more leverage to cut thicker wire and nails like butter.",
        "Great tool. I use it every day. I've had an older set for almost 12 years. I bought this one as a back up.",
        "If there's one thing Klein does well it's their hand tools. This one is no exception. Cuts right through flex duct wire. Love these cutters!",
        "The extra length and kick on the end definitely gives more leverage than regular cutters. I can cut 10-3 with one hand with these suckers if I've had my Wheaties.",
        "Bought for extra handle length for extra leverage. Much easier to do my job",
        "Klein makes the best plairs on the market. I am a iron worker and I use these every day",
        "I do a lot of concrete form work and you end up using these everyday and having the tie off ring is awesome. But where I live it’s wet most of the year and these have been through a lot of mud and still doing great.",
        "Great cutter, well worth the money. But then again I’ve only had it for a month.",
        "This is the 3rd pair of Klein cutters I have owned...They are a great tool that last forever!",
        "Way better then I expected! These are longer then my old ones (which is good) better leverage when cutting wire!.",
        "These are Klein, what else need be said. Designed for the professional. The cutting edges meet together, the effort required to cut is reduced by design, and the grip handle is long. All working together to make a good cutter.",
        "If this rating had a 6, I would have given it. The pivot is closer to the cut area so it gives more leverage, sharper point to get into tight places, hook on the handle so it doesn't slip out of sweety hand.",
        "This is my second pair because the first were destroyed because of something I did not the pliers. I would of given this item 5 stars but they weren't very lose when I first got them and even after I put WD-40 on them it didn't really help. After a day of useing them they loosened up but the handle still doesn't fall freely like a good broken pair of diagonal pliers should. In a matter of time they should though I believe. I've used this pair and the 8 inch without the angled nose and I prefer these. Much more ergonomic.",
        "First off you can never go wrong with Klein tools. The long handles makes for quick work of just about anything you want to cut. I’ve left with out my tin snips before and to my surprise I was able to get by with these.",
        "As a retired Electrical Engineer/Electrician I can personally attest to the durability of these cutters. They easily cut with 2/3's to 1/2 of the effort required by other pliers and are sharp enough to cut a single thread. I have used many tools and Kleins have always outlasted any other brand. I cannot recommend them high enough!",
        "These are really handy and the blade stays sharp, but the picture makes you think they are a little bigger than what they are. Be sure to ready the description.",
        "Lost this tool as well as some needle nose. Was looking for good quality at a fair price and ended up getting a new pair of these. And made in the U.S. I can't complain.",
        "Love Klein tools. Tough and durable. Made in the USA, you should have at least one pair in your tool box. I use them for many different jobs.",
        "Buy the Best! Very sharp, tough and the long handles are great. I forgot to mention durable, i have cut 16 dup nails with then. only reason I had to get a new pair some one had sticky hands!!!",
        "I've never had a Klein tool I didn't like. I bought these for cutting off crimp-on hose clamps, and they did the trick. It cut through that stainless steel like butter.",
        "This tool is an exceptional wire cutter for copper or steel. However to list it's use as a rebar cutter or bender is stretching it.",
        "Outstanding product. I break forms and cages within pile caps, there is no better tool for what I gotta do. Every single guy on the rebar crew has a pair of these exact model, for very good reason.",
        "I have been using bent angle diagonal pliers for decades. They are the best for removing Staples .",
        "This tool worked out well for my husband on the job. It’s a good price and works well.",
        "love this Diags, been using these for many year now, from cutting tie wire, 9 wire and even 16 penny nails",
        "Bought this to cut nail tips off of wood, wow sharp and works well",
        "This is quickly turning into one of my favorite tools in the box lately. So comfortable to use with the longer handles.",
        "Try not to lose them the first week like I did and the value can’t be beat.",
        "The name speaks for itself. They uphold their name and withstand use. They are designed specifically for electricians because they will do what they are needed to do.",
        "I have been shopping for a good pair of diagonal cutting pliers for a while. Many were of doubtful quality and over priced. These are American made, and seem very good as well as being priced right.",
        "They have alot of play in the jaws but still cut nice",
        "Must have for Rodbusters. My first pair walked off and I’d been using the small version for a few months. So much better.",
        "By far the best diagonal cutters out there! Long handle and curved head makes these stand out!",
        "I had them for 1 week n someone at work stole them, very durable Kline makes a great tool, I’m sure they will last them for years",
        "Sheet they are Kliens they should stand up to the test of time... that is till your helper borrowers them lol!!",
        "Really help for my husband it’s for his work he works as an iron worker lifting rebar",
        "I'm a ironworker an these are the only ones that can keep up with my work. So buy these or don't buy any.",
        "I'm a contractor by trade and these are top of the line cutters",
        "The angle keeps my hands out of a lot of places I don't want them. It's the best pair I've ever had. I only wish they had a hole for a lanyard ring.",
        "For the price I got them at it’s a no brainer. Klein’s is one of the best.",
        "Best wire cutters in the game made my job easier",
        "union ironworker use them everyday will prob last years great buy",
        "Another great quality Klein tool. The extra leverage is nice.",
        "Nice curved end, keeps your pinky from slipping off. These cutters are not as strong as the yellow handle pair.. I can almost squeeze the handles together. Good for residential not commercial.",
        "These are top of the line diagonal cutters. The grip is a nice touch for comfort. And the price amazon has available makes it a deal breaker",
        "Klein makes the best plairs on the market. I am a commercial carpenter and I use these every day.",
        "The cutters arrived broken and I never got an opportunity to ship them back. Cutting tip was broken off.",
        "Great cutters Especially in your a rod buster or work in the construction industry I bought 2 pairs and believe me there strong and sharp",
        "Good cutters, will last a long time. I use a little bit of oil once i have used them for a while. They are my dailys as a rodbuster",
        "Great pair of dykes. Best on the market, I had blew them up on a live circuit and they still cut better than my linesmans. They cut through grid wire like butter",
        "Working with rebar in these are the best I've ever seen the curve is perfect had this pair for 3 years now they're like mini bolt cutters",
        "Great Product that gives you leverage when cutting lots of wire. I just used it on 14 ga. galv. wire and it worked very well. Just wish they had a flush cut in this model as it does leave up to a 1/8\" stub, depending on how well you hold your pliers and the time you have to do it; AAA+++",
        "I'll definitely be passing these on to the kids one day. Super well-made in the US! Definitely worth the extra few bucks over lesser brand dykes.",
        "These are excellent wire cutters. I used them to take down a old fence and they handled the job with ease.",
        "Great tool super durable, well worth the money. Has a slight curve to the handle so it's easy to pull out Staples if need be.",
        "Exactly what you would buy at Home depo or Lowe’s",
        "These are a must have for any ironworker doing rebar installation. The curved jaws and 9 inch handles make them easy to use. This is my 5th pair in my 20 yr career.",
        "Came in record breaking time and a good quality tool to have!",
        "I like the 9\" cutters over the standard length Easy to grab out of bags Longer reach though deck rebar More pet when pulling nails or staples",
        "Klein pliers is probably the best pliers you can have, will buy again.",
        "good solid works perfectly with no regrets. Would buy again in a heart beat.",
        "Best dykes money can buy! And being Klein, you have security knowing that if you do manage to damage them they will be replaced by Klein for free. Great company and great product. Frank Hinojos Local 229",
        "Looks like it will last an eternity. Can't see how it could be better.",
        "quality cutters. i have used klein tools on my job before retirement.",
        "Fabulous diagonal cutters. These are really pro worthy, the extra length is also great.",
        "Work amazing! As a union electrician they do the trick!",
        "I've been using channel lock diagonal cutters for years. I had heard about Klein and thought I'd like to give them a try. As mentioned by other reviewers, these are very tight. I've used them for about six hours and they are beginning to loosen up. I cut a lot of 3/32 steel rod and 8 gauge copper wire in my work. I compared their cutting action with a pair of 4-year-old channel lock cutters. I really couldn't tell the difference. Now, I may have got a bad pair, that's possible, but for now, I will stick with channel lock cutters.",
        "Just what you would expect from Klein. Tough pliers with a good grip and plenty of leverage to cut harder materials.",
        "I love these dykes! The extra length makes them so much better!",
        "I am an electrician, and can say I couldn't be happier with these pliers. They are longer so you get better leverage compared to your standard size. They are Klein, so they are more expensive but you know they will last forever.",
        "Very happy with my product. Price is very low. Will recommend for others to purchase.",
        "As always KLEIN delivers once again with another top quality tool.",
        "Bought this for my husband as he works in construction and has owned many of these. They work so well that the only problem is that they \"grow feet and walk away\". The leverage and angle on it is ideal for cutting wire in the tightest places and most awkward positions. This is a must have tool in his trade.",
        "I'm not as strong as I used to be so the extra leverage is nice for snipping large wires and small screws and nails. The seem to bee a quality product.",
        "I bought this from the Amazon warehouse and it was a bit too damaged on the handles so I returned it",
        "Klein works fine, everytime. Sharp, has leverage, the little ageled bar on the handle works.",
        "Good tool but you're paying more for the name. Channel Locks are just as good",
        "ok cuts quick with little effort but it will rust almost immediately this thing way over priced from what i have seed",
        "Fast shipping, great for any commercial and industrial electrician. It cuts steel tie wire without nicks or any marring damage to cuts!",
        "Classic Klein's dykes, nice and heavy duty. Not as good as my snap ons but great for the money",
        "Klein of 2016 is not the Klein of a few years ago. These pliers are a waste of money. They are as dull as a butter knife.",
        "Dont know why but i was expecting them to be shorter.",
        "A little pricey, but good cutters, I carry them in my tool bags for cutting nails etc... So far so good, Hope they last",
        "They worked great until I cut a screw. Then they shattered within the one month I had to take care of it through AMAZON. Klein is life time against manufacturing errors, i.e. why they broke. Amazon refuses to take care of them. And so does klein.",
        "These look great, feel very comfortable. Jaws meet well. Made in USA, how about that? I am surprised they're labelled, \"Not Insulated\", I missed that on the adverts. But I knocked a star off for this. I'm not planning on cutting hot wires so this won't raise a problem for me. These are as well made as my other Klein tools.",
        "Tool bag got caught in the rain, Only tool (other than allen wrenches) that rusted after. Still perfectly usable but disappointed that they rusted after only a one time exposure to water.",
        "Top quality pliers, just like the ones I bought 30 years ago, worth every dollar."
    ]
}