{
    "entity": "Side-Cutting Pliers",
    "text": [
        "Easy to use, hard when your hands are sweaty. Cuts wire easily and can handle everything that I have to splice.",
        "Yes, as some of the other buyers have stated, this particular Plier is one of a kind. You won't find this with the other Plier Makes. These high leverage will just about cut through anything 4mmm and below. Industrial quality and for the price you are getting a bargain. I have had mine sharpened up a bit and now they cut really good. If I could say anything, I would say these pliers are about the best it is going to get. And you got them here on Amazon.com. Go, Amazon!",
        "This is an extremely good tool. Of high-quality and I use it everyday. It was delivered on time and in great shape. I bought it at a great value. I recommend this highly to other Tradesmen.",
        "I bought these to replace a pair my grandfather had given me from his linemen days at NYNEX many years ago. I accidentally cut a large, live wire and destroyed the snips. I was hesitant and doubtful that this new pair would be the same or as nice as my old ones, but I was pleasantly surprised. If not the exact same pair, they are very close. I could have just bought some cheap Husky pliers, but if my last pair is to be believed I should get 50+ years out of these. It's not always true that you get what you pay for, at least in my experience, but in this case, it is.",
        "Durable, easy to use, well made hand tool for electricians to use in the field. My husband loves this line of tools!",
        "Great product, Klein makes the best.. I have been a fan of Klein for more than thirty years.",
        "The pliers are just what I wanted They live up to the Klein reputation.",
        "I was working on an exterior breaker panel and I made a rookie mistake and hit the main bar to the panel and it blew up in my face. Sparks and slag flew everywhere and cut my actual eyeball but thanks to these pliers I didn’t get touched by any electricity. Thank you Klein for making safe and dependable equipment. I truly owe my life to this product.",
        "One thing I noticed when I took the tool out of the packaging is that the tool had a fine layer of oil applied the steel. Smelled like work getting done! Quality tools will often have a thin layer of oil applied to the steel or metal for protection against rust after it is made. Kleins are the best in the market. Many electricians swear by them. These are intended for cutting jacketed copper and aluminum wire only. NO screws. Otherwise, you will ruin the blades.",
        "Strong pliers, did the job where other pliers could not.",
        "Don’t use them as a hammer and they will last. Treat your tools right. Oil them once in a while and you’ll get your moneys worth. For the price I’d say 100% satisfied. Mine still open and close like brand new. There for cutting and still sharp! Crimping fish tape feature are handy. Rubber handle grip is comfortable. Doesn’t feel cheap.",
        "Been electrician for over 20 years nothing like a good pair of Klein linesman wire cutter pliers Use them daily only have to replace them every four or five years.",
        "Hey, it's a Klein! That pretty much sums it up. Unless you're willing to put up with tools that make the work harder, get a Klein. This tool is just what is needed in all those situations where the installation is a little tough going and it makes great work of the easy stuff. It will bite onto whatever you're doing, giving you confidence that you can get it done right. This is a tool for a lifetime unless you really abuse it. For anyone who wants the best tools for every job, buy a Klein if possible.",
        "These Klein lineman pliers are the best. There are other brands that some of my fellow electricians use, but my Kleins will more easily cut the same wire as the others with much less effort and more comfort. I've been doing this for 39 years and, if i hadn't left a pair or two on a jobsite, i am confident that the first pair i bought in 1989 would still be in my pouch.",
        "These pliers are top quality. This is the third pair we have purchased. The first pair is over 30 years old and still functioning well. I would caution against purchasing the Klein Lineman's Pliers at Lowes that have the yellow handle,They are junk as is a lot of things from Lowes. If you purchase the blue handled ones from an electrical supply location they are top quality",
        "Klein side cutters are a must in my electrician's tool belt. They last for years and are a no nonsense tool. I work with heavy gauge solid wires and these cutters slice through them with ease. The sharp teeth in the pliers grip tightly and allow fast, neat terminal bends. Give me Klein side cutters, an electric screw driver, a few saws and some Greenly punches and I'll wire the world. They're made in the USA and the even the finish is first rate putting them in a must have category.",
        "Best value pair of Kleins. I have a natural gift for losing tools. Especially black, grey, dark blue, etc. But these yellow handles are hard to miss. And it has a crimp that I'll honestly probably use once or twice, but the option is there. Nice and loose straight out of the package.",
        "Long handles for great leverage, yet not punishing when cutter snaps through wire. Very fine rugged quality. Former lineman, bought these for newlywed as gift, my originals bought in 1963 work perfectly still, and have they ever been through a lot over the years.",
        "I do hvac, my strippers didnt do 8 gauge or lower, i bought these for the crimper and to strip line voltage wire but man, they are a great hammer! My service bag didnt have room for a hammer, these work great, can even bang a screwdriver against duct to cut in supplies and returns. Once they fully break in they work great.",
        "I bought this item for my father in law for a Christmas present. He was wanting them for a while now and was very pleased to get it! They are very well made and he said works perfectly for the job he needed them for. They are easy to use and the handles feel nice in your hands with the coating that is on there.",
        "Most of the time I purchase Irwin hand tools. In this case, this particular tool has to be KLEIN. Now, I love Irwin hand tools, but I will be the first to admit that Klein makes superior tools. Usually what it comes down to is that the Irwin tools are about half the price and perform almost as well. But these lineman pliers are something I refuse to compromise on. I have had several cheaper versions that just consistently underperformed. Klein makes the best, highest quality hand tools for people that need them. I am not an electrician, but if I were I certainly would have everything I owned to be Klein-made.",
        "Excellent tool. Klein is one of America's oldest toolmakers. Their tools cost a little more, but they're worth every penny! These tools are made in America, precision forged and ground and have design features not found on cheaper imitations such as those low quality tools imported from China. I highly recommend these pliers and all of their tools. For most people, they will last a lifetime. A little TLC and a drop of lubricant now and then on the sliding surfaces will ensure long lasting performance and satisfaction. The fact that they are made in the U.S.A. is a plus!!",
        "I've owned a half dozen of these types of pliers over the years but they were all given to me used. This the first one I have purchased and I am quite happy. Good hand feel and silky smooth action.",
        "Klein makes the best tools for electrical work, hands down. The grip is perfect. The weighing is perfect. The durability is unquestionably the best. I would fight anyone to protect and retain my Klein side cutting pliers.",
        "I have been in the Electrical and Industrial Maintenance Trade for over 30 years and this particular brand of pliers is all I ever use. Ever. Anything else is subpar and a waste of my time and money.",
        "Love this tool! Cuts heavy duty wire and cable with ease!",
        "It's a Klein Tool. All Klein Tools are 5 stars. I bought this one as a gift for a young friend who just began an apprenticeship to become an electrician. I have two myself but didn't want to part with one of them.",
        "Best lineman's you can get! We use these for cutting steel wire and bundling large bundles of steel. They last far longer than any other brand we have tried.",
        "This is a very nice electricians tool for bending and cutting wires. It is well-made and it has enough leverage to make cutting 12/2 NM-B w/ gnd wire a one-stroke, easy task.",
        "Kline in my opinion is great, ive never had an issue with mine, my old pair i had for 8 years. Only getting a new one cause the cutting seems to be getting dull",
        "Love these pliers. I think they're worth the money but am not positive everyone would feel that way. A solid pair of linemans are a must though!",
        "Hubby was complaining that \"someone lost\" his favorite pair of pliers. So after a few days of complaints, I found this pair. They are of good quality and heavy weight. They move easily, and work for cutting wires. Hubby had to admit that these pliers were as good as his 30-year old favorite pair. A very good value for the price. (And, yes, the lost pliers were ultimately found; it seems that \"someone\" put them away in the wrong place in the tool closet. I confessed, saying I just wanted an excuse to buy more pliers. Domestic tranquility has been restored.)",
        "I'm a journeyman lineman and have worked on line crews since 1973. A pair of Klein's is like your right hand. Cutting, grabbing, turning, holding, hammering nails or staples, they can do everything. Last pair I left on a job site and someone must have picked them up. When I went back I couldn't find them. I hope they enjoy them. I have a pair that doesn't work anymore because the cutting jaws are so worn from use, they don't come together. Won't cut. I bet I used them for over 10 years. First pair. Great lineman pliers! The best!",
        "These Klein Lineman's Pliers are a Great replacement for the original Klein pliers, lost in my backyard while cutting wire. The yellow color of the handles are the same as the original, and the quality is just well if not better than the original.",
        "Heavy and well made. Have not used them for a long time, but they are made and perform well so far. I'd recommend.",
        "These are just what youd expect from Klein, a good quality product that works great. Fits nicely in hand and grips great as well.",
        "What’s there to say? They’re the best for your buck. Sure you can buy a $50 knipex, which ive had and is nicer but then you’re afraid to use them. I’m an electrician and I beat the hell out of this thing. Last for years, unless you short em out.",
        "This \"Klein Tools Tools D213-9NE 9-Inch High Leverage Side Cutting Plier\" failed me while cutting a piece of wire, the cutting edges on both the top and bottom broke. I have used this brand of tools for 40 plus years and have never had a set to fail. I hope I can get Klien to warranty these.",
        "Bought these for a pair I lost. I found the other pair but liked these so much I decided to keep them.",
        "Have always been a good quality tool that lasts under heavy usage. I had lost my Klein's working in a snow storm and went to purchase a brand from Lowes in a pinch. And the kicker is that the Lowes brand cost more and were made in China! I would of even relented if they were made in Mexico. I decided to wait for Amazon delivery. I live in rural Iowa",
        "I work as and electrician and as fellow tradesman/women know if you turn your back on a tool at work it's gone in 2 shakes by fellow workers...this happened to me! :-(......so I needed a replacement and I am a big fan of Klein....Awesome tool! Smooth comfortable hold and cuts metallic cables like butter! I love my linesman I guard it on my site with my life! No one is getting this 1!",
        "This is a quality tool. Worth every penny. If I lost it, I would definitely buy another one.",
        "Nice pair of pliers! It has no handle wobble whatsoever. Unfortunately, it is currently to tight to operate with one hand. Hoping this issue will work itself out. Handles are really fat which makes for a comfortable grip. Feels solid in the hand. The crimping addition is well worth the extra money.",
        "Fantastic grip in the hand and aggressive knurling inside the jaws. Classic Klein quality.",
        "I have used these over the years, and have yet to find a better pair of Pliers. I've tried the cheaper brands, and always wished that I would have spent the extra $ and bought these instead. I have a pair in both work trucks, a pair in the shop, and a pair in the house. Best pliers by far I've ever owned.",
        "This is the only one you want to use for steel tying... but you have to strip the rubber off one side and heat & bend the end so it won't slip out your hand because it always faces down when tying and its heavy. Heavy is a good thing... you can break a brick in two and it will always work just fine. Lasts longer than other brands.",
        "I bought these because I've seen them in action. They're well made and can stand up to daily use. The fish tape puller is a real plus if you're going to be pulling long runs through pipe and not just running Romex on stick framing.",
        "There are some products so good that the brand is synonymous with the product itself: Band-Aids, Kleenex, Jet Ski....many electricians use the word “Kleins” to mean any lineman’s pliers for good reason. There may be better pliers out there but you cannot go wrong with these.",
        "I bought these to replace an identical pair that I've lost or misplaced. Klein quality is hard to beat.",
        "They make a great product for electricians every day all day used tool.",
        "The only linesman pliers I use are klein. I'm assured this product will last a lifetime with high performance. Bought it cheaper on Amazon than I could find in any store.",
        "A little heavy I thought they were lighter but great product",
        "Best price I have ever seen. I am a electrician. I been using this tool for over 20 years. Love Klein tools",
        "Good set of pliers to have in the tool kit",
        "Best out there I've found use the same model for years won't change handles are closer together makes it easy to use ine handed.",
        "I have a pair of these that are 25 years old that still work great. You can cut a 10-penny nail in half, although electricians do not normally do this. Decided th buy a pair for my son while visiting in NY. Delivery was fast and the quality was the same as mine. I use mine for many things besides electrician work.",
        "I'm an Electrician, and I can use these for multiple purposes, even to hammer in wire staples.",
        "If you have never had a pair buy them just so you know how good pliers can be.",
        "These replaced an Identical pair I bought back in the 70's. I hope these last as long. Klein, There is nothing better!!",
        "Arrived on time. Very nice quality. I consider a this a home essential.",
        "These are made for the technician who is serious about doing a good job at work. My boss complimented me on how good they were.",
        "As always, Klein tools are the best. The pair I replaced with these were also the D213-9NETH that I have used since 1982. I chipped the cutting edge using them on too heavy a messenger, my fault, I knew I should have used bolt cutters but was being lazy about walking back to the truck.",
        "The best lineman pliers made. Every toolbox should have a pair of these. Quality made in USA and will last a lifetime. Don't buy chinese cheap.",
        "As all professional electricians know, Klein makes quality tools. I am a DIY'er who has learned that it pays to buy quality tools. I am also a male with medium-sized hands. When these 9 inch pliers arrived, I was a little awe-struck by their size and weight. These side cutting pliers are large and fairly heavy. The jaws are chunky (bulky). The overall \"weight\" is my main concern. I am thinking that I should have ordered the 8 inch size. But, I will keep this tool because I know I will use it and I know it will last a lifetime. I tested the cutting abilty on some 14 gauge wire. It cut the wire with ease.",
        "These are pro quality linesman pliers. You can use these all day for electrical work. I use mine for HVAC contracting on a daily basis and have always had a great experience with Klein tools. Will require some oiling and time to break in completely. Made in USA.",
        "Superior Klein quality, made in USA, nice and heavy - but not insulated. If you need insulated pliers, look for the Klein D213-9NE-INS",
        "The quality is obvious. Solid, well made, comfortable, strong, perfect. I have various sets of pliers and will unconsciously pick these every time I can use them for a job.",
        "How can you go wrong with a good pair of kleins! Just started with a utility company and they gave me some tools and I have fell in love with Klein tools. Wanted to get a set for around the house. Takes awhile to break in but when they do they are your go to tool.",
        "There is not much to say other than these are Kleins. If you can keep these from getting lost or stolen, they will last 2 lifetimes. This is one of the cornerstone tools of a man's toolbox.",
        "Top of the line, pro tool. Last a lifetime with proper care.",
        "These work great. Weren't hard to open or anything like I had read. No issues. Arrived on time.",
        "comfortable grip I use these for work as an Electrician",
        "I received these and they already had rust on them in the package, so they must be getting wet where ever they are stored. Not impressed.",
        "Klein tools are the bench mark for electrical pliers. They are rugged and reliable. Made in the USA. Couldn't find them in local stores after I lost my old set. Amazon to the rescue! These are the best and I look forward to using them for years.",
        "Klein tools are the one to have when you are tacking any electrical work and I would not purchase any other brand.",
        "a high quality plier the best I have seen and used",
        "My electrician has one of these, and I had to get one! It is a tool for a professional, with excellent balance and feel. I may not use it often, but I love having it as it will last a lifetime...and then some!",
        "Very good quality. I haved used Kleins for over 30 years. My only minor complaint is that they are stiff in the beginning, but loosen up with use and WD-40.",
        "Probably best pair I've got and i go thru them like its my job, def will get another pair when needed.",
        "The definition of linesmen’s plers! I would buy any others.",
        "Great wire cutters and being able to grip a steel fish tape without damaging the tape is an added bonus. One can really bare down on the pull without harming your hands.",
        "You get what you pay for.Klein lineman pliers have ALWAYS met my needs on the job for twenty plus years.",
        "im an electrician and i love klien tools. this stuff lasts. i only buy these because someone else needs it more than i do and i have never wore them out. trust me i do use these everyday and i cut nothing smaller than 10 awg. recommend it highy, seller sure had a good price on thi.",
        "I em a rodbuster and i recommend these pliers. Been doing rebar for 5 years. Good product",
        "Excellent tool for getting a tight grip and not letting go. Side cutters are always appreciated and these blades are perfect for most wiring and some heavier applications. Grips again feel sturdy and haven't slipped yet.",
        "Klein tools are always the best for electricians. Have this tool and you can do just about anything electrical",
        "Had a good pair that my grandson lost. These are as good if not better than the old pair. Very satisfied.",
        "My husband loves these pliers. I purchased them for him for Christmas and he was thrilled.",
        "Great tool at a great price. This tool will last a life time.",
        "No need for a long review these are excellent linesmans pliers as most would agree. Worth the investment.",
        "Will be buying again. My husband needs a new pair about every 3 months.",
        "Very good and durable the best pliers made. These new pliers are attractive with coated handles to provide grip and comfort for the user. Happy to recommend Klein Tools !!!",
        "I've had a great success with Klein tools in general and their pliers in particular",
        "Most buyers of this tool know that it's the best out there, and made for daily use; probally most homeowners could get by with a cheaper tool for occasional use. Made in USA.",
        "I hope they hold up as well as the pair I've owned for 40 years",
        "I have been an electrician for 40 years. My kleins never let me down. I use them as a hammer a lot more than I should and they're never effected. Built to last..",
        "I work on fire alarm, security cameras, and door access control and these work great.",
        "I purchased this item in february and they were stolen at work. Was very satisfied with them so I ordered the same type again. I guess somebody else liked them too.",
        "Nice quality linemen pliers. Love the crimper, recently lost my set so it's a two in one. If you're wondering what I need crimping for its mostly for car stuff.",
        "My husband has been out of work, so he hasn't had an opportunity to actually use them but he's had this tool before and he really likes how it works for him! It's still really stiff being new and all, but he's been trying to loosen it up."
    ]
}