{
    "entity": "Side-Cutting Pliers",
    "text": [
        "I bought this to replace a 7\" diagonal cutter I had for 30 years after I inadvertently cut into a live electrical wire. I love the fact that this tool is made in America. It works well. Missing, though, is the refinement of finish of my earlier tool. I guess this is what it takes for an American company to survive competing against the Chinese. But you should choose to buy it. It should last a long time and you are keeping jobs in America.",
        "I am very skeptical about these side cutters being made in the USA .I have a pair of original Channellock No 337 7-inch side cutters that I have had for years and they are light years ahead in quality and workmanship than what was sent to me in the post",
        "Cuts wire with ease. Nice hefty steel. Comfortable handles. Only con is the finish of the tool is poor. While this does not affect the performance of the tool in anyway. A $10.00 diagonal cutter from overseas can have a better finish. The poor finish is why I gave product 4 stars.",
        "First pair is about 25 years old. It's dulled from all the stuff cut over this years though not abused. This newer leverage point makes cutting much nicer. Had pulled trim off for a floor replacement and some of the 18 ga. brad nails along with other finish nails were refusing to come out with the pry bars. These cut through them easily. Hands still hurt after a couple hours from this task but much easier with these. Next time I get some young kid to cut the nails down. ;) Happy with this purchase it makes the job easier which is efficient. Also debated the Knipex but wanted a USA tool.",
        "I use this tool to cut steel washers off of VW drain plugs for my job as a lube tech. In order to remove the factory washer to install a 1 time use crush washer you need strong Side Cutters that can cut a steel washer using only the tip of the Side cutters. So far these are the best side cutters I have found. You need a really strong grip to cut through the washer but if you are strong enough these will cut a framing nail or a steel washer like a hot knife through butter all day long for years.",
        "hot garbage. edges are easily sharp enough to draw blood, and not the cutting edges. Ground surfaces are rough enough to use as a file. hinge is way too tight, need 3 fingers to open them up, might as well use both hands. The pile of pliers on the bottom shelf of HF have superior finishing. I was hoping for something in between german made and chinese junk, instead got hot garbage at middle of the road price.",
        "They are what I purchased the only problem I have if you wanna call it that is they’re too sharp I’m a carpenter and I bought them mostly for pulling trim nails and staples and with hardly any pressure they cut! If you’re buying them to cut wire these are for you but for my needs I’ll have to wait for them to ware out before they’ll be good for carpentry!",
        "After reading many positive reviews of Channellock products I decided to buy these. I wanted pliers with good steel and heat treating so the cutter edge will last better than the generic cutters I bought for my first tool box. Those generic mini pliers rusted and froze up too quickly. These 8-inch channellocks offer better leverage and they came to me with a well oiled hinge and marked Made In USA too. I am confident these will hold up to a lot of use on all types of electrical wire. The plastic trays for my Stanley sockets have instructions showing where to use cutters like these to open them so they can be snapped closed afterwards.",
        "Definitely a quality set but one small detail will make these my back up pair. The tip is blunt and makes them less usable in certain situations in my pine of work. However I'm happy I purchased them as they're made in the USA and supports domestic jobs.",
        "The finish is real rough and not complete. Not to worry I worked in a machine shop, I know how to de burr metal products, but I would really expect more from an American company. I still admire them for keeping the product made in USA and competing with the Chinese companies, and American companies that have defected to a cheaper labor market. Unable to comment on Durability, but they work very well when new",
        "These are the best dikes I've ever used by far. It's one of those tools you don't want to short change. I have cut things with these that sounded like a bad idea at the time. Most other cutters would be chipped or dulled by now with what I've put these through. But these things are legendary. I'd be willing to bet they're just as good as a similar tool from the expensive red brand. If you're trying to carefully put together a really nice tool set with quality stuff, or you're out for the best bang for the buck replacement, give these a try. They might be the last ones you ever buy.",
        "After reading some reviews and receiving a pair for myself I’m not sure if it’s genuine or not. Right of the bat I can see that it’s not proportional from side to side. It’s like it wasn’t cut right or something. I did test them and they do cut but I’m suspicious.",
        "I own several Channellock products. They last forever. I bought the diagonal cutters to remove finish nails from wooden moldings. They get up nice and tight to the wood surface.",
        "My old cutting pliers recently developed deformations on the cutting surfaces. These are an inexpensive \"Made in the USA\" replacement set. Feels good in the hand. The tool packaging did not have any warrantee info, so I checked their website. \"Tools are not warranted against abuse or wear from faithful service\". I have other Channellock items accumulated over the years, and have been happy with them.",
        "They do not seem to have to same cutting force as i would have expected and what is up with the flattened nose. as i often need to select a wire in a bundle of wires these will not work well for me. I will keep them for around the house but will get a pair of klein's for work.",
        "Nice set of side cutters for my shop. Seem to be high quality and the snip end is pretty tough, haven't had any problems thus far. I'd say if youre looking for a quality pair of snips you really cant go wrong with these.",
        "Mine came with no QC issues, they just wore out way too quickly and now they don't even cut zip ties. Bought a pair from Harbor Freight - they weren't great either but they at least were cheap. Get Kleins or Irwins (NWS) and don't look back.",
        "This is a really good diagonal cutter...easy to use and fits my hand. Glad I found these....I had lost my favorite pair and really needed something for my home workshop.",
        "Terrible! The tip is ground off. I contacted the manufacturer and got a smart mouth that told me tough cookies. I went to Klein. Must have the tip in electrical work.",
        "Channellock's are Great Tools. I've never had any of them fail me. Highly Recommended.",
        "Some of the best side cutters you can get. Should last for years & years! Especially if taken care of(like not used for bunch of dumb shuffit). My last pair got lost somewhere, not sure where (22 year old daughter or boy friend), but those were like 20 years old anyway. Blue handles were like almost black! Ex price too here on Amazon.",
        "Functional set of dikes, handle isn’t the most comfortable but not bad. All these pliers are a dime a dozen. These will do just about anything you need them too from cutting wires to medium cables.",
        "They are definitely lighter than the same ones from 15 years ago or so my dad has. But they so far after a few months of cutting metal rivets and other things seem to be holding up just fine. And my no means am being gentle. Great tool as reliable as can be so far.",
        "I know of no better cutter available at any price. These are the ones you want. Trust me. Keep them away from your coworkers or else buy another pair.",
        "I bought the about a year ago. They worked ok for about 40-50 cuts. They they got dull with visible nicks the blades. Not the same quality steel they used to be, that is for sure.",
        "Channellock 337 similar to the old model, but instead of made in Meadeville, PA, is stamped \"MADE IN USA\". Chrome finish darker than original and edges were rough with sharp burrs. Burrs cleaned up nicely with sandpaper but hardness of steel in some question inasmuch as sanding would cure the defect. Cutting edge and Grips good, but hardness of cutting edge still a question.",
        "I needed a new set of wire cutters and these had a good reputation. I also use them with fishing line and their cutter design is as good as its reputation. A good buy.",
        "for 16 bucks its very good. I've seen people reviewing ones from china for $4 so take your risk if you want. It worked good for me so I am keep ing it.",
        "Poor quality- gap at cut edge. Sharp edges, poor tip finishing - What happened to Channellock quality",
        "The cutting tip broke off the first time I was cutting a piece of fence wire. I had to switch to an old pair to finish the job. It would appear that the steel is too brittle for moderate work. UPDATE: Channellock replaced the pliers free of charge and I shipped the defective ones back. Must have been a bad run because the new ones have been up to the quality standard I've come to expect from them. Thank you!",
        "these a well made with a good hardend cutting edge that I use on thick cables. as always glad to support american made tolling.",
        "Great pliers made in USA they cut nice and neat.",
        "Good to buy. I brought two of these side cutter. Both are super tight. Sometime even hard to open. After I spray some wd-40. It’s quite smooth now. I generally use this for cut string of CAT 5e or 6 cable and marked the cable. One thing I need to mention , cut wire ability is not the strong point than my Irwin. Hard to cut wire like 12mm 3 core tps. My Irwin combination 215mm pliers cutting power is neat and precise.",
        "The pliers work fine, the jaws mesh well, but the finishing is very poor--there are very sharp burrs along all the outside edges of the jaw where they were ground... Not the type of quality I'm used to seeing from Channellock... hopefully this is the exception and not the rule.",
        "Excellent quality. USA made is a +. The right tool for the job is appreciated because so many physical accidents are the result of using an improper, dull, or weak tool. I've only had one opportunity to use this Plier. I knew with the 1st \"snip\" that I had made the right choice. Recommended.",
        "They are okay but quite tight. Makes it hard to open your plier with the back of your fingers when you are working. Slows you down. Fairly sharp and aligned but nowhere the quality of the great era of American tools.",
        "There is no better hand tools thanChannellock, the cutting pliers are no different. Cuts clean with minimal effort, well made.Well worth the price for a long-lasting tool, I will probablt lose it before it breakes, LOL",
        "These work just fine but one evening I left them outdoors where I was working. They completely rusted over.",
        "Great quality. This one is a bit longer than what I am used to. But if access is no problem, you have a lot of leverage with this, and it leaves a good clean cut.",
        "Smaller than I expected and probably not acceprable for heavy duty jobs.",
        "Channellock are the best tools made in the USA. I paid about $5 more than a cutter from a big box store for a tool that will last a lifetime and allow its makers to live and prosper.",
        "Don't waste your money and time with less expensive Diagonal Cutters. These are the best. They cut all sizes of wire and welding rodswith no problem",
        "cut as they should and the joint is not loose, i’m happy with channel lock quality",
        "My old diagonal cutting plier was dull after my wife used it for cutting tile so I bought this one. It is big enough and sharp enough to cut a battery cable if you apply enough effort.",
        "I should have ordered these years ago. I've been beating around my old Craftsman sidecutters for 30 years. What was I thinking. This is a GREAT product. I like the longer handle.",
        "I bought these to be able to cut small rope cordage close to a knot, without leaving much tail. They aren't sharp enough to do that job well. I'm sure that they work to cut wire fine. Otherwise, they are well built.",
        "Bought for a friend because he always was using the ones I had. Don't compare to the old green handle",
        "Nice cutters. I bought these for work. I work on wire braiding machines. These are good quality for the price. Less than half the price of klein which are industry standard. I have other channel lock tools and the quality is good.",
        "Keep them outside in Indiana. Held up .still sharp rusted a little .but good deal and durable.",
        "It's not genuine channellock. The top is a pair of store bought pliers, bottom is this item. The logo on all real channellock items look like the top one.",
        "Good cheap diagonal cutters. Can be used as hammer or nail puller. Hehe. Cheap enough that I won't cry when I leave them somewhere.",
        "Very nice. Long handle gives plenty of leverage. Cutting surface shows zero sign of wear so far",
        "I use the quite often in diesel truck repair and maintenance, works flawlessly.",
        "Channelock quality as usual. Just in time for assembly of Autumn door wreath.",
        "Item description is exactly what I was looking for. Overall satisfied",
        "Horrible!! Tip is grinder flat and uneven! Can’t reach in between tight areas due to the blunt tip. Very disappointed with this product! Poor quality. Don’t buy tools to save a couple bucks.",
        "Channellock has always been my favorite tool. These match my 30-year-old diagonal tool perfectly .",
        "Top quality, made in USA. Excellent value for the money.",
        "I love these. The only reason I had to buy another one was that my old one just disappeared somewhere. I love these cutters.",
        "The pivot pin appears to be off center, leaving the jaws loose and off-line. Can't be adjusted. The other Channelock items I purchased at the same time were of expected quality. The E41S diagonal cutter, at only 4\", felt more agile in my hand than this tool at 4.5\", so I might have returned it anyway as a poor fit for me. The 5\" 435 cutter was just right.",
        "Use them everyday. Ive had them a few months and they haven't loosened at all.",
        "Misplaced my cutters I have had for 30 years. Hoped buying new ones would cause the old ones to show up. Not so far! Anyway, great quality and after one days use, turned around and bought a second pair for my son.",
        "ok, but not like olden days of channel lock products.......",
        "Quit being cheap and get some quality tools. It is worth it......",
        "I have been buying Channellock tools for years, and I will keep buying the Channellock brand. These snips are high quality, and hold an edge exceptionally well.",
        "I have bought a lot of Channel lock tools, they still are making quality tools. These cut very well and just have a good feel about them.",
        "The metal is not as hard as I would have thought. The copper has put some small dents in the sharp edge. Otherwise its works well.",
        "Just what I expected from Channellock a great American made product. Will last me my whole life.",
        "Always used Klein but value of channel lock switched me over.",
        "I love these things. I am a farmer and I built a lot of fence for my cattle and these things just keep cutting. I finally broke down recently and bought a new set after 5 years. These are a little longer than the other ones but they work fine. Put them in your pocket and you're ready to go cut some wire",
        "These cutters are bulletproof. The blades are undamaged after cutting many stainless steel springs. I have owned cheaper cutters, they are not worth the cost savings. Buy these Channellocks... you will not be disappointed!",
        "Typical channellock. I expect a lifetime of use from them.",
        "These are the 8in snips perfect size for handling any job",
        "Great, long lasting hard working crimpers. 10th set or so..for my workers and me.",
        "This is the first pair of large sized diagonal cutters that I've ever owned right out of the package...I couldn't resist the excellent price for a brand name, American made tool. I'll be spreading the word to my Union brothers and sisters. Thank you. All the best in 2015",
        "Nice fit and finish. A step up from Craftsman. Not quite Knipex and certainly not SnapOn, but good value for the money. Made in the USA.",
        "Great pliers. Would buy them again Used to cut hog-ring clips. Work very well for that type of work.",
        "Great pliers - well made and very good quality. Also a great price.",
        "Channellock still has the same old quality, IF you need a good pair by channellock. 69 year old master mechanic.",
        "Like everything I've used from Channellock, these cutters are great! The knife anvil cutters cut so much more cleanly than many other types of cutters. The joint is placed as close to the jaws as possible, and it really makes cutting easy. The slightly tapered handles are comfortable to hold.",
        "I've purchased a couple of sets of the cheaper tools at both Home Depot and Lowes. The pliers are OK, but, I've broked the wire cutters from both sets. I'm slowly replacing everything with Channellock tools. They cost a little more, but, I'm not worried about busting my knuckles or cutting a finger.",
        "Great snips, I bought this pair to replace the ones I misplaced",
        "I've owned this product before but they were misplaced.Im an electrician and I find these dikes to be completely capable of what I need them for in the field.",
        "Well made American Tool. Heavy in hand is a good thing. The metal is finished and polished to a very high quality. Why buy a cheap tool that doesn't work that well, won't last and will end up in the garbage? Answer: No reason. Just get a well made tool and you are set...job well done Channellock!",
        "Love me my channellock pliers and adjustable wrenches, this dykes is awesome.",
        "Well, Channellocks are the Cadillac of hand tools and this one is no exception. It is well made, very ergonomic and cuts through anything. And best of all, it's made in the good 'ol US of A. Costs a bit more but worth every cent.",
        "As I stated before about Channellock brand pliers, they are the best any one can buy in my book. I have several pair of Channellock brand pliers.",
        "It was more than the other options, but I am happy I sprung for the Channellock -- I see where the money went. I can't comment on reliability. I will report back if I have any issues.",
        "Perfect size, good price, work as expected. I only use Channellock tools, the quality can't be matched. I highly recommend all Channellock pliers, dikes, slip joint etc.",
        "Solid tool which cuts through wire and plastic easily, and is quite nice to hold. Would definitely recommend as a solid choice for wire cutters.",
        "I own about 25 different Channelock pliers, side cuts, needle nose, etc. Just great quality all around.",
        "Tool cuts great and American made but if you like your tools to look good this tool has uneven grinding and has very sharp edges. Klein cutters are better quality.",
        "I like many people thought have multiples of the same tools but I didnt have this specific size etc...but I allways wanted my own (always been places or worked for others and they were around) . They are perfect, excelalnt tool for the price as well I ordered (3) different Channellock pliers sets that I wanted and cross referenced the prices with the big box stores including shipping it still came out cheaper to order online rather than pay NYC prices + sales tax. So it was a good deal if you order a couple units.",
        "Nice product, solid build, good quality, I have been enjoying using these.",
        "Love this tool and have been using this specific type and brand for years. Having to replace old pair because helper dropped them on concrete and the tip broke but the wee 2yrs old and had heavy usage.",
        "Very surprised these pliers lived up to the reviews. Work perfectly and as stated.",
        "It's hard to find 8-inch diagonal cutting pliers locally. Most of them are only 7-inches. I like the leverage provided by the extra length, that and the precision fit of these pliers makes them so nice to use. It's a pleasure to use them.",
        "Bought these to replace a lost pair that some archaeologist might find someday. Same quality as the 30 year old ones. Nice to see a company still on top of quality.",
        "I use these every day at work, 7 months and counting, cutting tie wraps, wire, and nails. The edges are still straight and sharp. The jaws are strong. ---UPDATE--- It's May 2015, and these dykes are still going strong.",
        "Seems sturdy to add to the tool box to compliment use with my 6\" Craftsman. Has a Made-in-USA electroetched on the side and the price was comparable to imported hand tools."
    ]
}