{
    "entity": "Accessory Kits",
    "text": [
        "This is my ABSOLUTE favorite portrait lens! I rented it for years, so let me tell you from experience JUST BUY IT! Several times I rented the f/2.8, and I will say I hardly see a difference in outdoor light. I can still achieve a really nice bokeh with the f/4. LOVE LOVE LOVE IT!",
        "Initially, I was not pleased with the lens. As it turned out, the lens is great, using it with my camera had a learning curve. The lens has a very rapid focusing system. My camera, the Canon 7D Mark II also has an amazing focusing system. However, it took me a little getting use to before things meshed. The pictures have an amazing quality with great focus. I am delighted with the lens and the Camera",
        "Just an amazing lens. i originally tried the 70-300 is usm and it was an utter disaster. i couldn't get a good copy so i saw some people recommend this lens. I'm glad i gave it a shot. yeah the focal length Isn't as far but its so much sharper then almost anything I've used before. i just crop the distance and its still sharp. it may not be as fast as the 2.8 but unless somethings is moving pretty speedily, i haven't had a problem. the is works better then other is ive used. i can get my shutter speed down to 1/15 second taking sharp images at the 70mm end. i cant sell this lens enough.",
        "The IS makes a whirring noise when it is activated.. Pretty sharp lens though! Nice color and contrast too. It didn't knock my socks off though, so I returned it...I might just be too cheap, but I didn't want to spend $1000 on the II version, and this one worked well, but again, for the price, I decided I should just get a 2.8 instead..",
        "This is an amazing lens. It is so sharp your photos look like something in National Geographic. Unfortunately, it is not the lens for me. The focal length doesn't work for me. The short end is too long and the long end too short. I'm returning it for the 24-70mm. Thank you, Amazon. Addendum: this thing is built like a tank. After a couple hours handheld I feel like I've been punching a bag. Excellent quality.",
        "First impression was, it is smaller than I thought it would be. It has a nice weight that I can deal with. Because of my personal preference for a lighter weight camera, I decided on the Canon t5i. The full frame cameras were too heavy for my taste. Although the weight adds to the camera and with battery pack brings it up to the weight of a full frame Canon, it is considerably lighter than the Canon 70d without the same add-ons, i.e., battery pack, and lens. Very impressive lens for such a compact size with the features I was looking for. Plus the USM is very quiet. I already love this lens. More to follow after photo journey use.",
        "bought a used one, near mint condition. Using it with Canon 80D,only have used it a few times. I'm hoping that it will take my photography to the next level. I was using the 55-250mm kit lens and doing portraits they weren't very tack sharp. The few photos I have taken with this so far are amazing. Good glass definitely makes a difference.",
        "Because of the cost, I weighed this purchase heavily, but I'm so glad I bought it! My boyfriend and I were going on a trip to Africa, which honestly, wouldn't have been captured so well without this lens. I have so many amazing photos and I never realized how terrible my kit lens was until I got this. Its supremely sharp and has incredible image quality. It goes with me on every trip now. Don't hesitate, just buy it! So worth the cost!",
        "I use this \"L\" lens on my Canon 70D. It by far outshines the kit lens (18-135mm IS STM) though that lens takes some great macro shots. The Canon EF 70-200mm f/4 L IS USM lens has a very fast focus. I take all of my photos without a tripod including moon shots. I am very happy with this lens. This lens is a bit heavy, at just under 2lbs. Another thing I like about the lens is that the length of the lens does not extend when zooming in, everything is done internally. When taking close-up or macro shots you have to be about 4 feet away or lens will not focus.",
        "I have only had this lens on two shoots so far but it is amazing! Really glad I got this one with image stabilization, helps out a lot. Worth the extra money over the non-is lens. The weight is not too bad. Using on canon t6i. Jsigler22 is my Instagram for example photos.",
        "Combined with my Canon 70D it makes the sharpest images I have ever seen, beautiful bokeh and it handles flares crazy well. The best lens ever! IS makes some noise, it sound little odd, like something is broken inside, but it works so great. And don't waste your money for 2.8. This one makes sharper images and with long focal length, you will not need more bokeh, or shallower depth of field.",
        "I'd give it 10 stars if I could. The IS allows me to shoot handheld at 1/20 and still get excellent shots. I love everything about the f2.8 II lens bit the weight. This lens' image quality is every bit as good without the weight. Unless you are a professional wedding photographer or such, save your money and buy this one. You will not be disappointed. The only downside, is this lens doesn't work with 2x extenders - for that you need a f2.8 lens. I don't use extenders so I don't care about that.",
        "I ended up trading down from the f/2.8L IS version of this lens. It's built like a tank, the focus is fast on my 7D and I've found with the IS I really don't miss the 2.8's extra stop. (well, usually except in low light situations) I use this for shooting trains, so the lighter weight is a plus. It's still heavy, but NOWHERE near the \"pain in the neck\" that the 2.8L could be on a long day. Have not tried it with my 1.4x and 2.0x teleconverters yet. Will update when I do.",
        "Wow, what a great lens! I won't go into too much detail as several others have pointed out all the fine features of this lens. I will just say it takes excellent, crisp shots and even though it is an f4, it is SO much lighter and comfortable to use than the F2.8. That thing weighs a TON (but it's great lens too!) The fact this one also has IS really makes it worth going for. if you do a lot of hand held zoom shots, sometimes in medium to low light, the IS is a near must, especially with an F4. This one has it all and well worth the high price paid..",
        "Amazing Lens. Silky smooth, fast focus and not too heavy. Not completely thrilled with the IS on this lens, as compared to even my 18-135mm kit lens, It is great for stills but not nearly as good for video. I bought it for stills anyways. Loving it so far.",
        "The Canon 70-200 f/4 IS USM is a good lens. I got mine used for a good price. I enjoy using it with my 70D.",
        "Excellent sharp photo results. Very pleased with this lense. Pairs well with my Canon 6d mark 2 full frame camera. Focuses very quickly and image stabilization works great.",
        "I do a lot of videos so I was inclined to get 70-200mm F2.8 that fat beast but the price was too high for my semi-professional work. So I decided to get this F4. Not only it take great photos, it also takes excellent quality videos with beautiful bokeh with F4. Of course I wouldn't use this at night without my LED light panels or my portable lights. For day time indoors or out, it does what a canon 70-200mm L F4 is expected of. So bottom line - unless you're making tons of money shooting videos...buy this lens instead of 70-200L F2.8. it is worth the money and for its extremely fast IS focusing mechanism.",
        "I purchased this lens for a step up from a 70-300 IS f/4-5.6 and very pleased I did. I like that it is f/4 all the way through and does not extend or turn when you zoom in. My only surprise was the sound of the IS motor. I never noticed a sound when using the 70-300 IS. I have since learned this is normal for this lens and hardly notice it anymore. The sharper image is well worth the slight noise.",
        "This is my first L lens and I am very happy with it. Owned it for about a month now and I cannot be happier with it. Size, weight, build quality, optics, speed, clarity of images, everything is top notch. I recommend buying an inexpensive tripod collar ring mount instead of mounting the camera to the tripod. I bought the Rainbowimaging one and it is made very well. I was in the same situation as everyone else, deciding between this and the f2.8. I bought this because it is lighter, sharper, newer, and weather and dust sealed. I highly recommend this lens.",
        "Prior to purchasing the 70-200mm f/4 L IS I've had mixed results with telephoto lenses. This lens has shown me what a truly great telephoto can do for my hobby. The first thing I noticed was how bright the view finder was. My photos displayed great color and contrast when using this lens. Focus is incredibly sharp compared to my previous telephoto experiences. Even with the IS I prefer to use a monopod because I feel like the camera is moving with that lens hanging out front. Now I don't know how I got along without my 70-200 f/4 L IS. A great addition to anyone's bag for those who take their photography serious.",
        "The quality of my images increased simply by opening the box. After long deliberation between the 4.0L IS, and the 2.8, I decided the f4.0L would meet my needs and it does. I often carry my camera more several hours and the lighter weight of the 4.0 is very noticeable. The IS function offsets the one stop loss nicely. Having never owned a professional grade lens, the build quality is immediately obvious. I do have one minor problem with this lens. The quality is so noticeable, I am going to have to start spending more money on additional \"L\" series lenses.",
        "Simply amazing lens. I bought this to use with not only my Canon camera but also with my Sony NEX FS100 while filming video. Without a doubt this thing is amazing for photo, but I wasn't sure how it would hold up for video. Well, it's great. You can sorta hear the stabilizer while filming. It's not loud enough to affect audio, but you hear it working. The video quality is amazing though. If you may at any point use this for video, rest assured it'll be fantastic!",
        "From f4 to f2.8 is a big difference both in price and flexibility. Think about your needs before choosing. You may save a grand on the 4L as opposed to the 2.8L, but what good does it do if you can't use it in your workflow because of its slower aperture?",
        "This is a very good lens and the images reflect the quality. It is the first L lens I have owned and am very happy with it. I went with the f/4 rather than the f/2.8 because of the weight and am not disappointed at all. If you are going to carry a lens for a period of time the weight can be a real issue and this meets my needs well. With the new digital cameras and there ability to give quality pictures at a higher iso it is a great lens.",
        "plastic close to glass has several small chips. work fine. I am not happy with the product. the discription or pictures did not show these. I still keep it.",
        "This lens practically sees in the dark. I can only imagine what the 2.8 does. I took some pictures at dusk with short DOF on my 6D and the results were amazing. This lens completes my trinity; 16-35 f2.8, 24-105 f4, and 70-200 f4. Almost 4K for three lenses, but they all certainly deliver great quality.",
        "This is my favorite lens on both APS-C and FF DSLRs. It's sharp and produce nice colors. Get a used one if you're on a budget. L lens are reliable even when bought used.",
        "This was a gigantic splurge for me, but I have zero regrets. This lens is tack sharp and produces some of the best quality images I've ever been able to produce. Worth every red cent.",
        "Love it, love it, wanted for a long time. Thrilled I bought it. I know there is a different lens but like this one best.",
        "Excellent contrast, color, and sharpness. The f/4L IS offers a much more pleasing bokeh than the non-IS version, which I've used, due to the newer shape and positioning of the blades. This lens is only second to the 70-200mm f/2.8L IS mkII, and it's not far behind. Given the price and weight difference between this lens and the mkII, I'd say this is definitely the way to go unless you're shooting indoor sports or need super-bokeh.",
        "This is my first L-Series lens and I've taken a few sample shots with it and I already love it. I rented this lens for about 6 weeks a while back for use with my kids outdoor soccer season. The lens was great. It is not going to do to much for you in low light situations, but it is outstanding in outdoor and areas where there is plenty of light.",
        "Almost perfect \"walk-around\" lens unlike its f/2.8 big brother. I use it with a 24-105mm f/4 IS lens when out and about and I have coverage for almost any \"normal\" focal range. Tack sharp in almost in any lighting from daybreak to sunset. Gets my highest recommendation.",
        "I chose 70-200mm f/4 instead of f/2.8 because of the weight. With image stabilization (IS), it provides good mobility without using tripod. The image quality is good, work perfectly with my Canon 6D.",
        "This is a really useful, light, powerful, versatile lens. I have a friend who bought the f/2.8 lens, and he seems green with envy at how light my equipment is with this mounted, and with today's cameras with excellent low-light performance, the extra f-stop isn't crucial, unless you're really into blurring the background more.",
        "I had this lens for about a month. The image quality is just amazing. It is so sharp that I can crop almost any sizes I want and still remain good quality prints. The contrast and saturation are just perfect. I do not regret to have F4 version. It is lighter than F2.8 and $500 cheaper. F4 is just good with IS. In low light condition, I use either flash or higher ISO, making perfect pictures. Highly recommended.",
        "This is my favorite lens, by far. I've had it for years now, and I would absolutely recommend. Others have already documented it's features and benefits, and I'll certainly have to agree that it does the job very well.",
        "This is a great lens if you want to spy on people or get shots from a distance. I don't spy on people but I just thought I'd point that out. This is a great lens though, but tbh, I am no expert. This was my first lens I ever bought so it's kind of special to me.",
        "Never leaves the camera bag and almost always attached. I use this as a travel lens along with the 24-105, the other versions are just too heavy for me. This lens is SHARP! I love to use this for stitching landscape panoramas as they give me far more detail than my 17-40 or 16-35.",
        "GREAT LENS. HIGHLY RECOMMEND IT. MY NEW PORTRAIT LENS & THE BUILD QUALITY IS PRETTY AMAZING CONSIDERING ITS ONLY $1K. STOP hesitating & buy this lens, you won't regret it!",
        "My first L glass. The only bad thing I can say about this is now I am spoiled and will only buy high quality optics. This is worth every penny. The return on investment on these lenses is great. I have been watching the market on used L Series glass. They resell for a very good price. The image quality speaks for itself based on the existing review alone. This is second to none.",
        "Excellent lens. I love the weight. I shoot professionally and in some of my work, keeping the weight down really helps but I still need quality images and this does not sacrifice that.",
        "This is simply one of the best lenses that I currently own or have bought and sold in the past. The sharpness and color of any pictures taken with this lens is better than I could have hoped for. If you are looking for a quality 70-200mm lens, look no further than this one.",
        "Simply put, this is the best lens in my kit right now. High speed autofocus and IS just add to the quality of the images. I'm using this lens with a EOS 450D, and the quality is just stunning. Pros : Sturdy construction, and feels solid. Fast autofocus, and amazing clarity, IS really adds to the plus points of the lens (a must have for a 200mm lens) Cons : A tad bit heavy, but personally I wouldn't mind.",
        "The images I got from this lens (traded up to the IS model) are stunning. The first ones i shot in comparison to ones from previous lenses were so good I almost peed myself. This is definitely my favorite lens.",
        "I purchased this for my wife. I own a 70 - 200 f2.8 IS USM lens which weights significantly more and the image quality is, essentially, identical to my eyes In retrospect, this lens would have probably been a better choice than the f2.8.",
        "Debated between this one and the f2.8 for wayy too long. Decided on the f4 for a few reasons - weight (MUCH lighter), cost (DUH, it matters) and honestly after having rented both, the f4 is a tad sharper. Since I knew this would be my most used lens, the weight is what swayed my decision. LOVE IT!!! If I shot more weddings, I might have went with the 2.8 but that is a beast and not one I would want to carry at a long shoot or on day with several shoots. The f4, weight isn't an issue and I almost cry when I have to take it off for wider shots :-(",
        "This lens is as good as all the reviews said it would be and I couldn't be happier. One can read the reviews and get a sense of being sold a bill of goods, because opinions vary across the whole spectrum, but the reviews about this lens have been spot on.",
        "This is a fantastic lens. The pictures are razor sharp, and the smoothness of the focusing is incredible. I recently used this lens on vacation in Walt Disney World and I can say it is not something you want to use as a walk around lens, but for the animal shots at the Animal Kingdom park it was the best. If you want to get an affordable \"L\" series lens that produces fantastic results, this is the one.",
        "I have the Canon f2.8 70-200mm which is great but massive in size and weight . Now that the newer cameras have improved low light capability,you can get the same quality of picture with much less weight and size. Great for travel,hiking and when you want to carry extra lenses. If you pair it with the Canon f-4 image stabilized 24-70mm Canon L lens ,that's all you need for general travel photography. Everything can go in your carry on ,if you are flying.",
        "Purchased this lens as soon as it came out. Love it. The IS is well worth the money. Have gotten some really good indoor shots at ISO 800 with this lens at f4 and 1/15th of a second. The IS really does help. (Can't often get really sharp shots at this shutter speed, but with a little luck you can, and at 1/60th, I can consistently get sharp shots as long as the subject isn't moving.) One of my favorites (very sharp, beautiful color, great background blur)-and I also have the 24x70 canon L lens, among others.",
        "I use it with my original 5D. What an amazing clarity I get. I was about to sell my 5D but with this lens on I just decided not to as it would have gotten me just $400 or so. I am using it with this lens and it is very very sharp!! IS helps a lot. And it is very light and it is half the price (and weight) of the f/2.8 version.",
        "Have had this for over a year now, not a lick of trouble. Was in Cairo last summer during the demonstrations and used it there. Awesome, crisp lens, nice bokeh, fast AF. Can't say enough good about this lens. The IS was a lifesaver, BTW.",
        "Perfect in every way, an excellent lens at a great price, and a rebate too! Love it for years to,come!",
        "This lens was more than I expected from this seller. Look new! Came package well. Perfect condition!!! I’m well pleased and happy with this camera lens. I would buy again from this seller.",
        "This is a solid but lightweight telephoto lens with fast focus and blurs out the background beautifully (at lower F stops). This is an ideal option if you want to carry a high quality telephoto lens while participating in outdoor activities because it is slimmer and lighter (compare to the same lens with F/2.8). IS works great and is a must IMHO.",
        "Extremely well made and well performed glass in such a good price Professional quality image",
        "In the first few pictures taken, this lens has already surpassed my expectations. It's image quality is better than all of the other lenses that I currently own and is extremely sharp. The IS more than makes up for the extra cost, especially on the upper end. It's nice not to have to carry a tripod around for most events.",
        "There are many reviews on this item, so the quality has already been spoken for, the best thing about this is the ability to carry it everywhere. This is a nice zoom to hike with, going to the zoo, or just shooting the kids outside at play. I have rented the 2.8 version of this one and it can get rough on the arms. Very nice lens, fantastic quality, and easy to use.",
        "The color, saturation, and light that this lens allow it amazing. Compared to a lesser lens, you can see the picture is clear, crisp, with all the colors that are washed in the other one. The lens also seem to let more light through (about 1-stop) too. IS is amazing, and it's one of the best out there.",
        "This is the best lens in my camera bag. Meaning: versitile, light, and excellent image quality. I upgraded from the non-IS version(which is a great lens as well) to the IS and love it! I highly recommend this lens. For those who don't shoot birds or racing or in low light stadiums, this lens is all you need. I contemplated the 2.8, but decided for the much lighter weight of the f/4. I can consistently get three more stops with the IS. No complaints whatsoever.Bottomline: Canon L-series+image stabilization=HEAVEN Get this lens.",
        "It's really that simple. I've framed a 20x30 enlargement from my 8 MP XT that was handheld and very, very sharp. The image stablization alone is state of the art. And, the glass seems to be sharp at just about every range. If you're thinking about buying this lens, do it. It's impressive.",
        "Purchased this for 5D III. even though this is not the fastest lens, it works great in combination with 5DIII which has a great high-ISO performance. Not as heavy as f 2.8, and I think this is a great advantage.",
        "In my view it rates 5 stars! This lens has all the bells & whistles for me to work and accomplish what I want in grade \"A\" pictures! I haven't used it much due to the weather. Fits my Cannon T3i perfectly.",
        "It is what most of the reviews say! Super Lens, no regrets. Highly recommend. And the f4.0 works pretty darn well... especially with the IS !! Also recieved in mail FAST - and well packaged - TY AMAZON!!!",
        "I'm not a professional, but take photos of the kids racing their Optimist sailboats on the water and candid portraits of them on land. I had been a bit cautious before and thought that I'd never get my money's worth out of this lens, but after one week at sailing camp in Italy, the photos speak for themselves. The action shots are sharp and interesting (incredible light) and the candid portraits fantastic despite low light conditions. I can't wait to see what I can do with this when I get even better.",
        "if you don't have it. get it. Sharp, fun, amazing microcontrast. I use it together with a Kenko 1.4X PRO 300 TC when I want to get longer range. opted for that instead of the 70-300L cause the 70-200 is so much lighter and with fixed Aperture. great.",
        "Love it, it works well on my Cannon 5D Mark III yet still relatively light for carrying.",
        "One of the sharpest lenses ever...the stabilization is a big plus. But if u don't need it go with the non stabilization version for half the price.",
        "I love it. I really appreciate the fact that I can sit a bit further from my kids (2&7) and capture the moments. The smiles are more authentic when nobody telling then to smile. It is very nice for portrait, the bokeh is good and the color reproduction is comparable to my 35mm F1.4. It's not comparable to 70-200F2.8 it terms of performance in low lights photography but the size, weight and price offset it by a long mile. I guess it just fit my needs that makes me really satisfied.",
        "Very sharp lens. I liked the F4 for traveling and hiking because it's almost 2 lbs lighter that the F2.8 version and with the IS feature it really is like an F2.8 anyway.",
        "Its already been said about this lens 100's of times. I got the f4 because of the lighter weight than the 2.8. I don't shoot indoor sports so I don't miss the extra stop. This lens is super quick to focus and very sharp. Love the build quality, focus and zoom rings very smooth.",
        "I have a 5D with this camera, and it rocks, really sharp images. Be careful when using it on a tripod for long exposures. IS could make your images blurry, and I suggest using the mirror lockup function. It does not have a tripod adapter for the lens and the official Canon one is too expensive. I have used it without one with success. If you are looking for this lens, it's a great tool and the 4stops IS really works. If you are not tired, and there is no wind, and little influence from the exterior, a 200mm shot could be take at almost 1/15 - 1/8 and still be sharp.",
        "Got as a gift my my 12 year old and my wife for her Canon 5D Mark II.. They love this lens but the camera battery does only last about an hour when using this on automatic focus.",
        "It's a Canon! Sharp! Quality! The best! Light enough to carry all day as long as the light stays up and you need no more than f4. Highly recommend!",
        "this lens will not disappoint. And for those thinking about the 70-200 F2.8, I had one and it is just too heavy to use hand held. But the70-200mm f4 IS USM is perfect to carry around or to hike with with a back pack. Good weight considering how robust its construction is and great, absolutely great, pictures.",
        "There are a few tricks to getting tack sharp photos. Good glass is one of them. This lens is absolutely the best bang for the buck. A good carry lens as the weight is less than half of the 2.8, and in MHO, it is just as good all around, may be lacking in the extra 1 stop, but, for $1200 cheaper and half the weight, I think I can adapt... Don't hesitate, just get it...",
        "i love this lens. So much sharper than my 24-105. love it",
        "I am thrilled with the quality of this lens and the stellar quality of the images I get with it. The lense is built like a tank and the optics are so so satisfyingly good.",
        "This replaced my lovely 70-200 f4 non IS L lens, and this lens makes head and shoulder better images, even under circumstances where IS shouldn't help. For example, an F4 shot taken of a sign 200 yards away at 200mm, 1/500 second, yielded legible print with the IS lens, illegible with the non IS>>>>",
        "I am very happy with the quality of the photos. I used like every day lens, of course if you want to take pictures to the moon you must to use an amplifier(x2), but for typical photos for landscape are very good!! I think that the size is perfect ! And the \"water\" and sun proof is the most important for me, because a like to take picture on extreme places, like a desert, a mountain, etc. so you must need a lenses like this !!",
        "The best lens for the Canon system. Makes me glad that I switched from Nikon.",
        "The human eye, albeit an amazing accomplishment doesn't compare with this lens. The color, clarity, and sharpness of this lens is something that I have not seen in a zoom lens. Forego the vacation and go buy this lens. Its scary good.",
        "Did lots of research on telephoto lenses and settled on this one. It's been incredible so far with nice sharpness and color accuracy. I use it with the Canon 17-85 IS as my travel lenses for my 20D. Yes, it's expensive but I needed the quality and the IS. Hard to beat the build quality and image quality.",
        "What can I say that hasn't already been said about this lens? It's extremely sharp and produces vibrant excellent colors. It's probably one of the best lenses Canon has ever produced.",
        "Great lens. I have the f2.8 lens but it is so large and heavy so I bought this lens so I can carry it around with me when I travel. I cannot the difference between the photos with the 2 lenses when taken out in the sunlight. Great lens.",
        "Seriously the sharpest lens I have ever used, blows everything else out of the water even when 2nd hand. This lens is going to be spending a lot of time on my 6D.",
        "This is the sharpest, fastest focusing zoom lens in Canon's lineup. If you don't need a larger aperture than f4 and the 70-200mm range suits your needs, you can't go wrong with this lens. It is tack sharp from 70 thru 200, has a 4 stop IS system, and produces perfect color rendition. Simply put, this is an awesome lens. I have owned the 70-200mm f4 IS for a couple of years and this purchase was a gift for my son-in-law.",
        "This is my first L lens and I must say it was worth every penny. Super sharp at f/8 and nice bokeh as well. Took this to the zoo and love the results. Great general purpose lens for outdoor shots. Can't see paying twice as much for one extra f stop. Auto focus is super fast and IS is a life saver! Read every review before I purchased and never regretted it.",
        "This lens replaced my Sigma 70-200 2.8. I might miss the faster lens upon occaision but this lens takes much sharper pictures, not to mention that it's a lot lighter.",
        "I purchased this lens over a year ago. This was my first Canon L Series lens. It is called Canon's sharpest zoom lens, and from my experience, I'd have to agree. The Image Stabilization claims up to four F-Stops. My experience backs this up. At a local park near dusk, I photographed deer handheld at 1/15 of a second and 200mm and the photos were all tack sharp.",
        "Great lens for the price! Fast shipping also. Exaclty as anticipated.",
        "This baby has not missed a beat, you can tell the difference with the better lenses. IS for me moveing forward, they hold there value as well.",
        "I have purchased this lens replacing my old 70-200 f/4 (No IS). I can tell you that the difference was impressive. 1. Much sharper images with better overall quality 2. IS provides at least 2 stops down meaning you can shoot in low light better than the non IS version It's almost twice the price than the non IS version, this is the only con i see in this product.",
        "Top of the line lens, just perfect. It's a Canon L lens after all!",
        "Truly great lens I use it as my primary, for the $$$ you spend its worth it. I had the money to buy the f/2 but decided to get two lenses for the price of one this one and the 400mm f/5.6L both are great.",
        "I wish I had the f/2.5 but the f/4 works great too.",
        "This lens for the cost is a fantastic lens. Do not let anyone tell you that you need the f2.8 version of this lens, the extra stop of exposure will only be necessary if you are shooting handheld in low light situations.",
        "This lens provides even higher quality images then the non-IS version. Additionally, the IS is fantastic.! I have taken many crystal sharp pictures at speeds as slow as 1/10 of a second.",
        "So far so good---the reviews are accurate: From what I can tell this lens is clearer than my 24-105mmL--which I love to use. I have no complaints at all so far and find it light to carry--especially when I think of carrying my Sigma 120-400mm; I realize there is a big difference between the lenses but for carrying light I bought this lens. I took the Sigma to Hawaii last year but found I rarely shot over 220mm but felt the weight in my bag, so for travel I downsized. Sharpness and color is unbeatable. If you need a lens in this focal range you should consider this one."
    ]
}