{
    "entity": "Accessory Kits",
    "text": [
        "I have been using the Printer Dock 6000 for several years now. I love it so much I ordered this one as a back up. It was used, however, functions perfectly. My Kodak camera went bust a while ago, buy I continue to use this as a printer for 4X6\" prints. I am a photographer for a U-19 girls soccer team and make 4X6\" team photos for each girl at the end of the season. I wanted prints that would last a life time and the ones made with this printer fit that need. A little pricey per print, however, you get what you pay for.",
        "I asked before I purchased to make sure it probably worked. No it doesn’t fully print.",
        "I order this printer as a replacement. I received the product before estimated time of arrival. It worked right out of the box as I had the software already loaded on my computer. I have printed about 15 pictures so far and they are all perfect. And it was a VERY fair price. Thank you.",
        "I was printing pictures the day I received. It is great to find a printer dock that old that works like new.",
        "the dock was delivered on time and printed my first picture great;;easy to set up and doesn't take up a lot of room;;thanks;;",
        "Perfect way to print your own pictures for work or play! I purchased this for work, we have lots of winners and it is a nice small machine that I can use on the go or in the office. Paper is somewhat expensive but available at most electronic stores. Make sure you have the Kodak camera as I am not sure if another camera would work with the adapter set up.",
        "It prints great picture, but is a bit touchy. I gave as a gift any my brother did not use it very long.",
        "This product is temperamental. Sometimes it prints and sometimes it asks for \"paper\" when it has paper. When I get it going it prints for up to four and shuts down again. The shipper had it well wrapped and was generous with supplies.",
        "Easy to use and I enjoy printing and framing my own pictures. I would recommend kodak printer and dock for those that love to print their pictures.",
        "it broke after two weeks of use, we only used it four time and the camera would not fit firmly on the docking station",
        "This little printer spits out borderless 4x6 photos that are completely indistinguishable from those you would get from a photo lab. However, each 4x6 print costs, according to my calculations, just over 62 cents--and that's just for consumables (paper and cartridges) and does not factor in the price of the unit itself. Think about that before you buy it. My wife can't live without this thing because of how nice it is to have great looking photos printed on demand. I'm not so sure the convenience justifies the price.",
        "I have 3 digital cameras and usually take pictures and then never really develop or look at them. This printer is in a class by itself. Nothing compares. I buy Sony everything, but not this baby. The camera and the printer are worth the price of admission. Just took the kids to Disneyworld, and I already have photo-lab quality pictures in my Disney scrapbook and the kids helped out. What a cool thing. Do not even think of anything else. I did, and nothing compares.",
        "I have the Kodak CX6330. It ROCKS..... The dock works like a charm. This printer is so small you could fit it in your backpack!! This rocks. The prints look like they came from the photo place!! Are albums are filling up!! Overall great price and product!",
        "The title says I can buy the printer and camera for 130 new but that is not true that's not right",
        "Kodak cx6330 camera was given to me by my family as a Christmas gift. It stopped working after using it three times. At first I thought it was the battery, but after charging it all night the camera still didn't work. Bought a new battery ($14.00), charged it and still the camera did not work. After emailing the Kodak center I was told that the camera needed to be returned."
    ]
}