{
    "entity": "Surround Sound Systems",
    "text": [
        "Like everybody else says it is easy to set up. Wires are color coded and it is almost impossible to make a mistake. However...what disappointed me the most was the subwoofer. I have 2 Kilspch subwoofers that shake the room. This one is barely audible up front and close. You have to put your hand on the subwoofer to hear a light vibration. But the size is almost as big as my two other Kilpsch SWs. This was for a family room where I could not position any large speakers, it is a very asymmetric room. Yet they are connected to a Samsung 48 in 4K curved TV. We have to make do, I guess.",
        "Why does this require a review? It's the undisputed king of middle-class surround sound systems. It will never win an award for fidelity but compared to the competitors, it's an excellent bargain for good quality sound.",
        "Kind of good so far. Ish. One speaker, or speaker wire has gone out, not sure yet. The speaker in question was on the Front Left and it was scratchy every once in a while. It seemed to get worse and then finally cut out. I tested putting it on the Center wire(which had no issues) and it was fine for a minute but then got scratchy again, so I disconnected it. I will update after I contact Bose for a solution or Amazon for a replacement.",
        "\"Boy I tell ya what...\" Great sound! Bose is simply stellar! I miss my Wave Radio that I had to leave with my last job. I love my noise cancelling headphones ... never has traveling been nicer. NOW my home theatre has never sounded better (& I work in an audio profession!). Thank you for the joy of sound, BOSE!",
        "It's a good sound system, but i guess i was expecting a little more from Bose. The sound quality, even though it is really good, is not as good as they make it sound like in stores. When i toggle between my TV's original sound to this Bose sound system, there is a clear improvement in sound quality but as I said it is not day and night change. Considering I bought this for under $400 i am not complaining but I thought it was going to sound a lot clearer.",
        "I replaced my Infinity Studio Monitor 100's with the Acoutsitimass 6 system. Love the sound clarity and the surround sound flexibility I get with my Onkyo receiver. The subwoofer is impressive. I've been intrigued by Bose speakers but never took the plunge until now. My wife loves the small unobtrusive speakers.",
        "Best acquisition ever. I got this system on promotion (when Acoustimas 10 was already on the market), but it is amazing. I have it for more than a year now :)",
        "I have all ways all ways been a fan of Bose. To me they never disappoint",
        "Excellent product and BOSE still one of the best speaker system in the market. Also their customer service is very good and always willing to help. All sound system in my house are BOSE",
        "Just ok speakers..I Was expecting much bigger mad richer sound from this Bose system but it failed to deliver. Like other cheap sound systems the dialogues are very hard to hear at times. I Have coupled this system with a very expensive Yamaha receiver but it Doesn't help much in improving the performance.",
        "It will meet your expectations based on your room size. If you are not using for large living room this system is the best in crisp quality and bass it produces through the sub. Choose a best quality receiver and you will have an amazing sound!!",
        "I've wanted a set of Bose Acoustimass speakers for years. It was my father's day gift to myself. I've really enjoyed it. So have the girlfriend, the kids and their friends. I love the surround effects and how the room shakes when watching movies.",
        "Very very nice. I replaced this with my old system which had large and medium size speakers. Set up was a little confusing. But I figured it out. Love the tiny speakers and it does have nice sound. Im happy",
        "Nothing compares to Bose, especially at this price. Entry level Denon receiver is all you need to experience truly spectacular sound. Movies or music are delivered with an accuracy found no where else. I'm ecstatic!",
        "Excellent speaker system for the price. Bose systems have the best frequency response, EVER!",
        "While these may not be the loudest speakers you can buy or the deepest bass, the volume of sound that they produce are unparalleled in my experience. When positioned properly, it's truly amazing how sounds are projected all around the room. There are times where I have to pause the TV and rewind to determine if something that I heard was on TV or if it was elsewhere in the house. I would recommend this Bose system to anyone who values quality entertainment and wants to get the most out of their home theater system.",
        "Was impressed with the sound that that came out of these speakers!! They are smaller speakers but I must say they sure pack a punch and were perfect for size room put them in. Any average room they will definetly give you great sound. If you have a much larger room I'd probably go with bigger. But these were perfect for us!",
        "Great sound. Makes my apartment and 60\" 3D Samsung tv seem like a movie theater.",
        "very good surround effects, good subwoofer support, easy setup, I've had two sets for almost 10 years & they still sound great.",
        "I really LOVE these speakers. My home theater thanks me for purchasing these.",
        "great addition to our drawing room. bought refurbished ones but they truly have amazing sound quality.",
        "Fantastic sound for our 5.1 channel receiver! Bose is always best hands down and the price was amazing.....like on family guy when he ate the wild berries amazing!",
        "Works great. Fabulous sound. Just wish the sub-woofer was a bit more compact",
        "I was hoping for and expecting much more quality from this setup. Speakers do not produce a full range of sound I was hoping for.",
        "Nobody can make a room come alive like Bose. Well worth the money.",
        "Great sound at an even better price! Set up was super easy.",
        "I have lots and Lots and Lots of BOSE Products for well over 30 years when it comes to a nice clean sound BOSE is TOP OF THE LINE",
        "Bose always produces excellent sound. The only complaint is the size of the woofer. HUGE.",
        "Great sound - you really feel like you are part of the action",
        "The system is fantastic and brings the music alive in my house. I would never buy any speaker but Bose",
        "I have used Bose speakers for many years, they never disappointed me",
        "great sounding Bose Accoustmass speakers. I've wanted some of these for so long.....",
        "I have waited a long time to be able to purchase these speakers, and I am very happy with them.",
        "I love this system. I was sceptical towards BOSE as I often heard that their systems are overpriced for the performance but this system convinced me. The surround effect is so good that it sometimes fooles you and you really think there was something next to you. Sound quality is crisp and clear, the cables are long enough (my living room is rather large) and mounting of the rear speakers to the wall was no problem either (with the wall mounting kit, to be ordered separately).",
        "Sound is good, but I expected a tad better for the name. Some sound bar products make better options.",
        "Love this system about as close to the theater you can get plug and play no bs",
        "it is a Bose product. the movie room is now officially a theater",
        "Excellent sound at a great price. These were close out and were well worth the money.",
        "The sound quality of the system is just unbelievable. It needs a receiver to connect to television.",
        "This was purchased as a gift and the person love it.",
        "Great sound..I know there is a newer model but they work just as well for the price. Very cost efficient for the quality.",
        "The sound is really cool. My husband is very much satisfied with its performance.",
        "A bit pricey, but that's Bose. The system is easy to set up, with wiring clearly labeled. All wiring and connections are included and connectors are prepared and ready for installation. There is a lot of wire. Bose gives you very long lengths of cable, which for most typical installations is way too much. This is a small system, not designed for a large room. Stowing the extra lengths of wire can be a problem.",
        "Have these in an outdoor sunroom and it fills the space beautifully. The sound extends to the surrounding areas as well. Highly recommend.",
        "Sounds awesome. Nice and neat, plenty of wire--though, that can have its own issues.",
        "i hear every single detail in clear Sound this was a good investment i highly recommended this item to anyone who wants to try something different",
        "Sound quality is very good - crisp & sharp sound!",
        "clear speaker really good .. Used it for my business and love it",
        "A steal at $369. The sound from the speakers is amazing.",
        "Hooked it up yesterday. We ran a bunch of wiring through the attic to hide all the wires, should have looked at the product closer before. The subwoofer is actually like a computer too. The speaker wires go from the speaker to the subwoofer, then the woofer has an output to your receiver - this is ok, I just used some quick butt connectors and everything is good to go!.. Great product, as always with Bose.",
        "This is a great system and was easy to set up.",
        "Loved it. Amazing home theatre experience.. initially thought it needs no receiver... but you will need one.. I used Yamaha RX-V375 5.1 Channel 3D A/V Home Theatre Receiver. It worked great! Loved the \"Bose\" experience as always. Whished it could come with wireless speakers :)",
        "This is my 2nd Bose, but the first home theater system, I had Bose companion 2 multimedia speaker, I connected this to ONKYO TX-SR508, sound quality is great. I had a issue with sound quality initially, but changed the placing of the subwoofer little bit and adjusted the speaker position, the sound quality is simply Amazing and Awesome!!!....",
        "Coupled with Onkyo HT-R593 5.2-channel home theater receiver with Wi-Fi and Bluetooth ; our sound system is complete.",
        "AMAZING addition to our sony receiver. Sounds better than my parents full bose system. Save your money and pick these up!",
        "Fantastic Buy. The Bose Acoustimass 6 Home Entertainment Speaker System - Black is perfect for a decent sided room if you do have a large room you will want to spring for the Acoustimass 10. Great buy, great sound, easy set up and looks like I'm going to get along time of use.",
        "Amazing sound!!!! Even better than my older version of the Bose speakers. Easy install and everything is top of line!",
        "I'm in love with this sound system. I would recommend to anyone",
        "Awsome!! O brought it to Brasil and my living room has the greatest sound ever! Thank you amazon and Bose.",
        "The bad I have Buy one received for used this equipment",
        "i only recive the subwoffer and cables BUT I DIDNT RECIVE THE SPEAKERS i canrt belive it",
        "thanx for a great system...my living room now sounds like a full theatre...it's hard to believe so much sound comes out of speakers so small I got a great b-day present..thanx",
        "This item when I first saw it, it was 700$ so I added it to my wish list, a few months later it went down to 400$ which is amazing. When you purchase this you're going to need a receiver as well, and I bought a Yamaha receiver. To connect everything was easy and the bose speaker sounds amazing and very loud!",
        "Subwoofer DOA. Satellite speakers tinny and lifeless, my TV sounds better on it's own. Threw it out.",
        "This is one of the first times I've ordered something off of amazon & very disappointed, & not just with the surround sound. I also bought a receiver & it does not work either. I will not ever order any of my electronics off of amazon again!",
        "the best home entertainment speaker I've had. It's wonderful to have it once we watch the movie and TV shows at home which makes me feel like in the movie theater. highly recommend ! But the only thing I have to remind you if you buy this one, you need to buy another receiver."
    ]
}