{
    "entity": "Surround Sound Systems",
    "text": [
        "I wanted especially this system because it has all what I needed. Unfortunately Bose does not make these anymore. The seller mentioned used but in good condition and that it was. All works perfect and all items were safely secured and packed.",
        "I purchased the GS 3-2-1 for my bedroom and have enjoyed it thoroughly. Would be much better if it came as a blu-ray player but the sound is incredible and hook up is very easy. I had a problem with the cd/dvd player and contacted Bose corp. and they quickly sent me another player in just a matter of 4 days. The customer service team at Bose are also very friendly and helpful.",
        "Never thought I'd get one! These systems are great. Bose needs to bring them back.",
        "Recieved with some parts missing. Got the missing parts next day, that was excellent service. The remote did not work or get a picture. They replaced the remote and media center but it did not work. Sent it back and waiting for a refund. Bought one at BestBuy and it works fine.",
        "I bought the system for my husband and he seems to be pleased with it.",
        "Sounds good but do not have the manual with it.",
        "Ordered unit, only half was delivered, had to send back and settle for less of a unit, but am satisfied with it",
        "I am not writing about the sound which is very good the problem is the player at times it will NOT player any cd you make or other cd 's and Dvd's even the lens cleaner I bought .You think with with very good sound they can make a player that plays everything, what a waste of money",
        "My wife got this product for me in 2005 after I got back from a deployment. I have to say that I love it, only problem I had was with grounding but with a little research I was able to figure it out. I use it as the sound system for my media hub and still delivers strong sound after all this time. The low volume is great as you can still hear the crisp sound of breaking glass or explosions in movies. Overall is a great sound system for a medium size room.",
        "I bought this item a couple of years ago and just as soon as the warranty was over, it started acting up. It would freeze up on us constantly, which was very irratating during a movie! I couldn't find a place that would fix it locally, and I was reluctant to ship it to Bose for repairs... I'm glad I did! Their customer service was great, they made it easy to ship, and I got it back in about a week! So, the unit I give 3 stars but the customer service I give 5 stars.",
        "So wish I would have seen these reviews before spending so much on this POS. Once the one year warranty was up, the remote control stopped working. After further research, the remote was fine; it was the IR sensor inside the system. Spent $175 to ship it back to Bose for them to fix it and provide us another one year warranty on the unit. Sound is great, but for what we paid, the machine should have had many trouble free years. My Sony I bought after college many years ago is still kicking and was a fraction of the cost. I guess I should have been concerned when I saw the Made in Mexico sticker.",
        "Great set up, easy to use and sounds great. I bought it used and its still in great shape I am very satisfied with it",
        "I bought mine for my Husband.We have all the same problem as all of you do and most of all the sound is not good .and they don't give you your money back if you purchase threw Bose ,witch I did that's alot of money down the drain .They don't care .All I got was return it for repair and I haVe to paid for that also .",
        "FIgured it was the best one out there since it was BOSE. Well now it won't play ANY DVD'S because it says the FORMAT IS UNSUPPORTED. Had no idea why it would say such a thing. Looked online, and saw that a million other people had the same problem. Now I watch DVDs through my <$100 DVD player that never fails. Something wrong with this picture?",
        "What junk!!! Mine can only be used as a radio. Even CD's won't play on it - they freeze and I get a message \"unsupported format.\" I bought it to replace an excellent Bose system that I lost (along with my house) in Hurricane Katrina and because of all the other problems we had to contend with let this slide. Now I see that most everyone has the same bad experience with this piece of junk.",
        "This system developed a problem where it suddenly \"Can't Read Disc\" in the middle of movie. The only way to clear the problem is to restart the system. It happens with any DVD...even multiple brand new ones...at any momment during DVD play. It is ssociated with a sudden increase in disc drive noise...presumably because it is \"hunting\". Based on similar comments by others about the Bose 321 system on this web site, this appears to be a significant and relatively frequent problem...maybe even a design flaw. Audio quality was disappointing too. Definitely would NOT recommend this product...suggest you keep looking!!!!!",
        "With some of my older DVDs the unit freezes. In some cases I can press fast forward and eventually pass that part; however, in many cases it won't play after that point. There are definitely other products that sound just as good at a fraction of the cost. Not to mention this is not capable of playing HD or Blueray DVDs. Think twice before you buy. Also if I am not mistaken, this is only capable of 480p/480i.",
        "The Bose 321GS system is great. I took it out of the box and setup was very simple. I was listening to great sound from my TV in no time. The sound is great from the front. It does really sound as if the speakers are behind me. The vendor shipped the system right away.",
        "Similar story to others, only mine at least played DVDs for 18 months b4 the dreaded Format Unsupported start showing up. Now all I have is an expensive 3 speaker system that sounds good at times but at other times you can't hear voices. It was overpriced to start with but I bought into the Bose name thinking it would be quality. What a joke. DO NOT BUY THIS PRODUCT, anything else would be either cheaper or more reliable or both!",
        "Expensive and really not worth it! When I bought it, I sometimes got the message 'unsupported format'. They told me it was my mistake, that I did not put in the CDs or DVDs correctly. Now, the message is the same, and it won't play any CD or DVD at all and now they say I must pay the repair! Really great ):",
        "I wish there was something less than one star because one is too much for this pile of crap! Locks up during play, have had dvds stuck in the machine for days and now makes such loud noises that it is hard to hear the movie (when you can find one that it actually plays). Congratulations Bose for convincing me NEVER to buy any of your product for the rest of my life!",
        "Bose what more do you have to say ' I've had mine for more then 10 years still works perfect ......",
        "For the people who are about to buy this product; Bose has a big name is world renound, but to me the base of the System is very poor. You could to barely hear the base of music. We had an onkyo system that cost us about $200 and the base of that is more satisfiying. The system in a Honda car is more satisfiying than this so called \"Great System.\" So next time when you are thinking to by Bose, Think before you waste your money on this product.",
        "I watched 1 DVD on this before the on-unit display quit working. It now just shows random pixels that blink in odd patterns. It also doesn't turn off anymore either. (at least not by the button...it still randomly shuts off on it's own when it's done blinking pixels)",
        "bought a year ago and was fine then started locking up during store bought DVDs. The open DVD tray and close for 10 min just to get it to work again. been an avid bose follower till this now will only by speakers from them. AT $900 you would think it would last. save money and by SONY...",
        "We have had our 3-2-1 for almost a year and I wish we had investigated more before our purchase. The sound on the 3-2-1 is great but if you want to watch movies...forget it. \"Format unsupported\" or \"can't read disc\" will be what you are looking at instead of your movie. The system will not play some DVDs at all and will play some one day and not the next. I wish we had never bought this system!",
        "Great Media Center! The sound is excellent. For those who have had software quirks, check out this forum and download the ISO to update the firmware on your 321-I,I-GS,II,II-GS system! [...]",
        "The Bose 321 system is great for a 3 speaker system! The quick delivery by Amazon rocks!!",
        "We paid $1,000.00 because we figured because of the Bose name it must be a quality product. BIG mistake. Today we tried to watch a movie on the dvd player and got the \"format unsupported\" error message. Plus it says it is opening when it is not. The system is all of three months old. Save your money.",
        "The BOSE 3-2-1 GS Series II system, like most all of its other products, deliver incredible quality backed by superior workmanship. My advice - wait until you have the money and buy BOSE! It's worth the wait and delivers magnificent sound and performance.",
        "This system is absolute and positively JUNK!! Do not buy this product. I cannot even believe the hype that this product gets. Will never buy another BOSE product again!! Hope this helps.",
        "I have this system for about 3 weeks and today remote control stopped working."
    ]
}