{
    "entity": "Bread Boxes",
    "text": [
        "I received one that had been bent on the side and the door wouldn't slide closed. I submitted a damage claim on Amazon and they sent me a replacement immediately as well as a return shipping label for the damaged item. They didn't charge my card a second time for the replacement, I had only to return the damaged one within 30 days or they would have. That was more than fair and I love that this closes by weighted door verses some sort of magnet or catch. Nothing to go wrong with this one! It's very sleek and is exactly as pictured. I would absolutely buy this item again.",
        "We saw this breadbox posted as \"best buy\" so we went with it. It arrived in a flimsy off-the-store-shelf type of box... NOT in a secured shipping box. So, I shouldn't have been surprised. The flimsy sheet metal breadbox had a dent in it about the size of a golf ball. We returned the item for a credit and then went online to pay more (6 times more) for a sturdier, much nicer bread box. MORAL OF THE STORY: You get what you pay for.",
        "It sits well and holds a good bit. The only thing that kept me back one star was it is a bit flimsy. I wish it had a little more structure to it. It still looks great on my counter and serves the purpose.",
        "Looks really nice and possibly if they had made it out of something besides PAPER THIN STAINLESS STEEL FROM CHINA it may have worked. Incredibly thin, I can see my hand through it !",
        "The seller ships this item in the original lightweight paper package. No padding. No cardboard box. I will be returning this product for a refund as I have already returned one which was damaged for a replacement and the replacement showed up damaged as well. It looks like a nice, not so sturdy, bread box. Very lightweight.",
        "Very very thin metal it looks good on the counter but when I got mine it was all bent and wouldn’t close, I had to bend back to shape and it works but I was disappointed when I received it. I would have sent it back but I’ve read that amazon will cancel accounts with too many returns.",
        "Looks great but the metal is thin and the sliding lid is “rickety”, for lack of a better word. Any bread I put in it molds quickly. So right now it sits on the counter looking great but not being used.",
        "Very nice for the price. I love mine and it’s just the right size.. recommend item to others if you’re looking for something nice and inexpensive..",
        "I really like this bed bin but ithe stainless steel is so thin that is a bit fragile. Almost with any bump it gets dented. Besides that I love how it looks in my kitchen and keeps my bread fresh.",
        "Super thin and easily dented. Arrived in the breadbox's original box with shipping label. Very little packing cushion, so it was bound to get dented before arrival. Also, mine had weird turquoise paint and scuffs on the side of the item as if it had been preowned. I returned it.",
        "For almost $30 the door isn’t very smooth operating. Going to send back.",
        "I love this. Looks really nice on the counter. Good capacity. Holds a lot of bread and buns",
        "Fits 2 loafs of bread. Looks very nice in my kitchen.",
        "I would not buy this. It's flimsy, it came completely broken and dented. The door is smashed in.",
        "Holds two good size loaves of bread or bagels. It looks good on the counter and very eat to clean and open.",
        "Everything looks good except so not put sticker on item as it will not clean off even when completely peeled off. Maybe put sticker underneath where it doesn't matter. Besides that it functions and looks good. Thank you",
        "Unit arrived with the surface marred right in the front in a very conspicuous spot. Other than that it is great!",
        "Modern looking and stylish! Nice addition toward our kitchen upgrade!",
        "The bread box is bigger than I expected, but it's nice.",
        "Very poorly made. Not quality metal. Have to be careful each time we open it that it doesn’t come off it’s track. Light as a feather. Thin thin metal.",
        "Looks sturdy and fits into our kitchen perfectly. I'll update if anything changes.",
        "This was a great buy. Looks good on my counter",
        "It is a nice, well made item, however it doesn't hold two standard sized loaves of bread.",
        "Fits nicely on my kitchen counter. Just the right size for the two of us and our need for a breadbox.",
        "The metal underneath the rubber guards that easily come off is razor sharp! Watch out, I cut myself good on them.",
        "When pulling out of box after delivery the jinx looked like it had been through a fight all dinged up everywhere. Very thing metal and not lo g lasting",
        "Nice looking bread box, it is not big enough to hold 2 loaves of bread as stated. Wish that it was higher. I have one loaf of bread and it will not hold another full loaf. That is why I gave it four stars.",
        "Very light and the door was not aligned right. I had to bend it to make it straight and now it won’t open and close smoothly",
        "Wonderful........just what I was looking for. My kitchen is small and it fits perfectly on top of my microwave. Nice and deep, holds all my bread and buns. Would recommend.",
        "The counter top looks a lot neater with the bread inside the bin. It can hold two loaves of bread and a package of English muffins.",
        "It looks great in my kitchen fits just enough bread, buns and bagels All at the same time",
        "When I received it, the top had a big dent in it, and also the roll-up lid. I didn't realize it was so flimsy. I've sent it back and will order a different kind.",
        "This package arrived severely damaged. I don’t think it’s fair that I have to go out of my way to shop it back. It’s so inconvenient. Who has time for this?",
        "I love the look. It makes mess free. I used to have bread in the counter top and looked messy. Now it looks much better.",
        "Bought it to replace a red one that was similar.. This one was more flimsy, but acceptable.",
        "Product arrived extremely damaged and unusable. Will be sent back for a refund.",
        "Very functional. Looks nice on the counter. Keeps bread safe from the dog.",
        "Sorry it had a big dent on one side, so I returned it.",
        "Not the best sonce is was wonbly and finish was ot the best. Disappointed.",
        "The item arrived with a significant dent on one end. Very disappointed.",
        "Nice and deep with lots of room for multiple loafs.",
        "I love my bread box. I wish however, that the stainless steel was easier to keep fingerprints off.",
        "Serves the purpose I bought it for,,,,,very roomy,,,,material is a bit on the light side/not super sturdy",
        "This bread bin is large and retro looking. Why does the seller insist on using Sellotape to keep it closed for delivery. I am having a terrible time trying to get the glue off the bin. Even painters' tape would be better or a ribbon of cellophane, so that there is no need to put glue anywhere near the stainless steel. I am seriously considering returning this product, if I cannot get the glue off. Solutions welcome! In addition, this bread bin does not so much keep the bread fresh as keep the kitchen counters tidy.",
        "Works great and looks great. Not heavy duty, but it gets the job done. We love it.",
        "Gave it a gift to my Dad. Large capacity that fits two loaves of bread",
        "I used this breadbox to store bread. Not as much space as I thought but it was workable. After 2 months it started to rust. Tossed it.",
        "I like the look, but not the way it closes",
        "Just got this item and there's a dent on the top I'm adding a photo later",
        "Item arrived with a lot of damage. Ultimately item could not be used so repacked it immediately and sent it back.",
        "Complete trash came damaged and construction very flimsy had to give it a star to write this review",
        "It is great. Save a lot a money not having the bread to go moldy to fast",
        "Should have listened to the other reviews. Arrived with one side dented in.",
        "I wanted something to put the different types of bread that I buy. This bread box matches my kitchen appliances. It is well made.",
        "Not stainless steel. Cheap cheap cheap. Got it out of the box and it looked like this.",
        "Got this for my mother for a gift. She loves it can fit 3 smaller loaves of bread in it.",
        "Not ideal, returned the item and yet to receive credit from Amazon",
        "Too \"tinny\".....Not the quality I expected. rattled when I tried roll down the door.",
        "This is a beautiful addition to match my stainless steel appliances.",
        "The breadbox is flimsy. Not at all sturdy. You have to be careful opening and shutting the cover. Also much shinier than I thought stainless steel would be. The measurements in the ad were different than on the box.",
        "Opened the box on xmas and the side was all dented. It was embarassing. The thickness of the stainless steel is more like that of a soda can. Auto-door opens nicely. Size is a little small but works for 1 loaf and a smidge more.",
        "The bread box i received was warped. When placed on the counter, it rocks. The top of the bread box looks uneven above the door. Also, I feel it is cheaply made, very lightweight -not at all the quality product I was expecting. Even if this breadbox had no physical defects. I would still return it.",
        "It is not too large for the counter, but has lots of space inside for 2 full loaves of bread. Great purchase for the price.",
        "It is very simple. Nothing to rave about. I love this black trimming, it adds some sort of details to all the stainless steel. Really good box if you need something that looks good in the kitchen , wipes clean and closes well.",
        "Tinny and flimsy; will replace at some point, but will do for the time being.",
        "Love the item very professionally packed, GREAT PRICE super fast shipping A+++++++++++ seller deff will be buying more of seller. THANK YOU",
        "Nice stainless steel bread box. No fingerprints show on the surface; easy to clean.",
        "Beautiful and roomy I got a good deal because it supposedly had two small scratches, but I haven't seen them. I would recommend this product",
        "Nice looking product. We store all our bread products in this box and have made the counter a much better organized area,",
        "Met all my expectations. Would highly recommend it to anyone (especially where there is limited counter space). Would also make a great gift.",
        "I decided to return this about 45 seconds after opening it. The metal is thin and flimsy, and the construction very poor (e.g., little plastic end guards cheap looking and loose). Also, it was a bit lopsided, so it did not sit squarely on my counter. Maybe it works fine. Who knows. The design and manufacture were so poor, I didn't keep it long enough to find out.",
        "This bread box looks nice, but it is very cheap and flimsy. I will never buy this product again. Do not waste your money.",
        "I previously purchased the blue model and was very happy with it. My daughter took it so I had to get another. Compared to the blue, this one seems flimsy and I realize the blue coating added extra strength to the door. Wish I knew this before.",
        "Both sides were dented in. So I’m assuming it was dropped several times but I received my purchase. The dents will not come out. Very disappointed. It’s big and great for storage, the cosmetics of my bread box is awful 😡",
        "We'd struggled with bread wrappers all over the counter, and cruddy boxes that were way too small in the past. This one is nice and large (see our picture for how much it fits), attractive, and well-made!",
        "If I have ever seen a bread box in person at a retail store, I must not remember it, or no one really carries these anymore. I was tired of having various bread and bread like items scattered across my counters. We had been putting the bread in the microwave as a temporary solution to get it out of the way, but that is such a hassle when you need to use the microwave. So I bought a dedicated bread box! The door slides up and down very easily, it can fit 1 loaf of bread with various other breads as well. The brushed silver really compliments my kitchen set up of black and black and silver appliances.",
        "The base has no support and it just wobbles around on the counter top. The door worked one time using one hand and then it was getting stuck and I had to use two hands to open it. Total piece of junk and definitely not worth the almost $30 I paid for it. Already printed my return shipping label...",
        "The product was completely smashed in, you couldn't even open it. Both the product box and the shipping box were not damaged at all. The metal on this bread box is ridiculously thin and cheaply made. I returned it today.",
        "It's too small to hold much more than an ordinary size loaf of bread. What if you have a bag of cookies to include as well? I found they won't fit.",
        "Love, love, love this bread box. It holds 2 loaves of bread east and a bag of bagels. Gets them off the counter and put away in an attractive container.",
        "This box was horrible. I had to return it the day it arrived. It came slightly damaged (small dents) and looked gross just from my fingerprints removing it out of the box. Poor workmanship (very, very cheap) and would not recommend at all.",
        "Well, it’s a good thing my husband is a blacksmith and can beat this bread box back into shape. Looks like it originally would have held unsquashed loaves of bread, I guess I should be happy with this smashed bread box since my loaves don’t rise that evenly. Maybe don’t use the metal bread box as a soccer ball prior to shipping?",
        "Love this bread box! Looks good. Keeps everything fresh for much longer than not using a bread box. Super satisfied with this purchase!",
        "I just updated my kitchen. Very clean black and white look. This has sleek lines and a good size. Very happy.",
        "Not as roomy as I would like but for the price its a very good buy",
        "Excellent quality, very good size, the stainless steel has a nice finish. Would buy again, and recommend it.",
        "Its large so I like it I can fit my tortillas bagged and a loaf of bread. But I think the price was kinda high.",
        "I just received this unit and it came damaged. Actually i won't even say damaged because the box was perfectly in tact but the product is so cheap the right side of the door popped out of the rivet during shipping. I can't believe they charge $30 for this. Honestly it's not even worth $10. The metal is so thin and the thing barely holds itself together. Everything is cheap about this item, including the plastic edging that is already coming off as well. Beware of this item, do not buy!!!",
        "Larger than expected but really nice storage. Looks like quality product. Opens and shuts easily. Matches stainless steal kitchen appliances nicely",
        "This bread box keeps my home-made bread fresh and crispy and looks stylish enough for me to display it on the kitchen counter.",
        "Very neat bread box. Holds 2 loaves of bread, a Package of bagels and a package of English muffins",
        "My wife and I have used this Deluxe Bread Bin for a week, and it is really nice-looking, spacious, and opens and closes with ease. We have enjoyed using this product so far, and we have no complaints.",
        "I purchased this for my new home and love it! Larger than I thought it would be. I holds 2 loafs of bread...could probably hold more.",
        "This thing is absolute rubbish. It wasn’t level it rocked on the counter and was crooked. The black rubber seal aroundbhe edges was bowing and crooked. I could have made this by hand with more precision. Waste of my time and money. Returned it immediately .",
        "This \"Totally\" fits right in with the rest of my Stainless Steel Kitchen Appliances. I love it, and definitely glad that I made this purchase. My husband also likes it, and its big enough to hold the items that we want to keep fresh but covered and/or out of sight!! Love this and would recommend to family and friends!!!",
        "I don’t have a problem with the item personally, but the way the item arrived is terrible! Amazon/ups shipping ruined a Christmas present.",
        "Smaller than I thought, but works for my needs. I did expect it to be a little better quality, seems cheaply made but again, it'll work.",
        "I had this about 2 weeks before the door stuck and while trying to get it unstuck the door bent. Looks nice though.",
        "Very cheap looking. Doesn’t hold as much as expected. Also side had a dent in sjipping.",
        "An incredibly handsome, quality, and utilitarian product. I bought this as warehouse purchase; one for me, and then one for my daughter. Wonderful value."
    ]
}