{
    "entity": "Bread Boxes",
    "text": [
        "If you actually want to keep bread in this box, then you need to clean the entire interior regularly. The roll top covers about half the interior when you open the box so half the interior is not cleanable. The box does not come apart for cleaning. A bread box holding bread gets bread mold inside so it has to be thoroughly cleaned . So, the design is seriously flawed. If all you use the box for is decoration, then cleaning the inside doesn't matter. If you actually put bread inside, this is not a bread box to buy.",
        "I searched, compared, waffled about while making a choice—I made the correct one! Sturdy, sleek, enough room for 2 large loaves of bread & even a few pieces of fruit. Smooth sliding door, no fingerprints, and it matches all my stainless steel appliances and fixtures. No more messy counter. Well made, attractive, and roomy. What more could I ask for? Although the sides are black, this doesn’t bother me at all. Our stove top is black, microwave is black, so this does not detract from the design. Perfect price point for what you get; I’m glad I didn’t spend less or more. As Goldilocks would say, “it’s just right”. Get it, as I don’t think you will be disappointed.",
        "Fits perfectly on top of my refrigerator, also the roll up feature is so handy! Keeps my bread fresh for weeks. Lotsa room for like 3 big loaves of bread and tortillas/bagel bag. Bought a used returned one and it was just fine for top of fridge too.",
        "Looks great on the counter. Holds a large loaf of bread with room to spare. Did not come damaged as some people have complained about. The only thing that prevent it from being a 5 star is there are no rubber feet to hold it to the counter-top so if you lift the lid or close it and it's not pushed up against the back splash it slides around. I solved the issue by adding square rubber feet to the bottom.",
        "Breadbox looks great on my counter. It’s a little small for us in terms of capacity, though I love that it doesn’t dominate the counter space. I find it odd that the bottom is also steel. A removable and cleanable acrylic bottom would have a been a big upgrade. The door is a little lightweight. I can see how the other person below got one with it caved in - it’s not substantial. All that said, it’s attractive and mostly functional. If I were going to replace it I would buy something higher end, but until that day I’ll happily keep this one.",
        "Perfect. It's not spring loaded so no latches to worry about breaking off, like our last bread basket. The door is weighted so it's easy to open and close and is just the right size to stuff in a full loaf of bread, some bagels, and a couple bags of hamburger buns.",
        "I was so looking forward to this bread box. I loved its modern design. It seemed like it would be high quality too. However, I'm very disappointed in what I received. It seems flimsy and frankly--cheap (looking and performing). Not high quality. It costs more than it's worth. I wouldn't recommend this to anyone unless the price drops to $19.99.",
        "I can't believe how much longer my bread stays fresh with this box. I use to get a new loaf of bread and separate it and freeze half because it would go stale before we got it eaten,there are just 2 of us. Now I can put the whole loaf in it, put hot dog buns and muffins, plus we keep our butter in it, it holds alot, none of it has gotten stale or moldy. It's really looks nice on the counter but doesn't take up alot of room.",
        "I haven't used this, as soon as I opened it, I knew it would be too small. I don't know what kind of bread they are using, but it doesn't hold 2 large loaves of bread. Even with home made bread, it would barely hold one loaf.",
        "Nice bread box however I thought it would be a little more sturdy which was disappointing. Otherwise it serves its purpose.",
        "The brand name Brabantia speaks for itself: Decades of well made stainless steel gadgets combined with great style and functionality. This bread box is no exception. Bought this as a gift from a wish list and had to inspect first because the box was shipped without outer box (I was not pleased about having the shipping labels all over the box which left sticky residue on the box!!!). Other than that, I can only recommend.",
        "Wow it is just like the one my mom use to have. I love it. I got it because, for some reason we had mice in our house for a while. The one thing they liked was our bread. Not with this. They could not get to our bread. Well, we got rid of the mice real quick but, I now have a beautiful way to keep my bread safe and fresh. Plus, it gave me a good memory of mom.",
        "This breadbox is the real deal. Keeps the bread fresh, and keeps the critters out. The overhead door slides very smoothly and with very little effort. A one handed operation. Also the top is sturdy, and big enough to acomadate. three Large OXO cookie jars without interfering with opening the door. So you save space too. My sister has limited countertop space so I convinced her this is the way to go. It will fit on her counter and not take up too much space and look very clean and cool too.",
        "Great breadbox. Do not catch mildew as other wooden / bamboo boxes. Easily cleanable. Bread stays fresh for couple of days. I bake my own bread and this box easily takes 2 typical 2 lb loafs. Flat top surface allows to place some additional item (I have phone and Caller ID sitting there) on top of the box. One thing - some what flimsy construction. Pivot rivets made out of aluminum and will fail eventually.",
        "Very cheap, first time I used left side of door fell off track. Would not recommend.",
        "I'm so happy I ordered this breadbox! I love the slick stainless look. It has enough black trim to match the other appliances on the counter. Large cavity, holds couple loaves regular bread plus bagels and burger buns. Recommend!",
        "I needed a bread box and this one matches my appliances and other kitchen items. That is why I ordered it but I was so impressed when it came. I love it. It is large and sturdy. Looks great. I recommend it to my family and friends",
        "This bread box is able to store a loaf of bread, and a package of bagels. It looks Nice and sleek and is easy to clean.",
        "Super nice large spacious bread box. I have one and bought this for my bff. Evause hers broke ! This is too sturdy to break! Had mine for years and still kickin!!! Thank you ! Great seller!!!!",
        "perfect size to hold loaves of bread and/or additional items to keep kitchen counter clear. HOWEVER... I purchased and installed self adhesive anti-skid black foam/rubber strips (few dollars from Lowe's) to bottom ridges to protect counter and keep from sliding around when using it. after that, very pleased.",
        "We got roaches the size of dogs. This means we don't have to keep bread in the fridge anymore. It looks nice. Is easy to use, and works. It holds 2 loaves easily. Mom can fit a loaf n bagels n stuff.",
        "I just remodeled my kitchen and had never had enough counter space for a bread box. This is fantastic! It perfectly compliments all my new stainless appliances; I love that its flat on top so I can put stuff on it without it rolling off. It holds both a full loaf of white and full loaf of rye bread. The rolling open and close is very easy and convenient. I LOVE it!",
        "Product detail states the breadbox holds 2 loaves. However, the lid does not allow enough space for two. Also, for the price you pay you would expect there to be non-skid pads on bottom of breadbox.",
        "I'm a believer. I thought this box would just be a nice way to reduce clutter on my pantry shelves, but it has dramatically increased the shelf-life of my various breads (home made and store bought). In some cases, it has almost doubled their mold-free existence. Additionally, it is visually appealing and does not require additional space to open -- the top also serves as a convenient shelf.",
        "We love this for our homemade bread! It keep it soft for 4-5 days and is easy to clean. We measure 18-inches of foil and place it on the bottom and wash it once a month or so. I love the Brabantia brand - high quality products that work :)",
        "love this breadbox. looks sleek only downside it doesn't stay put. It sometimes slides on my microwave when opening. otherwise big inside. alive pricey but i'm happy. fingerprint resistant. easy to clean.",
        "This bread box looks sleek, but is made of thin metal and the operable lid has already jumped off it's track on the left side. We have to be real slow and careful about opening and closing it. Good grief! CHINA!?!",
        "Spacious. I love the finish. The door moves very smoothly. Do keep in mind the size. It is wide.",
        "I wanted a bread box that fit unobtrusively on top of my microwave that sits on my countertop. It had to be short enough to also fit underneath my cupboards. It did so....looks great and works great.",
        "The product works as advertised in keeping bread fresh. Kudos to Amazon for quickly replacing original unit that arrived damaged. They didn't even ask for the damaged unit to be returned.",
        "I was not sure about a bread box that cost this much. But after purchasing one from a large chain store, that was absolutely junk, I decided to spend the money. This is a sturdy and attractive breadbox. Just the right size for us. I like the slide back top and it is heavy enough to stay in place. . Best of all the stainless really does not leave finger prints. I like the black sides with the stainless front. Expect this to last for a long time.",
        "The breadbox was damaged so I returned it! Also didn't seem to be as \"solid\" as I would have liked. Otherwise I would have ordered another one just like it! I did find another one that I liked though and ordered it and am very happy with it! Also I noticed that the seller had said the reason for return was that the item was shipped late...............which is not true! I received it on time but it was damaged. I guess that makes the seller look better to say it was shipped late rather than it was damaged? Let's keep it real please!",
        "Bought this to go in our newly remodeled kitchen mainly to get rid of an old basket we kept bread and small snacks in. The Bin is plenty large for a couple of loaves of bread and a small bag of cookies. The roll top door easily tips open to allow easy access to the large interior. It looks great and fits in with a stainless steel decor perfectly. The item came very securely packaged and arrived on-time - everything as advertised. Glad we made the purchase.",
        "Higher quality than most of the other similarly priced bread boxes on Amazon. It is extremely large though, so I had to return it. Keep the size in mind if you are purchasing. It is huge! It is also silent when you open and close it and would keep bugs out a lot better than the smaller sized model I replaced it with. I wish there was a small size of this one available!",
        "Works great to keep countertops tidy. Easy to clean. Well made. Not sure if it actually extends the life of bread, but it can't hurt!",
        "The sleek design belies the fact that the capacity takes a lot of home-baked bread. Easy to use and clean.",
        "Very classy and has a smooth operation with a ingenious back stop inside of it to avoid overextending when opening. Excellent choice for kitchens with black and stainless appliances. We have it on top of the refrigerator so how it opens is a real plus. The space inside is plenty adequate for one large loaf and extra bread items too.",
        "I just received this bread bin and it looks nice but it’s cheaply made and flimsy. I figured I’d give it a try as it looks nice. Within 2 days the flimsy lid had come off the tracks and will not go back on. I will be returning this for a refund. I’m so disappointing after reviewing many bread bins and the high ratings this one received. I cannot understand how no one else had had this issue.",
        "Love this breadbox. Doesn’t take up a ton of space, very modern and sleek, holds Italian bread, loaf of wheats and wraps.",
        "So happy with this product! Perfect size, holds hot dog rolls hamburger rolls rye bread and English muffins all at one time smudge proof stainless steel and so far keeps everything very fresh. Very very happy I chose this product .",
        "Looks good. Perfect choice for kitchens with stainless appliances. Holds a loaf of bread - or two half loaves, some hotdog buns and English muffins with room to spare. Would recommend.",
        "Very attractive and well made bread box. We looked at several others online and in stores prior to purchasing this one and none were of this top quality. The front slides open very easily and this bread box can hold two loaves of bread, though I have just one standard loaf along with a package of English muffins and another small loaf of bread. I also like that it has a flat top so you can set something on it if necessary. And no fingerprints! I am very happy with this purchase and would highly recommend it. It may seem a bit pricey, but it's well worth it.",
        "This is great quality and looks really good sitting on my kitchen cabinet.",
        "Really like the look of it. Ordered the brushed steel with black trimmings and received the international shipment in excellent condition after just 5 days. Looks sturdy and is sturdy. Well built with a 10 year guarantee. Did find a teeny scratch on the black coating but too small to deter from giving a five star rating. Definite thumbs up for this product.",
        "Just what I needed to reduce the bread bag clutter off my counter.",
        "It looks great and cleaned up the messy looking counter. It holds more than I thought it would as well.",
        "too small, half a loaf of bread a package of peperage farms buns and you are done. Had to put double face stickers to keep it from sliding around.too light. to keep stabilized and let me be able to open it, without moving.",
        "Great for bread and bagels! Nice sleek design, so happy they changed the closing mechanism. Works great! Lots of room for a loaf of bread, and a bag of mini bagels and a tray of 4 muffins.",
        "Great item, protects bread and provides freshness longer by 4 days, my wife was skeptical at first but once received, she loved it and over time proved to be the best bread preserver ever.... will buy again and very much recommend it.",
        "I ordered this Brabantia Medium Matte Steel Fingerprint Proof Roll Top Breadbox and it was delivered right away. However, the one that I received was not the breadbox that is pictured, it has rounded steel sides and is not black on the sides and bottom. Nowhere did it have the Brabantia name trademark and the box that it came in was from another company. Two weeks later I saw the breadbox that I received in a mail-order catalog for kitchen gadgets and supplies, and it was clearly the pictured one exactly the same as the one that I received, FOR $19.99!!!!!!! Clearly not the price I paid for it! So, I learned a valuable lesson...",
        "Fingerprint resistant so it stays clean and neat. Sleek look matches our stainless steel appliances.",
        "This is great! The lid opens and closes smoothly, but is too heavy for our bread-loving cat to break into himself. We had a small problem with condensation caused by the heat of our coffee maker, but the box dried out quickly and the problem hasn't recurred.",
        "It keeps breaking everytime I close it. Not sturdy. I like look but unfortunately it is a pain in butt to fix metal when I close it every other time.",
        "Very nice bread box with a modern look. Well constructed and plenty of room for more than one loaf of bread.",
        "I like this breadbox very much. It looks at home in my stainless steel kitchen. It cleans up beautifully and the modern lines add to its beauty. I am seriously considering adding the matching canister set to finish off the look. The inside holds all my snacks just right. P.S. I keep my bread in the refrigerator.",
        "This looks god with our black and stainless appliance package in our home. It fits lots of breads and you have a little shelf space on top also. Keeps the counters neater without bread lying around.",
        "Perfect size for my kitchen counter. It's definitely smudge-proof and it has the ability to store alot. Love it.",
        "Beautiful, perfect to clean up the look to my kitchen. Plenty of space for a variety of items",
        "We've had this sleek bread box on the counter for three years and it is great. I like the flattened top for stacking other things, such as the cordless phone, a box of sandwich wrap. We can store a loaf of bread, two sleeves of bagels and perhaps a leftover bag with a few tortillas all at once. It's a little tight at the beginning of the week but anything bigger would seem obtrusive on the counter.",
        "I love this breadbox. I decided to shop on Amazon since I wasn't sure if I could find what I was looking for in nearby stores. They had tons of breadboxes to choose from. When I saw this one I was so pleased. It matches some other appliances I have in my kitchen perfectly. It looks great sitting on my counter top & makes the area look nice & neat.",
        "I love my breadbox! It matches my stainless steel appliances extremely well. It has a lot of open space inside of it so it can hold a full loaf of bread and a pack of buns or whatever.",
        "Exactly what I wanted! I was tempted to purchase a cheaper bread box (much cheaper), but decided on this one because of all the stellar reviews and the fact that I dreaded the thought of constantly wiping off fingerprints. The bread box goes very well in my new pantry and holds at least 2 loaves of bread. Definitely worth the extra money.",
        "We just remodeled our kitchen and needed to switch out our white bread box for something a little more \"well refined.\" This fit the bill. Of course you have to clean it, but it doesn't show a lot of the everyday smudges. It looks great, hides our bread packaging, but is still easy access. I usually have one loaf with a small bowl of butter in this bread box, but it will hold two normal sized loaves. Worth the price.",
        "This gorgeous bread box exceeded our expectations. The streamlined design looks great on our countertop. And it holds all of the fresh bread and cookies that used to clutter up our counter. Love it!",
        "The front rolltop was dented in when I opened it, even tho the box was not damaged. I boxed it up and returned it the next day.",
        "Pros: Very roomy Looks great Cons: My bread doesn't really last longer, but it beats keeping it in the pantry There is a possibility that your bread can sweat... I bought this for my husband because they used them in Uruguay... Would I have gotten one for me? Probably not",
        "Looks great, does not fingerprint. Nicely built, but lightweight.....moves easily. I am going to get some rubber non-skid pads. Fits 1 large full loaf of bread and another smaller item.",
        "Large enough for 2.5 loaves of bread. Looks great. Keeps the counter clutter free.",
        "Perfect for my counter top! Love the look and size. Fits about 3 packages of bread comfortably (not full loaves).",
        "This one replaced a similar Brabantia I have had for 18 years! Never broke or anything like that just decided it was time for a new one. Very large inside and looks nice! Fast shipping!",
        "These are extremely nice. Fingerprints do not show and with traffic in and out of them, nice to have that feature. Bought two and their addition to my kitchen makes it look very organized and clean, yet keeps bread, bagels , and other bread products handy. Great investment.",
        "Only disappointment had to do with its packing! The box was flimsy & some protection shifted. hence a sm dent. It is lovely & functional",
        "It fits two loaves of bread and it looks great on the kitchen counter. It was a great price on Amazon compared to other retail stores, and my relatives loved it because it looks so sleak. It looks exactly like the picture. Great price and great style for a bread box.",
        "ORDERED THIS AND HAD TO RETURN IT TWICE BECAUSE IT IS NOT THE ROLL-TOP AS SHOWN, IT IS THE FLAT FRONT OPEN MODEL THAT LOOKS LIKE A TOOL BOX. VERY DISAPPOINTED THAT BOTH TIMES IT WAS WRONG EVEN THOUGH THE DESCRIPTION AND PICTURE IS ROLL TOP. WILL LOOK FOR WHAT I NEED SOMEWHERE ELSE!",
        "Very nice! Fits on counter perfectly, looks great with stainless steel appliances, matches well. Not cheap looking at all, very good quality.",
        "Love the design and no finger print guarantee. door lifts easily and more fits into it than you would think when pulling it out of the box. Thank you for a wonderful product.",
        "Bought it for my daughter-in-law And she liked it very much",
        "Was kinda concerned when reading some of the reviews. I myself had no problems upon receiving and think it is perfect for what the family needed. Great for keeping all the bread in one neat place without looking at all the plastic wrapping.",
        "Gave this as a gift to someone just starting out making bread from scratch. They love the look and construction. They're very happy with it.",
        "Impressed with the quality, but in particular the size - perfect for a household as we have two loaves of bread and hamburger buns, not to mention english muffins, on hand at most times. Whether it helps to keep the bread fresher, longer, only time will tell. Really like it so far.",
        "It's nice and big. I got it to replace my old wooden bread box.",
        "Nice breadbox.there is a flat top where you could place other items but not very wide.,thought I could put canisters there but mine wouldn't fit.good size,accommodates our bread products .",
        "I absolutely love this bread box. It surprisingly holds lots of bakery items, and it blends in so well in the kitchen. It’s very sleek, durable and easy to clean. Best purchase I’ve made this year.",
        "Great for helping organize and keep bread fresh. We put 2 loaves in consistently because our family likes different breads. Fits both easily",
        "Great breadbox Keeps everything fresh for a long time Beautiful quality",
        "Not only did I receive the wrong item, but the bread bin was shipped in its original packaging and had two fairly big dents. Regardless of the defects, I was not pleased with the flimsiness of the product. Save your money and time.",
        "So happy with this Breadbox . It looks even better in person. Holds a lot and is easy to clean. Also arrived in perfect condition exactly when they said it would. I’m a Very satisfied customer",
        "I was very satisfied with this Brabantia roll top bread box. It is attractive, exactly as shown. The top rolls up with ease and it indeed holds two loaves of bread. Would definitely recommend it.",
        "It keeps the bread fresh, in addition it is made well and is decorative in a modern kitchen.",
        "I bought this bread box because I was sick of looking at small boxes and doggy treats sitting on my counter. It keeps the counter looking neat instead of messy. I don't keep bread in it so I don't know if it keeps the bread fresh. Does not look cheap.",
        "This breadbox is fantastic. I don't use it for bread but it's sure pretty on my countertop.",
        "The size is perfect, it holds a good amount of breads, rolls, or loaves. It is completely fingerproof/smudgeproof so requires very little cleaning.",
        "Excellent size, fits well on countertop and holds bread, biscuits, muffins, etc. and it REALLY does not get fingerprints.",
        "I'd carefully read previous reviews on various bread boxes and decided to pay just a bit more for this product based upon that feedback. I'm glad I did. It's a quality item, seems very well constructed, is attractive. The door slides smoothly and silently. There's a good deal of space for a loaf and several biscuits, or even two loaves, I'd guess. Pleased with the purchase.",
        "So far I love this bread box. It matches all my appliances in my kitchen and the finger proof finish is great. I wish my refrigertor had that finish. I received it just 2 days after placing my order.",
        "I really love this bread box. It looks very nice on the counter. It holds lots of items as well. I treat it very gently because of other reviews I have read about denting. It is not the sturdiest product, but does the job.",
        "Keeps bread fresh. Size works great for fresh French bread we pick up at the local store.",
        "The box is very nice but it wasn't big enough. I could only fit one loaf of bread in it and maybe a half pack of buns but the box itself is nice and durable. I liked the no fingerprints part of this item so I thought I'd give it a try. For anyone needing something smaller this would be perfect but just not for me.",
        "I was hesitant to buy this product because I never used a bread box before and didn't want to spend $50 + on a product that I might not like, however, I love this product and would recommend it. It keeps our bread and bread products fresher longer and it looks very classy on our countertop.",
        "Great bread box. Looks great with all my stainless steel appliances. I have a small kitchen and this box works well for me. I can usually fit a couple of things in it. It makes my kitchen look less cluttered."
    ]
}