{
    "entity": "Extension Ladders",
    "text": [
        "I almost killed myself using this ladder. After 2 years of proper use and care, this ladder cracked while I was high up and I fell all the way down. Luckily, I fell on a pile of snow, so I only had some bad bruises, but it could have been really bad. After 2 months of fighting with customer service and them accusing me of tampering the product and misusing it, I gave up trying to get the ladder reimbursed or replaced. I'm never buying this brand again.",
        "My friend was a cable installer, so he became very good at maneuvering ladders, but he ALMOST dropped this one. I don't recommend trying to using this one by yourself unless you are much stronger than I am. Once you muscle this monster into place, this is a great ladder.",
        "I love these ladders. I have only and will only purchase Werner ladders. Unfortunately, when my ladder arrived it was damaged. I did not see this on the first inspection since I had one of my employees check the ladder in who is fairly new. I hope to purchase again from this seller. The shipping time was phenomenal. Almost a week earlier than anticipated.",
        "Product arrived with a large puncture hole through the ladder rung. Absolutely unacceptable to use a damaged ladder on any job.",
        "It was delivered on time. I did a quick inspection to ensure no damage during ship. Solid safe extensions ladder.",
        "The Werner ladder was delivered in great condition, fit my winter gardening needs, and will store well where I measured in our garage to fit it. I do recommend hiring help to move it because it is long. Also, consider securing it with 4' bungee cords to what you are climbing if possible when extending it its full length for extra security.",
        "Great pricing, excellent ladder. Top notch construction. Fiberglass was the \"over the top\" bonus I wanted for non conductivity. Note: Buy some endcaps to protect your walls. Even max extension of product feels safe.",
        "great price and very safe while cleaning my house gutters...",
        "A great product, extremely well made and will last for years. Will meet most of your outdoor needs.",
        "ladder is great but the delivery time was bad didn't think i ever was going to get",
        "My husband wanted this to paint the house. Very sturdy and he feels safer than with the older cheap aluminum one we had. Glad we bought it.",
        "I knew this was the ladder I wanted. Could have bought it locally, but didn't have to pay for shipping or sales tax with Amazon. When the first ladder arrived, it was damaged and totally unusable. I refused the shipment and notified Amazon. The shipment refusal was verified and Amazon immediately had another ladder on its way to me. Second ladder was actually packaged better than the first one and arrived with no damage. I have had nothing but positive experiences buying from Amazon and will continue to buy from them. Can't beat the tax exemptions and their free shipping is awesome!",
        "I am uses to using an aluminum extension ladder that is rated for 250 lb. I originally thought that I wanted to replace my existing aluminum extension ladder with another aluminum ladder because fiberglass is slightly heavier and I thought that I would not like the added weight. I bought the 20' fiberglass ladder rated for 300 lb. and I am amazed! Aluminum extension ladders have a lot of movement in them when you climb up and down them. This fiberglass extension ladder is rock solid. It's like walking up a stair case! I will never own another aluminum extension ladder again!",
        "It is beautifully strong. 60 lbs. stable. Moving it around tires me so I bought an aluminum match as well",
        "The first ladder we received had several areas where the fiberglass was broken, making the ladder unusable(thus the 4 star rating) . We refused the shipment. The second ladder showed up in perfect condition. Can't beat the free shipping. And Amazon made the replacement easy.",
        "Three stars for great werner ladder but that's why I bought it I knew it was a good product..Ladder came damaged and looked as if I had used it for work for two years already.",
        "three generations of my family uses Werner ladders and have never had one fail, bend, or break in the 40+ years that i have been using ladders. Ordered this one because i needed a new one for the new home i just purchased and needed to get up on the roof alot and got tired of borrowing dads. In my opinion these are the best ladders on the market.",
        "I am extremely happy with this purchase. Not only did I save over one-hundred dollars by purchasing it at Amazon but they also delivered it to my door step for free. It only cost $309 and only took about 2weeks to get it. I tried purchasing this from other big vendors such as HomeDepot & Lowes and they wanted $349 plus $65 to $75 for shipping. Amazon Shipped it to my door step. I am so happy.",
        "Good quality, good price, delivery as expected, ladder is heavy but easy to handle outdoors, leveling feet make it somewhat complicated indoors. Wish I had only bought the20 ft model",
        "What a great ladder, and delivered to my door. I am very happy with the ladder and Amazon!",
        "Solid and sturdy, sharp looking. Certainly a professionals choice. Great for any job. A great general purpose ladder. It is not a heavy ladder to have to carry from location to location.",
        "230 lbs, up 20 feet trimming palm trees, what is not to like. Solid. Delivered to my door and put in my garage, no sales tax, less money than the local stores. HD has got some learning to do.",
        "Werner makes the best ladders, I'm very happy with this one. At this length it's a 2-man operation to get it in place, though, I find it hard to move around by myself but is manageable if you have to.",
        "The product is accurately described in the Amazon.com description. It is long and weights over forty pounds. It required special shipment handling due to its size. The delivery was on-time and the ladder is great. I highly recommend the product and company to all.",
        "This is a great ladder, but it arrived with a severely twisted foot making it unusable safely. I can find NO contact information for ordering a replacement foot and no way to contact the seller. I need help!!! This product is not a great value when it can't be used. All other aspects of this transaction were great.",
        "Very stable extension ladder if you need to clean your second floor gutters or climb up on the roof. Best if used by two people due to it's weight and length.",
        "First ladder arrived unpackaged.... banged up with frayed exposed fiberglass in several spots. I refused shipment, wrote Amazon an email about the lack of any protective packaging, and looked forward to a replacement. The replacement ladder arrived again, without packaging, banged up, chipped, and chunks of fiberglass missing. This was the second ladder to arrive without protective packaging. I was not able to inspect when the driver dropped off the second ladder. Amazon says I can haul a 24' ladder to a place that will ship it and they will replace it. Not easy with a small car, and there is a high probability the third ladder will arrive like the other two. Stuck with damaged ladder!",
        "Werner's labeling on this ladder (and probably their other extension ladders) is deceptive. It is listed as a 20 foot ladder. Additionally, the \"maximum reach\" is listed as 19 feet. However, when the ladder is fully extended, it is only 17 feet long. The two individual segments, if laid end-to-end, are 20 feet long. The \"maximum reach\" assumes someone of 5'6\" height is standing at the highest recommended rung (IOW, their height combined with the ladder). Why does Werner use such ambiguous specifications? Wouldn't it be a lot more simple and intuitive to list the maximum extended length to be 17 feet?",
        "I safely moved up in the world with this purchase! It is an excellent quality extension ladder. Safely reaches to where I need to be. Better and safer by far than my old aluminum extension ladder that seemed to shift with every movement I made. I had an opportunity to try this ladder out when my neighbor offered me the use of his Werner extension ladder. I liked it enough to buy my own. I have since purchased theand theas a backsaving accessories. Now I can easily lift and roll the ladder to where I need it without straining my back. I also use theand the. Werner ladders are sturdy and well worth the price! ~ The Boss",
        "After only three years of relatively light use (non-commercial), a fiberglass rail has split and the ladder is now worthless. I'm amazed how far downhill Werner products have slipped. There are better made ladders out there at comparable prices. I can't imagine I'll purchase another Werner ladder again.",
        "This ladder is very solid. It extends and retracts without hanging up. This is an size excellent choice for people with a two story home. It is light and yet very solid even when fully extended. If you are not sure if you need a 300lb duty rating consider your own weight (also consider what you may weigh in 5 years :)) plus what ever you may be carrying (shingles, tools, a bag of cement). You won't be sorry your ladder is more than strong enough to handle the task. I also bought a levelerthat makes this ladder great on uneven ground or perpendicular on steps (stairs).",
        "I like the solid feel of this ladder, and you can do electrial work and you are not grounded. I use it with the automatic ladder leveler, and quick click stabilizer. Both of which I think are very good, and wouldn't use the ladder without.",
        "Ladder is great. But why someone would pay over $300 for it when it's under $200 at Lowe's is insane",
        "You would be 50 bucks ahead by going to Lowes oe Home Depot.",
        "Bought this ladder to climb to the second story of the house. Was a bit concerned by all the negative coments about shipping but took the risk. Ladder came with no issues works great and was dilivered a promissed. No nicks or broken issues would definitly buy from them again. Best ladder made in America.",
        "This same ladder is at Lowe's for $239.00. How can it be so much through Amazon? I've read it three times and it's the same 24', Rated 1A at 300lbs",
        "I've had a Werner attic ladder for 4 years... the ladder leg hinge broke. I've used the ladder a total of 12 times and I'm under the weight limit for the ladder. The company's response... buy a new $300 ladder and pay $200 for someone to install it. BAD COMPANY"
    ]
}