{
    "entity": "Extension Ladders",
    "text": [
        "I used to borrowed extension ladder from neighbor when I wanted to climb up to the roof and clean up the gutter. It's very inconvenient but I could not carry a ladder home with my sedan. Eventually I found out this and brought it home through Amazon. It is reasonable strong for my weight (160 lb), but might be somewhat not sturdy enough for a 200 lb guy as it claimed. I had been use it for few years, and felt it's a good time to write a review for its durability. Nice to have one for any home.",
        "Excellent extension ladder. Light and very easy to move from place to place. Stays in place. If you are under 200 pounds, including any tools or buckets you bring up with you,this is a great ladder at a reasonable cost.",
        "Awesome ladder!! I was looking for a light weight easy to maneuver around the house ladder. This one definitely fit the bill!! Even the Fed-EX delivery lady said she wished more customers order these light weight ladders. HA!!!",
        "Bought this for my husband... He really likes it. No complaints",
        "The ladder is light weight yet sturdy. I really like it.",
        "Great product and bargain price with delivery to our house.",
        "great ladder for the price. quality built for a light-weight and easy to handle.",
        "The ladder arrived with dents in the frame, despite the fact there was cardboard packaging over it. The aluminum is very light, which makes it easy to carry, but it does seem somewhat flimsy. Okay for occasional homeowner's use.",
        "It's so light weight! Much easier to use around the yard than other, heavier, foldout ladders.",
        "Some of you may be thinking, why should I buy a ladder from Amazon? There are plenty of local stores in the surrounding area...but none offer delivery. This ladder is around 14 foot long non-extended (28foot extended), so to have it delivered right to my house was great! I used the ladder right away and was able to reach every part of my home. It is rated for 200 lbs, I am 175 and I did not feel any give at all in the ladder. Nicely constructed and made of aluminum, not too bad to move around. If you're shopping for a ladder and do not have a flatbed trailer handy...give Amazon the chance to deliver to you.",
        "Nice ladder for the price and it came right to the house no problem!",
        "Everything was excellent, professional, good timing and all that they said they would do.",
        "As usual great dealing with Amazon Good news is I love the ladder Bad news is all my neighbors want to borrow it LOL",
        "I bought this ladder to change outside floodlights which are at about a second story level. The ladder did not quite reach that far, so I purchased a 24 foot ladder. However, I have used this ladder to change the outside light in front of my house which is at a one story level. The ladder worked well for that purpose. The ladder is easy to operate and not to heavy to move around.",
        "We are very happy with our ladder. It is exactly what we wanted. I think we had to pay $20 for shipping, but there was no other way for us to get a ladder of this size to our house.",
        "We used it to change a cathedral ceiling lightbulb first. Then we used it to decorate our house and very tall trees for Christmas. It is a heavy-duty ladder that will last a lifetime. It feels secure when you are on it and collapses for storage.",
        "I suppose it's my fault for ordering the cheapest one, but after having used it, I would have ordered the next weight/strength level up. I weigh about 180, and it sometimes it feels as if it's about to buckle. Works fine in all regards, though.",
        "This is a specialty ladder. Should not be sold as an extension ladder for home use. Far to \"TOP_HEAVY\" for streight-Up applications\". Could not use without help (2 Men) in It's full exsteded mode. Maby the smallest version but not the 26' model.",
        "I purchased this ladder to do some work on the side of my house and it was very sturdy....regardless of me having fear of heights...Great sturdy ladder.",
        "You would do better to spend the money to get a sturdier ladder.",
        "This 20ft Ladder is not only light-weight, maneuverable but also: In Winter's snow Werner's improved raised Tread Ridges (on top of the rungs) give a sense of increased security. Scraping the snow off my boots on the first rung is essential from there on up when operating in the snow! The Werner ladder has a better feel for secure footing, but my more $ and weight, 24' fiberglass ladder is wider/ more stable. If I had to make a choice between the 2, - Werner - Easy to set-up. ;-)",
        "My husband died because extension ladder came down and slammed him on to the floor . My husband was only 62 years old and healthy. But he died because of a Werner ladder . Think twice before you buy or uses a Werner ladder . It could be you next .",
        "[...] Extension ladders are rated on the size of the two ladder sections total height. But you can never use them at that total height, since they won't lock together. So this 16' ladder can only be extended to a maximum of 13'. And you are not supposed to stand on the top rung of the ladder, unless you like to live dangerously. In reality I would probably give this ladder a 3 or 4 star review because I don't think you should buy a 200lb capacity ladder. To me 250lb is the minimum with 300lb preferred.",
        "Ladder is technically 13 feet long. It is extremely lightweight but strong. Although it is rated 200 lbs, like all ladders I recommend a max weight of 80%, meaning good for someone weighing 160lbs."
    ]
}