{
    "entity": "Extension Ladders",
    "text": [
        "This review is for the AE2216 16 foot extension ladder. Seven different sizes are sold in the description. The rung locks on this ladder are made entirely of plastic not metal as shown in the pictures. I ordered a 300 pound rated ladder expecting heavy duty, what I got was a ladder that will collapse if the plastic breaks. No thanks.",
        "Product arrived with broken latching mechanism. The latches (which hold the ladder up when you raise it) were made of plastic, not metal. One of them had already snapped off before item was delivered. Amazon shipping a replacement, but when you're 40ft up, it doesn't fill you with confidence in this product. ---- Update: replacement ladder arrived also with rung lock broken, returned, again... Suggest seller tapes down rung locks for shipping as it's a waste of an otherwise sturdy looking product and a bunch of time.",
        "Great ladder. Wondered how Amazon would deliver a 28ft ladder - with a contract freight truck. It is heavier than I expected (being aluminum) but much lighter than its fiberglass cousin. Well constructed. I also purchased the Louisville Levelok Ladder Leveler Kit. Only problem is that a couple of rungs are damaged (picture) but didn't notice until I drilled the holes to mount the leveler kit. They're still sturdy and usable, but would have returned for the price I paid if I'd noted it earlier.",
        "Overall satisfied w/the ladder. I am a little disappointed with the rung locks. In the description there’s no mention of whether they are made of metal or plastic & the pictures appear to be showing metal guessing it’s just a stock image rather than specific. But when I received the ladder they appear to be plastic so hoping they are durable. Other than that I’m good, I used the ladder when I cleaned out my rain gutters w/no problems.",
        "Exactly what I wanted. At age 73, I can't manhandle the 20 and 22-ft extension ladders as I used to, so the 16-ft is perfect. I would prefer the standard extension rope/pulleys, and I may retrofit them with that feature. Seems sturdy for this class ladder. Arrived a week before Amazon promised delivery.",
        "This was the lightest ladder at this length I could find. I wouldn't call it lite though. If you aren't able to hold 60 + pounds over your head I wouldn't suggest trying to stand this up on your own. Its just hard to raise it and not mark wood siding so you can't just slide it up the outside wall. If it were vinyl or brick it wouldn't matter as much. I would certainly purchase this ladder again. I read another review about the ladder having a small dent and this one did too. I am not worried about it though as this is a ladder to get work done not to look nice as a centerpiece.",
        "I am 6'3\" and 300 lbs. I've climbed on this ladder several times to check on my roof. I didn't want to go to the store knowing I wouldn't save much. For those asking about the rope.. Nope. Here's my reply..... No. Mine didn't come with a rope but the feet are rubber. I'm but going to complain since it got shipped for free. It's a very good ladder for the price if you don't want to go to the store. I have rope.",
        "Finally, I got one that was not seriously damaged. I think they changed their delivery company since many people were getting badly damaged ladders. My previous attempt showed up at my address with about a 10-15 degree bend about 1/3 of the way from one end. I could see the damage while it was still laying on the floor of the truck. Be sure to check yours well when it is delivered because returning it is SO much more trouble than refusing delivery. The ladder *is* somewhat heavy, but it is because it is a BIG ladder. It's actually is fairly light for it's size. A welcome addition to my stable.",
        "I am a bigger boy (6'2\" 225lbs) with a 2-story house so I knew I needed a sturdy ladder to feel comfortable reaching the roof of the house or going up any distance. Thankfully, this ladder does just that. It is more than tall enough and feels sturdy. Great, heavy ladder!",
        "Bought this ladder to replace a cheaper less sturdy ladder. It fills the bill. Heavier, but very sturdy. I wish the rung latches were sleeker, it's hard to stand on that rung where the latches are with both feet, the latches are somewhat too bulky for that. Adjustments to height of ladder operate smoothly. A very good and strong ladder.",
        "The ladder is not satisfactory. I requested a return and was given a pick up appointment for 6/17. Supposed to be picked up between 2 and 6 pm. 8 pm and still waiting. Pilot (the logistics company) has disconnected me twice when I called to determine status. On line, all i see is that a driver has been dispatched. Called a fourth time and am on hold. Worst experience, ever!",
        "i had a cheap 16 ft ladder but at 66 i did not feel safe on it. this ladder is heavier and harder to move but provides a much more stable platform. seems well made and sturdy.",
        "I ordered my 40’ ladder for a specific job with my contractor. That was the 28th of august with a guaranteed delivery of the 27th. Today is the 8th of September and I just received it today. No fault of the delivery company. I don’t know who in the heck is at fault, but it cost me another bill to rent one for the job.",
        "first one made it from Texas to 90 mi. from my home it was damaged and returned by the trucking co.the 2nd arrived ok. very sturdy a little bit on the heavy side compared to my old ladder but managable I am happy with the purchace",
        "After the delivery truck left and I filled out product survey form with A-OK, I noticed the ladder Arrived slightly Dented. Not a problem enough to send back but they should know. Also, this is pretty heavy for one old guy like me to handle alone.",
        "Great ladder. I ended up using it quite a bit this weekend and it worked great. It felt solid on the driveway using the feet and equally well in the loose dirt using the spikes. Equipped with pulley. Construction looks well made and durable.",
        "Wasn't heavy. I'm a 110lb male but I can move, lift, operate and handle it by myself. (of course with someone else helping is easier).",
        "Nice ladder. Only thing is the plastic safety holders. Your life in on the line. they should be metal. I do like it and it seems well made. This new road side delivery though is a sham. bring it in my garage!",
        "I bought this as a present for my husband & he was thrilled! It's heavy-duty, but lightweight, holds up to 300 lbs which is plenty for a good sized man to also carry something else up with him. It's just perfect for him & I'm so glad I found it at a great price on Amaz as I always do!!",
        "ARRIVED IN THE TIME FRAME ADVERTISED. THE PRODUCT WAS UNDAMAGED. I WOULD VENTURE TO SAY IT HAS BEEN STURDY THUS FAR. IT HELD MY 300#s W/O DIFFICULTY ON EACH USE. IT SEEMS TO FIT THE BILL. LOUISVILLE HAS ALWAYS PUT OUT PRETTY RELIABLE PRODUCTS.",
        "Giving it a three due to the fact that the load bearing rung lockers that you depend upon for your safety are made out of plastic.",
        "solid quality ladder. Added the Louisville yellow ladder covers on the top.",
        "I'm terrified of heights, so I really needed a solid ladder that gave me the feeling that it wasn't going to move when I climbed up it. both the rubber feet, and the pointed anchors on the feet work perfectly for creating a solid foundation.",
        "So happy we purchased this ladder. It has been a great help with painting and roof repairs.",
        "Ladder extension locks are plastic (the lockers that keep the extended portion of the ladder from falling). I am afraid they will deteriorate over time and become in safe. I would not recommend this product for long term use. This is for the 40’ ladder. I could not find in any of the descriptions this info. The picture shows it being metal when in reality it’s plastic.",
        "Heavier than I thought. 2 people to handle it really.",
        "This ladder is very sturdy, that being said, it is far too heavy and unwieldy. It would take a very strong person to maneuver it into place. I nearly broke my hand pulling the rope to raise and lower it. The mechanism is not very fluid or user friendly. It does not release the way it is supposed to.",
        "It was as tall as it said it would be. It also held my fat ass up.",
        "My husband owns his own professional painting company and loves this ladder. He says it is very sturdy and he feels safe climbing it.",
        "This ladder has plastic not metal hooks for raising. Seems a bit flimsy.",
        "have stoke. can't write at much, can't review. please don't asking",
        "Exceptionally sturdy and well built. As others have mentioned, the only thing I can scrutinize would be the latches, which are molded plastic vs. aluminum.",
        "Pros: strong ladder that helps to get the job done. Cons: it is heavy, which is expected. You will need an appropriate sized space to store it.",
        "This is a good stable ladder. I have a 2 story house with a gable end roof. The pitch is not steep probably 4x12 but I am not sure with a span of about 35 feet so approx 17.5 feet from wall to highest point of roof. This ladder does the trick with some room to spare. I can climb up under the eves and paint and do pest treatments with no problem. I weigh about 205lbs and feel very comfortable on this ladder.",
        "Really nice ladder but damaged beyond use, Amazon was great about replacing but the delivery company did not take damaged ladder when dropping off the new one so now I have that headache. product was definitely 5 stars",
        "Very sturdy, solid and best of all i feel the safest on this ladder, would never get a werner again. Louiville is the way to go.",
        "Ladder looks great and is very good quality. I would highly recommend this ladder to anyone.",
        "Came on time very nice ladder constructed very well. Had it shipped right to the house. Very happy with it thank you.",
        "If you want a ladder of comparable quality to this one with the same duty rating, and you go to the home improvement store, be prepared to spend about $400 more. Just get this one. Packed and shipped very promptly, and is much heavier duty than I expected. I used it to paint my house, and even standing near the top (about 25' up), it felt solid as a rock. Highly recommended.",
        "Nice ladder but rubber feet were torn off from rivets during shipment.",
        "I was looking for an extension ladder to replace lights on top of a roof. This ladder fit the bill and was delivered on time as promised.",
        "Works great for what we need and is really sturdy!",
        "This is a very nice ladder and I'm glad we got a nice quality one. very sturdy.",
        "Ladder was bent on shoe end and broke while trying to bend back....perhaps iit happened in shipping, but it broke as I tried to bend it back. Still works okay, but disappointing for a $350 ladder.",
        "Careful here... ladder does not have pulley system to extend ladder to it's fullest",
        "The ladder arrived and it looked like I purchased a second hand ladder. Many scratches as if someone put it through a grinder and the rubber tread is detached from the footing of the ladder.",
        "Very high quality ladder. A bit heavier than I would have liked but very stable. I like the technology of the feet. It does give additional stability that the Werners don't provide.",
        "Solid, strong and I can now reach any part of my two-story house and roof. The pigeons don't like me up there, but that was kinda the point. Excellent quality for the price.",
        "We needed a ladder to clean the rear windows of our home, which is 3 stories high. The ladder was light enough for my husband to manage on his own, and sturdy enough to feel secure while standing 30 feet in the year.",
        "Good price, lightweight, easy to handle and far beats my old fiberglass ladder! Arrived quickly and was such a relief over my old heavy ladder.",
        "The ladder works great for getting at those high spaces. It is a little heavy, so it is a good idea to have an optional helper (wife) help you with setting it up. It does what I need it to do.",
        "My husband is a professional window cleaner and is very impressed with this ladder.",
        "Easy to use and extends smoothly. Carries my 130 lbs easily, feels solid enough. It arrived with one foot a little bent, but it still works. Cheaper than brick and mortar stores.",
        "This ladder did everything I needed if I need it to another one I would buy another are tell somebody about this ladder",
        "Husband loves it - feels very safe - excellent delivery!",
        "Me husband uses it to pressure wash the house and to clean the gutters. He likes it very much.",
        "Good product but for the price I would have liked my product to not have 2 dented steps.",
        "Ladder came just as described. Very happy with this purchase.",
        "Well built -- If you need a ladder, don't hesitate to purchase this one. If may be a little pricey but, remember, you get what you pay for. :-)",
        "very satisfied with AE2228 extension ladder,I use the ladder to go to my roof. 25 feet height I feel very secure.",
        "Lightweight, easy to use ladder at a fair price and it was delivered right to my front door!",
        "Needed a shorter extension ladder that would be long enough for most single level uses but wanted a extra strong ladder for the security it offers. The price is somewhat more than the usual big box light duty ladders but the extra strength and security it offers is well worth it in my opinion. This model offers very strong rung locks and heavy duty feet. The only issue I have is they leave some sharp edges and burrs on the cuts they make in the manufacture process, but a few strokes with a file takes care of that. Overall, I would rate this ladder very good and worth the extra cost.",
        "most folks look for a cheap ladder. Great way to kill yourself or get injured. This is a well build - commercial grade - ladder and the delivery was free (PRIME) and of course on time.",
        "A true bargain. Always thought \"fiberglass!\" Look at the weight! Very comparable. I am a BIG Old guy and this ladder works for me. Surprising price and delivery--I do love Amazing Amazon. You will like this ladder And you will feel safe.",
        "Beefy and lite. Just we we need for our window cleaning business.",
        "sturdy ladder and not too heavy for me. can clean my own gutters at last. item arrived undamaged.",
        "Absolutely awesome ladder and what was even better it literally was delivered the next day which was a pleasant surprise. Amazing",
        "Nice ladder, nice price. It was cheaper and higher rated than anything I could have gotten at the big box store.",
        "My husband used this ladder several times, already, since receiving it and he is very pleased with its quality construction and performance. He would happily recommend it to anyone.",
        "ladder as advertised. came with additional safety clip, which was good, i hadn't seen before.",
        "Great quality, but a little heavy- not easy to raise up and down on your own!",
        "If you live alone or will use this ladder by yourself, don't get it. Way too heavy for one man.",
        "..if you use this ladder, about ten. The thing's as heavy as sin. Unless you're looking for something you can use to save your upstairs anvil collection during a house fire, I'd advise buying something lighter."
    ]
}