{
    "entity": "Mortisers",
    "text": [
        "I just finished 24 mortises in white oak (3/8-inch wide). Even with odd shaped wood, this unit has plenty of power. I opted for the Powermatic bits. When I went to put the bits in the included tool holder, the holes in the holder are too small for the premium bits. Setup was a bit fussy, but once the mortise is defined, cutting is a breeze. At first, I was concerned about the wheels that hold the workpiece to the fence but they worked fine. The hold down is bothersome. Powermatic has room for improvement on this feature.",
        "I just got this in and used it all day. You can immediately tell that thought and craftsmanship went into the design of this. There's not one thing I don't like about it, very smooth operation. It was aligned and ready to roll out of the box. I flew through dozens of mortises, something that would have taken me three times as long with a router and chisel setup. I love it and glad I spent the extra dough and won't have to worry about fiddling around with a lesser quality machine. If it's out of your price range you should save up a little more and buy this thing, bad to the bone.",
        "I bought this product for a lot of furniture build such as tables, faceplates etc. Ive always chopped my motises with hand tools but with as many as ive got to do it was time for this machine. It took me 10mins or so to chop a motise. (Depending on size of course). This machine has cut it down to within a minute to two minutes. Very happy with the machine.",
        "I had this tool for about 4 months, using it on numerous test cuts and one final project. It seems to be doing pretty good. The accuracy is respectable but there is a learning curve in the method of use. Like all quality tools, practice is the insurance of desired outcome. There are not any glaring negative aspects of the apparatus as of this date; I do recommend that the purchase of good quality bits to bring out the best in this devise.",
        "Very well made. Surpassed my expectations. It is very heavy and should be placed in a dedicated area or on a moveable cart. Have not used it yet but have reviewed a number of web sites and Youtube videos comparing various other mortise machine with the Powermatic. The quality is as described by these sources.",
        "Good product, but I'd definitely suggest getting the Powermatic bits. (Of course, they're way too expensive, but compared to the Delta bits, for example, they're way superior.)",
        "Used to have a Delta mortiser and it was not as heavy as this one and definitely was not as easy to set up. Much higher quality also. I believe this unit will give me years of use.",
        "This is the second mortising machine I've owned. The powermatic has got enough extra features to justify the the price. The fence/hold down system is unmatched. You buy a mortising machine to make neat square holes in a line adding up to a mortise. If you are constantly jacking around with the fence/hold down system you will end up with square holes that are staggered and uneven. Now you have a piece of wood for your fire pit:( You decide what you want to make - firewood or furniture:))",
        "You can't beat this Mortiser. It really performs beautifully. Just remember to order the chisel bits, as it comes naked. (The 4-bit set from Powermatic normally sold by Amazon is currently Unavailable.) I recommend the longer bits, rather than the short-shafted bits, even though Mortiser comes with an extension for the shorter bits. Thanks.",
        "Not much else I can say other than it works great and will last a lifetime. Sturdy build, quality construction, easy setup. Powermatic has hit a home run with this little beast.",
        "Within one day of receiving delivery and after having made several 1/2\" wide, 1 1/2\" deep mortises in a 2x4 piece of redwood, the hub holding the operating handle cracked causing a portion of the hub and the handle to fall off. The hub failure occurred while plunging about 1/2\"deep into the redwood board. Prior the socket breaking, the machine function well and easily and accurately made several mortises. Unfortunately, without a way to attach the handle the machine is unusable.",
        "This machine though expensive is a great piece of equipment. Very sturdy with enough power",
        "Worked beautiful right of the box. Easy set up of chisels and depth settings and hold down works great. Love the cast steel very stable. No negative comments.",
        "This tool drills first-rate square holes, does it competently, precisely, without fuss, and makes it look easy, which it is. I've only had it a couple of weeks, and I don't expect to be using it a lot, but I can tell already that it will be one of those tools that will be invaluable whenever there is a need for it. The only catch is that it can't drill square holes in dense hardwood. I'm sure no bench mortiser can do that. Tom Hall",
        "Making tables, stools and chairs I found this to be the perfect size. Very clean and accurate mortises. Adjustments are easy once you get used to them. Highly recommend",
        "WOW!! This tool has been on my shopping list for a couple of years. I should have bought it long ago. I've made a few test cuts with it and will soon be on my way to making cabinet doors for my kitchen. It is more AWESOME than the description for the product. I did a fair amount of research online and compared it with other dedicated mortisers. Although it may cost a little more than most, it is well worth the investment. It's very well constructed, HEAVY (almost 100 lbs!) and appears to be a very durable unit. I am definitely looking forward to using it, trouble free for a long time.",
        "After 20 years of using, and cursing at, a drill press attachment mortiser, and avoiding mortises wherever possible, I spent the big bucks for this baby after reading positive reviews for it, and negative reviews for the Delta mortiser. I just cut 54 mortises in oak without a problem. This is a well designed, simple to use, powerful tool that does the job.",
        "Meaty and beefy....well built with many features to insure long term consistent mortises!",
        "It is a good tool. 1/2 inch mortises in walnut go very well, while the first cut takes a little work each subsequent cut is very smooth. The fence is well done.. It was basically fully assembled which was nice.",
        "Fantastic machine,packaged well, assembly was very quick and easy and instructions are precise and easy to understand. The table is perfectly flat and the fence is perfectly square to the table. No tools required to make adjustments such as setting the depth stop, positioning hold downs or moving fence in and out. One word of caution, when loosening the gib screws which are tightened for shipping purposes the gib plate will slide out completely its a bit difficult getting it back in.",
        "so far only limited use so I am still learning . The machine is easy to use arrived in perfect condition was not a problem to clean up ( used Goof Off )",
        "This mortiser is used to make mortises in items like table aprons where the mortise in the table leg is connected with the tenon in the apron.",
        "Fence is solid and easy to use, has plenty of power.",
        "I had previously owned a Delta & sold it to buy a festool domino. Needing to make a bunch of mortises in white oak. I bit the bullet & bought the Powermatic. It's expensive, but so far worth it. Better/beefier build than Delta, using CMT chisels it cuts clean and doesn't bog down. It's probably overkill, but it's sweet. Not too much initial clean up prior to using, some of the casting may be considered a bit rough on the edges. Overall no complaints.",
        "I've used this mortiser for three projects and found that the design and construction are very good. Most components are good quality and the base is large and stable. The fence and chisel mechanism are aligned so that the mortises are square.",
        "This Powermatic machine is top notch. It's the most, or one of the most, expensive mortise machine on the market, but worth the money.",
        "Easy setup, lots of power, heavily built, head and shoulders above the competition.",
        "I bought one at a local hardware store that I took back because it did not work like it was supposed to, this tool is great, it works like it is supposed to, easy to use and accurate",
        "There is at least one thing I would change. The hold-down fork does not release - it seems to bind on the staff, so I am constantly having to pry it up with a screwdriver.",
        "Works as expected. A little loose but way better than my old Delta",
        "I replace an old Mortise machine that I have had for 15 years. This one is much better designed, easy to adjust and stays put. An excellent machine!",
        "More powerful than other brand mortisers. Easily drill square holes!",
        "Excellent tool. I cut eight 1/2\" x 4\" through mortises in 2 1/4\" oak in about 75 minutes (three passes). No longer will I thing twice about doing mortise and tenon joinery - or looking for alternate options instead. Great tool for a non-professional shop.",
        "Perfect for what i need it...simple, light, easy and convenience. i must unit to used for your doors or square drillings",
        "Great Powermatic tool. I am pleased with the results I get from this machine.",
        "The handle broke on the first use! The attachment piece is cast (and not machined) so I am not very surprised that it broke. Aside from this, the machine is pretty nice but due to this damage, I would not recommend buying this.",
        "works wonderful, plenty of horsepower, easy to use, love this machine. can't do without it now.",
        "Right out of the box there was very little setup and it performed as expected. Great Product.",
        "Hands down best mortiser, only one better is the powermatic that comes on the stand",
        "I got this tool on sale and free shipping. Delivery was on time and the assembly was a breeze. This is a terrific tool and I would recommend it to anyone.",
        "Well made piece of equipment. Purchase a set of quality mortising bits and you will have no regrets.",
        "I have used the morticer for the table legs that will hold the streachers for the coffee tables I am making for my wife. works with ease and procision.",
        "powermatic 3/4 horsepower bench mortiser works fine. I find it to spin free too long after the after power is turned off'.",
        "This is a very sturdy and well-designed machine. A slight adjustment is needed during the setup for mortising to ensure that the work table is square to the chisel, but other than that, this machine is everything it is advertised to be.",
        "Easy to deal with and the product works way better than the shop fox I replaced",
        "I am a fairly new woodworker and needed this to make some mortises. Upon delivery the plastic button was popped out and would not go back into its socket do to the location of the wires. I eventually got it half in... Also, I could not get the handle to sit anywhere but awkward. Probably could be adjusted in some way, but I could not figure it out. Besides the button, build quality is good. Also, probably from me not reading the description thoroughly, but this does not come with any bits like shown in the picture as I had thought. All in all, for the money I feel I could have gotten a better product.",
        "The product arrived with a cracked base. The package looked fine so it was probably damaged at birth. I may reorder once the refund goes through as it seemed like a well made tool otherwise.",
        "This bench mortiser is again a Powermatic success. Top quality, ease of use . Only question is how due you keep the Aluminium Squib from falling out???????",
        "It is hard to set up. It does not drill clear tenons. You still have to chisel them out. The metal of the handle broke after only a few uses so I need a pipe wrench to use it. Finally I put it into a corner and went back to a forschner bit and chisel which is quicker and makes much better tenons. I hate looking at it and feel stupid for spending $400 for a pain in the neck paper weight, dust collector."
    ]
}