{
    "entity": "Caulking Guns",
    "text": [
        "No dislikes whatsoever!! Husband has truly enjoyed this caulk gun. I know that all the old caulk guns I have used in the past always had too much wasted caulk oozing out after you have finished squeezing the gun. This one, NOT AT ALL!! A little is natural bc of the pressure on the tube of caulk. But this one my husband has raved about, even on his FB page.",
        "This caulk gun doesn’t even work! It squeezes the caulk out the end and not the tip. I have attached photos of the caulk running all over the gun. I would not recommend this gun at all and have returned it. I don’t know how this item has so many good reviews! They’re not true. It sucks!",
        "I'm an old guy and I have owned dozens of caulk guns. This was, by far, the worst. The problem is that the push bar has no ratchets. If you are caulking a small bead, it requires more pressure to push the caulk out. You squeeze the trigger to advance the push bar and it just slides down the bar, pushing nothing. A high school kid could design better. I was not trying to caulk with something exotic. I was using DAP silicone caulk which I have used forever.",
        "I bought this to use with E6800 glue cartridge. It was supposed to be drip free, but this is certainly not the case. I dispense what I need and it just keeps dripping and dripping, wasting more of the glue than I use! I have to set my project down and manually pull the plunger lever back. Such a PITA.",
        "I purchased this about 15 months ago, and lightly used it for about 4 months, till the project was finished. It went in a tool cabinet till a month ago. When I brought it out, it still looked almost new, but it no longer works. It will compress the cartridge, but the minute you release the handle, the plunger slides back out. So, now it's scrap metal.",
        "I do all of the painting and caulking in the house... and with arthritic hands, it's nothing I look forward to anymore. We recently had the house resided and I had the opportunity of trying out the caulk gun that the workers were using. It felt great! Planned on buying one (Sherwin Williams). But then, COVID arrived and I had to switch gears. I did research on Amazon and this gun sounded like it would work. I'm here to tell you that THIS IS THE ONE! It's like buttah. Comfortable in your hand. Silky smooth squeeze and delivery. Doesn't drip. I can even use it in my non-dominant hand. I recommend this gun HANDS DOWN! ZERO negative feedback.",
        "First you need to understand all of these guns are made to dispense various products with various viscosity ratings. This is rated for the majority of products, but some adhesives, particularly extremely viscous construction adhesives, need more pressure that this products mechanism might not push out. Also those products tend to use larger tubes than can be put in this unit. I have used this to dispense acrylic latex caulk, room temperature vulcanizing silicone caulk and marine adhesive. I have had no problems, other than issues caused by leaks in the plunger end of a silicone tube.",
        "This caulk gun is definitely not one of those cheap dollar store caulk guns. Yea I agree the price is a little hefty and I as a DYI type person didn't want to spend that much money on a caulk gun, but after dang near straining my hand with one of those cheap guns, I had to try it. Wow, the leverage with this gun makes it so much easier to use, you will just trash your cheap gun.",
        "Wow, I usually get the cheap $5-7 caulking guns then discard them when they get too caked in crud in a few years, but decided to try moving up a notch and wow it's soooo much better. Much better caulk flow control, when you stop it stops very fast, not any or only a tiny bit of flow after without dripping. Took a little getting used to as I found I was expecting the continued flow some after I let off the trigger. Well worth it, highly recommend! Now if I can just remember to wipe it off when done each time so it won't get covered in crud over time. :-)",
        "So much better then the cheap gun from the big box store. It stops right to flow caulk when you stop pressing the trigger. Easy to use and doesn't need a lot of force. Nice ergonomic handle. The only thing which needs improving: It's difficult to reset the rod and get it moved back to eject the cartridge.",
        "This is the first time I have used a caulk gun. The trigger facilitates applying the caulk easily, the built-in nail like puncture device is a plus as well as the spout cutter. After using two tubes, I found the cutting a correct angle provides a big positive or negative factor when applying the caulk. I was using this for a storage area with non-removable shelving and the only drawback is that it cannot be used in a small cramped area so I had to find a hand squeezable chalk tube to apply chalk in that area.",
        "I keep this caulk gun among my favorite tools that \"just work\". I was skeptical about the drip-free feature but it really does work. It is annoying on the older caulk guns to have to release the pressure so the caulk doesn't keep coming out (or forgetting to release it with a mess to clean up). This gun doesn't have that issue, and it's just automatic. It's also very heavy duty and has provided me with years of reliable use. I would highly recommend it.",
        "All the claims are true -- this is really easy to use, the tip trimmer works great and the puncture tool punctures. Great, comfortable grip. Has a nice, even squeeze and the center post pulls back at any point with no jamming. As far as \"dripless,\" YMMV -- it's as dripless as your respective tube of caulk is inclined to be dripless -- but when you stop the squeeze, the pressure stops. Cleans up easily and adapts well to imaginary ray gun shooting and making the \"pew pew pew\" sound.",
        "I dread using a calk gun and I think its because previously I had a budget one from Lowes. It works but was hard to use and not smooth or consistent. I was resealing an aquarium and the online video made mention that the trick to a good bead using a quality caulk gun like this and a little practice. After using this I still don't like caulking but its not the application using the gun that I dread the most anymore. Now its just getting stuff on my fingers and the cleanup especially when using 100% silicone!",
        "I purchased my first home and was doing a ton of research. People say to buy a good chaulk gun and now I found out why. Doing renovations throughout my house, I had used my brothers cheap HD chaulk gun and I had so many problems doing the baseboards. It kept dripping after I finished, and I couldn't get the control I wanted with the trigger. This does not drip at all after you release and I have so much more control.",
        "I've spent money on the most expensive caulk guns you can buy only to ALWAYS be disappointed especially with the \"drip free\" models which aren't. I saw all the 5 star reviews on this super cheap model. They are RIGHT!! Does not drip. I've been looking for this gun all my life. You will love it!!",
        "I love it. Rare to own a product that actually works the way it should. I never knew it was possible to stop the caulking from pouring out the end of the caulking gun after you've used it but I'll be darn if this thing doesn't do that. Hats off to Newborn.",
        "So I have only used this twice and my only warning is be careful pulling the trigger hah. This one being a 1/10 means it can pump a bit more so needs much less pressure to get caulk etc. out or will put out too much if not careful. I knew this buying it but it and was concerned but it was the best construction/value for what I wanted.",
        "Maybe it's just the one I received but if I squeeze then release the handle normally it doesn't take a full bite the next time and I don't get a full pull on the next squeeze. I have to release quickly so the handle snaps forward. Once I figured out the trick it works fine but it's irritating. I use this a lot, a number of times a week. Everything else about it is great.",
        "Worked great! Quick and easy to use, the included tip cutter and seal piercer are much appreciated! I did have a little bit of dribble; not completely drip free as others have claimed; but I was using Black Silicone I by GE, which is a little hard to find, and pretty far from the common usage, so that may have been why. I would definitely recommend this to anyone with the need for some caulking :). It works great and is convenient and comfortable to use. This was my first time caulking so I can't compare this to other caulking guns, but the load/reload mechanism is very easy and straightforward to use.",
        "Prior to this purchase, I was using a caulk gun I bought from a local hardware store. When I let go of the handle, caulk would continue to ooze out of the nozzle, which was frustrating. So I ordered the Newborn 930-GTD Drip-Free Caulk Gun after reading several reviews, and I have to say, I love this caulk gun!! I have so much more control with caulking now. It makes caulking fun.",
        "I have never used a caulking gun before but needed to re-silicone my shower pan. I have arthritis in my hands so wanted a comfortable yet easy to use gun. After doing some research, I found this one and very happy to report that my first time was a success! Now I feel confident that with this particular item, I’m ready to reseal my bathroom and kitchen sinks and countertops!",
        "I laughed when I read these 5 start reviews and people raving about a caulk gun but i decided to spend the extra buck or two to try this and HOLY MACKEREL THIS THING IS AMAZING. Opening the packaging it came in was harder than using this gun. Yes it made caulking enjoyable and I'm looking forward to my next time using it.",
        "Okay, so the product doesn't continue to squirt out when you release the handle, but it will slowly ooze our a bit. I wouldn't say this is a night and day difference over the cheap hardware store guns. Better quality, definitely. This feels as if it will last forever. Worth $11, certainly! I'd pay $19.99 and still feel I got a good deal on a quality caulk gun that will last.",
        "Built a new room and wanted to caulk all the seams before we had the insulation blown in. After two cases of caulk, I love this caulk gun. It works perfectly, very comfortable grip and with a light snap of the trigger it stops the pressure on the tube so it doesnt continue to push out No mess, no sore hands and just an all around great product",
        "Item was nice and drip free. But the big problem is no lock down the rod, easily drop down and the tube got loose. No any kind of instruction at all. I bought it because of all the good review. but after i found the problem, went back to search in review again and found many have the same problem and really no good answer for it. Would be nice if there are some kind of instruction for a rookie like me.",
        "Wow! I've been using cheap $2 caulk guns from my local hardware store but decided it was time to upgrade. It was like switching from a Ford Pinto to a Mercedes AMG. Just look the images for comparison.",
        "I had always bought the cheapest Caulk Gun. I spent a tiny bit more, but it was so much easier to use. Definitely worth the extra cost to get so much extra quality. Would recommend highly.",
        "Nice, Easy to use Caulk Gun. Not 100% Drip free as others have stated, but if you wipe of the 1/8 of an inch of caulk, before setting the gun down between continuous uses, I didn't notice any more dripping out. Much better than the other caulk guns I have used that don't back off after trigger release. I would recommend this product.",
        "It works great. Once you figure out how to use it it's easy. I like that it has the tip cutter and that was one of the reasons I chose this caulk gun. You have to pull back the rod and then you can use the tip cutter. I used some construction caulk to fix old wall holes and trim. Nothing dripped but this caulk was very thick so may not be the best example. I did not use the pin which is included because that is for used caulk tubes but it's nice it is included. So pretty happy with it's performance so far although just used it once.",
        "Recently purchased our first home in Phoenix and found scorpions in our living room! Being from NorCal, I had no idea how to handle this. So I did some research and found out I should caulk every crack or space a scorpion can enter. Did that and probably used like 7 tubes of Caulk with this gun. Not sure how to entirely rate these things but it worked amazing well and we no longer have seen another scorpion in our living room!",
        "I've used the same old-school caulk gun for years - and every time you let off the trigger, caulk still keeps coming out. Always has driven me crazy because it was a mess and very wasteful. Despite being a fairly experienced DIY'er, I somehow (stupidly) did not know that better caulk guns existed. Bought this based on reviews but was skeptical given the relatively low price compared to others with similar features. Used it this weekend and I LOVE IT. Easy to load, easy to use, and NO DRIPS!",
        "I wanted to try a new caulking gun during my kitchen remodel. The Newborn 930-GTD Drip-Free was certainly not drip free and like most guns doesn't have a small thumb release you have to pull the rod back. It's a good gun but nothing special in fact I switched back to my old gun that I was more used to and was able to lay down a much more consistent bead.",
        "For an item that's not intuitive to use /load with caulk I expected to find an instruction manual but none was included with the item.",
        "Paid extra money for a \"no drip\" caulking gun. Yet here we are. Dripping away.",
        "Worked great but be sure to realize than you need to retract the arm all the way back to remove a partially or fully used cartridge. I used it for a clear silicon sealer for skylights (worked great) and for a DAP stucco patch...which was FAR easier than trying to apply which a trowel. Fills much easier, then smoot over, same for cracks.",
        "Consistent pressure delivers a smoother bead with less clean-up. Smooth application and arthritis friendly. I like how you dont have to hurry to put a nail in the end of the tube after you lay a bead. It doesnt drip. I dont like how you cant hang it on your ladder while not using. It will pull the rod all.the way back as if you are changing the tube.",
        "I love this product. And to be honest with you, I've never heard of a dripless caulking gun until I saw it on you tube. I was like really!! So I ordered one. Wow!!! What a difference. I love this because when I'm caulking I can stop anytime I run my bead. And it stops coming out too. Unlike the old caulk guns when you stop it keeps coming out unless you release the loader that pushes the caulk out. You not only have a mess but your wasting money. But with this dripless caulk gun, to me it's the next thing to slice bread. You won't know until you get one. Thanks Kevin This",
        "I'm not sure why I didn't use a dripless caulk gun all these years. I just assumed it wouldn't make any difference. However, this gun is so superior to anything that I have used before, its startling. In the past, it was a race to see how fast I could pull back the rod and to try to stem the inevitable overflow before it made a mess. With this gun, you finish a line and shazam, everything is so tidy. No overflow, no leaks. It's well constructed and operates very smoothly. And the price is right.",
        "Disappointed. The tube is not locked in place causing a lot of effort in trying to dispense caulk. But once it comes out it very much drips. Hard to control flow. I used my sister-n-laws gun which is the same model and loved the ease of use. So bought it. My own experience with my very own caulking gun was awful. If I still had time to return I wouldn't definitely return. The quality is not consistent.",
        "After only a couple of hours of use the ratcheting mechanism to push new caulk out of the cartridge has failed completely, it just slides on the ramming bar and does not move it. Even without a cartridge in the gun by putting my fingers against the plunger with slight pressure, pulling the trigger will not move the ram.",
        "Honestly, for the few dollars, this was as an 'add on' item the expectations were fairly low. I was very happy when I received the item, and it worked fantastic for my project. I was using it to seal up a drain in my basement and it worked great without getting stuck or causing any issues along the way. The handle was comfortable to use and not at all difficult to force the caulking out.",
        "I've had a couple of caulking guns. The ones that had a manual stopper and ones that claimed to have an auto stop. This caulking gun is the real deal. It stops as soon as you let go of the trigger. No more drips or wasting. Also the trigger is not hard and the grip is ergonomically comfortable. A little squeeze gives enough caulk for that perfect bead! Great buy imho!",
        "Having problems getting this to ratchet the hex rod forward to dispense caulk. Anyone know of an owners manual for this thing? I'm used to the caulk guns with notches in the rod, but thought I'd give this a try since it said it relieves pressure so caulk doesn't keep dispensing.",
        "If you've ever used a caulking gun for more than 30 minutes you know that there are good ones, and terrible ones. The big orange box carries two terrible options. This one is worth the extra couple bucks.",
        "This is the best DAMN caulking gun I have ever used....and there has been a lot. The design is superb, when you release the trigger, pressure is automatically also released....so, no oozing, glopping or mess....complete control with one hand. Excellent design...Excellent build quality. Think its too pricey.....worth every penny. There is plenty of bad tools.....this one is spectacular....buy it.",
        "Honestly...... you don't understand how nice this thing is unless you have used many before. I did not know this type was possible, yet the \"no leak\" feature appears simple but I have never had the luzury of using one with that as a feature. Go throw away whatever junk youve been using and buy this now!",
        "This product has saved me so much time and money. Other products always end up with dripping caulk. The time I used to spend cleaning up sticky, smelly caulk is no more. I have saved soooooo money on tissue/paper towels and man hours from this gun. When caulk drips or it over dispenses, I have to use time and paper towels to clean up the mess. I think this gun is worth the extra initial cost because it saves money in the long run. Would recommend.",
        "This caulk gun is worth the money over the cheap ones all day long! I used a cheap caulk gun for about an hour one day and my hands, wrists, and arms hurt really bad. I got this a few days later and it was a breeze! It’s not that much more than a basic caulk gun, but it paid for itself in the first 3 minutes! Highly recommended",
        "I have used those $3 cheap caulk guns from Walmart in the past and they are thin, break easy, get stuck etc. This is a very nice caulk gun for the money. You can run a smooth even bead of caulk effortlessly. It keeps steady even pressure. It has a tube puncture tool and tip cutter on the side. I just use a razor knife though. It is heavy duty. I really like it. Satisfied customer.",
        "Came with no instructions. Had no idea how to pull back plunger. Finally came on here and found the answer, and realized that the problem was it is REALLY hard to pull back the plunger.",
        "Bought this based on the great reviews. Impossible to pull the handle back. You need the strength of the \"Hulk.\" I've used many caulk guns including the cheap ones and they were easier to use. DISAPPOINTED!!!!!",
        "Any DIYers that have suffered through standard caulk guns that are inconsistent, jam up, and spew extra material every where will be THRILLED the first time they use this. As soon as you let go of the trigger, the caulk stops pouring out. A novel concept for many caulk guns out there. Due to the improved control (squeeze as much or as little in as fast or slow as you want), I caulked the trim and doorways (x5) of my upstairs hallway in all of 20 minutes, with only minor overages to wipe (the first part of the run, my fault). I immediately threw my other caulk guns away.",
        "Compared to the typical big box store caulking gun, this thing is a life saver. Much better control and much less wasted caulk. It would be nice to have a hold button or something that allows doing a continuous bead longer than three or four feet. The trigger bottoms out during the laydown of caulk on long runs. When one releases to allow another trigger load, the bead is interrupted and then restarted, which disturbs the nice and neat delivery of caulk. Try some runs on base mouldings, you'll see what I mean.",
        "Im new to doing my own caulking, after going through two different cheap brick and mortar store caulking guns that were garbage i absolutely dread caulking, i just figured it was a pain no matter what you use. After buying this thing holy cow, this thing is effortless.",
        "Had this for 3 years now and can say it's only mildly better than the low cost guns at the BB stores, the 10:1 thrust ratio is only slightly better than cheap guns, it often has problems with leaking out the back side, and the handle covers continually falls off while caulking.",
        "I only needed this when I purchased a tube of sealent for my headlights on my vehicle. I didn't want to spend a lot of money. 100% for the price that you pay this is pretty darn good. I would almost go as far as saying it compares to the 30 to $40 ones I found at brick and mortar stores.",
        "Best one yet. We have gone through a lot of guns that just couldn't handle the work load. This gun has a lot of great features and won't break the bank. Its puncture needle is a little longer than most brands allowing you to puncture the foil without cutting a lot off the applicator tube. The grip is a great feature and surprisingly helps keep the fingers a little warmer on cold days. The handle is strong & steady and hasn't shown signs of collapsing when using thicker products. Highly recommend.",
        "I never had one as nice as this. It works perfectly, and plus it has the tip to open a used tube with. I always had to track down something small enough. The spring loaded pressure release works as intended also. I did however notice a very very slight amount still coming out of the tube after releasing pressure. It is not the tools fault however, it works as described. I would recommend.",
        "I originally owned a \"standard grade\" caulking gun I picked up at the local hardware store. Though it worked well enough, a recent DIY job requiring a great deal of construction adhesive resulted in two blisters on my fingers and a very sore hand. As I needed something that at least had a rubber grip, I opted to give this model a try. I was blown away by how well it works, as it requires far less force than my prior model, doesn't drip, and is very easy on one's hand. For the price, it really cannot be beat, and I highly recommend it to anyone who frequently needs a caulking gun.",
        "This gun pushed the bottom of the caulk bottle through the to the top getting caulk everywhere, ruining my countertops and wasting two bottles of caulk. Very upsetting. I have never had an issue like this with my other caulk guns and my counter are now ruined!",
        "My entire life I watched my father apply caulk by squeezing the tube. When I bought my first home and went to do the same, I was shocked at how ridiculous the process seemed. Came to Amazon and found this product and boy am I glad that I did. This works exactly like it’s supposed to, and is surprising comfortable to hold. I’m buying a second one for my father.",
        "This caulking gun has a tip cutter that is smooth as butter. The grip is padded and is super easy on the hands. It has a hex rod cradle that makes the distribution of the caulking even. This is a very nice caulking gun, especially for the great price.",
        "Using this caulking gun was a dream compared to the one I purchased from a big box store. The gun allows for easy control of flow and stops it immediately when you release the trigger. I look forward to finishing all the trim in my house now that I have this great tool.",
        "Made in China means it contains 14 times more the allowed carbons that cause cancer and lead poison. You can't Sue China so Sue Amazon.",
        "Hands down the best caulking gun I have used yet. I let my painter friend try mine and he liked it so much that I had to let him keep it and order another for myself. Good squeeze ratio and no mess. Easy to turn the tube to get at hard to reach spots without having to release the pressure first. Sturdy and well made, it looks good too but to me that's secondary.",
        "It won't ooze out when you stop squeezing the trigger. I love it. My old one, when I stop pulling the trigger, the caulk still oozes out and made a mess unless I press the pressure release trigger to ease it off. This one will not keep oozing out the caulk as soon as you stop squeezing the trigger, nice!",
        "I absolutely despise caulking, so messy, the bead of caulk that would always ooze out of the tube after running a bead when using a cheap gun. Figured giving this one a try prior to flipping a house (so a LOT of caulking to do). This gun and some practice has made caulking much less messy. The trigger allows for much smoother & controlled application and having the tube tip cutter is worth the cost of the tool alone (no more looking for snips or a box cutter).",
        "At $11 the caulk gun is great. It appears to made of tough materials that will last and it has a tip cutter and seal punch. It is so much better than the older gun I was using. Very glad I made the purchase and highly recommend it.",
        "Not a fan. I bought this for use with standard caulk, and thought I was getting a bargain, but its horrible. Ive given it a number of tries, but always end up going back to my old, cheapo, standard caulk gun that I have to release manually. I will pull the trigger and the rod just slips in place and/or pushes out a tiny amount of caulk.",
        "I have ordered this twice because after a lot of hard use, the rivets gave out on the first one. Normally that would mean I would get a different one, but this caulking gun is very good, especially for the price. You won't get this good of gun for under 20 bucks at HD.",
        "Nor sure if they revised the design also, but FYI the paint color of the one I received is different than the one in the listing. Instead of grey, it's now a metal flake red. Paint scratches easily, but the gun works well overall.",
        "This is the perfect all around caulking gun. It’s well made and comfortable to use. Ran new silicone around my bathrooms and cleaned up some molding gaps with it. The gun was excellent and i highly recommend it.",
        "...and it works perfectly. I actually tried to get it to drip when I stopped squeezing and it wouldn't do it. This gun feels good in the hand \"cushioning is great), and I love the stick pin and nipple cutter in the handle. Won't ever need another one unless I screw up and loose this one...",
        "What can you say about a caulk gun? This one deserves a few words. It works very well, does not drip caulk after releasing the trigger, easy to hold and load, and has a metal \"probe\" attached for breaking the internal seal on caulk tubes. For me it is a class act among caulk guns.",
        "This caulking gun is the bomb.no more caulking squeezing out everytime.got to try it.amazing!! I do crap loads of trim work on houses and it is amazing .no more caulk leaking out.once you squeeze it out it stop until you squeeze some more out.nice when your doing crown molding",
        "Comfortable grip and trigger handle made of silicone. Does not keep pressure on the caulking tube to cause unnecessary dripping of caulking. Has a convenient small rod that extends out from under the base of the caulking gun that I use to puncture my caulking tubes prior to use, and slip back underneath. Very well made compared to other similar priced caulking guns.",
        "I love the grip and the ease of control on this gun. Best I have ever used. It releases some of the pressure on the tube so it don't keep oozing out. Well a little does but not much. Very glad I bought it.",
        "Almost everything you buy on Amazon or Ebay these days is/are cheap Chinese crap. I get really excited when I discover that I purchase something and it's from America, and you can really tell because the American make products are a hell of lot better build quality. This is a very nice piece of gear.",
        "My arthritis has gotten worse with age. My previous caulking gun was always jamming. This product has good reviews, so I gave it a try. I was able to repair the other 20feet of my garden wall in less time it took me to do 3feet with the previous caulking gun.",
        "This is a quality caulking gun. After years and several big box stores cheap caulk guns (that typically broke after a year or so of use) I purchased this after reading many positive, informative reviews. The difference in quality and ease of use is night and day. This caulking gun does not continue to expel caulk on its own once started...you have to push in the handle to allow it to come out...which makes getting the correct amount much easier than generic caulking guns. The best part, was that this caulking gun did not cost much more than the ordinary, cheaper models I made the mistake of buying in the past.",
        "if you're a subaru technician, you know you need a caulking gun to apply the silicone gaskets! this works great. super easy to squeeze compared to some of my coworkers' old ones and doesn't run too much after setting it down (it does some) i would highly recommend it if youre keeping it at the shop for that one purpose.",
        "Works great, but doesn't stop the leaking as advertised in the video, which is the only reason I bought it. It's sturdy and feels good in the hand. Still a hood buy, but that's why I only gave it 4 stars.",
        "I seriously wish I had known about this caulk gun years ago, those crappy ones that come from the big box stores are brutal on hands. This gun is a breeze to use, no cramping AND you don't have to adjust the gun after each bead to prevent leakage. Highly recommend!",
        "This was very easy to use and get my chalking in when I went around and chalked all my windows for the winter. Made it warmer in my house. I could tell a difference. Thanks again Amazon.",
        "This really is the greatest caulk gun on earth. It gives the perfect amount with trigger pull. My husband bought the heave duty caulk gun from our big box hard ware store, and after an hour of caulking he was begging to switch. There are no problems with the caulk not stopping and I would think you use less caulk with this gun so less clean up after.",
        "I initially bought a cheap Walmart caulk gun thinking there wouldn't be a difference, but when I was using it to caulk some areas on my RV my hand was hurting badly due to the amount of pressure I had to apply in order to get the caulk out. This handy bugger is pretty awesome. Minimal pressure to get caulk out and my hand didn't hurt at all. I would buy again and will definitely recommend.",
        "I am ashamed to say I researched these a lot before I bought them. One lasted about 4 months. The second lasted about 1 month. They don’t get a full it’s when you pull the trigger. As you release it releases. Over the course of part time usage over a few months, they wore to the point of not even functioning what so ever.",
        "Definitely worthwhile. Dont buy those 5 dollar guns from the box stores. They feel cheap and the trigger mechanism is not smooth. I bought this simply because i hate the caulk running after i stop pressing the trigger. I may buy another one because i havent learned how to caulk...always wiping it down and it goes on the gun. Still works. No issues and worth 2.5 times more than the box stores which lack the punching tube mechanism.",
        "Love it, I been working on construction for more than 20 years and, this is the best caulking gun I ever owned.",
        "Purchased a Tarantula gun a month before this purchase. It was more expensive and blew apart after the first use. This gun is all metal construction and meets expectations. Don't get sucked in to more expensive models. I found out the hard way that a bigger price tag does not necessarily mean better quality. I highly recommend this caulking gun.",
        "Yes, this deserves the high spot amongst caulk guns on Amazon. BTW, my very first caulk gun did drip - it always applied more pressure even when you stopped pulling on the handle. So it does make sense to at least not buy the cheapest one. This isn't the second cheapest, either, but it is a worthwhile upgrade from that one as well.",
        "You might be looking at the price but DONT. Just do yourself a favor and order this product. I used it to caulk my shower and it couldnt have been easier. This thing took heavy silicone and squeezed it out like it was soft butter. I had to adjust how much pressure I used because if youre not careful it will come out really fast. It was a breeze and thats not something I'm used to for using caulk. I will enjoy using this for many years to come",
        "I had never used one of these before and was worried as I have arthritis and almost no strength in my hands. Not only is it extremely easy to use it doesn’t keep pushing whatever is in your tube out when you release the trigger like I was told is a problem with other caulking guns. Well worth the money.",
        "This works great even for a petite woman DIY'er and way better than the more expensive one we had to take back to the big box hardware store that wouldn't work at all. Very easy to put this on neatly. We used it for baseboards, and made it a breeze. We are still finishing the rest of the baseboards and I will attach photo..",
        "This doesn't work for me. I need two hands to work it to keep applying pressure to the back of it. It wont keep ratcheting. I used it a few times but today was my last time. I hate this thing.",
        "I debated whether to get this type of caulking gun because I've always had the ratcheting type before. I have to say that I wish I'd gotten this type of gun long ago. It works much more smoothly than the ratchet type. I'll never back to the old ratchet design.",
        "Why, oh why, did I not buy this type of drip-free caulk gun years ago? I foolishly thought that all caulk guns were the same, so when the guy at Home Depot handed me their $3 model, I didn't think twice. I must have wiped up a half gallon of caulk that kept oozing out of the tube even after I had stopped pulling the handle and even released the plunger. The reduced waste alone is enough to justify the price of this type of caulk gun. It works great, has minimal drip, and is very well made. I highly recommend it, even if you only rarely use a caulk gun.",
        "I bought this based on the reviews and used it once it worked fine. The next time I tried to use it, it would not advance the pushrod / plunger. I tried to figure out why it wouldn’t work, then borrowed a caulk gun from my neighbor.",
        "Been using an old caulk gun and got tired of squeezing with 2 hands. Got this and this has made a world of difference - I can now use one hand and product comes out easy. Great buy!"
    ]
}