{
    "entity": "Caulking Guns",
    "text": [
        "This is a well made caulking gun, but far from perfect. The mecanism takes the pressure off the cartridge when the trigger is released, so that the tube doesn't continue getting pressure and flow. However, this also makes it hard to apply enough pressure to thicker caulks - the rod just does not move under high pressure. And thinner caulks still drip, regardless. The hanging hook and ease of loading is nice. The puncture rod is barely long enough for some caulk tubes and not quite long enough for some of the more professional caulks that have long spouts. I am still searching for the \"best\" caulking gun.",
        "I didn’t have the hand strength (arthritis) to use our old metal caulk gun, but the Dripless ETS 2000 is so easy to use I wish I could put 2 thumbs up emojis in this review. If you have weak or arthritic hands, know this caulk gun requires so little pressure to squeeze that it even felt like I wasn’t depressing the trigger when I was. The built-in slicer to cut the tip off the caulk tube is an added bonus. I don’t know how long it will stay sharp as I’ve only used two tubes, but the caulk gun is worth it even without it.",
        "This tool is GREAT! Far better than the ones you can buy at your local home store! It's light and has good leverage for squeezing out thicker caulk easily, but best of all, no dripping and running-on after you release the handle! No having to pop the release after each pass! This gun makes caulking much faster and easier, and that means the quality of your beads will improve. And no having to clean up drips and hanging strings of goo that lesser caulking guns will leave on your finished surfaces. I just wish I had bought this years ago!",
        "Don't by this series. Bought 2 if them and the trigger assembly pivot kind have broke in both. You will have to reassemble and use a better pin or #10 machine screw to fix it. They must have an issue with this series because I bought to others from a commercial roofing supply house...which is what I thought these were...those are fine. Which ironically have the same patten numbers. But the ones that work are a darker yellow not the light colored yellow that I bought here.",
        "gun works great , dripless it really is , I use the inexpensive , read thin caulk which has a tendency to continue flow even with tube release from gun, most likely plunger mechanism inside tube binds and continues to force caulk out. Gun is well made , comfortable feel in hand, does not require a lot of pressure on trigger to start flow. Have as yet to drop it , so cannot attest to its durability, so far nice gun, with an easy pull and no drips....",
        "This worked out perfectly for applying adhesive to my Styrofoam ceiling tiles. I liked how, by squeezing the trigger, it kept the adhesive coming out so I didn't need to keep squeezing it, which saved on my hand muscles. But as soon as I stopped squeezing, it stopped flowing.",
        "Pretty nice, lightweight, works well, not sure how durable it is but for the price I don't think you can beat it update colon drips all over the place doesn't have a pressure release and stopped working after about a month and a half, pretty much a piece of junk",
        "Owned a ton of guns, both ratchet (cheap ones) and smooth and smooth \"dripless\". There is no such thing as a dripless. However, with this gun you do not have an excess pressure causing caulk squirting out when you stop caulking. Pull the rod back a bit, et voila, no drip. Also, the run is very long compared to other brands I've used (I've used plenty). There is one brand that rates a bit higher for a couple bucks more. I've owned that brand and before I purchased this one, I was looking to replace it, but it was inconveniently out of stock.. Tough to tell the difference unless you're a Da Vinci or Michelangelo caulker.",
        "At first I really liked this gun. Dripless function works really well and the lever is quite smooth. However, less than a year of very minimal use it barely has enough power to push the caulk out depending on how thick it is. I can use something like a silicone latex no problem. But when it comes to the thicker adhesives like gorilla glue max it barely pushes it out. It performed so badly I thought the adhesive was bad at first and dry......but further inspection I realized it was the gun. 2 stars for a great start but I would not buy again. A caulk gun should be able to push any caulk/adhesive that comes in a tube.",
        "AWESOMMMME!! As a professional painter, 2-4 times per month I caulk for 6+ hours in a single day. I have tried at least 6 other caulk guns, some way more expensive that this one. This is the ONLY caulk gun I have found that is truly dripless. It is lightweight which helps when you are caulking 1 handed, or have to caulk for hours. It doesn't have the thrust capability to push old construction adhesive through it when you have a small hole in the end, but that isn't why I bought it. It works great with ordinary and fast drying caulks. And it doesn't drip.",
        "I have caulked for 40 years and always had to have a paper towel for the caulking gun and caulk to dribble into. This ends that situation. It does not continue oozing out after you are done squeezing the trigger. I like it so much, I bought it for my two son-in-laws for Christmas. You can find them for less, but we are talking about inexpensive items to begin with, and these are quality.",
        "Well i bought this hoping it was what it claims it is and what i have read about but as you can see it is not--PLUS it is very very weak--i was using just simple white chaulk for trim and you cant get a good full squeeze out of the handle--meaning its like half drawn already the handle is--very very weak--i cant see this gun doing QUAD CHAULKING no way !! YOU see the pics--dripless ok-haha,, you see the 5 dollar gun in pic---thats the one i used,, i click the trigger and it still drips but it has a full powerful full handle to squezze --NOT happy-used it 2 times and now it will collect dust in my shed..",
        "This product was designed for those of us who hate to use the conventional caulk gun; that unwieldy, stamped metal contraption that drips caulk long after you've stopped squeezing the trigger. This device fixes all those shortfalls. It is ergonomic, lightweight, and most importantly stops dispensing product after you quit pulling the trigger! Of note: this item does not work all that well on highly viscous materials (like roof tar)... so don't toss your stamped metal caulk gun just yet.",
        "I find caulking difficult to do well. This gun helps a bit with its pressure release feature to reduce the flow when fingering caulk into place. This is my second gun by the same manufacturer (first still works great after 20 years). I was happy to find this. Way better than the cheaper ones you find at Home Depot. This has a comfortable grip, too.",
        "Outstanding performance. Much smoother output than the ones you get at retail stores. I'm so very happy that Amazon has these ratings because it really allows consumers to find the best product. After running through 2 others from my local hardware store, I had had enough. Came to Amazon and found this one, which was absolutely excellent. Lightweight. Heavy duty. Easy to move the caulk tubes in and out of the gun. Easy to stop the pressure when you're done running a line of caulk and need it to stop, whereas the others just kept going. Highly recommend this caulk gun!",
        "I ordered two of these and neither works properly. I’ve bought them before and had no issues so I ordered these and they both slip. Won’t order again",
        "I ordered this one day when I couldn't find my good aluminum caulk gun. I can't comment on whether it's ergonomic, because the handle started buckling before my heavy duty sealant even started to flow. So, if you use it for something really runny, it's probably ok, and on the bright side, it's very light weight. If you want ergonomic with some power, consider a good metal caulk gun with a high lever ratio, instead.",
        "Out of all the home improvement products I've ever purchased, this is one of my favorites. It is not your standard hardware store caulk gun, honestly, you have to try it to believe it! Greatest gun I've ever used. Smooth action, easy dispensing and DOESN'T DRIP AT ALL! It's body (not counting the plunger rod) is a little longer than a regular one, but definitely doesn't detract from usefulness. Trust me, buy it! I'm pushing to sell these at my work (lumber yard with a little hardware).",
        "Who says that about a caulking gun? Is it caulk or cauk, silent L or hard L? I never know and there lies the issue with traditional caulking guns. They are just bent tin to squeeze, you mean nobody has thought of a better way to use caulk? Come on, it's used every day, sometimes passed around, left there to dry up, and just spills out all over the place. The mess it leaves, who do you think has to clean it up. This gun saves you from spillage and all those messes. I wouldn't trust my caulk with anything else.",
        "I bought this because I was working on sealing my brick/concrete steps and didn't want to risk messing up the job with drips of silicone sealant. The gun works very well. I only had an occasional drip but nothing major. The grip is comfortable, and I REALLY like the included cutter/snipper, and poking tool. The cutter could be a bit sharper, but i was able to get the job done anyway. Not as clean a cut as you get with a utility knife. I hope this is the last caulking gun I ever have to buy. Great value!",
        "I couldn't believe this the first time I used it. I bought whatever caulk gun Home Depot or Lowes had as an afterthought. I decided to spend just a bit more and try these. Why didn't I do this 20 years ago? This almost makes caulking fun (ALMOST). It is completely plastic, so not sure how long it'll last, but it sure works GREAT!!!! I'll definitely buy this again if I break the one I have!",
        "I wanted to use this gun severla times before reviewing. It a nice gun for the price and does what its supposed to - for the most part depending on what product your using it is drip-less, i did notice while using liquid nails on a project - the product continued to come out slightly but its not a deal breaker. I cant vouch for durability since i have only had this a little over three months and used it about 6-7 times. So far i would recommend",
        "While I think this is a great idea, I found with mine the ratchet to the next pull hangs up just about every time, so I'm stuck having to bump the bar sticking out the back in order to keep moving forward with my product use. This is the reason I bump one star off it. Otherwise, it is no drip, it has a cutter and poker on board, and it loads quite easily. It's a simple tool, but I wish the ratchet system worked better. Who knows, maybe I just got a bad unit!",
        "Used this today to caulk some cabinet faces. Feels good in hand and works well. Dripless. Depends. This is rated for so much pressure per squeeze. Squeeze it full pressure and use all of what it should expel and boom, no drip. Squeeze is full pressure and only run a 4in line and of course the remaining pressure needs to go somewhere. Learn how to use a caulking gun and you'll be fine.",
        "After years of using the cheap ones found at Home Depot or Lowes, I decided to gift myself and what a difference. It is much smoother, more controllable, easier to hold, easier to use and more. Sounds too good to be true, well, it kind of is pretty amazing and well worth the money. Wish I had bought it years ago instead of putting up with the old style ones.",
        "A friend of mine had the same unit as this. While helping with a project at his home I used this gun. Wow what an improvement over a standard one. I worked doing waterproofing while attending college and have pumped through my fair share of sealants and adhesives. While releasing the tab on a standard gun became a knee jerk reaction back when I was doing it daily this unit make it a no brainer. It seem to be of good quality and I wished I owned one back when I was doing this on a daily basis.",
        "bought because have had carpal tunnel surgery in both hands and regular caulk guns can be tiresome because you have to squeeze so hard. Bought this hoping it would help my weak hands but I had to pump so much to get anything out that my hand cramped and I ended up going back to original caulk gun so I could get caulk out and get job done. Am returning",
        "I’m still using it weekly to this day and it still works perfectly. I contacted the seller once because it wouldn’t keep pressure and they sent me replacement parts immediately for free! If this review was helpful, please click 'Helpful' at the bottom of the review. Thank you!",
        "I believe mine may be defective, however there was no way for me to contact the seller before leaving this review. Going by all the other reviews and 5 star ratings, I am assuming mine is defective. Will update review if seller is willing to replace mine.",
        "i got tired of the cheap junky guns at lowes and home depot so i thought i'd give this a try and it is the best one i have ever used",
        "This Caulking gun feels a little flimsy because their is some flex in the plastic that holds the cartridge but after using it for over a dozen tubes of caulking it is a very pleasant change from the cheap to mid priced ones available from the local box store. This has made setting a consistent sized bead sooo much better. This offers much better control than the old smooth rod that I was using.",
        "NO DRIPS, even with silicone. I wish I had purchased this years earlier vs. cussing at an old style with drips that get on everything. NO need to wrap a rag around the end of the tube between re-positioning the tool for more caulk. Especially nice with silicone considering how nasty silicone is to clean up the drips.",
        "Like it! Just a regular homeowner so not a long list of comparison products but it’s better than my old dripless gun. Lighter in weight (mostly plastic) making it more maneuverable. When you release the trigger the flow stops almost immediately and no clackity-clack. Enjoy using it a lot more than the old one. Obviously a little more expensive but if you’ve got a good bit to do (re-painting interior of home) then we’ll worth it!",
        "Worked well for about a week, then it the signature “dripless” effect was gone. Set it down one day and the whole tube I had in it oozed out on the floor. Luckily it was unfinished concrete in a rehab we were doing. Tried a different caulk tube, still oozed out. The ease of pulling the trigger disappeared too, so Im thinking the spring(s) or mechanism wore out. Gonna have to try a different caulk gun.",
        "Worked great for about 4 hours. I applied about 8 tubes and then the gun wouldn't squeeze any caulk out anymore. Thought maybe it was a bad tube but my other gun had no problem with the tube. I tried several more tubes but guess it crapped out.",
        "It is a much better chalk gun than some of the junk out there. I’ve used this one for years. The price point is great for what you get. Are there better chalk guns out there? Yes. This gun is sort of in between the bad guns and the really exceptional guns. Right in the middle. If I saw someone I hired using this gun on a job I’d be ok with it.",
        "I’m 70 years old and have done lots of caulking because I’ve painted the inside and outside of my house numerous times and anything else that needs painting. This truly is dripless. It will pay for itself quickly just for what you no longer waste. Very user friendly. Great gift to someone who does there own repairs or upgrades around their home.",
        "I bought this for rare use at home resealing sinks, baths etc - perfect. Nice weight and belies its price point.",
        "Definitely an improvement over the standard caulk gun- I've used bathroom caulk, roofers glue, as well as liquid nails- no trouble with any. Spout cutter is a nice additional My only worry is it's plastic, which should be fine for my limited use but I might look elsewhere if I needed something for large projects where it would see abuse.",
        "This broke the very 1st time I used it It's all plastic very brittle",
        "Wow! For years, I've used the traditional ratcheting style caulk gun and dealt with drips and such. However, this caulk gun is lightweight and best of all, it doesn't cause caulk to keep dripping when you release the trigger.",
        "Great caulking gun! This is so much better than the many caulking guns that I've used for decades - I'll just throw all the others away. As other have surely said, this works really well. When squeezing the trigger, the pressure is 'just right' - about the 'right' rate of expressing caulk. When you release the handle, the pressure is off so there's minimal overflow, and the dimensions fit my hands well. What more is there to say - this does everything I want a caulking gun do, and nothing else?",
        "We have a magnetic application where metal cannot be in close proximity. This caulk gun allowed for application of glue from other than small, squeezable containers. It is easy to use and is surprisingly dripless. Have been using for several months, and not a single drip. Perfect.",
        "i love everything bout this too bad it's just not squeezing the caulk... man o man o woman how many times i keep squeezing the trigger how many shots i fired the bullets (caulk) is not ejaculating i-nako..! the old standby's mor betterer... i problymaybepossibly hav got a bunk or sontin...",
        "This is a great caulk gun. I used it at my nephews very old house to caulk everything ! It did have a few slight drips but i think it was actually the caulk I was using because it didn't drip when I used another tub of caulk. The handle makes it very easy to use without getting your hand tired. I'm a small petite woman with hardly any arm strength and so the light weight of this helped me do caulking way over my head without my arm getting tired at all. Even though there were a few small drips I would highly recommend this caulk gun !",
        "Bought 4 for my business. Two broke just trying to cut the tip off the tube of caulking",
        "best caulking gun I've ever used. I used a cheaper version from my local Lowes on a 5ft section of my garage using NP1 sealant and by the time I was done with the 5ft section my hand had gone numb. I ordered this gun and I was able to complete the other 95% of my garage using the same NP1 sealant in the same amount of time it took to use the cheaper version. My hand wasn't numb and I was able to use the entire canister of sealant.",
        "This caulking gun is easy to use. I do mosaics and I can easily squeeze it with one hand. So glad I got this so I don't have to hurt my hand on the crappy metal one. I don't know about the dripless part.",
        "This is the best caulk gun I've ever used. Virtually zero waste.",
        "This tool made recaulking my bathroom a breeze. It really is so easy. It also comes with a cutting part so it really is the only tool you need. The instructions were easy to follow as well. It kept everything neat and clean too! No leaks",
        "I love this caulk gun. I purchased a different gun previously not realizing the significance of “dripless.” This is so much less stressful, less messy and less wasteful. Now I (almost) feel like a pro and have caulked about 15 tubes worth without the anxiety that I have using my other high quality, free flowing caulk gun. I still have to use it with really thick exterior caulks like locktite or roofing tar like sealants. Those demand more pressure than this one has.",
        "I have had many caulking guns which I had a difficult time using due to limited usage of my hands. This gun works perfectly. Easy to use. I love it. I went very fast ( well for me).",
        "Very happy with this Drip-less Caulk Gun! It really doesn't drip....you can start to see some caulking come out but then it stops! Very comfy, not to heavy, really happy with the purchase!",
        "I was having trouble dispensing some caulk in cold weather. This gun did the trick -- easier to squeeze and dispense with less effort, and relatively dripless. Also used it for more precise work (interior caulking with Dynaflex 230) and I still found it to give me a lot of control. Great all around gun.",
        "Best calking gun out there. I've used many styles and every since I started using this one I am unhappy with all others. It is the best no-drip gun I've every used. Many claim to be no drip--but this one pretty much nails it.",
        "For years I have struggled with cheap metal caulk guns. Pinched hands, oozing caulk, uneven flow and worse. The Ergo Dripless has changed my life - at least when I am caulking. It does not drip. It does not pinch. It just does the job smoothly and hassle free. I really like this caulk gun!",
        "Contrary to the deliberate brand name, this does in fact DRIP. Keep your paper towels handing because this is no different from any other caulking gun that DRIPS. Scammed would not recommend.",
        "Well made with plenty of leverage in the long trigger. Composite body is exceptionally rigid— more so than the cheap sheet metal units found in most discount stores.",
        "Very easy to use. cuts the tip off easily. the old cheap orange caulk gun cutter we had was very dull and it would bend the tip instead of cutting. No dripping with this caulk gun.",
        "Works fine. Sometimes, if I have to squeeze tight, the trigger flex makes me wonder if it would break. But, has not broken so far. Used it for applying silicone to windows from outside. It was still drippy for silicone. They have multiple types of these. I can't buy one of each just for occasional uses.",
        "Very easy to use. Am not sure if I will call it dripless as my caulk dropped some. But it was very easy to use and force needed to get it work was way less than the cheap home Depot gun I had earlier.",
        "This item broke when my husband was using it the first day. Not very sturdy and we got it for the on off switch so his material would not leak. It did not help.",
        "Had one of these and misplaced it. Bought a regular caulk gun at Lowe’s and was so disappointed that I bought this one again. Best $13 I’ve spent!",
        "I struggled with using a $3 caulk gun with silicone, so I bought this one and it made a huge difference. Caulk dispenses smoothly and easily. Nothing sticks to the gun so it is easy to clean.",
        "I had a contractor putting siding on my fireplace. He needed to caulk it to finish the job. I handed this caulk gun to him and he was so impressed. He claimed it was the best he ever used, no wasted caulk and where did I get it. I told him Amazon!",
        "When you squeeze the trigger it moves but when you release the trigger the plunger slides back. See if I can fix it before sending it back.",
        "I'm able to hold the rod from moving with just slight resistance. What is the force pressure limit supposed to be?",
        "Bought to replace one I have had for 7 years- use a total of 3- Finally broke after being dropped too many times from too high. Use a lot with caulk that is hard to handle-732- and the dripless feature and lightweight is fantastic.",
        "This is brilliant and I am very happy with it initially. I don’t see any downside to it at all. I have used it over the course of a few days. For me it has worked faultlessly. Every time I release the trigger the caulk stops immediately. May the force continue!",
        "I've bought Dripless ETS2000 caulk gun and Newborn Bro.'s 930-GTD caulk gun, because I could not decide which one to go. They are both excellent product and I love using both. NOTHING like those caulk guns that you get from Home Depot and Lowes (they make your hand hurt after using it for a while).",
        "This is a great gun for the money. It's made well and is very ergonomic.",
        "I volunteer at Habitat for Humanity and we have caulked trim, baseboards, etc.... for weeks and weeks on end. I've used 3 different dripless caulking guns over the last 3 months and this is the BEST one hands down. I am a small women and many of the caulking guns have wide grips which makes using them all day really tiring. This gun has a smaller grip, and it is also ergonomic. Sometimes it is not completely dripless. I've found that it works best when you let go of the grip about 1-2 inches before the end of the bead and then let the small excess that comes out fill the gap. Happy Caulking !!!",
        "What a difference a product makes! This gun is so easy to use and lightweight especially compared to the cheap ones. I had only caulked a couple of times previously and was scared to try again. But all my fears were for nothing using this gun, as my shower turned out perfectly. I have thrown my old gun out and will only use this gun in the future for all the projects I am now not afraid to tackle. Highly recommended!",
        "When you know what you're doing caulking is a pleasant (if sometimes repetitive) task. This application setup is good enough for interior grade finish work.",
        "I have been buying tools that are off limits to my husband because he is hard on tools and does not take care of them. This is very easy to use and does not drip. It will be nice to have a caulk gun that I can use.",
        "I have a caulk gun in my hand 2 or 3 times a week. The quality is above homeowner grade but not quite professional grade. If you've never used a dripless gun before try it, it will change your life.",
        "I used to be of the mindset that all caulk guns flat out stunk at caulking. But after getting really annoyed with a cheap metal one from the home improvement store that would only advance a tiny bit before needing to be \"cocked\" I decided to upgrade to this one. It's a miracle how evenly it advances the caulk...and for so long without releasing and re-squeezing. I was able to do an entire side of a vanity top in one stroke. Amazing! And the rate of release is so fluid and smooth. This is definitely worth paying a little extra for.",
        "Only problem was caulk gun missing key components for perfect operation. Deserves 2 stars and bad review but it gets great review and 4 stars! I love this gun! Just the way it came in packaging it was missing critical washers which help operate caulk gun trigger push of the caulk system!",
        "Only things that aren't truly dripless out of this are grout caulks (just keep coming) and some crystal clear tubes (some brands minor drippage).",
        "Worked for a few jobs, then pressure slipped entirely and no longer works.",
        "This is one fantastic caulking gun. I mean that sincerely. Whats come out is only the amount you pull on the trigger.",
        "Great price, fast delivery and just what I needed. A++",
        "There is no apparent way to release the plunger. There are no instructions, no diagram. Me and my brother (who's in construction) have been sitting here for 20 minutes and still can't figure it out. No buttons, no arrows, NOTHING. WHAT A STUPID PIECE OF CRAP",
        "Best caulking gun ever releases when you stop pulling the trigger.",
        "Bought first one few years back - best gun ever had/still usable, but has some wear. Second one won't advance & recock at end of squeeze - have to hit end on something solid every time/what a pain.",
        "I would give it five stars but the shaft slips when handling thick caulk materials such as sand grout color matched caulk.",
        "I'm giving it a 4.5... Well it didn't drip but a little came out the end. But this thing is very smooth. A big plus from the basic model I'm use to using. It does rotate like described. Once again this is very smooth. The amount it disperses to one full trigger pull is a nice feature and easy to control.",
        "Easy to use. My hands are pretty weak as I’m a woman work out my hands very little. So this was way better than my last caulk gun.",
        "Not a dripless. Worked as advertised with the first tube, after that the caulk kept on coming after the lever was released. On the plus side, the unit is lightweight, works smoothly and is well made. I purchased for one reason only, that is was supposed to be dripless, hence the 3 stars.",
        "Liar, liar, pants on fire! Does not do what it says it would do! NOT LEAK PROOF",
        "Nice when the product performance matches the product description. The dripless feature worked perfectly for me.",
        "This caulk gun is only 2 or 3 times the price of the cheapy \"big box\" guns, but it's so much easier to use, clean, and carry that I don't know why I've waited so long to get one. There's plenty of reviews explaining how well it works, that my recommendation is simply to get yourself one of these - the time and effort you'll save make it a very wise (and inexpensive) investment.",
        "I bought one of these for one of my install crews. They loved it and bragged about it to the other crews. Now I've bought about a 20 of these and all my installers use them. They won't go back to the box store caulk guns. In a commercial setting, I'm getting more than a year out of these. My guys use these more in a week than a residential user will use it in a lifetime. If you're looking for a caulk gun, just buy this one. Period.",
        "Bought two to replace the one I lost and of all the brands I have used I like these the best.",
        "It really DOES reduce drips. Easy to use. Husband was skeptical at first. He was repainting the porch rail, and I encouraged him to caulk around the bottoms of the spindles, where the paint had failed. It was a snap with this caulk gun, and the railing looks fabulous. Our daughter's wedding photos were taken on the porch--it was pouring--so I'm grateful that this worked so well. Thanks!",
        "While the caulk didn't drip, it didn't come out of this gun with even pressure. There was no physical feedback to gauge what was the right amount of pressure. I went back to my old standby that's 15 years old and it did a better job of application. This gun did have nice smooth action though for releasing the tube.",
        "friend of mine has one of these, that's why I purchased one, unfortunately mine never worked right out of the box. plunger does not move forward, sits in one place. Headed to the trash bin.",
        "What a pleasure to be able to apply a controlled amount of caulk (without the mess of extra caulk coming out)!",
        "The only brand of caulk gun that I buy. Used for 20 years.",
        "Best caulking gun I've ever used. And it is what it says it is...dripless. I was surprised at how well it kept its promise to not drip whatever I've used it for. And the 360 degree rotating body makes it easy to always apply your product at the proper angle for a nice looking bead. Highly recommended and quality built gun."
    ]
}