{
    "entity": "Choppers",
    "text": [
        "Not very solid. Had to use a plate to get it to chop. The soft cap wasn’t cutting it. Spend more and buy a Pampered Chef chopper. I’m not a PC seller but you can’t beat their chopper for the money. If you are looking for a good quality chopper don't by this one. It's not good. Buy a Pampered Chef chopper. I've been using the same Pampered Chef Chopper for 15 years. I bought this chopper because I figured my 15-year-old Pampered Chef chopper blades were getting dull from the years of use. My 15-year-old chopper worked better than the OXO Good Grips Chopper. Don't buy this one!",
        "Cutability: I had trouble getting green onion and green bell pepper to cut. The green onion got flattened out instead of sliced. The bell pepper membrane wasn't cleanly cut. Effectiveness: It's OK. It turned a 20 minute cutting job into a 3 minute job. If you want uniform cuts, this isn't for you. I was happy to spend less time on chopping. Cleanability: I got cabbage shreds stuck behind where the blade is attached. Took several minutes to get it out.",
        "It chops broccoli well, but others not so much. Pictured below is a pepper- it cut it, but not all the way through. Will continue to use for other veggies, though.",
        "Wanted a slap chop, bought this instead. Best $20 over ever spent! Cleans easy, chops all my veggies fast, especially onions. Some veggies are a little annoying or hard to chops, but those arent appropriate for this thing anyway and that's just me being lazy. Lol",
        "dont let other review mislead you. this device is simple and it works well. you just need to smash it. when i use it to chop garlic. i start with smashing it down only 1/3 of the total travel to avoid blade stuck between garlics. after a few light strike, i smash it down all the way. it is that simple. if you are having problem using it, use your brain first. figure out why it doesnt work.",
        "This chopper did the job, but I myself couldn't use it due to shoulder, elbow, and wrist pain. I had to ask my husband to do it. It's also nearly impossible for me to push the knob down and turn it in order to lock it in the down position for storing. One of the things we chopped was baking chocolate. A couple of pieces became stuck inside and had to be pried out before continuing. The chocolate did not come off in the dishwasher and had to be soaked and scrubbed by hand afterward.",
        "Been using the heck out of this \"not a slap chopper, for trademark reasons\" since I bought it. While there are clear limits around how much stuff you can quickly chop (e.g.- a full or even half an onion might be too much) you'll find it's durable and does a decent job. It's best for small things like garlic cloves or chilis.",
        "Product is easy to use and cleaning is a breeze. It breaks down into many pieces for cleaning purposes, that's a plus. One thing to be careful of is when reattaching the blade to the screw, do not turn beyond the click point, about a full turn or it can be stripped out. Customer service is excellent, warranty service excellent.",
        "BigRich uses this 'treasure' all the time in his new hobby of cooking. He had one that finally broke and right away ordered this unit. It seems more stronger made than his first one. Just rinse it off and put it in the dishwasher! It chops his all raw vegetable minced, medium or larger. Even mushrooms and olives. Minced is good as they are hidden in whatever he is making so finicky people don't see. Arrived on time.",
        "This chopper is tiny and it gets the job done. I would recommend this for chopping nuts, salsa or a small amount of onions. It won’t purée them like a food processor - and that was awesome. Sometimes the old tools are the best ones and I would say this is an old school tool that will never be replaced.",
        "In theory this would be a good product but for me it's just kind of pointless unless I'm chopping a very small amount of something. can't fit a whole onion....if you have to cut the onion or other veggie into quarters or smaller to get it in there then whats the point. It also is not strong enough to easily cut harder veggies like potatoes and carrots.",
        "Terrible product and too expensive for how bad it works. Doesn’t chop very well. Very small capacity. Falls apart while in use. Practically juices your veggies instead of chopping them. Nothing good about it. Took a while to use it so it’s too late to return but if I could I would return this product!",
        "I just got this-- was so excited because I have been on a pico de gallo kick, less cutting, yay! NOPE. I cut a tomato in quarters and put half under the chopper-- did the thing a couple times, picked it up... results tomato mush with skin still in tact. Tried again but cut the tomato a few more times, still mush. This did not work as demonstrated. Would not recommend.",
        "I have basic knife skills but thought this would help with cutting onions without tears, and chopping nuts. For onions, required a lot of effort and noise to push the blade down, and took longer than chopping by hand. For nuts, the nut pieces got stuck between the blades, and the blade was very difficulty to remove in order to wash. Overall annoying to use. I threw away the packaging and couldn't return it so just threw it away. This is the second OXO product I was unhappy with (the first was a dishwasher brush the handle of which kept falling off), and will avoid buying OXO in the future.",
        "I normally love OXO products but this one was a huge disappointment. I used it once and food I was trying to chop got stuck in it. I kept the bottom part because I can use it as a measuring cup. I threw the top chopping part in the trash. Wasted my money.",
        "My wife had a Pampered Chef chopper for probably 15 years and it worked great. She loved it. Three or four years ago, the clear skirt cracked all the way through, making the chopper difficult to use. For her birthday, I bought the OXO chopper. She was delighted! According to her, the OXO chopper is just as good as the Pampered Chef chopper. She's very happy with it. I've used it for chopping onions and walnuts. Blade is very sharp. Works great. Does the job.",
        "We are very happy with this purchase. The only thing that is slightly irritating is that when you’ve chopped something and go to take it out, it’s difficult to get it all out. It gets stuck in the edges and to the blades. I would still recommend it to others.",
        "Good quality plastic and blades. Works well. The container has a small peripheral groove on the bottom that traps food and is difficult to clean. i use a toothpick to scrape this area but would be better if the bottom was flat.",
        "We replaced our very old Pampered Chef chopper with this nifty Oxo chopper. We have been happy other Oxo products. Chopper works well. We use for nuts and olives a lot. Onions might be prone to sticking if the chunks are large...but does a nice job with small batches and dicing onions. So nice to have a sharp blade. Should have replaced it years ago. Very happy with this...and all dishwasher safe. Win.",
        "It’s complicated taking it apart and putting it back together. It doesn’t chop herbs since the blades aren’t sharp enough but haven’t tried garlic or onions. It does look like it’ll cut through garlic and onions since its thicker",
        "I bought this after shoulder surgery as cutting vegetables was impossible and my left arm not accurate with a knife. It works OK but you still have to cut onions to fit within the small circumference. Some are chunky some small pieces result. Not uniform.",
        "when I was looking to buy a chopper it was mainly for the smaller item I did not want to cut with a knife. this chopper works wonders for just these item: small tomatoes, small onion or 1/4 of bigger size, baby carrots, 1/2 and more. super easy to clean out between items. I would not get the smaller one if you plan on chopping large onions whole.",
        "If you are looking for something to make your life easy then this is NOT IT. REALLY SMALL, Cumbersome to clean/wash. MOST importantly it is NON-RETURNABLE, buyer BEWARE",
        "As many others have described, the plastic tray that you chop on is defective, and bits of plastic are sheared off into the food you are chopping. Please avoid this chopper to ensure that you are not consuming plastic!",
        "I had this chopper for about 6 years. I use a chopper twice a week or more. I'm not a fan of large chunks of veggies in my food, so mine is used hard. When mine broke. I immediately ordered another. It's easy to use, easy to assemble and cleaning is a breeze! From veggies to nuts, It fits my chopping needs.",
        "We both used the chopper a number of times since the purchase, it works well for garlic and a few fresh herbs like cilantro and parsley, but not for thicker skinned foods like tomatoes or peeled ginger. It chops onions, but not as well as for the garlic and fresh herbs. We were hoping this chopper would work for making salsas and toppings for ramen, it's ok but not great overall.",
        "Thought it would be good. Found out you must learn about kitchen knives and the edge of the blades like a chef just to find one that works properly. The blades on this one flex too much and get jammed in the items without cutting through them repeatedly when used per directions and there is no way to adapt. Threw it away. Learned there are only 2-3 out of thousands that actually work properly and they are very expensive chef quality items. I went back to chopping, slicing and mincing with a knife.",
        "I have no idea what food this would work for. I tried chopping fresh parsley and fresh basil and it did not do a very good job, stuck to the blades, and by the time it was all said and done, I know I could have done it faster, easier, and better with a sharp knife.",
        "This is a terrible product. It doesn't even cut anything up. All it does is smash whatever you try to chop. Also, Amazon doesn't allow returns on this product, so you'll be stuck with a chopper that doesn't work. Do not buy this!",
        "I got this to replace a broken one from pampered chef. This is not near the quality of the pampered chef chopper and doesn’t have the ability to chop as much. I will replace it with the pampered chef version.",
        "I love this thing for chopping when I don't feel want to break out the food processor but want to chop more expediently than by hand. Works great for nuts, herbs, veggies, etc., and comes with a cover so you can store what you don't use.",
        "good for chopping garlic and ginger works in small portion it does disassembles easily and easy clean I brought this for chopping roma tomatoes It did not work or chop in pieces not even if I already chop in small pieces then put in in I love oxo products but not this one",
        "I hate chopping fresh garlic and onions and this product is the best!! Love it and highly recommend. Been using one for years and now I give them for gifts.",
        "It's just OK. The clear bottom cup ring does not lock, or screw in place. I haven't used it as much as other models that I've completely worn out & can no longer get replacements for. I use it on a cutting board rather than the bottom seal, so I can chop a larger quantity. Nice that it's dishwasher safe.",
        "Love this chopper. Works great if you don't overload it. I use it every week and it is holding up great. Much better than the cheap power chopper that came with my pressure cooker. The trick to these choppers is to chop small amounts, Like 4-5 baby carrots at a time.",
        "I purchased this to replace my Pampered Chef chopper and I just don’t like it as much. It gets the job done but it’s not as smooth as the PC one.",
        "It lasted longer than the cheaper knock off that I first purchased. My OXO made it to the 2.5 year mark before one of the plastic tabs failed. Beyond that, it does what it advertised to do. This time though, I may move to a small food processor.",
        "Finally got to use it the other day. It is different from my pamper chef version as the bottom piece has to stay on which measures your chopped items in cup sizes. I thought it was very easy to use and chopped up celery, garlic and carrots very easily in small pieces. The bottom piece did look discolored after use with the carrots but I simply wiped it clean with a magic eraser and it was back to being clean and white. I thought it was very easy to hand clean. Don't know if you need to put it in the dishwasher and it cleans so fast under soapy water.",
        "As soon as I received it, I gave it a try It looks very cute. Easy to get it out from the plastic package. I tried onion, cilantro, tomato and garlic. It only worked on garlic. The rest, it just Mashed and squeezed the juice out.",
        "Hard to use, and dangerous to clean, disassemble and reassemble. Did a poor job chopping onions, peppers and raisins. Would not recommend wasting time and effort to use.",
        "Love the way it has tabs that move around the sides while it chops. First one I have used with this feature and works great. Easy to hold onto and chop. Comes apart easily for cleaning. Hope it lasts for a long time.",
        "The bottom comes off of the container too easily. When I use this, the bottom comes off and I have to reassemble the container and clean the partially chopped veggies from the counter and place them back in the chopper bin.",
        "I absolutely hate chopping up onion the traditional way and there were many times I skipped putting onions in my recipes and really missed out in the flavor. I finally made this purchase and it is so quick and easy that now I add onion to all my recipes and my food now has more flavor. Purchase it, it's worth every penny!",
        "Work great as long you don't over filled it. Use a reasonable amount to chop and it will do an awesome job",
        "Replaced an old one with this. No problems held up to quite a few good slappins. I expect this one will too",
        "We bought one probably 10+ years ago and since then bought 2 more, one for our vacation home and another for the Motor Home. The wife uses it weekly for chopping chicken to use in salads and for making home made dog food. Easy to take apart to clean.",
        "To small for me. I always make a baby food. But this is so small size.... but working good.",
        "I really like it and it works for what I need it to, but the giant slap button (idk what else to call it) and blade get stuck in the down position pretty frequently, and the lid that covers the blade is a little hard to get off and put back on. But for the price you're getting it for, it chops things up. So no real complaints here.",
        "My wife stopped using it because of the inconvenience. Jams a bit when full, doesn't fit much. Chop before you chop.",
        "Good job on firm veggies. Very difficult to take apart to clean.",
        "This is a great chopper. It is indispensable in the kitchen.",
        "Seems like a decent idea for a product, but even the first time using it was a bad experience because it gets jammed with every other chop. Not worth it.",
        "After 4 months the handle broke and the top would not stay on. Was a good chopper when it wasn’t broke.",
        "HATE THIS CHOPPER!!! The way it’s designed, the twist lock will get stuck, and it will not come back up without significant strength or luck. VERY POOR DESIGN CHOICE!",
        "I want to return this but can’t find a method to do so. It will not chop nuts. That is what I bought it for. Who stands behind this product, OXO or Amazon? Usually OXO are the best kitchen items.",
        "soft foods chop ok... JUST ok... foods like onions and peppers flatten and pulp more than chop... also, due to the large model's size it's not very efficient when chopping garlic unless you are ok with spending time \"collecting\" the garlic from the blades, the housing and the collection cup. very disappointing... I'm a big OXO fan.. this is just poor engineering...",
        "This item isn’t approved the purchase. When I tried to use it and chop small amount of onion or so the chopper gets stuck and i have to open it again and again in order to fix it and make it work again. I found it easier and faster to chop with a knife!",
        "This broke after only a couple of uses. The base disconnects from the cup spreading chopped stuff spread all over the counter in a huge mess. Not the quality I would expect from Oxo.",
        "Not a huge storage capacity - but this thing is super handy. Makes quick work of chopping/dicing without any electricity and cleans up quick.",
        "I bought this to replace a well-known and more expensive chopper that finally fell apart after 20 years. This is certainly not even close in quality! The veggies just stuck to the chopping blades and wouldn't chop. I had to use a knife to pry them out. After 3 attempts, I gave up. This is going back to Amazon, and I am going back to the brand I had before (that is sold at parties). It is definitely worth the extra money.",
        "Prefer my old Pampered Chef chopper-was spoiled with easy clean and fine chopping. This one doesn’t chop as quickly (takes much more effort for same results) and not as easy to clean.",
        "I've tried chopping pecans and it did chop them but almost pulverized most of them. Not great if you like crunching on nuts in your baked goods or other foods. Works pretty well on onions but I've not tried to chop any other foods. I wanted this mini chopper so I would not have to drag out my regular food processor every time. I will stick with my regular food processor which works much better.",
        "This chopper really gets the job done. Comes apart for cleaning. This is our second one. We have owned multiple choppers over the years. We purchased this one a few years back. It lasted longer and worked better than any of the others we have owned.",
        "Loved it but it didn’t last long at alL. Already broke",
        "Works well, fits my hands well, easy to use. I have always liked choppers, but now I have arthritis and it makes chopping really easy. I don't need so many pieces, but it is well made and functions perfectly.",
        "If you do a lot of chopping, this is a real convenience. Sure, you might get a more artistically pleasing result with a nice, sharp cleaver, but if all you want to do is pulverize some garlic or parsley or ginger or make bacon bits... this thing accelerates the process. Just use it directly on your cutting board. There are comments about how it's hard to clean, but it comes apart easily and you can stick in the dishwasher.",
        "I did not like the product and want to return , but amazon is not giving an option to do so . Can someone help . This is brand new just tested .",
        "Very handy for small chopping jobs. No muss, little fuss.",
        "I do like the product and use it regularly but I had to give a lower rating because it's inconsistent with it's cutting. The blades aren't sharp so you really have to whack the top of it to break the skin of a tomato or onion. Also, it turns internally so it can cut more efficiently but it gets stuck from time to time. It has done this from day one. So, while I do use it a lot, it could be better.",
        "The container is very small, so you have to do multiple loads to get the work done. I used it with bell peppers and it wouldn't cut them clean. The plastic bottom of the container separated from its housing which made a huge mess as well...",
        "This was a replacement. A piece of plastic broke off in the plunger.",
        "This was replacing a Kitchenaid chopper, and the OXO one is built much more solidly. It works quickly and efficiently, can handle up to about 8 or 9 cloves of garlic at a time with no trouble, and also worked well for ginger (cut into chunks, first). Cleaning is easy, as long as you disassemble it and clean it before food dries on.",
        "I love this product. I have one at both of my houses and bought one for each of my kids",
        "Chops onions, green peppers, garlic and even carrots, its a workhorse for chopping, saves time and my fingers!",
        "This is the biggest piece of crap. It is so dull that it will not cut anything. Save your money, get a nice set of knives.",
        "I'm not sure what people are chopping with this, but I couldn't get it to chop anything unless I had pre-chopped it into small pieces beforehand. If I'm going to do that, I might as well just use a knife for all of it. Works ok on veggies, does not work at all on grilled chicken.",
        "It can only chop such a small amount, it’s basically useless. Just use a knife. It gets stuck easily too.",
        "Bought to chop pistachios for my special cookies. Works great! But I wouldn't expect anything less from OXO. They always deliver.",
        "Great upgrade from our older pampered chef chopper, seems way more sturdy.",
        "Awesome. My spouse uses this for EVERYTHING in the kitchen. So, if you have a spouse or significant other who is proficient in the kitchen, you should definitely encourage that habit and buy him (yup, him...I'm super lucky) this cost-effective chopper so you can come home to a dinner of Almond-crusted salmon and glass of sauvignon blanc (preferably Australian) after working all day to support your significant other's penchant for being in the kitchen.",
        "This unit is really great when it's working. We use it a lot. But the plastic tabs which hold the plunger aren't strong enough when they break, you're done. We have replaced it almost annually.",
        "Bought this for a party to chop everything. It didn't work. I ended up chopping by hand.",
        "I was very excited to try it out but unfortunately it didn't work for me, it wouldn't chop any of my veggies even if cut them in smaller pieces. I threw out packaging and couldn't return but overall I do not recommend, waste of money",
        "When working, it's pretty great, but it broke mid chop and with force. Not even sure exactly what broke but it sprung apart in my hand and can't be put back together.",
        "I am using OXO chopper for making my baby's food. It won't cut the raw, hard vegetable like carrots or onions very well... But it works great with steamed and other soft veggies. Veggies for baby food need to be boiled or steamed anyways, so it's not a big deal for me. It made making baby food much much easier!!",
        "First one I purchased lasted years and I loved it! This one is a disaster. Lid at base is not tight with the cup and everything comes apart when I’m chopping. I missed the return window so now I’m stuck with it.",
        "The best chopper yet for those of us who still like to control how chopped things get and like to bang on by hand. I found it very easy to dismantle and put back together again (but kept the instructions in case I forgot how) and it works great. My last one (good name brand) broke within two years and was cheaply made. This seems quite sturdy and does the job very well. I have hand arthritis and this is very easy on the hands.",
        "I always buy OXO for the quality and aesthetic. BUT .... I think this chopper could have been designed better for easier use. HOWEVER .... It chops well.",
        "Must have. Our last one finally broke after 5 or 7 years of using it 3 times a week so we purchased this second one. Everyone who see it in use that comes over wants one",
        "I think that my complaint for this item applies to all handy choppers. You have to cut your vegetables into such small pieces in the first place in order to use the chopper, that it doesn't save much time. Especially when you consider it takes more time to clean this than a knife. I guess if you really clumsy with a knife this would be a good idea, otherwise not worth the time or money.",
        "Does not chop. After trying with over 50 chopping motions (as described) onion pieces were too big and not as good as hand chopped. I had to use my Cuisinart.",
        "I discovered this product at a friends house & I just had to get one of my own. I use it mainly for chopping onions & it takes no time at all. It also eliminates my eyes from watering/burning while chopping onions. I would recommend this item to anyone who chops onions or any other vegetable on a regular basis. Huge time savor. It also chops to just the right size for most of my recipes.",
        "I tried replacing my pampered chef chopped for this one and was beyond disappointed. Don’t even both with onion. And cleaning it I’ve almost cut myself each time",
        "This was for my wife - to replace her Pampered Chef chopper which developed a major crack. It doesn't make as much noise as the Pampered Chef product so she doesn't like it as much (while I like it much better).",
        "excellent product! I have one and I bought another one as a gift. easy to use, it bites anything and even replaces a cheese grater. I recommend!",
        "I used it to cut the onion. It is hard to use. I need to cut it into small pieces and then use this one but still the onion stick on the chopper. And also, it is hard to clean.",
        "Had this for several months. It's always very difficult to take apart to clean. Cut myself today. It's going in the trash.",
        "Not sure about this one. Hard to clean. Have to hit hard to chop. I'm not rely that happy with it.",
        "Doesn’t chop well. Leaves big chunks. Amazon customer service is the best.",
        "Prior to buying this chopper I had a Pampered Chef which I loved. This one surprised me because I like it better! It chops better and more uniformly. Love how it totally comes apart to put in dishwasher. Seems very well designed and sturdy!"
    ]
}