{
    "entity": "Choppers",
    "text": [
        "It broke just after 2 time use. Blades completely came out at second time of use.",
        "This thing is a piece of junk. I've had it for three months and only used it occasionally, but it broke during normal use today. One of the blade pieces just popped off. I should have returned it when I first got it because the item I actually received does not have the Vidalia Chop Wizard name on it anywhere. (see photos) I thought maybe they just changed the look, but now I suspect otherwise. I think they filled the order with a cheaper, junkier version.",
        "BUYER BEWARE! This is a Made in China plastic item which requires forced downward pressure to effectively dice half-cut onions or other vegetables. This required force of the top-cover can cause the plastic hinge-stud on the rear of the clear base to break off while properly following directions for use. This is a poor quality item when necessary downward forced pressure is applied! Some may say, avoid too much downward pressure when using; but what you get is half-diced vegetables stuck between the square-pattern cutting blades.",
        "I don't know how Amazon lets the seller sell this item as the Vidalia Chop Wizard when it really arrives as another product called the Kitchen Pro Dicer. It is not made as well as the Vidalia Chop Wizard. Unfortunately I bought this as a Christmas present for someone (who had seen the real Vidalia Chop Wizard) and I was appalled and embarrassed that it was not the real Vidalia Chop Wizard but a cheaply made product instead. This seller should be put out of business for being so deceptive. Don't buy it!",
        "I have had one of these that I bought from my local home goods store. I used it for over 3 years and finally the sides crack. I use it almost 3-4 times a week. Never had problem cutting potatoes, carrots or anything else. This one however its harder to cut potatoes and requires harder to push down and have to cut my veggies in slammer slices first. The blades are not as sharp as the way it used to be. UPDATE: BOUGHT THIS IN May this year. Use it may be 1-3 times a week. Today the bottom tray broke by the corners. So disappointing. Time to explore different chopper companies.",
        "I thought this would be a great time saver when cooking soups etc. Unfortunately, the hinge on the base of the chopper broke off after a short while. After reading reviews, I realized that this is a problem which a lot of customers have complained about. I e-mailed the company, and one week later have still not received a reply. I called the company as well, and they have never answered the phone. After reading product reviews, I have learned that the company charges around $10 for a new base. Save yourself the money and the headache and buy a chopper from a more reliable company.",
        "Wasn’t sure what to expect from a chopper but the Wizard exceeded my expectations. It’s easy to use, provided some common sense is applied with the size of the veggie pieces that are set in place to chop. It is a quick and effortless job on most veggies. Chopping onions is a pure joy if you’re used to chopping by hand. While the design seems primitive by today’s desired electronic gadgetry, it performs very well with it simplistic design. It is strong and appears to be durable given the use it has endured thus far. Not sure how long it will last but even if it does eventually fail, it is inexpensive enough to easily replace. I’m way satisfied!",
        "I have used a couple of these types of food choppers in the past and the blades bent and then it was useless. It appears this unit has made improvements to the blades. The metal is thicker, and well fastened to the unit. It chopped everything as stated. Harder food items like carrots take more force. Definitely, two hands are needed to make it work well. You need to use some force and speed when chopping onions and carrots. Softer foods like celery and cucumbers chop with ease. I love this chopper. It works as intended and makes your food look professional.",
        "My wife is a real \"from scratch\" chef. She seemed to be spending her live chopping onions and other veggies. I got here this thing and she loves it and she is not the gadget person I am. Some reviews said it would break to easily. We have found that if you put one hand right above the chopping area while using the other hand to close the chopping lid it works great and appears very solid. Also, remember, you're chopping, not gently probing your vegetables. She zips thru whatever she is chopping briskly with great results. Also make sure you break down the veggie into manageable sized chunks.",
        "The video makes it look like it chops with ease. NO, it does NOT. Requires a LOT of force to chop onion, carrot, celery (not as bad as onion and carrot but still more than expected and more than video) - and that was AFTER I sliced the onion into 1/2-inch thick rounds and that carrot into 1/2-inch thick strips that were an inch or so wide. I have expected it to break any moment due to the amount of force needed - hence the reason I put 4 stars for the sturdiness of the product.",
        "I am probably on my 5th chopper :) If i wouldnt pound my potatoes in it the way I do I probably would still have my first one. I know its my fault breaking them haha. but i absolutely love this chopper its such a lifesaver being on a whole food plant based lifestyle. I love using it to chop all my veggies.",
        "I love this chopper for onions. I have purchaed several over the years for my 3 daughters and myself. I hate chopping onions. Two that I have purchased broke only because they were dropped hard on the floor or slammed hard on the counter by a 3 yr old grandkid, the clear plastic container broke. I have treated them pretty rough and they hold up surprisingly well considering you slam the top down to chop the onions.",
        "This is my second wizard. The first one broke at the back portion by the henge. In spit of the material being plastic I still love the wizard. It does a great job on onions and other vegetables, but it also does a tremendous job chopping pecans. I have tried many choppers for nuts but always have fine meal when I used the others, this does not leave meal. I get perfectly chopped nuts. The unit is easy to clean using the tool that comes with the wizard.",
        "This is our third Vidalia Chap Wizard. The first one lasted a year (reasonable considering it has a lot of plastic parts.) Our second one lasted about 9 months. The most recent one was purchased and received on January 7. The same piece broke on March 12. I contacted the company and they were going to send a replacement part. It never came. I've sent 4 more emails and they now ignore my request. So It is a great tool but the plastic knobs on the side break easily and apparently it is not warrantied. So purchase at your own risk. You may get a year's use out of it or maybe only 2 months.",
        "I received this last week, and right away cut up a couple of Vidalia onions. It words super well! I like onions a lot and right away ate a couple of spoonfuls of onions! I like to have onions diced or cut small to put into salads and this makes it really easy. They send a little fork like took for cleaning it and you need to use that to get the little bits of remaining onion out of the cutting grate, but the tool is well made and works perfectly. I have not yet tried it on other vegetables, but I will soon.",
        "I've bought 4 of these over the past 4 years. I keep buying them first of all because they work great. I make a lot of salsa and pico de gallo and you cannot beat the perfectly diced tomatoes, onions and peppers this gizmo produces. Based on that - this is a 5-star product ... easily. HOWEVER ... The cover attaches to the base via plastic hinge pins that are molded into the base. They break. After 10? 15? 30? uses the hinge pins always break, and the whole device is rendered useless. I keep buying them though, because they work great until they break.",
        "This is good for chopping with the large grid. But the small one? OMG, nightmare to clean the thing. I wanted some finely chopped veggies, and afterward I soaked it in hot water. Then tried a scrub brush. Then sat down with a toothpick to get the food out of the grate. Still didn’t get it all. I’m losing my mind! See my photos for how much food was stuck down in the grid, and there was still more in there I couldn’t dig out!",
        "I ordered this because a friend recommended it. The first one I bought arrived broken. The hinge on the back of the device was broken. The 2nd arrived just fine. I've used it numerous times with no problems. When my friend came to the house, I showed him mine. He said it is much cheaper made than the one he has. Of course, he got his years ago when things were meant to last. I'm babying this one hoping it won't break. It is cheap, thin plastic and seems like it would break very easily. The main part I'm worried about breaking is the hinges.",
        "It does a good job dicing and chopping onions, better than some models that cost 100s of dollars.",
        "This was actually a replacement for the one owned over 12 years. I was surprised to kind it in its original packaging/form and quality. It was an as seen on TV purchase I happened to love. when I damaged my original one accidentally I looked for a replacement and Amazon had it.. If you do a lot of cooking and chopping this is an excellent addition to your Food Processor and other kitchen aids.",
        "I’ve been using one of these for many years now. Mine got lost in a move and Amazon had what I needed at a fair price. I love using this for my potato salad because each piece comes out perfect. Great for my potatoes O’Brien also. My last one lasted over 10 years and would still be going strong.",
        "Look I haven't used this much but I bought it for mom. As a matter of fact I bought 2 at once. That tells ya a lil bit. I dont buy 2 of anything at once on the first try but this came and still comes so highly recommended by my mom that I had to stop and leave a review. The sturdiness and dependability of this thing are legendary in my house. My mom is a caterer and has tried 12s of different choppers and her absolute go-to when one breaks is this guy right here. Great product. Keep up the good work.",
        "I am using it for few years and I like it, but usually lasts about one year. Five months later: it broke, because it brakes very easily, and Amazon isn't going to replace it. Previously I bought it from Bed,Beth and Beyond. As soon as you brake it, take it back, and you get free replacement during one year. It doesn't last very long before you brake it! My advice to all byers: \"Do not bye it from Amazon!!!!!!!!!!!!!!!! Bye it from any store and replace it for free during one year of purchase¡!!!!!!!!!!!!!!!!!! Keep the receipt!!!!!!!!!!!!!!!!!\" Use coupons to make it cheaper. Amazon will not do the same for you!!!!!!!!!!!\"",
        "My wife asked me to order this product. Frankly we have had many choppers in the past so I was skeptical. So I was happy to find that this one really works. Chops veggies easily and effectively. It's really pretty safe to use and cleans up pretty easy as well. It is a little noisy - but most are. I liked it so much we sent one to my 5 year old grandaughter.",
        "I have bought several of theses gave away several for gifts and broke several. the plastic hinge breaks real easy always hold the back of it when you are using it and use smaller amounts. over all I keep 2 at my house just in case one breaks.I even have a friend who has a restaurant that I have introduced to this item they love it . this saves so much time in the kitchen.",
        "I have had my Chop wizard since June of 2015. I use it weekly to chop vegetables and/or potatoes. It doesn't work for tomatoes :( but everything else goes right through. My unit DOES have the logo on the white piece so I'm not sure if 2 yrs later they have a different manufacturer but I couldn't love mine more. Only issue I have had was misplacing the little cleaning tool, it's been a month and I just can handle cleaning it with toothpicks anymore so I came back to order a new tool. Serious time saver for me!",
        "Super handy. Has 2 different size blades. Difficult to clean, even with the little comb provided. Hand can start to hurt using this after while. Have to replace about once a year. Wish it was a tad cheaper since I need a new one so often. BUT-very useful, easy to store, simple design, and effective kitchen tool.",
        "I sent this back because it didn’t chop as small as I would have liked for some things, and required me to cut things anyway, so I figured I’d save my money, but in fairness, it was and came exactly as advertised and seemed to be a sturdy, easy to clean, little mechanism. The return went well and fast, except for the little burn I got from the post office. Ended up costing me more money to return because I thought the $5.99 return label from Amazon was expensive- but the post office charged me about $10 to ship it... just a FYI- the return label is probably cheaper in most cases.",
        "I love the product- saves time and the ends of my fingers... but I am now on my third one. The first one's catcher container shattered at the footing after about a year. The blades bent within 6 months of my 2nd. I do wish the catcher was deep enough to take potatoes lengthwise. Something about stubby fries isn't quite right. Givren the pricepoint, though, I will continue to buy replacements",
        "i like that this makes my veggies a uniform size and it's easy to use. the two different sizes are nice and i find the container helpful for measuring how much i've chopped. i wish the grid was easier to clean, onions especially get stuck around every corner and take a lot of scrubbing to loosen. this is still worth the money and effort for how much time it saves me during prep.",
        "I don’t know what my sister did but after owning this marvel for ‘bout ten years, she broke it. The hinges on the lid broke off. I’m so happy to have found a replacement. Saves hours of chopping. The smaller grate makes a great olive tapenade. Imagine dicing hundreds of little olives! I’m a kitchen gadget hound and this is in my top tier of priceless helpful kitchen tools. The little cleaning tools slides caught food with a quick cross-cross motion under running water and the measuring markers on the side are very helpful.",
        "This handy dandy device is a GAME CHANGER! Onions are no longer any match for me, and I can prepare soup in a snap. One of my favorite dishes is ratatouille, but I hate all the prep work. Armed with my Chop Wizard, I cut all the veggies in under 10 minutes--I timed it! A side benefit is how cathartic it is smacking down the arm onto the veggies, especially after a long day at work. Clean up is really easy too. I love this so much, I got one for my sister and my step-daughter. I have plans to purchase at least 3 more for Christmas gifts!",
        "This is my third Vidalia Chop Wizard. I like that you can chop in two sizes and it worked wonderfully. The only negative thing is that it is made of plastic. Eventually the plastic knob that it hedges on will break off. I have tried other brands , but they not as good as the Vidalia Chop Wizard.",
        "This is the best chopper!! Onions, tomato, cucumber, mushrooms, zucchini!! I use it everyday! And its easy to use - my 13 year old has no problem using it! She makes the chopped tomato, cucumber, onion salad by herself! Highly recommend!",
        "I’ve had an Vidalia chop wizard which lasted me about 1 year of use before a hinge Broke off. I’ve purchased another chopper that holds more material & claimed to be 200% stronger than other choppers... , blades bent and damaged during 2nd time use while chopping thin ,small sliced carrots for soup, wife liked the Vidalia much better so we repurchased another Vidalia.",
        "I use this chopper for everything for making salsa! From the onions, tomatoes, and peppers. Then I turn around and use it for everything that goes into my omelets! Making egg or tuna salad? There again! This is the best chopper out there! I have given them to family and friends so they have them on hand as well! The cleaning comb is the best for getting into the grid and getting the small food particles out! Love this chopper!",
        "I had a manual pull chopper before and it lasted for around 6-7 years. Recently it broke so I ordered this one. The product does not do the job well. The plastic chipped off while chopping onions. The blades are not sharp enough and I had to apply lot of force to press the flap down to chop.",
        "Chopping onions into \"dice onions\" can be dangerous..especially when you are in a hurry...Vidalia Wizard is without a doubt..The Best\"...no fuss...no mess...just push on the cover...presto...you have perfect - yes perfect diced onions or whatever veggie you want diced..PS..Also is great when you want to cube cheese. If you don't have one of these.. shame on you...slpPalmBeach",
        "This is great for dicing vegetables. There are 2 separate grids whether you nice small or medium dices. Everything is well constructed except the pivot point which is weak and always breaks first. Other than that, it's a great tool but we keep buying replacement units.",
        "I personally dislike this chopper. It is hard to clean the lid. Vidalia Chop Wizard comes with a small bear claw to clean it, but it doesn't clean. So, I always had to use a toothpick to clean. Vidalia Chop Wizard is very useful if you want perfect dice of anything you want to chop. I used this only three times. It takes too much of my time. So, I ended up buying Kuhn Rikon Swiss Pull Chop with my mother's suggestion. It does chopp really fast, yet it doesn't have a perfect dice shape. It saves so much of chopping time. I love Kuhn Rikon Swiss Pull Chop. I suggest this one over Vidalia Chop Wizard.",
        "I’m a gadget lover, but I’m usually pretty disappointed about the cleanup or some function of most gadgets. They usually take up too much room in the cabinet and aren’t really worth what I bought them for. This one, however, is different. I absolutely love it and use it nearly every night when I make a salad.",
        "I used this chopper at my sisters home this summer, while making toppings for homemade pizza, and fell in love with it. I came home and ordered one for myself and have not regretted it. It chops things so smoothly and easily. I did purchase the lift cleaning tabs which are great for easy cleaning of the chopper. Would definitely recommend this product.",
        "This chopper with blow your mind. It is easy to use, very safe and it gives you a choice of sizes. It chops really easy with a quick slap of your hand. The trick is not to overload the grid with veggies etc. it falls into the container and you then empty it into a pan or bowl. Quick clean up too, put right in the dishwasher.",
        "My wife loves this thing. She uses it all the time when she cooks. This is the 3rd one we have bought. The first I dropped and broke, the second one she dropped and broke. Hopefully the 3rd times the charm. Please do not think that the cutter's materials are shoddy, the first 2 broke due to mishandling, not craftmanship.",
        "I’ve owned a Vidalia chip wizard for years. Since the first year they came out on as an as seen on tv product. I purchased a new one not because of any defect from my original but because I ended up giving the original to a friend who really wanted/needed one. I use it for potatoes onions and tomatoes when making anything! I haven’t hand chopped a veggie in years!",
        "I love this thing! In fact, I love it so much that I ordered another one last night to give to my daughter. I chopped onion, green pepper and tomato the other night in record time. It seems sturdy and well made and I like that all parts can go in the dishwasher. My only regret is that I didn't purchase this item years ago.",
        "I seriously don't now how I lived without this. It's my go-to for chopping EVERYTHING. So easy to use and I love that the food is all the same size. I did break the lid easily and replaced it already, I pushed pretty hard on the food and didn't realize the lid was not set exactly right on the side pegs that hold it in place. I wasn't happy it broke so easily but I love this so much I just bought another.",
        "I purchased my first Videlia Chop Wizard years ago and cannot cook without one. Many dishes require dicing vegetables or fruit, and the Chop Wizard does a wonderful job. I always have two at the same time. They are such a help, are easy to clean with the cleaning tool that comes with them, and are safe and sanitary.",
        "I use this ALL THE TIME! It's a huge time saver! I even use just the green \"chop blade\" to cut longer cucumber \"stix\" for my kids to eat with ranch dip, and my husband had used it for cutting potatoes for fresh cut fries. Would be great if the catch bin/container was a bit deeper, but we make it work and love it. I actually had to buy a second one because I dropped the container once when washing and it broke and I couldn't \"live without it\" after having it!",
        "This Does well for onions, but thats the extent of it. I used the large cutting blade 3 times before it became so dull that it would not cut anymore. My sweet potato got stuck in it, and I had to throw it away. I sent photos and an email to the manufacturer and they replied with a link for me to buy a replacement. (About half the cost of a whole new unit). Therefore, terrible customer service, terrible longevity of the product, and overall do not recommend.",
        "I really loved this at first. It does make perfect little cuts on onions, cucumbers and such. However, mine broke at the hinges while chopping celery. It can be pretty hard to clean out the pieces of celery from the cutting blade. I wish the hinge part was sturdier. And, unless you put a really small piece of food in there, it can be quite hard to close.",
        "Whoever designed this deserves an award. I've chopped apples, onions, tomatoes, bell peppers, zucchini, avocado, and even mushrooms in this. This is my surefire way to reduce prep time. I like both grates; one for larger cubes and a smaller one that's perfect for diced onions and tomatoes. It's built to last. When I say built to last...I mean sometimes I have to put some back into it - if you know what I mean - to break through tougher skins. And it holds up to my abuse! It's pretty easy to clean for the most part, but some skins (like bell peppers) take a bit more coaxing out with the handy little scraper tool that comes with it.",
        "I can chop onions!! Oh my gosh this makes my life so much easier. I'm short so having the leverage was an adjustment, I just learned to put in smaller chunks. My only complaint is the lid occasionally tries to pull out the insert when I pull up to put another chunk in and gets stuck. Butter knife does the trick to hold the insert and lift the lid. Doesn't work on cheese fyi, made a horrible mess lol.",
        "This is my second time purchasing this product. My first one lasted for four years until the hinge broke off. The smaller grid that I use 9/10 times was starting to get misshapen and I’d lost the fork to clean it, so it was time to replace. Definitely keep up with the cleaning fork thingie!!!! It is a pain to get clean without it. Love this kitchen tool",
        "This is our household's second chopper of this type; the first one simply wore out from excessive use. With the canning/preserving/dehydrating season approached we decided that we needed another chopper/slicer/shredder. We've 3 or 4 Food Processours but our opinion was they took too much time. The VC Wizard arrived in quick time from Amazon just as we were given 1/2 Bushel Cayenne Peppers to pickle. The Wizard proved another winner & our \"chore\" was completed quickly leaving the kitchen smelling of Hot Peppers for the remainder of the day. We've not seen a miserly Mosquito since!",
        "Awesome product! We have been using the Vidalia Chop Wizard for nearly 10 years! It's very durable and capable of chopping just about every type of vegetable known. I find it especially helpful when making salsa. You can chop jalapenos and chili peppers without having to worry about the oils irritating your skin. It's super easy and super fast! My only complaint is that the lid cleaning tool does start to wear out after a few years.",
        "I wished I had bought these sooner! Works great and cuts my prep time in half if not more! Now I don’t have to dread cooking foods that require chopping. Also the tool for cleaning it helps! I used it to get touch leper’s stuck on the top part of the chopper!",
        "A friend recommended this to me and it did NOT disappoint. I’ve used it a lot in the past weeks since I purchased and I still love it. It’s saved me loads of time and annoyance in the kitchen. Salad chopping is my favorite use - tomatoes, eggs, onions and more. And I’ve also used it for getting potatoes cubed for breakfast. It’s also super easy to take apart and clean, which gives it a leg up to other choppers. Highly recommended!",
        "Don't waste your money. This is garbage. It wouldn't chop a red onion no matter what. My wife injured her ribs because she pushed so hard, and still couldn't chop half an onion. It cost us a trip to the doctor and that really made it a bad deal. I'm 6'4\" and I couldn't get it to chop half an onion. DON'T BUY THIS",
        "The base of this item is hard plastic and it does not stand up to normal use. I loved the way it chopped the veggies but it is not made to last. I would not recommend this for someone wanting to chop anything hard like carrots or sweet potatoes - it will just break apart. I only used it for making pico and it broke apart just chopping onions and tomatoes.",
        "I love this product!! I honestly do not see how you would run a household that frequently prepares meals at home without one! We have had one for probably 6-7 years. My daughters friend was helping cook and accidentally broke our last one so I ordered another-actually 2. One for us and one for a family member for Christmas. I literally use this chopper daily. I am able to make fresh soups, salads...anything really that requires chopping. It comes with 2 different chop blades, is very easy to use and makes preparing our meals so much easier, quicker and safer.",
        "This thing works excellent. Cuts veggies very nicely for Pico, stir fry etc... This is my second unit. The first one broke at the hinge area, where it seems to be the weakest point, so I had to purchase another unit. However, I do like to use it as it cuts veggies fruits etc.. perfectly and very fast.",
        "In theory, I like this chopper. Cleaning it? I hate it... accidentally slice fingers. Spray with PAM before use for easy clean up. If you want to do whole potatoes into cubes: microwave them for a minute or two and place ON ANGLE in chopper (not straight up and down). Best use: doing a bunch of different chopping at one time. Good quality of plastic and sharp blades.",
        "This is one of the top five items ever purchased! I have a very large vegetable garden and can/dehydrate harvests for winter use. The chop wizard is so much better than electric food processors which seem to puree everything way too easily. I can my own salsa, and wish I'd bought this item YEARS ago. Breakfast hash browns are a breeze; use it for tear-less onion dicing, chop peppers fast and easy. It holds quite a bit, and I love the no-danger-to-hands-and-fingers design. Anyone who's used a mandolin slicer knows what I mean. I've used the heck out of the chop wizard for over a year and may buy another just to have on hand.",
        "We have used one for a long time, and love it. Tried another brand we saw in a kitchen store at twice the price. We had bought it for our son, used it for preparing one dinner while we were together. Ended up returning it the next day. So bought this one for him because this one works great.",
        "I had already bought one, and bought another one for my aunt. She saw mine, loved it and so I ordered her one. It’s so easy to chop onions, Bell peppers, pickles, and boiled eggs for a potato salad, or anything for that matter. Don’t lose the little white cleaner it comes with. That is a must.",
        "Seriously buy this! It saves me a lot of time as a busy mom. I always like adding a lot of vegetables to our meals and this makes the work take half as long. I don’t use it if I’m going to just chop one or two things because the clean up takes longer than it does to clean a knife...but when I’m chopping large amounts it’s totally worth it.",
        "I hate to cut up onions. I was canning chili sauce and had to cut up 8 onions and 6 peppers. This little gadget was the perfect thing for this project. It cut them in even chunks and made the job go sooo much faster. Not to mention that I got it in less than 24 hours which was a bonus!",
        "Great onion chopper, no more tears! So easy to use, I’m happy I bought this brand! And dishwasher safe, top rack only. You’ll never talk me into another brand! I really do highly recommend this chopper! Buy it, buy it, buy it! I think you’re gonna love it as much as I do.",
        "I really enjoyed using this chopper ... three times. the third time the plastic by one of the hinges snapped while I was chopping small pieces of veggies, not even a big piece. USE: It is quite practical to use. it's better to slice the veggies a few times with a knife so you can chop them without much pressure. CLEANING: It takes a moment to clean it; the cleaning tool included is definitely helpful but you still need to spend some time to get it perfectly clean. DURABILITY: not good. UPDATE: customer care completely unresponsive. AVOID",
        "this is the third one i've had of these and i use it at least twice a week!! i'd love to give it five stars but i need it to last longer. the little knobs on the clear part break after a while. wish we could just order that because now i have lots of parts for this each time i order i have more and more. grrr. ordering another one from another company this time to see if it will last longer.",
        "I have been using the same brand for the past 7 years or so. Their plastic quality has decreased steadily and it is not at a point where every time I use it I feel like the plastic is going to break - it is cheap sounding and very brittle. I have to chop the veggies extra fine so that there is not much pressure on the device. Despite of that it takes a lot of force and I have no doubt that this will break soon. DO NOT BUY THIS! If the management of this company is reading this review, please know that your customers are seeing your cheap tactics to increase margins and profitability. Bad business practice!",
        "Using this is so easy. Cleaning it up is a little tedious but not difficult per say. The sturdiness was my only real reservations. I used it to cut up vegetables and fruits. It worked great but I had issues with the sturdiness when attempting to cut up some frozen fruit that wasn’t fully thawed. While I was able to manually cut with a knife the blades on the chopper disappointed and bent.",
        "Works great for chopping medium and small size pieces. I chop a whole bag of Costco onions and put them spread out on a cookie sheet and in the freezer. Bagged, they are ready to use. These are the safest and easiest to use. I have only used on onions so far.",
        "I LOVE this product!!! It is easy to use, it comes with a scraper to help clean out the onion or pepper skin that may be left in the ridges after rinsing it. My kids are able to use it also. I love that there are 2 sizes and the veggies we chop come out in perfect cubes. We tried onions and bell peppers first. It would make it very easy to make a nice looking salsa!",
        "This was my first time with a chopper and loved it. Then diceing a small onion that was also cut into 3 pieces the base cracked and broke. Haven't contacted the sellers yet so stars will go up or down depending on response and if I get another how.long it lasts.",
        "I have used this chopper for years and I wouldn't want to cook without it, I cook from scratch whenever possible so I use this chopper to do so many different things. I just ordered this one because after using this chopper for years and years I like to have an extra one on hand just for my own security.",
        "These are awesome. This is my second one in five years. I would have had the first one to this day had my dog not got hold of the first one.My error. These are sturdy however and they stay sharp. The cleaning tool makes for effortless cleaning if you clean after each use. This one actually has two top trays with one for fine dicing and one for a bit bigger chop. If you are in a home kitchen , cooking for yourself this is a must have . Five stars.",
        "I bought this cutter around a year back. I loved it for few months because I like cooking everyday after going back from work and this made chopping veggies like carrots, capsicums, onions, tomatoes, etc quick and easy (now I have fewer cuts on my fingers :)). The reason I gave only 4 stars is that I felt the blades and the transperant bottom container were not strong enough. One of the blades in the smaller mesh was broken white chopping onions, this was about 8 months after I bought it. Nevertheless, I would recommend Vidalia chop wizard as it worked great for the price. But becareful while using it, do not put too much pressure on the cutter.",
        "I saw this product on a commercial and thought it was a great product and idea. I bought it and very happy used to cut some onions. (At the time cutting we noticed you need much force to cut , not as easy as on seen on tv) Well when we were eating my husband took some plastic pieces of his mouth (thankfully he didn't swallow those) and we were wondering where did it came from. So the other week I was cutting onions with this product and thankfully we found out that it was the chop wizard that was shredding the plastic.",
        "This cutter is awesome! I bought my first one after I watched a demonstration on TV. I love it so much! I bought another for my friends birthday and she loves it. If you want To cut up vegetables fast, you need this chopper!",
        "I bought this as a gift for someone. I have one of my own that works fine. This one must have been made wrong or something. Every time my sister in law used it it left little plastic pieces in her food and she had so keep picking them out. I could not return this item as it has been longer than 30 days. I bought it in advance of a birthday and she didn’t open it out use it until recently. Did not know it was defective. If you like plastic pieces in your food then get this. If not I wouldn’t buy it.",
        "Easy to use and easy to clean! If you hate chopping up foods for whatever dishes you need things chopped up, here is your answer! Two blade sizes and a handy plastic fork for easy cleaning. Dish washer safe! I have bought several of them. A couple for me and several for friends of mine. Stores easily in a drawer! Get yours today! You will not regret your purchase!",
        "I bought this chopper to make a fruit salsa. The person who posted the recipe stated this was what she used. It worked great on the strawberries, kiwi and apples. It was easy to clean. Recently I was making soup that called for chopped carrots. I used the wizard's small blade. When I put 3 baby carrots on it and tried to chop it was hard to press down. The second time I only put 2 baby carrots and it worked perfectly. I also liked that I could turn it up to see how much I had chopped. I'm very happy with this purchase and going to order my daughter one as she chops lots of veggies.",
        "I keep breaking the bases. I love love love this thing! Great for chopping veggies for chili tacos and much more. I was going to buy my third one but after breaking two bases Im going to try another brand. In its defense, I use mine constantly.",
        "This chopper exceeded my expectations. It makes very short work of chopping and dicing vegetables and the cleaning tool included makes cleanup a breeze. This would make a nice gift for anyone who likes to cook but doesn’t have a lot of time.",
        "Great tool to add to kitchen! Big time saver for chopping fruits & veggies. Especially great for onions! I love it so much I’ve purchased several for gifts. Everyone should have one. A bit inconvenient to clean grate but cleans easily with tool provided.",
        "My girlfriend cooks a lot! so I bought her one and she loves it. (I love mine too,, cuts my stuff in less than half the time!) She does a lot of vewggies so this has come in handy for her larger family! I would recommend! Jn",
        "I have bought this same one twice. My first on I broke by accident when dropped many yrs ago. I bought a different one with all kinds if other attachments that I never used and was not as sturdy. I gave it away and bought this one again.",
        "I bought my first Vidalia Chop several years ago. It has been well used and abused and only just recently broke (at the pivot point). honestly, my fault - was trying to manhandled a vegetable bigger than I should have put in. After doing research on others that were out there, and reading their reviews, I decided to just re-order this one. The first one lasted for years, the blades stayed sharp, the measurements on the side extremely useful. I didn't see a need to switch to a different brand that only had so-so ratings. If you want a simple chopper/dicer that will handle a lot of abuse - this one will do the job and for quite a while.",
        "I had already bought products similar to this one and they would always break or get stuck in the rods and cut and with this I have been using it continuously for more than a year and nothing has happened to it, it is very easy to use and clean. excellent product I recommend it a lot",
        "Worked great at first but broke after 6 months of light occasional use. Blades became dull, so took more force to chop the onions, even in small sections. Plastic cracked. Super glued it, didn't hold. Bummer.",
        "I have had 2 of these, the first one broke after using it quite a bit for 8 months. Two of the base feet simply broke off and splintered the plastic bottom. The second one lasted over a year, this time a hinge on the side broke. When this product worked, it is amazing, they just don't last. Too bad they can't make them better.",
        "This is a must have for every kitchen!!! This thing is awesome! Chops easily and perfectly... Onion, celery, peppers everything! I love it. This is the best one to buy. All the others I have tried have fallen apart, this one seems to be the best quality and even after I had my other one for a few years and dropped it several times it did not break! I searched everywhere for this replacement for a friend and it was well worth it! She says she likes to cook again because of it!",
        "I love my Chop wizard, and have purchased one for all my family members. Great for potatoes, onions, carrots, celery, peppers, etc. Make sure the food is positioned properly before closing the lid, as this is what will distort the chopping blades. Then over pushing (man handling) will also cause distortion. Yes, I have have broken one, but for the cost, I got plenty of good use out of it, before purchasing a second one.",
        "I purchased this product many years ago - and am THRILLED with it!! When my daughter in law was enjoying a finely diced salad in my home last week she commented that I must be loaded with patience to spend the time cutting and dicing my vegetables so small. So I showed her my secret - and she was fascinated. So I bought one for her and another to give to her mother...",
        "I have terrible chronic cuts on my fingers all the time. Handling knives and fruits and veggies is difficult! This chopper helps me immensely! I love it. Made well and easy to use and easy to clean",
        "I've bought three of these over the years for my mom and all three have broken. The hinge on the plastic base gives out after several uses. The older ones at least lasted a while. This most recent one, I bought in March of 2016. By April, it was kaput. I don't understand why the Chinese are utterly incapable of making ANYTHING that lasts.",
        "I use daily to chop garlic, ginger, onion, bell pepper, mushrooms, carrots, celery, anaheim peppers. I do not use it for sweet potatoes or squashes because I think those would break this gadget. It takes 5 minutes to clean all the stuck on bits out.",
        "This is a great little machine. I wish it were designed a little better. The feet on the bottom make pressure points and you have to be careful. I bought one and first use it broke. But I bought another one and it has been holding up well."
    ]
}