{
    "entity": "Choppers",
    "text": [
        "I did not buy this for me, I don't cook! My wife saw something similar on some cooking show, mentioned she would like to have one and being the incredible husband that I am, I bought this. It was the right move! She has raved about ever since, lots of brownie point on this one. She is constantly calling me to the kitchen to show me what she can do with. \"Honey look, see how I can do this!\" I say \"hey thats great\", even though I don't have a clue what she's doing. Do yourself a favor guys, if your significant other cooks, get them one of these.",
        "This is a great board scraper. It can double as a \"chopper\", it's not sharp enough that I (personally) would ever call it a knife, but it could definitely do a better job than basic tearing of veggies or something. This is exactly what I was looking for and does the job swimmingly.",
        "I thought I buying one of these that had the little shelf to pick up whatever was cut. This one has a straight flat blade and is not as easy to pick things up. Also the handle is too plump and hard to hold.",
        "I would never use this for chopping, so ignore that part of the item's description. However, a bench scrapper is the kind of tool you don't appreciate in the kitchen until you own it. Several uses (cleaning up flour, lifting dough, picking up chopped veggies, etc.). This metal version is probably going to scratch your counter if it is a material that can be scratched, so watch out. However, if you use your kitchen there's probably lots of scratches in it! They make a plastic version that I find less worrisome on this front, but the plastic version lacks the flex that the metal version has.",
        "Cuts, scrapes, feels steady and comfortable in the hand, built to last a lifetime, what's not to love?",
        "Such good quality! It has a little weight to it so it feels good in your hand. Definitely a good kitchen tool for cooking and baking.",
        "Accidentally dropped it in my stainless steel skillet while it was ripping hot making smash burgers. Was worried I was going to have to take a break to clean melted plastic out of the pan and toss the patty that was in the pan, but to my surprise the handle didn't melt at all. It's sturdy and apparently also heat resistant!",
        "A fabulous tool! I use it for so many things that I wonder how I got by without it. Great for cutting through bread dough and scraping a breadboard, but also chops veggies and scoops them up.",
        "I make a lot of soups that have chopped or diced vegetables. This is perfect for transferring to a bowl or pot for cooking. A new favorite tool in the kitchen.",
        "Whether at work or at home, I can't live without at least one scraper in my kitchen. I absolutely love the versatility of a good scraper and this one is awesome. I am a private chef for a fraternity and this is in use every single day at work. It chops, scraps and works great at transferring food from cutting block to pan or pot. I think everybody needs one of these when they are cooking.",
        "Works well on hard veggies (celery, onions, carrots); breaks more than chop/cut. Makes mush of tomatoes. Good for scaping cutting board.",
        "I got this to help me make bread but I've found myself using it all the time when cooking! It makes scooping ingredients into a pan super simple and it takes only a second or two. The rubberized grip makes it feel expensive and high-quality despite it only being a few bucks. Definitely recommend!",
        "Affordable , easy to handling , cut everything perfect even meats , the best gadget in any kitchen !!",
        "This has so many great uses! Our family is bar crazy and they cut even the toughest bars easily. I love the ruler marks on it to keep the bars uniform size. I also use as bench scraper when making bread, use it to gather finely chopped items and move to the pot, etc. Just a really great kitchen tool to have on hand. Highly recommend. I especially like that the edges are straight, unlike many which curve in at the bottom. Can cut all the way to the edge of a pan.",
        "Bought this to cut my homemade caramels and it works great.",
        "We use this a lot to deal with dough and it works just great. A valued asset in our kitchen.",
        "Comfortable to hold and the measurement on the edge is handy",
        "Easy to use and scrape the cutting board with. Also handy for measuring dough. Not used to chop with yet",
        "Can’t work without it.. wish I had ordered a long time ago",
        "Awesome product, easily divides dough, great for shaping, lifting, etc. so glad I bought this",
        "I use this every week when I am making things like bread and pasta. It works really well for everything I need it for with that.",
        "This chopper, scrapper, cutter gadget is an indispensable addition to my baking tools. It cuts through dough with surgical precision and clean-up is a breeze. Caution: the edge is sharp! I wish that it came with a blade protector for when it is stowed in the drawer.",
        "These things are amazing, I don’t know how I ever lived without them. They’ll be in all my Christmas stockings this year.",
        "Love love love! I use it all the time for bread, pastries and desserts as an Exec Pastry Chef over a fine dining + business casual restaurant and catering company. I bought them for my staff and they all love them as well!",
        "Good scraper. I don't use it as much as I thought I would but that just may be because I'm a kitchen tool addict :) It's not actually sharp enough to cut herbs, and I don't chop much with it, but it's a great size to scoop up anything you can think of on your chopping board. Very comfortable grip, easy to clean, and good weight.",
        "Love this. It cuts, scoops and scrapes. Very handy and my new favorite kitchen tool. Great idea for a cook's Christmas gift.",
        "I bought this for my husband who is the cook of the family. He said it works well for chopping up vegetables and herbs and scooping them in to the pan rather than having to carry a heavy cutting board over to the stove.",
        "Every kitchen should have one.. It is one of those utensils that make you wonder why no one else thought of it..",
        "The grip is great. I use it for creating crisp corners on my cakes. Careful when your washing it, it is sharp.",
        "Nice scraper...one side is beveled to prevent damage to underlying counter. Seems well made and should hold up to a lifetime of use. Ruler is only printed...not etched.",
        "I had one and bought for a gift. It is a great kitchen tool. Recepient thinks so also. I use to clean up board after cutting and chopping. Have not used for a chopping tool..yet. My real use is clean up.",
        "This thing is too cool! really. the bottom can chop things like onions and what not with no problem. them scoop thin up easily. the rubber grip is very comfy. I really appreciate the fact that metal is very thick and well made. not at all flimsy. will last forever.! great buy!!",
        "I use this tool constantly as a bench scraper for baking bread and it is terrific, allowing me to handle much higher moisture-content dough without leaving half of it on the work surface. And it is multifunctional, too! Great value. Easy to use; comfortable in hand.",
        "I love it. I use it to scoop or scrape veggies or other small things into my pot while cooking. It is sturdy, durable and easy to clean.",
        "This chopper is extrememly sharp. Uses include rough chopping herbs but mostly as a scraper to transfer chopped foods into bowls or pans. does a nice job at all. The handle grip is very nice too. Right sized and non slip even with your hands wet.",
        "I use this tool on a daily basis. Very handy when making salads, slicing cheese, etc. Just note that hand washing is recommended-my experience has been that dishwasher detergent can cause rusting of the metal blade.",
        "My mom had been asking for one of these choppers since she used one of them at church. I liked this version because of the nice grip that it has. She says that it feels really nice in her hands and it has a good weight.",
        "I had one of these years ago but the handle split and broke off, probably from overuse! I had to replace it because I use it constantly. This new one has measurements on the scraper blade, which is a great useful addition. Very useful product.",
        "Love this product! So great for cleaning off the counter with ease after baking!",
        "Once you start using this, if you haven't used one before, you will appreciate all the things you can use this for. I use it in cake decorating, cooking as well as other things.",
        "Doesn't have a sharp edge so I wouldn't consider it a chopper but it sure works for scraping.",
        "This has a nice sharp edge (not sharp enough to cut you) and a comfortable grip. I sue this to scrap pie crust, veggies from the cutting board and semi-soft items (like butter, cream cheese, etc). I do not use it to chop anything.",
        "Exactly what I wanted at a great price. Fast delivery",
        "I bought on last year and it got a knick in it so I bought this one. It's a staple in bread making! LOVE IT!",
        "I've used this chopper to chop veggies for omelets, cut dough, and even as a spatula when cooking. The chopper is sturdy and the grip feels natural allowing you to focus on the food. The measurements aren't used often but they are helpful when you want your dough portions to be similar.",
        "this chopper is easy to use, chops things perfectly. after you are done you can scrap the choppings neatly into the dish you are preparing",
        "Great product. I'm not sure what people are complaining about sharp corners for. While there are, in fact, corners I haven't been hurt by these... yet",
        "Works great as a chopper and as a scraper! The metal portion is not flimsy - it's sharp enough to cut some raw vegetables as well as dough. The gripped handle and the measuring guide along the bottom has come in handy more than once.",
        "Love it!! I can't believe I went this long without one. I use it when making bread. The dough doesn't stick and cuts through the dough super easily. Worth every penny.",
        "This scraper is awesome. It makes picking up chopped veggies a breeze. No matter how finely chopped the veggies are, you can pick up every last morsel with ease using this little wonder!",
        "Excellent buy! Fits in your hand well, Easy to use. Definitely will recommend this product.",
        "A great quality chopper/scraper however I experienced a finger cut when I used it the first time due to the razor sharp corner ends. I then took a file and rounded the corners and is working fine now, no more finger cuts.",
        "Love this handle and ease of cutting - blade isn't very sharp but worked great on an apple!! If you're cutting very thick things this isn't for that but perfect for chopping small veggies!",
        "I like that it cuts dough really well. It has measurement too!",
        "This chopper-scraper is more durable that I expected. This item was delivered in timely manor and was as described. Very happy customer with this purchase! Would recommend this seller.",
        "It's a chopper--nothing not to like or dislike. It is sharper than I expected, so I do not use it scrape my wood pasty board.",
        "The end is pretty sharp... works like a scraper should.",
        "I had a cheaper one before, but this one is so much nicer, and the ruler on the edge comes in handy for even cuts.",
        "This items is a great help. It allows me to measure, score and cut. I also use it to scrape what I'm cutting into the bowl instead of using my hands.",
        "ONCE I LEARNED HOW TO USE IT I LOVE IT. BE CAREFUL AND ENJOY. DOLLYE THANK YOU.",
        "I love this I use this at least once a week while cooking. Makes picking up diced veggies an easy task.",
        "I've purchased this for the woman in my work café. I've not heard anything but praise from the woman, they love this scraper/chopper.",
        "Wonderful product Easy to handle and very useful for many things",
        "and a comfortable handle, even for man-sized hands. Scooping up the chopped pieces makes quick work of almost any task.",
        "Sturdy and very useful for cleaning up my cutting board of chopped veggies",
        "It’s a scraper thingy what more do you need to know",
        "Works great. I had to sharpen it once to do the chopping, but other than that it's been handy!",
        "Looks great, works great, and priced right. Nice handle makes it easy to use. Had it a while. Great kitchen tool. I use it frequently.",
        "Very high quality, I am totally satisfied with my purchase. would definately recommend for anyone :-) dishwasher safe also :-)",
        "Love this chopper is verry well built long lasting and is verry sharp and Attractive this is a must have for any kitchen ..",
        "Great everyday food pusher. the ruler marks can be used for cuttng the right size of dough or pastry for my nest project.",
        "I do use this a lot. the measure on it is handy also.",
        "cuts dough very good,glad i order it makes things easier",
        "This scraper was well priced and is used whenever cutting a variety of foods. Handling and Clean up is easy.",
        "This is a great board scraper and chopper. The quality feels good and it is easy to clean.",
        "I use this chopper scrapper for everything from making bread to transferring veggies to the stew pot. The ruler on it has also come in handy more than once. LOVE IT!!!",
        "I kept saying I wanted to get one of these & just kept putting it off! I finally broke down & just ordered it, and am very pleased with it!",
        "this is a nice bench scraper that can be used in many ways. The grip is comfortable and easy to hold.T",
        "I bought this to use more as a scraper than a chopper. Has just enough flexibility without be to flexible.",
        "Like the rubber Grip on it , Fits my hand well . So glad I bought it ,Its Going to get used a lot .",
        "It.s very nice and easy to use!! I'm happy I bought it , it makes it easy to bring from the cutting board to the pot!!!",
        "I have seen these on kitchen shows and I wanted to try it. Not only does it chop, but scoops too so you don't need another knife. Would recommend.",
        "Has a sharp edge and a good gripping handle. . . . . . . . . . . .",
        "This order was 10 days late arriving after the date estimated by Amazon. Good quality and handy for scooping up piles of cut veges, working with dough and to scrape lean a work surface. The stamped on measurement ruler is handy when cutting to a specific size.",
        "perfect tool for scraping dough, chopping herbs, cutting my scones perfectly. Definitely recommend.",
        "What a useful tool, makes picking up your dough so easy",
        "Built well and feels good. I use it to transfer veggies and such to the pot not really for bread",
        "Gave this as a gift, it was well received. A decent product as far as I know. My dad liked it, he's an amateur chef.",
        "Nice Blade with good feel to the grip. These things are not rocket science but this one is exactly the quality I was looking for.",
        "We cut veggies and fruit every day. This one gives us an idea how much we have chopped. We use it to transfer them to our dish. Oh so easy to clean.",
        "This is great for chopping any large pieces that you missed with the knife. I don't know how long the edge will stay sharp so I wouldn't recommend using this as a primary tool for chopping or dicing. Picks up food well.",
        "I was looking for a bench scraper for my mom for Christmas and this one was perfect. It is a little bigger than the bench scrapers I am used to seeing in the restaurants (I am a chef), has a comfortable grip hold, and was the perfect product with the right price. It arrived on time and I am very pleased with it.",
        "Very durable scraper. My favorite use it to clean the granite counter tops of dried foods/spots. Excellent food chopper as well. I definitely would purchase again.",
        "Don't know how I survived without it, cutting up root vegetables is easy and its like the chefs on TV",
        "I really love this item, I use it to dice apples... My husband uses it all the time. Wonderful product",
        "Works awesom! How did I manage before without this chopper?",
        "Doesn't completely cut green onions. Does scrape and seems effective for most chopping. No instructions on how to care and maintain it.",
        "This is a high quality scraper that will last for years. However, your cutting board will not: this scraper has sharp corners. It scrapes into the cutting board making long gouges. This one is being returned. My commercial scraper has rounded corners and was $3.",
        "Stated on site as made in Taiwan however made in Red China.",
        "returned. It looked like it was used, had scratches and the packaging was open. It was supposed to be new"
    ]
}