{
    "entity": "Bar Tools & Drinkware",
    "text": [
        "Works well but only for narrow bottles. Much of the white wine produced in our area is bottled in pinot noir style bottles, and they will only fit in this cooler if you shove it in forcefully. Gave it to friends as a gift and was embarrassed when they had to fight to get the bottle in and out of it.",
        "I got this for my wife to use in our winter home in Arizona and in the trailer. SHE LOVES IT! She likes her red wine at about 54 degrees. If she leaves it out. it is too warm. If she puts it in the refrigerator, it is too cold. This little wine cooler solves the problem. You can leave wine out at room temperature and, 5 minutes before you want a glass, put the bottle in the wine cooler. The wine is now at a perfect temperature. When you are done, you twist the bottom, remove the liner, put it in the freezer and let it cool down again. I wouldn't hesitate to recommend this product wholeheartedly.",
        "I seldom write a review on Amazon but I feel compelled to say that this product is absolutely fantastic. I've had mine for 7 years, and it's still working like the day I purchased it. Not only will it bring down the temperature of red wine from room temp to proper serving temperature, but I've found that it actually brings down the temperature of pre-chilled whites to almost freezing! There's sometimes ice crystals on the outside of the bottle. I ended up buying two of these for times when I entertain guests. Can't recommend this highly enough.",
        "I must admit I had my doubts at first. I have used a lot of similar products in the past and have always been disappointed. This is the first wine chiller that really works! As cold as the wine is it will remain at the same constant temperature during an entire meal. So far it has passed the one hour test. The only minor difficulty in in removing the bottle from the cooling container. the chilling panel hugs the bottle so tighly it is a little difficult removing it. But it is probably because of this design that it is so effective in keeping the bottle of wine so cold. It is ideal for white wines.",
        "Looks great, keeps wine cool. The only odd thing was that the outside is sleek, modern stainless steel and the included ice sleeve depicts old-fashioned scenes from the Dutch countryside. Weird. Oh well, no one should be peeking at the underwear anyway! The bottom takes a bit of finesse to screw on but so far, after 10 uses, it's worked every time. Eventually. Keeps wine cold long enough for two people to finish off a bottle over dinner, even though they shouldn't be drinking that much.",
        "I have a wine fridge that does not keep my white wines quite as chilled as I like. Also in the summer I find my whites warm too much sitting on the patio table. This Vacu Vin tabletop wine cooler does the job in spades! Cheap and effective, couldn't ask for more. Another great Vacu Vin product!",
        "Saw this wine cooler at a restaurant in Rome, Italy and decided that we had to have one. It is an amazing invention! It really keeps the wine cold for an entire meal (or longer). There is no ice/water dripping all over the place. The insert (very compact) stays in the freezer until needed. It is very easy to insert into the cooler. We love it !!!! Another advantage is that if your white wine is not cold enough, just put it into this wine cooler and within 5 minutes it is just right for drinking. We can't say enough about this item. Highly recommended!!!!",
        "This was the best wine chiller I have ever purchased. Worked extremely well with 750ml bottles. It kept them very cold for a long time even in 80+ degree temps outside.",
        "I am baffled why this product has so many positive reviews. It does not work!. I have kept the sleeve in the freezer for two days and it simply does not chill a bottle of wine. To make sure i did not miss anything I put a bottle of wine in the sleeve and put both in the freezer for 20 minutes. The bottle was barely chilled. Forget about the five minutes they claim. Bucket is nice, but useless. Stick with a bucket of ice ...Old School ;-)",
        "This thing is great. It looks decent on or near the table, and keeps wine perfectly cool. In fact, if you forget to chill your wine, putting it in here for 20 minutes comp,etely does the trick. (At least it does if you've remembered to store the gel pack in the freezer.) When I'm not using it for wine, I keep the stainless steel cannister out on my counter to store my big wooden spoons and the like. It's a perfect size and shape for that.",
        "Practical and ingenious, we use it all the time. It looks great on the counter, not to frilly. The ice chiller bag easily stays in my freezer atop a bottle. When I am ready to serve, I unscrew the bottom and slip in the ice bag. It keeps wine cold, even on the patio, for the hour or so it will take us to finish it. It wipes clean easily, and is very sturdy. I recommend it as a gift as well.",
        "I don’t understand why this hasn’t been designed with the larger wine bottles in mind! Like all else but half of the wines I’ve drank didn’t fit ... urgh",
        "This keeps your wine at the perfect temperature! I really like it, and would recommend for those who like to serve wine chilled!",
        "Got this for my parents for Christmas. They absolutely love it and use it all the time! The finish on the stainless steel looks really good. It doesn't sweat. Cools down warm wine fast and makes cool wine colder.",
        "An easy to use holder that compliments a dinner setting and keeps a chilled bottle cold without any exterior condensation. As noted in a previous review, the sleeve works best on an already chilled bottle of wine. We tried it on a room temperature bottle and found it cooled the wine but not to the degree of having it refrigerated.",
        "We've used one of these for many years and it's super at keeping the white wines cold. Recently purchased one for a friend and she's also been very happy with it.",
        "Works well and keeps a bottle quite chilled. The bottom black base needs to be secured (it is a a twist off) or it falls out so make sure of this before picking it up and carrying it. I like it for the wider bottom which is why I chose over the other models.",
        "Keeps chilled wine icy cold outside in the North Carolina heat in August. Saves us from going back and forth inside/outside to refill our glasses. A fabulous product that simplifies and maximizes our wine drinking enjoyment. A wonderful gift for wine drinkers!",
        "Dosent fit a champagne bottle with the lining in it. The bottle is too wide. Works for white wine.",
        "I bought this as a gift for my hubby 1 year ago and both he and I LOVE it!! It looks so sleek and stylish sitting on our table. Plus, we have had it for over 1 year, and it still looks brand new!! I would buy this again in 1 second and I need to get more for my friends, as gifts:) It also does a great job for what it is meant to do- keep wine chilled.",
        "Although I keep the cold sleeve in the freezer, it only keeps the wine cool, not really cold, the way I like it.",
        "I love this thing. Works perfectly. Looks nice on the table & there is no condensation.",
        "Bought this to have on the dinner table. Looks good with almost any style / decor. Chills a bottle of wine and keeps it cold in a very short time. Easy to use. Fits regular 750 ml wine bottles.",
        "We've used this wine cooler several times and it does the job perfectly! Some times, and probably due to the type of wine we had been drinking, the wine will actually freeze (not entirely, but more like wine ice chips). That really didn't bother us since we're both \"wine-o's.\" Our only advise for improvement is to purchase one or two extra sleeves as you'll need a new one once you finish your bottle!",
        "I use this wine cooler to keep my wine cold. Meaning the wine is already chilled in my wine frige and then I use this to keep the bottle/wine cold while it is on the table or counter. It easily keeps my wine cold for 2 or 3 hrs. I really like the way it looks and it's easy to use.",
        "I use this all the time. It really does chill a bottle well and keeps it cool. It has come in very useful. I bought an extra ice pack to switch it out, although I haven't had to use the extra yet. The wine is gone before then. ;)",
        "Not sure why this has such great reviews. Freezer pack stats cold about 10 minutes. Doesn't chill or keep wine cool. Look nice - that's all. Very disappointed.",
        "It works as advertised, chills down a wine bottle in a short time. What I do mor often is just use the freezable sleeve and put it on the bottle and save the metal base for when entertaining.",
        "This Tabletop Wine Cooler is perfect when you're out on the balcony or patio having dinner. It keeps your wine chilled for hours. Just make sure the cooler pack is stored in the freezer.",
        "It keeps wine extremely cold for at least an hour. It actually chills the wine colder than the refrigerator.",
        "I suppose I was a bit dismayed, but that's my own fault. This is a nice chiller to keep your already-chilled wine in on the table or counter. You just have to remember to put the whole container in the freezer so it gets chilled up itself. However, it won't stay chilled longer than 30 minutes soooooooo.... I've seen better ones that have a \"chill pack\" that gets almost frozen and is inserted into the wine cooler. Those seem to work much better, unless you are chugging your wine.",
        "It looks great and keeps wine cold much longer than if you use just the chilling sleeve.",
        "This is a nice idea, but the frozen liner is much too small and doesn't seem to fit. A small adjustment would make a big difference.",
        "Great cooler for the table or for heading out on the boat.",
        "Living in the hot lands of Texas and trying to keep a bottle of white wine cool on a patio is a challenge. This nifty little stainless wine cooler is just what the doctor ordered. The freezer pack is removal able and flattens for storage in the freezer. The bottom of the cooler unscrews to allow the freezer pack to drop right out (make sure it is screwed in tight so the wine bottle doesn't inadvertently drop out). The cooler is stable and virtually maintenance free. It is well made and compliments most any decor. Also great for a gift",
        "Very useful wine cooler for white wines...just keep the removeable pack in the freezer. People like it so much, this is the third one I bought as a gift! Cheers!",
        "The chiller insert is pretty hard to remove, i wonder about durability after a lot of use...",
        "This was a gift and it showed up exactly when I wanted!",
        "First time I used it, the gel pack broke and got gel all over me and my coffee table. I threw away the gel pack, and don't know where to find another.",
        "This is absolutly the most amazing product. It works so well and is very easy to use! You can chill a wine in 10 minutes to perfect temperature.",
        "Beautifully made and easy to use. The inside of this cooler is removed and placed in the freeze. After freezing simply place this back into the cooler, add a bottle of wine and you are ready to go.",
        "The stainless steel cover looks good. The gel insert works good when used to chill wine, but not as well as other gel wine coolers that are slightly larger (cover more of the bottle) and are much less expensive (because they lack the stainless steel cover). I pre-chill he wine in the refrigerator and this product keeps it at an appropriate temperature. Good product that does what is advertised",
        "This works beautifully with no condensation rings on the table. Really keeps the wine cold Great product",
        "The best darn product. Keeps bottles cool and sweat-free for hours.",
        "Great to use for picnic or home. We even take it with us to wine tastings. Have also given it as a present.",
        "Just what I wanted! Love the fact that the cold pack can be in freezer and then put into the container for a nice looking thing on the table. Also could use the cold pack when away for a picnic etc. Perfect!!",
        "Beautiful but it didn't works as I thought that you be. It is not a chiller, it just maintain it cold.",
        "The Vacu Vin works awesome. Within minutes my wine was at a nice temperature for me to drink.",
        "After trying many devices for keeping my wine chilled, I found this product some years ago. It cannot be simpler to use and the performace is fantastic. I love it!",
        "We own a winery and this item was perfect for keeping bottles chilled. No electricity needed.",
        "This is an excellent wine cooler for the price. It has a insert which you put in the freezer and then place in the cooler to cool the wine. It is very neat as opposed to ice and water and works well. I am pleased with the purchase.",
        "it works well, the stainless steel makes it a nice looking piece even though it's a bit bulky when you pour. I gues you can't have everything. overall I am happy with it",
        "I love this product. I can chill and/or keep white wine cool, and still have it look nice on the table. I like it so much that I started buying it as a wedding gift for couples that already have the basics.",
        "Works great! You can also take out the inside cooler piece and put sodas or beer in it in the freezer and it's nice and cold in about 5 mins.",
        "Keeps white wine very chilled for a long period of time!!",
        "Looks good. Cools the wine Ok. Would be nice if it could also handle 1.5L bottles. Need to see how long the canister holds without rusting. Better than most other options I saw.",
        "Works just as advertised! Keeps my wine chilled while we are dining on the patio. Would highly recommend it!",
        "Great product, keeps wine chilled for an hour or longer. Good build, arrived on time.",
        "Excellent product would recommend. I mainly use it to keep my red wines chilled while drinking. Since i don't have a wine fridge this works great.",
        "Works grate it keep my wine cold cant wait to use it this sumer it almost covers the hole bottle i even gave one as a gift to my mom and he loves it",
        "The concept is good but the diameter is too small for large Cabernet Sauvignon or Pinot Noir bottles to fit easily (you can force them into the sleeve but then they don't want to come out!), and champagne won't even come close to fitting. I am disappointed. I have purchased other brands that have no insert and they fit larger bottles fine...but you have to put the entire canister in the freezer vs. just the insert.",
        "I was really looking forward to this wine cooler arriving. It seemed the perfect way to keep the wine really cold and also look attractive. It does keep the wine cold and it did look attractive in the beginning. What happened, well after a short time the so-called 'stainless-steel cooler' RUSTS!! That's right, rust spots on the outside!! DON'T BUY it.",
        "This was a gift for a friend .... I hope that it satisfies them ...",
        "Does the job. This replaced our 30+ year old clay wine bottle cooler that we'd soak and cool but sadly broke. Of course, the old one was easier to withdraw the bottle but I think the rather tight contact with the Vacu Vin seems to be an advantage in cooling and keeping whites cold. Perhaps it could over-cool reds but we primarily use this with whites. We’ve used their Wine Savers for decades and like their products.",
        "This looks PERFECT! You take the gel insert and immediately put it in your freezer for six hours. The bottom of the “chiller” comes off so you can insert and/or remove the gel pack). Nice shape, and I do like the stainless. I think this will work well and be FAR less messy than the old fashioned wine bucket with ice and water!",
        "After having used an ice bath for years to cool my Riesling wine, I was looking forward to skipping the mess of the ice and water. Unfortunately, the design of this cooler does not bring the temperature anywhere near to the ice bath method. Also since the bottom of the cooler does not have a cool packet, the last of the bottle of wine tends to be quite warm unlike an ice bath.",
        "Was a gift for my parents and they love it. They keep the portion in the freezer and it keeps their wine chilled very nicely. They sometimes don't even use the frozen pack and it still keeps he wine cool. They also have tried putting a warm bottle in the chiller and it gets it to a perfect drinking temperature in just a few minutes. They are extremely happy with it!",
        "Once the sleeve is chilled, this will definitely get your bottle to serving temperature in about 15 minutes (from room) or 5 minutes (from storage) temperature. An important trick is to roll or turn the bottle during the cooling at least a couple of times.",
        "Love this wine chiller! It works just as others have stated- chills reds and keeps whites cold. My new \"friend\" for sitting on the porch or by the pool this summer. Love it so much plan to give several for Christmas gifts.",
        "Very nice wine cooler. We make sure to have our white wine in the fridge and the freeze pack in the freezer prior to using this wine cooler and the wine is much colder after being in the wine cooler on the table than if it was left in the fridge. The cooler has a nice design but leaves some finger prints on it. I wish we could use it for sparking wine but it is not large enough... oh well... probably need to buy another one for those bottles. :)",
        "The perfect gift for a white wine lover. Keeps your wine nicely chilled through dinner or while you're sipping on the deck in summer. Much simpler than an ice-filled container. I've used the frozen chill pack alone, but the stainless steel container keeps the pack colder and looks nicer on a table, not to mention more stable. Worth every penny.",
        "I saw one of these in a gadget shop in the Netherlands a few years back, and decided to get one when I returned home. It sort-of works, but not well enough to keep using it. I found it just as easy to put the bottle back in the refrigerator than to pull out this holder, insert the cooling sleeve, etc. Eventually, I gave it away to someone who saw it and thought it \"cool\" (no pun).",
        "After keeping the ice pack in the freezer, I place it into the container followed by the bottle of wine. Takes about 20 minutes for the bottle to get a lil chill to it. I wouldn't say it's that much better than putting it in the fridge or even the freezer for liquor, but it's certainly useful if traveling or when I want to have a bottle of wine stay cold, and I'm away from the fridge.",
        "I’ve yet to find it actually chill a bottle of wine...followed directions and after 15..20..25 minutes, my bottle was cool but the wine inside was not. Tried on multiple bottles too.",
        "Bottle must be cold to begin with if not it is futail to think this will chill it.",
        "Not sure if to give 6 stars or 3... Pro: the inside is nothing else than the Rapid Ice Wine Cooler, that you can take out and use without the rest, which is great. Con: the inside is too narrow for most slightly wider bottles, such as most chardonnays, rendering it much less useful.",
        "Wine oh wine of mine....this works wonderfully! Quick to cool & keeps at great temp.Where has it been all my life!??? Get more than one...you are going to love them!",
        "Really want to love this item but only skinny bottles fit. Champagne bottles, Chardonnay and \"bell shapped\" bottles are too big. Most Pinot Grigio bottles have fit but it's a 2 handed job getting the bottle out of its snug chiller.",
        "The wine cooler chilled almost as quickly as a fridge, but really stood out as a substitute ice bucket. It keeps bottles cold for a long time and works well outside on the patio or deck. It eliminates the hassles and potential mess of an ice bucket. A good value for the money.",
        "This is AMAZING! I am someone who has to have wine cold, but it usually grows warm to fast. This product solved my problem. It does everything it promises to do and is simple to use! Highly, highly recommend to every wine lover, this is a must have!!",
        "Used about 5 times so far, I stick the whole cooler in the freezer for white wine, in the fridge for red wine. A small amount of effort is required to extract the bottle when seated, additionally a small effort is required to fully seat the bottle inside. It is almost easier to pour while the bottle is still in the cooler. works well",
        "Nicce enough looking for the price. Keeps wine cool which is what I wanted. Not sure how well it would bring whites down if room temp. My wines are stored at 59 degrees so it only needs to bring it down a few.",
        "Works as expected. During a recent family gathering, it kept the opened bottle of white wine at a good serving temperature. Note that the wine was already chilled before opening it and using the wine cooler.",
        "My mother gave this wine cooler to me as a gift a year ago. It cools wine in 5 minutes as advertised and looks sleek and stylish. I liked it so much I bought her one as a Christmas gift this year.",
        "My mother in law loves it! All of her friends want one too!",
        "Looks good on the dry bar. Chills a bottle fast and keeps it cold for a few hours",
        "As others have pointed out, it works well to keep an already chilled wine at a good temperature. The manufacturer's assertion that it chills a bottle in 5 minutes is very misleading.",
        "Love it. Only wish it would hold sparkling wine bottle (not wide enough at top).",
        "I started out a little disappointed when I realized this was a place in the freezer type chiller, but it worked great and chilled a bottle of Moscato in less than 5 minutes.",
        "As advertised, the bottle stays chilled for hours; is ecstatically pleasant and blends very well with our other stainless appliances in our kitchen.",
        "I don't love it, works well, quality was a little less than I expected. Overall, it's good.",
        "This is a nice looking Wine Cooler, simple and sleek style, but after my first trial, I'm not sure it does exactly what it claims in terms of taking a bottle from the shelf and cooling it in 5 minutes or even longer for that matter. I'm with the other reviewers in thinking it may work well to keep a pre-chilled bottle of wine cool, but it just not quite enough to chill a bottle straight from the wine rack. I still like it because I am enjoying collecting wine accessories and am attracted to the stainless steel design.",
        "Ideal for a single wine drinker. Gets wine to perfect temperature in no time.",
        "Does do its job keeping already cooled bottles cool, and it will cool a room temperature bottle, but not as well as you would imagine. Although it will accept the wider wine bottles, it's impossible to slide them out of the cooler, which means you need to pour the wine with the cooler attached. Does look good on the table.",
        "The Vacu Vin Prestige Stainless-Steel Tabletop Wine Cooler looks I expected to see and this was purchased as a gift.",
        "There's no ice to bother with. It is easy to use and looks good on the counter. Would recommend to anyone.",
        "Worked but not in five minutes. I believe the stored wine temperature was too high. The appearance was great and held temperature for entire sitting.",
        "I use this wine chiller almost daily (yes, I drink wine daily). It keeps bottles cool and will even chill a room temp bottle in a jiffy!",
        "I have tried many wine chillers, but this is the first one that has kept the wine cold outside in the heat of the day for more than an hour.",
        "It fit a champagne bottle if you loaded it from the button."
    ]
}