{
    "entity": "Bar Tools & Drinkware",
    "text": [
        "This is one of the single best wine-related investments I've made. It keeps white wine from un-chilling itself as you sit at the table engaging in long-winded conversation, and even more importantly, greatly reduces the amount of time you need to pre-chill your wine in the freezer/refrigerator. Slap it on a bottle of pinot noir and bring it down to 60F in a few minutes. I have gotten my money's worth out of this product, that is certain.",
        "Works very nicely at keeping 24oz Pepsi bottle cool. Hasn't leaked. No complaints. I also bought another brand with velcro. Like it very much as well. I prefer the velcro one because it wraps even bigger bottles, up to 42oz. But this Vacu is still a good product, worth buying.",
        "We keep our VacuVins in the top drawer of our freezer and when the whites come out so do the VacuVins. We usually eat on our patio in the summers and the last glass is even colder than the first. We LOVE this product.",
        "The cooler sleeve works great to keep an already chilled bottle cool. We have used the sleeve while enjoy wine In the warm sun and fine that it works perfectly. We actually purchased a total of three to enjoy multiple bottles! A much have if you like to enjoy chilled wine In an outdoor setting. Note: We did try it in a room temperature bottle and found that it chilled the wine a bit, but did not make as cold as if it we refrigerated.",
        "It works but not like it said it would. I wouldn’t call it a rapid chiller but more of an overall wine sleeve to keep it cool while you have it sitting out.",
        "Really like this one! Does the job - keeps the bottle cool - and is easy to store in the freezer.",
        "Have used these for years for keeping white wine chilled at the table. One of them bought many years ago, finally got too ragged to be very attractive on the table. This new design fits the wine bottle more snugly ( which is a good thing) ad is more neutral in design. a good choice.",
        "This sleeve (used outdoors) barely kept the chilled wine cold - from the start. I used the ice pack for sports injuries instead and it worked much better. Save your money.",
        "It has been 1 month in the freezer. the moment I took it out it warmed up and couldn't keep the bottle of wine cool.",
        "chills one bottle...than it looses it's mojo. For a party, you might want to own 2.",
        "Very plain, I thought that it would be as pictured and have a nice pattern on the surface...",
        "I was disappointed in this wine cooler. It thaws out quickly--especially outdoors. I think the insulation is too thin or something along those lines. We've had similar ones before and they seemed to do a better job.",
        "I've used this to slightly chill reds and to further cool whites I've had in the fridge. Works great both ways. It won't take the place of putting the bottle in the fridge for a few hours but works well in a pinch.",
        "THIS ORDER WAS TO REPLACE ONE LEFT AT A FUNCTION. NO WHITE WINE DRINKER SHOULD BE WITHOUT ONE.",
        "I love these things. I like my bubbly and white wine to be very cold when I drink it, but I don't like opening the fridge everytime i want another glass. The options are to get an ice bucket which is big and messy and uses a ton of ice. Or you can through a couple of these in your freezer and you have an ice chiller any time. They are flexible so that i have never found a bottle that this could not slide over. If you like drinking cold wine you should definitely get this.",
        "Works very well on most bottle sizes and does a decent job of keeping wine cool.",
        "Good wine chiller. Doesn't get a room temperature bottle cold really. But it will keep already cold wine chilled. Worth the purchase.",
        "I looked at a couple of other products that quick chill wine and this was by far the simplest and least expensive. No cleaning anything up after using. Just pop it back in the freezer and it's ready to go for the next time. Not only chills the wine right in the bottle in a very short time, it also keeps the wine cold on the table. It isn't fancy, but the appearance of it certainly isn't tacky either. We love it and are glad we chose it.",
        "This is a great idea, and it really does help to chill your wine faster. But I have yet to have my wine chilled in five minutes. I didn't really think this was possible before I bought the product, though, so it's really not a big deal. It's a great thing to have - especially if you like to leave your wine out on the table.",
        "Needed and extra one. Great to use for picnic or home! We have a large family who all enjoy wine.",
        "Chills wine quickly and safely. Simple to use, effective . . . what else can one say? . . . Works Well",
        "Did not work all that well. I expected better cooling performance based on the reviews.",
        "it's good at home, outside, and surely on the journey, especially for summer. i wanted this for champagne or white wine of a larger bottle, but now i want to buy other item for champagne bottle anyway.",
        "I have purchase so called wine coolers before. None of these were as superior as the Vacu Vin. I was very pleased I found them on the Amazon website. I thoroughly recommend them.",
        "Doesn't seem to cool as well as I expected. Ok for use outdoors - wish it kept my wine cooler.",
        "The product described as chilling wine in five minutes. The \"chiller\" had been in my freezer for a couple of days, but did not chill the room temperature bottle of wine.",
        "Love this thing. We store it flat in the boat freezer and it is so versatile and handy on hot summer days...doubles as an ice pack when you get a bit overheated! Some of our friends kids put them on their arms as chilly, non-floating, floaties to quickly cool themselves off. Chills quickly, doesn't get hard and crispy. No mildew issues. Great buy!",
        "It popped almost immediately and leaked goo everywhere. You get what you pay for, I guess.",
        "What is easier than grabbing a \"Vacu Vin\" from the freezer (takes almost no space) and slipping it around your freshly opened bottle of Chardonay? No ice cubes, chords, water----and you always know it will do the job!",
        "I have used this wine chiller a couple of times. If the wine is already cool, it holds the temperature pretty well, but does not do a lot if the wine is warm.",
        "I live in FL and it is hot on my patio. The wine cooler is great and keeps my wine cold.",
        "76-64 degrees in 5 minutes. After 10 minutes the wine was 62 degrees. This does not 'chill' wine, but only keeps it from warming back up.",
        "If you like chilled white wine, you need this. It also fits (kind of -- it's a bit small but we manage) on Champagne bottles. I plan to get the smaller bottle versions next.",
        "I've been using this for years now and it's extremely durable. Does its job very well, keeping wine chilled for hours. Fits both Bordeaux and Burgundy bottles. Caveat: If you use this on a cold bottle, it could easily over-chill it to near-freezing. I recommend only putting this on a bottle after the bottle has been out of the fridge for 20-30 minutes.",
        "I was delighted to find this nifty wine chiller. I saw this at a wine tasting an had to have one. Its been really handy keeping our white beach vino cool while spending a day at the beach or camping with friends. I've even used it for dinner parties. Love this!",
        "It was fine. Did not hold the cool temperature as long as I would have liked.",
        "We use this every day. Keeps your wine chilled just right for a couple of hours--if it lasts that long! If you're taking a bottle to a dinner or party, this is so much handier than carrying a cooler. We also have a larger one for champagne bottles.",
        "Purchased to keep my milk based protein shakes cold during workouts. Works like a charm, fits my shaker bottle perfectly.",
        "I purchased this for a Christmas gift. Tried it out before wrapping - it worked wonderfully. I will order another for myself!",
        "This item is a must-have for any white wine drinker. I keep it my freezer and use it all the time for entertaining. I can keep a bottle of wine out on the patio or on the countertop and it stays cold for hours. It is also great for transporting a bottle of wine and keeping it cold.",
        "These type of chillers are great. Just keep them in the freezer for whenever you need them. They fold up nice and flat and don't take up much room. Best product for keeping wine cooler longer that I have come across.",
        "Chills the wine very fast, and keeps it chilled for a long time. Does not take much room in your freezer when not in use - I also bought one for a neighbor and another for my brother and they also love it!",
        "I have several of these sleeves and they work very well. We take whites to parties in them or chill wines at home (works well with getting reds to cellar temp). The best thing to do for warm whites is tag team it with two sleeves. Put one one for 5-10 minutes and the second for another 5 and pow - you've got a cold wine.",
        "Does what it's supposed to. We have one that we accidentally left at our winter place, so went with it again as reasonably priced and effective.",
        "Gets room temperature wine cold in seconds and keeps things cold for a long time. Bought several for Christmas gifts and very well received by all!",
        "I love this thing! It really keeps the wine nice and cool. I wish they had a bigger size for the larger bottles.",
        "I used it to chill and cool Water bottles.... It worked perfectly! I've always used Vacu Vin Rapid Ice products! They are very durable and nice!",
        "Works well and it does fit over a champagne bottle.",
        "The item is small and will not expand to fit a larger bottle of wine if needed.",
        "I have not had a chance to use this product yet. I am looking forward to seeing how well it works.",
        "Despite using pre-chilled wine, putting the whole thing (including this ice pack) inside a flexible neoprene cooler AND keeping it in the shade, this wine cooler was still completely melted within an hour of outdoor use on a warm evening outside. I don't expect hours upon hour of fuctionality, but considering the lengths I took with the extra insulation, this was disappointing. Might be ok for use inside during dinner but that's not what I'd been hoping for.",
        "This item does not chill wine, but it will help to keep a chilled bottle cold for a longer period without the mess of an ice bucket. I wanted something that would keep a bottle chilled during short trips to friends' houses and it is fine for this. In an actual test. after putting the cooler in a freezer for an hour, it held a pre-chilled bottle to a five-degree rise after about twenty minutes. A bottle without the cooler warmed by more than ten degrees.",
        "Was excited to receive this. Disappointed as it does not cool a room temp bottle of wine. The bottom of the bottle is the only area that feels the slightest but cold. Wine is room temp even after cold pack is no longer cold.",
        "Handy to have when you don't have access to an ice bucket. And I have also used it when I am bringing wine to a restaurant or a friend's, to keep cool in transport.",
        "Not impressed with this particular product by Vacu Vin, though I really like some of their other stuff. Does not stay frozen long enough to allow you to keep your champagne bottle out in the patio on a warm day.",
        "You won't need your ice bucket any longer!!! Slip the wine bottle into the chiller sleeve and worry no more. The bottle stays chilled and you no longer have to worry about the moisture ring from the ice bucket. It lays flat in the freezer so you have plenty of room for your Ben and Jerry's. I highly recommend it! In fact I'm going to pick up a second one - I prefer my red wine as well as my white chilled.",
        "I've only used this a few times, but it works very well! I even chilled a warm water bottle to a near icy-drink in just a few minutes. I did find that it works much faster if you put the chiller around the drink, and then stick them in the freezer together. This way, in a few minutes you can chill down a bottle from room temperature. But if you just want to keep your already-chilled bottle cold, this works like a charm. Good price, too!",
        "I wouldn't recommend it to chill a bottle, but it keeps a chilled bottle cool while you're having dinner. I always fish it out when I serve chardonnay, which I prefer well chilled.",
        "I put mine in the freezer for at least 5 hours. Took it out placed my wine bottle in. When I opened the bottle one and a half hours later and the wine wasn't chilled and the \"chiller\" part wasn't cold anymore?! I will try it again after keeping the \"chiller\" in the freezer all night and see if that makes a difference. When I fill my ice trays they are frozen within 5 hours, so I'm sure it was in the freezer long enough...but I will give it one more chance. So far extremely disappointed! UPDATE: No difference. I have actually thrown it away. It was a waste of money.",
        "Keeps the chill while driving it to a party Do not expect it to cool a bottle of wine to serving temp I like it and recomend it",
        "It really keeps a bottle of chilled white wine cold! Great for taking to restaurants or for drinks on the patio.",
        "I own two of these and gave one as a present. The person who received it loved it. It is a great way to keep wine cold.",
        "I have seen these used at at winery and found them available on Amazon. I am 100% happy with the results. It takes up a very small place in the freezer and is easy to pull out and place on my wine bottle. I did place it on a bottle of wine that had been chilled and it kept the wine chilled in 80 degree temps. I have not tried using it to chill a warm bottle, but this is definitely a good purchase and I will be giving these as gifts to other wine lovers.",
        "I ordered this item for gifts for my whine drinking friends. They all seemed happy with the gift and said they had considered buying for themselves.",
        "We have a wine fridge at home that we typically use to chill wine, but this chiller is still handy when the bottle will be sitting out for a while. It's great in the summer as well if you dine on your patio. I find it does chill the wine quickly and keeps it cool. I think they are a great inexpensive gift for those that drink and serve wine as well.",
        "We love this! I originally bought this for my husband's \"beer bottles\" so when he's in the \"man cave\" he can have one chilling while he's drinking one. But we will also use it for our wine bottles as well. He tried it last night for his beer bottle and LOVES it! He puts the beer back in the cooler between each drink. Great gift!",
        "LOVE this wine chiller. Fits perfectly around all wine bottles. Keeps wine chilled for hours. Great looking.",
        "It works but my friend had a different brand that I can't find that kept the wine colder longer.",
        "I liked this so much, I bought another for myself and a couple for friends. I like that you can keep it on when you pour or carry it to the table. It keeps the wine chilled, without having to keep it in the frig or a bucket. I wanted another so I can have 2 bottle out and open when we have company.",
        "I bought two - one for red and one for white. They don't make a warm bottle cold - just cool, but they do keep cold wine cold.",
        "not what i thought it would be, did not like at all",
        "I haven't actually used this to chill a warm bottle, I've only used it to keep a chilled bottle cold while we drank it. It worked like a champ -- much easier and neater than a wine bucket, although not as romantic.",
        "We use this to chill all types of items quicker, such as a Slurpee brought home that has melted a bit much, a bottle of wine, bottles of water we want to get cooler faster, bottles of soft drink, etc. Works well, nice item.",
        "We keep this in the freezer at all times. Chills a bottle of wine in minutes. The silver version is simple and reasonably attractive. Item arrived promptly from seller.",
        "I've had all kinds of wine coolers and collars over the years. This has turned out to be the best. I'm getting ready to order another with my next order.",
        "I usually only use it when I have drop in company and we want to have a glass of wine. I keep it in the freezer at all times so not sure how quickly it chills",
        "Good wine cooler! My wine stays ice cold fir more than 2 hrs, and fits well!",
        "Good for keeping wine chilled on the way to dinner.",
        "We love this for outdoor dining and parties! Much better than an ice bucket.",
        "these art great , I was happy to finally find them"
    ]
}