{
    "entity": "Jig Accessories",
    "text": [
        "This is a really well thought out jig and very well built. I was able to create a box jointed box in roughly 10-20 mins including time to cut the box faces. My only beef is with the instructions. So far for the box joints instructions the guide recommended using a 3/4” template guide but this should have been 5/8” - so definitely make sure you do some dry runs on some sacrificial work pieces before unleashing on your prime lumber.",
        "Read the included owners manual, then read it again; finally read it one more time. After reading and rereading, set it up and get after some of those left over scraps from past projects. Patience and practice will have you cutting beautiful joints. My very first half blind I cut in scrap maple was perfect. My first through dovetail cut in scrap poplar was laughable at best. Practice practice practice and this jig will be worth its weight in gold.",
        "After reading all of the reviews, I would have to spend $1,000 to do better than this and that was not going to happen. I just wanted to make sure I was upgrading from my painful Rockler model and never wanted to have to upgrade again. It is solid and is good as all the reviews.",
        "Read the instructions, if you do you'll have little no issues. I reccomend building a storage box for the jig as your first project and putting the styrofoam from shipment in the new box, it will help you learn how to properly use it without getting angry if you jack up good stock. Easy to use otherwise, cut all dovetails for my box in 10-15 minutes (once it's set up properly).",
        "I tried the Rockler dovetail jig and wound up returning it and getting the Porter-Cable 4216. It is so much better made and easier to use than the Rockler. Having all of the templates and router accessories included is great. As many reviewers have stated, it would be nice if there was an easier way to ensure both sides are aligned exactly but it is just a nice to have. The instructions could be a little better but there are plenty of videos on the Internet that will help you out. I definitely recommend this specific one because it comes with everything so you won't be needing to upgrade to get the miniature template.",
        "I bought this Dovetail Jig to make some drawer and it never worked out... the most essential parts that make this jig what it’s supposed to do were bent... I spent an entire day trying to compensate but I realized that was defeating the purpose, so I call the company and it took me a week to finally reached them, and didn’t solved my problem... I spent too much money for a jig that is taking up space in my already reduced workshop....",
        "I have done dovetails with a router table and this is way easier, faster and more precise. I haven't used any other dovetail jigs, so I can't say if this one is better than others, but it definitely works well. One word of caution, the template guides will not fit on your router if you don't have the right sub-base. I have a Bosch router, so I had to buy a Porter Cable 42186 sub-base which has 3 mounting screws 4-1/16\" center to center and fit perfectly.",
        "This jig works great. It is built very solid. One issue I have when I mate up the pin and tail boards is the two boards are about 1/8th of an inch out of alignment. This is caused by the offset not being correct. Unfortunately there is no way to adjust this without making modifications to the jig because the offset is created by a solid piece of steel that has no adjustment. The dovetail still fits tight and looks great but having to spend time fixing this 1/8\" error every piece is kind of annoying so I am removing 1 star for this.",
        "I have a old Porter Cable 4210 Dovetail jig I bought used 6 years ago it works good, but only came with 1 template guide. I was looking to buy a additional template guide to make miniature dovetails and seen the Deluxe Porter Cable 4216 Super Jig offering all 3 templates for just a little more than the price of the 4210 that was a easy upgrade for me. I'm using it to make through dovetails, box joints, and miniature dovetails on small drawers with ease. This was a good choice for me. I also looked at the Porter Cable Ominjig Joinery System, but it was a out of my price range.",
        "Built myself a 2x12 guitar cabinet with this. Fairly easy to set up if you are handy and nice quality.",
        "Seems to work well once you figure things out. However, the manual and even all the utube tutorials seem to skip over the essential point of 1/4\" vs. 1/2\" templates and guides. Experienced woodworkers probably know it all naturally, newcomers to the sport, not so much. Took several scraps of wood and many bit, guide and template changes to get the desired results, but it does do a good job once you are all set up right!",
        "Bought this to make smaller dovetails. The instructions are well-done and the results are perfect. Still not sure I can't do it by hand quicker but when making multiple drawers I'm glad it's in the shop. this version is much better than their earlier models, especially with wood registration. Half-blind dovetails are great. Recommended.",
        "Instructions are a little complicated. But with a little bit of practice it’s not hard to use. Makes a lot of sawdust so use it outside used it to make dove tails on a slant side sea chest, came out great. Also used the box joint jig for a small tray. Would rate my wood working skills as average. Would recommend getting 2 porter cable routers, set one up for pins and other for tails and leave them devoted for dove tails. Have used it quite a few times. Will require some more practice if you don’t use it for a while. Would buy it again and recommend it to a friend.",
        "This thing will do WAYYYY more than you think. It's NOT limited to evenly spaced dovetails over a 12\" or smaller board. Get the advanced manual (dowloadable from the PC website) and learn how to make this thing do so much more. The only minor issue is that the knurled brass nuts on the template lock down are very easily turned by mistake when flipping the guide for through dovetails. I'm planning to put some nylon on the threads to prevent them from accidentally turning. The manual says you can also put an extra nut in there to lock them down, but that makes it more difficult to change the setup.",
        "After watching countless videos on Youtube, I was looking for much more difficulty in setting up and using the jig!! Not that I am a whiz or the sharpest tool in the box but I had absolutely no issues as described in most of the popular videos online. Simply follow the instructions with a sound understanding of woodworking and anyone can use these jigs. I wish I would have spent the money sooner!!",
        "I thought I had received the kit missing one of three templates. I read several other reviews here also reporting a missing template. Well, I found the \"missing\" part. It was on the bottom of the bottom piece of styrofoam packing in the bottom of the cardboard box. So if you're missing the third template and haven't thrown out the box, take a look there! Otherwise, the machine looks awesome, and looking forward to using it.",
        "This is a sophisticated tool that takes some time to learn how to use. (I suggest YouTube for tutorials) Once you get the hang of it, it's amazing. Tight-fitting dovetails in minutes. Wonderful! A picture of my first attempt on some scarp wood is attached.",
        "Within the first couple of weeks, I made a total of 18 drawers with half-blind dovetails with this jig, without messing up cutting a single one of the joints - and I'm not especially meticulous, this jig just makes it that foolproof. I made the mistake of buying some of my lumber too far in advance and the wider boards ended up rather cupped; however, I was still able to cut the dovetails with this jig with some effort, since the material clamps helped to flatten the boards out. I look forward to trying the other types of joints that this jig can handle.",
        "This jig is outstanding and very easy to use. The directions that come with it aren't great, but there are a lot of videos out there that show it in action. The package I purchased included the template for box jigs and through dovetails, micro dovetails, and the standard half-blind and sliding dovetails. The value of the whole package together can't be beat.",
        "Excellent tool. I'm new to making dovetails and I am having a lot of fun with this jig. The instructions to use were tough, but it is tough to learn to use, that is unavoidable. The only issue with it I have is with the offset. I'm not sure why it seems so small and clumsy. I never was too sure if I had the offset set up correctly. The dovetails turned out great though!",
        "Fairly easy to use. Only drawbacks are the clamps are too far away from the template to use for shorter pieces (small boxes for example), and it will not accommodate pieces longer than 12 inches. So far I've only used the miniature template (with the 1/4 inch tails) and it worked really well the first time. Oh, and the lettering etched into the templates is not inked or colored and is often hard to read, but my eyes are not what they used to be either. I can see it will work well in most applications and comes with everything you need (except the router) so it is a good buy.",
        "This is the only dovetail jig I've ever owned. For the price I'm very happy with it. I am a professional cabinet maker and had a large kitchen of 10\" dovetailed drawers to make. This did very well and I can't really find anything to complain about.",
        "Great value for the money. Compare it to Rockler and other jigs, you get more. Now, I was a novice when I bought it, instructions a bit confusing but it may just be me. I found videos on YouTube that helped me tremendously. The mini dovetail I have not been able to master, but if you know what you are doing you can figure it out. They should have worked on instructions or provided videos on line",
        "I have never used a jig for dovetails so I was a little nervous about ruining my work pieces. The instructions were a little difficult to understand, so I watched a couple of how to videos on YT. I was then able to dial the jig in using some test pieces, and the end result came out really well. Would definitely recommend to others.",
        "This Porter Cable dovetail jig is totally awesome. It only took me two attempts to get dead on dovetails. The fact that I had been watching George Vondriska at wwgoa made the whole set up process a piece of cake. After watching George V. make perfect dovetails, I decided to get one of these for myself. I have an old Craftsman dovetail jig that I used for 30 years and never got a perfect fit. I got a perfect fit with the Porter Cable model on my second try. I highly recommend this product to anyone wishing to make perfect dovetails.",
        "For a beginner... see youtube. Assembly was not hard but I was not impressed with the user instructions. They appear to be written by the engineer and not easily understood. I went to you tube and saw what I needed to do and it does a great job.",
        "Solid heavy duty tool with a ton of versatility. Tool is available in several configurations so do your research and buy the version that is suitable to your needs. Read the directions before you attempt to use they are easy to follow and explain what bits and collars to use and how to set the bit depth on the router, totally easy !",
        "Only used it once so far but it was awesome. My first attempt was a perfect dove tail joint. I am going to practice with it to get all the different dove tails down. It is well built and seems easy to adjust. I love the info on the side to show adjustments. I would recommend this tool to every one.",
        "This is very solidly built and does everything that it says it will. I also like that this package came with the two extra pieces which makes it an excellent value. I did not expect to make perfect dovetails right away and I was right. Although I thought it would be simple to do it does take a little bit of practice and tweaking to get nice smooth dovetails but when you do get them it is so satisfying. To learn how to use it I would recommend finding a video or two on YouTube because those instructions seemed, to me, to be a lot better than the instructions on paper that came with this jib.",
        "The unit was shipped on time and had no damage. Very easy to set up once I bolted to a table. It makes perfect dovetails and finger joints right out of the box. It takes a little time to get the joints perfect but once set up is done the fun starts. I was able to set up 7 memory boxes with all cuts in about 2 hours. I have other Porter cable equipment and have had no issues. Fast set up - clean cuts - perfect joints. It is worth adding to your tool list.",
        "After figuring out exactly how to use it (video tutorials on YouTube) it works flawlessly. Make sure you clean next to any and all alignment corners between boards or you will be 1/16\" misaligned and it will drive you nuts.",
        "I had to watch some u-tube videos on using this jig.. but after one failed attempt, I've gotten beautiful joints everytime. The product is great, the user information could be better that's why I give it a 4 star and not a 5. The instructions on the side of the device is actually more helpful than the booklet.",
        "Reading the directions I couldn't figure out how to set it up. Finally spent several hours watching YouTube videos and between several of them I figured it out. There were simple steps that were omitted or poorly explained. So breeze through the instructions and go to YouTube. Once I figured it out, it works as expected. First project came out exactly right on and the fit was flawless.",
        "Spent several hours becoming familiar with set up, use, and trials. Be sure your router has 1/2 bit and fixture to accept the collets. I ended up buying a porter cable router to go with jig. I have never done dovetails before. Once I was familiar and understood the settings I made an oak box with thru dovetails and it worked beautifully.",
        "I have made 37 drawers with this so far and will be making another 10 soon. Overall, I'm really happy with it. Getting things dialed in properly is tricky but once you do, it works great. I have only done half-blind dovetails with this but it did a great job.",
        "a fine tool. sturdy metal parts. needed to file one of the brackets to make it square, but was not a show stopper, and would have worked ok w/o filing. depends on how fussy one is. made 4 boxes for Christmas game, and the tool makes repeatable box side quickly once setup. Requires a little fussing and practice to get the setup procedure clearly in mind. [instructions are good] Then all goes w/o delay. Cutter size is very important for tight fitting finger joints. However, the Dovetail templates can be adjusted. at set up to improve fit, or leave more space for glue",
        "Offset guide for mini doves is about 1/16 off, and not square. New at this, it took me a while to figure out why tails and pins did not line up for a good fit of the sides. Not using the guide until I can grind it square and 1/4 inch, it's a fine jig for the price!",
        "Product is well made, solid and sturdy. Fairly easy instructions on use, but some very good tutorials on U-tube. Some factory set guides weren't quite accurate, so having a small thin metal ruler is extremely helpful. You can be making headway on your projects pretty quick.",
        "This is a great way of cutting dovetail joints, box joints, and half blind joints. It takes a while to get the hang of it, but it does a wonderful job. It is allowing me to take my projects to a whole new level. Make sure to watch the youtube videos about how to use this. They help the manual make sense.",
        "This is a great jig at a great price. As with any jig, setup is key. Once its setup, it's a breeze to cut quality and tight fitting dovetails over and over again. I have only used the half-blind template so far, but am looking forward to using the mini template to make some small boxes and such. The bits it comes with are incredibly sharp and cut beautifully. Everything you need to create dovetails is in this kit minus the router itself.",
        "Used this jig to create a half blind dovetail card box for my son's wedding. The directions were easy to follow. It does require testing on a scrap piece for perfect alignment, but one you have it locked down it's easy to create repeatable joints on that thickness of wood. The results are very professional looking. I would highly recommend this jig. I have not used the other types of joints yet but based on the directions I expect them to be just as good.",
        "Porter Cable is the best for this type of jig. This is a complete set. If you have a Bosch router 1617, like I do, then you need to buy the Bosch RA-1129 adapter set. This will allow you to use the Porter Cable guide bushing in this jig set. You will not be disappointed! Awesome!",
        "The reviews of this jig were generally glowingly positive. After some practice I think I like it. It's generally well made, however it did have a couple of flaws.The small edge guide which offsets the two pieces was not producing joints with flush edges. I had to spend about 30 minutes with a file to get it square and to a true 1/2\" offset. It now produces consistent results. The other complaint is that the etched labels on the aluminum jig were barely visible.",
        "High quality jig that helps you get perfectly tight dovetails and box joints. If you are a beginner, definitely read the manual and refer back to it constantly. Go slow and double check everything prior to turning on the router. I've used this on four projects so far and after the second time my joints were nearly perfect. But it isn't hard to have a board misaligned by just the smallest amount and mess up your joint. So again, go slow, constantly refer to the manual, and double check everything.",
        "The first tool you buy is the most expensive one you will ever get (of that particular type of tool.) That was certainly true in my case. The previous two routers, tables, and dovetail jigs were successively better - but I would have been money ahead had I bought my Bosch Router, table, and the Porter-Cable jig. First of all this jig is a serious tool! It is heavy, accurate, easy to work with, and comes with optional guides. Yeah, I should have bought something like this in the first place. One other thing; once you sort out how everything fits together and works it is a lot safer and easier to use than my old cheap tools.",
        "I had one of these for years, then sold it to my brother and replaced it with an Incra system. Now don't get me wrong, I love the incra system. It is great for some very special joinery, but way to much work for simple blind dovetails or through dovetails for drawers and boxes. End of story, I had to buy this porter cable system again. It's fast, easy to set up and cuts both panels at the same time with a better fit. The best part is less than half the cost of what I payed for the first one when they first came out. Amazon, thank you...",
        "Overall it is a fairly good one. But some points to improve to make it great. 1. The groove on the half dovetail template, which is to help to align the vertical and horizontal piece is way too thick, and it is should be a line, not a groove. Procter cable could use laser etching to draw a precise line on it. 2. Left and right offset guide is far away from accurate. You never get the two pieces flush.",
        "My first attempt at dove tail joining. You Tube videos are invaluable. Instructions are adequate but nothing takes the place of a You Tube video. Product is well made and precise. I am very happy with this purchase.",
        "I guess this is one of the best jigs on the market it’s not great but it works pain in the axx to set up",
        "I have been wood working for over 30 years and this product hands down beats hand cut dove tails or other dove tail jigs plus it is very accurate. If you are serious wood worker get one of these.",
        "I am an inexperienced woodworker, but I was able to make a tight, clean dovetail joint on my first try with this jig. It cuts the pins and tails at the same time. I am very happy with this purchase",
        "Set up was quick , I watched a you tube video and read the instructions that came with the jig. The router bits and the guide collars were also in the box. It does take a few practice joints but once you get it tuned in you are ready to go. I'm very happy with the 4216 Jig",
        "I ordered the Porter Cable Dovetail Jig 4216. I am missing 2 bits and 2 template guides. I have not used it as I will probably have to return it. I have used a friends dovetail jig and it worked fine so I wanted to get my own. I believe I got the packet for the 4212. I tried twice to send an email to the Porter Cable support site but it failed to send out??",
        "Had a nice craftsman fixture that I couldn’t get good results with. First time using this I had perfect results! So far so good, I’ll update if anything changes. It this is well worth the $135 bucks.",
        "Was very well built. Videos on how to use are very helpful and highly recommend watching those. Comes with bit and rings that fit my Dewalt router and so It came with all that was needed to just start using it.",
        "It came broken!!!! I didn’t have time to open it and missed my return window, I went to Lowes and replaced the 4 bent bolts, it looks like it’s going to work.",
        "Other than not offering any sort of dust collection, the tool itself is awesome. Very easy to setup. I have only practiced with so far, to get the joints tight. This is my first time using a dovetail jig. Watching a u tube video first, made the setup easier to understand.",
        "i am just working on half blinds getting them down --- accuracy is most important --- good set up --good results/// you will learn if its too deep of cut --back it off even a 1/32 makes such a difference etc once you get the hang of it ----very good machine --- i learned a lot of set up by trial and error ---- read the book",
        "I built 5 treasure boxes as gifts for Christmas. Tons of accolades on the quality of my work. There is nothing like a good dovetail joint to scream quality craftsmanship.",
        "I got the 4216 deluxe model, every thing you need comes with it. Set up is easy except the lines on the templates. They are 1/16” wide and you get lots of variance with a joint in that 1/16” width. I have run 8 set ups and adjusting in and out with in it and yet to get a good joint on half blind dovetails. Maybe some one can tell me how. I have followed directions in the book. Hoping for a little help. Rich B",
        "The quality is excellent. It does take a bit of know how and some previous experience with with type tool is helpful. The user manuel should have additional instructions for adapting the fit to different with of material. Be sure and have plenty of practice wood before you do your final cuts.",
        "I like this Dovetail jig. Have plenty of scrap, and test it till it’s just right. Results are beautiful. Take your time,devote a day of your long life, practice, make something beautiful.",
        "Once set up it is very precise. Excellent and clear operating manual. Only wish it had a dust collection attachment.",
        "The instructions are complicated but the YouTube video's clear it up. Definitely need to practice first! The jig is sturdy and appears to be well built.",
        "I bought this to make boxes and drawers with and what a great product it turned out to be. It does a fantastic job and is fun to use. Just follow the instructions in the manual carefully and it will produce a great joint.",
        "Very pleased with the way this jig works. Make sure that your router has a baseplate that will accept the guides. Have made several drawers using this jig and ease of set up is great and the results are superb. Reviews I looked at were on the mark and am not disappointed with the unit, the delivery, the packaging. As usual Amazon does a great job, and this jig deserves 5 stars. Well built, well designed unit which will certainly outlive me. Cannot find a reason not to give it 5 stars. Professional unit.",
        "A great tool for making repeatable evenly spaced joinery connections. Takes a little work to fine tune your cut, but once you dial it in, it's a time saver. Totally worth the investment.",
        "Everything bout this jig is great. From the packaging to the instructions to the setup. This fixture exceeds my needs when making boxes and drawers.",
        "The manual is a little long but once you start to use the jig, the process is almost intuitive.",
        "Great tool. I have been told for years that dovetail drawers are too difficult. After spending $500 for 3 drawers, we tried this jig. It isn't perfect, but it gets the job done. If you take the time to set it up its a great asset.",
        "Using this jig for the various patterns is a breeze. The instruction manual makes all of the capabilities of this unit easy to do. As usual, Porter- Cable has put out a great product.",
        "Takes time to set up. And a little more to fine tune, but the more you use it the better you’ll get... Nice jig.",
        "this thing has helped me through about 6 kitchen remodels now. Love that I can offer maple dovetail drawer boxes. easy set up, and clean joints. never used anything else for comparison, but as easy as this thing is, cant say that i ever will use another jig!",
        "I am not a professional or even a hobbyist woodworker, but with a few trial pieces, was making half-blind dovetail joints in about 10 minutes. Tearout is kind of an issue if trying to use plywood for cabinet drawers, but that has nothing to do with this jig. Following the fairly simple, yet long, directions, one can make nice drawers that line up well. The only criticism is that the tightness of the joint seems very dependent on the router bit height, not a lot of \"wiggle\" room in the adjustment...",
        "This kits comes with everything and it’s made of quality material for a solid tool.",
        "I spent a couple of hours reading a reviewing the instructions. I also found numerous YouTube site to demo the steps. Once assembled, it was remarkably easy to set up and turn out beautiful dove tails in the scrap stock. The project for which this jig was purchased is still in the hand plane stage, but I have no doubt that is will offer the same results.",
        "Slightly warped guide; have to insure I press down in the middle. Fairly easy to set up and use.",
        "Very happy with the product. Practice is required, but then you can turn out great drawers",
        "This was a great addition to my woodworking tools. Great value for the price.",
        "Unfortunately I never took it out of the box. I just can’t do woodworking anymore.",
        "I ordered the 4216 to acquire all of the templates and bits. When I opened the box, the styrofoam that houses the unit was already broken. It seems someone had opened it. The templates were missing. The only template I received was the one that was screwed to the machine.",
        "The set up is tedious but after a couple of times it goes faster. Comes with four bits and templates for different applications. Well made tool. Heavy and solid.",
        "Makes the task much easier. Setup is simple and the instructions are clear. Looking forward to building several projects utilizing this jig.",
        "This is a great product. My only concern and complaint is that the depth gauge for cutting box joints is not practical. Yes it's a good selling point but that gauge doesn't work when you are trying to do through box/finger joints. The best thing is to change the depth of the gauge to whatever your thickness of stock is going to be (add a little more depth so you ensure the depth is a little more than stock so you can sand it down flush).",
        "I've used this now for a couple of months and it's working great for me. Nice, tight dovetails and very easy to do, once it's set up properly. One note and it's for all dovetails....You have to have perfectly straight wood. If the wood has even a little cup or bow, you're going to see some gaps in some of the joints. Using straight wood it works very well.",
        "I haven't used this much, but it was easy to set up and has great instructions. Would highly recommend it.",
        "Bought this jig in addition to my Grizzly jig, because Grizzly does only offer half blind templates but no full dovetails. Porte-Cable offers various templates for this jig and this product is really a winner. Should have bought this one from the get go. The jig is also very easy to adjust and has some convenient features that other jigs are missing.",
        "this is a very fine piece of equipment, and owning several other dovetail jigs, i would recommend spending the extra money for this one. It does everything very well. Set up is easy, its heavy and easily installed with its own base. everything is well made, precise, and comes with everything you need to make great dovetails right out of the box. Instructions are very clear, and easy to read, unlike most other products now days. Highly recommended if you wish to make excellent dovetails without all the fuss.",
        "Easy to use, has just about everything you need to make tiny drawers or larger ones, I am very happy.",
        "These dovetail templates and jig are very well made. My only complaint is that instructions are a bit vague and it takes several times to set up on scrap wood to get tge hang of it. After that things are going smoothly. Be prepared to make several attempts at setting up and re-adjusting the setings. This jig appears to be of better quality than most others, especially for the price.",
        "I bought this to make some cabinet drawers for my pantry. This was my first time making dovetail drawers and I likely spent more time ensuring I had everything set up using scraps then I did making my first 6 drawers. If you take your time, this jig works perfect and you can make absolutely beautiful drawer boxes.",
        "The dovetail maker is very good. You have to practice with it to get good results. I highly recommend this jig for making dovetails.",
        "Absolutely love it. Easy to use right out the box. And yuotude video helps with any fine tune understanding needed.",
        "The tool that discovers a lot of woodworking operations I have never though about. Looking forward to playing with things from the \"advanced manual\". My first goal is to make a collection of highly decorative wooden garden pots.",
        "Great product for woodworker. Very user friendly and can do multiple joint styles.",
        "Still learning, to be proficient. The ease of versatility for different types of joinery is still yet unknown to myself. I believe that the directions can use some refinement/clarity. Although, the direction hints are extremely useful.",
        "Great package. Can't beat the price with 3 templates and 4 cutters. I particularly like the cam operated hold downs a lot easier and quicker to use than my old PC model.",
        "Bought as a gift for my husband and he loves it!",
        "High quality jig. My only complaint is that the engraving on the templates is not visible, and until you learn the different holes and settings on the templates, you have to look a the manual to see what is what.",
        "This dovetail jig is awesome, it is built like a tank compared to cheaper brands and is really easy to setup. Out of the box I was able to cut perfect dovetails in less than 5 minutes. The instructions are really simple and cover anything you would ever want to do with the jig. There is an advanced manual that really gets into some tricky joints. This jig is a great deal at $200 but becomes even better with the bits and bushings included worth almost $100 alone. I would highly recommend to anyone looking to do dovetail joints."
    ]
}