{
    "entity": "Jig Accessories",
    "text": [
        "I have been making keepsake boxes since 1995 and I have never been able to cut a dovetail that I was satisfied with. This thing is a GAME-CHANGER! I am telling you that anyone with a limited knowledge of wood can cut grade A dovetails using this jig. I got them right the first time. The price of my boxes just went up!!",
        "This is an amazing tool. I’ve been woodworking for 61 years and I love it when I find a well-engineered tool that actually does what you expect it to do. Works great with a router table and can also be used with a hand held router. Makes great dovetail joints and is a must-see if dovetails are in your future.",
        "Handcut dovetails, even with a jig, are too time consuming for me... chiseling out all that material is a buzzkill. This jig works great on my router table and the included bits cut clean in walnut, maple, and cherry tested so far. I think it's a little pricy for 2 bits and a plastic jig, but it's hard to put a price on this kind of convenience. I'm glad I bought it.",
        "You'll have to do a little work to get this set up. However, it makes perfect dovetails after some practice. I use it frequently. A great low-cost way to perfection. Rugged. Well engineered. Only four stars because of all the initial fussing. Good instructions.",
        "This is great! Take your time putting the backer on and you'll be cutting joints in no time. Cutting on the router tabletop is so easy.",
        "I needed to stand on the backside of the router table, pulling the piece towards me and the bit. And because of this, a dust vacuum is a real necessity, since the sawdust is was blowing towards me. But, the cuts were precise, and I felt very safe using the setup. I project was done on poplar.",
        "I dont have this jig..i have the dovetail wizard at peachtree woodworking...but it's the same jig and great... simple and accurate..go to you tube and watch the videos on dovetail wiz.....its actually that easy!!!",
        "I bought this because of the ability to use on a router table and dust collection, but in hindsight I think the other brands that can use the porter cable dust collection would be better.",
        "This is one of the easiest dovetail jigs I ever used. I haven't tried any of the high dollar jigs, but this one is well worth the money. The setup time is minimal. If you know how to cut dovetails by hand, you will notice the simularities. I got a perfect cut on the first practice try. The joint is very tight and looks real nice. You can even be a little creative with this jig, to cut some dovetails that don't look so \"machine cut.\"If you are looking to purchase your first dovetail jig, this is the one that will give you some good versatility.",
        "Works well. Little setup and easy to make nice dovetails. Definitely worth the money I spent. Good quality also.",
        "My husband loves this. He said it's made very well.",
        "The Keller jig is the best. Tried some others, but wish I had discovered this one first. The Keller company was also very good about replacing one of my bits when the bearing burned out. The jig appears to just be designed for one pattern, but with a little creative use (and some careful measuring) you can skip either pins or tails and make your own pattern.",
        "Works great but it's pricey and you have to develop your own clamping system. I've yet to arrange one that works quickly/efficiently despite a few attempts/designs.",
        "I have never made dovetail joints before. This product was easy to use and does a great job. There is always a learning curve and early mistakes. I did have some trouble with the joints being a little too tight and I had to file a little to fine tune the fit. I also had a few of the pins I cut break off during the cutting but that may have been due to operator error or a weakness in the wood. Over all I am very pleased with the product and enjoy using it.",
        "After doing a bit of research I purchased the Keller Journeyman jig from Amazon. The first set of dovetails I cut using the jig were perfect! The only setup required is to screw the jig to a board of appropriate thickness. Once that is done you can start cutting perfect through dovetails of any length. It is even possible to vary spacing though that does require a (small) bit of thinking and planning.",
        "It is so easy to use, and it makes perfect dovetail joints.",
        "With a price well under that of the more versatile models, I think for plain straight forward dovetail joints the Keller is the best and simplest to use. The template must be attached to a block of wood for alignment. Thereafter the sailing is quite smooth. The bits included are good and I believe readily replaceable. The ease of use is the outstanding advantage of the Keller Jig.",
        "I got my new Keller dovetail jig in a fraction of the estimated postage time. Very happy with speed. I trimmed up a backing block and screwed her straight on. After routing out a few practice joins I came to a setting (depth) that made a dovetail the tightness I was looking for. A tip for noobs (like me) is to make the pins a lot bigger than you think you will need them for extra tight joins. I am very happy with the first box I have made with this jig, and it also enables stock that is longer than the actual template.",
        "After doing extensive research I decided on the Keller system because they are the only one to use bearings on the cutters which eliminate the use of bushings on the router plate, which is a source of inaccuracies. I am very happy with my purchase, and I am now using this jig regularly and enjoying the satisfaction that comes when a perfect dovetail joint comes together (see picture of beehive in customer pic's)",
        "This dovetail jig was recommended to me by a master craftsman who is teaching me to make my own cabinets. I have no experience so I follow where he leads. My first set of drawer boxes have wonderful dovetail joints. I could not be happier and this tool made it possible.",
        "This Keller Jig, Model 1500,lives up to everything that has been said, written and raved about. This needs to be in every woodworkers shop. I am truly sorry for not buying one sooner, could have saved a lot of projects and wood. I plan on upgrading on my 72nd. birthday this coming March. Guys/Gals try it, you will love it.",
        "It was a Christmas present for our son who is in college. He said it works great. Just what he wanted!",
        "The Keller Dovetail System is the simplest system to use for making dovetails and every thing about it is high quality.",
        "This was recommended as being easy to use, but I was surprised at just how easy. What a great purchase.",
        "Great little dovetail jig compared to the larger ones out there,have used it on a couple of small boxes that i made"
    ]
}