{
    "entity": "Internal Sound Cards",
    "text": [
        "Simple. Runs on USB power. Driverless. Sound enhancements are useful sometimes but can easily be turned off. Update November 2014: Amazing that an electronic device that hit the market in 2006 is still useful in late 2014. Pressed this into service on an old Hackintosh that didn't have it's internal sound card working. Paid only $20 for this in '09 on closeout. Still comes in handy. Update May 2018: They still work! Glad I bought two of them. Still works on Windows 10, Mac OSX 10.13, and Raspbian Jessie.",
        "Had a couple of Dells that were upgraded to Windows 7 for the kids, and of course the sound cards didn't work. Bought this USB external to plug in the speakers/sub woofer and boom, music. It has a couple of cool features to modify the sound, and overall it is excellent. Solved a problem for little money. I also like the fact I can now plug this into any computer, and have sound ( you still need your speaker system). Took a little trip, brought the macbook pro, the Creative Labs and small speakers, and we had music!!!",
        "I tried to drive my Bose (shelf) speakers from my either brandnew desktop or old laptop. First, I tried to turn my old Vaio laptop into a music server. All pretty lights went on as soon as I plugged in the creature but all sound went to the laptop's built-in speakers, not to the shelf speakers. It later revealed (or maybe it's in the documentation?) that Xmod does not work with old (slow) USB ports. Then, I tried my desktop, which has only a basic sound board. It removed vast majority of white noise. I can hear them only when no music is played.",
        "I purchased the Xmod for my Ipod. It worked wonders from the very beginning. I placed it between my 80GB Ipod and any speaker system. I even use it in my car with astounding results. It brings all of my MP3 tunes right back to life. I get a rich full sound at home, from my computer or from my Ipod to my home theater sound system. I also get this same outstanding sound in my car. All the amazing deep lows to the highly defined highs are your with this amazing product from Creative... Dan-N-Oregon",
        "The sound card in my laptop died 3 years ago, but I just didn't get around to thinking of a replacement, as I would hardly be using my laptop for music and such. However, when I finally got around to buying this, I was ecstatic! I could finally listen to music in my laptop again, and I realized what I'd been missing. The sound is so good, its almost like listening to a home theater while sitting anywhere you wish! I love its cool stylish looks and the carry bag is uber useful. Worth the money!!",
        "my integrated laptop sound card died a week ago and i search the web and decided to buy this. the drivers for the product are open source so they automatically work in Ubuntu, just plug the usb cord into the xmod and your computer and your ready to go. at first i was disappointed in the sound quality but once i messed around with the settings i was able to resolve the crackling sound. pros: small easy to set up and use cheap (paid $32 at the time of this review) cons: included ear bugs kind of suck but i have my own so its ok",
        "I really love this idea and this thing. It works flawlessly with my iphone and an USB charger on my car. My dad thought I upgraded the speaker on my car when he listened to the music from my iphone. I also brought it to my work hooked up to my laptop. I just want to bring it everywhere. Thanks Creative for this wonderful product. It makes listening to music more fun than before.",
        "Offers a pretty good improvement over a built-in soundcard. Straight-forward to use as well.",
        "Had seen this a number of years ago. Couldn't pass it up at the lower price. Does make the music sound better. I found the improved and more defined bass to be the most noticeable improvement. If your sound card is trashed or not up to snuff, this is a must, otherwise worth the lower price for reasonable sound improvement.",
        "Anyone that has ever owned a creative sound card before knows what a pain it is if you loose the disk that came with it to get it actually working again. Especially since they have something against putting their original drivers and software on their site! GRR! Anyway, this thing does not even come with a driver CD! You plug it in, and it WORKS! Really digging this new way they are working towards!",
        "I got this just to have an external sound card, but didn't get what I was expecting. I got much, much more. The X-Fi crystalizer works extremely well, and the X-Fi CMSS-3D feature adds a nice touch, but doesn't always benefit the music. Definitely get it if you need a high performance sound card for your computer. This isn't really portable, just because of the power source limitation.",
        "The earphone jack to my Dell laptop broke, and replacing it would mean a new motherboard since it's all attached. As this is the way I normally feed audio out from the laptop, I needed an inexpensive solution, and this was a great find. Great quality sound, ultra-simple design, affordable price. Good stuff!",
        "Works great, also controls sound level on the fly is a great plus. Very nice quality, although, note to audiophiles and enthusiasts, CMSS3D and Crystalizer not recommended. Great performance, got mine for 25 on sale. Recommended",
        "I was about to buy a slightly cheaper turtle beach product when I saw this beauty on Amazon. My computer's line out jack got totally worn out and anything plugged into it hums like crazy and sounds awful. This product is a great replacement sound card. The big volume control is handy, and the thing feels solid and well-constructed. I've had a lot of good experience with Creative products before, so I was expecting decent performance but once I listened to the Xmod on my home stereo I was immediately pleased and impressed.",
        "makes the streaming internet radio sound so much better! plus, then there's a convenient volume/mute knob without having to right click on the system tray icon, yay! Update - still works great after using it for over a year!",
        "I bought this product since my computer's on board sound microchip was broken. The quality is OK. I am not a specialist of music, so it is OK for this price. I hope this product have little more volume. it bit quiet. I personally I do not like to use effect, but I think it is good for the people who like adding effects. some of people said it has hiss noise but I do not hear hiss. It must be depend on the location of the product or computer. So far it is OK",
        "This is a great product, especially considering the price I paid. It is so much better than my laptop's sound card. Regarding the white noise issue, initially I did notice it for some classical music. However, after using it for several weeks, the noise level is dropping significantly and I can hardly notice it anymore. Either I have gotten used to it, or the product requires some burn-in time, after which the white noise virtually goes away.",
        "I bought a few of these for myself and for gifts. This device does change your music/sound well. I like the remote sound control from the knob, cool blue led's and fancy bag and ear phones.",
        "The product is easy to install on both Windows and Ubuntu. I was initially worried about compatibility with Ubuntu but it is actually easier to install as no extra drivers are required and the sound card is automatically recognized by the system. The sound quality is very good, and I could not have gotten anything better at this price.",
        "My girlfriend and I purchased the Xmod in December 09 so she could listen to music through the Xmod and Video call through her laptop speakers. The Xmod worked well with XP. She recently had to buy a new computer with Windows 7. The Xmod will not work with Windows 7 and Creative has not updated the driver. Inquiries to Support have gotten no reply. I would not recomend buying the Xmod in particular or any other Creative product in general. Creative has a \"new\" USB device that works with Windows 7. All you have to do is cough up another 55.00$.",
        "Nice product, excellent sound fidelity. Easy to use. I use it with my music system and PS3. Creates very realistic sounds with the 3D surround sound option enabled.",
        "What a great product! It performed flawlessly right out of the box. Just plug your speakers into the unit, instead of the back of the computer, and you're golden. Thanks Amazon for offering such a great product!",
        "This is a great device, and I'm satisfied with my purchase. I use it in a Mac running Snow Leopard; sometimes the device is unresponsive after a wake up the computer from \"sleep mode\"; I'm not sure if the cause of the issue is the computer or the device, however this doesn't really happen that often.",
        "It mutes the sound every time my computer comes out of sleep. Have to replug the USB cable for sound to come back...Very annoying!",
        "I bought it at a discount price of $19.99. It does improve the sound quality of my laptop (HP HDX16t). However, my earphone (Shure SCL5) is too sensitive. Xmod just makes zzz noise with it. When I use Shure SE110, there's no such noise. Therefore, I recommend Xmod to those who use not-high-sensitive earphones. Btw, the original price is too high compared to its real quality.",
        "X-mod X-quality sound, It restores and gives a new lifes to your MP3 songs sound quality.",
        "buy it and you will love it , spend the money on good earbuds though",
        "I searched around for a quality USB audio adapter for the Mac. I had a hard time finding one that would sound great and work without drivers. This was exactly what I was looking for. Audio quality you expect from Creative Labs combined with driver-less installation on Mac OSX 10.6. Highly recommended!",
        "Does a fine job of adding another layer of quality to digital recordings. Enhances both the highs and lows. A bit expensive and definitly not portable. It has to be powered by a USB port.",
        "Works great n my laptop that I bought another one to use in my garage/man cave system. So much better than trying to connect the headphone out to a stereo system.",
        "good for 2.0 speaker and headphone work good for real music, not for some popular junks",
        "I like it. You realy can feel the difference. It has 2 additional functions. First gives you 5.1 channel system feeling even when you listen to headphones. And the second recreates the mp3 songs, so they sound more live.",
        "it works perfectly in windows vista, the effect is as good as it is advertised. but it produces buzzzzzzzzzzz noise when it is working in Ubuntu Linux. Since Ubuntu is my major working OS, I have to return it for refund, what's a pity ...",
        "Beautifully packaged - Easy to use - Didn't DO much - Overpriced for what it did - My particular sample cut in and out (internal short? poor quality control for sure.)",
        "I guess this is a simple amplifier, but it does improve sound quality (at least to my ears which is important). Mechanics are pretty flimsy though.",
        "WARNING NO CUSTOMER SERVICE I purchased this for gaming and all I hear is popping noise in the background....called the company and the guy told me must be something of mine doing it he has one and it works.......never had the problem until I plugged this in took it out no more popping.",
        "The product is fine and performs well but it is difficult to install and configure, nevertheless it produces good sound.",
        "I have a Mac Book Pro and a Mac Mini. It lights up and I can control the sound, however the sound only comes through the PC speakers not through earphones or external speakers. I tried this on both Macs. Actually now, I got it to work but only when I had Windows running on the Mac. So, it's not the Mac. It's the OS and that appears to be Windows only, not OSX. Sending back."
    ]
}