{
    "entity": "Internal Sound Cards",
    "text": [
        "This is a nice card, I own an Alienware MJ-12m and I needed better sound. No problems at all with this card, just pluged it in, installed software, reboot and all done, working like a charm. Sound is very clear, rich bass even with headphones/earphones; games sound awesome... :D",
        "not the greatest, it works until you try to safely remove it from windows. then it blue screens. also installs a bunch of stuff at startup.",
        "It turned my laptop into the sound that I get on my PC with Audigy 4-- a great product---what they say it will do --- it really delivers",
        "I have a laptop with original sound card mother board malfuntioning. The PCMCIA and sound blaster Audigy 2 ZS is a suitable and more powerfull alternative than replacing the whole mother board to solve a audio problem. I am satisfied with this less expensive problem solver. Thanks and regards Gustavo",
        "Product was as described. Received in good order. Very satisfied with vendor's service.",
        "This audio card was bought for only one purpose - to record \"What U Hear\" for a Vista PC. It doesn't work in that capacity and no properly working software appears to be forthcoming from Creative Labs. The card has proven worthless to me.",
        "I never got to use mine because I was unaware I needed an adapter to use it on my laptop. Be sure to check the specs. The adapter isn't cheap!",
        "This sound card has great sound over the standard on-bourd sound that a laptop comes with normally. Like one reviewer said though, you can still get really good sound from the default hardware and software provided with the laptop. Some advantages of this are: - S/PDIF - fiber optic output - Bundled software gives greater control over your sound allowing you to tweak it to your environment Some of the software seems like a waste of time - like DVD audio player that doesn't seem to support the S/PDIF output. The card extends beyond the laptop making it harder to pack in a laptop case, so it is difficult to travel with. Overall I am happy with the purchase.",
        "I've had this card since it was new to the market because my laptop is all I need as far as computing but those laptop speakers just don't cut it for my music passion. I bought some speakers that just plug into the computer but it just doesn't have the capacity to transmit the sound without error so I decided to buy this card and WOW ! it encodes the music into such a pristine state that I have actually had people compliment the sound of my music as better than the exact same CD they have. If you appreciate sound for music or games this card will complete your life.",
        "This card is incredible! I tested it on my old laptop and the sound was unbelievable. Problem: I changed my laptop and it now comes with a ExpressCard slot as opposed to a PCI slot; can't fit the card anymore! I'm screwed ... Please Creative, when are you releasing the ExpressCard version of this product??",
        "This sound card is alright. I would recommend NOT buying this soundcard if your laptop is not high end, or is slow, low ram, or constantly using up a lot of CPU speed. I have the Gateway Tablet PC, and at first I had a lot of problems with this card, but after about 2 hours of configuring it, and my computer, it now runs with no problems in high end games. I also have a lot of experience with computers though. If you are going to be playing high end games then I would recommend getting this, if you are only going to be playing music, find an alternative.",
        "It is really a state-of-art SC, but it couldn't fit into the slit of my new DELL computer, so I had to turn it back. A friend of mine has the same one and is more than happy with it, but a piece of advice; before you buy it, make sure that it's compatible with the latest generation of your laptops!!!",
        "This card clears the sound right up on my new logitech z-2300's. Easy enough to install, and the audio software is easy to operate.",
        "This is my second card, the first was stepped on by a youngster. I have a very high end laptop, but the sound is terrible. Using this card and decent pair of headphones does the trick. Good quality and easily installs. I think creative did a good job with this product.",
        "This is my Setup. Dell 9300 alright laptop. Smooth installation of 20 minutes + a Reboot. Sound quality is really good. Didnt hug my resources. Totally worth it. Recommend 100%",
        "Great sound, fantastic features.I am using it with DVD playback on my Laptop. Eexcellent product.",
        "Don't waste your money, I've had it over a week, the only thing I hear is static coming from the notebook speakers, have yet to hear anything from external speakers, spent hours trying to resolve the problems. It's going back!"
    ]
}