{
    "entity": "Internal Sound Cards",
    "text": [
        "This is a pretty neat gadget and it does what it says, just not as effectively as it claims. I'm attaching this to my Bose Cinemate and it provided me wth the Bass control I was looking for. It depends on what you need it for, most new TVs already have a simulated surround effect, but if you are looking to control a 2 channel speaker system to go from stereo to surround to bypass with the touch of a button then this is right for you. I gave mine a 3.5 star rating because the volume control did not work, not for audio processing. another down is the analog connectors. But for the price, can't complain.",
        "I can't say enough good things about this product! Obviously nothing replaces true 5.1 or 7.1 surround sound, but this very well may be the next best thing! I am using a 2.1 speaking stereo system and I used to have to turn the volume all the way up to get a decent amount of sound from it. Now, I'm using about half the volume I was, and I'm getting the amount of base from the speakers alone, as I was with my sub woofer! The sound is clearer and crisper too. Great investment for $11.50! Love it!",
        "I got this not knowing what to expect but I'm glad I did. I have it hooked up to a Colby surround sound system that needed an extra boost and this does the trick. You can adjust clarity, stereo output and bass with the small remote. The sound is a HUGE improvement and converted my 50 dollar speakers into a true surround sound theater and at the price you really can't go wrong. Note: The little led indicators light up red when it's on. Just a tip for those who are concerned with the visual stuff.",
        "I stumbled across this amplifier/pre-amp on Amazon. It was quite inexpensive and appeared to meet my special needs. Unfortunately, although it has a remote control, as advertised, the remote does not adjust volume. This greatly limited it's usefulness for me. However, as as a straight-on small stereo amplifier or pre-amp, it does well given its very low price as compared to most others that are available.",
        "I would definitely not have bought this product for it's original price, but at $20 it's worth it for sure. It doesn't make your TV sound like it has surround sound, but it certainly does make dialogue in surround sound movies more clear. The only thing I wish it featured were controls on the unit itself... I'm constantly losing my remote and without it, your stuck with whatever settings you have it on.",
        "I don't care about surround sound or home theater, but I've been having trouble hearing spoken words from my TV--it sounds muddled and indistinct. (20 inch Samsung LCD, also others before it.) This Xitel SoundAround product makes the sound rich and full and focussed and intelligible. A remarkable achievement.",
        "Nice compact product that does what was advertised. Makes home movies with my Bose 3 speaker system sound better with control of the bass. Cannot go wrong with the price!",
        "This sound processor is not user friendly. The remote needs to have the 4 buttons renamed with explanations or a manual should come with the processor so I know what I'm doing. Two buttons say \"Mode\" and there is one for \"Truebass+\" and Trubass-\" It's confusing...but I finally get the sound to be what i want.",
        "i give this 4 stars instead of 5 because its not as spatial as i thought it might be towards full surround sound. but it has other enhancements that takes my movies, music and xbox 360 to another level. i still highly recommend this processor for the price point alone. good buy.",
        "Provides very clear movie dialogue and enhanced bass when used with 2.1 stereo systems in small living rooms and bedrooms.",
        "I mainly use it for accentuating bass, and it is good for that. Get the most out of your small sub with this.",
        "I us this devise at lease 3 times a week simply to clean up old tapes and lps tranferted to mp3",
        "Bought 5 of these. They really do improve the quality of the audio. The clarity setting improves dialogue greatly. Worth every penny.",
        "I use with gaming headsets and love the sound!If you are on a budget and want a little surround sound action buy this.",
        "It's a straightforward soundgooderizer, fun to play with if you like tinkering with sound or if you simply must get more bass from the speakers you already own. The TRUbass really does add a lot of boom, more than I care to hear.. Couldn't help notice the power supply is 12v dc... this thing could probably be installed in a car by someone who's got a little wiring experience.",
        "I bought this for a very cheap alternative from the Turtle Beach DSS. This is a good very good alternative if you want to save $60-$70.",
        "There are almost no difference between the modes. Surround mode with clarity engagen somewhat improves the sound when watching a movie. But in surround mode there is a boost in loudness. It is difficult to judge the true level of effect. Very Very noisy headphone amp. This unit is useless!",
        "Unfortunately, I purchased this to plug directly into my LED TV to play DVD sound but found that due to my set configuration, it would not work properly. However, it did work fine after connecting it to the dish receiver and greatly inhanced the sound. I strongly recommend it for it's intended use which appearantly is not intended for my purpose.",
        "The SOUNDaround Surroud Sound Processor made a profound improvement to the sound of my small library sound system consisting of a CD player driving a computer sound system (Altec Lansing). The remote control allowed both with/without comparisons to be made (which were awsome) and the \"tuning\" of the best set of sound enhancement for the small system. The result was great sound that rivaled that of my other far more expensive amplifier driving large speakers. The performance from this compact and inexpensive system (CD > SOUNDaround > Altec/Lansing) is certainly worth the cost to add the Surround Sound Processor.",
        "Improves sound somewhat, including dialog clarity. But not really worth more than $30 or so. By the way, it originally sold for $100. It's selling on the company website now for $70. It never had a list price of $141 as Amazon claims. Typical price inflation by Amazon so they can claim they're giving you a bigger \"discount.\""
    ]
}