{
    "entity": "Centrifugal Juicers",
    "text": [
        "DO NOT BUY this juicer!! Breville does not stock the filter basket which you WILL need within 2 years or much less! Shame on you Breville, after less than a year and a half of light to moderate use, the machine hemorrhages juice during use, as the fine mesh screen filter disk becomes hopelessly clogged, and BREVILLE KNOWS this is a common issue with the machine. It is a GREAT juicer, the least Breville can do is STOCK THE PART! BJE820XL/17",
        "This is my first time juicing. I couldn't possibly ask for more. Easy to set up, easy to use, and extremely easy to clean. It seems to suck out as much juice as possible, because what's left inside is completely dry. I have had no issues and I hope it stays that way. So far so good, now it just has to stand the test of time.",
        "I never review stuff but after 4 years I can say this juicer is the best. It's made my life healthier and happier, and the customer service is off the chain. I stuck the pusher in my dishwasher on a high heat setting once by mistake, and it expanded, looking all crazy, not fitting into the mouth anymore. I called CS, they replaced it immediately for free. Replaced my basket now, it's so awesome. There's just nothing bad about this. It's working perfectly after years of daily use. I wish all companies and appliances were like this one.",
        "I was looking for a good juicer in order to start drinking celery juice in the mornings. I was going to purchase the smaller motor one that is a bit less pricey but decided I could probably do more with the faster motor. I have had my juicer for about 5 weeks now and have made juice every single day. It is perfect for celery but my favorite is kale, apple, cucumber. I have juiced carrots, grapes, pears and pineapples too. I recommend using a small liner or trash bag on the waste bucket part for easier clean up or if you want to save the fiber. By the way the celery has done wonders for my skin and stomach.",
        "This was my second Breville. The first one I purchased directly from the store. This one is a defect. It splashes juice from the sides and from the plastic juice pitcher lid. I have to cover the lis with a towel in order to keep the mess under control. I am not at all satisfied with this juicer. I wouldnt ever order appliances online again. Paid too much money for a defective product. Probably refurbished 😞😞",
        "The machine quit working after only two days of using it. Also it spit out small black pieces of rubber out of the bottom of the machine. This is also the second breville that has broken on me in the last six months. I was juicing ginger when they both broke, but they advertise that it can handle ginger which it obviously can not. The machine was very messy with juice squirting out of the top. Also the machine puts off a lot of noise, to the point you almost need ear protection. The pulp that it leaves behind is full of juice as well.",
        "Worked great for about 8 months than it started leaking and spitting out the juice from the side by the discard container. I cant order another blade replacement due to they are on indefinite back order. Cant use the machine anymore because it is so messy that I have to wash down the counters, walls, and the floor after making juices. Plus the company does not respond to complaints and there are no replacement parts available.. If you want a product that lasts less than a year this is your product!",
        "I liked this juicer for about 6 months. Then within the 2 months it just started spitting out all this liquid from the back, on the sides and now the front!!!! Also it wasn't completely grinding everything up. I went over everything and connections etc, everything was as it should be. I found the basket to be clogged and they want 120.00 for a new one. Turns out they do not support their warranty and I cannot reach them. This is a known problem Buyer beware!!!",
        "Would not recommend. I’ve had this product less than 6 months and it’s a disaster - once you’ve used it for a few months, the parts start to not fit together properly and what you end up with is juice and matter exploding all over the kitchen and all over yourself which requires a full clean up operation and a shower. Half the juice ends up on the kitchen counter vs in the plastic jug. Paying this price I would expect this. Very disappointed",
        "I have gone through a few juicers in the past 20 years and this one is the most well made, sturdy machine yet. I use a plastic bag in the pulp catcher for ease of clean up. Love the two speeds. the off button and the quart juice pitcher. It takes up some space, but it's space I am willing to give up. The ease of cleaning is a plus because I actually use it.... every day. I can juice a whole head of celery in less than 10 seconds, an apple in about the same time and a lb of carrots in less than 15 seconds. It's my new favorite",
        "I purchased a Breville 800JEXL Juice Fountain Elite 1000-Watt Juice Extractor for $298.89 on September 25, 2019. Today, I juiced some celery, turned off the machine, then when I went to turn it on again, it did not turn on. This is my second Breville juicer of the same type. The juicer prior to this one lasted 3 years, which is good. For this juicer to not even last one year is very bad. Please advise. Thank you.",
        "I’ve used this probably 4 times and it stopped working! Totally dead. Tried to reset and pop the plug reset and still nothing!",
        "I just got this juicer a few days ago. For the price it has some issues. First of all it’s a lot smaller than the one I had in the same model about seven years ago. The container is also way smaller. The motor seems very powerful but unfortunately juice is spewing out from all different places on the juicer and I provided a video. Something this expensive shouldn’t have faults like that.",
        "I have seen comments in the reviews about juice spewing out of the sides of the machine and all over the counter. This is not an issue with the machine. This happens when the stainless steel screen filter gets clogged. When my filter gets clogged, the same thing happens. I tried everything to clean it. I soaked it in hot water and lemon juice like the manual suggested, I put it thru the dishwasher, etc. Nothing worked. I googled a solution and someone suggested scrubbing it with the nylon brush that comes with it and baking soda. This works! It makes your filter look brand new again. Super easy and inexpensive fix!",
        "In the beginning, it was amazing. But after using it less than 10 times, the machine started not working. The troubleshooting guide doesn't help. There is no contact information for the customer service. I don't think it's worth this amount of money.",
        "I have been juicing on and off for the last 30 years... I have purchased all the latest brands of the time ...Champion, Jack La Lane, Green Star,etc. I have never been so happy with a product as I am with the Breville juicer ... It exceeds all my expectations... It extracts juice from soft fruits to hard vegetables like a high end commercial juicer ... The pulp it leaves behind is bone-dry ... Easy to assemble, easy to clean ... and beautifully styled ... I recommend it highly ...",
        "Do not waste your money. This blender does not full blend your fruits and vegetables. I've had to reblend three or four times to full extract my fruits and vegetables. It sometimes shutes out large pieces of fruits & vegetables which is a waste. It is also big a bulky on your counter top. Go with a slow juicer that will fully extract all of your fruits & vegetables.",
        "This is a state-of-the-art juicer for the serious juice-lover. It has a powerful motor, it’s a professional-level Appliance, and it is pretty easy to keep clean. Most parts except the base are dishwasher safe. The juice quality is exceptional and you can easily save pulp for other uses. I bought one many years ago and gave it away to a relative, which I soon regretted, since she did not either appreciate it or use it much. I decided to go ahead and spring for a new one and I’m glad I did.",
        "this is quick to setup ,clean,pack away. plenty of power for the amateur .plenty powerfull. i juice beets raw. it swallows carrots. and it doesnt make the juice warm . carefull cause if ur like mw (straight to the point) u will get lazy n skip steps like removing certain parts of certain fruits,typicaly white parts that make the juice bitter. i was throwing whole lemons in there ,theres juice to be had from the peel but no it isnt \"lemony\" and messes up the juice flavor",
        "Can attached hose to go into bucket. Blended 200 apples in less than an hour. This thing is kinda loud, it spins up like a jet engine. If you wanna blast through a lot of produce then this one is for you. It doesn't do well at all with spinach or greens and small peppers so if you wanna make hot sauce this isn't the blender for you. If you have a few apple trees then i would recommend this one because of its inlet size and speed. Very nice, worth the money :)",
        "I've owned a few different juicers in my days and this one has been the best. Honestly, the low setting works for everything. For hard veggies like carrots, the high setting works well but to get the most juice out of pretty much everything, just use the low setting. This is quality, easy to use and easy to clean. I juiced for two straight weeks and it worked perfect. You can just feel the quality of this thing. It delivers excellent results every time.",
        "I love my juicer. This is the first time I have purchased a juicer, so I have nothing to compare it to. However, I love what I have, not sure it can get better than this. It's very easy to clean and use. I'm shocked how much I enjoy juicing my fruit and veggies. I've created my own blend of navel orange, carrot, pear or apply and ginger. I drink every morning. love love love. Highly recommend!",
        "I LOVE THIS JUICER!!!!!! I moved from a slow speed masticating juicer to this one based on all the amazing reviews and insight. Also wanted a juicer that could juice cabbage easier than the masticating juicer. It works fabulously for that and all the other fruits and veggies I've tried juicing so far - apples, lemon, celery, ginger so far. It is louder than my old Omega juicer but the juicing process is so much quicker the noise is completely bearable. ALSO so glad I don't have to cut all my veggies into small pieces anymore - BIG BONUS!",
        "This has to be the best juicer out there! Sure, it’s expensive. It’s also awesome. Super fast. Good looking. As easy to clean as any juicer. Dish washer safe, though I usually wash it be hand. I’m delighted! Update and one star removal- I'm sorry to report that I had to remove a star. I’ve been diligent in washing the different pieces by hand so I thought it was probably time to run them through the dishwasher. Even though I followed their instructions and put it on the top of the rack, the pieces got rusty. I managed to scrub off the rust but the discoloration remains. I’m very disappointed.",
        "We have a bunch of juicers and this is the best so far. Its not the most efficient but its by far the fastest. So if you make a lot of juices and don't want to take the extra time to use a twin gear juicer then this is the one for you. It halved the time for us to create fantastic healthy vegetable based juices. It makes in way more usable and is still relatively efficient. Prior to having this juicing always felt like a major hassle, now it doesn't, and consequently we use it every day.",
        "Very well made. Not too difficult to clean. Works well. Make sure to put something under the spout to catch a few drops after the pitcher is removed. Experiment with different combinations of fruits and vegetables. I juice most fruit and vegetables. I then add the liquid to a blender to make a smoothie with melon, avocado, banana, etc.-- those items that have little liquid. I may add some honey if the mixture is too \"earthy\". I cannot testify to the actual health benefits of juicing, but I do love the flavors. This is a top of the line machine from a reputable company. I have many Breville appliances and they all work perfectly. Highly recommended.",
        "I wish that I would have bought this 9 years ago instead of the omega vert which in resting in the garage. It only takes me 5-6 minutes to juice 3 qt. of juice and 5 minutes to completely clean up. I would spend up to an hour with the Omega. The slow juicers do greens better, but the time saving is worth not extracting all of the green juice. If you are only doing 8-12 oz you would finished in less than 3-4 minutes. Watch Joe Cross video.",
        "I give a good amount of pulp to my neighbors to for their gardens. BUT, on days when I wash the pulp down the drain, there are good size pieces of carrot, celery, apple, the juicer blows out without juicing. I like the unit, it was a step above my previous juicer, but for the $300+ price tag, I would rather have purchased a masticator. On a cleaning scale from one to five, there are edges that will get you if you're not careful. It's a solid three all around.",
        "DON\"T BUY IT. It will leak. I bought this JUICER to replacee a Jack Lalanne that i had for several years thinking this would last me longer, The unit is powerful and seems like a good unit. The problem is that it leaks on the sides of the large pulp container upper section where it meets the cover. That locking mechanism is a No brainer and the unit worked well for a little over a month, i probably used it no more than 20 times.",
        "This juices veggies and fruits quickly. I often make 6-10 gallons of fruit/veggie juice at a time (and freeze in individual jars) so that I always have fresh juices on hand. Have also used it for my pear, muscadine and satsuma harvests! Juiced an entire tree of pears in about 5 hrs - yielding 12.5 gallons of pear juice (from hard cooking pears). I get 30 gallons of satsuma juice per year and 2+ gallons of muscadine juice each year! I freeze these juices for my family to enjoy all year long. Been using it for over 2 yrs now and never had anything break nor replaced anything. Worth every penny I spent on it!",
        "I would have given 5 stars if it cleaned itself. Great Juicer, probably the best on the market.. only drawbacks are the size and weight of the juicer. This is not a machine you are keeping in a cabinet and taking it out once or twice a day, this is a counter fixture ( why I bought this sharp looking model), It makes great juice. It is not too hard to clean if you clean it immediately. You have 6 parts to clean, only one takes a little elbow grease that is the mesh basket/blade which needs to be cleaned well with the provided brush, every thing else is a quick sponging rinse. Highly Reccomended !",
        "I bought this unit to replace a juicer I've had for 10 years. Before this, I'd been juicing once a week. Now I'm doing 4 or 5 times in a week. The most obvious difference is the speed @ which this unit runs through the fruit & vegetables, VERY fast! It's easier to clean & since the parts are a better quality, metal instead of plastic, it's cleans up faster & more effectively. Good quality! Good value as I bought it on Black Friday.",
        "After researching several different juicers we decided to go with the Breville. Took it out of the packaging, set it up and started to juice. One problem, it never turned on. Despite reading the manual a second time and researching on line, we can't get this unit to work. Everything points to an internal fuse that according to Breville is not an easy fix. We are sending this back for a refund.",
        "I thought it was a good choice to purchase a high end product that had many reviews in order to invest once in a product I could use for a lifetime. That proved to not be the case when I used it and the juice spills from various places from the machine. The waste is greater than the actual juice I am getting from it. Not to mention the times the juice has pureed all over the counter. I have a video but I don't know how to upload",
        "This is my first juicer. I wish it extracted a little more. At times the pulp is too wet...most of the time it is moist, but at many times, depending on what you are juicing, it is too moist for me. I feel badly about wasting all of that wet fiber. It does not juice greens well...you get very little juice. Things like peeled oranges, carrots, beets, apples, unpeeled cucumbers...juice really well.",
        "I brought this juicer in august of this year, and it stopped working exactly on the 31st day after the return window closed, trying to contact the manufacturer but never get them on the phone, do not buy this item..",
        "It leaks, from between the filter bowl and the juicer cover. I have tried checking, rechecking, reseating but it still leaks. Also the \"Nutri disk\" (cutting disk and screen) is hard to clean. I have to soak it every time, for a long time, before using the 'supplied brush'. Considering the cost, and reviews, I had hoped for better than what I got.",
        "This is the best purchase I ever made besides Vitamix. This machine is miraculous. I do 15 lb of carrots+beets+celery in one cycle, just emptying container twice. Juice output is amazing. Cleaning takes 3 min. This juicer is like commercial for a fraction of price.",
        "I can produce 3 times the juice with this juicer compared to last 3 juicers and easier to clean faster. All makes a difference. Love it, and powerful, and not likely to break. 6 stars. Dr P.",
        "Purchased December 2017. As of May the juicer spits out of the front and sides. The pull is totally wet, the strainer is almost impossible to clean based on their process. I am wasting a lot of vegetables. I juice celery everyday and it absolutely is not juicing properly in the last month.",
        "after a brief period of initial use, the juicer increasingly performed poorly. more and more leaking (we have to drape it with towels to use it at all). less and less juice (we press the pulp again through a strainer by hand to get much juice at all). we love our other Breville products and happily pay a premium for quality. but this juicer is basically unusable. very disappointing.",
        "So far.. \"I love it\" - For those complaining about poor leafy juicing with this machine - make SURE your screen is clean ALL THE TIME. I had this issue - at first it was doing pretty good - then hardly nothing came out..(mostly with leafy stuff) It's easy to clean, works well so far.. I will update this review as time goes by - I just got mine been using it for 3 days now doing the \"Super Juice Me\" 28 day challenge.. I would - though - recommend a blender with it if your doing this particular challenge as you need one for some of the foods (like avocado/banana etc)",
        "This is not a Juice Extractor?! This is a Jet Engine! The cosmetic reminded me of the Rocket Man's Jet pack. You will not regret purchasing this juice extractor. It is well machined and balanced. Please read the user manual carefully and watch all the online videos related to this juice extractor. This is a very, very powerful extractor. The extractor components easily disassemble for cleaning. During cleaning, be aware of the filter bowl machined edges and the sharp blades at the base of the stainless steel filter basket. After cleaning, assembling is not difficult; just make sure extractor components are firmly positioned. More importantly: Don't let kids near this extractor!",
        "Cons: Dislike that some of my produce came through in chunks into the waste bucket. Must be watchful to keep collection container close to pour spout. I made a mess. Pros: I Love It! Easy to use is an understatement. Comes completely apart to rinse. It has two speeds for different types veggies/fruits. It seems very well made. I like stainless steel, does not hold germs. I would recommend this product. Excellent for those of us that want to live a Juicing Lifestyle.",
        "We love it’s juicing capabilities and clean up is easier than our last model BUT at this price point we shouldn’t have pulp splashing out at the top",
        "This juicer worked great- once. I’ve only used it for celery but I’ve now tried to juice 5 times with no luck. The juice seeps out between the plastic cover and the bin and barely any goes in the container. I’ve wasted a ton of time, a ton of celery and made a complete mess. I read reviews and then tried to do it on low so this wouldn’t happen, but no luck. I had my husband re-set it all up but no luck.",
        "I have owned this juicer for nearly 4 years and really do like it, but it doesn't do well with leafy greens, and the basket does wear out. The problems come with trying to get a replacement basket/blade. They do not have them! I have been waiting almost 6 weeks now and still have no idea if I will be able to get one",
        "This juicer stopped making the amount of juice it did when I first got it. Juice amount went down to about a 1/4 Of a glass compared to a full glass of juice.",
        "I am thrilled with this Juicer. Many years ago I had a Juiceman Juicer, which I loved. But I HATED the cleanup, and eventually that is why I stopped using it. The Breville 800JEXL Juice Fountain was expertly designed. After I clean the fruits and vegetables that I am juicing, the Breville will juice them all in under a minute. And the cleanup takes me only about 60-90 Seconds! Needless to say, I am impressed, and I absolutely love this juicer. It is one of my best purchases ever!",
        "It’s the machine I always dreamed.. easily to clean and faster to juicing. I’m really love it!!!",
        "Are these refurbished? Because I paid more than what was listed on the actual breville website for a new one and there are actual signs of being previously used and/or refurbished. Did anyone else have this problem?? Just received it today. I am highly disappointed.",
        "It works well and is easy to keep clean. However, it is rather large so I can't keep it out, therefore it doesn't get used often. If you do plan to use it every day and want something that looks attractive on your countertop, Breville does well in this regard. I have never used another juicer so I don't know how it compares to other products. I did go through lots of product reviews before I purchased and felt that I got exactly what I expected and that the price, though higher than I'd like, was reasonable compared to competitor's products and appropriate for the appliance quality.",
        "I JUST RECEIVED MY BREVILLE JUICER. I'M ABSOLUTELY IN LOVE WITH IT! I MADE A HUGE JUG OF CELERY JUICE AND EVERYTHING ABOUT IT IS JUST AMAZING. THE CLEAN UP WAS SUPER EASY-- IF YOU READ THE INSTRUCTION MANUAL THERE IS A CHEAT IN THERE ABOUT LINING THE BIN WITH A PLASTIC BAG-- CUTS OUT ONE MORE THING YOU NEED TO WASH. JUST PULL THE BAG OUT AND ALL THE PULP WILL BE IN THERE. I CHECKED THE PULP AND I MEAN THIS MACHINE DIDN'T WASTE ANY JUICE- THE PULP WAS FAIRLY DRY TO THE TOUCH. COULDN'T BE HAPPIER WITH MY PURCHASE.",
        "I have tried 3-4 different Breville and Omega's and this the best! Love the stainless steel parts not plastic, blending power great, not too loud and you don't have to chop all fruits and veggies into small bites like on the Omega! Well worth the money! All the parts fit perfectly so no leaking or spraying. I am loving it so far!",
        "I tried several juicers, had the model lower than this one but the plastic pieces were immediately used and not shiny anymore... like foggy. I bought another brand but the fiber was still really wet. I was following this one, like crazy to see when it would be on sale. I bought it and it is amazing, better performance than the other model and most of the material are stainless steel. I love my juicer. It is very powerful, I dropped a lemon and jumped back! LOL I use it do my green juice. Because it is so powerful there is no mess in the counter! Thank you!",
        "This is extremely easy to use and I could not feel any pulp in the juice, unlike a different one I tried and returned. It doesn't extract all the juice, but I pair this with a Welles vegetable press, and between the two of them, I think I get it all. completely satisfied!",
        "Love the design There is always room for improvement and I'm talking about: The mesh filter is hard to clean Noise level when operating on high High wind generated when operating on high Juice collector container when filled at 70% the wind pushes the juice outside and makes a mess. Juice collector container needs to be bigger Its not the best juicer for leafy vegetable.",
        "Totally disappointed. Have wonderful juicing oranges but need a faster way to juice but after using this product all my juice tasted like rind. My old juicer gave us delicious juice that never needed sweeting. Pass this product by.",
        "You get what you pay for and this unit is worth the money. Solid and beautiful design---works wonderfully for all sorts of juicing needs. Save the pulp for baking ideas and also put a plastic garbage bag inside the pulp collection unit and save yourself all the clean up. Just lift out and you are done---don't even need to rinse. Wish I had discovered that sooner. Have had other units that practically vibrated me off the kitchen counter or spit all over the place-----won't see that with this one. Be prepared to keep it on the counter unless you want to be lifting a heavy unit in and out of the cupboard. Mine stays put because it is pretty too.",
        "This is my third Breville juicer and absolutely the best yet. I doubt that it would be possible to extract any additional juice. The pulp is almost like sawdust it is so dry. The machine is quieter than my previous juicers even though it has a more powerful motor. Only complaint is that the dome doesn’t seal tightly and you can get some juice spray on the counter. This can be cured by using your veggie bags in the pulp container and pulling it up around the discharge chute",
        "This product I only used for 6 months for 2 times a week. I am dissapointed and i do not reccommend to buy. I tried to contact the brand support team and they gave me no answer.",
        "Very happy with this excellent product. Quality build, powerful motor, easy to clean, and reasonably quiet operation. Have had other juicers over the years but this one is in a class all by itself. Really enjoying experimenting with recipes. Will buy another for our daughter.",
        "I just used dozen of times and suddenly stops to work. I tried to contact the support and nothing happens. I need my money back.",
        "Great juicer, exactly what I was looking for. Gave 4 stars on cleaning because of grated basket you use brush provided to clean. Actually not hard to clean but takes little time.",
        "Wow! Very first thing we juiced was an entire pineapple with the exterior skin on it. It went right thru it like it was nothing. Huge opening so you don’t have to cut fruit into tiny amounts. Waste catch has plenty of room. I couldn’t ask for anything more! Buy it.",
        "The Aussies really know how to make a solid, high-quality product. The parts go together like a well-made puzzle. Clean-up is a breeze. It really extracted the juice efficiently. The motor sounded strong and whirred like it knew it’s business. We really like this. We are trying to incorporate celery juice into our (near) daily routine and this makes it much less painful. 😂 Highly recommend!",
        "I love love love this product. Breville doesn't disappoint as usual and presents a robust juicer for home use. It is easy to use and they provide a great instruction booklet for when you have questions. The parts are easy to clean-provided you do so not long after use for seemingly obvious reasons. It handles larger pieces of fruits and veggies in the same lineup as softer ones and separates the \"unjuiceable\" parts well. Simplistic, refined styling inclines me to leave it on the counter at all times to remind me I should be juicing more and for guests to gush over. We love our juicer and have had no issues since our purchase.",
        "What a fantastic juicer. A bit noisy but when you finish the juicing and empty the catch container, it is dry as a bone. We had a Breville before and I wanted the all stainless...what an amazing difference.",
        "This juice is awesome! It takes no time to juice fruits and veggies. Easy to assemble and disassemble plus clean up is a breeze. Very powerful motor . I had another juicer before and it was good but not nearly as fast at juicing as this is. The clean up on my last juicer was a mess there were places that you could not get to to remove pulp without a special brush. This juicer has no such problem. Just rinse in hot water and vola it is free of food particles. A little pricey but so worth it",
        "I love this juicer. Best investment I have ever made. Easy to clean does a great job. I love breville products they know how to make quality stuff.",
        "This is an exceptional machine. It literally does all the hard work for you. You can put just about anything in it and it will chop it up. It's VERY easy to clean, especially if you line the container with a (produce) bag. It's sturdy and I imagine it will last for years. It's a sound investment, definitely worth the price.",
        "It is a powerful machine, it does its job quickly. The only thing I do not like is that the pulp is very wet, so I opted to put a liezo in the trash can to squeeze it before throwing it, I have taken up to 16 ounces of additional juice, just re-squeezing the pulp.",
        "Can’t say enough about this gem Super easy to use super easy to clean Super easy to assemble and disassemble I use multiple times a day and I’m addicted It’s so easy and healthy Major life changer It’s your new coffee pot that’s healthy It provides the same energy per a drink then coffee Amazing!!!!!!",
        "Over all the juice tastes great just like the juices you pay 5-6 dollars for at whole foods or other hippie juice places that over charge you. The only downside is that it doesn't fully suck the juice out of everything. I usually insert the fruit or vegetable very slowly and at the end squeeze out the rest of the juice with my hands. Tip: if your using the low setting, which I recommend, and suddenly sounds like you have shoe in your dryer switch the setting to high until it runs normally. It's caused by the leftovers stuck onto the screen of the blade piece.",
        "Piece of junk - do not buy. Overpriced and didn't properly juice kale or lemon.",
        "This is my first review ever on Amazon, and I had to do it because this juicer has caused so much stress for me. First of all it’s sooo loud. Second, It will not juice your greens properly. I had to run the pulp through 4-5 times to extract the juice out of my greens. It’s such a pain to get 16 ounces of juice. It started acting up after 1.5 years. And it finally died today after 2 years of minimal usage; RIP Breville juicer; we will not buy another one of you.",
        "Do not buy this! This item completely broke within 60 days of me using it. I am very disappointed!",
        "This is a beautiful piece of equipment. It is like art. The output container fits snugg with the machine. The pitcher that catches the juice, isn’t shown here but it looks great and is snug as well. Not too loud. Not difficult to clean. Comes with a brush to clean the filter. This works fast to make your juice. Quite unlike a slow masticating juicer. I use is almost daily.",
        "Borrowed a Jack LaLanne after inserting one cucumber I tried my new breville. This machine is a beast easy to clean very satisfied",
        "I give it one star because it came with a disfunctional power button. Works good but i have to spend sometimes about 1 minute trying to turn it on.",
        "So bummed that after 3 months, the juicer is making horrible noises when I try to juice. This cost too much money for this to be the case. I will call customer service on Monday and see how they stand by their product!",
        "I have tried several juicers now, both masticating and centrifugal...and this is the best one so far. I have about half the pulp after juicing that I've had with other models, and the juice itself is \"more pure\" in texture and flavor. It has a lot of power, so don't be surprised that there is quite a bit of noise while you juice---but it takes just a minute or two and you are done. It is better designed and easier to clean than other models I've tried, too.",
        "I have been had this extractor since Dec 2019. It is the best of any juicers that I owned before. I use it every morning to make celery juice. I am glad that I got this machine after doing a homework.",
        "I bought the 800JEXL as a step up after having several lesser models. It was awesome for about 6 months and then it completely stopped working. For the price this is unacceptable. I contacted Breville through their website. A company representative responded via email back in June asking for my address. I do understand that we are dealing with Covid but it's now been 3 months and I have not received a replacement.",
        "We purchased this juicer about two years ago and it seems they are just not made like they use too. We had the same juicer previously for at least 10 years when it final quit on us. We bought the same juicer again to replace it, and though they are not cheap, we expected the same quality and durability. Well almost two years later the motor dies on us. We use the juicer every morning and really expected better based on our previous experience.",
        "Have to use too much food to produce juice. Lots of pulp leftover. Felt guilty about wasting it. Pricey in my opinion for end result.",
        "This machine juiced the celery stalks with ease. It was easy to clean and made of stainless steel.",
        "This thing rocks. Had this now for about a year and a half. Still works perfect and very efficient at drawing juice. Sounds like an industrial drill, and just as loud. Don't plan on having a conversation (hand signals might do), just throw on the ear plugs and commence the slaughter of some fruit and veggies. There is something mildly mad scientist about this juicer..you will feel a welling up of an evil laugh while your using it. I even sweat a little.",
        "This is my second Breville juicer. We decided to upgrade from the basic model... What a mistake! It worked well for about a year, now 1,5 year from the purchase- it leaks and its not just one place. I have a true fountain when I juice meaning everything is covered in juice countertops, parts and me. I used to love Breville, well not anymore- piece of junk after a year of usage. Disappointed!",
        "I have used this machine for a little over a month And it stopped working , I contacted you guys to return it and get another one it’s been now over 2 months that I am dealing with Breville to get it fixed ,,,, knowing that I bought this item on amazon not with Breville It’s very inconvenient to buy appliances on amazon",
        "Yes yes and YES. I’ve had an omega and it broke and was so hard to clean. This is amazing. I make fresh juice everyday and regularly for juice fasts and this is IT. Easy to clean and get the most out of veggies and fruit!",
        "Arrived broken. Motor would barely spin with a moan. Instant refund and easy return is my 2nd star along with. I went up a model and the new Breville works great. Saving my warranty card though",
        "Ease of cleaning, powerful. Do not use with wheatgrass, not effective and makes a mess. Buy a low cost wheatgrass juicer. Love this juicer though!",
        "I get more juice from my fruits and veggies than I have with any other juicer. The pulp is almost dry, having nearly all the juices extracted into the handy pitcher. Worth the money! Be sure to really clean the screen. Clean it twice because at first glance it looks clean but upon closer inspection some fibers are still on the screen. Also be very careful when you wash the screen as the bottom of the cone has razor sharp edges.",
        "Late review but this juicer is fabulous!! I was new to juicing when I purchased it and it made the process so easy from start to finish that’s I’ve been hooked on juice since.",
        "This is our second juicer from this brand, But i noticed that this one doesnt get all the juice entirely from the pulp. I didnt have that problem with our previous juicer. Still a good juicer.",
        "Terrible! Had to return due to a crack in the plastic hood and scratches and defects in the clear plastic carafe. I went to other stores that sell this and guess what? Same exact crack in the plastic hood. This is a defect IN the mold itself and ALL of the hoods have a crack which goes all the way through to the other side. For this much money this is disgusting. NO quality controls to make sure no defects PRIOR to packaging. WAY too much money for this-not buying again.",
        "If you are seeking a high-quality juicer, this one is for you. I read a lot of reviews before choosing this juicer and there are a lot of them out there (reviews & juicers). It is easy to assemble and clean. I put a plastic grocery bag in the refuse bin and that aids cleanup. The only problem is that a couple of times a carrot got wedged & I could not remove the pusher/plunger. I removed the top of the juicer & tapped on the bottom of the pusher/plunger with the base of my vegetable brush to dislodge the pusher/plunger. My husband is hooked on juice too.",
        "I love love LOVE this juicer! Easy to clean easy to assemble and easy to use! The juice is pulp free and adds an extra boost to my day!",
        "I have owned a juicer before several years ago and was very excited about this one due to it’s claim of being easy to clean and has high power. It has many different pieces you have to clean one by one and it is pretty loud even on the lower juicing setting. If it is directly on your counter top it tends to starting walking away unless you hold it in place or put it on some time of mat/towel."
    ]
}