{
    "entity": "Centrifugal Juicers",
    "text": [
        "I'm not sure how this has good reviews. It worked ok the first day but then it was all down hill. It started leaking from the sides and the pulp was soaking wet. I called Breville and they sent me a new blade because he said that's what happens after 10 months of use normally. After a few days of use with the new blade (which took 1.5 weeks to come) it was leaking with wet pulp again. Now I'm passed the return date and have a juicer that doesn't work.",
        "I just purchased this juicer. When I opened the package to give it a try. I noticed that the product had condensation on the inside. When I took the top off, there was mold on the product as well as it looking like there are particles of food on it. It is almost like it was previously used. I would love to try it out but I refuse to try a product that came to me so digustiningly. I called Breville to talk about my issues but there phone line is “having technical difficulties”.",
        "I'm very disappointed. The plastic reservoir that holds the pulp cracked after the first use. It was a crack like one might get in a windshield and it went right through. Otherwise, the machine operated very well. But, I can't exactly use a machine that's going to be leaking out pulp. So, it's really not worth the money. Now I have a fridge full of vegetables and fruits to juice and no juicer that I can use.",
        "I purchased this 2 months ago. The first 2 weeks it worked wonder so I thought I’d definitely keep. I threw away the box. Then after that I noticed it leaked on the side but just a little bit so I didn’t really care. However it got leaked more and more and the amount of juice I got is less and less. The 2nd pic is after using 3 packs of celery (normally I got 500 just with 1 or 1 1/2 pack). This is very disappointing and I can’t return because I already threw the box away. Urgh!!!",
        "Ran apples,kiwi,spinich and oranges through this juicer. The pulp was very wet still, so I ran the pulp again and more juice came out. Looked at the pulp again and it was still very wet like baby food. Ran the pulp again through the juicer and no juice came out this time,and the pulp was still very wet like baby food. I decided if I can't get all the juice from the pulp,this jucier is inefficient.",
        "I am extremely disappointed in this product. I had a cheap juicer before and it was AWESOME. This product is poorly designed and blows green leaves back up the shoot. There is heat generated during the juicing. The yield is way less than my other juicer. I am so annoyed as I spent double and got a much worse juicer. look for the big mouth juicer it's only $49 and soooo much better",
        "I bought this a couple of weeks ago and I've been using it and I just love it. The machine is excellent. It takes everything from vegetables and fruits and you can enjoy a pure and healthy juice. It is easy to clean and brings a tool to do it. A little noisy when on (fyi) but it is an excellent juice extractor. It only takes seconds to have a super healthy juice. Easy to clean: I haven't put it in the dishwasher, I just wash it with hot water and my hands and of course the brush/tool that comes with the machine.",
        "trash. this juicer is awful. it produces hot vegetable juice even if you start out using chilled vegetables. Also it wastes a lot. Bought a masticating juicer and it's light years better.",
        "Absolutely worthless. I spent a lot of money on different fruits and vegetables and got so little juice out of it, I was baffled. I would re-run the pulp through, and wouldn't get much more juice. If you're trying to make it easier to get your nutrients and variety into your diet, spend your money on vitamix or get a cold press/masticating juicer. The amount of absolute waste was really deflating. I used it 4 or 5 times, thinking maybe I wasn't using \"juicy\" enough fruits/vegetables at first before I just donated it. I feel sorry for whoever buys the stupid thing. Complete waste of money.",
        "Product stopped working within 2 months of use... tried calling support no response The email and online support does not work . Just waste of money",
        "After only 2 months, the Disk got clogged after following all directions on how to juice and which fruits and veggies to put in first and also how to ball up soft veggies. Because of this, juice leaks down the side of the juicer every time. Called into Breville and they basically said it was my error and they tried to charge me $39.99 for a new disk replacement as they said it was not covered in warranty. How can the Disk clog in only 2 months of use? Thinking back, this problem began to happen after only a few uses which gets me to thinking there was a problem from the start with a faulty product.",
        "This juicer worked great for the first couple months. I juice celery exclusively every morning, but after a couple months I noticed the pulp was getting wetter and wetter. I faithfully clean the juicer immediately after I use it, which is easy to clean, but there is some sort of buildup on the blade and sieve. I still use the juicer, but now take the pulp and squeeze it through a bag to get out the last of the juice. I'm sorry I didn't spend more money and get something better.",
        "I love this juicer! It is so easy to clean and I don’t dread cleaning it like I usually would with my other ones.",
        "I bought this in dec 2018. It's loud, big, bulky, and the worst part is leaks everywhere. It wastes about half of my juice - that's a lot. Tried everything to avoid leaking. It does juice well, I give it that. I bought a smaller cheaper one and it works great - not same brand. I want my money back but it says past warranty????? I do not want another one of these juicers, just want my money back.",
        "I saw a few reviews that said this would leak but when I got mine and used it about 7 times, I don't see where it would leak. It has such an amazing build quality and weight. And the way it's designed with the pulp being caught on top instead of a container on the back makes this so much more sleek and less bulky. I am very happy I bought this. The container that catches the juice has a top that separates the foam when you pour it which is an added bonus. Easy to clean, easy to use. Great Juice extractor!!",
        "I upgraded after my heavy, old, hard-to-clean juicer walked across the counter and dumped a cup of juice on the floor, and I’m actually kinda glad it happened! It works great, super-easy to use and clean, big spout so don’t need to cut things up, all the parts just sit, no twist and find the spot They say this won’t juice kale but honestly I don’t know why anybody would juice something with no juice - I’d put that in a smoothie and use a different machine. This makes excellent juice and I love it!",
        "I'm not a juicing expert but we can all agree that a decent juicer should have two tasks that it should perform without compromise: The machine should efficiently produce juice and then be able to transport that juice into some kind of container for drinking. Unfortunately, this machine somehow manages to fail at both tasks. 1) After just 2 weeks of use, juice is starting to come out of the sides of the machine leaking everywhere. 2) The pulp doesn't necessary have to be saw dust dry but with this machine i can physically squeeze more juice from the remaining pulp with my fist. Tasks 2 of 2 failed successfully.",
        "As long as you read instructions and are mindful of what you’re doing while using the juicer, you shouldn’t have any problems. People have mentioned leakage but it’s probably from the movement of the cup while placing items in the juicer. You need to make sure the cup stays flush against the juicer which is curved just right to fit the cup the entire time. It also helps to tilt the container to ensure that all liquid is drained into the cup. It’s also super fast! I stay with the urge to juice more things and will oftentimes find myself searching my kitchen for more fruits and veggies.",
        "Disclaimer: I've only used this to juice celery, for which it is awesome. One thing to mention, with use it can drift on the counter. And when the receiver and juicer aren't lined up, you make a big mess. One comment on others' comments: people have reported that with use this thing sends more and more juice into the solids area. I suspect this is the result of the screen getting plugged up. Re: screen hygiene, I recommend you wash the screen immediately after juicing. Once the pulp dries it will be much harder to clean. I expect I'll run into this at some point, I hope later rather than sooner...",
        "My family tried to juice orange, apple, carrot etc but it did not juice out enough juice. Leftover pulp of every fruit we tried are still pretty juicy. While the juicer itself is easy to use, it just doesn't perform well. We bought a different juicer (different brand as well) and that works very well. All the pulps are squeeze dried. I had then returned this.",
        "This is my first juicer, so I didn't know what to expect. But I'm pretty amazed at what this can do. It juices easily and cleanly. The cleanup process takes no time at all because if you do it right away the leftover pulp just washes right off. There are no stains on the container (and we juice beets and carrots). The lid on the juice container keeps the foam from pouring into the glass and the leftover pulp is very dry, which says to me there's a lot of juice being extracted. I can't recommend this highly enough.",
        "Going to purchase a different juicer, different brand. I've had it 1 1/2 years, its on it's third filter basket and needs another now. I juice celery every morning. Price of a replacement filter is ridiculous. Don't buy it if you're planning on using it much. The machine is great but worthless without a good filter basket. Disappointed",
        "I've used other Breville juicers before and have never had any complaints. It's a very cool looking juicer. But I have to empty it after every half of a juice, about 8 ounces which is a task in itself. It doesn't always get the entire vegetable/fruit juiced. It seems to fling more bits out of the top. My pitcher fits under the spout, but occasionally my juice will end up on the top of the lid, not a big deal but not something I want to consistently deal with. It gets the job done.",
        "I really wanted to love this juicer, I have used a Breville before. I read the previous reviews but thought maybe they were just stuffing veggies in without cutting. However even juicing small chunks of watermelon it leaked all over me and my counter top. I am so disappointed, I will be returning it soon. This juicer does not seal completly, juice is coming out of the side even when properly cleaned and assembled. Now i have to find and buy another juicer!",
        "I enjoy the compact size of this juicer. It is very easy to clean, and juicing daily does not feel like such a chore. It has a simple on and off button. The last Breville juicer I owned had a digital dial to select the speed that started acting wonky. I’ll never buy another digital juicer again. The only thing I do not like about this juicer is it makes so much foam. I mean like sooooo much! I have to skim it off most of the time. The way the juice spout is the air is pushed down it very hard and quickly so it’s blasting the juice making more than the usual amount of foam.",
        "Do not waste your money on this item. Ordered one on this site. After a few days of use machine began to smoke. Notified Amazon within time frame. They were quick to send out a replacement. Second machine arrived had several issues. BLENDED FRUIT AND PULP AND DEBRIS WERE IN JUICE. BOTH MACHINES FAILED TO MEET MY EXPECTATION. COMPLETE WASTE.",
        "Have had this juicer for close to a year now and it is still going strong. Use it to juice roots (ginger/turmeric) with no issue whatsoever. Only con is that if you are juicing large amounts, you have to empty the tray multiple times. However, if you are juicing for one or two, it’s perfect.",
        "I bought this juicer for juicing..obviously. I've had it for almost two weeks. The first week it worked great, then the next time I went to use it, it just wouldn't turn on. I tried every outlet in my kitchen and nothing, just dead. The day after that it worked just fine for two more days and then dead, again. I've tried everyday for the last two or three days and it just won't turn on. There's only one switch, on or off. I cleaned it really well after each use. I have no idea but I'd like the appliances I buy to last longer than two weeks.",
        "I purchased this juicer a year ago and used it for the first time. I was crazy waiting so long. I'm truly amazed at how much liquid came out of what I put in!! I started with celery and I'm telling you, the ease in which it took to juice was incredible. The cleanup was simple and quick. The \"pulp\" left over was light and fluffy which is another indication of how all of the vegetable was extracted. I can't wait to try more combinations now that I know how easy of a process this will be. I highly recommend this product.",
        "So I'm not some juicer expert but I will tell you this juicer is fantastic for the price. 100 bucks and you're all set. I haven't done leafy greens yet because they're hard to get at my apo but all fruits and veggies I've done have been great. The pulp is alot drier than I expected. Are there better ones? I'm sure there Are, but not close to this price. I'll recommend to anyone who asks. My co-workers are all using it now also. Great purchase and good packaging. Arrived without a slightest dent from the state's to Afghanistan. I'm very glad I didn't go with an expensive one since this one does such a good job.",
        "There’s not one thing I haven’l liked about this machine. I will probably be gifting this machine to several extended family members, so, hope Amazon keeps this item in stock. I love the ease of cleaning it and the pulp comes up very dry so you know your money isn’t being wasted. The cord is short, so you need to be close to an outlet. It’s a hefty cord that has a sturdy ring to pull the plug out of the socket. I never saw one like this before. It’s just one more thing to like. It really zips through the produce in seconds.",
        "This product is great! It can juice pretty much anything, it’s quick and efficient. The best part is how easy the clean up is. It basically comes apart in three big pieces. Once you juice, you open it, dump out the pulp into compost and clean it. It is so easy to clean! I can make a juice, clean it out, and start making another juice in minutes. I’ve have no problems with even tough fruits. The juicer comes with a measuring cup that the juice pours into and let’s you know how much you have and once it’s full, you know it’s time to empty the pulp. Really simple operation.",
        "A good, solid juicer. Fairly easy to clean. Since it works by forcing the food against a spinning mesh, it catches most peel, seeds, and heavy pulp. It lets fine pulp through. It will handle things like carrots as well as softer fruits and vegetables, though a crusher might be better for some things. It's fairly loud as all juicers are, though not more so than other models. It always had enough power to do what I wanted it to do. This model is easy to take apart for cleaning and doesn't have any sharp, dangerous surfaces.",
        "I have really enjoyed this juicer so far. It is relatively quiet, and easy to fit many fruits/veggies without much cutting or preparation. It also does not take up too much counter space. I feel as though it has been easy to clean. The only downside I have seen so far is that certain leafy vegetables (kale) do not work as well with this machine. However, it took ginger root like a champ. I would recommend this juicer to anyone in the beginning juicer stages looking for a nicely priced and efficient juicer. I’m happy with my purchase, and I think others would be as well.",
        "I used this for the first time and could not believe how well the juices from the fruits and veggies made an impact on me and my family. I instantly developed this bursting amount of good energy. Not to mention the mental clarity and alertness it provided as well. I just cant believe I didn't purchase this sooner. Please everyone, this is not a paid review but if you are looking for a way to develop natural good energy, mental clarity. This is the perfect juicer.",
        "This juicer is well made and easy to clean. The juice collection cup is made to minimize splatter and the hopper is large. Although the motor uses less watts ( not as powerful as some) it has a heavy flywheel effect that gives it plenty of torque for the job. I don’t know how it will hold up as I’ve only hade it a month. Juicers take a beating and I went for the amazon warranty.",
        "This is my second one, only this one broke down after 1 month. It stop yielding juice. It worked but but with 3 pieces of fruit I got maybe an ounce of juice. I called the manufacturer, they are closed due to Holiday except there is no holiday in sight. The Jest of it is don't buy based on reputation and just know they don't stand behind their product. Hamilton Beach has one for $30 less and is perfect.",
        "I've had this juicer for a month now, and I've been using it weekly. The cleanup could not be easier, which is something I really wanted in a juicer. I wouldn't say while juicing it is quiet, but it's just as noisy as most blenders are. It's definitely worth the price, no issues with it so far, hopefully there won't be any. A scrubbing brush comes with it to use for cleaning, and it everything fits neatly under my cabinet without taking up a lot of space. It also doesn't take up much space on my counter top.",
        "I'm on my second juicer presently (first one lasted for four years of regular use). Health has improved significantly by using the 80/20 — vegs vs. fruits — recipes (pictured here). I find the device quite easy to clean; it's washing vegetables that take the most time. I can produce about 40oz of juice from the [pictured] foods in about a 20-minute session. Hope to upgrade to the JE98XL one day (no interruption to empty the waste catch).",
        "I just received my juicer yesterday and immediately started using it. The packaging was perfect! After mixing different fruits and veggies and tasting the juice I was sold. I will recommend this juicer to everyone I know. Make sure you get the 4-year warranty just in case something happens in the future. Love It!! 20 Stars!",
        "This is a compact juicer that assembles/disassembles easily. The pulp is stored within the juicer instead of being ejected, which makes it more difficult to clean. The biggest flaw I have found in this juicer is that the pulp it produces is SO WET. I don’t know if the blending is not powerful enough or too powerful, but a lot of juice remains in the pulp. It is inexpensive for a juicer, so I guess you get what you pay for.",
        "This juicer is the best, you can juice several stalks of celery and carrots at one time. The juicer is quiet and the cleanup is easy especially if you clean it right away.",
        "I read a lot of reviews before buying this juicer but when I saw my in law using one I was really impressed. The machine worked really fast and yes the fruit and vegetables are like sand dry. So I purchased one and I’ve had it a few days and something is definitely not working properly “the blade” it just isn’t cutting the fruit or vegetables all they way thru, it is leaving big chunks. I have to process the fruits and vegetables at least 2 times. I think that if I can’t find a better blade I will return it and get a different machine with a better blade.",
        "Perfect! It is very powerful, not cheaply made and it does the job. You can make approximately 2-3 serving before you have to clean the pulp tray. My advice for maintenance would be to clean after right after every use. The juicing is an easy breeze, takes about 10 minutes to clean and dry. I recommend this product for anyone that is trying to get the best for your buck. I personally look for quality over bargains, this is my new toy and I am very please with it, it was a great buy and I know it will last a very long time.",
        "This is the best you juicer I ever owned. Very clean ,neat very sharp and quick.makes lots of juice Even though you have small fruit. I used to own another brand and it was a waste of all my products it gives me a little juice.but this one, awesome for One medium apple ,one medium beet root , two carrot and three stuck of celery gives me 20 ounces of juice😍 Who ever made this God bless .",
        "I did so much research and read a ton of reviews before making this purchase. I do not understand why people spend so much money on other name brands when for this price and power, this juicer does it all! Compact yes! Looks sleek therefore usually just keep on counter. I so enjoy that there is not another shoot and something else to clean when it comes to disposal. Other juicer make it messy but this guy is easy to use, clean and all juice just flows right into cup! I can’t rave enoigh",
        "I am juicing celery. I love it. Very strong and fast machine. Only problem is unit containers are of a durable plastic and the celery is leaving a cloudy film that is near impossible to remove or clean, so plastic is no longer squeeky clean or see thru. It is cloudy.",
        "I wanted an easy to use and clean juicer for our home and this came up highly recommended on a number of sites. We could not be happier with it, but be sure to follow the instructions for removing skin and pits from many fruits and vegetables.",
        "Awesome! It juices very well. The juice comes out without any pulp and the remaining pulp is pretty dry. It is also quick! The design is not only sleek, but also functional. There is a part that collects all the foam when pouring into a cup to drink, making the whole experience very enjoyable. It is also super easy to clean, as all the parts that need to be cleaned comes off together, and the product comes with a convenient cleaning brush. The only negative part is that it’s very loud.",
        "I was a little nervous about the Juice Fountain - after reading about the cleanup challenges, quality issues, etc. - but this juicer blew me away on the first use. The design makes removing the pulp and discarding so easy, disassembling the product pieces is easy as well with a total of three-four items. The large mouth also allows for quick juicing and less prep time - always a plus! I would estimate that you could make 36 oz of juice per batch before needing to discard pulp. For a 2-4 person home, this juicer yields the perfect amount of juice. Very happy with quantity and quality.",
        "Last year I bought the Breville Non-Compact Juicer Version from a high end cookware store. I liked the concept but it was hard to clean, messy bucket, etc. I juice daily and it broke after 6 months! I wasn't going to give up that easily and the price lead me to this juicer. At first, I was going to do the Huron....but I needed less expensive at the time. I was hesitant but it was a wonderful decision!!! Easy to clean. Excellent Power. Juices hard veggies including beets quickly. Moderate Noise. My roommate is jealous too...added bonus! lol.",
        "This product makes decent juice but pulp and juice back-flows from the input tube and splatters all over the place. Cleaning the juicer is manageable but cleaning the mess that it makes is a pain in the neck. This is definitely a major flaw for this juicer.",
        "This juicer is excellent. This is my first time purchasing, besides one from infocommercial like literally 10yrs ago. I fell in love with it and purchased the second one for my mother. Very easy to use and not too loud. performs very well. If you buy it make sure to clean it soon as youre done juicing, because those suckers once they get dry its awful to clean it.",
        "Soo I'm new to juicing, but I love this thing. It's so easy to use and pretty easy to clean. I don't know all the details about the different types of juicers, but I do feel a difference drinking the juices. I have so much more energy. So far this juicer seems good quality. -it's easy to assemble at first and each time -fruit and veggies easily fit in the machine. - easy to clean just try to do right after -only 1 button which makes operating easy - not sure about the durability hoping I get a at least three years",
        "I had a Jack Lalanne juicer and thought it was fine. Then, it broke, and I saw the replacement price, and was shocked.. my neighbor has this juicer and said it was great, so I bought it. compared to the old one, it is at least twice as good. It gets more juice out, is effortless, quieter, and so much easier to clean and set up. At 1/5 the price of the LaLanne juicer.",
        "It’s pretty powerful but it’s a mess! Because the left overs stay in the middle, the air blows the pieces threw the top when you go to put more food in. Get ready to be splattered. I have to watch it because it like to shimmy towards the end of the counter. Almost lost it to the spin cycle of death! Overall it does what it does. I’d honestly get the original one that has the 2nd container for the food scraps. I’ve had that one but wanted something smaller. My mistake. Maybe put some suction’s cups on this bad boy.",
        "Really compact, attractive and easy to use. I guess it’s expected because it is a relatively affordable juicer but it extracts less juice from fruits and veggies than other juicers I’ve seen. It’s decently easy to clean — I highly recommend cleaning it right after you’re done juicing. Getting the pulp out can be a bit of a pain but Breville thought of that and included a handy tool to help! To get the most juice out I’ve taken the pulp and made a little ball and run it through a second time, works pretty well. Happy juicing!",
        "Dead after the third use. Flipped the switch to turn it on and nothing. Extremely shocked and disappointed.",
        "I used this product for a day and decided it wasn't RIGHT for me. Will be returning. Its major advantage is the speed with which it extracts juices. But the downside is the mess it creates along the way. Additionally, the pulp is trapped inside, sometimes blocking the hole where the juice escapes. Cleaning is a pain in butt! I also discovered that the pulp is soggy, indicating weak juice extraction. I have ordered the Omega juicer instead. Will post review after arrival.",
        "I purchased this juicer 18 months ago. I have used it a good amount and have not been disappointed at all. It is simple to use and equally important; easy to clean. I am purchasing one for my daughter and one for my son.",
        "Changed my life. Changed it. I never owned a juicer before but I bought this one after careful research and I could not be happier. So easy to clean for a juicer--some of them look like nightmares. Works fast, juices to a perfect consistency if you ask me.",
        "I bought this juicer from Amazon through the Reboot with Joe website. I have used it a lot and it has served me well. It's fast and not hard to clean, they include a stiff brush to use on the centrifugal filter. When I am juicing I usually make 3 different juices each night which I store in canning jars in the fridge and take with me the next day. Juicing helps me loss weight faster, without any bad health effects (quite the contrary - my blood draw numbers are excellent!). Watch the documentary \"Fat, Sick and Nearly Dead\" available on both Amazon and Netflix for inspiration.",
        "cheap material. I was juicing ginger and the motor mounts inside the casing broke and it tumbled inside til it stopped. doesn't work and I will NOT buy this brand again.",
        "I've used this on apples, carrots, and kale so far. Really did great on the carrots, turned them into pulp. Apples went well too but it did not turn them to pulp. Kale had to be run through a couple times and still had some large pieces. Cleanup is a bit involved with cleaning the mesh. But nothing too bad. Overall I'm satisfied that it does what I need it to, was a good value, is well-made.",
        "Bought this a year or so ago. Motor does not work now after only light use. Can't imagine how short its lifespan is with daily use. When it did work it wasted a lot of the fruit if you chose fleshy fruits like watermelon, honeydew, or cantaloupe. This works for denser fruits like apples, oranges, grapefruits, and pineapple. Yeah, you have almost 5000 reviews with near a 5 star rating, but someone has to get the one that was built on a Friday afternoon by someone trying to get a head start on their weekend.",
        "Great juicer for beginners. This is a juicer to start with not to have forever, I am going to purchase a “masticating” juicer after this one. Since this is an antifugal juicer it extracts a good amount of juice from the fruit but not all of it, and my pulp is almost always wet instead of dry. Decent price, does the job and I will still use it but will purchase a masticating juicer soon, it’s an investment, overall love the juicer and not so big so it saves space, a bit loud but not so bad.",
        "This is actually a really good juicer. The key to it not leaking is to not make so much juice. Be reasonable but don't over fill it. It can actually make quite bit of juice but you can overdo it. In addition, I saw some reviews about the mesh thing not getting clean and it does get quite clean for me. I just use a sponge with some pretty warm water and soap and scrub it, I even use sponges that don't have any roughness to it and it cleans it just fine. I'm completely happy with this juicer. It's totally worth the cost and I continue to make delicious juice with it. Thank you Breville for making me healthy.",
        "Just used it for the first time and it’s amazing! I am so happy I got this juicer. I used it for celery, apple and ginger juice. Haven’t used it for anything harder but it was fast and super easy. The pulp was 95% dry, so I feel it gets most of the juice out. Another bonus... it’s so easy to clean and did not splatter anywhere! I highly recommend this.",
        "This is very wasteful: the pulp is very wet, meaning that not much juice is extracted. This is my second juicer, having had one decades ago, and the old one (a different brand) was much more efficient. I thought I would make-do with it by making broth from the pulp, but kale taste in soup grosses me out, I found, after the return date passed, so I guess I'm keeping it. 3 stars instead of two because the parts fit in the dishwasher (top rack only).",
        "I didn't expect to be wowed by this juicer but I've had it a few weeks now and I love it. This is no light-weight juicer. It's heavy duty and powerful. Easy to clean, juices everything I've tried so far ----and I've tried many fruits and veggies. I use it every day and it's changed my life. I did a lot of research before I chose this one - the reviewers video above really helped too, but I am still surprised how much I like it. I can't imagine why I would want a bigger and more expensive one. This is everything I wanted in an everyday juicer.",
        "It gets the job done for fruits and veggies that are not hard but if you want to put an apple or beet in there hold onto everything because it sounds crazy. Cleaning it is way harder to do than expected and there is almost no way you can clean it without spilling all the veggies/fruit that you juiced. I was hoping the container the juice runs into would be larger.",
        "I never write reviews on products, but this is hands down a simple to use, simple to clean juicer! The compact size made it very easy for my apartment kitchen that is already a great size kitchen but allowed me to have counter space. The juicer itself looks great and works very well. Super quick juicing and the fact that the juicer quality comes out so well is a PLUS!",
        "I love this brand and this model. price is reasonable. I used first one for 6 years. and I purchased new one. It is made well.",
        "We just started juicing - really love this juicer so far. Clean up is a little involved but absolutely doable. Especially if you have used a strainer and blender before. I don't find it too noisy - our blender was much noisier. It is easy to assemble, juices great, has nice safety features. Would definitely buy it again. We got the same juicer for our daughter and she also has only positive to say.",
        "This is a fun way to get juice! I use it mostly for celery, but also for cucumbers, tomatoes, and other fruits and veggies. I like the performance and that it separates the not only the pulp, but also the froth from the juice. If they could make this juicer self-cleaning, I'd like it even more!",
        "No one asked me to write this review I wanted to wait and use it all weekend before I even did this review and I have to say this juicer is so much better than the one I had the pulp in this juicer is dryer it’s super easy to use easy to clean and we love it I’ve made juice twice a day every day since Friday .",
        "Is the best i really like it the juice comes without pulp and feels like it takes the juice out really good. Very easy to clean and it has a powerful motor without it been to big and without taking to much space. I love it is what I was looking for.",
        "A very simple and easy to use juicer. It does a great job at juicing, I personally never have had any issues with the quality of juice coming through. And the pulp is always pretty dry.",
        "I've used this daily since receiving it last Monday. It's very easy to use and the clean up is a breeze compared to the past juicer we had. If I was able to do a half star I would, only because sometimes the pulp shoots out the feeder tube. It's not a lot but it's enough that I have to clean the counter and sometimes the wall behind the juicer. That is the only thing wrong with it! I've also found the juicer is perfect for single servings (12-16oz of juice) because the pulp \"catcher\" isn't very large. I highly recommend this product.",
        "Have had it a few months and use it a lot for making apple ginger juice. I've also made celery juice too. It's not a professional juicer but fine for home juicing. On a scale of 1 to 10, I give it a 7 because it doesn't \"squeeze\" all the juice out of the fruit/veggie so you get bits that are wasted. Overall I think it's pretty great for the price and how well​ it works. Also, not messy at all.",
        "It's a great juicer, but don't be fooled by the word \"compact\". It seems to take up as much space on my limited counter as the full size Breville, and cleaning is more time consuming because the pulp catcher can't be lined like their full size juicer. I used it twice, then ordered their juice fountain. I'll give away this one.",
        "I did a YouTube video and Facebook video about this juicer. Now my family and friends are purchasing your juicer. I have increased your sells dramatically. Watch video. Maybe you can compensate my free advertisement:) My email is nanier33@gmail. Com",
        "I have used this juicer a couple of times already. Very quiet, it gets every last drop of juice out of the fruit and vegetables. Very easy to use and clean. Definitely a great buy.",
        "I was on the hunt for the perfect juicer that was also affordable. I love to juice everything, especially leafy greens. This thing has surpassed my expectations and you cannot beat the price. What I love most is how dang easy it is to clean compared to my old champion. It's a little on the loud end, but not even close to my Champion. I use it daily and haven't had an issue yet! Definitely buy if you are looking for the perfect juicer. I have juices everything known to man in this juicer and it has worked like a dream.",
        "As a first time juicer, I wanted something simple to use, clean and didn't cost too much. This fits the bill. After a few weeks of use I can say I really love this juicer! It's juiced everything I've put in super fast. And, for me, the most important part is it comes apart quick and I can rinse all the pieces off and leave them on the counter to dry in just a few minutes. This give me the ability to juice and rinse the parts in the morning before I leave for work without taking much time. The ease of use ensures that I look forward to using it each day instead of finding an excuse not to.",
        "I got this for Christmas and it’s the best juicer I’ve ever had. No problems with any fruit or veggie just juices it with ease. Only thing is in the middle of making it since the hole on the top where you put the fruit or veggie through is so big stuff tends to fly out of it. Only part I don’t like. It can be clean and I just started using it and stuff just flys out gets everywhere. Whatever a little bit extra cleaning but I love this juicer.",
        "This is my first time buying a juicer from Breville. Let me tell you I was astounded by the force of this juicer! I use it to make smoothies, juicing fruits and veggies! Having this device in my kitchen is a game-changer!!! Thank you Breville",
        "This is an easy entry level Juicer...but if you are seeking a daily use juicer (especially for veg) then this one won’t last the test of time. I have juiced every morning for 6 months on this machine and hand was it always....my pulp is soaking wet when I clean the cavity out. All that $ wasted on organic produce that has a massively reduced ROI because this juicer doesn’t extract what you want....JUICE. If you are dabbling, go for it. But, if you are a daily use juicer this isn’t your machine, IMO.",
        "Great Juicer! This is my first time purchasing a juicer, and overall I am very pleased. I have used it regularly since purchasing, mostly to juice fresh fruit and vegetables. Very easy to clean as well. It does get full fast though, so you may have to stop, clean out, and resume juicing if you are trying to make a large quantity. My only two notes would be: I feel the lid could be more securely attached to base, at times when juicing a tiny bit comes out from the space between the lid and base. Also, the cup to catch the juice could be sturdier. Overall- would highly recommend to all!",
        "Easy to clean, easy to use, easy to store. I love this thing. I use it every weekend to juice veggies and fruit. Its amazing. Super easy to clean and easy to put together. Works great, I get a lot of juice out of this thing when using it.",
        "What a juicer! This beauty of a machine from Australia shrivels up anything you put in it. The dry residue is a testament to how well it can extract juice out of anything. No amount of words seems to do justice describing this baby. Go to Google and type in \"Rise and Shine Juice Recipe courtesy Giada De Laurentiis\". 6 baby carrots = 1 medium carrot The directions will be slightly different: Pass half of the apples, then the spinach (manual says put soft leafs in between harder ingredients for best results.) Then the rest of the apples, carrots, celery, lemon juice and ginger. Check out the video...let it speak for itself. Removable parts are dishwasher safe.",
        "Great product Cadillac of juicers. A little small and needs constant and difficult cleaning.",
        "What an incredible juicer! I was trying to create celery juice and a friend recommended Breville. The price was right on Amazon so it's now in my kitchen to stay and will allow me to experiment on more fruits and vegetables; plus pureeing vegetables for creamy soups.",
        "Used the juicer once, the inside of the base dried with a cloudy look, also the juicer doesn't get all the liquid from the vegetables/fruit I had to re-juice the pulp to get all the liquid which makes the process time consuming.",
        "After buying an Omega for about $400, which after a while started leaking on the sides. Then a giant other commercial juicer for about $200 or more dollars, that the pieces would start shaking uncontrollably. I finally got myself this juicer for $99. I LOVE IT! and it's easy to clean! Look if your looking for something inexpensive, quick cleaning and easy to put together, than this is your juicer. I don't regret buying it, and if something happens to it then I only invested $99, unlike my other super expensive juicers that didn't last me and I hated cleaning all the ridiculous pieces!",
        "My co-worker brought this juicer to work and i love how it worked. The clean up with any juicer is lil too much but it juices so well. I get a lot of juice when i juice carrots. Since this is my first juicer, Im probably way more excited than someone who has used other juicers.",
        "I wanted a juicer for years and being in the lockdown gave me extra time on my hands so I invested in one. First thing we did with it was orange and pineapple juice, turned out very good! I did celery juice this morning for breakfast and I am sooooo impressed with this juicer!",
        "I got this for my mom who has a ton of apples on her trees every year. We were able to juice a lot in a short time. Keep in mind that it is a small size, so you have to clean it out more often than a bigger one, but the size is perfect for my mom's cupboard, so we can keep it handy for when she wants to make carrot and other veggie juices.",
        "While the clean up is easy, its still a bit time consuming if you want to make sure you properly clean everything. Aside from that, it does a great job at removing all the juice from whatever its processing. I drank veggie/fruit juices for a week straight when I first purchased this, 3 juices a day...and my skin was literally glowing. I had so much energy, I was able to abstain from my ritualistic coffee drink in the morning. If you've been considering getting a juicer, just take the plunge and get it. You will not regret this decision.",
        "You can only juice a certain amount before the reservoir fills with dry pulp. Then you have to stop and open everything. Empty it then continuing juicing if you have leftover fruit. The you have to repeat using your hands to scoop the items out. Too much time and headache"
    ]
}