{
    "entity": "Routers",
    "text": [
        "I have been fighting with 5 of these routers for several years now because my client likes Cisco. We have VPN's between 5 locations that are a nightmare. I have updated the firmware religiously and read probably thousands of pages of documentation and forums to no avail. gateway to gateway VPN's drop regularly. I had to put a lamp timer on one to reboot it every morning because it locked up so often. Even their own QuickVPN client will not connect. I tried to like this router but I'm going to find something out there that works all the time, not just when it wants to work.",
        "It works as Router as it should, the dual WAN option works... sometimes... if ur ISPs are stable enough the load balance works pretty well, but if you ISPs stops working often the router do not switch between WANs as advertized. Also sometimes the DHCP hans and need remote/local restarts. It should be better for the money",
        "Despite it being 10/100 it does its job perfectly, it still has support for Firmware upgrade. Option of VPN, Router, Firewall.",
        "I've not had any problems with this switch but note that it does get hot so you want to install it in a place where it would get plenty of air movement. I've installed nearly a dozen at different businesses and they all use VPN and they all been working more than 3-4 years without any hiccups. I've never had any problems with them and remote access allows me to change setting on the fly without going to the location....but that's a feature that all routers have. I started using these routers because they were the cheapest, reliable means of setting up a VPN between multiple site. Have not been disappointed yet and would buy again without reservation.",
        "I am a Cisco Certified Network Engineer with over 20 years experience. This device is great for smaller installations (<250 users) because it has a nice web interface and is easy to configure. Of course this is a double edge sword because I have been back to my customer's office 3 times fixing issues caused by the customer's inexperienced in-house techs making changes they did not understand. If you need a basic router than great but if you need to load-balance multiple connections, manage VoIP traffic or handle inter-office VPN tunnels then hire and retain an experience network engineer. A good tech (with quality equipment) will save you time, money and reduce downtime.",
        "Unable to use for VPN connection all software listed in the package is no longer supported",
        "This is a great product, make the job of another USD700 valued router. The suscription service is optional. Without suscription you can block pages, masking ports to remote desktop access, do DHCP, teaming two differents internet providors. The unit can works for months without stop, you can configure a logserver, there are documentation and forums for this product at Cisco site. For the price, is a good deal. Notice, at june 2013 was release a new firmware update.",
        "This is a very nice unit. Having VPN tunnels in the router is a great idea. But it can't redirect an incoming connection on port \"X\" to port \"Y\". You can configure port \"X\" to go to an internal IP address, but it must be on port \"X\". That doesn't work in my environment. This is a disappointing limitation on an otherwise excellent product. If you don't need this feature, there's no reason not to buy this.",
        "Initially worked great, than it started to disconnect from a remote server at unpredictable times, was not able to figure out what is was or get any help on the matter. Found several posts of fellow users with the same problem, but no solution. So gave up on it bought two other single input routers. Quite disappointed with the matter. The problem start to occur within two months of operation.",
        "Failed when I was setting it up. Even a hard reset wouldn't let me back in. I'm sure they are not all like this.",
        "I've used this router with several clients -- it's a great product. Setting up a secure VPN between two locations with these is easy. The dual-WAN capability is nice if you have two internet providers either as a fall-back or load-sharing. (BTW...some IP phone systems don't like the dual providers, but having a 2nd provider as a fall-back may only require a phone reboot.)",
        "Used on 20 Mbit/sec cable as primary and 1-2 Mbit/sec 4G connection as secondary. With auto-fail-over it does switch from cable to 4G when cable stops working, but transition is not smooth - few seconds when connection to the world is not available. When both connections up - network tests show much lower speed than cable could do alone. Doing Skype is not smooth on this device.",
        "The good part: Easy setup Easy VPN setup THE BAD PART: - Ciscos' worst support EVER - Port Forward problem: If you try to setup a different port for FTP, it won't work as passive mode. It works only in port 21 - Load balance problem. You will not be able to use load balance if you have any tipe of incoming traffic like FTP. YOu will have to turn off load balance, otherwise, binding ou FTP server won't work correctly. don't waste your money.",
        "Setup up was very intuitive and easy. It has run very reliably. It is nice to have high quality equipment like this.",
        "A solid small business class router. Has a lot good features. Seems like you can overtax it if you try to much though. It has a bandwidth management feature there but seems to overburden the router if you try to much with it. Other than that, has a great firewall setup, a pretty robust VPN cabability, and seems to work pretty well.",
        "The router works great and is easy to set up. Very nice utilization of Dyn DNS for assigning different FQDNs per external interface. The \"but..\" part is the VPN- I still havnt gotten it to work yet. Guess Im actually going to have to read something other than the provided docs on this one.... Great product though- totally happy w it!",
        "I bought this unit to load balance my two internet connections, ISDN and Cable. It's absolutely amazing for web surfing. Speedtest.net reports the total speed of the two interfaces. Unfortunately, as the excellent support specialist at cisco pointed out, load balancing doesn't work with most secure connections, like iTunes downloads. So I ended up configuring to use the second connection as a backup. Interestingly you can assign certain ports to use a single connection but we're using a wireless router behind this unit. If you have flaky internet where you live and a choice of providers, it's worth looking at using both. Cheers, Sam",
        "It was easy to install. I could easily configure NAT and VPN works fine as well. I can access to my work PC from home by using VPN software. I don't know how secure it is but my work does not require much security. I never call for support. So I don't have any comment or rate for Product Support. Actually, I've been using their forum to ask question and it's very helpful. You can answer pretty quickly from gurus as soon as you post your question. I would recommend this product to small office with dedicated internet line.",
        "Needed a dual WAN router to bridge two DSL lines simply for load balancing. I can only get a maximum of 3Mb. With the two DSL lines connected to the RV042 in load balancing mode I immediately was able to download files much faster using my download manager (that initiates up to 16 connections to download the same file). Setup was straightforward using the WEB interface.",
        "The RV042's in the past were fantastic. Circa start date to 2016. Now both of these have failed because the programming randomly gets wiped. No electrical surges...just goes flat line.",
        "I've purchased this router a few month ago based on relatively good internet reviews. Everything worked Ok besides continuously dropped VPN connections, missing images, style sheets, broken internet pages..etc. I've tried to resolve this issue with CISCO support which is great btw, but was unuseful in my case. The replacement unit had exactly the same issue. It looks like those routers have serious MTU problem, which cannot be configured properly whatever it manual or auto configuration option. The problem could be ISP related (ATT Uverse in my case), however NETGEAR ProSafe VPN FVS338 which I've purchased a week ago works great so far and MUCH faster.",
        "I've used Amazon for a decade now and almost never post a negative review. I bought this to allow VPN but to also consolidate a DSL and Cable incoming connection. I was never able to get it to work properly with my modems and my wireless routers on opposite sides of this thing. Connections to the outside world would get confused about where they were coming from one moment to the next. The whole experience was world's worse than I thought, and I never even got to the point of trying the VPN which sounds like it doesn't work quite right either.",
        "I sent this unit back and got the RV082 which works fine. The QuickVPN refused to work with this unit and LinkSys was no help. It does not support the Native VPN Client in XP either. I got the RV082 and use the Native XP VPN client. No extra software and works like a charm.",
        "This is a sturdy full featured VPN Router. I HIGHLY suggest this VPN router over the other RV1* devices. Leaps and bounds better than the RV4000, get this as a replacement when the RV4000 start to fail. Has a keep-a-live feature with the IPSEC VPN.",
        "I know this is targeted more for small business, but I am a high end home user (gigabit network, 2 WAP's and lots of devices). I most enjoy the fact that I can effectively do things like block my teenager's laptop (iPad, etc) from getting to Facebook with not a ton of work. It helps get homework done and keep harmony in the house.",
        "Incorrect Power Supply for this unit created an issue. Unit would not stay on Power for longer than 1 minute. Unit only had Rev 1 installed but was not advertised prior to purchase.",
        "I have been using a RV042 router since 2006. However, it just recently failed. Therefore I replaced it with this new one because the previous one worked exactly as expected. Although I initially thought I only needed one port to create my VPN, which was the primary purpose for purchasing it, I later found the three additional ports to be quite useful for temporary, non-VPN use. I couldn’t be happier. In addition, the delivery time was spot on.",
        "This is a great product i have specifically used it to create vpn tunnels between small offices. I have purchased around 15 so far and all have worked just fine. One lost vpn tunnel info. Thats the only reason i did not rate it 5. Maybe the client is not so good but it works",
        "Have used these for years and have several still in the field can only think of one that failed and it was actually the power cord that failed not the router itself. Had some issues with some voip providers with this device, but overall a good low priced router for small businesses.",
        "I ordered this on a Friday in New Zealand. And it turned up on the Monday, impressive!",
        "I have deployed these to every SMB customer needing a router upgrade from a home product to a business class router. Very reliable and easy to configure for all the basic functions. The built-in VPN service and Dynamic DNS feature lets me set up easily for remote access support.",
        "Reasonably priced solution for off-site communication, controlled for security. Set up was simple enough for average person to do. Nice unit.",
        "They work as advertised - and very few go back for RMA. Can be used in load-balancing or auto-failover mode, up to 50 VPN tunnels.",
        "Needed a replacement router fast and this model from Cisco is the best in it's price-point. However, I wish I'd kept the adapter from my old model because this one came with the European version and I have to wire-wrap the adapter and plug-adapter to the outlet just to keep it plugged in.",
        "This is the second one we have owned. The first one unfortunately hot hit with a power surge and this is why we had to replace it.",
        "Still working and no issues with the install process. Good for small firms and bigger. Wish it was wireless for the same price.",
        "No issues. Have used almost a half dozen or so without a problem.",
        "We used this to connect to a remote tower site, and it was easy to setup. we received it in a very timely fashion.",
        "There were great firewalls of their time. The replacement is the RV180 nice system. Don't buy this unit, it's outdated.",
        "Very useful and a great deal. I recommend them for great this router. Thanks for the deal. Hope to buy more.",
        "I heard that others had luck getting this unit to work using site-to-site VPN with SonicWALL units, and for about 1/3 of the cost of a small SonicWALL, I thought it was worth a chance. After 3 hours of fiddling, I finally got it working and it seems to be very stable. This of course is time invested into future installations: now that I know the proper configuration, installations at future sites will fly by! We may never buy SonicWALLs for our remote sites again! Definitely check this unit out if you are looking for robust, reasonably-priced site-to-site VPN. About the only thing it doesn't support that I wish it did is XAUTH user credentials.",
        "Does its job, very easy to setup and configure if you know the basics of vpn and networking. I would highly recommend.",
        "This unit was purchased for connecting to a Sonicwall VPN system at a location where two remote users shared the same internet service. It was determined that a hardware device would be necessary as the pure internet connection would not work with two users connected simultaneously (one user at a time worked fine). The less expensive Linksys BEFVP41 did not work in that application after the Sonicwall system was installed. This Cisco unit did work when configured correctly to match the Sonicwall hardware, and permits two users to work with no dropouts. It seems to be a high quality piece of equipment and is much less expensive than the other brands considered.",
        "Great router for use by 20 people or less. Dual WAN function is very helpful to connect redundant ISPs. If you have more users, buy the RV082 or RV016.",
        "I tried a couple RVS4000s to set up a VPN connection and I could not keep the darn thing connected. I decided to try out a couple RV042s instead, and BOOM! Same settings, it stayed connected though! It was like night and day. I heartily recommend the RV042 for anyone looking to set up a hardware VPN connection.",
        "after losing one internet connection due to the ice in the area, I completely had to remove this pig from my network and put a plain router in. had used Cisco Dual Gigabit WAN VPN Router (RV042G-NA) twice previously with great success so was disappointed with this one. spend the extra 30 bucks. its worth it.",
        "It's the only reasonably priced load balancer I was ever able to find, and it does that VERY well... I had several of those during the years, and the new cisco flavored UI is even clearer and faster",
        "Great product, recommended for other users. Met absolutly my expectations. - - - - - - - - - -",
        "It works well when using site-to-site VPN. Configuration: One site has static IP while the other site has dynamic IP.",
        "It is widely reported throughout the forums and support areas at cisco that this router does not work with VOIP systems. It randomly closes ports--despite setting firewall rules that open ports. So, pretty useless.",
        "Solve my problem in a place with a poor connection. I've made the load balance successfully. It's a great product.",
        "Hubby purchased this for home use. It does the trick. There have been no problems that I am aware of...",
        "Cisco RV042 4-port 10/100 VPN Router - Dual WAN... Easy install and works great.",
        "Because of how things are laid out on this router it may not be preferred to a layman or somebody that has not setup a router before. However, for others that have done so many times and technical folk setting up this router will be a joy.",
        "works great and lots of features like ip blocking. i hang a cheap linksys 3400 off of it for wifi",
        "This router is horrible. It didn't work. After many hours on the phone with very very incompetent tech \"support\" they gave me an RMA and sent me a new one about a month later. The new one doesn't work either. It is the slowest and most unstable \"router\"(if you can even call it a router) I have ever seen. It's actually slower when both wan lines are in use than if you used only one wan line. It does NOT load balance and tends to freeze up with more than one download going through it. NEVER BUY THIS PRODUCT!!!",
        "It's working came with good packing and received shipment fast.",
        "Great Router. Tech Support is AWSOME! Built in RIP 1/2, Port Forwarding, Port Translation, NAT, Policy Based Firewall, VPN's, PPTP, And Much More... Put this unit between your system and the internet and you won't be dissapointed. Reliability is GREAT...Have several at differnet locations and work flawless for years!",
        "Used it to combine cable internet at 1 MBS and a DSL at 3MBS modem, Combined speed is as high as 14.29 MBS! Can't beleive how well this works.",
        "I thought I'd buy a new router to fully take advantage of the new DOCSIS 3 speeds so I bought this thing. Sadly it doesn't connect to the internet though. Back to using my Cisco 870 =)"
    ]
}