{
    "entity": "Routers",
    "text": [
        "While on \"Chat\" with Amazon representative Linksys would not answer their phone. Bad product and product support. All I asked for was a power adapter and product manual. Oh well waste of time, returned it......",
        "Best router, albeit dated, if you need to run 3rd Party firmware on this puppy. I use them around the house as access points, w/Tomato FW. Great stuff. Wish Linksys/CISCO continued in the same vein, but, alas, nowadays it is difficult to get a good router that is flexible to alterations. I have basically copied my review from the GL model. Although, I have to say, if you have a choice, go with GS... just not at over 100 bucks... :-)",
        "Well the best thing I can say is that this item arrived on time or earlier then the expected delivery date however that is the only good thing i can say about it.. It didn't come with a power adapter thankfully the antennas were included when I plugged it into my modem to try to configure the modem to factory default I found out that it was locked out with a custom firmware installation for a VPN firewall speed booster that cannot be altered or removed from the modem in other words it is useless and cannot really be used for anything else",
        "The unit performs well but because of my system I had to call tech support. Of course it was in India. After 60 mins with one agent I got sent to the \"senior advisor\" They resolved the issue quickly. It was not complicated and the first agent should have been able to do the same thing. After 80 mins on the phone I was done. My prior wireless units have all been D-Link and I never had any issues. Pretty much plug and go. I bought Linksys on the advise of a knowledgable associate. The unit works good but I can not get the access point to work. No time to deal with tech support on that issue.",
        "I bought this model after much research. I was not dissappointed. Installed in under 30 minutes, most of that time waitng for software to load. Follow the directions, boot up, insert the installation CD, and follow the on screen directions. I got my Dell desktop running XP, with a Motorola modem to run in harmony with this wireless router, and even got my daughter's Dell Inspiron running XP to recognize the network. Everything is working great. My local stores claimed that the MFG is discontinuing this model, but for 40 bucks plus shipping from Amazon, I feel this was a great buy.",
        "Before I purchased this router, Linksys had a bad stigma in my mind -- I would try to avoid it at all costs, but this router was highly recommended and there is 3rd party firmware that allows you to add even more functions. Setup was a snap, as is with pretty much every router. I was up and running in about 5 minutes with a great diversity of computers (Apple iBook and Compaq on the wireless and a Dell on the wired side) I also use this with Packet8 VoIP service and have not had any problems, nor did I have to re-configure anything -- the both work seamlessly.",
        "The product that I purchased is in well working order except it will not work with my PS3, but works well with the Wii and PC. The only way the PS3 works is if it is plugged directly in to the router. The intended propose of the purchase was mainly for the PS3 and Wii. I was informed that I purchased the wrong router for the PS3 by the company that I purchased the product from. But other sources say that this router does in fact work with the PS3. Another problem I encountered is that it appeared to have been opened and someone had gone through the contents of the box.",
        "I purchased what seemed like a good wireless router, which will remain nameless, but eventually the performance dropped, pages timed-out, etc. I scoured the internet, but found that my particular model had persistent problems, and neither the company nor anyone else had a fix for it. Eventually, I replaced it with a Linksys WRT54GS. Not a problem since. As for nice touches, the ports are fully stealthed, and the encryption algorithm is a bit more apple friendly - I have an iMac - since the WPA security has options for AES and TKIP, and the Apple only uses TKIP; other devices don't allow a choice. Also, the router has 4-wired ports, in addition to its wireless capabilities.",
        "Easy to install and hook up on my desktop. When I wanted to add my laptop to the network, all I had to do was go to website and download a small program onto my laptop and it did all the configuring for me. I use security encription which in the past has caused problems with adding computers, not this tme. Wizards are great. I have been using it for couple months now and had only one drop, where I was required to reset the router. Very happy with this router the install wizard is great and makes this product. good range even with security on.",
        "I have nothing but good things to say about this wireless-G broadband router. First of all....very easy set-up. All I had to do is load the disk (that was included) and follow a few simple directions. Router was up and running in less than 10 minutes. I was having to restart my old router every time I tried to get online, usually 3 to 4 times until I would finally just shut off my computer and could not use my PS3 wired or wireless without it signing me out. Since I bought the Cisco-Linksys WRT54GS, I have not had to restart the router at any time and I am finally able to watch Netflix thru the PS3 without interruptions.",
        "I've recently replaced my Linksys 802.11B router with this G-version and had no issues at all with the switch. Plugged in, installed new software / drivers and I was ready to go in a matter of minutes. The new version of the router has easy-to-use access to built-in firewalls and other tools to limit wireless access. I'm using this with an updated PCMCIA card (also Linksys) without any issues - very fast, much faster than the old 802.11b. I can actually use for online gaming without any significant degradation vs. being plugged directly in. All in all, a solid product which I'd recommend if you're looking for a wireless router.",
        "Thankfully I have a son who is computer-savier than I. The device works just fine, but even for him, there were major problems to overcome. One of the pluses of this product is that it still allows for plug-in cables, so we were able to use the router before the wire-less portion was fully functional. Besides, only one of our 3 machines (mine!) currently has wireless capability. Nice, not to have to plug in. The four stars are a consequence of the installation process, not the function of the item.",
        "As a person who is basically computer illiterate, it came as a great pleasure to learn that this router could be set up and put into full use in just a matter of minutes. The first rate customer service department was able to help me with a few minor questions and was knowledgeable about all aspects of the product. Once up and running, I can use my computer everywhere in my 2004 square foot house, including the basement and my screened porch. This product is a real life saver.",
        "I purchased this router to round out my new wireless home network. The router is excellent, easy to maintain and the security works very well. I gave this 4 stars instead of 5 because of the setup software. The instructions say to use the CD that comes with it, but it would not setup the router correctly. I went to the Linksys website and used their Windows XP tool and in about 2 minutes I had a wireless network! Very pleased, and as usual, Linksys makes outstanding products.",
        "This was an upgrade from the WRT54G v1.1 that I previously had before the power supply died. The one big difference I have found out is that this model doesn't support the third party firmware that really added to the functionality of the router. Because of that, I am using it just as a bridge and using a Cisco router for my broadband connection. The stock software just doesn't have the features and management that I would like. This was a step backward from the older version.",
        "The router works flawlessly once you complete the setup. I would have rated it five stars, except that the setup was frustrating - we renamed the router and yet it named it differently after we completed the setup screens. Also, the setup has multiple tabs; sometimes the info from one tab is called something different in the other tabs which is confusing. Thus, a task that should have been easy -- such as changing the password from the default -- involved searching the internet for directions. Once you complete the setup, it is a great router.",
        "I just bought this router for a new Macbook. This is my first Mac and the router doesn't come with software for Mac so I called tech support. After waiting about 20 min I was connected with someone who not only helped me set up the router, he stayed on the phone with me while we tried several different security settings until we found one that worked. This was the best tech support I have ever had for any product. The router works as intened. I have access anywhere in my house and setup was very simple.",
        "Cisco-Linksys WRT54GS Wireless-G Broadband... Linksys was good while it lasted many new systems now with better protection",
        "I purchased this product from Noga ranked \"like new\" but I received totally dismounted with one antenna hanging that I have had to fix with a soldering machine. Attention Noga when classifying your products, I think that any usual customer should ask you for refund. The router is good, I replaced the firmware to DD-WRT that made a $20 router in a $200 completely new one. No complains about the model, it's great for my purpose.",
        "Setup was straight forward. Helps to be knowledgeable about addressing home networking functions. Had it up and running in about 30 minutes, handshaking between my desktop, notebook and printer. Notebook retained good reception and speed even at far end of house, nearly 80 ft away. Great piece of gear. Decided to go with G broadband till N is proven technology. G is plenty fast for my needs. Would highly recommended this router to a friend.",
        "I had been using a Netgear WGB111 wireless router in our home for several months, but the connection speed was extremely unreliable and variable. By resetting the router frequently, speed improved. However, it was driving us crazy, so we decided to shop for a new router. After reading lots of reviews we decided to buy the Linksys WRT54GS. What a difference! This router really rocks. We have had to reset it a couple of times in the 2 months we've been using it, but when it has happened it is obvious (unlike the Netgear) and the connection is immediately restored.",
        "I had mixed experiences with this router. The wireless on first one that arrived didn't work. I quickly got through to technical support, who were methodical and considerate. After about 45 min of attempted fixes, the rep diagnosed that the wireless portion of the router was defective. I went to a local store, bought a new one, and it took literally less than 1 minute to hook up before it was working. I am pleased with the speed and range of this device. So I give the product 5 stars and give Linksys' tech support 5 stars.",
        "I read all the instructions and talked with my local user group and it set up fairly easily. I had a few stumbles, but I figured out what caused the issues. I used the encryption and mac address for security and feel confident that my system is safe. Everything else is wired and plugged into the router. I am having some issue with printing to one of my printers that is on the network, but am confident I can figure it out. On the whole I am very pleased and would recommend it.",
        "I bought this in 2004 and Wireless G was just coming out. I have no complaints ever since. It has worked straight from the box and regular firmware upgrades have been available from linksys. I also have a linksys PCI cards and those to have worked flawlessly. I wold highly recommend this router to all out there. It also has working software that won't crash your system from linksys that make so those less savvy then I can configure it and be up in running in about 10-15 minutes.",
        "I purchased this router for $90 and had it for a year. After a year of pretty slow internet that I thought was my internet provider (because I had a brand new router), I called Linksys for support and they told me the router was well over 5 years old, had firmware from 2005 and could no longer be updated because Linksys no longer supports that router. This company lied to me and sold me an expensive product as \"brand new\" that was refurbished .",
        "Its an old model that just does not stand up to today's models, however, its a great router when it was in its prime. I am also using it for testing 3rd party firmware which has worked great so I am very pleased.",
        "Constant problems with the router \"FORGETTING\" my network. I have to set up my network again, and again. I have done it three times this week. The router acts as if I have never set up my network, and tells me a \"new network has been detected\". I end up going through the setup proces a few times a week. For some reason, it also sees three of my xbox 360s ... even thoghu i only have one. I would not recommend buying this.",
        "I received this router and port 1 on the ethernet was dead. Wouldn't even light the LED up. darn. That was the worst part. The best part was Amazon...or can I say Amazing. I called in, they shipped me a new one and sent UPS to pick up the bad one. I had a new router in my hands in less than 24 hrs because Amazing (Amazon) shipped it overnight. The second one worked fine. Amazon did me fine. From now on this is my first stop....besides, they have the best prices available here.",
        "I bought this one because my last Linksys stopped working. I like this one even better. My original Linksys always seemed to be dropping the signal and finally, stopped working. So far this one hasn't. It was also very easy to set up, only a cable and a push of a button. After many months of service, I can honestly say that this was one of the best investments I have made in my computer networking hardware.",
        "I am a Verizon DSL and iMac user of no great technical prowess. To enable my son to go online with his Dell laptom, I added the Linksys WRT54Gs to the mix. Setup required a toll-free call to Linksys technical support--it turned out that the Westell 6100 DSL modem and the Linksys WRT54GS had the same default IP address assignment. The tech guided me through changing the Linksys' IP. Since then, everything has worked without problems. The router's signal is adequate for our 3-bedroom house.",
        "Dated, but if you only need it for Internet connection it is still pretty useful. Just switch the firmware for Tomato and you get lots of features that the original product lacked (QoS and live usage charts, for instance).",
        "Unfortunately I had to return this item because it appeared to be hardware version 5 (which means it is based on VxWorks operationg system, not linux), so is is not compatible with the alternative firmwares. That's why only four stars. The bottom line: highly expandable, very reliable router, but if you plan to use alternative firmware make sure you are not buying version 5.",
        "I have had this router for probably about 5 or more years now. It has no issue with handling up to 20 mb of download speed. The wifi extends strongly for about 30 feet, good for about 60 feet and I can go about 100 feet before I actually lose signal. I run many devices, many times at one time, and this device easily handles them all. This may be a little outdated, but if it is still available, I recommend it.",
        "I had trouble getting the first router to work, even after 2 hours on the phone with a Linksys rep. They determined that the router was defective. (I found out later that it was a problem with my modem, so probably not the router.) However, Linksys gave me a case number, and Amazon accepted the return and shipped a new router...all without shipping charges! I'm getting great speeds with the new router (and new modem), and the service from Amazon and Linksys was wonderful!",
        "Just received the Linksys WRT54GS Wireless G Router this evening and, using the Setup CD, it took just 7 minutes to complete the installation. It took another 5-10 minutes to configure the unit. I purchased this router after returning a Motorola router last week that would not install, even after 45 min. with tech support. I highly recommend the Linksys if your looking for ease of use.",
        "Writing custom firmware to use with HAM radio mesh node networking",
        "I bought this wireless router so that I could use the Netflix Roku machine. It works great. I would recommend calling the help line when you install it. They have automated instructions to help you set it up which was better than the software it came with. Also, for some reason in the EasyLink Advisor it says that there is no internet connected but it is so I just ignore that message.",
        "Verizon FIOS supplied a D-Link 624 AirPlus Extreme G wireless router (model DI-624) with their installation last year. While the D-link router's hardwire LAN worked fine, the wireless connectivity was extremely poor. Fugetaboutit on the opposite side of the house. Maybe 2 bars sitting 3 feet away. External antenna, tweak this, tweak that, calls to Verizon Help Desk, nothing improved the wireless connectivity. Based on the positive reviews below, bought the WRT54GS, installed in 15 min, and we now have full bars and 54Mbps wireless connectivity. Proof is the evidence. Highly recommend this unit.",
        "I just set up a home network, which is now working very fast with zero trouble. I use all Linksys produts, Linksys BEFCMU10 EtherFast Cable Modem, this router and Wireless-G PC Adapter for my notebook computer. The set up of this route was easy, and I like the fact that I can stack up the router on top of the modem. Smart idea from Linksys! The point is my network works great without me paying any attention to thses equioment. I am happy with this network.",
        "I am very satisfied with this wireless router. I have owned it for several years now and I even take it back and forth from my two homes. It is very reliable and durable. I am very satisfied with this purchase.",
        "Linksys is a respected company and I have used their products before but I dont know why and how they managed to come up with such a aweful product. I purchased one 4 months back. It kept on going dead and I had to restart it almost every 30 min. I called amazon and got it replaced. The new one also didn't work that good. And finally one day it went dead and I pressed the reset button located at the back. After that it has never worked. I am going to call Amazon to see if they can refund me some money or otherwise I am trashing. I have made a vow never to use linksys products again.",
        "top notch product, great transmission to second computer one floor away. Speed is excellent for G standard. The only problem, the set-up could have been easier, the directions required someone with minimal technical knowledge. As this was replacing a unit that was made by a different manufacturer, better instructions could have helped.",
        "Our first linksys lasted 8 years, this has been in our house for a month and we give up, it is worthless. On the phone with Linksys support for 2 hours not much help and difficult to understand. The one button set up is a joke. Like other reviewers, this router crashed constantly, we restart the thing 7-10 times per day. Junk!",
        "Under no circumstances should you buy this piece of crud, which would not work even after an hour and a half on the phone with the (really quite nice and thorough) tech in the Phillipines. The device worked great as a wired router but would not allow me to connect to the internet even though my laptop said I had an \"excellent\" connection. After 90 minutes of changing every conceivable setting on my laptop, the tech told me that the router was defective. My Netgear router never gave me a problem. Go Netgear.",
        "We have tried every other brand of router & this one with the speed booster has worked every time & with every ISP. Best money I ever spent on a router. That's why I bought this one as a replacement for the exact same version I had before.",
        "Excellent piece of equipment that works as described by Linksys. It was easy to install and set my home wireless network into motion. Has worked flawlessly since the moment I added it to my network. Will recommend to anyone looking to set-up their own home wireless network. A \"no-brainer\" for installation and functioning.",
        "Excellent product. No problems in usage. Telephone support was spot on. I had two Belkins before. They both didn't last more than a year before developing glitches. Belkin tech support no help and tho they would replace it free, they wanted me to pay for shipping. No thanks, so I bought this Linksys instead.",
        "This product was not tested as listed and when I received it was non functional. After accessing the gateway I was able to see why. It had been flashed with a Japanese language Tomato Dual WAN firmware. Since I don't read Japanese I did not bother trying to TFTP or flash it back to DD-WRT or factory. This is unacceptable for a listing under Amazon Warehouse. --- Edit 1: Router is great seller was poor.",
        "Overall, this is just a great product that works as advertised. But... when I first got this router it didn't work and I called customer service who fixed the problem immediately. If you have a DSL modem or cable router, this has to be set to a different IP address...I guess I'm new to home networks, so didn't think to check that....anyway customer service fixed the problem in like five mins.",
        "I bought this router to replace a Netgear 802.11b router that I've used for a couple of years. This one worked from the time I plugged it in. The DSL service I use required some changes to the MTU setting to pass along secure webpages, but the customer support solved it easily and it's described (a little obscurely) in the online documentation from Linksys.com. It provides good distance (>100 feet at highest speeds) and solid connections.",
        "The Power Adapter which plugs into an electrical outlet makes a LOUD and annoying buzzing, humming sound. I've tried plugging it into other outlets and a power strip, but it is still loud. Anyone out there have any suggestions??? The wireless routing function seems to work ok. I had someone with professional experience install it for me so I can't comment on ease of set up. I'm certain I could not have done it myself. I noted that the instructions were for Windows only! The installation CD says it (the CD, not the router) will only run on certain Windows editions. I have an I-Mac and a new MacBook so that was useless to me.",
        "After half a year of getting 2/5 signal bars from my old wireless router (even being in the same room!) I purchased this one. It was very easy to install (didn't even need the CD) and my laptop immediately picked up the signal. So happy to have a secure wireless network with full bars! At last!",
        "works great, though setup for me was kind of difficult. Have never done this before and had to play around with windows for awhile and eventually call verizon help desk (from India...how do I know they haven't recorded any of my personal info???) Now when I have to, I can get it running on my own. And seems to be very reliable.",
        "I purchased this product about a week ago and have to say that I've had absolutely no problems with either installation nor performance. I have a cable broadband connection and at a 20' distance (and through a wall and a door)the performance seems to be identical to a direct cable connection. Great product in my book!",
        "This may be a good router, I wouldn't know. I couldn't get it to work. It is not Mac friendly. Now, I admit I am not the most computer savvy guy out there. I own a Mac, and have for years, because I want to do work on my computer, not work on my computer. I am spoiled. I like plug and play, not plug and configure and let's try this and let's try that. If I want high blood pressure I can think of better ways to get it. So, if you own a Windows machine this may be a good choice. If you own a Mac, don't bother. Amazon is getting it back.",
        "This was an easy wireless router to install and pair with other household computers. I also bought the Linksys WMP54GS Wireless-G PCI Card with SpeedBooster. With my old wireless router I was getting 11mbps data rates. Now I'm getting 44mbps. If you buy this router try and get the speed booster card for additional desk-tops. UPDATE: I have since gotten an Apple Airport router and as good as the Linksys was, the Airport is ten times easier to setup and use.",
        "Worked great right out of the box. It does the job i wanted it to do so I am happy",
        "The router I purchased worked perfectly, I did have to call Linksys people 1-800-326-7114 they walked me thru it on line easily, I recommend buying these used routers and saving about $50 on purchasing a new one at around $72.00 new. Very happy with it.",
        "Once I received it I started to set it up, I had a small trouble, I consider linksys should explain more especificly. I reached a point when I set it up with my notebook connected to the wire, such as the installing program says, in that moment the wireless didn't work, just internet by wire. I had to manage myself how to set up the wireless connection looking for in the program. The program is not that easy and self-taughtthey say. But finally it work out perfectly. Im happy with it",
        "After first hooking it up, the router could not get on the internet. After connecting with Linksys and changing some settings, it has worked ever since.However after taking one wireless computer off line, we lose out internet connection. This might be caused by the router or the modem.",
        "I first installed the router on Windows ME,the software would not install.So I dowloaded a newer version and it went smoothly from then on. I have upgraded to Xp since then and the router never flinched.My son's can access the signal all over the house.I have nothing but praises for this model. The price was right.",
        "We've just bought this fine product and all we can say is that a child could connect it and be up & running in under half an hour. My laptop is a \"b\" and my hubby's is a \"g\" and he's on the couch jamming online radio winamp and I'm surfing the heck out of the net. We're both runnig at 54 Mbps... in case you're not sure if that's fast... it's fast. I don't see a difference between this and my desktop cable connection. ^_^ A GREAT BUY! a steal for the price!",
        "Love this unit, is so easy to setup. Great price. have had it up and running for almost a year now, no problems. I do recommend useing the security encriptions and turn off broadcasting, unless you don't mind people freeloading off your highseed and slowing down your connections.",
        "I used mine for several years, my 2nd wireless router. Always had issues about the device losing settings, so often I was not aware the device was no longer password protected. I thought it was after a power outage, but I notice this even without an outage. The device has low tolerance for interference from neighboring routers from other apartments in my building, so that the range became very short. My new Belkin router has neither issue, and has been working like a champ. An older Belkin I helped setup and program has never lost settings in several years of use, no apparent issues with interference either.",
        "Great router with detachable antennas as well as great price. Router showed up in mail within a week with standard shipping although the predicted 4-17 day s&h time. I was able to configure the device within 2 minutes and i needed no soldering when i added high gain antennas.My main highlight of this product is the wide capability with the low price.",
        "After spending 30 minutes to set up, its range was very short and dropped signal in the bedrooms. After setting up a second time, the same problems. I was told Linksys has quality problems out-of-the box since the Cisco acquisition. I returned the unit and bought a Belkin wireless router. It worked the first time and the range was much longer and the singal was twice as strong.",
        "Freedom from going into the basement to the main computer.Two bars from the basement to the second floor on the other side of the house gives good quick response to internet access. The only problem was the set up, for some reason I had a very hard time setting up and then making the system secure. Finally it is set up and working well for over a month now.",
        "the router has worked fine since i installed it. the installation was easy and straight forward and i haven't had any problems being connected from quite a distance from the unit. this product has just performed like it is supposed to. so i'm happy with it.",
        "This is the second Linksys wireless router I have installed. The install went reasonable well and the unit is working as advertised. These products seem to be a good workhorse with reasonable software/controls available for the average user. This would be a good unit for your first install. It appears that the software to control the wireless unit is only available via the wireless connection. This is not a problem -- just an observation.",
        "I installed the WRT54GS on my network - 2 PC's, Laptop and a network hard drive. Setup was easy although I had to work at the Toshiba MS Vista wireless connection. The only problem I have had is that the unit locks-up occasionally requiring a reset.",
        "I got this router and it was defective out of the box. I did the Amazon replacement and the new one arrived 3 days later. The new one worked well, but the software included is god awful. And I had to go to the support site forums to see what tweaks I needed to do to get it to perform well with all my equipment (PS3, Xbox 360, Wii, 3 PCs, etc). Once I found out the proper settings to tweak, this has worked like a dream.",
        "good when it was relevent. Used for number of years, easy setup and admin. but replaced with a newer TP-Link N wifi router",
        "This thing was so easy to hook up and get running. Almost as easy as point & click. I previously had a NetGear router and could never get it working with all of the laptops. This thing was so easy, despite a couple of reviewers that had problems with it. I am FAR from being a computer-techie, but I got it up and running with zero problems!",
        "Great little router at the time and I have upgraded to an N router but this one lasted for many many years",
        "Can't really compare it with others on the market since it's the first one I've used to go wireless at home. It was reasonably easy to install and it does everything I expected after reading the available advertising information and other reviews. My needs are simple and it satisfies them 100%.",
        "Purchased this router and no the easy set-up turned out to be about two hours on email chat, technician and his supervisor. After all was completed it worked! The connection is great and always on--i have fastest version of \"mom bell\" DSL and was happily surprised to find a definite increase in speed. A very good product and even if it might take a little longer i would do it again & would recommend it to all. My 2-Wire router burned out after 18 months and never worked as well as this one--also purchased Network Magic software which really helps..",
        "I have set up 2 of these in the last month and they are sweet. In the past I have tried netgear and it does not compare. EZ to configure and the home network (ez link advisor) makes things simple. Highly recomended, good range and fast.",
        "The router was very easy to set up and our wireless network was up and running in less than 15 minutes. The Macs we had recognized the network immediately. The XP computers took a little coaxing but eventually we were able to sign on 4 computers.",
        "I have to admit that I had a computer-savvy friend here, but this router installed quickly and functioned perfectly on the first try. I would highly recommend the Linksys to anyone who wants to get rid of all the connector wires.",
        "It's the other 90% of the time that I don't like it. Does not keep the wireless settings. I have to reconnect thru the DSL and set this up everytime I startup my computer. This is the second and last Linksys router in my life.",
        "The router does everything I hoped it would do. It's such a pleasure to be able to sit anywhere in the house and surf the internet, and share files back and forth. The router was easy to install and worked right away.",
        "The Linksys WRT54GS router is easy to install...directions come with pictures that respond to what you do. I can pick up a signal from my upstairs office all the way to porch in back of house. Great product!",
        "To set up, it's really slow, what is worse is that I bought the usb wireless with the speedbooster and the signal that picks up it's terrible, and for the other laptops that I connected, I sony vaio, a 2 Dell laptops, they disconnect, conflict with DHCP all the time, not very good, I recomend most dlink routers, I have one of those I it's great.",
        "this router works very well. after reading what others said i took it out of the box and then first went to the linksys site to download the quick router connect.. dont use the enclosed cd. working well so far.",
        "This didn't just start working out of the box like my old linksys wireless router. I had to call them.. basically they told me to do the auto mac thing in the router and reboot everything. After that it worked great. Why couldn't they just have the router do that as a default... oh well.. it works great now.. I'd buy it again.",
        "We have owned the Linksys WRT54GS for a few years and love it, so we just bought one for my mother who is planning on buying a laptop. This Router has great reception and works with all our devices, desktop, laptops, wii, playstation3 and pda.",
        "Very easy setup with easy startup instructions. Make sure you select a unique name for your network and not default--otherwise you will have the same network name as your neighbors that kept the default name.",
        "Great product, although a little overpriced. Bought through Amazon as was free shipping, which is a terrific deal, since I'm in Alaska, and most companies don't ship here without absorbetant rates...thinking we are a foreign country, I suppose.",
        "i am not happy with the seller,thay did not send the power cord that fits this router,i have sent sevral emails asking for the the power cord,thay said thay would send me the right one but never did,and will not answer my emails,so the seller comunication sucks.i will probely will not purchase from this seller again.",
        "I have used several routers for wireless and voip and this one was the easiest to install. Following the instructions and everything worked perfectly. You can add up to 4 different wireless or voip. Great product.",
        "This is a fantastic router for adding custom firmware. The dd-wrt firmware makes this router do amazing things. I would recommend it to anyone purchasing this router.",
        "Excellent product, provides very good signal range and it is easy to set up.",
        "Excellent product, works great. Did have some problem installing, but called their Technical support and they walked me right through it. Would recommend to anyone.",
        "Our older Linksys died after many years of service and we purchased this one which was so much simpler to install. You just insert the CD that comes with the router and it walks you through the setup even copying your current settings. We now monitor three computers and three TiVo's with the software. Excellent produce!",
        "It is easy set up and fast speed. Moreover, it contains moniter function to check how many computers online.It is very useful for setting up home network or small company.",
        "This is our second Linksys Router. We had the first one for a year and had to replace it recently. We had no problems with it during that year but we did have problems installing the new one because the software needed to be updated. After talking with customer service I decided to ask our IT person to reconfigure it and it is now working fine. On the flip side, ordering and purchasing from Amazon, as always, was a wonderful experience.",
        "Not hardly. It works OK given the 15 foot distance it needs to effect. Beyond that it is just on and off.",
        "i have like 3 years with this router and it keeps going well im thinking about getting the dd-wrt software but i want to get an asus N router first i recommend it because it works well and its cheap",
        "It did eveything I expected it should do. It functioned flawlessly. Setup was easy. Signal is excellent everywehre in my 5200 sq house, even in the basement. Speed is very nice. I almost forgot that it is there after a month. It is maintenance free!",
        "I replaced a one year old Netgear G router with the WRT54GS and have been very impressed. I have had no problems with drops, and the speed is considerably faster than any other G router I have used. Easy to recommend!"
    ]
}