{
    "entity": "Routers",
    "text": [
        "Bought this because my router was not supported by dd-wrt software. This one is and I really like the MANY great additional features the software adds. BUT Every once in a while the router crashes and requires at least 2 reboots before it works properly again. It was used, so I am not too upset, it only happens very seldom. All in all a great router and the price was fair.",
        "No wireless N enabled devices will even connect to this for me, no matter which settings I change. Also... I noticed that the sticker on the bottom of the device with all the information on it has been overlayed with a new sticker claiming it to be a different hardware revision... idk kinda hokey feeling. Sitting in my closet gathering dust.",
        "This is my second one of this model router (first one died from lightning spike). I love how well this handles everything thrown at it- i don't use the software that came with it, but installed DD-WRT , which really allows the router to use it's fullest capabilities. A solid router for tweaking, hardware is up for the task if you use other software than what comes with it -as long as your okay with the risk involved with potentially bricking it if your install goes wrong.",
        "great. I love it. Good range and work very well",
        "When it works, it works great. Unfortunately, to get it to work right, I have to reboot this device at least once a day. Most of the time, the reboot is due to the router no longer seeing my attached USB hard drive. Hopefully, Linksys will come out with updated firmware to fix this issue.",
        "It died on me after about 8 months, I used to love linksys. After this failure I went out and bought a netgear.",
        "Bought this for the home since we had a few PC and a printer and did a lot of online gaming with World of Warcraft.",
        "Quit working after 3 months of use, just up and died, won't power up",
        "This router has less range than my old Netgear Wireless-G router. Very dissapointing. Also, the setup wizard on the supplied CD didn't work with Windows XP, and I had to manually configure the router. Other than that, all router functions seem to work well, and the user interface is very good.",
        "the item is working very good i do not have nothing to say about it i love it no problems",
        "I've got two of these units in my SOHO and since configured I've been able to forget that they are there. They are mre configurable that some other units that I've worked with for the home. That's what I expect from a router and these units have not disappointed me. I'd recommend any day.",
        "I am a tech guy, and this is a terrible unit and mine died after one week. Hey Linksys, or Cisco if you wish, change your software and make it more user friendly without having to go to the IP which most ppl know nothing about",
        "I have installed many wireless routers. The step by step wizard complete with animated connection video really takes the guess work out of it. It worked the first time. I would recommend this device to anyone.",
        "Funcions well as it was designed to. Cisco Systems is a leader in it's field, so any product you buy with their label will operate as expected or better.",
        "Run solid with DD-WRT. Stay up for weeks without rebooting. It does somewhat increase the wireless range (I think). I no longer have problem with my kitchen pc. It handles these: 1. our hardwired maxtor shared drive. 2. my hardwired pc (nVidia gigabit). 3. our wireless kitchen pc (trendnet wireless n usb). 4. our hp 6980xi printer wirelessly (11g). 5. my iPhone (11g). 6. my work Thinkpad T500 (wireless n). 7. my wife eee (11g). 8. my nokia internet tablet (11g). I'm using DD-WRT v24-sp1. Somewhat buggy (have to reboot the router again to get the wireless back after a restart).",
        "The firmware has serious problems in many areas: NAT: doesn't save settings, you must try more times before getting it right Wireless connection: if you have more computers connected the connection will drop continuously. Even every 2-3 minutes USB storage: Very limited features and many times it doesn't work or save settings. From time to time you need to reset it because the DHCP server stops working. If connected through DHCP to the provider, it won't rapidly recover from a connection drop. The only positive thing about this router is the easy to use management web interface. My suggestion is to avoid this product because it needs a new, more reliable, firmware.",
        "I will never buy a Linksys product again. After Cisco bought it out the quality has been bad. Had to return 2 times to get a working unit. Even then it was pretty bad. I replaced the Linksys firmware with DD-WRT. Only then would it work. Even with the DD-WRT firmware the Wireless N wouldn't work. So I had been using all my N devices as G. Used it for 5 years and it finally died. I was copying large video files over the gigabit LAN and the hardware couldn't handle it. I now have an ASUS RT-16N it works perfectly. I had to upgrade the firmware on the ASUS to the latest. Wireless N works great with the ASUS.",
        "If you've set up a wireless router before, you'll find this to be a snap. Administration is virtually the same as with my old G router from Linksys. I had it up and running in minutes with the latest firmware. DHCP Reservation is a huge addition in my opinion. Now, when the power to your router goes off, your machines come back with the same IP addresses as before. When your different IP devices interact over the network, that can be important. Range seems to be about the same as my old G router, but I think the range boost comes when using N hardware on the clients.",
        "I had a WatchGuard FireBox router before this and I always had problems with my VoIP, so I looked this up. I enjoy the easy setup that Linksys offers. The Storage Link needs a bit of work, but it works even if you have a Active Directory controlled network at home like me. The gigabit speed is cool to boot. All of this for under $200!!! Oh did I forget it has Wifi Pre-N, but that is worth $150 by itself. The pricing is very aggressive for everything you get.",
        "This router works good if all you want is an Internet connection for casual surfing. Shortly after I open a port for forwarding traffic, the router locks up and I have to reset it. This is a low end router. The price for this average router should be from $50 to $70.",
        "As a simple G router it works fine but as something that promises more, it is a failure. First, the wireless range is no better than a G router. Second, the USB attachment for a network shared disk drive works poorly when it works at all, which isn't often. Third, Linksys was unable to help me get my network printer working at all which had previously been working just fine on a G router. So, all in all, I would recommend that you avoid this product.",
        "After a week of testing I returned this product. I'll wait for Version 2 of the hardware, which is supposed to come out soon. I had problems in particular with a Core 2 Duo Mac Book Pro, which kept dropping the connection. I went back to the faithful WRT-54GS V4, which is 100 times more reliable but limited to b/g. After making a lot of online research, I believe it's better to wait for newer N models in general. I plan to try the Apple one when it comes out or the WRT-350N V2.",
        "This product is a good for my need: 802.11N and a built-in media server to serve the D-Link DSM-320 media player I bought. The built-in ftp server and remote access to storage is also I want. However, this unit doesn't provide internet connectivity after setup. The setup procedure is straightforward and easy to follow. I can see the router obtained the DHCP IP address via the cable modem. But in the end, I cannot reach internet from my LAN PCs. It appears the NAT function simply breaks. I am on the latest firmware. I am waiting for the response from Linksys Tech support before I can decide what to do next. A big disappointment considering the band recognition Linksys receives.",
        "I am somewhat at a loss to understand all the negative reviews of this router. This router is a breeze to set up and works great. It is forgiving of about every sin you can imagine. You plug it in and it works.",
        "Per Linksys Customer Support, this item is discontinued. They no longer provide any firmware (current or legacy) for any version. (I found this out the hard way when the device bricked and the only option Linksys could offer was for me to buy a different model.)",
        "Installation was simple with the CD and material provided. Works great. Wireless printer works great. I am disappointed in the wireless storage feature. After an hour on the phone with Linksys support we discover it will not work with an NTFS formatted drive. Overall, satisfied. If you want to use the storage feature suggest digging further into requirements and capabilites before buying external storage.",
        "This Box Is Great Piece of Hardware but the LinkSYS standerd firmware sucks, it needs a reboot daily because it hangs and the performance of the USB is very very slow I had to change the firmware to the dd-wrt firmware and now we can play. It is very good box if you are a computer geek because you will learn how to handle and fix it. If you are a regular user do not try to buy it or you will get very disappointed.",
        "The price was great I can't deny that, I paid $65. But the product has some complications. Such as losing connectivity from time to time out of no where. I believe Linksys is working on a new firmware to update this issue. If this product is over a $100.....DON'T BUY IT.",
        "This thing is amazing. I haven't had a wireless network before this, and was ready for some problems when I installed it. Happily, the install went smoothly & quickly, with no problems at all. The adapter installed in my notebook just as fast. My home desktop has a 6MB connection, and is pretty quick. This router is at least just as fast. Pages load quickly, and work files upload to the network like I was connected at my desk. Extremely happy with it. Next up is adding a hard drive to it so I can share music/files.",
        "I wasted $200 by purchasing the router. Wireless connection keep dropping every two days and you need to reset the router, wireless range is very less when compared to WRT54. Stay away from the router. I really don't understand how linksys can release such a worst product.",
        "Received the router and got it up and running with no problems - but I am familiar with linksys routers. The storage link documentation is lacking at best. I was able to finally stumble through and get it working as a FTP server, but if you ain't a network engineer, you might be puzzled as to how to set it up. It is a share on a network, not a stand-alone like you would think. Gave it a 4 cause of documentation. Otherwise, kicks.",
        "Upgraded from a netgear-g router to resolve issues with the distance. The neighbor gets a great signal as well. Easy setup, the restrictions work great (The kids hate it). I've run Battlefield 2142 from three systems without a problem. I had some issues with it locking up with PSK2 security but changed it to WEP and have not seen a problem since.",
        "i updated it with DD-WRT right when i got it and it has been up and running ever since with no restarts for over a month now",
        "As a wireless router, it's one of the worse out there. New out of the box, it gets one star. Several years ago I flashed the firmware with DD-WRT, disabled the wireless and it makes a great gigabit switch for my home media server and NAS! Now it's a five star device! :)",
        "This router is much faster, but, more importantly, it eliminated the dead spots in my house that my Wireless-G router was experiencing.",
        "web based Setup is easier if you know a little about wireless network Setup then the Included Utility. Too bad the Included USB does not work with printers. But all in all as advertised.",
        "The software setup is easy it is fast on the host computer but the range leaves a little to be desired.",
        "Not sure why people don't like it, works great for me. No lost connections and my PS3 works well with it. 2girls1cup plays just fine, couldn't ask for anything else."
    ]
}