{
    "entity": "Routers",
    "text": [
        "I truly like the speed of the wireless connection, I compared it the Lynksys and saw a dramatic increase in speed using the dlink. I also like the 256 bit WEP. A couple of major issues I am very uncomfortable with is not being able to turn of the SSID without having major connectivity problems on the wireless side. The other issue is having to reboot the router every day to reset the wireless connection and be able to connect to the internet even when I can ping the router from my laptop.",
        "I've used both the Linksys products and this D-Link AirPlus w/the AirPlus card. The AirPlus, hands down, blows the others away. I have full signal strength anywhere in the house! The firewall configuration is the most advanced I have seen for a product like this. It will even open up incoming ports based on the time of day from a NTP server! If you're going wireless, the D-Link AirPlus series is definitely the way to go. I'm getting my friends to dump their Linksys's and go with this one.",
        "I use it with a DWL-650+ PC Card adapter in my laptop. Inital setup went so, so. The laptop could connect to the internet, but not see only the networked computers, but not there content. Spent tooo many hours trying to get it to work. Then the PCMCIA card would not be seen by Win 2K and want to be reinstalled, and failed. After five months, the DHCP server died. So I will not be purchasing D-link in the future...",
        "I've been using it for about a week now and it works very well. I was concerned about the other reviewers that complained about range but it works fine in my house. It replaces my BEFSR41. The setup pages are a little cryptic but I'll get used to it. Would have liked to see the lease time on the DHCP address of the WAN side but it's not available. Had problems connecting an AirPort card on a Macintosh to but I'm not sure it's not a problem with the Mac.",
        "This is my second attempt at wireless. I first tried a Netgear router and wireless laptop card. The system would work for a while and then drop the signal for no apparent reason. This D-link system was simple to set up and has worked flawlessly ever since. The only downside is that to make any changes to the router you have to run the network wizard instead of going right to the parameter you want to change.",
        "I bought this 614+ with a D Link AirPlus DWL-650+, also supports 22 Mbps. When I tried to transmit some files under 22 Mbps mode, speed was almost same as 11 Mbps mode. I think the firmware and drivers are not optimized well enough. The DWL-650+ has cardbus interface and it's really 20% faster than other 802.11b products which has pcmcia interface as they insist. This router has good web based interface and good quality.",
        "This item would have been great if it worked. The antenna thing was disconnected or broken internally and just swiveled around. Did not work as a wi-fi router.",
        "This has been a great router. I have had no problems with it whatsoever. One drawback is that even with the \"AirPlus\" reciever PC card, I haven't seen the promised 22mbps speed. You don't need 22mbps to surf the net though... Overall, a fantastic investment. I share my cable internet access with 3 roommates and even let the neighbor piggyback! Config settings are straightforward and easy to use. Bought one for my mom to use with her laptop... she has had no problems. I highly recommend this router!",
        "Could not get PPPOE logon to Earthlink to work. Tried upgrading the firmware based on an FAQ on the DLink support site. Finally gave up, returned it and purchased a Netgear unit. Got the Netgear up and running in no time. I would suggest either a Netgear or Linksys router, but no DLink products.",
        "It worked right out of the box. In the 4 months I've had it, I've only had to reboot it a couple of times. I added an external antenna so that I could beam my high speed internet connection to a neighbor across the street. I couldn't ask for much more, especially at this price.",
        "Easy to install, easy to configure, extremely versatile and just a great value in general. I loved mine so much I talked most of my friends into getting them and they all agree it's a great way to 'unwire' your home.",
        "It took less than 30 minutes to setup this router up. It's has been very easy to install and configure. ReadMe & FAQ was really helpful in troubleshooting. Download the latest FW upgrade from Dlink site before connecting to the modem. Great product from Dlink for a very good price. Good Luck!!",
        "Easy to set up but I did have to call tech support for some assistance with configuring it. Manual has little help for Mac users and the telephone tech support is worse when it comes to their knowledge of the Mac.",
        "15 mins is all it took to get it up & running with my DirecTV DSL. I also updated the firmware to 2.0f.",
        "It works well. I cannot set up a home network with it, though. My last D-Link was a snap to set up a network, but no this one. Other than that it's fine.",
        "I had a SMC router and it always used to drop my connections. Moreover the setup was so bad. I was not able to connect 2 routers in a series with that one. But the D-link router was just amazing. Plug and play. Once again, great router at a great price",
        "Got 3 or 4 mb/s wireless and wired is 9 mb/s straight from the wall is over 20 mb/s. Only one user too",
        "I had this setup for a total of 2 days before I was ready to throw it out the window (fortunately, I was able to send it back to Amazon.com). Setup is the pits, range is terrible since you have to be right next to it for the card to have a connection, and there are better, more affordable productions on the market (Netgear!!) Good luck to you if you are brave enough to try this.",
        "I've not been terribly impressed with this box. DHCP has been flakey at best (about half the machine in the house have required manual IP selection--AT THE LEAST), and the range of the router is ridiculously poor. At my fiancee's old apartment, my TiBook could connect to the wireless networks of two of her neighbors, at my band's rehearsal space, I can get to the next apartment no problem, I've been able to war drive. With this base station, I'm 15 feet away from the base station and can't get a stable connection. Tech support, at least, is reasonably helpful, but I would definitely consider a different wifi router if I were doing it all over again.",
        "This router works fine in my apartment. I have two laptops hooked up with the DWL 650+ card. The range is not bad, but signals will weaken through walls, floors, etc. Wireless phones, microwaves, and home alarm system motion sensors can mess with your transmission also. If you have problems, you should see if your cable modem is the cause. I wasn't satisfied with the 614+ until I returned my service provider's Motorola modem and bought my own Toshiba cable modem. It's been smooth and speedy ever since. When I upgrade, I'll stick with D-Link.",
        "I bought DI-614+ wireless router and DWL-520 NIC card. The PC that has the card is only 40 feet away from the router but it cannot receive the signal or very week (sometime got connected and disconnected rightway. This means my installation should be correct). The specs of both products say the indoor working ranges are more than 300feet. Customer service from D-LINK is horrible. Each time you call for help you have to wait for more than half an hour. I have tried to call support agentsfor 3 times. Each time I got aome one for help after long long waiting but none of them could give me a solution. Generally, it is a pain to buy D-LINK products.",
        "I bought this router to use with my dynamic PPPOE DSL connection. The setup and interface were easy enough to use, but no matter how I configured it, it would not connect to my DSL connection. The router would get PDAT messages and disconnect immediately. I found out that other people have had this same problem with this router. Also, I couldn't get the router to update its firmware. It would repeatedly give me a message saying that the firmware version is incompatible.",
        "I can't say enough about how easily this router set up. I downloaded the latest firmware first, then I had the hardwired portion working in half an hour, and the wireless portion in another hour. The only problem I had was with the PCI receiver card in the remote unit, it didn't seem to like one of my PCI slots but as soon as I moved it things went like clockwork. I'm sharing internet via a cable modem now among 3 machines and speeds everywhere are excellent.",
        "I had a very bad experience trying to install a Siemens router and exchanged it for this one. What a difference! The set-up was fifteen minutes and one five minute call to tech support. I was so impressed, I installed a D-Link ethernet router in our office. Same rapid simple set-up, and works really well so far. I highly recommend it for the home user who aspires to install equipment, such as a network, but doesn't have a high level of knowledge (like me).",
        "The DI-614+ has two different chipsets. The older models, like I have, can be recognized because they have two antennae, while the newer ones have a single antenna. The only problem I have with mine is that my 2.4 GHz wireless telephone interferes with it and so using the phone can cause the wireless signal to go out. But this is a problem for almost all wireless routers. Otherwise, any problem that I've thought I had with the 614+ ended up being a problem with some other part of the hardware/software puzzle that is home networking. I also own a Linksys WRT54G and it has worked flawlessly too. Buy whichever one is cheaper. You'll be fine.",
        "I used to be such a big D-Link fan, but they quickly lost a loyal customer in the last 2 months. The DI-614+ is [so weak]. I keep getting packet loss on the wired LAN side, Windows XP would complain for a brief moment that the network connection is offline, and of course the matching LED on the router would go off too. Wireless part is even worse. Packet loss, random reboot loop, you name it, it does... This is my last D-Link product.",
        "I bought this router and the D-link card. The set up was easy, and it worked fine for a while. But after every couple of days, I had to re-boot it. I found later that a firm ware upgrade would obviate the problem. But why should I need to upgrade firmware for the basic functionality. My recommendation would be to go for a tested 11 Mbps. Most people do not get internet connection over 1.5 Mbps anyhow so there is no bandwidth you are losing.",
        "The router is very easy to install and configure. I originally had a concern that VPN might not work. It's to my relief that this router works like a charm with VPN connections. Also the firmware seems to be robust enough that I haven't had a need to reboot the router for a couple of months now. I wouldn't say that on some other routers, wired or wireless. I have wireless notebook, iPaq with WiFi capability, and PC with wireless adapter in my house. They all connect via this router without any problems.",
        "I bought this router and is dropping VPN connection, this is very annoying. When I called D'Link, the support calls goes to some third party (not direct D-Link) I have to hold for more than 2 hrs to get coonected. The support guys does not have more than the config-guide knowledge. They refered the call to D-link special tech support. Never heard back from them. Returned the router to store. No option!",
        "I too, have the older model that has the dual antenna. Compare to our old trusty Apple wireless airport router, it does have longer range and stronger strength. Real world tested with both mac and pc. Set up is easy following the instruction provided. And the unit is reliable. Good deal. Unfortunately, I have no idea how the newer single antenna model performs.",
        "No problems setting up the router, just plugged it in (in place of our existing 4-port D-link DI-704) and it worked beautifully. We have Cox cable modem service with a static IP address so I don't know if it works with DHCP (see other reviews). Signal strenth is great, 100% even downstairs. No compatibility issues with my Belkin 11mbps pcmcia card. Haven't tried WEP yet so I can't rate that either.",
        "Hooked this up to my Mac G4, no software needed. Just remember to unplug your cable modem first, then power the modem, then power the router. Connects and reconnects without fail. I have been able to use an iBook with AirPort all over my house and outside. Also works fine with a Belkin USB Adapter on another floor.",
        "I'm actually happy with the performance of this router. Wireless is working fine with 2 laptops using a DWL-650+ PC card & a Linksys PC card, as well as a laptop & 2 desktops on the wired side. HOWEVER, contrary to the documentation my config has been blown away each time I've upgraded firmware (2). The first time, I saved my settings to the hard drive, but the file couldn't be read after the upgrade. The second time, I was prepared with a screen-print of my config.",
        "First one I bought was defective - so had to return it and get a new one. Then the second one worked for about a month when it simply stopped. (We hadn't installed anything new or done anything different.) Called customer service, repeatedly, and they simply had me walk through the same steps (reset the router, ping the router) without any resolution. Any attempt at escalating the problem resulted in perma-hold on their customer service line. absolutely awful customer service - anything that falls out of their scripted answers will not get resolved. Am buying a Linksys now.",
        "That's right this is your networking \"One Stop Shop.\" It is your router, your firewall, your parental controls, your wireless access point, your 4-port switch, your wireless authentication system, your DHCP server, plus it has faster 802.11b speeds than the others out there. Another great thing about this router/ap/everything is that it's so easy to install and get running. Some things are a little harder/you need to know what you are doing to get working, but all in all this D-Link thingy is beyond useful. Plus it's very inexpensive. Get the new version with one antenna if you have the option.",
        "With all the awesome features this Cable/DSL router has it makes you wonder how they offer it at such a low price. Parental controls, top notch 256-bit WEP, and MAC filtering will keep you secure and others out very well. The range with this router is adequate to say the least. I can stay online from anywhere in the house on my laptop with wireless adapter. Even with 256-bit WEP on my speeds and range is not effected. Overall this router is great and well worth the small price tag. I recommend this to home users and even if you've never done this before it is easy enough with all the intructions and installation wizards.",
        "Blazing fast wireless speeds, parental controls, MAC filtering, 256-bit WEP, setup wizard, ... blah blah blah, you all know this already right? My expereince with this product is nothing but success. It practically setup itself and I just changed the default settings to soemthing a little more personal as to avoid wireless hijacking or whatever you want to call it. I am truely impressed and wish I would have bought one earlier, except I wouldn't have gotten the deal I got. It was on sale for almost half price what is it now. Everyone, go out and buy this router now, heck order it from amazon.com and get it delievered for tomorrow, you wont regret it.",
        "I bought the DI-614+ and a dlink PCI adaptor DWL-540+ and both worked like a charm right out of the box. First thing I did was upgrade to the latest firmware. Have two computers sharing an internet connection with a cable modem, one is connected via the ethernet switch, the other is wireless. Although I'm pretty savvy on hooking up these sorts of networks, I followed the instructions in the quick start guide and they worked great. Got 22 Mbps at 100% signal quality and 66% signal strength, although the PCs are only 100 ft apart (two walls). Noticibly faster than using the internet connection sharing feature in Windows.",
        "Fairly easy to install, this one even has better encryption than the AirPort Base Station and I saved [alot of money] I had to buy an AirPort Card because D-link does carry cards compatible for MAC, but this was a blessing because the it installed inside my laptop above the PC card slot, leaving the PC card slot open. The install was even easier with my Dell Desktop, hooking it up to 1 of the 4 ethernet ports in the back of the DI-614+.",
        "I bought this sh.. four days ago. Tried to make it work at home, but looks like it has a very short reception range. I had my server on the first floor and tried my second PC to add to the network and nothing worked ( I installed dlink wireless adapter). The distance is about 40-50 feet max. Bad, bad product - a lot of frustration :(",
        "I bought a D-Link 614+ access point to network two rooms together that are about 15 feet apart (both the access point and computer were placed on the closest possible walls) and I absolutely could not get a reliable network connection. Any large downloads would crash it; the Symantec security scan crashed it every time I tried; running any level of WEP crashes it within minutes. In short, this is the absolute worst piece of computer hardware I have ever purchased, including certain things that didn't work at all. At least those I knew didn't work, so I didn't need to worry about half-operation like with this vile piece of garbage.",
        "I'm a tech lover, but not really the best at setting up and configuring tech products. So, when I bought the DI-614+ for my first wireless network I expected to take several hours trying to figure out how to set it up. It was much more simple than I expected, since I followed the directions in the quick installation guide exactly. I bought the DWL-650+ card for my laptop, and set everything up directly on my computer. It took about 30 minutes total from the time I opened the boxes, which for me was extremely fast! Now, I can walk all over the house with my laptop and stay online the whole time.",
        "I bought this router super cheap used. It was easy to install, and gives a very reliable strong signal throughout my medium sized apartment. I don't know about any special features, I just wanted a router that would give me a strong consistant signal, and that's what it does.",
        "This works when trying to get your PS2 online. No special settings. The installation process is quick and painless since you just have to follow instructions and the setup wizard makes it even easier to get running the way you want. You can even turn off the Wireless portion of this with a click of a button. I get a solid connection with this and the DWL-810+ plugged into my PS2, plus no lag. I wish I had the money for one of these and an 810+ earlier. I would have been online playing games for the longest time. There are no flaws in this router that I see.",
        "I got one [with a] rebate which is [a lot less] than a regular router. Setup is realatively smooth and it seemed work pretty well with the D-Link 650+ card (I wanted to keep it in the family). The routers wireless freezes every few hours and the router must be power cycled. This is with firmware 2.10 wich is relatively recent. I have since exchanged it with a linksys BEFW11S4 which is much more stable, has better range and works fine with the 650+ card.",
        "Setup, Install, Configuration, all of it. It was all a breeze. This router takes little to no effor to get running and stay running. That's the way I like it. I don't need more things that need maintenance in my life. I am glad this router doesn't need so much attention. I haven't had to configure anything for months and it just keeps working. No connection problems, no hassles with firewall rules, and nothing over heating, although this does get hot, just make sure you have a good place with airflow for it. Don't go sticking it in a drawer or something like that.",
        "I use Windows ICS to share the USB based ADSL connection at our home. Current hardware items include; DI-614+, DFE-530TX+ and a DWL-520+. The 614+ and 520+ are 50-60 feet apart with ~7 walls (some low angles) and the 520+ shows 57-60% signal strength with 100% quality and a 22Mbps connection. The remote PC's download rate is 150+KBs which equals the main PC's rate. Setup was a breeze and all the D-Link products have worked perfectly. With all the rebates subtracted, I've got less than $40 invested in my network.",
        "Almost three years ago I set this up to use with my IBM ThinkPad T30. It was simple to set up, worked the first time and has worked reliably ever since. The best indicator of a tech product's effectiveness is that it does its job and you forget it's even there. This product meets that criteria. Sure, 802.11b is being pushed out by 802.11g. So what. If you want a reliable product with good performance, this is one. When wirelessly surfing the web on my laptop, it appears to be just as quick as my desktop (hardwired throught the DI-614+). To specify, mine is the older 2-antenna version.",
        "I took a chance on using D-Link router -- the reviews here were pretty negative. However, I plugged into some of the PC Mag reviews and they gave ample support for my decision to go with D-Link. This was effortless and the equipment is top-notch. I didn't even read the instructions. I just plugged stuff in and started everything up and VIOLA. good stuff, D-LINK!",
        "I had some time settings issues and some weird reboots once a month or so, but since the new firmware release I haven't seen those problems anymore. The newest firmware was posted in march, but I didn't see it until about may. It works great now and I have to give it 5 stars because I don't have anything against it anymore. If I would have done a review like 5 months ago I would have gave it 4 stars. So my recommendation is to get the newest firmware and see if that doesn't fix any problems before you rate it low.",
        "This router is by far the best. In a recent PC World test, it was one of the cheapest and fastest available. If you connect with a AirPlus wireless card (like I do, I bought the two in a bundle), the speeds and ranges are extraordinary. The interface is easy enough for a novice to set up or detailed enough for people like me to tweak everything they want. You can block/allow virtually any kind of access many different ways (IP, domain name, MAC address, etc). I can't say enough about this product. I bought it a semester ago and it still is one of the best. Don't delay, espically with this price!",
        "I bought the DI-614+, so I could connect my laptop without having to drag around a cable. I have found that the router features are very extensive, but easy to use. The fact that the DI-614+ has a built-in help system is pretty cool. I not sure that I have seen that on another product in this price range. As for the range and speed of the router it is great! I get pretty darn good throughput and the signal is very strong even at the far end of my house. I would definitely suggest this router to anyone looking to set up a wireless network.",
        "The installation went with out a hitch, and I was very surprised to find out how easy it really is. The configuration of this device is fairly straightforward and has an intuitive layout so you will be able to find the setting you want quickly the first time. I recommend this to others who don't want to deal with a complicated and time consuming installation. The performance of this is good enough for me and I think I have pretty average demands from a DSL/Cable router. Plus the wireless is a huge plus.",
        "With this wireless router I can be anywhere in my home and get Internet with my wireless laptop. I also have a wireless bridge connected to a switch downstairs and it connects my game consoles to the LAN/Internet. security is awesome because it is 256-bit WEP. yes I know 128-bit WEP is crackable, but 256 will definitely take longer and thus people wont bother. Overall this router has been great to me and any problems/quirks I had were fixed with a firmware upgrade from D-Link.",
        "You gotta admit, the price is great! Easy setup etc.. Bla bla. But even after I flashed the firmware, it periodically drops the connection. I have to manually reboot it. But that's ok since I just use it at home. I'm hoping they will release another upgrade and get this damn thing to be smoother.",
        "I get probably around 5-6Mbps at best through out my home. In bad spots of the house I only get about 1-2Mbps, which is still good enough to surf the web just fine. There is a new press release by D-Link stating that these products will get free firmware upgrades to enhance the speeds to about 12Mbps real world. That's almost double what I get now! I am definately looking forward to this boost in speed and would recommend everyone to buy one of these now and some D-Link adapters because they will soon be even faster.",
        "I greatly appreciate it when I am able to install any kind of computer related hardware and have it work the way I want withing 20 minutes of opening the box. That's exactly what this D-Link did for me. I am able to browse the Internet anywhere in my home with my laptop and a DWL-650+ plugged into it. The speeds I get are perfect since I really don't notice a difference in surfing the Internet while on my laptop (wireless) then on my desktop (wired). I am very happy with my purchase.",
        "Has worked OK for my home network but with the following problems: - was crashing 3-4 times a day due to a circuit overheat. My friend replaced a heat sink with a larger one. Now it seems to crash about once a day. This makes it useless for attaching my Vonage telephone. - won't use dynamic DHCP assignment from my cable provider. Static assignment has worked OK and I have yet to try updating the firmware.",
        "I bought Linksys wireless-G router first. After 2 days, the setup was still not finished and couldn't get on the internet, especially with the wireless one.I hope I had bought this product first. I plug it in and turned the power on, then It WORKS!! so simple and the signal is so strong. Now I can use my laptop everywhere in my house by a wirelss network card. What a great product compared to the even more Linksys junk!!!!",
        "I recently bought a HP laptop and I wanted to create a wireless network so that I could carry my laptop around the house. After doing several searches for routers and wireless cards I finally decided on this one. So I bought it and installed it the same day. I was up and running within 15 minutes at the most. It was extremely easy to set up and works like a dream. I'm also a networking major in college so I've had experience with this type of thing and I think you will be very happy with this purchase.",
        "So far it has been reliable after firmware upgrade. This used to perform somewhat scepticle as far as a solid internet connection. then I remembered that you should upgrade firware ever so often and found that the firmware that came with the unit was waaaaaay behind what is released now. heck there is even a new hardware version of this router with only one antenna that is supposed to be better. either way I downloaded the latest firmware and everything has been solid for the past month or so. i am happy with my d-link router and appreciate the upgrades they provide.",
        "This product is horrible. I should have listened to the other reviews. While setup is easy, performance [stinks]. This router (combined with the 650+ card) slowed my Internet access to a crawl. Even after up dating the firmware it was as slow as molasses. Now that I have disconnected it - I am at full speed again. The worst part is D-Link service. Half hour on the phone, 3 emails - all no response (promise 24 hour turn around on the email.) It is clear that D-Link released this product before it was ready.",
        "I used this unit with my Toshiba notebook that comes with built-in wireless card. Although it took me couple hours to configure it to work, it's great after it's working. I love the security filters where I can limit my own computers to connect to this D-link router. I only gave it a 4 stars because I found this unit for [less at a department store].",
        "Setup is a breeze, read the manual/quick install guide and you are all set. speeds are great, especially with the new 4x firmware upgrades. reliability is fine for me. i read that other people have had problems, but i have probably read just as many that said the've had no problems. i am int he no problems catagory. i can try and get online via my laptop wirelessly at any time and the router is up and running just fine. i have MAC filtering on and 128-bit WEP on.",
        "For the price this router is a steal. I didn't think this would be as robust and easy to use as it is. I didn't really have to do much as far as configuring goes. I plugged in my cable modem and it conencted automatically after I entered my info in. The wireless part is fairly simple as well. You can even turn it off when you are away if you'd like. The security, parental controls, and firewall options are really what showed me that this router can do whatever.",
        "The wired connections worked just fine, and the wireless strength was very good. However, data transfer with a wireless connection worked very poorly. Requests to websites would take much longer than with a wired connection, and very frequently would not go through at all. We returned this after a few days in search for a wireless router that actually worked. We do, however, like that there is no limit to the number of port forwards you can define.",
        "I am able to get great range with this router by D-Link and an Orinoco Gold card. I don't get the speeds others are getting with this router and a DWL-650+, but right now I can't afford it. The wireless portion has worked without flaw or disconnect for quite some time now. It's probably been about 6 months since I've had the router up and running and about 3 months since I've been using the wireless portion of this. I am very pleased with this router and all of it's features.",
        "This router has been the only router that I've gone through within the past 3 months to actually stay connected online and keep it's wireless portion up and running for more than 4 days. In fact it hasn't rebooted, froze, or errored out in 2 weeks. I've only had it for 2 weeks so i see no faults in it. Also my wireless speeds have increased as well. I even went out and bought a DWL-650+ so my wireless speeds would be even faster. I didn't know 802.11b could go this fast.",
        "I was mainly interested in this router because of the price to feature ratio compared to others. It has so many features and such a low price that I am amazed that it can be offered at this price. Lots of security features, 256 WEP, URL/IP/MAC filtering, SSID broadcast can be turned on or off, and a bunch of others. The setup was rather painless and short, and I had my internet connection and wireless access up and running in about 20 minutes.",
        "I got this for my birthday and set it up on the first of August. Since then everything has been running fine. I get good coverage throughout my home and my connection has always been stable. I don't do anything out of the ordinary, just basic online gaming, file sharing, and internet browsing. Sometimes I do some streaming video, but nothing too high tech. I appreciate how easy this is to use and would recommend it for anyone who wants wireless and share DSL.",
        "I bought the 614+ with the intent of using the Nortel Contivity VPN client to connect to my company's network. Tech support told me it doesn't work with Contivity, but does work with the Extranet client. I was unable to get either the Contivity or the Extranet client to work. If you don't need to use a VPN to me this would not be a bad product, but don't expect much help from Tech Support. I think they get most of there recommendations from Internet news groups.",
        "Consider the following before you buy most 802.11b products: 1. Performance on the wireless LAN is disappointing - hard to get a signal more than 25 feet from the base unit through any wall. 2. You must flash the firmware with their recent v2.0 in order to get reasonable PPoE performance. 3. No \"send keep alive\" option for PPoE DSL users. If you can reconcile with the unpredictability of wireless, this is still a good product at a reasonable price that is easy to configure.",
        "The access point was incredibly easy to set-up, I'm running Windows XP and I was all set up in about 15 minutes (one wired computer, and one wireless laptop). I've found it to be very reliable also. I've never come close to achieving the posted speeds (not a big surprise), but I still get about 7Mbps. My only knock is that in the configuration, you can't shut off SSID broadcasting.",
        "I was glad to see that it wasn't very hard to set this up and start sharing our cable internet access securely. It practically worked great out of the box. I was lucky and the default settings were exactly what I needed to get onto the Internet. The wireless portion was just as easy to setup. I installed my DWL-650+ and instantly was connected to the 614+. Everything went very smooth and I was very pleased when everything was done.",
        "Okay I got this thing set up in about 20 mins with no use of the manual at all. I installed two off the D-Link pci cards and away I went. Everything was fine. Then I read the D-Link had a firmware upgrade. I upgraded and OH MY GOSH!! I got almost 2x the speed I was getting before. I am getting about 7 mbps and the router is downstairs below my room. I Love this thing so far.",
        "I actually didn't have to use the setup wizard to get this working. I had my PCs shut off, plugged everything in to the router, plugged in the router's power, booted everything up, rebooted my cable modem and I was connected to the Internet in about 5 minutes total. It was great. After that I used the setup wizard to setup the wireless portion and that didn't take long either. So far everything has been working great and I've had no problems.",
        "... and have been struggling to get it working consistantly since. I have a Dell laptop with an internal truemobile wireless card. I think there are some compatability issues between the router and the card. I am constantly being disconnected briefly and reconnected. Several of my friends who have also tried this product with Cisco aironet cards have experienced similar problems. Tech support is clueless on how to fix this...",
        "All I had to do was simply plug my cable modem into the WAN port and one of my computers to one of the 4 wired ports and just ran the wizard on the router. The 2 other wireless computers (one desktop with Siemens wireless PCI, and one laptop, with D-Link wireless PC Card) detected the connection and connected with ease. No drops or any problems so far. Have been using the router for about a month now and I am very happy with it.",
        "Pretty funny. I bought the DI-614+ to add wireless to my Mom's house. When I was in the middle of setting it up I got a call and had to leave. My Mom was able to complete the set up without me. I was surprised that she was able to get the wireless portion working also. I think D-Link did a great job on making this router as easy to install as possible. I have to give props to my Mom for completing the installation, as well.",
        "Bought this for a direcway highspeed internet connection. direcway must go to the PC first then you have to enable internet connection sharing (ICS) to share the connection. I ran this product off of the PC and the router never could connect properly to the internet. it wasn't faulty it just didnt work. ... (just disable dhcp & plug into a normal lan port, not the WAN aka internet port) good luck!",
        "I did some research, I went out and purchased this wireless broadband router, I came home and downloaded the new firmware, I typed in my settings, I plugged it in, and thats it. Thats the last time I've touched it. Easy setup and so far from what I can tell it is reliable and easy to configure. It has been working great with my PCI based D-Link wireless network card since the first day I purchased both.",
        "Security on the wireless side are as good as you are going to get for a home based product, and the speeds are good enough for home, about 6Mbps throughput in the best spots and about 2Mbps in the depths of my home. The router itself was easy to setup and has been working great, firewall rules are easy to setup and some are even all ready there for you, you just need to activate them.",
        "This set-up was so easy, all I had to do was plug the router into my computer, run the wizard, and that set-up everything. I configured the router to only accept my two MAC address (wired, wireless) Speeds were easily as fast as my wired connection, and range was pretty good. I only have a two bedroom apartment, but it reached every room with good signal strength. I would highly recommend this product.",
        "I bought a DE-614+ in USA and brought it to Santiago de Chile, where we are living now. It was impossible to configure, as my computer (Dell 8250) couldn't \"talk\" with it through the web browser; I tried a Liksys similar unit (BEFW11F4) without any difficulties. My problem is that I don't get any guarantee service in this country, as I bought it in the States; the local dealeer only responds for the units they sell. Reparing (if possible) or sending it back there is more expensive than buying a new one. Wasted money.",
        "I'm using DI-614+ and DWL-650+. It's very easy to setup, but you need to install driver (without the card in your laptop) first. Otherwise, windows won't see the device. This is a step backward compare to other PC wireless card. Speed is another thing that these products don't work the way they are supposed to work. I can get only up to 11 Mbps instead of 22 Mbps.",
        "This Wireless unit and the Wireless card was a breeze to install. Only pain I suffered was when I was configuring the WEP and couldn't get the 256bit encryption to work. I finally discovered an \"undocumented feature\" in their software which won't allow the configuration for 256bit so I got stuck with 128bit encryption for now. Other than that, I was thoroughly impressed.",
        "I recently purchase the D-Link DI-614+. I had never set up a wireless network before, but found this really a snap to install. I had one problem with the installation, contacted D-Link support and they were very helpfull and solved my problem within minutes. Would recommend this product for ease of installation and operability.",
        "I expected to receive no more than 50% of the signal, because I read one comment that said, that the guy only could receive 0-30% of the signal. But when I intalled the D-link, I received around 90%, thats a lot, my net still really fast. I am using the iBook (Machintosh) and it works perfect. For me, it is the best wireless sytem ever. But I also bought the 800+ the range extander, it did not work well, this i wouldn't buy it.",
        "Easy to set up, works great, price is right. Highly recommend.",
        "Everything about the D-Link AirPlus DI-614+ is perfect, minus one important fact: there is very little information on teaching a home user how to setup the firewall and encryption feature. The manuals are a joke and the D-Link website is useless. Trust me on this. However, every other fact about the router is excellent. I just wish D-Link would provide more information on actual set-up features...",
        "I like this router. It is a wireless access point with good range and security, plus a 4 port switch/firewall to block out all the bad guys. I had this setup in no time at all and had no problems upgrading firmware. This works great with my DWL-650+ and DWL-900AP+ as a repeater. Awesome range throughout my huge home.",
        "This product is \"simply remarkable\". I have been shopping for a wireless solution since quite some time. I even bought a SMC wireless router but faced a lot of problems in setting it up. The D-Link router worked without I having to do much. I was successfully able to secure my wireless and wired network without a hassle using 128 bit WEP and MAC address security.",
        "This router works fine until you use it for a few minutes...then it reverts to 1 or 2 MBPS, and you can't even use that, rendering the connection useless. This is while used with a dlink wireless card. Customer service claims that atmospheric conditions caused such slow speeds at a distance of 5 feet from the router with a clear line of site...they are a joke.",
        "Everyone should have a broadband connection in their home by now. So to share it all wirelessly, wired, or both, get this router. This is a reliable and inexpensive router that will work anywhere for as long as you like. Configuration is simple with the setup wizard, security is more than enough, plus it looks cool on the desk.",
        "I have used truemobile 1150, dlink 520+ and IBM thinkpad internal 802.11b wireless deivce with this router. It was setup and connected with ease. Plus, this router is not expensive.",
        "I read lots of negative, blaming feedbacks before I decided to take it. It turned out, however, to be a surprise: easy to set up in a few minutes, solid stable connection and many fancy functions built in. This machine just works great for me and I would say that I am qualified to operate it.",
        "This router doesn't cost a lot and performs like the best. Range is awesome and I get a strong signal strength from anywhere in my home. I had zero problems with the setup and my friends come over and their laptops work just fine with the built in wireless. Easy as 1-2-3.",
        "Works great. Only thing preventing it from getting 5 stars is the fact that the wireless portion of this router does not pass AppleTalk packets, but the wired part does...",
        "I've had this for quite some time now and the firmware released by D-link only make it better each time I upgrade. The range is great since I can access my wireless internet camera from any room in my home and when I am on my laptop I have zero dead zones in the house.",
        "I found this router a lot easier to set up than the wired router (Linksys) it replaced. And it's real easy to configure. After rebates, this will cost under [$$], so you really cannot beat this deal."
    ]
}