{
    "entity": "Routers",
    "text": [
        "I did not have success with getting this to work. I cannot recommend it. I had to get a more robust router.",
        "Though handy its an Average product as its signal strength reduces if you have walls in between your laptop and router",
        "I got this at a 1 day sale with rebates and customer coupons for a song. I basically unpacked the box, plugged it into my existing wired network, plugged in the slim power adapter into the 110 volt wall outlet, and in about 1 minute, my existing 2 wireless PCs reconfigured their proxy settings (running Win2000ProSp3 and WinXPProSP2) and both were able to use Internet Explorer and Outlook email with very fast downloads. Netgear supplies a slim zippered padded case that fits the router, power adapter, and all the supplied cables. Throw it into your PC case or your shoulder bag and be ready to go online wirelessly wherever a wired Ethernet port is found while traveling.",
        "There are plenty of reviews so I won't rehash what a lot of people have written. 3 brief comments: 1. It does NOT work with DSL. Even the instructions say it will not work if plugged into DSL modem. Not a big problem for the most part but just be aware. 2. It does get hot, so be sure it is not covered by something. 3. Not cheap.",
        "This is good for 1.Travelling and using in Hotel rooms (As they claimed) 2. Sharing a Hotelroom netwrok 3. Light weight with a carry case of it's own 4. Used to secure connections during travels 5. Multi user during travel Not good as 1. A regular DSL router. 2. Can not even use directly on a DSL modem.",
        "I bought this quite a while ago, and finally got the opportunity to use it. (or at least try to use it) Setup was very easy, but I could not get it to work in shared mode. Windows didn't think I was connected to the internet. I searched live.com for this product and found others are having the same issue. Apparently like another review says, there is an issue with DNS passthrough. I was able to get it working, but won't be taking it on another trip with me.",
        "Excellent product guys! I was little sceptical before buying this product as the reviews were not very encouraging. But, I have not experienced any kind of problem with this slim and nice looking router. There was a little hitch while installing it, but, the customer support helped me figure that out quickly. Excellent customer support from Netgear. And the good part is that it works with my cable internet connection at home also.",
        "then it died. I purchased it months earlier, but never used it until four months ago. Yesterday, the lights went off and the router stopped working. I called Netgear's support line, and they ran me through some questions and then informed me that the one-year warranty had expired and the router it is bad and cannot be repaired.",
        "I read all the reviews before I purchased and was a bit wary. I was suprised to find out just how good this product is. I wanted something small for my apartment to hide by my cable modem. The minute I plugged it in it worked. No problems at all. Great product!!",
        "I was looking for a tool to let me create a hot spot when I went to hotels or locations without wireless. The Netgear Wireless Travel Router is easy to setup and use.",
        "I just could not get WEP configured on this. However, WPA configuration took a minute. Then I also need to reboot it once a day. Overall, it is good for the price I paid.",
        "I am pleased with this products performance. I had difficulty setting it up and had to call Netgear for help. Great product but don't feel one can set it up by themselves unless they are an IT person",
        "I have received a broken piece and i opened it on myh return to India. Is there a way this can be replaced? Regards Amit"
    ]
}