{
    "entity": "Routers",
    "text": [
        "I agree with all the preceeding reviews. This router is extremely stable, has a fantastic range, the blue LEDs and black chromed finish are beautiful too. Best router I've ever owned. I'm posting here to add that (once you upgrade to the 1.5 firmware) this router works great with BOTH X-Box Live and Nintendo Wi-Fi with no additional setup. I even enabled WEP and there were no problems connecting to either service, all I had to do was enter the WEP key on the Nintindo DS and it was ready to go. Be you a router configuring expert or a novice, you'll find this router meets and exceeds all your needs.",
        "As a computer professional, I would recommend Dlink products over Netgear or linksys *any* day of the week. This router supports the stronger WiFi encrytption for wireless access points for servers or items that don't support wireless cards. I feel safer with this router between me and the world. Thanks Dlink! Sincerely, Ira Carmel. Edit; I had this router stacked under a Dlink Switch of the same footprint and it overheated and eventually started rebooting every 30 seconds. I replaced it with an Apple Airport Extreme.",
        "This device works flawlessly with my D-Link DWL-G550 wireless PCI Card. I use it mainly for my living room PC which doesn't do a whole lot, but these two devices get the job done! I don't have much technical info for you, but if you are looking for a good and reliable setup, this device along with the DGL-4300 are the best solution IMO. I have had tons of issues with Linksys, especially their client software which is just hideous, which is why I researched and switched to this combination. You can't go wrong with these two!",
        "I was deciding between this and some comparable Linksys products and this was the best \"bang for the buck\" router I could find. I plugged it in and everything just worked. This has been the easiest router I have set up yet. I have had zero down time, with the exception of when configuring some settings that require a reboot. I would recommend this router for anyone who wants gigabit lan speeds and a stable wireless connection. The only thing this device lacks is the new 802.11n specs, and that's no big deal because of the built in MIMO system that gives you the higher speeds with other D-Link devices.",
        "Granted I am writing this review 3 years later... I bought this router to replace a netgear one back in 2007. I have been using this for 3 years now and have had absolutely no problems. I get incredibly fast download and upload speed with Comcast. The wireless signal strength is amazing and never drops! The amount of features and utilities this products has definitely makes this a router worth buying! It is very secure and works great with Playstation 3, Xbox 360, Netflix, several laptops and PCs. It is an all around great router! Highley recommend!",
        "This router lasted for almost three years and performed well during that time. I had a Mac and a Windows laptop hooked up to it, along with a Wii and a blueray player. Set-up was easy and and adding a new computer was simple. The WPA setup was a snap as well. I just wish it would have lasted longer. Update: It did last longer. I performed a factory reset on the router and it is back to life.",
        "My linksys would sometimes cause my 360 to go to moderate on my nat for no reason - so playing call of duty 3 I would never find or get into matches. This router easily has options to easily place the 360 into the proper port forwards and DMZ . The router has some nice setup features that the linksys makes archaic while the 4300 is more understandable and workable. So if you have an xbox 360 and your nat is always moderate or strict and wont stay open then give this router a try - its xbox live certified .",
        "Awesome router. After 5 years use, the router stopped working and didn't light up. I figured it could be the power supply burning out. I bought a new power supply and now it works fine again. I replaced the power supply with",
        "This SOHO router is fast and reliable. There are many advanced settings to do interesting things and the NAT tables have extra space on them. I suggest having an experienced network administrator setup the more advanced functions for you as Tech support will only communicate with you thru email. The Game Fuel feature also supports VIOP nicely.",
        "I had a Linksys router 54G that I bought a couple of years ago. At first it was okay, but recently it started dropping the connection more often than not. After resetting it, updating the firmware, buying the high gain antennas for it, I broke down and I bought the D-Link DGL-4300. It is fast, reliable with a solid signal. Sure it's a little more expensive than other non-N routers, but it's a great device.",
        "I have a PS3, 2 laptops and a desktop which leverages the wireless b & g, 100 MBs & 1 Gigbit wired connections. In short it performs perfectly, can't ask for more, the reason I'm posting this review is that I realized how stable is it, after attempting to upgrade to another DLink router that incorporated Wireless n but turned to be a disaster.",
        "I would not recommend purchasing this product, unless you have very few people using the internet or you are using this as an access point. For me personally, I have multiple people/computers/gaming systems/phones connected, so the router was pretty slow. Also, the router would constantly drop its signal...it is extremely annoying to unplug and plug back in at least once or twice a day...will not recommend this router (or brand) to anyone in the future...go Cisco/Linksys!",
        "I really like this router. It has a lot of features and appears to be a great performer. You can prioritize packet routing from certain IP address, which I used to prioritize the packets from my Vonage adapter. The router interface is the best I've seen. The gigabit switch is great.",
        "I bought this because I host a ton of games in RainbowSix. Out of the box the gamerfuel is nice. HOWEVER, if you're going to host games in Xbox live, you MUST go to the advanced tab, gamefuel link and uncheck the \"Dynamic Fragmentation\" box. This will resolve and \"Disconnected from Xbox Live\" errors received while hosting.",
        "So far I've had this router for a little over a month and it has been great.plugged it in and it worked right away with no need to adjust settings.no problems with xbox live(just make sure you have firmware version 1.6)i would highly recommend this router.",
        "I had an older D-Link wireless router. It worked ok except when I would connect to XBox Live. I would drop connections to other devices in the house. I bought the DGL-4300 in hopes of resolving the issue. I am glad I did. I had a bit of trouble at first but after calling D-Link customer service I got all the answers. They were one of the best tech support departments that I have ever worked with. He talked me through all the settings and told me about a lot of stuff that I would never had figured out on my own, such as setting up the firewall and the DMZ for the XBox Live. I really like this router.",
        "i used this router for a number of years and it worked perfectly for me on PC and MAC. set up was easy and i liked the option to control bandwidth",
        "I used to have a Netgear router that I had to reset all the time when it got bogged down. Also the Netgear would not allow me to play the X-box online. I found this Microsoft approved router... hooked it up... plugged it in and haven't had to reset it since. X-Box works great now. Set up was painless. I'm not real proficient at networking stuff, but I was able to easily set up the wireless portion.",
        "Used it for about 3 years (2006 to mid 2009). I still have it somewhere in a packing box after I moved. Since I have Uverse now, I've not thought of this router until I today. I had 1 PC, 1 xbox360, and a Skype phone connected to mine. Never had any issues with it. I recall back then, I had another router that the xbox did not like. I checked their approved router list, bought this and was gaming without issues. Web surfing, skype calling, all was great. memories...like the corner of my eye..misty water colored memories...la la laaa la laaaaaaa.",
        "I bought this to solve a problem we'd been having getting my desktop and laptops and XBOX 360 to all work at the same time. Replaced an older non-compatible router. Now everything (Three Xboxes, four laptops and my desktop) all work fine at the same time...........",
        "This is the best router I have ever owned. It has a good broadcast range, and it always broadcasts at a full 54mb/s. It is running three wireless computers with no problems, and best of all it never drops signal. I turn it off every night before I go to bed, and I have not had to reboot it yet because of signal loss since I bought it.",
        "Our sons play a bandwidth intensive online game and we've had no problems since installing this router. Plays smoothly, and installation couldn't have been quicker and easier. We considered some much less expensive routers, but based on some reviews, decided to go with this one. Very happy with our decision.",
        "This is the absolute best gaming router! My husband has been playing XBox online and was previously having lots of trouble keeping his connection. We bought this one and wow what a difference! He has not been disconnected once. Definitely worth the money, you will not be disappointed!",
        "Use Vonage for my Phone system and during heavy internet traffic I would lose reception or event the call. The GameFuel is easy to configure (although it's not true Quality of Service (QoS) since you only specify a LAN IP range, a port range, and a priority value so you can't seem to traffic inbound and outbound traffic independently. Besides that this product ROCKS!!!!",
        "...The signal was great. It's connect to a computer on the main floor with an xbox in the basement. Gets excellent signal.",
        "I had a wirless network router (linksys) I had problems with it dropping out. I would have to reset it often. I have windows and apple systems and with this new router I have not had any trouble and it is great. I have even hooked up the Wii to it and it runs great.",
        "Great product and great shipping. A little tricky when connecting to dsl though but you have to remove the companion software after setting up your account or else you will not have a usable connection. They do state this in the instructions and on their website.",
        "I have had this router for a few months now. It works great. Handles alot and I mean alot of connections and does not slow down. I have had to reset it a total of three times since I bought it in August 2006. Those resets were for internet problems... I suspect my internet went down and that messed up the router.",
        "First unit I received was defective so I got a replacement. It's been almost a year now with no problems. It definitely made my online gaming faster. I have Wii, PS3, Blu-Ray Wi-Fi for Netflix and 2 PCs connected to it. Works great. I highly recommend it.",
        "First of all, I own several wireless devices such as laptops, wireless cards in desktops, PSP, PDA and games such as PS2, Xbox and Xbox 360. I have tried several 802.11G routers Linksys, Belkin and Netgear and none of them has provided the level of overall performance for lag free gaming and usage from all my devices at the same time. I work in the IT field and I recommend buying this router for your wireless needs. You cant go wrong!",
        "This router is fast and extrememly reliable. Set-up is super easy, but if you call technical support don't expect to speak with a local representative, your call is routed oversees to India like many other companies today.",
        "It was faster than expected and out preformed what I thought it would. The directions were hard to follow none of them where in english",
        "So Far this router has done every thing that it is suposed to, I can take my lap top any where in my house or on the porch with out any noticable difference between the online speeds hooked directly to the cable.",
        "This is the best gaming router for xbox and xbox 360 live. the program P2P download fast, multimedia go fast whit 4-Port Gigabit Switch.",
        "Good Product, Full of Functionality, Takes a little while to tweak the config. Helps to have a IT background for advanced features.",
        "This thing rocks! Easy to use interface and excellent security features. Don't buy anything less.",
        "This is good item! I like it :). Packing is perfect.",
        "i spent at least 12 hours trying to configure this thing. i finally gave up and purchased a different wireless router that took me two minutes with an instillation disc (belkin n wireless router). I do have a different d-link router at work and it has never given me a bit of trouble, so i think it may be the model rather than the brand.",
        "Now, it is used as a wired router in the house. I gave up on setting the router to work with my laptop after several days of struggle. Unfortunately, I was out on a long vacation when the thing arrived, and so could not return it in time. A waste of money this, atleast for me.",
        "don't really feel like writing a review on this product, but I can say that this router just works and has a bit more of advanced settings than any other routers.",
        "Very nice and stable Router. Gigabit switch a real plus!!",
        "My experience is not as good as the majority of other reviewers. The product was difficult to install and the first rep was unhelpful. Once it became clear that he was not able to help with the problem, he hanged up... The second call was more successful albeit the critical help was provided from the DSL provider. The problem turned out to be that the DSL model already had router functions that had to be disabled. Now the router works well."
    ]
}