{
    "entity": "Routers",
    "text": [
        "I bought this product to replace my old G router along with the Linksys USB N adapter. The N connection to my desktop has been nothing but trouble. Constant dropped signal, adapter and/or router locked up, repeated resets of the connection...you get the idea. The product looks well-made and Cisco is a good, known brand. As I type this review I'm using a network cable to the router in order to use my desktop. My opinion is that the Draft-N technology is too new and needs to be more thoroughly tested and perfected before use by the public.",
        "I installed this router last month, it was really easy, no flaws, I have a desktop connected with 802.11n, at 130 to 260 Mbps, and a notebook connected with 802.11g at 54 Mbps, inside my apartment the signal quality varies from excellent to good and I never loose the IP settings, the router box was never turned off or reset, it looks perfect to me. I am not giving a 5 stars just because to add any computer to this network I have to run a linksys program at the computer, otherwise it will not connect, it is good for security but is annoying.",
        "The setup utility that came with this router was not able to find the router at first. On the third attempt it found the router but was unable to communicate successfully. There was no documentation with the router re: workarounds in case the \"simple\" setup program didnt work. Having owned an earlier Linksys, I tried to use the same OEM IP address and was finally able to configure it from my web browser.",
        "I read all the reviews that gave warnings about set-up for this product. It went very smoothly for me. The installing program was very easy to follow even for people less tech experienced than I. Works great in my two level Cape house. Range works from basement to all rooms. I will try outside when the snow goes away in May here in Massachusetts.",
        "I can not believe amazon allows thus kind of junk. The unit came with wrong power cord and then would not start up.",
        "Worked Very Well for a Time, failure rate seems a little high to me.",
        "I had the G router and wanted to upgrade to a faster & be able to draw from a greater distance. This router works great and it copies all the settings from the other router so no problem changing over to the new one. Also was the lowest price I could find.",
        "As with many router they can be hit or miss. I dealt with routers I loved and routers I've hated. For me personally this router worked fine. The only problem I had was connecting the WRE54G (the range extender). I called linksys and the said since it was N and the extender was G that it was incompatible. After hours of trying to figure it out. They work very well together.",
        "I absolutely love this router. Coupled with my wireless n notebook adapter (for my LapTop) and my wireless n PCI adapter (for my wife's desktop which is on the other side of the house), this is a tremendous product. It is just as fast as any wired pc.",
        "Not as powerful as I expected, will not cover whole house, (Brick house) at 2,700 sq.feet, my new amped wireless can.",
        "product initially had some drops regarding wireless connection, but on playing around with the frequency settings, reception eventually improved. I later flashed the firmware with DD-WRT and this item is unbelievably rocking. Now it has more functions to play around with and pretty much performing above average.",
        "The first unit I received from Amazon, apparentely was not working right. I tried every single trick I could think of and it never started sending info. I emailed Amazon and they sent a replacement really really quick. With that second unit is working fenomenal, amazing range and know I got twice the speed than from my olg g router!.",
        "Had to get some help with the installation but the shipper was very apologetic about that and customer service helped get it set up; Works well and fast, we had been using a B unit before this. Seems to be a good product even though Im not very computer savy.",
        "No issues setting up the Linksys WRT3000N. I plugged it in, configured the router using a wired connection and default IP address then switched to wireless and everything worked just fine. I did NOT use the software that comes with the router just logged into the router using IE7 and confiugured it. Works great.",
        "This router worked right out of the box. It was very easy to setup and use even when using WPA encription. Lacks a little in range but everything <300 feet has a good connection.",
        "This router works great especially with direct connections. I noticed a definite speed gain after retiring my old wired router. The accompaning PCI card that goes with this router has serious problems. See my other reviews.",
        "Router working very good, only problem with reset button it's located very inconvenient , in the middle of the router, when you try to move you can accidentally press it and your router/security reset, or small kid can press it very easy which in my case happen very often :). Plus it would be much batter if Linksys soft working much faster.",
        "I've been using linksys for a while and I must say they are very dependable. I've had many products that have lasted years and still work today. The WRT300N works like a charm with all my wireless devices (PS3, Laptop, additional desktop and palm pilot among others). I recommend this product as it delivers at ease. (good customer service as well) Thank you",
        "The product was received promptly. Installation was simple. It works as advertised, no problems. The price beat the lowest local competition.",
        "This item, while producing much greater speed to other wireless N devices, required periodic power recycling (reboot) and finally stopped working altogether. Cisco systems released this technology too soon. I retrofitted my network with my old WRT54G (wireless G) and have never had a problem since. Wireless G = Good. Wireless N = Bad!!!!",
        "This was a referb, and it works great. The led lights on it are very dim and difficult to see. That is my only complaint.",
        "You can never go wrong with a CISCO router. Unfortunately, this one went obsolete rather quickly. I wonder where it is in my junk closet right now.",
        "This is a great router. Just don't try to use the installation disk that comes with it. Go online to Linksys to do your install.",
        "The Linksys WRT300N Wireless-N Broadband Router was very simple to install and works great for a home network.",
        "easy to setup, easy to use, allows freedom to use laptop in any room of house while home computer is stationary",
        "very poor product, doesn't reach around the corner, moved the antenna & didn't help, also keeps disconnecting when antenna & base are 2ft appart! have to reboot more than daily, user interface is juvenile, surprised at what garbage it is, would like to return or throw away, 50ft of ethernet cable wins anyday",
        "Even with the 0.92.6 firmware, the wireless speed is a small fraction of what I got with my cheap trendnet mimo router (using an IBM T41p with internal wireless-g). Also, the access controls page is limited to \"deny xxx\" rather than \"allow only xxx\". Finally, they have the worst looking, most confusing web interface I've ever seen (and I've seen a LOT of routers). Do yourself a favor and skip this!",
        "I was hoping \"N\" would be better. Not in this product. Constant drop out with the need to reset. Going back to my old G router was better. I am returning this.",
        "This purchase was the worst purchase I have ever made on the internet and would not deal with this particular company ( Compra ) again. Product listed as new, arrived as refurbished. Took weeks to get an answer and when told to ship back, I had to pay shipping. Read Amazons return policy closely.",
        "Bought one to replace the old 802.11-G. Works great! We had no trouble with plugging it into our existing network, setting up security, and connecting to three different laptops without ever cracking a book, calling tech support, or unwrapping the CD. I can now reliably connect to the router which is on one end of a fair sized house and up the hill from my RV, at least 200' away, when using my Gateway laptop with it's built in wireless-G. There was in initial problem with my wife's old cordless phone knocking it off and requiring a reset but that was easily solved by upgrading to the phone system she has been panting over for a while.",
        "I bought this router on my way home from work today, got it home, took it out of the box, followed the amazingly precise directions, and within 40 minutes, I had my old desktop and my new laptop online and working great. I was really impressed with the speed. I live in an apartment, so range is not an issue with me. All these negative reviews about setting up routers really had me frightened, but this was all really straightforward and easy to do for me and my setup. NOTE-- Mine was version 1.1. Clearly there is a huge difference between versions 1.0 and 1.1.",
        "Once we got the router installed, it did what it was supposed to do. However, it took 2 hours online with linksys to get the firmware settings correct. Since this was our 3rd linksys router, I thought I could do the settings myself, but the settings are completely different. Once a linksys supervisor got on the call, we got the setting corrected. We have 4 wireless laptops on 3 floors in addition to the main desktop and we haven't had to restart the internet yet. I highly recommend the Wireless N routers, but if I had it to do again, I would have paid extra to get the one with the USB connectors.",
        "I purchased this router to fix bugs in Neatgear's Rangemax router which does not do Voice over IP without a lot of hassle. This router worked great right out of the box for wired, wireless, and Voice over IP. I even changed from mixed mode to G with no problems. I am very familiar with the settings on routers as I have been dealing with them for many years. The interface is not the best out there but once you get familiar with it is not that bad. Comparing it the Rangemax it is faster wired and wireless, and it sees to be a little better in range using G mode.",
        "I had NO problems of any type setting up this router and linking my home Mac (PowerPC and Intel macs) wireless network to my internet provider. Even though Macs are not mentioned in the System Requirements on the outside of the box (hey, marketing - take a lesson!), it worked like a charm. Perhaps I am so pleased because I spent days trying to get my new Mac Airport Extreme Base Station to work and finally just gave up in frustration, went out and bought this one at a local Sam's Club, and never looked back. This router is a great non-Mac-but-is-really-a-Mac product. Five stars plus!",
        "I use both Mac and PC's with wireless printers in my network and the product works very well with all of it, BUT only after going into the advanced setup mode. PC setup was simple and Mac setup was unexpectedly more time consuming. Good security option and excellent speed. Unbelievably poor install software especially for Cisco. Product works best after adjusting default settings by accessing the advanced features using [...] Much better product than Netgear N router.",
        "Two weeks ago, bought this product off the shelf at my local office supply store. Then I came home and looked it up on Amazon. I was struck with two things: First, I overpaid, secondly, I was shocked at the polarized reviews. Well, long story short, I carefully followed the instructions that accompanied the product and it installed fine and continues to operate in wireless mode flawlessly. Keep in mind, the equipment I was attaching it to was a brand new Dell system operating on the latest version of XP (I opted not to be a beta tester of Vista). Perhaps, if I had older equipment or operating system, I would have had problems. Good luck.",
        "This was the easiest part of setting up my computer and network! Shortly after taking it out of the box and installing the software CD, I was on line and connected at 130mbps wireless - Whatever that means! A friend told me that's really good! Set up was super easy and I did it all myself! I'm not a computer saavy person and I'm glad that this was the easiest part of setting up my network. I have 2 desktops, 3 laptops, 2 cell phones, and my PS3 all running from this awesome device! I've been using it now for 4 years and it has never failed me.",
        "I have never had so many problems with a wireless router. I'm returning it and getting a different brand. I was getting about 10x worse than my previous 802.11g router with my desktop computer, and my MacBook Pro couldn't get a reliable connection even when sitting 5 feet away. This thing is supposedly great if you can configure it correctly. Sorry, Linksys, but you used to make routers that you don't HAVE to configure. I have better things to do with my time, so I'm going to buy one that works out of the box.",
        "Owned the WRT300N for almost 3 years now and never had a problem. Range reaches where the G router didn't and communication is much faster. The PS3 does not lag and I have never experienced loosing the connection because of the router. In the 3 years, I had to call Customer Service 3 times due to my teenage son messing with the settings/configuration after seeing videos on youtube.com, and Linksys Customer service always resolved the issue, free of charge.",
        "I got my first wireless router and switch, and this was it. I needed it to link up my Notebook. I took the Router out of the box looked very briefly at the instructions, and followed them. They were not hard at all. The configuration of the router is automatic, so complaints about the UI being difficult are a little weird. I had the thing up and going at 200 Mbps on my notebook in about 45 minutes, as well as my Lanier 5635 MFP and three other computers that I simply left alone, wired into another switch, which I hooked into the wireless router. The whole rig worked fine the first time out.",
        "I prefer Linksys products over the competion and had my WRT54G finally go out on me. I picked up this as a replacement and it worked flawlessly on initial install. No issues with anything. 1 day and a half later, the wireless portion of the router failed completly. No restarting, erasing of settings or flashing of the firmware would revive it. V1.1 of the router if you are interested. Big dissapointment.",
        "The router is powerful. It even broadcasts internet outside of our house. The only thing I do not like about it is for some reason the wireless internet occasionally doesn't work when I turn on my computer. However once you have internet access usually you don't lose your connection. Although the devices using a wire that are connected to the router work great. I think if you want a good Linksys router you should get this.",
        "I've had this router since 2006 and have never had an issue with it. We have at least a dozen devices that utilize it in our home, including a Wii and two Roku boxes as well as laptops, tablets and smart phones. Not even close to replacing it.",
        "Bought this router over a year ago. Unfortunately, the wireless connection hardly works without manually intervening. Laptop cannot find the network most of the time and have to cycle the power on the router to get it to work. Have had this problem with a couple of laptops and so it is definitely the router as the laptops worked elsewhere. The router has the latest firmware which is dated Feb 2007 and so Linksys does not even appear to be working the issue... guess they are too busy making other faulty routers to fix the ones they already sold.",
        "I purchased the WRT300N about a month ago in spite of the bad reviews. It replaced my BEFW11S4 that quit working after four years of reliable use. WOW, what an improvement in both speed and signal strength! Installation was simple and straightforward. In just a few minutes we were up and running without a hitch. The three notebooks with WiFi technology picked up the signal and all that was needed was to select the secured network, enter the WEP and that was it. I'm very pleased with this product.",
        "I have given up on this company and its products. When they work they have been great for me but when they do not (which is often the case). Their documentation is terrible and their support engineers are nothing short of clueless. If you know anything about the product then you know a lot more than the linksys engineer on the other end of the phone. They work from checklists and are unable to handle any situation not covered by their prepared script. This problem is so bad and so pervasive that I can't imagine this company actually being successful going forward. Bottom line on this product or any other linksys product is DON'T BUY IT.",
        "I purchased this router to replace my Linksys Wireless G router, in hopes to truly extend my range, by up to 4 times. My PS3 and laptop were commonly being used at the extent of my wireless range, where sometimes I'd get a 30% signal and other times it'd drop below that. What I found was that the setup wasn't difficult at all. I was up and running pretty quickly. However, the one issue I still have with this router is that the range didn't increase at all compared to my wireless G. Perhaps the extended range only applies to Wireless N adaptars. Regardless, I'm going to try a repeater next and hope that resolves my issue.",
        "The only thing I have a problem with this, is that its not Gigabit. You have a fast wireless connection, but bottle necks when it hits the 100Mbps lan connections. A few months later they came out with a Gigabit version. If you transfer large files, or any thing with video I recommend that you go with the gigabit version.",
        "I bought a Wireless N to replace my Linksys Wireless B hoping this would boost the range of my office wireless network. But it kept having the problem of signal too weak to reach a room about 20 feet away from the router. I spent about 4 hours talking to two different tech support persons without any improvement. I finally brought a Linksys wireless G router from home to the office and the signal immediately improved about 30% over the Wirless N. Bottom line: Do not buy the wireless N yet until they fix the bugs.",
        "This is the worst router I have owned ever and I have owned several over the past few years. My linksys G router was much more reliable and actually maintained a much stronger wireless signal than this N model. The worst part is that this router will continually drop the N wireless adapters but the G adapters stay connected. I have purchased a replacement (not linksys) already as this one is simply worthless. This is my first review of any item I have purchased on Amazon and I hate that is has to be negative but this is one useless and frustrating product. This from an engineer with 30 years experience.",
        "I'm not sure why everyone had so many problems with it but it worked great for me out of the box. I did update the firmware to 0.93.3 before I tried the wireless. That's probably why I didn't experience the issues everyone is talking about here. The coverage was pretty good. With my previous wifi router (WRT54G with high gain antenna's) I was only able to get weak signal strength to my basement and now I get a \"good\" to \"excellent\" signal strength. The setup wizard on the CD is straight forward and easy to follow. It's definitely an improvement for my network.",
        "I found it easy to set up and it works very well. The one caveat is I have the cable modem wired directly into the router and then everyone connects wirelessly from there. (Does it really make sense to set it up any other way?)",
        "some of the earlier reviews mentioned issues with installation of this product. I just wanted to say I had a very easy time getting it installed and working properly just by following the quick set up guide. I was up and running within 15 minutes and havent had any performance issues. when I stream audio or video it is very smooth compared to the wireless B router I replaced. I highly recommend this item.",
        "This router is fast. Because I have much experience with IP configurations I was able to get this dog running on both wired & wireless systems. However, if your have a SlingBox TV system in order to view your TV remotely (i.e. via your PDA or Phone) FORGET IT! This POS is incompatible with SlingBox equipment.",
        "I purchased this to replace my Linksys wired router. I had a wireless cable modem that had NO range whatsoever. I hooked this bad boy up and OMG, the range is phenomemal! I get outstanding signal all through my house, with no dropped signals either. The only issue I had was during setup, I had to use the programs WEP password for my wireless components. Other than that. Above awesome product!!",
        "WARNING: DO NOT BUY THIS PRODUCT: CONSTANT WIRELESS DISCONNECTS, THESE ARE JUNK - LOOKS COOL BUT THAT'S IT.. I have had this for a cpl years and nothing but trouble, save your self a headache, don't buy this!!!!!!!!!",
        "We were impressed with Linksys's older products. I signed up for Vonage and ordered the Linksys Wireless Router, we (my associate and I, experienced computer folk) could not get this thing to work. We sent it back and got another. We had to change settings and jump thru hoop after hoop... now we can't even use the hard wire hook up.. and only use this $100 option for the VOIP.. I finally got thru to an american Vonage support fellow and said trying to return the faulty Linksys product and get another.. would be a horror show.. So as I read here and past experience LINKSYS is off my list..",
        "I've dealt with a lot of routers, and when I rec'd this one for Christmas, I was actually excited. I unpacked the contents, and immediately noticed the lack of documentation. I followed the limited information and four hours later, still had no wireless connection. The wired router works fine, but wireless capability is not happening. This product makes an interesting conversation piece, but other than its use as a paperweight, it serves no purpose. This product should come with a \"no gift\" clause. I wouldn't wish this much trouble upon anyone.",
        "This router was advertised as having 4x the range of the venerable WRT54GS router, and as I was having coverage issues after finishing the basement, I decided to give it a try. In the same location as the WRT54GS, I was getting much lower signal strength on the first floor and of course, nothing in the basement. In the end I installed this router upstairs and the old one in the basement on the same SSID, but if you are buying this product to get expanded range on an 802.11g network, don't bother.",
        "I used this product for more than a month now.. I was already using Linksys WRT54G. but i wanted a more farther range n thought of opting for this N router.. but it didnt solve my problem much... the range part is not so great as hyped by the company... Setting it up is a hassle.. n if u lose ur installation disk, its all d more bad.. however after doing some research myself, i feel that manually setting up this router is much better than goin thru linksys cd-rom... If range is not an issue then i would suggest wrt54g instead of this wrt300n..",
        "With XBOX Live, it will change the NAT to moderate. Its very easy to use and with the cd its very easy to setup but for gaming, this isnt good.",
        "Other's have given this router a early bad rep i'll agree its not the easyest to set up wirelessly out of the box but it does improve wireless range, this router sit's on the 2nd floor in the corner of my house and reach's well into my basement to the xbox 360 and wireless bridge with a fairly descent signal you just need a little knowledge or some help for linksys to set it up but after that it seems to really work well.",
        "Despite the many unfavorable reviews (many from IT pros), I bought this router. I have a new Dell laptop with built in n wireless. Took it out of the box, plugged it in and it works great with my desktop and on the internet. Works all over the house and shows speeds of 200+, often the max of 270.",
        "Easy installation with the new firmware but not big differnce as the they advertise.Pretty faster than ordinary G ,but the range is almost the same.As for Linksys technicians,they are doing their best, but limited knowledge on home use.Lets wait for a while maybe Linksys comes up with new firmware that will fix udp ports for online games.I don't think they know themselves how do it.I suggest be patient and wait.",
        "I have had Linksys before, reason why decided to upgrade to this N router, so far I've used it only on G because I have not upgraded the rest of my computers to N yet, so far so good.",
        "I've been a user of Linksys products for many years and when this router became available I purchased it. However, I was not able to setup the router with my existing network. It was cumbersome to setup, was not consistent with connectivity. I ended up returning the item and staying with my G router which is working just fine.",
        "I have setup many of these for friends and client w/o issue, worked great and they have advance features, for those of us that know what we are doing.",
        "I have it set up for my desk top, and two note books, no problem other than maybe once a month it will not let me log onto aol broadband. I have to unplug it for a few minutes, and then it works fine.",
        "I really haven't had much problem with it. Took me a while to connect wireless secure mode, but has been working just fine. (Would like to downgrade this rating to a two-star. Router cuts out every time the wireless phone rings, I now think this router is JUNK!)",
        "We purchased this in September, and by November it no longer worked. We tried unsuccessfully to contact customer service by phone and finally was able to reach tech support over the internet. Unfortunately, he was unable to make this work...Something about us having the wrong software (which doesn't make sense-we used what came with the unit). We were utterly frustrated...It was a waste of money!",
        "I bought the most expensive adsl wireless router in the shop in Spain. (I live in Lanzarote) After spending 3 hours trying to do the simple slip the disc in and set up i gave up. It cost me a further 20 quid (30 euros ) to pay a Spanish techy to phone telefonica for the exact sttings needed for this model to work. Simple set up my arse. It works now but HASSLE!!! BE WARNED IF YOU ARE NOT AN IT PRO.",
        "bought a couple weeks ago. setup was easy, follow instructions. running 2 new HP laptops (802.11n), my office Dell laptop (802.11g), my wifes iPhone and 2 PSP's (WiFi). no issues. all is really fast. will be adding my new 2.8GHz Intel Intel Core 2 Extreme / 4GB DDR2 SDRAM iMac when it arrives on the 2nd.",
        "I purchased this router to connect to my laptop and xbox 360. I was having a lot of trouble staying connected to xbox live. I contacted linksys tech support and they walked me through changing a bunch of settings within the router and it now works fine. For all of you xbox live users, don't give up! Just contact tech support.",
        "Make sure if you are on a server that you religiously copy your old router settings and then really consider if you need this router or not. I thought I could just use the settings from my old router and how wrong I was. By ready to re-configure your whole ip scheme and deal with a whole new set of security settings for wireless.",
        "Have had Linksys routers for my business for the last 6 years. Have had both good and bad ones. This Router is amazing. The firmware works well and is easy to configure. Would buy this product again and again.",
        "I got this router on the assumption that Linksys had a reputation from their earlier wireless B & G routers. What a mistake! This router does not do N under any circumstances. Even Linksys recommends that it should only be set to B & G and even that is also problematic. That should tell you something when the company itself admits its that N does not work on it. I smell class-action suit here. I also tried the WRT150N and its marginally better with 15 meg of memory versus the WRT300N 32 megs of memory. Both belong in its proper place, in the garbage!",
        "Out of the box, this router can barely run its own management software. Fortunately there's a version of the open source DD-WRT router software that works great. Once I switched to DD-WRT the router has been solid ever since. The range is still less than my older wireless router for which this was a replacement. (With DD-WRT, I'd give 3.5 stars.)",
        "For some reason, instead of reading the complete reviews I just trusted the Linksys brand and went ahead with the purchase. Well, I'm regretting that now because I'm stuck with a wireless router that doesn't have a range of 10 meters inside my house. I even tried installing DD-WRT and increasing the Tx power and nothing worked. Linksys normally makes good products but this one just didn't live up to the brand name.",
        "I've tried this product and I don't regret it...So far it's been working according what I expect it, I used both Mac and PC computers and It works ok. Installation was a little disturbing because the cd only works on PC but I discovered that if you change the third or last number on the default Gateway number all suddenly works ok! I also discovered that Linksys phone assistance was of great help! Thanks guys!",
        "Please, stay away from this product! Drops connection even at 3 feet. Stops routing for absolutely no reason, and doesn't work even if you reset it. I had to unplug and plug it like 5 times before it worked. Run run run!",
        "I have seen complaints about signal strength, I don't have those issues because the router itself constantly locks up. Even with the newest firmware available. Stay away from this until there is a standard N protocol available.",
        "Even with firmware v1.03.3 and after changed the configuration many times, my WRT300N performs worse than my old wrt54g. It performs worse on coverage and velocity.",
        "Easy to install. Got it up running with only one phone call from the ADSL provider. Having not used another wireless, I have nothing to compare it to. It seems to work great all over the house. No problems so far.",
        "Does what it suppose to do - and does it well. Great user-friendly software that supports the product. and as I always say : If you buy it cheap now... expect to pay a lot more later....",
        "The device works well, as supposed to. Do not use WPA/PK2 unless you have other linksys wireless cards connecting to this router. Wireless devices from other manufacturers are not compatible with this (PK2). Instead use WPA/PK which works fine, or WEP. I must say I am happy with it.",
        "Router works good. Range not quite as good as they say. Don't like the linksys software though and website had some wrong drivers. ok now",
        "I have owned this router for about 15 months. Build quality is very poor. Obviously all the revisions demonstrate that they STILL don't have it right. On top of it all, the WRT300N just seems to be slower and more reliable the longer I own it. Time to move on for me.",
        "it help me too much ..and thanks to amazon for speed and response and i hope for you to be the best",
        "I upgraded the firmware to Sveasoft bit I still do not get the distance I get from G routers. But this Router never locks up and the wireless is always there.",
        "Second time I bought this product - for different location. One location has cable modem, the other location has DSL connection. No issues.",
        "support, support, support the main three key words with any router. Linksys does an excellent job with product & support.",
        "The product is giving me a lot of problems and unfortunately it wasn't worth the price. I had to purchase a new router so I paided double the price.",
        "I don't believe I could be happier with any other product. It is fast and dependable. What more can I say? Jim",
        "Seems okay. But you must have an N type card in your laptop for it to work at the fast speed.",
        "THE MORONS BEFORE ME MUST NOT KNOW HOW TO SET UP A ROUTER OR HAVE SOME OTHER PROBLEMS, THIS IS BY FAR THE BEST ROUTER ON THE MARKET!! BELIEVE ME I HAVE TRIED THEM ALL AT GREAT EXPENSE, NETGEAR, BELKIN ALL STINK COMPARED TO THIS ROUTER, PLUS I BOUGHT THE LINKSYS BOOSTER AND MY INTERNET COVERS A WHOLE BLOCK OF UNINTERUPPED INTERNET SERVICE!!"
    ]
}