{
    "entity": "Routers",
    "text": [
        "What a great concept! Too bad Linksys really dropped the ball of supporting the device shortly after it was launched. I used it for several years. AND it would still work nicely if the manufacturer would update the firmware to work with modern operating systems. Lack of commitment to the product really left a bad taste in my mouth for wanting to buy any other devices from this manufacturer.",
        "This product should be revised for linksys people. The wizard on CD doesn't work at all.... I tried thousands times to install the bridge. According to the wizard the installation was always successful however the bridge never worked ....following manual instructions founded in the linksys forum posted for another user didn't work either...my comp is latest DELL generation. Technical support after 500 hundred calls concluded that the issue was related with windows vista.....At the end the device didn't work and what is clear is that they are offering a product with difficulty to be installed and no technical support.",
        "Let me first say that this unit is great when it's up and running. My router and this device are two rooms apart and it connects skip-free. However, Vista support is terrible. I had to spend 3 chat sessions with Linksys to get it running. Make sure you download the latest software from Linksys and make the setup file (as well as the program it installs) run in Windows XP compatibility mode. If you don't know what I'm talking about and you intend to use this with Vista, do not buy this!",
        "Purchased this unit for use of playing music upstairs away from the PC. Once installed it has been working fine but the installation process took some doing. I'm a PC tech by trade so I was able to push through the 2 bad installations before FINALLY getting it to work properly. If your not real PC saavy you may want to get some help on the installation and config of the software. I also found the use of any kind of wireless security (WEP/WPA) to cause spotty connectivity. Once on an open network (no security) though it's been fine. Go figure. Cool tool in all, just not as reliable as it could be for everyday users.",
        "Thanks to the other reviewers here, I had this up and running in less than 10 minutes. My router, PC, and stereo are all in the same room. However my stereo has speakers in other rooms. So I will be using this to pipe music from my PC (MP3, internet radio, etc.) throughout the house. So far, after listening to it for 5 minutes, it does exactly what I want it do. I would prefer a deeper sound but I haven't played with the settings yet, nor have I tested different music sources.",
        "The Linksys WMB54G is the worst wireless device I have ever encountered, and I have set up many, many routers, Rokus, and other hardware. It just plain does not work -- the installation software is buggy and won't even uninstall properly when you finally give up on trying to get it to work. All the negative things said in all the other reviews are absolutely true. I suspect the few good reviews were written by Linksys employees, because this product is a total lemon.",
        "Is it possible that they(Linksys/Cisco) have worked out the bugs? Within 10 minutes of opening the box and starting up the install CD(I followed the instructions listed on the quick install guide, connecting the WMB54G directly to the computer via the supplied ethernet cable), the unit found my wireless SSID and asked for the 128-bit WEP. I have tested it out with Pandora, my Locationfree player, and MP3s stored on a NAS. The only problem I ran into was the fact that the jack for the digital coax cable is recessed far too deep into the unit, therefore a \"premium\" digital coax cable will not fit(I think a previous reviewer mentioned this). I am running it in wireless mode.",
        "The hardware works great, and performs exactly as advertised (broadcasts your music over your wireless network, and allows it to be played through your home stereo). My only issue with the product is the music link software that runs on your PC to \"hook\" the audio stream and send it over the wireless network. The software seems to be fairly poorly designed (but works well), and it gives you a very annoying ok/cancel dialog every time you switch from the wireless bridge back to your PC speakers. If linksys sends out a better software to go along with the hardware this would be a 5-star product.",
        "Nowhere does the product information mention that the last operating system this thing was rated for was Windows XP. The firmware and software all date from 2005. Really? There are many dedicated people out there that seem to be able to make it work but antiques like this ought to be properly labeled.",
        "A very nice small gadget that cuts down on running wires to the larger stereo. did'nt run into to many problems like the rest of the reviews say, but I did run it threw another linksys router so they may be more compatable then some other brands. The only complaint is that they have yet to find a way to run threw a vista system like my laptop is, but desktop running xp works ok.",
        "Unable to install the items. Hours of telephone calls with Linksys Technical Support without resolution. Linksys says that AMAZON sold an item that is not longer supported!!!!!",
        "i ordered the music bridge and was excited about the idea of wirelessly sending music to my receiver and sound system. However, I didn't learn until spending an extensive amount of time on a few forums that it isn't compatable with vista. Great! I did get it to work with an old laptop of mine but the sound quality was poor and the music would cut out every few seconds. I won't use it again. I would try a different product.",
        "Concept is great. Would be better if there were an easy way to pipe video through the bridge as well. Also, some ways of adding the bridge to your existing network (CAT5 wired directly to router, rather than wirelessly connected to existing wireless router) are easier than others. The buffer size can also sometimes cause problems. Even when adjusting buffer size for different media there can still be strange breaks in play.... particularly after extended use. Also: connecting and disconnecting and muting and un-muting can be problematic... both the computer and the bridge can get confused and sometimes it's easier to restart either the program or bridge than fight with it. I still love it though.",
        "Dont even bother purchasing this. Documentation of the device setup and yahoo music engine is worse than none-existant. Lynksys tech support has always been excellent for all other products except this one. After nearly a month still can't get it to work even marginaly.",
        "The set up will have you chewing nails, it is nearly impossible, but I have absolutely no network experience and I am no tech-y by a long shot. I did manage to do it after 2 days of trying. Now, it's great. I am streaming holiday music from my laptop to a room on the other side of my house. Now that I have achieved the setup, I plan to buy another.",
        "I have had the product for about two weeks and am still working to get the wireless operational. I spent over an hour on the phone with LinkSys tech support with the result being that my Netgear router was not communicating and I had to work it from that end. Secondly, the device (when wired) has worked great...except that it sends ALL sound output to thru the bridge...so you are in your den listening to music from your PC and an email comes in... BING! Would really like it if you could select channels for output and send just the desired content. The music output component is good. Just gotta figure out the wireless component.",
        "Would always disconnect itself from the wireless access point. Then I'd spend an hour trying to get it connected again. Was good when it worked, just not very reliable.",
        "The product does what it says it does. However, I didn't know I would lose audio from my PC when I activated the Music Bridge. Another annoyance was the device would only work if the application (iTunes) was not already started. If the connection was activated after the application was up (iTunes) then you would not get audio from the Music Bridge. I bought it for a significant discount off the listed price, so all in all, it wasn't a bad purchase.",
        "This is really a neat item. I cannot understand how the company Linksys has not perfected the software and installation for it, yet keep selling them lol I think they need a better help desk, there seem to be many things that can cause a problem including the anti virus, because you are sending the music through your wireless router, I guess mine is having a problem with that! My Amazon Purchase went well and the company I got it from had it to me in few days faster than expected! This product worked then did not work then worked then did not work....",
        "Not exactly an expert in PC's, but no slouch. Bought this around Christmas time to play music over our surround system. Also purchased a new HP touchscreen. Problem? Yep - the Vista version on the PC is 64 bit and this bridge won't work with it. There are various work arounds on the forums, but nothing that Linksys supports. No due date for firmware upgrade either, so I will look for something else. Very disappointing!",
        "I needed to return this item because it was not compatible with my son's apple computer, however, deal barn was very quick to respond and give me a complete refund even though my son opened the box. They normally have a restocking fee, however, when I explained about the problem, they were very fair. I would buy from them again.",
        "I ordered this back in December from Amazon and it just arrived two weeks ago. Setup was simple enough - everything worked right away except no music out of it. Linksys tech support was worthless. They said to return it. Amazon's return process is awesome! Good thing. Because the second one, which exhibited the same problems is going back this afternoon for a refund. Back to the Roku for now, even though it only works with iTunes. At least it works.",
        "Be warned that expertise in networking is not enough to make this work. The configuration wizard does not fill in the configuration the way it says it does. Therefore, even if you know what you are doing, be prepared to play with the settings for a few hours....",
        "Spent better than 4 hours with Linksys. Nobody ever suggested downloading the newest software for the unit?!! When I did that we were up and running within 1/2 hour. I thought great. Set it up for a party were having that weekend. 2 hours into the party the unit cuts out. Haven't had the time to go back and mess with it. If it worked as advertised it would be great.",
        "WMB54G Wireless-G Music Bridge is an effective and low cost solution to deliver quality sound from your computer to an acoustic system over the air or wire. However due to a complexity of the software protection (e.g. firewalls, gateways, etc.) placed on your computer making the bridge work may become a pain in the neck. Linksys does not aknowledge such a complexity nor offers a quick fix or a solution on how to fight this problem. Otherwise it is lovely device if you know how to make it working.",
        "After searching the web and being on hold with Linksys for 50 minutes, I was told by technical support to trymy brand new WMB54G on a nother computer. Yikes. The setup hangs at a missing cmaudiow.dll file. This as of Oct 2008.",
        "After searching the web and being on hold with Linksys for 50 minutes, I was told by technical support that my brand new WMB54G will NOT WORK with VISTA. Ouch. Yikes. The setup hangs at a missing cmaudiow.dll file. This as of Feburary 2008. Now the hassle of returning and finding something else . . .",
        "This product is the hardest thing to install I have ever purchased. After about 10 hours of work and numerous calls to tech support I was able to get it working by following the instructions on the web site from another user.",
        "The performance of this unit is outstanding. The setup was reasonable considering my network is complex, and interfacing it to my Sony home theater system was a breeze. I can now stream my audio files directly from my media server easily. This works so well that I may purchase additional units for other sound systems in my home. A great product for the price!",
        "Well after much trepidation (because of the negative reviews), I purchased the wireless bridge and have to say that I didn't have any problems in connecting to my wireless home network. I used the tutorial that's in the linksys forums and followed the directions to the letter. I am using Windows XP, connecting to a share drive on my home network for the music, connected the bridge to an Onkyo receiver (via CD input) and playing music using Windows Media Player. Surprisingly, the quality of the music is very good. So for $24.99 plus $5 shipping that I paid, I gotta say that it's definitely worth it.",
        "The WMB54G Music Bridge works well for me. I'm currently using it with a wired ethernet connection, because there is a lot of wireless interference in my area. Setup was simple, and sound quality is excellent. Depending on your music player (I have J River Media Center), you may be able to play music thru the WMB54G, and other sounds thru the computer speakers. To get wireless working, I had to download a new driver/utility (version 1.21) from [...] After that, the wireless connection works as well as the wired, and supports WPA-PSK security.",
        "I bought this for my windows Vista computer, (After a software download and confusing and detailed setup procedures it worked great. However, when I upgraded to Windows 7 there was no compatibility package upgrade for it to work. I have since upgraded to a Logitech Bluetooth device.",
        "product burned out in weeks...very hard to configure..intermittent connection and isn't supported anymore by linksys anymore. Hard to find help.",
        "After some difficulty, I was able to set up the bridge with the help of Linksys technical support. When the bridge works it is fine. However, I periodically have to reload the utility in order to get the bridge to work properly.",
        "I've ordered this product from Amazon (they are the sellers too). It was open box, the Music Bridge looks like other person tried to install it before me. It is blocked with an active password, I could't install it in my PC. I bought a new item and Amazon send me an used one.",
        "I have tried and tried and I just can't get this to talk to my PC. It powers up but I can't get it to function.",
        "The Linksys WMB%$G Wireless-G Music Bridge was a breeze to set up and the results on my Bose system in the living room is spectacular! Thanks for your rapid delivery. Howard",
        "I thought all the nay-sayers were wrong - I called Linksys, followed the setup CD, looked great, except for one thing - it didn't work. Musicmatch wouldn't work at all, even through the PC speakers. Rhapsody, when switched to the music bridge, continued to stream through the PC speakers but with no controls. Wasted an afternoon - sending back.",
        "This product basically doesn't work. Setting up the network is fairly straightforward as described in other reviews. However, the unit I received didn't produce any sound even after it was connected either through a cat5e cable or a 802.11g signal. It was able to pop the speakers when the power was disconnected so the problem is probably the software that produces a virtual sound card under Windows. Also, the Installshield scripts are outdated and do not clean up after themselves.",
        "This product is surprisingly terrible. I'm a big fan of Linksys (and even moreso of Cisco,) my wireless network at home is Linksys and that at my workplace is Cisco. I am a systems/network administrator and I found the setup for this device to be unworth the effort. I am currently awaiting a Return Merchandise Authorization from Linksys so that I can send this piece of rubbish back.",
        "After many hours of trying to connect this product, I final gave up. Lots of frustration.....put it back in the box and it's going in my next yard sale. This was ninety-eight dollars of experience...",
        "The documentation says to download the Vista driver from Linksys. Their website says the driver is \"coming soon\". I contacted Tech Support and they admitted there was no driver available. Do not buy this product!",
        "I purchased this for hubby who wore his first one out! He loves it! I was pleased with the transaction--Amazon always comes through for us.",
        "This product was easy to setup and is a very handy little device. The fact that it works with any media player is what attracted me and it hasnt let me down yet.",
        "Shipped on time, etc. Difficult to install, but once I figured it out it works really well. I had to re-install once because I killed a process that was not associated with an author (I would expect LinkSys to show as the author, but no), but that has been the only hiccup.",
        "After 6 hours, mine is only working as a wired adapter from the router to the stereo, but not as a 'wireless bridge'. In wireless mode, sound is choppy and unacceptable. If you are a wireless network guru and must try this product, heed the advice in other reviews and dispose of the directions immediately (especially if you have a router) then expect frustration and disappointment for many hours. If you are expecting plug and play and are not a network wizard, I highly recommend another product.",
        "I had the wireless bridge working fine with my Windows XP computer, it also worked great with my Yahoo Music account. After I bought a new one computer running on Vista I couldn't get it to work with the existing Music Bridge drivers. As per Linksys technical support there are no existing Vista drivers for this product and it will not work under that operating system. Good product if you have a windows XP machine though. It is a shame that Linksys hasn't provided the drivers for Windows Vista.",
        "I was able to set this up, but it's a huge hassle to use and as a result just doesn't get used. It now sits in a closet. Don't buy.",
        "WorkED fantastically with XP for 1 day. After that...worked intermittently with XP after may software repairs and re-installs. Absolutely, positively, not Vista compliant in any mode or manner.",
        "This product is next to impossible to set up if you don't have a linksys router (be sure to enter your wep in hex, but that's just the first problem, you probably also need to reset your computer's IP address so they are on the same subnet). Mainly, you can only have one of these working at a time, so the Apple Airport Express with Airtunes is far superior in this respect (and can play almost any sounds, not just itunes, with the Rogue Amoeba shareware product). So I'm selling my wm54g and getting Airports.",
        "Install took under 5 minutes but I have no security on my wireless router so that made it easy. I initially used the RCA cables provided but they only gave 2 channel stereo on my Yamaha system. I changed to coax digital cable and got 5 channel sound. The doc could be clearer on this. The sound is very good and I experience no cutouts. The PC interface is a little clunky and the equalizer is pretty useless. The default settings sound the best. Overall I'm very happy with this purchase.",
        "The bridge does not work with our internet connection-- if one is connected, the other is not. Compatability issue. Granted our computer is 4+ years old (Windows XP) however it meets the min. requirements.... We have not received a reply from this vendor. Moonlight merchant has no phone number or address that I can find on the Internet. Very worrisome. Amazon.com also has no information on the vendor. They offer an email service, but the Vendor has not responded.....",
        "pc of junk threw it out just install wireless router and buy logitech duet or boombox, have both and work great.",
        "Worked right out of the box after configuration was set. Easy to use. Directions for the those unfamiliar with networking might find it moderately a challenge.",
        "This is an excellent idea that does not play out well. The installation is quirky and not explained at all well in the manual. Upgrading the firmware to the newest version (required to work with Vista - 32 bit only) causes the unit to immediately stop working. LinkSys tech support is a very poor joke. NOT RECOMMENDED UNDER ANY CIRCUMSTANCES!",
        "No problem with setup. No dropouts, audio is good quality. Solves problem of computer location with stereo. Just what I needed!",
        "Unfortunately this product did not work, but I was given a refund without any problems or hassle.",
        "The bridge works perfect, we now have music from the computer throughout the house, no problems!",
        "This product runs on WINDOWS XP ONLY. This product must have been awesome back in 2001. In the year 2013, it doesn't work.",
        "After four hours of trying all sorts of fixes, I gave up. And then a couple of days trying to reset me wireless settings that the Bridge threw off. Cisco \"no longer\" supports the Bridge and all sorts of messages say they have the same problem."
    ]
}