{
    "entity": "Routers",
    "text": [
        "After being a Linksys customer my entire high speed life, I am now at my wits end with this router. I am on my 3rd replacement and I still can't get the thing to connect to the internet. Support doesn't even answer my emails anymore, I just apply for an RMA and send it back. The trouble is I am paying for shipments and could have bought something else by now. I have also helped a friend setup and configure a WRT54G with no problem! Linksys is trying my loyalty. As other reviews have said: great product on paper, terrible implementation.",
        "I only bought this because it was advertised as the preferred router for setting up a Boingo HotSpot in a Box. Boingo no longer offers that system to new providers so don't waste your money! There are many other wireless routers that do a better job for a lower price. I am returning mine to Amazon. They shouldn't advertise it for a service that is no longer provided.",
        "Could not use this product. Parts missing and the seller send it in a broken box. Do not buy anything from the seller. Buyer be aware.",
        "Thiis router offers advanced features (regarding VPN and remote access) on what was a consumer-market product. It therefore can be used in a professional environment for a SMB.",
        "very difficult to set up.its got embedded Linux system and its just a bad router.................dont ever buy one these units",
        "I head up a network team for a large medical center and bought this for my own use. Although it ran fine from the get-go, I did one firmware upgrade (an easy, menu-driven 5 minute operation) and it has been flawless. There are also 3rd party versions of code out there which add on a ton of functionality, but you'll lose your support from Linksys. Selected this unit because it can be used as an end-node vpn (vpn from your remote laptop to your home pc, for example). Only dig against it is that it does not have dual antennas to eliminate multipath. Buy it again? Sure.",
        "This MAY be a good product for the occasional user. However, if your small business depends on this, you are dead. This baby will crash, crash, crash on you...even with the latest firmware. Nice idea to build a wireless router that supports VPN tunnels, but in reality, it just does not work. Look at the other reviews and think. Why does everybody say stay away? There must be something wrong if this many people complain. I live in Japan, and the Japanese retailers have already pulled it from the shelves due to the number of complaints. This is the SECOND time mine has locked up today. It WILL be replaced.",
        "great unit. only real shortfall is price. easy to setup and configure. all secutity can be handled from the web interface, providing you know the mac addresses of your systems. it took me about 6 minutes to setup. i did experience a similar problem of random dropping from one of my laptops, but was able to nail that down to the card in that laptop as no other units had a problem. supporting a mixed network is great as well. the TIVO really doesnt need 54g. i would recommend this to anyone who has familiarity with wireless networks, and doesnt expect the unit to hand hold a novice through the setup.",
        "I have a high opinion of Linksys products, but this is a huge dissapointment. I installed this on a customers site, and we have had only a few weeks of no trouble since November 2003. If you are looking for a good 802.11g wireless router, go with the WRT54G. Seriously, save yourself a lot of headaches and get the WRT54G. You have been warned. If you don't beleive me, look at all the firmware updates Linksys have had to put out since they launched this product. 2.10 was a disaster for the wireless side of things.",
        "After numeruos calls to Linksys, the router still will not come up properly in the wireless mode. They are recommending resetting it again, then reinstalling my configuration. I'm still trying to find the time to do this added step. This is the third router of this model that i've tried, all with setup problems in the wireless/security mode. I have to admit, they answer their phone and do try to help, but after three hours on the phone, this item seems to have some problems. I have not checked their Website for help from peers. Perhaps someone knows somthing their tech folks don't.",
        "I bought this router from Frys store(not Amazon) hoping that it would be better than the Belkin router that I already have. Alas! What an utter disappointment. Pros: Can't really think of any. I'm going to return it anyway, and hoping to get the refund asap :) Cons: 1) This router needs constant human supervision to power restart every now and then. Did Cisco/Linksys even bother to do an internal QA on this product? 2) Routing functionality doesn't seem to be good either. Just average. To top it all, they advertise on the cover to run your own wifi-spot with this junk ;) Yea right!",
        "Actually one of the most complete SOHO wireless-routers on the market. It delivers excellent wireless performance and the configuration is very simple. The used firmware is 2.21. But there are a few downsides as well, namely: - the VPN endpoint does not like remote endpoints with variable IP-addresses. You can use FQDNs, but he built-in DNS-Client does not really recognize a change of the remote IP-address, even if you choose \"any\" for the remote endpoint the problem persists. - the included DynDNS-Client does not work - Wireless performance is extremely poor in a mixed environment (11/54Mbps) Besides these flaws a really great product.",
        "G-Only DOES NOT WORK, PERIOD. MIXED MODE, ONLY works by making the connection to your wireless PC at 11MBps, even though your PC is set to Auto. ONLY If you force your PC in G Mode, will the mixed mode pickup the G band. Why is this important? Because if you are going from one wireless network to another, who wants to force G on their laptop to work at home, and then constantly reconfigure the wirelses card in your laptop to hand the B bands at the airport every single time you leave your home!!!!!!!!!!!!!",
        "I got this product because of VPN feature. Well, that's a myth. Some said it worked for them but not for mose of reviewers here nor for forums out there. QuickVPN needs lots of support. And Linksys needs to replace support people from India. I'm sure it will function just right for wireless router but not for VPN feature. Yes, it works for me as a router ok. But I could've picked up $40 router to do that job. If you are looking for VPN, look some place else. I'm returning this WRV54G and WRT54G together.",
        "Linksys has a well-deserved reputation for solid inexpensive equipment, but this router is a breathtakingly inept piece of junk. The person who tried to install it at my office was a certified IT hardware consultant with over 30 years' experience; after nine billable hours he conceded that he couldn't configure the VPN side, even with the help of Linksys technical support. Between his time, and pulling my office network down for a day, this misbegotten experiment cost me over $2,000. Don't go near it, IT DOESN'T WORK.",
        "I purchased this item to start my wireless network. This was pretty easy to setup and use. The only complaint I have is the VPN setup is not very intuitive and there isn't a lot of documentation for it. I have yet to use it, but that is ok. It's other features suit me well. All in all I recommend. I have this and a 5 port switch wireless bridge from linksys also. Together they work great. I have full connectivity upstairs.",
        "a. Restore to factory default after upgrading firmware (newest 2.10) b. WRV54G acts a DNS server. If another DNS server is required, key in the IP address of the specific DNS server in Setup > Basic setup >> DHCP page and save it. This feature is available after 2.10. c. IPSec tunnel just allow the connection between specific local subnet and specific remote subnet and remote IP addr. ANY to ANY IPSec Tunnel would be available after 2.2X d. Why the same settings (Encryption, Authentication, pre-shared key, DH Group, PFS,...) of two endpoints can not get connect ? Try to disconnect and connect once again. e. Unknown reason causes freeze, crash,.. I think 2.2X could solve those mazes.",
        "We have been using this router for 1-1/2 years now and the hardware is flawless. The setup requires someone with and IT background. We could not upgrade the firmware above version 2.38.6 or the Quickvpn software would not function. As for the Quickvpn software, Linksys needs to support it better. The windows \"hosts\" file needs to be updated and security firewall settings must be set correctly. Once done, the system works well.",
        "I upgrade a customer to this device to add the wireless capability. The were using a Linksys BEFVP41 successfully with SSH Sentinel VPN Client software. I am unable to connect with SSH Sentinel and am told by Linksys support that it does not support the SSH Sentinel software, yet, to keep checking their web site for update firmware. This is aweful that they replace a product and remove functionality.",
        "I brought this just recently 2 months ago and had no problem setting this up. I have 3 computers and 1 print server connect to it wirelessly using 802.11B & 802.11G network connections. I have not yet get a drop signal or disconnection. I just want to let you that this network device is not for beginners it takes some knowledge of VPN to set up or you have to do some research. Begginers should try Dlink or Microsofts network routers. Instructions I would say is a little skippy but the product works great.",
        "This router has to be one of the worst made products on the market, and has the poor customer service. This router was defective out of the box, took 3 weeks of communication with Linksys's customer service before I finally just returned it and build my own router with the same functions.",
        "I couldn't imagine that a linksys product was as bad as everyone was saying. I bought it anyway and now I don't have to imagine. It has problems. It crashes when I try to set the time zone. It crashes frequently!",
        "Constant troubles, reboot every day. Support is patetic. Do not buy",
        "This is the worst networking product ever! Constantly crashed and VPN does not work. How could they get away with selling this POS?"
    ]
}