{
    "entity": "Routers",
    "text": [
        "Rough adjustment release lock is under the collar lock and a pain to adjust. Fine adjustment sticks. Body does not slide smooth in the collar. Generally junk and I have had my small Bosch router for ten yards and it still works like a charm. Go figure. I have had this since May but too long to return so i am, going to have to eat it. My Porter Cable lasted twenty years and I should have kept it. So much for upgrade to new equipment. This certainly was not it.",
        "I have a couple 1617EVS routers. Smooth, easy to depth adjust . I made acrylic base plates for all of my 1617 router bases. The only reason I don't go 5 stars Is because I need to replace bearings every so often. The bearings are $6. and it takes me 1/2 hour. But to be fair My Porter Cables have the same issues.",
        "It is very prone to become hard to adjust vertically because wood dust gets down into it over time no matter how careful I am to keep it clean with vacuum. I even have a vacuum nozzle positioned under the table right at the bit and it still gets dust down into the router. I had to return it for repair when it was about a month old due to this problem. Also, the retainer snap ring on the vertical adjustment shaft has broken twice because of pressure applied while trying to adjust the router height because it was so difficult to move due to the dust.",
        "I bought 2 of these after reading hundreds of reviews. Powerful, quiet (for a router) and versatile. I have one mounted in my router table and another with a plunge base set up on a Jasper Jig for circles. Soft start is softer than my older Freud router rated at the same power. I'm not using the fixed base so I can't comment on the longevity of the handles that others have mentioned. Highly recommended alternative to Craftsman, Rigid or DeWalt.",
        "The Router was easy to install and fit perfectly on the router table base. The router works well, I used its to make door fronts for counters I built for our kitchen (shaker door fronts). The only problem was finding the right orientation to fit it on the table. Also the fine tuning adjustment for the router is under the guard for the table. Longer t wrench with a small hole it the guard would solve this.",
        "Update: knocked it down a star because the speed controller is failing after very little use. Fortunately it's a relatively inexpensive part. Great value for the money. My only complaint is the front spindle bearing is retained with two Phillips head machine screws on the outer race, with no bearing clamp. Really? I'm planning to make a bearing clamp on my lathe for this critical part.",
        "just a heads up if this is your first bosch router, the depth locks in in channels then you make the slight changes with the dial on the side, if you watch a you tube video on how to use it, it will make sense, if it is not locked in it drops to the next slot while your routing. I did this, it was my own fault. The router is awesome, clearly higher quality then the other brands I buy, DeWalt Makita ect ect.",
        "I have purchased several of these over the years. The usually last a year or so for our trade which is good. NOW? I get a few months out of them. All I can figure is that these are rebuilt units being sold as new. Buyer beware.",
        "I have 4 porter cable routers and 2 hitachis and thought this Bosch would be a good addition to our shop but was poorest excuse of a router I’ve ever seen. Base was very hard to adjust, just about impossible, switch did not work half the time, and I thought was all the way around a cheaply and poorly made router. I do have other Bosch products and love them, but they let me down on this....",
        "I mounted this on a Woodpecker routing table and so far I have made two windows, one large kitchen garden window (Sash, Muntins and Casings) and two gates (Dado, Rabbit, Dovetail and Tongue and Groove joints) with this router (router bits from eBay). Problem, this router needed a chuck extender (xTreme xTension) to work with the woodpecker router mount, but it was only 1/2\" shy before I added the extender, so no biggy. I like the soft start and variable speed (8,000-25,000 RPMs) features and was surprised but very delighted how durable this router is. I went with a 1/2\" chuck but it also came with a 1/4\" chuck.",
        "Router itself is fine (good quality) but box was previously open and/or router is used. Router and accessories just tossed in the box without the packaging to hold everything in place. Both ends of the box open as in the glue was broken. After reading the manual, confirm some parts are missing.",
        "The bosch1617evs router is a fantastic machine that has performed flawlessly with everything I have asked it to do. About the only thing that would make it better, is if it were cheaper than what it already is. Pay no attention to the few negative reviews on here, most of those people don't know what they are doing or talking about, for the price there is NOT a better router out there; hell there's a bunch of routers out there costing quite a bit more than this one and they still aren't nearly as good as this one. Quit thinking about it and buy it; you won't regret it!!!",
        "Love this router. Installed in my table. Variable speed is great for the different size bits and different types of wood. Plenty of power Love that I can micro adjust from the top of the table and change the bits without getting under the table. Soft start feature is nice when routing by hand. So glad I bought it.",
        "Used this mounted on a router table, occasional use, not overloaded or abused but it just died after a little over 3 years. I've owned a number of routers over 35 years of hobbyist woodworking and I don't recall any with such a short life span. It's a pity because I liked it up until now.",
        "Great router ...but mine had 2 cracks in base plate (its plastic😒). Coming out of mounting screw holes. I would have returned it but i was mounting it under a table with a lift so the base plate was taken off to mount it on lift ...problem solved i wont b taking it off its table ..",
        "powerful, variable speed a major plus, easy to adjust height, simple collet changing. wished i bought this sooner. purchased Bosch Benchtop Router Table RA1181 with Bosch 1617EVS Fixed-Base Router excellent table for the money",
        "Lotttttttttttt of power do not the put it on low speed and cut hard wood thank god I was wearing safety googles",
        "I just opened the box and was very excited to get started. Upon inspection, the bottom plate is cracked around two mounting screws! Where is the quality control??? I tried to go online to product support with Bosch... I cannot get online support for this router! Of course my return window closed 4 days ago! NOT HAPPY!!!",
        "delivery was real good ahead of promised time. router box was not sealed good on either end, had slight damage on one side of box, other wise no problems. mounted it router table and tried it out no problems. thanks. for prompt service",
        "I use this when I need two handles and some oomph. I have a smaller router which is more facile but has not the same power. A very good router. I think that there may be better raising and lowering systems out there?",
        "BE AWARE. According to the \"Frequently Bought Together\" on this item the base that comes with this router INCLUDES the \"Bosch RA1165 Under-Table Router Base with Above-Table Hex Key\". So, if you are looking for an inexpensive way to have an above table fine adjustment for your router on your router table as I was then you do not need the RA1165, I have not even powered up the router on yet so I can not speak to the quality. It looks good out of the box is all I can say at this time.",
        "This router has plenty of power. I like the slow start feature. It doesn’t jump when you start it up. I also like the size of it - small but powerful. Highly recommend. See my video on YouTube at timtools99.",
        "I purchased this mainly for my router table and it does a very good job. I like that I can easily adjust the height without taking it out. It is a very powerful and tough tool. The plastic piece does not fit as tight as it needs to. That could be made better. The cord is nice and long when I am using it as a stand alone (off the table). The wood grips are the perfect size. The adjustable speed is a definite must and plus. All in all a very good tool.",
        "Runs well, does not overheat. Also good locking mechanism to change bits with included wrench. this is my second unit, one is mounted under my router able , the other is used for free hand work.",
        "This is my second Bosch 1617 router. I bought it for a horizontal mortising setup. These are great routers tons of power and very reliable. I built all the cabinets in our home with the first Bosch router. It is 16 years old and still going strong. The new one has nice improvements.",
        "I've always been a Bosch person. All my tools are either Bosch or Dewalt. This router is well made, plenty of power, and compliments my Bosch trim router, and plunge router. Yes, the bigger the router, the louder it will be - so be sure to wear ear protection. On a loudness scale, this router is not too loud, but still wear ear protection. I chose this Bosch because of my satisfaction with my other Bosch tools, and I knew it would fit perfectly with the Bosch router table, which I feel is a bargain for the money.",
        "Love this router, glad I went with it instead of the cheaper ones I found. This router is super quiet and powerful! Take this review with a grain of salt, as I do not consider myself an experienced wood worker by any means, and I am sure that a more seasoned craftsman could find plenty of issues to complain about. For me though, this was a very sound investment!",
        "Upgraded from my old black and decker....and this thing is amazing. Powerful, easy to control with wood handles. accepts 1/4 and 1/2 inch shanks. Adjustable speed. I use mine both hand held and with my Bosch router table. Very happy with results. I believe it has less vibration than my black and decker....and this seems to be more controllable than my black and decker.",
        "This router is capable of producing 2.25 HP of mechanical energy, while consuming a mere 1.93 HP of electrical energy. This is a miracle of physics! If we chain enough of these together, we can build a machine that perpetually generates the world's energy needs. 12A * 120 V = 1440 W = 1.93 HP. Type \"1440 W to HP\" in your browser to verify. Pretty quiet. I had to drill and countersink new holes in my cast iron Craftsman router table to accommodate this router's smaller hole pattern. But owning a router with a 116% efficiency is well worth the hassle.",
        "I used the other brand for years, in tables, and free style, and at a great price, thought I'd give it a try. I think you can't go wrong. I'm not a contractor, but cabinet builder, and this is certainly up for the task",
        "I bought this thinking it was good for the job. after only using it a few times since I got in march 2020 I set up to make profile cuts on doors. It stared bogging down under a load so Isenttt it to bosch for repairs got it back ten days later set it up to restart job and it immediately started doing the same thing. so apparently the Bosch repair center doesn't know what they are doing. so off to bosch again this time with a detailed note of how to fix it. hopefully the can read.",
        "After doing quite a bit of research I purchased this router to do some planing and other small projects. It worked great for maybe an hour, and then just completely stopped turning on. I figured I would give the brand another shot, since I had read so many good things, and ordered a replacement. Less than 3 hours later the replacement stopped working as well.",
        "I purchased this router to use with the Leigh box joint jig. The base of the router requires an addition piece of equipment which did not come with the router. I have checked online but I am not sure what accessory I need. Could you assist. I have not used the router as yet since I have another router which I use daily. I ordered this router as the Leigh box joint jig requires a 1/2 inch collet.",
        "This fixed base router has plenty of power and doesn't go airborne thanks to soft start:) Means, it doesn't kick at startup. We use a couple of those for smaller jobs (where industrial shaper is overkill) and this router is well balanced and very durable. Adjustments are easy and precise and the motor much quieter than some other brands I've used. Can't ask for more.",
        "I bought it because I needed a router for my new router table that was adjustable from the top of the table. This one works fine. I like that it comes with both 1/4\" and 1/2\" collets. Very handy. Seems to work just fine.",
        "I have owned two other cheaper routers, the most recent being a plunge Skil. I was amazed at the smoothness and lack of vibration compared to what I'd used in the past. Using the same bits that were in the Skill this router hums along while the Skil almost requires hearing protection before it even touches wood. The Bosh also maintains speed very well under load so you have much more consistant control freehand and less biting and chipout when using larger bits.",
        "Bosch, Dewalt, and many others make very competitively matched routers. I chose Bosch because the 10 foot cord is about the minimum I can accept on a pro quality tool. Dewalt and the rest give you a shorter cord, which for me is a bit disappointment.",
        "I like the soft start for free hand. It would be nice to have the start switch on the handle ,but use it in a table as well so for me kinda a moot point. Lots of power well made",
        "This unit is not a good fit for under table mounting. The quick clamp makes it difficult to adjust under table.",
        "Replaced an old Ryobi with this and am very happy with the upgrade. Even at higher RPMs this thing just hums along were the old Royobi would have been screaming and whining. Feels very solid and precisely engineered.",
        "Steady, powerful and very little vibration. I’ve run hundreds of feet of stock through this thing and it just keeps consistently performing.",
        "Cabinetmaker for 30 years. They put Porter Cable to shame. Thank you for the wood handles. Love the soft start. Very novel for me, I’m used to fighting the torque on start up. Easy depth adjustment. Extra screws provided for custom faceplates. Solid wrenches. Love it",
        "I love this router. I've had the same router as part of a combination set (interchangeable fixed and plunge bases) for years, but tired of continuously swapping out the motor between my router table and the plunge base. So, I purchased this one to install permanently in my router table. The soft start and variable speed are great, and the unit has all the power I ever need. I'm really a fan of Bosch tools as they seem to be very reliable, well designed and reasonably priced.",
        "While some routers feel like they are taking you for a ride, this machine is so easy to control that it soon becomes an extension of you. The light weight is deceiving as I have yet to find a job too tough for it. Needless to say, this is a favorite in my workshop.",
        "I got the most basic model with the fixed-base. It came with the 1/4 inch collet as well as the 1/2 inch one pre-installed. The height adjust mechanism for the table mount works OK. Of course, it shouldn't be compared with the fancy lifts. Just have the right expectation.",
        "Heavy and bulky, but adjustments lock in and stay. Thinking of a plunge attachment but afraid it will make an already heavy tool harder to manage for occasional hobby work",
        "I used this router to make the tongue and groove joints in 100 year old flooring about 400 square feet worth of flooring. The router was up to the challenge.",
        "The original Bosch Collet was not received, I notified the company; the hassle free replacement came in a matter of days making my husband very happy. Thank you so much.",
        "I own 2 of these routers and they are a very good product. U=I have the plunge model and the standard no plunge model.aThe parts are interchangeable, and that is convenient in the shop. a little heavy but very stable. I lubricated the router base and the shell that holds the body .ht makes it easier to slide the base for different depths of cut.",
        "Great router....I've been using Bosch tools for a while now. This is actually the second router I've purchased from them. The first ended up a permanent fixture in my router table so I needed one from my plunge base. I've used it on a few projects now and it works flawlessly. Great build quality from Bosch!",
        "Purchased specifically to use in a Kreg router table with the Kreg lift system. Already knew that the Bosch router is a good one as I have others that I use as well. This didn't come with all the bells & whistles which is exactly what I needed.",
        "I don't use routers often but this did what I expected it to do. My only gripe is that it's hard to see the bit through the little window provided",
        "An excellent router for the money. It fit the Kreg insert perfectly which fit the JessEm table top recess perfectly. The only minor issue is the lack of the shaft lock to allow easier loosening and unloosening the collet. Other than that minor issue, an excellent router.",
        "It about1/4th as loud as my other routers. Lots of power for planing slabs and good adjustment accuracy. Adjusts with a screw dial and then locks with lever clamp. Slow start is A+. Very happy.",
        "This is the second 1617 I have purchased. I originally bought the package with a plunge base included so I saved myself some money this time and bought just the router with the fixed base since the original sits in my router table. I love this router. Only complaint is the collet on the original router failed after about a year, I purchased a replacement and it has been good.",
        "The Bosch 1617evs router is fine. The problem is I cannot find the serial number. Does anyone know where it is located?",
        "Good router, but delivered with 24mm and 16mm wrenches, but requires TWO 24mm wrenches to tighten collet!",
        "Bosch delivers another great router I use this one for my table router and it works great",
        "I would give 5 stars but have been to sick to use,the reason for 4 stars is the box had been opened,I will update as soon as I use this,it appears new all parts were included in unopened plastic,but the box itself was opened.",
        "I have 5 routers from various manufacturers. 2 of them are from Bosch. these routers are smooth and powerful and easy to use. I consider every other brand of router I have purchased that weren't Bosch to be a mistake.",
        "I had a rather inexpensive router in my shop and now I'm kicking myself for not upgrading sooner. This router does everything I need a router to do.",
        "quality product, grips bit very well and bit does not walk in chuck which is a problem with cheaper routers. base adjusts precisely",
        "Very impressed with the adjustment feature of this router. Works perfectly in my router table.👍",
        "This is a well constructed and very functional router. I am an amateur wood worker and have had no problems with it. I am pleased!",
        "I had to return this item and exchange it because the first one did not work. The second one malfunctioned 6 days after I was able to return it. It was a waste of money and for the price I should have gone to homedepot or another warehouse were I haven’t had theses issues before.",
        "I love love love this router. I've been using it consistently for a few weeks now. It's a beast. It planes through wood and epoxy with no change in consistency. I love it",
        "Quick and painless router that offers many advantages over my aging Sears router, more powerful and easier to control.",
        "These worked flawlessly for all the projects I put them through. One developed a bad on off switch about 4 month into its usage, easy part to replace and not worth knocking a star off.",
        "this is my second Bosch router of my collection of 6 routers. The only thing I had a bit of a concern over were the handles and balance, however, my other Bosch has a dual base so I took the plunge base and put it on this newer version, keeping the other one mounted in one of the router tables I use. I was always having to take the Bosch out from under the table when I needed to use it for free hand routing so decided to make the purchase. Now I have both ready to go with the same round-over bits and don't have to adjust...",
        "Although this machine is advertised as having both 1/4 and 1/2 inch collets, mine came with a 1/4 and a 7/16 (11 mm. ?) collets. The collet chuck was simply too small to accept a standard 1/2 inch shanked bit. I never heard of a 7/16 shank in this country anyway. Never had the opportunity to turn it on before sending it back for credit. Bought the Dewalt instead.",
        "Great router. I've only used it in the table but I can imagine how it would feel/operate \"free hand\". I like the soft start feature and the inclusion of 1/4\" & 1/2\" collets. The dual wrench feature for changing bits is hard to get used to but only a minor drawback.",
        "Just updated my shop and bought a new improved router table. I have the Bosch 1617 on the old router table and it has been a workhorse. So I bought a new Bosch 1617 for the new table. I hope it work as well as the old one (that by the way is working fine and will continue to power the old router table). I am very happy with the Bosch router both old and new.",
        "I love my router. I built a router table for it and use it all the time. I found how to's on YouTube.",
        "My old Craftsman died. Had to make a mounting bracket for the Bosch to fit my Craftsman router table. Bottom line: I love it!",
        "Really nice tool. It fits to the hand like it was made for me. THe power is well contained and easy to control.",
        "Replaced an old craftsman router on my router table. This is a quality router, easy set up and accurate.",
        "This is a good basic router to own. I use it in a table 99% of the time. It is rated at 2.25 HP, but it feels much more powerful. I've already run this router for hours on end without shutting it off. It's been so hot that I couldn't even touch it. Over 2 years of hard (but not neglectful) use, it has never given me a problem. You cannot go wrong with a Bosch router. I think they make the next best router after Festool.",
        "Over the years 64 of them. That is, I've gone through a few routers being a journeyman carpenter, but I have yet to wear out my Bosch router",
        "Mounted this into a router table, it has not been pampered. I burned through a lot of wood with bits that weren't fit to cut butter. This router took the beating without complaint, even as the sawdust was burning from friction. Would recommend.",
        "This router makes my other routers look like junk. It's smooth, quiet, starts up gently, has plenty of power and has feel of quality. I highly recommend it. I have other Bosch equipment in my shop and it, too, out performs other manufacturers' similar tools.",
        "Haven't used it yet because I cant use the 1/4 in bits I bought because the 1/4 in collet is missing...Very upset about this.I would like to get the collet I'm missing...",
        "works well. seems very durable. first time i used it a screw that holds on the slide plate fell out and ruined a 40$ bit. all the screws were loose. it ended up ruining the bit and it must have bent something in the chuck because now bits dont slide in or out very well.",
        "Don't buy any accessories that require assembly (router table). Hours long assembly process with Bosch compared to engineering designed for quick work like D Wal T. Fetishistic assembly on router table is ridiculous. D 1 hour assembly with 3 different bolts. B 4 hour assembly from a mixed bag of 30 different bolts.",
        "large router I fixed it to bosch router table top quality tools it feels nice using quality tools",
        "Needed a standard router for my horizontal router table and this fits the bill. Plenty of power for oak; easy depth adjustment. The speed control is easy to reach. A little difficult to get the wrenches in to change the bits, but all in all, I would but it again.",
        "Replacement for a damaged router. Second Bosch. As good if not a bit better than most competition",
        "My first router was ok as they say you get what you pay for the Bosch router is a whole different level it is so much easier to control I even engraved with a small straight bit I am a novice wood worker but from all the research I did this router lives up to its reviews.",
        "This router has become my favorite tool! I put it in the benchtop router table, read a book to save my fingers and proceeded to route things like a champ! There are countless attachments made for the bosch router, you won't go wrong with this one (unless you want the remote attachment too, then get the other one, but seriously it's like $80 more and unless you know what you're doing, you won't need it anyway)",
        "This is my third Bosch power tool and I have not been disappointed. I installed it on my router table with a Smart Lift and changing the bits from the table top is so easy with the two wrenches provided. I think it has the best collet (self releasing)system. I just didn't realize how convenient the system is until I have actually experienced installing and removing bits. Got lots of power, and the variable speed control seems accurate, and has so far performed flawlessly.",
        "Very nice router. I'm using mine as the router head on my CNC Router platform. It does a very nice job. My biggest disappointment with the unit is that it does not come with a 1/8 inch collet. I did eventually manage to round up a 1/8 inch collet through a third-party seller, so in the end it all worked out-- for another $20 bucks.",
        "For the price this is a great unit with a 1/2\" collet. I cut crown molding profiles no problem with it.",
        "I use this router on my Shark HD3 cnc machine daily. Works great! The variable speed RPM allows me to set optimal chip loads and feed rates so the cnc machine can perform at its best. This will be my replacement router again when the other eventually dies from over-use.",
        "I used it for my router table it works great I can do quick adjustments on the fly",
        "Love the soft start on this router, and the quality is great. Easy to adjust, including the microadjust for depth of cut, lots of power and the motor isn't anywhere near as loud as my PC 690. I have 2 of these now, one with the plunge base... I'm a big fan.",
        "Power switch failed the second time I turned it on. I returned it.",
        "I wouldn’t recommend it to anyone , I bought this unit didn’t use it till like a month later , And I couldn’t slide the router in the base due to a pin sticking out in the base , it was too late to return it Send it back to factory and the didn’t fix it .",
        "This is the third 1617 EVS Bosch that I've purchased - Whether used handheld in a fixed or plunge base or in a router table this is the best 2-1/4 HP router for the money that you can buy. I have three router tables, two of them have a 1617 EVS on them, and my big one has a 1619 EVS 3-1/4 HP on it. In my opinion Bosch makes some of the best tools on the market.",
        "Awesome router. My first Bosch tool, but it won't be my last. I paired this up with the RA1171 Cabinet Style Router Table and made the doors for my new kitchen cabinets in just over three hours. Works great with paired style and rail bits, and is easy to adjust from the top or bottom when mounted in a table. Also rides smoothly for free-hand work.",
        "Nice powerful router. Wish it came with a case or bag. It cuts well and the variable speed has been more useful than I thought- less burning of woods",
        "bosch is great I use in my router table so it hangs up side down and no router seams to like that for long but I can get 2-3 years our of this router in my custom cabinet shop where I have tried other brands and even plunge routers and only get 6 months to a year"
    ]
}