{
    "entity": "Routers",
    "text": [
        "Linksys is consistent - when something works, it works great. The rest of the time, you're on your own. ... This system worked well initially, then spontaneously stoppped. After many frustrating attempts at customer support, I was finally able to reboot and get it working again. A simple hardware reboot isn't adequate - it needs to be physically disconnected from the power source for several minutes. We get to do this several times each week. I'm still waiting for an explanation from Linksys. Additionally, I'm convinced that the reset button is there for appearance only - it has yet to do anything for my system!",
        "I bought the BEFW11S4 before Christmas and the only complaint I have about it is that the range of 300ft advertised is questionable. I have the device in a corner of my house and when I am on the opposite end of the house (as far as I can be away inside) the signal quality is poor, almost to the point of non-functional. This is no where near close to 300 feet distance I am talking about, maybe 80 feet. Other than that, the support was good, the setup was easy, and I have two PCs running through mine and can add a couple more, so I'd say this device meets my needs and the company stands by it.",
        "This is a nice multi-feature device that works great ONCE you get it configured. Unfortunately, the user guide is written for Network Engineers. I can do lots of PC stuff (wipe a hard drive, reload Windows, add or replace internal hardware) but I know nothing of networks. The user guide is missing some key info, and wrong on others. However, there is toll-free support and I got expert help after an 11-minute wait. Not bad! But the documentation is inexcusable. Not only is it incomplete, but it is only for Win 98 & ME. If you have NT or 2000, they offer no instruction at all!",
        "I've been using PCs since the mid 80's, but I'm not real technical. After the new router and the wireless card came I was really apprehensive about installing it, so I let it sit for a week until I felt brave enough to tackle it. In less than a half hour we are up and running. My daughter is now upstairs with full internet access. I now have my PC all to myself. The installation software did all the work for me. At one point I wasn't even sure it was installed because it went to quickly. If you have any doubt about buying this. Forget it. Order it now!",
        "I could never get this to work correctly with Windows 2000. I kept getting \"Network Cable Unplugged\" messages from Win2k which fumbled around but almost always got a reconnection. I work at home often over VPN and this was driving me nuts. Tech support asked me to upgrade to the version i told him i already had and was in general not too usefull. I did try their suggestions with no joy. After trying several fixes gleened from dejanews (search for yourself under \"Network Cable Unplugged\"), i gave up and ordered an SMC unit and returmed the Linksys. All of this is with LAN connections. I never got a chance to try the wireless.",
        "I got this thing set up in about 30 minutes. Took another 15-30 minutes to set up my computers with their wireless cards. I have linksys in a laptop, a linksys PCI card in a desktop, and a Cisco card in another laptop. They all work well and I am pretty pleased with the results. For those of you sitting on the fence because you think it will be a pain to set up: read the instructions before you start. The set up is not that hard, just go slow. The worst that will happen is you wasted a few hours and you return it.",
        "I bought this as part of my plan to turn my house into a wireless Xbox paradise. Aside from problems I had with the WET11 (see my review on that item), I later found out that this product cannot support more than one Xbox connected to Xbox Live at a time. I had some inkling that this might be the case, as it's documented on the Xbox Live web site, but I was holding out hope that the more recent firmware releases may have fixed it. I mean, it's LINKSYS! It's THE name in home networking products. Well, there's always hope for the next firmware release.",
        "I recently purchased the Linksys 4 port Cable/DSL Router for my home. The router and software installed easily on my desktop system straight from the \"quick install guide.\" Software configurations were a breeze. After the installation, I fired up my Dell laptop with its wireless adapter and it auto found the Linksys router. Easy! In and around my house the connection strength is pretty good, most of the time running at maximum speed. Moving about 75 feet from the router, with 3 interior walls between the speed drops about 2/3. Overall I am quite happy with the product and would recommend it to others.",
        "Be sure to download the firmware update from Lynksys before spending a lot of time using this device. They have a simple utility to run on the PC connected to the device to \"flash\" its memory. Certain functions won't work without the update and performance may be less. If you're wondering about 802.11G who cares? Broadband cable and DSL are well below the 11MBS speed of this device (less than 1.5MBS). It'll be a few years for you to need more bandwidth than this device provides for the home user.",
        "Just received the router and I could not contain myself that I dove right into it. Pay attention to what that CD cover says. Do what it tells you. I networked a table top PC with a DSL connection for a remote laptop for my daughter. I got the Netgear PCMIA as the receiver for the laptop. I disabled the SSID and as a result was not transmitting the signal. Naturally, the laptop showed no networks available. I went back in and was rewarded with a green light indication on the icon tray. It was smooth sailing after that.",
        "I bought the router, pcmcia card for my laptop, and pci card for my desktop. The hardware was easy to install, however, I was getting a lot of lost packets when it was first installed. A networking friend suggested downloading the latest drivers for the products, and viola, it started running like a champ. The initial problems were probably the cards' fault, not the router. The range is somewhat less than claimed. I think I get a strong signal under 50 ft, then it starts fading. But, after reading some reviews, this was expected. Overall, it was very easy to set up, and I haven't had to do anything since (almost a year now).",
        "i got this router with a USB adapter from the same brand... it took me more to open the box than to configure the router with my cable internet and the USB adapter... i have the computer in the basement and the router is located in the third floor....and the Signal Strengh s excellent... its a really good product...easy set-up interfase (WEB)...a lot of characteristics.... but i recommend you to download the lastest Firware...i'll work better!",
        "I bought this router and spent almost two hours online with Linksys. After trying every sort of suggestion and speaking with three different tech support people who barely spoke English I finally understood that Linksys has \"limited support for Macs.\" When I asked what \"limited support\" means, I was told \"we are not trained to help people with a Mac. If you can borrow a windows PC we can help you\". What a waste of time. I am sending the router back. Beware if you have a Mac.",
        "Combining wireless and a 4 port switch - this product is best of its class. Setup is extremely simple - but the unit still manages to be feature rich. Even if you are not interested in sharing your DSL/Cable connection to multiple computers - this guy is still a must have. Your PC will basically be protected (in a firewall-esque way) due to the NATing. If you have some goofy PPPoE or other ... client that has to be installed on your PC - using the Linksys is a great way to free yourself from that as well. The router will authenticate you and handle the \"dail-up\" peice.",
        "The product works well unless your setup includes having the router get a DHCP address from your provider. It would seem that every time the DHCP address expires, the process of obtaining a new address fails. This results in you having to reset the router and since its wireless, there's a pretty good chance you're not in the same room as the router. Their tech support will only give you the next revision of the firmware if its available, which they sware will fix it but never does. I gave up on them. But its not an expensive router, so I guess you get what you pay for.",
        "The Linksys router and wireless card works like a charm. I had things set up in about 20 mins. My wife can access her work computer via her VPN connection and the only configuration I had to do was the log-in for our DSL modem! Later that night, I spent about another 10 mins. to share our printer (never possible on the Panasonic unit as far as I could tell!) and was printing out the rebate info from our laptop in the living room. I would highly recommend this product.",
        "I owned it for a few weeks. Every day or two I'd have to reboot it. The DHCP server tends to hold on to leased addresses even after the client goes away and reconnects (couldn't they see that the same MAC address has come back?). The configuration options are rather basic; if you have a networking background (e.g., your former firewall was a Linux or BSD box), this is probably not the box for you. Finally, it (like most other home routers) only supports one IPSec pass-through session. Instead, I highly recommend the Nexland ISB WaveBase. It costs a lot more, but is very well worth it, especially for the concurrent IPSec session support.",
        "I do not recommend the Linksys BEFW11S4 Wireless 4-Port Cable/DSL Router(WC/D router) for Macintosh users for the following reasons. 1. The WC/D router comes with a CD that contains instructions and video to help the user install the product. The CD didn't work on a Mac. 2. The manual contains details for the configuration of Windows networking, but no instructions for the configuration of the Macintosh TCP/IP control panel. 3. Firmware upgrades are only provided as Windows executables. When I contacted Linksys to tell them how disappointed I was in their Macintosh support, I received no reply.",
        "After worrying for months about which Cable/DSL router to buy and whether it would work with my system, this router was a pleasant surprise. I have cable net access, and the hardware and software setup was just about idiot-proof. I get excellent signal reception at another PC 2 rooms and about 40 feet away, I don't have it hooked up to my laptop so can't comment on dead spots or maximum range. If you are looking for an easy installation this is the one for you.",
        "Once you get this router up and running, it works flawlessly. However, you will have problems with sustaining TCP connections until you upgrade the firmware. i.e., your AIM will periodically shut off, a download will suddenly stop, or an online game will lose connectivity (for just a moment, but this is enough to tick you off). Also of importance is that a wireless connection will sometimes be unable to contact the router once you take it off sleep mode. Note, however, that once you upgrade the firmware (which is really easy to do on the Linksys website), it works great. But the firmware version 4 works terribly.",
        "I bought two of these routers brand new, and a family member bought one as well. ALL 3 of them are defective. If a computer on the network reboots, the routers compeltely shut down. Also many services, like email, would not work through the router. It makes little sense. But these routers are junk, they simply won't work, and I reccomend everyone AVOID THEM AT ALL COSTS. You might as well go buy a brick, it will work just as well on your network. (NOT AT ALL!)",
        "I got one of these bad boys and plugged in the ethernet and like it didn't work. I could load the admin page, but it took like minutes with frequent timeouts. Completely broke for sure. I returned it and then tried netgear, you know what, it ... too. If I turned off my wireless, had to restart the netgear to issue new DHCP addresses, wack. So I got the D-Link DI713 and it was truly 5 minute setup. Zero problems. Top of the line. Quality. ....Oh yeah, same price. Take my word for it, go D-Link.",
        "No need to be superfluous given the number of previous reviews. The simple fact is mine is still working even as I write this review. Setup was easy, LinkSys online support is super, finding their products by model number is a synch, and upgrading the firmware is relatively straightforward. My only minor complaint is they never offered static DHCP (mapping MAC address to static IP via DHCP) on this router.",
        "perhaps 5 days to install it and not to be able to do it are much lost one of time, to others can serve to them, but I believe that besides knowledge, it needed a CD, because when you enter the page Cisco Web, they want cobrarte too much money by any thing, I better create sera to think it and to buy something new .....it sends in the end it of return for back.",
        "Installed it last night to sit between an iMAC and an IBM Thinkpad. The iMAC has a standard ethernet card, while the Thinkpad is using the Linksys Wireless card. Works pretty well. I couldn't get the router a WAN IP address until i reset the cable modem. The documentation isn't the greatest however, which is the only minus. Signal strength is pretty good in a pre-WWII apartment.",
        "I got two of those routers one in a California home and one in France (wooden and brick houses respectively, no concrete) I use them exclusively indoor and in both cases the maximum range is about 30 feet!!! Beyond that there is no signal. I then added a Linksys booster to the one in France, with no change whatsoever in range. I emailed twice to customer service at Linksys without getting an answer nor an aknowledgement not to mention an explanation. I do not know of the other brands of wireless routers but this one is poor range wise.",
        "Ok, just got it yesterday and hooked it up in under 10 minutes. Now, read the instructions, but really just put the cd-rom in your drive and follow the prompts. Do not forget to wear a white shirt and tie, and ill fitting chinos, so you look like the geek from your office. Now the important stuff. The cards for the other computers take a little longer, but don't give up. Now my house has 3 desktops (2pcs and an Apple)., plus my Jornada 720 clogging up the internet. HANG TEN!! and have a great summer",
        "Installation was a piece of cake. I switched out my non wireless Linksys router for this baby. I get great signal all through my place, albeit it my place is a tad small. I was up and running within 5 minutes. I'm using an Orinoco Gold card (courtesy of work) and have had no problems since. I just switch between two profiles between home and work. Would have gotten five stars if not for the security/encryption flaws.",
        "I would recommend this to all the home users who are looking for cheap and reliable wireless connection. It is easy to install but the firmware is buggy. I had to call tech support to help me reinstall the firmware after my first attempt caused the red light on the unit to flash. Also, the D-link DI713P is pretty good. However, the D-link is a little bit confusing to configure at first.",
        "As a basic no-nonsense wireless access point this one works very well. The installation was easy and painless. My only complaint, and hence the missing star, is that the range is somewhat limited. The signal becomes a bit inconsistant if the networked computers are on the other side of the house, separated by a few walls. On the whole, it works very well though.",
        "In the last three years i bought three units and until today are working properly in my house and the house of two friends. Easy installation and configuration. After three years i dont have problems with this router. Only one recommendation: try always that your router works with the newest version. You can download free at Linksys web site.",
        "I purchased this unit through Amazon.com received it a couple days later and it was up and running in no time. I currently have two laptops running wireless using the Linksys WPC11 PCMCIA cards. I plan on hardwiring my desktop soon and using it as a file/print server. My apartment is not very big so I can't really give an opinion on range, but I am getting super fast downloads. I highly recommend this product.",
        "I purchased this item after I researched the different kind of routers available on the market. I think I made a very good choice. The only problem I had was related to my DSL provider (Earthlink) and they did not appear to be very helpful to me. Nevertheless, LynkSys provided me with the missing information and my router works just great.",
        "It amazed me how easy it was to set this thing up. It came ready right out of the box, and after I connected it, it allowed my two computers to share a lone cable connection without any further tinkering with settings. This is a great buy for anyone looking for a user-friendly way to set up their home network.",
        "I found that this product was very nice, indeed. It works, it sends out a good signal, and it kept up to speed with the cable company I had. However, there were a few cons about it. FOr one, at moments, I would randomly get disconnected whether I would be console gaming, or hooked with a wire on a PC. That would really be the only con, and I would have to restart it o fix the problem. Overall, I give this router a 4 out of 5.",
        "Linksys makes great products !! An d this was no exception . High quality as usual . GOOD STUFF !!! thanks Marv",
        "I cant believe what an excellent product this has been. And the incredible support! Have used it for about 8 months and the quality is wonderful; each time I have had a problem or added another computer to the network, the toll free support has solved the problems in minutes. Very happy with this purchase!",
        "Worked great for many years. Stable and good wireless signal. Only ran into issues if multiple people tried to stream a movie or music at the same time; the bandwidth would just get sucked up.",
        "I don't consider myself a techie in the least bit but this router was a snap to set up and use. I have had it for over a year. I had to replace the power adapter but that is probably because of a surge I replaced it and the router is still going. I would recommend this to anyone great value great price.",
        "I was skeptical when I ordered this product and a USB Wireless network card. I was proven wrong, no glitches and 5 minutes out of the box I was on the Internet and another 5 minutes for the USB card and I was on the Internet downstairs. Highly recommend this product series. I am very happy.",
        "The device fell apart when un packing. It can not handle more than one device connected to it. Guess I get what I paid for.",
        "Had some trouble getting online until I realized someone else in our apt. building was sitting on the same channel. Quick channel switch and everything went smoothly. Works fine with Macs and PCs. The range is much better than the (slightly) cheaper Netgear solution. Solid product. Only rant? Always could use a bit more range! ;)",
        "Sometwhere in these reviews I had read of a problem with the blue cables. After an hour of trying to set up my router, I remembered that I hooked up using the BLUE CABLE from my wired router! I hadn't realized that there was a difference in the types of cables. Thank you for the info...it saved me a lot of time! gl",
        "The router works fine but oddly only allows one wireless connection at a time. Upgrading the firmware failed so I returned the product. This is hardware from around 2004 so maybe this isn't surprising. Kudos to the vendor (lakeplacegames) for promptly issuing a refund.",
        "We have this router and 2 of the wireless usb connections too in my home. One is 2 levels below the router in the basement and has no problem. Unfort our network goes down for no understood reason about once every week or two and must be reset before everything goes back online. No idea why. Otherwise, this works very well.",
        "Worked well when up and running. I wouldn't be without it now. Startup was my first attempt at networking and cable modem/ hi speed access. Documentation seemed obtuse to me, but I am a novice at networking. Added the linksys cable modem and love both!!! John",
        "I had this router installed and running within 20 minutes. It works great with my desktop pc plugged directly into it, and I as well as my neighbors utilize the wireless connectivity it offers as well. No down time. Easy to configure. An awesome buy! I love this item! Not sure why everyone else had issues with it. I'm quite pleased.",
        "Simple Quick and Easy to use.. Half the time I forget it's there. A nice piece of equipment you will forget you own because you'll never need to look at it or touch it. I even went with the default config just to make it that much easier.. I just opened the box and added electricity.. DONE.",
        "Installed this along with a cable modem and hard wired one desktop and configured two laptops for wireless connection. Installation was easy and I was up and running in a few minutes. Don't have to be an engineer to get this installed and running. The wireless range is pretty good throughout the house. I am able to get a good signal upstairs with the router downstairs in the study. This is certainly a good addition to a home network.",
        "Very impressed with the ease of setup & the outstanding performance. In conjunction with the WPC11 Wireless PC Card, I had a Laptop with WIN2000 and a Desktop with WINMe sharing a high speed cable internet connection in about 2 hours -- with no prior networking experience. Built-in security protocols are a bit more complex to fully deploy, but even their default is far better protection than nothing at all (for an always-on internet connection).",
        "This product almost installed itself! Out of the box, a couple of simple connections, power it up, and voila! Clear, concise instructions, great on-line support for firmware upgrades.... I'm impressed. Thanks also to Amazon for the rapid shipping.",
        "I purchased the router and two instant wireless network PC cards after reading several positive reviews. I was up and ruuning in about 25 minutes. I have not tested the extreme limits with the laptops, however it works well anywhere in the house.",
        "I tried the cisco linksys router and found at first that the router didn't connect. Then after tinkering with it, I got it to work. However, with some computers the wired interface still didn't work right.",
        "This router arrived but was obviously used with signs of wear. It never worked. I spent many hours online researching its problems before it became clear it was a hardware problem... just plain sold me a broken unit.",
        "Now this to me is just a super deal. A new one for this price. I have had 2 of these over the years, and was, and am very pleased with the way they perform. Fast shipping also.",
        "You get more than you think. Since I have had the Linksys, my Norton Firewall program hasn't gone off once. It has great firewall protection and is upgrade flashable. I have NEVER once regretted buying the unit.",
        "I bought this to replace a Linksys router/firewall/switch that I have used for about 9 months - a device which worked great. However, this unit has been unusable. I have spent several futile hours trying to get the wireless working with my Wife's Compaq Wireless card. I am a Network Engineer and have setup 802.11b wireless equipment before. This unit simply does not work as advertised. Of course, Linksys tech support blamed the problem on the Compaq card. It also locks up for no apparent reason. I will be returning it. What a shame. If it did what is was supposed to do, it would a great product.",
        "I live in Bay Area California and have Earthlink DSL. Also used the Linksys PCMCIA wireless card for my laptop. Had it working in less than 25 minutes. The wireless signal strength is excellent inside the house, and adequate in the yard. Highly recomended.",
        "This router is from 2006. I was having trouble with the software and called Cisco and they told me from the model number it was old equipment and not supported anymore. I am shocked that Amazon would have this on their website for sell. I did return it and Amazon refunded the full amount including the shipping. Go to Ciscos web site to review the latest models.",
        "I ordered this when the D-LINK router I had kept having streaming buffering. Amazon sent it quickly, and it was a snap to get up and running. It has encryption, and no stream buffering!! There was a rebate coupon on the Internet as well, so net cost was VERY nice! Whatever model you get, get Linksys- friends and colleagues alike say it's the best, and this one is.",
        "Once I downgraded the firmware (came with 1.40.1 and download was 1.39.2) worked GREAT!! Good reception throughout my 1000 sq ft condo. Very cool to sit on my couch, laptop in hand with no cords/cables and be able to surf the net.",
        "good for home networking and wireless networks gave as a gift for some one not so computer literate as i am",
        "My room-mate had this up and running in 30 mins along with one PCI card and one PCMCIA card on the network. My only gripe is that it does not have a printer port and print server capability. I dropped it down 1 star for that.",
        "This unit is an old stand-by from the early days of wireless. Today's higher-end rates of transfer eclipse this unit, but it serves its simple purpose well.",
        "It stopped working at least once a day and had to be reset.",
        "This router is super easy to install - it literally took me 10 minutes to set my home network up, and it hasn't been down since (two weeks ago). I'll be getting a notebook soon to go along with my 2 desktops, so I havent used the WAP yet, but it's all ready and waiting!! ... this cant be beat - a must-have for any multiple-computer household.",
        "I order this but I have some problem with this, I have to reboot it every day, it is not steady and it was not the range it says it will be",
        "I had my wireless laptop, 2 hardwired desktop PC's and X-Box (bring on X-Box Live!!) up and running in less than 30 minutes. This product is great. Wireless range throughout my home was excellent. Read the instructions, and for most users you'll have no problems.",
        "I used Linksys USB connections to two laptops. I have one pc workstation directly connected. Performance has been fine throughout the house. Everything installed quickly and ran as expected. I have had to reset the router when all three PCs were in use at times, but this has not been a big problem. I was able to configure my firewall to protect all three PCs behind the firewall and share files and printing in my home lan.",
        "I own a G4 MAC and the Befw11S4 couldn't be easier to setup! Just follow the instructions. I own a 4000 square foot home the router is downstairs and the computer is in an upstairs bedroom and works great. I plan to install a second PC in my basement and this should be no problem. If you have a range problem verify that antenna is connected the airport card. This is an excellent router I would recommend it to anyone.",
        "I have tried a couple of other brands like D Link and Netgear. Linksys is by far the best when it comes to wirelress throughput. I upgraded the firmware to the latest and once or twice a month I had to reset/powercycle the router because the router freezes and the PCs lose connectivity. Then I decided to downgrade to 1.50.14 and I dont have the problem any more.",
        "Excellent product, no-brainer installation. Configuration is straightforward. With the latest firmware released on 6/2001, you have got 128-bit WEP support.",
        "Great for an apartment, or small area. Lasted a lil over a year before it started dropping wireless... typical of most wireless routers.",
        "Set it up and connected a wireless USB connector to my TIVO in under 10 minutes. Worked like a dream with little to no adieu. Dreamy.",
        "NO MORE CABLES! It was kind of hard to get this rolling at first but once I figured that I needed to set the WMP11 wireless PCI cards on \"AdHoc\" instead of \"Infrastructure\"...the computers in Network Neighborhood started popping up all over the place and everything came together just like when I had my hub and cables all over the floor...minus that old hub and cables :)...",
        "router connections to computer and internet is easy. what's not easy is finding the right codes and IP addresses for your setup.",
        "I was amazed with this product (actually I bought the ver 2.0). as soon as I plugged everything and turned on my laptop that has a lucent wireless card, like by magic everything was working without any setup or changes from my side. Really impressed ++++ I have a cable modem from time Warner (RCA Modem) and a laptop with a Lucent wireless pc card. Good product 02 thumbs-up...",
        "This is a great piece of hardware. I called tech support for assistance, they answered all of my questions. They stayed on the line to make sure that it worked just right.",
        "I use the router with a Comcast internet connection--I replaced an older version of the same item, but when I installed it, I kept losing connection after an hour or two. Called Linksys, got excellent support. Downloaded and installed new firmware. All is well.",
        "This router isn't bad if you don't use the wireless option or plan on using VPN. But if the wireless option is poor, save yourself some bucks and get the much cheaper non-wireless version. Basically, my beefs are as follows: 1. Wireless... very poor reception... unless you are working within 15-20 feet of the router. 2. Use with VPN... constantly loses your connection... doesn't help with productivity at all.",
        "Works flawlessly out of the box just as it should. I was up and networked with three computers in less than 1/2 hour. Two computers on XP one on ME. Great product.",
        "Great wireless router. It is used and in great shape and works fine. Thanks for a honest business deal",
        "Have had this router for over a year and am very satisfied with it. (My adult son also has one and likes his too.) It wasn't the nightmare to set- up that some people report. Used \"Network Magic\" program in the set-up procedure and was connected within a few minutes. Installed the Linksys WMP-11 PCI card in my wife's computer. She can now use the wireless connection to read her e-mail and play games while I am also on line. We have separate screen names on AOL. GREAT!!",
        "really great, I've had it constantly running 24/7 for three years, sure have to restart it ocasionally, but it's been running for three years straight and it's been working beautifully 99.9% of the time. You're cable service will screw up more often than this thing will.",
        "I wish I could give this zero stars! It is not worth even zero stars! This is a straight rip off, it does not work. Very poor of Amazon to allow this company to sell this on here. They sent me a used broken one that never worked. I ditched it and paid for an expensive one at radio shack and it hardly worked, so I gave up and got Verizon Fios and all my problems were instantly solved.",
        "Clearly, there is something flaky with the hardware in this thing if so many of us have to reset it all the time. I upgraded the firmware to the latest and it made no difference. If you buy one, it seems to be a crapshoot whether it will work or not.",
        "good router works great easy to set up If I needed another router I would definitely buy another",
        "I upgraded to this product from the Linksys standard (ie non wireless) router. The upgrade took only 5 minutes. However, be warned that initial configuration of a cable/dsl connection can be quite difficult.",
        "I buy a lot on Amazon. I review only the great disappointments. This purchase was one. It simply didn't work. I could ping the router for only a minute or two before the connection would die. If you cannot sustain a connection to the router, then you have no access to the network. . . . Plain bad. Avoid.",
        "I needed it, I bought it, it worked well,.. I've moved up in wireless speed. you should too",
        "Compared to today's rapid fire routers, it's rather stone age.",
        "This router is awesome. It is easy to install. It is like Install once and forget about it. No troubles till now.",
        "It's true I bought it used, so maybe that's why it works so bad, but maybe not. The only way to get a good signal from it is to be less than 10ft away. If I go into the other room, it drops in and out. I regret spending $30 on this POS.",
        "I got the item on time but it didn't work. I'm sending it back and want a refund.",
        "A bit of a reference. Good all-around Wi-Fi router, Linksys must have sold a ton of them, but it is now quite obsolete...",
        "i LOVE MY WIRELESS ROUTER. It is everything I could think it would be. Works good its small and I haven't had any problems getting it hooked up.",
        "This works great, i bought the USB adapter as well. It took me less than 10 minuts to set up. The only problem is when i move the router near the 900 MHZ phone it stops working. So ihvae to move it away (6 feet) away from the phone.",
        "Very simple to set up and after that it's totally effortless.",
        "This little unit works well in my small office space and generally throughout my home. Purchase was to provide a wireless connection for my laptop and this unit does just that and does it well.",
        "Excellent transmitter, good security, user friendly. Any problems have been with cable provider. regards Jim"
    ]
}