{
    "entity": "Routers",
    "text": [
        "So there's evidently a bug in the Marvel chipset that powers this router. If you hook up any recently patched Android device to this router wirelessly, you can expect your entire Wi-Fi network to come crashing down within a few hours. No client device should be able to bring down an entire network. The blame is squarely on Linksys and/or Marvel. It has been almost a month and still no fix. I am finding the fact that this still is not fixed unacceptable and I will be avoiding both company's products in the future as a result of this experience.",
        "I've always trusted Linksys, I have the WRT1900ac, and decided to get this for my office. I'm returning and changing to ASUS as this router stops broadcasting on 2.4 ghz and you have to continously reboot it. then the 5ghz wont let new users in when that happens to. so there you go, you are rebooting the router everyday to have it fixed.",
        "I bought this router because of its feature set, most important being that I could easily modify the firmware to include a Virtual Private Network (VPN). The router easily manages traffic from several computers in our home, some 24/7 server types, and heavy use desktops (I'm retired, but a computer nerd, and my wife is frequently streaming)... The VPN shows us popping up 1200 miles away, and having an encrypted path from the router to the VPN server makes me feel comfortable... The router just handles everything without a complaint, and the web-interface is easy to navigate",
        "You can flash this router with DD-WRT and configure NordVPN to secure your entire network with OpenVPN. Versitile, reliable and simple alteration of the router's internal code to provide a very economical alternative to expensive 'flash routers' that are taking the market by storm at hundreds of dollars eash. It really isn't hard to upgrade this router to modern network standards using open source programming. This must be one reason that Linksys keeps making this particular router more than a decade after it was originally introduced. For under $100 you can stack three of these for a bullet-proof tiered home or office wireless system with access for users of all levels of security. Thank you Linksys for continuing the WRT-54GL!",
        "Excellent router. It's rock solid just as a WRT router should be. I haven't reset it after initial configuration in the almost 4 months I've had it. I'm using the Linksys firmware and it works great. The phone app makes slight configuration changes very easy.",
        "I purchased this router about 6 months ago and it worked great until the recent firmware update. Now, my wifi goes down every 5 minutes and the only way to fix it is to reboot the whole thing. I've talked to Linksys support and they have just been telling me to change band channels, or turning the ipv6 off. And even then, that didn't fix the problem.",
        "I upgraded to the WRT AC3200 from Linksys WRT1200AC. After giving the basic Linksys router firmware a try for a couple days, I installed OpenWRT/LEDE because the Linksys firmware doesn't provide much in the way of advanced customization. I couldn't even use my own network domain with the basic firmware, but yet the firmware allowed for it to be set up as an OpenVPN server. Fortunately, the WRT AC3200 is well supported by OpenWRT/LEDE, DD-WRT, and other open source firmware, which is the point of this router. Installing OpenWRT was easy and it's vastly more customizable. The router provide excellent Wi-Fi coverage. I'm very satisfied with the WRT AC3200.",
        "Large house and the unit gives good coverage (though I also use an extender). Great speed. With ExpressVPN instructions, no problems in set-up or execution. So far, flawless wifi for our freshman-level \"smart\" house. No interruptions attributable to Lynksys, just boring, reliable, transparent wifi (even with 15 active drains on it during the holidays).",
        "I bought this router precisely to take advantage of the higher-speed wifi 5 GHz band. But that is exactly what I did not get. The higher frequency is higher energy. You should get better performance further away from the router than you get with the lower frequency (2.4 GHz ) speed. Instead, I got far worse connectivity. This has been true since I first installed the router two years ago. It is consistently unstable, unreliable, and just plain slow. The worst wireless router I've used in the past 10 years.",
        "EDIT: Bumping up the review for the customer service. The WRT AC3200 is still faulty, and should still not be purchased until fixed, but Linksys customer support sent another product that is working in the meantime. Within the last month, the router has had to be rebooted every hour to maintain functionality. There is an ongoing thread on the Linksys support site with no fixes as of yet. Steer clear of this product.",
        "If I would have known it was my linksys to start with I would have returned it. I didn’t find out from my internet provider until three service appointments from them. In the end they determined it was the router because when they unplug it, I get the expected signal. Huge disappointment because this router was supposed to be an upgrade from my previous one which was also a linksys. My old one worked fine till it just stopped working after three years. I figured if that one worked so well, why not pay more money and get an even better one. Totally hate it.",
        "Avoid this router at all costs. The 5GHz radio has constant instability issues where it turns off and requires a restart. Just go look at the Linksys forums and you'll see many people experiencing this issue for months now. Linksys doesn't seem able to fix this issue either. I can't believe I spent over $250 on this broken router. I will never buy another Linksys product again.",
        "Had problems with the setup wizard, I don't recommend using it. On boot up the wizard was trying to resolve an IP address (DHCP) on our STATIC corporate WAN link and it would never go past that step and allow me to change the settings. I eventually bricked it trying to do a factory reset. Tech support was great, they shipped a new one same day. Skipped the wizard this time and configured via the web interface, been running fine since. Have since installed OpenWRT firmware for root access which is why I picked this one in the first place and that image is working great so far also.",
        "Not the product for someone technically savvy. While the specs are great and promising, this product is not the flexible Linksys we know about and that reviewers are raving about. First, depending on an internet account with Linksys and on an active internet connectivity to be able to manage the device is against privacy. Second, lost of advanced featured and not visible to the web management interface, are they present at all? Lastly, this new version cannot be flashed with WRT at the moment of this review, this was the main reason for buying it...",
        "Literally. Something in it runs so hot it gives off a choking indescribable emission. Took me just long enough to figure out the choking miasma was coming from a new 250 dollar router of all things, that I missed the return period. Sux. So every time I come to my 700sqft office I have to open the door, open the windows, and turn on a fan blowing out the back window, then hang around outside for five minutes before I can use my office. REALLY!!??! Freaken Linksys-Orphan-We-don't-care-anymore-company! People, I implore you to stay away. Buy ASUS. I have to now go drop another $200+ just to get my office back.",
        "I have had this router for over a 1 year now and its been a great paper weight so far. First I was disappointed that there was no quick KRACK fix for it (and there still is none). Well, I thought let's switch to LEDE that has a fix, but that driver has other issues, namely ESP-based IoT devices do not connect to the router plus in my own experiments the driver was losing UDP packets much more often than expected. The LEDE driver also lacks MU-MIMO support. I regret that I did not send the router back while I still could.",
        "I bought it mostly because it's certificated and recommended by Express VPN. You need to flash Express firmware to use. Pretty simple. To my surprise, the product quality is very good. It's heavy and big. And WiFi signal is significantly better than my previous router. The user manual is very thoughtful. The designer has considered every details. Everything is good. I like it very much.",
        "Picked up this WRT AC3200 to replace my old netgear nighthawk and the difference is almost night and day. Signal range is vastly improved and speeds have improved as well. My old router was starting to drop wired connections and also slowed some wireless connections. The features of this router are much better too. Navigating through the router's web page is a breeze. Very happy with it so far. Just FYI, when you initially login to the router's webpage (192.168.1.1), the password is admin. Once you login you'll be able to change the password to whatever you choose.",
        "The router is very good, but strangely enough, (and this is the first time this has happened from Amazon), the router was fine, but the factory Linksys box was not sealed and there was no \"start-up\" disk or paperwork. I had to investigate online as to how to access this router without factory passcodes. Everything turned out well, but it was a first for this to happen to me with Amazon.",
        "You can't understand what the tech support people are saying partly because of the phone connection and the poor english. The router is not password protected so anyone driving by can use it . The CD does not help because it says it can not connect to the moden. .. Well there isn't a modem to connect to. I use fiber optic so there isn't a modem. The tech support people / connection quality is horrible and they put me on hold or basically gave up and blew me off. So unless you don't care about service and security. Buy at your own risk!",
        "I normally love Linksys but this unit was faulty. It would operate for about an hour then go completely dead-no wifi,no front panel lights,just dead. Did some googling and found that this model used to have a cooling fan but was omitted in later version .Unit overheats because of this. People would put s small fan under the unit to get it to work. Pretty sad.",
        "If you like insecure connections and a lack of user control this is your product. Currently this router, since its so insecure, has been converted and only used as an wireless access point. Their security is atrocious and regularly found unauthorized WAN traffic lurking on my network at home. UPDATE: Purchased a SOPHOS XG firewall and it is everything anyone would want in a firewall while being configured as an internet gateway. So much control and complete and total control of what is allowed on your network",
        "Okay this router has been the biggest mistake ever. Linksys used to be a good company I don't know what happened maybe I just got a lemon. If this thing gets put under any kind of load example someone downloading a file another person streaming a few tablets running. It will just reboot and this will happen randomly without warning a few times a day absolutely unusable.",
        "I’ll keep this short, the 5Ghz line worked great. The 2.4Ghz line would kick off all devices multiple times within a 24hr period. Thinking this product was defective, I returned one and ordered another to replace it. The exact same issue occurred. Consulting multiple Linksys forums expressed the opinion to basically “jailbreak” the router, which I refuse to do (it voids the warranty). Eventually, messing around with the DNS settings, the broadcast bandwidth and other options has managed to mitigate the problem, but this is a MAJOR problem with this router. Do not buy if you are not versed in router troubleshooting or are expecting a mainly “plug and play” router.",
        "Not disappointed by this router. I had the AC 1900 prior to this and went to this as I like to stay current on hardware. I have tried the other major brands and always recommend Linksys. It has not been without problem. But I contacted Linksys and they troubleshot the router with me to make sure things were as I said. They were and I had a new one on the way in just 2 days. Great product and Great customer service in my opinion.",
        "I bought this to replace my linksys e4200, as I was having issues where I would get temporary \"Not connected to internet\" error messages, that was very annoying. I initially bought a repeater, but that didn't help much, although it sped up the connection between drop outs. I no longer am experiencing the loss of connection with my new router. The reach doesn't seem much better than the e4200. I can get 50 Mbps at the far end of the house, with the use of a repeater, and140 Mbps plus next to the router--about 10-20% faster than the e4200.",
        "Terrible. If you haven't had the wifi issues, just wait. Linksys tech support determined that my router is defective and wants to give me another one. From what I've heard the replacements are no better. Good times. $226 with tax and shipping wasted. This thing needs to be recalled.",
        "A fantastic router. Handles the bandwidth really well. My router traffic is pretty high with at least 5 devices connected to it at any given time, of which 1 is constantly download large movie files, and another streaming Netflix. The other 3 devices are juggling between YouTube, Facebook, or browsing online stores or reading material online. There is never a lag. Everything works perfectly. There are times we also Skype or facetime with no drop in calls or quality. This was not possible before. I had to turn off the downloads to accommodate video calls etc. Highly recommend this router. It's super easy to manage and control. The app makes it easier to manage it too.",
        "As one of the last reviewers SAID, i should have listened. Wireless is useless and makes the router unusable. I got this router when i upgraded to gigabit internet.. LOL running my asus im getting 978mps while running this linksys i GET maybe 9-11 mps if i could connect.. Horrible product and linksys should return all of our money. PLEASE SAVE YOURSELF THE HASSLE AND DONT BUY.",
        "I thank Amazon's return policy for making this a lot easier. First, I ordered a Linksys 8300 and it would not power up. Zip nada. I returned it and ordered a WRT1900ac. That router lasted nearly 30 minutes before it powered itself off and would not reboot. I returned it and ordered another WRT1900ac. This one was the best of the lot. It lasted 40 minutes before it turned itself off and would not reboot. I returned this one too. I finally ordered a Synology 2600ac. Now folks the Synology 2600ac is one fine, fine router. Linksys has a big time quality problem. Big time.",
        "It's good, sometimes the network drops off or I have issues and have to reboot every so often. I did set it to use ddwrt prior to any support and had to do some flashing to get it to function again. Overall it's pretty good, can handle a lot of clients and with ddwrt capabilities you can really customize to your hearts content. I would take off a star for the times I have to reset it and another for the random times when I'm dropped or it stops functioning temporarily.",
        "The set up was difficult. The product would and would not recognize username and passwords, wouldn't allow access to the device through Linksyssmartwifi, through 192.168.1.1, etc. There are a series of problems encountered and recommended solutions listed by others available online, many issues like the ones I encountered. I finally gave up and returned the router. It shouldn't be that hard.",
        "This product installed easily and works wonderfully. Signal strength is good. So far, not a wink of problem or issues. Initially, I couldn't set it up well but, I discovered that it was my VPN on my cell phone. Once I turned it off, the system connected and set up like a breeze. To access the router program through your computer or cell phone app, you have to disable your VPN temporarily.",
        "Worked perfectly for 6 months. Now wifi drops out hourly and requires a reboot, while my wired connection to it is fine. Read the forums, there is no fix that Linksys will help you with. I wasted my money.",
        "I replaced a router in my home with this one and it was amazingly simple. I had purchased the \"gaming\" version of this router and realized that it didn't have parental controls so I sent it back and got this one. The speeds are super fast and now that it isn't clogged up with my kids tablets, I finally have the internet speeds I need and want. My kids have their own internet provider now ok their own router. I love this thing. Well worth the amount spent.",
        "Bought this to replace my 1900 series in April 2020. It is dropping the internet sometimes 5 times a day and really messes up all my smart devices. I have bought Linksys routers and switches for over 20 years, this is the first bad one I have bought. Looks like I will have to take a loss and buy a different brand. Avoid this router, I should have believed the reviews that said this router had problems. Customer service in nonexistent these days, so I didn't ever try.",
        "At first glance this looks like a great piece of Tech. Apparently when Belkin purchased LInksys quality control went out the window. Yes the device is easy to configure, but it failed within a month. Dealing with Linksys support is like doing to the dentist for a root canal without Novocaine. It's painful, very painful. I finally did get the device RMAd only to receive a second device that failed WITHIN HOURS. Now Linksys does not want to RMA the device - Do yourself a favor, buy a shovel instead and slap it against your face. It's less expensive, and in the end will cause you less pain.",
        "Don't waste your money! This router has the worst range out of any router I have owned, the speed on 2.4Ghz or 5Ghz is horrible, and I am not talking about Internet speeds, local area network only, testing between two local devices, 2.gGhz barely 5mbps, and 5Ghz 12mbps, and that is sitting withing 10 feet of the router. After 6 months, the thing completely died. Are you going to be without a router for weeks or months waiting on Linksys 1 year support to swap it out, especially when you rely on Internet for income? No, these warranties do not mean anything, and the manufacturer knows this.",
        "I could not get into the configuration. I called DLink and kept being told to find a jack in my house to plug into. I explained at least a dozen times that I can not take my system down while configuring the router. I need to configure before the internet connection. The response was always the same \"find a jack in the house to plug into\" . After running this loop a dozen times I got the tech to admit you can not get into the configuration unless connected to the internet. I returned the router.",
        "Don't waste your money on this useless device. I have to either reboot the device or go into the Linksys app on a computer connected to a LAN port to switch the WI-FI off then on again so my mobile devices can connect to it again. This used to happen very infrequently, then daily, now several times a day. Why should I have to load a custom firmware or have to factory reset the device to get it to work correctly?",
        "I bought this after a YouTuber suggested it. We have 100 mbps with 4 people in our home. I work from home and my 2 kids can still stream wtfe they want without FINALLY me screaming “get off the WiFi!” This has made our kingdom a bit more peaceful. I’m also able to get reception out in our pole barn which is 100 feet from the unit, and our unit is in a farmhouse (plaster walls/lead paint) .. seriously this thing is the best!",
        "So far so good. I had the WRT1900acs. This wasn’t a significant improvement over that, but it is still an improvement and a solid product. Didn’t get much signal increase, but the connections are stable. I really like the Linksys interface and app. Allows you to do a lot of admin functions. Seems to run a little hot, so keep it in a fairly cool location. True test will be when I get fiber to the house. We’ll see how it performs then!",
        "This router came well recommended. It was easy to set up. The WiFi range is about average compared to other routers I have used. I have had little trouble with it. I have an Xbox connected to the router, and opening up port 53 as Microsoft recommends breaks internet connectivity across all devices for some reason. Linksys replied to just leave port 53 closed rather than give an actual answer. (I have always had port 53 open on all routers in the past without issue.) I bypassed this by putting the console into the DMZ, but I would have preferred just opening the required ports. Otherwise I have had no issues.",
        "I have been an IT professional for over 18 years. This wireless router has hardware issues, and you should not purchase it. Wireless worked well for about a month, then started having random drops. The drops started getting longer and more frequent, to where now the wireless is pretty much useless. I have updated the firmware multiple times and even went to DD-WRT instead of the factory management interface. Nothing has changed the issue, which means it has something to do with the hardware they used or the design of it.",
        "Had to find a router that would work with my existing outdoor antenna. This one works great. Live chatted with a tech, supposedly, at Linksys and he could not tell me what the connections were for the antennas and finally told me that they were not detachable. Lol! Anyway I made a call the next day to Linksys and talked to a live person that gave me what the connections were. It is a great router. I have used Linksys for years and they have worked fine.",
        "The wireless on this router could not be configured to go to the internet despite a firmware update and multiple reboots. The only access to the internet was via the ethernet ports but that speed was poor. The router was paired with a new Arris surfboard S86190 modem and connected to Comcast cable service. When I re-installed an existing Linksys WRT1200AC router with the new Arris modem, internet and wireless service was restored and worked well. I concluded that this router was defective and returned it.",
        "My main intention was to use this router for its open source friendliness. I realized though that the native firmware provides a lot of functionality and it's remote management by mobile feature allows me to control family access from wherever I am. I also purchased the extended range antennas and now i have zero blind spots at home and my Wifi coverage is excellent.",
        "Can routers wear out? Oh yeah. Has router technology improved? Oh yeah!! I bought this to replace a Linksys router from 2003. My bandwidth had grown painfully slow. With this new AC1900 my speed on a LAN cable exploded from 12Mbps to 110 Mbps, and on wireless it shot from 7Mbps to 50Mbps. Signal is good and strong in rooms at the far end of my house, even on the other side of a brick fireplace. Whatever the bandwidth is from your internet provided, this router will maximize it for you. Setup was easy. I prefer to use the router's built-in configuration interface, reachable via LAN cable by pointing a web browser at 192.168.1.1.",
        "Needed more reliable wifi in lower level. This was an excellent solution for both wifi and Ethernet connection. Current cable router did not produce a good signal downstairs. While having walls open I took advantage using this Linksys WRT AC3200 Dual-Band Open Source Router. I ran Ethernet from my cable router down stair directly into the input on the back of this router and then cable from router to each room. Setting up the router & wifi was really easy. Now I have dual option even accessing lower level from upstairs with no loss of signal. It's a bit more costly, however worth the quality.",
        "Item just didn't fit well on our home network. LAN seemed slower than the cheaper TP-Link we had. WiFi gltchy for internet radios and other WiFi devices. Not good for gaming unless you prioritize the computer being used for gaming. Didn't have to do that with TP LINK...buying the less expensive $89.99 TP link to replace this waste of money Linksys.",
        "I bought this not realizing the limitations of broadband G. So if you only need basic home wireless without the demands of several hi-def devices sucking up bandwidth, then I guess it's okay for your needs. I wound up getting an A-C router that was much more in line with my needs, but this one works for what it was designed for I guess.",
        "I had a Linksys WRT 1900 ACS, it worked beautifully. Never had a single issue. But I wanted faster internal network speed, so I upgraded to this router. Terrible mistake. Sometimes the wifi appears to be up (lights flashing, etc), but nothing can connect, other times the 2.4GHz or 5GHz band will just drop completely, without warning and for no reason. I'll be forced to reboot the router (literally unplug it and plug it back in) to correct it. This thing is a piece of junk, buy something else unless you want constant network headaches.",
        "UPDATE There was a firmware release and now my wifi keeps dropping and Linksys support are no help at all. I have reset the unit, reloaded firmware and still the same issue. Rubbish product and terrible support The setup is extremely easy and i was up and running within a few minutes. The firmware upgrade is a must but once installed, I have had now issues for a few weeks now. 2.4Ghz signal goes a long way and is very stable in areas were my previous router didn't even reach. 5Ghz signal is very good close to the router but going further away it becomes less prominent. All in all, brilliant router and does everything i need",
        "I bought this router a couple months ago. I installed i my home, and then my Roku's started to fail to connect frequently. I thought it was a Roku issue, so I contacted their support who recommended trying different channels. I tried that, but no luck. It appears the issue is with this expensive Linksys router. I have never paid over $200 for a router before, but because I wanted to stream I went for what I thought would be a good router. However, it is making my Rokus not work, so it is worthless to me. And of course it is now to late to return or get support from Linksys. I am just screwed by a bad device.",
        "I'm going to keep this short and to the point. I ordered what I thought was a brand new router. I tried to gain access with the Linksys ip address. I tried and tried, but to no avail was I getting through. I decided to ask my IT friend to look at it and guess what he discovered? The router I got had another ip address installed! This was a used router! I was so pissed! I feel like sending it back, but I don't trust the company that sent it.",
        "This thing is no joke man, Its a beast in every way, it makes my old router look like a toy. For such a high quality product the setup was easy and straight forward. All the interfaces were user friendly and the mobile app is super convenient for monitoring traffic. I'm glad I updated I am finally getting my 120Mbps download my ISP kept telling me I should be getting! I couldn't be happier.",
        "I am not sure I have ever written a one-star review, but I've honestly had it with this router. This is the second unit I've purchased. It is no longer available new (or at least I couldn't find one at the time) and I purchased a refurbished unit and loaded the Gargoyle OpenWRT firmware on it, but it crashed constantly. I couldn't save the settings. Then I got a used unit and the power input is faulty. I you simply brush against the power cord, the thing reboots. Incredibly aggravating.",
        "So far this router is working for me (WRT54GL), however there are some things I would change, if I could. I wanted a Linux based router because I hate Micro$oft, and I didn't want a router based on another OS. I don't do gaming or other intense work, so this router works for my needs. What I don't like is that the interface is ASP, so I still have to deal with microcrap. I would rather it have a simple Java based UI. I haven't hacked it, and don't intend to, as long as it does it's job, and keeps me connected, that's all I care about.",
        "The product works as it should. I have run into compatibility issues with my cable companies modems. They had to install a special brand of modem to communicate with this router. Otherwise I have had no issues",
        "I purchased a wrt3200 last summer and have it running wrt-3200 I bought a second wrt3200 and find it is no longer compatible with dd-wrt Linksys modified a component in the wrt3200 sometime last fall but did not revise the model number. The newer wrt3200's are NOT OPEN SOURCE READY AND CAN NOT BE MADE READY (BUT STILL RETAIN THE ORIGINAL VERSION NUMBER) See DD-WRT forum for details. You can not install dd-wrt on the newer production run and have no way of knowing if it is early production (compatible) or newer (incompatible) They advertise the wrt3200 as being \"open source ready for dd-wrt. IT IS NOT. BUYER BEWARE.",
        "I rarely write a review but this needs a consumer warning. The LinkSys WRT1900ACS is Great Router for a few hours and then it dies Within 24 hours only the power and the SAT light would display. I tried to power cycle through to get it working. I tried the reset and was willing to setup the router again. Nothing worked. I could connect through the LAN port but the Linksys smart WIFI site couldn't see my router. It is not a simple effort to get this thing running again. It was easier to return it for a refund. Avoid Linksys, they are not the company they use to be.",
        "Didn't last 3 months & spent 3 1/2 hours on the phone with them to get it replaced. No luck, wanted us to go through technical support which we did & still wouldn't replace it. wanted us to go through technical support a second time, For what? It doesn't work! So now we are unable to return or exchange this item.",
        "An amazing router with incredible WiFi range. I eliminated all but one range extender, the one in the garage, in a 2600 sq. ft. Home. That’s very impressive. I really like the fact that this router is DD-WRT ready and am looking forward to upgrading from the stock Linksys firmware that’s pre-installed. The fact that it does not already have the DD-WRT firmware installed is why I gave this device four stars instead of five. I think that Linksys should offer this with different firmware options. Overall, it’s the best router I have ever owned! I really do like this router a lot!",
        "I bought this in January of 2018 and it worked well enough. Spotty parental controls, barebones configuration options and so on. However, there has been 1 firmware update in almost 2 years. Since I've upgraded my internet service, it reboots multiple times per day as well. It's the device that becomes unresponsive and not the Internet connection itself. It's frustrating to spend a fair chunk of change on a device and it not be updated/improved on in 2 years.",
        "After using this router for a year, the LEDs on the front panel have dimmed so much that they don’t even look like they are on. Internet search shows many people have the same problem. Linksys is fully aware of the problem and that there is a hardware issue, which is what they told me over the phone but do nothing to rectify it. They did offer me $20 dollars off of a newer model router but I refused. I spent well over $200 for this model 2 years ago and now it is pretty much junk.",
        "***Update 8/3/18*** A couple of issues came up. 1) AT&T DSL modems do not support full bridge mode. A “poor man’s bridge” will have to be used. 2) OpenWRT’s firmware won’t flash over wifi, but there’s no ethernet port on my laptop. To be continued. ***Original post starts here*** This thing was up and running in a matter of minutes cascaded with AT&T’s DSL modem (Uverse). However, the real challenge is yet to come. This was purchased with the intent to install OpenWRT, which will help in hosting multiple home servers. Cascaded setups won’t work for home servers. This post will be updated accordingly.",
        "Great router, amazing range and great speed. The only reason for not being a 5 star review is because the parental controls does not work (known issue) and Linksys/Belkin has not fixed it. The newer model (WRT3200ACM) has firmware issues making it spotty in both wired and wireless connections. So this one is a better choice and a known good unit. I run an IT business and I have i stalled more than 10 of these units without a single issue. In some larger places, I have installed two of them, the second one in bridge mode, so it is only an access point and does not route in that case. Works great that way as well.",
        "The WRT3200ACM is easy to setup and configure through the Linksys smart WiFi utility as well as the Linksys app. I had good performance for several months, but recently I have been dropping both 2.4GHz and 5 GHz connections and have had to restart the router multiple at least once every day. Hopefully this is only a firmware problem that can be fixed, but currently I would not recommend buying this router. At over $200 I would not expect to be having such problems.",
        "I performed a substantial amount of research before deciding to buy this router and I am please to say I am not disappointed. The router is for home use and I have a \"ton\" of devices connect at once. This router has no issues handling the large work load I put on it. I really like how configurabe it is. The app allows you to see all devices connected between 5 and 2.4 GHz with some controllability. In all, we'll worth the money!",
        "5Ghz has been fine but started losing 2.4Ghz signal after 1-yr of use ... not just dropped signal or bad WiFi throughput, the 2.4Ghz turns completely off. Why is this significant? A lot of smart home devices (thermostat, smart plugs, security cams, etc) only work on 2.4 GHz signal. Tried latest firmware, rolling back firmware, factory resets ... all failed to resolve. It’ll work after a reboot/restart, but only lasts a couple days until another reboot is required. Linksys support says, “Sorry, out of warranty” ... BUT they do offer “expert” tech support at additional cost with no guarantee to fix or replace.",
        "Linksys has not updated this flagship router in over a year, 1/16/18. This router is still vulnerable to KRACK which is unacceptable for security support. Known issues all over web, just search. If I could, I'd get my money back. DD-WRT is the only viable solution which consumes time for long term support.",
        "Disconnects from wifi all the time and there is nothing you can do about it. Tried third party firmware with no help. Tried just about everything known to man google searching and everyone is having the same issues. These should not be sold at all. Talking to a guy at work he was having the same issues, come to find out he owns the same router as this one... What are the odds on that. Thank goodness I was able to return this. I don't understand how linksys missed the boat so bad on this one. The WRT54GL is great and still running for me using tomato firmware.",
        "Right out of the box the wifi would only work for a minute or two and then I’d have to reboot it. Installed the latest firmware. No help. Contacted tech support and when they called me back the line was silent for a while and then they disconnected. DON’T BUY THIS ROUTER!!! I would have had better luck spending my money on two soup cans and a string. Returning it tomorrow.",
        "Mine came with stock linksys firmware but was easy enough to flash with DD-WRT. Once flashed it took less than 5 minutes to enable IP over USB and setup a home wifi network. This lets me use an Iphone plugged in via USB to the router to provide internet to the whole house through the Iphones unlimited data tethering plan. The range is not great so I will have to get another one and make a wireless bridge to cover the house and maybe a third to bridge over to the shop.",
        "There is a lot of wifi equipment in our home and recently we had a whole bunch of relatives come and stay with us for a week. I knew they would be bringing all manner of tablets and phones and I had never been very pleased with the router I had so I decided to upgrade. I have over 200Mb coming into the house and I wanted to be sure everyone had access. I installed this router and no one had any issues even with MANY devices being used simultaneously.",
        "I purchased this as an upgrade for the WiFi features. The most used devices on our LAN stream local media from our server sometimes with a pause or lags. Using the media prioritization settings, the improvement is remarkable, even with large H 265 files there are no issues. The only con, not related to the router, is no availability of the matching Linksys SE4008 WRT Switch.",
        "I bought this and flashed it with DD-WRT to have a private wifi network. This was the only way for me to connect my smart devices to the internet as the school used a PEAP wifi system that is incompatible with most if not all iOT devices... After installing the device and setting it up i was able to broadcast a WPA2 network from the ethernet port in my room. Do not expect any kind of high speed wifi from this but it is perfect for smart home applications.",
        "Getting this baby to run the ExpressVPN firmware (which was the main reason for the purchase) took me all of 20 minutes. It was as easy as getting into the web interface, downloading the ExpressVPN firmware, and flashing it. It works, has been on for the last 2-3 weeks (haven't had to reboot it even once), and my speed remains almost as fast as without a VPN service using my Orbi RBK53 system. Great work, Linksys, I'm a very happy owner of this WRT32X.",
        "This router is very expensive and unreliable. I do not recommend it. It only works for about 30 mins or so and drops connection until you reset it. I contacted Linskys but I didn't get any help. It seems to be an issue with a recent firmware update.",
        "Linksys is NOT the same company it used to be. A very bad preforming router with exceptional poor customer service. Buy another brand.",
        "Installed my WRT AC3200 about a month ago, and the 'Network Map', which is supposed to show currently connected devices, is consistently out of date by at least 6 hours. It's a bit disappointing to see devices listed as 'connected' when you know they're physically dozens of miles away. There is a IP listed for those devices, but no returned ping. The 'Clear Network Map' command does not help. The 'Refresh' command fixes the problem, but reboots the whole modem. The same faulty data is reported under Troubleshooting -> Status -> Devices. Running current firmware as of this writing, 1.0.6.186.168. I am not confusing this with the DHCP lease table. I'm considering updating the firmware to Gargoyle.",
        "Was looking for a new router with good range. This one appeared on most everyone's recommended list. Hooked it up with little difficulty. It worked for about 20 minutes. Then I had to do a hard reboot to get it running again. Worked for about another 5 minutes and then had to reboot it again. Had to do this every 5-10 minutes. Rechecked all connections, wires, and set up. Nothing out of the ordinary. After 2 hours of having to continually reboot it I decided it wasn't going to work properly and returned it. Would not recommend this product to anyone.",
        "I bought this specifically to take advantage of custom firmware because it’s stated that it is built for it. Unfortunately I found as soon as you loaded any custom firmware many 2.4GHz devices were no longer connect to it. Especially when it comes to older smart home Wi-Fi outlets etc. I also found that even without any customizations the 5 GHz Wi-Fi band would periodically simply turn off. I ended up returning this item for a refund.",
        "Set up router today. Had a bit of trouble. The reset instructions in the manual were wrong. Had to hold for 30sec. The accent of the support person was a bit hard to understand on a cell phone. The router works as expected. Has GUI setup that is easy for me. Will update if I have problems. I plan on switching to WRT firmware in the future. Will run Linksys firmware for a while to test the hardware.",
        "I bought this to replace my existing Linksys EA6900, I was hoping to get better coverage to all devices on my network, and I liked the idea of using open source software on the router to avoid buying additional hardware-based UTM solutions. The signal is so strong that I no longer need a repeater to cover my 4 BR apt. Setting up open source UTM software Untangled was very simple, and gave immediate protection to my home network. This really is a fantastic router!!",
        "avoid this, as it has the same firmware issue as the ac2600. can't login locally or remotely after running for a while. incorrectly states that there is no internet connection (wrong). I have reached out to link sys and maybe this time they will take interest and fix it. lots of negatives on this same problem for most all the \"smart\" products they have (that don't work). update: even though linksys is aware of this problem from other reviewers, they have no clue how to fix it. serious concern if you want to rely on local or remote access to your router. you'll likely have to reset this and they won't fix it (or can't).",
        "I am giving it 5 stars because it delivered on exactly what I was looking for in a router. I have recently switched to streaming TV (4 TV's) so I needed to upgrade my old Linksys router which by no means was designed to handle the load of a big 2 story house with up to 15 devices connected to it 90% of the time. MUMIMO really works! Very easy to install just like any Linksys router just download the same app. I have a 400Mbps connection and running a speed test on the 5GHz band gave me 300Mbps download speed which I think is very good. I recommend positioning the antennas perpendicularly for strongest all around signal.",
        "I purchased this router based on the reviews read here to replace a Linksys WRT400N. The WRT54GL is an older model with an allegedly slower platform. However, this router is not only more reliable than the one it replaced, it has greater range, and the buffers are shorter. So, yes, I am happy with my newly acquired Linksys WRT54GL router. It was easy to connect. It works great. It didn't get the fifth star because I would have liked dual frequency to separate general wireless from HD TV streaming...but so far no problem.",
        "The setup was wonderful. Everything is working fine. The only issue I have is the lack of info explaining the functions of the unit. I don't know how to control the 2.4 or 5 GB functions. I am simply operating the unit and have no idea if I'm doing it correctly.",
        "II bought this new. Sometimes it provides internet, sometimes it doesn't I went back to my 10 year old Cisco valet router. I don't know how this even made it out of QC testing. Last Linksys product I ever touch.",
        "Despite the tech being ancient as far as tech goes, this router is a tried and true reliable product. It is totally compatible with DD-WRT which allows you full, unrestricted control of your router. I cannot vouch for the router firmware that is preinstalled as I flashed DD-WRT immediately. If you want to take advantage of dual band 5Ghz, or need speeds above 54Mbps, this doesn't have it, so go with a newer version of this router. For those with DSL (or slower) in apartments or small homes, save the money and go with this.",
        "Having the option for two channels is nice. The setup process was fairly easy and the WebUI is extremely nice and straight-forward to navigate. I haven't had any issues with this router yet. I get great WiFi reception anywhere in my two story home, and haven't had any connectivity issues with 2-4 wired devices and 5-8 wireless devices connected simultaneously.",
        "I'm assuming most of the complaints here involve the stock firmware. As the specs indicate, this is a Linux compatible router so I would definitely insist everyone install some kind of open-source Linux-based firmware. I'm not too much help here because I bought this specifically for OpenWRT. I am using OpenWRT 15.05 (Shelby trunk snapshot) and it kicks ass. Its installation requires you to loosely know how to do command-line network admin stuff in order to get your user-friendly GUI up, but the setup won't take more than 20 minutes and your wi-fi network will be rock solid.",
        "Pros: It still works fine after two years. Can load 3rd party firmware. It is very stable with DD-WRT firmware. Cons: Router was not stable after allowing the router to upgrade the Linksys firmware. The LEDS eventually get so dim that they can hardly be seen anymore. I was expecting the same quality as the old Linksys WRT54G routers. Not sure if any router manufacturer expects you to keep your router for longer than a couple of years.",
        "1) I bought this because it was described as having great range, but it doesn't. Range is no better than with the standard router that comes with Spectrum internet service - maybe 25 feet. 2) \"Quick Start\" setup didn't work. I had to connect using an Ethernet cable and do a manual setup. 3) It does function ok if one ignores the limited range and challenging setup, but so would an entry-level unit at 1/3 the cost. 4) I returned the unit. As always, thank you Amazon for great service.",
        "Nothing but trouble from the very start, I when to the web site to download the firm wear which is a pile of horse hockey,why it wasn't done at the factory is just stupid. Turned out the firmware was the wrong one despite the fact that the website affirmed it was the correct one , I had to do a factory reset and once I found the correct firmware install it now half of my devices can't see the five gigahertz side of the router",
        "It’s been fairly adequate although we have noticed a lot of devices that we were previously able to connect to WiFi no longer will. Mostly smart TVs, our all in one copy/printer/fax machine. All stopped being able to connect once we switched over units. But I’ve since hardwired the all in one and have amazon fire sticks hooked up to the other smart TVs, so it really hasn’t affected us.",
        "When the router was working...it worked well. However, both WiFi bands (2.4 and 5 GHz) rarely worked at the same time. Half the time when they did work together, they would randomly not accept the correct password to gain access to connect to it. The only way to fix this issue was to reset it and start it back up. I had to reset this router weekly to keep it working in the beginning. After merely 3 weeks, it had progressively gotten worse requiring a reset almost every other day. Unfortunately for me, I kept this product just past the eligible refund timeline. Please don't make my same mistake. Don't waste your money.",
        "Durable and great performing router for the price. This router is fully compatible with OpenWrt but the user will have to do a little more tinkering outside of just flashing the OpenWrt image. On performance, I get full 5GHz bars on two entire floors of an old wooden three story house and full connectivity inside and outside of said house. Outside of the house I get connectivity up to a 50 foot radius.",
        "Much like so many others, I too agree that this is an expensive, awesome WiFi device until it’s not. The constant loss of connection, incessant reboots and lack of predictability is cause for extreme concern and frustration. It’s made more difficult by the fact that so many devices won’t even allow hard wiring anymore within another device for connectivity. Mine lasted 3.5 years which is more than most can say. But as so many people are at home now, this adds to the frustration."
    ]
}