{
    "entity": "Routers",
    "text": [
        "Previously used a d-link 624, which worked well with all my devices but had limited range. Bought this based on reviews here as having good range (mimo), which it did, even with channel bonding turned off (so as not to clobber everything for my neighbors). Unfortunately, it had serious incompatibility problems. Would not maintain connection (WPA/WPA2 TKIP+AES) with PlayStation 3 or with my Cingular 8525 (HTC tytn), and had intermittent problems with my toshiba tecra M5 and dell m700, both with internal wireless mini-pci cards (not sure which chipsets). Returned it. Bought a buffalo WHR-HP-G54 instead and everything works great.",
        "got it a week back. works as well as stated. excellent range. dosent drop signals and very fast. Also easy to set up and configure. Overall an excellant purchase I am giving an update to my earlier review. This thing stopped working after a month. It just froze up and wont respond to anything (not even unplugging it). You cannot change the subnet address which restricts remote access when using a VPN connection. Customer service kept me on hold for ever and then had my call dropped. Terrible waste of money. Avoid at all cost Now if only there is some way to change my initial 4 star rating to a 1 star ...",
        "I highly recommend this router. Although set up was a bit difficult for me and required Linksys tech support to deal with set up problems. I will say my experience with Linksys tech support ( from India) was helpful and solved my problem. The problem was this router needed a firmware update. I was experiencing connectivity issues with my DSL provider. Once I received the firmware update I was good to go! I have been using this router for the last 3 1/2 months and have had no issues. I highly recommend this product!",
        "I bought this router because I was looking to improve the distance and signal in the large house I was renting. I didn't notice much of an improvement with the non SRX400 enhanced cards that I had in my laptops. But when I bought the card, it made all the difference. Works great! Improved the signal and performance significantly. Update: This product worked well at first but did not last long (about a year) before I started having problems and bought a new and different model.",
        "I read the horror stories as well as positive reviews. Ordered it after Christmas 2006 and received it soon after. Following others' recommendations, I brought it up to current firmware level as the first step. Everything has worked as advertised - WPA encryption, wired, wireless, MAC filtering, etc. This is my first wireless router. There's just one gotcha. Do NOT access the router via a browser while you have active sessions. When I have an active VPN session and save a change, the VPN session dies and must be restarted. Restrict changes to periods when no one is accessing the internet or your home network. Otherwise, range and speed are quite adequate.",
        "While the range is slightly better (the equivalent of an extra room in a house), this router is very unreliable. It starts dropping connections probably 2 times a week, usually power off and power on will fix it, but some times that doesn't even work for an hour or so. I've tried upgrading to the latest firmware 1.00.17 and hard reseting, but it's still has problems. You can do a search on the web for similar issues. I don't know if it's Cisco buying them or if Linksys is going downhill permanently, but even though I was totally satisfied with a previous wireless and wired router I won't be purchasing from Linksys again.",
        "This thing is absolutely one smokin' piece of equipment. With my old wireless router I was lucky to get 24 MIPS with fair strength. I put this system in along with the new PCI card and now am getting 108 MIPS wall to wall. My XPS Dells (tower and laptop) are pure screaming demons. This is the biggest bang for the buck I have ever experienced in my long computer experience. Rock on with LinkSys.... they hit the mark with this one.",
        "This router works as advertised. To date I have found this unit to provide the greatest wireless range over other routers that I have used. Out of the box it does have a tendency to drop connections after several hours. This problem is quickly remedied by a firmware upgrade. Good choice for the money.",
        "Unfortunately I received a defective unit and after spending endless hours with Linksys technical support, which incidentally is very good, the diagnosis was that it was not working properly and the drop rate was to high. I returned it for a full refund and ordered a D-Link 655.",
        "I just installed the Linksys WRT54GX4 Wireless-G Broadband Router with SRX400 and it provides a great connection throughout my house. The router is installed in my office on the ground floor, and I am getting 246 mb of speed upstairs and downstairs, about 70 feet away from the router. Amazon's pricing and free shipping really made this a great deal.",
        "For everyday web browsing this router is good enough. I have 2 of these routers and both have performed flawlessly (so far at least). I use one as the main wireless router, and I extend the range of the wifi signal with the 2nd router connected to the main wireless router via ethernet cable. So far I haven't had any problems with this setup. I've also been using this setup with Power over Ethernet (POE) with no problems. I was able to get a wireless signal about 40ft through 2 concrete walls with water piping, electrical cables, and insulation. Software is easy to setup.",
        "have to say this product really made my life easier!! i live in the city on the 5th floor in my bldg. i recently built an enclosed music studio in my garage space...installed this product and the LINKSYS WMP54GX IEEE 802.11b/g PCI Wireless-G Adapter with SRX adapter and life is good!!! 4 outta 5 bars for signal strength all day long with no dropped signals from 5 floors away!! took me a minute to dial in the right security to work with my ISP but once that was done i have not looked back. life as a musician in an apt has not looked better!!LOL",
        "I am a computer service engineer and I have setup a few of the Linksys WRT54GX4 for my clients, they are easy to install. One of my client has an 7500 square feet home, they can access wireless network anywhere in the house, even in their yards. Make sure you setup WEP and give it a passphrase, or even use MAC access list, or else your neighbors will be on your network in no time.",
        "I have used the router for about a month and was really easy to set-up. Setting up Mac filtering was easy and all the other security features. The only problem with it is when you first start you computer it keeps dropping and reconnecting to the laptop, especially if you more than one wireless connection. There might be a fix for this but I haven't found it yet. I have updated to the latest firmware version, but it doesn't seem to help.",
        "Easy set up on an XP system, Sees and connects to XP laptops and Xbox. I however purchaces an HP 9000 series Vista Home with a built in wireless and that machine connects but looses the conection many times a day. To get the connection back the HP has to be restarted. I feel that has to do with the wireless installed in the computer rather than the WRT54GX4. HP so far has been horrible to get help from. As far as my other units this seems to be the best router I have used.",
        "First one quite after more than 10 years of constant use, it would be great should make it wotk with the faster 1000 hertz range.",
        "It's a good unit but sometimes the signal will be lost on my notebook. I don't know why but i have to unplug the power and it will be fine again. It's quite easy to setup if you know a little about networking. Overall, it's a 85 out of 100.",
        "Have worked with many Linksys and D-Link routers, and this is still one of the best. I have owned four of these for years, and they stay connected for many months without dropping packets or needing a reboot. Fast throughput, and many configuration options -- for example, low/medium/high density wifi area which helps prevent packet drops.",
        "The specs indicate that this is just about the fastest wireless router now available. Called Linksys when I had trouble in the setup. Wait on hold was tolerable. Got a tech who was intelligent and helpful. He suggested that I simply connect the wireless router to my D-Link cable router that I use for my desktop so that the wireless is for the notebook. It took some time, but we got the router up and running. I then asked, \"What about encription?\" He then helped me setup encription. While I cannot measure the router performance now that it is running, I rate the support as about as good as you can get. I subsequently purchased a Linksys wifi finder.",
        "I had to contact Linksys support to help set up which is a tedious process, howver once the ituation was escalated, I got support from real techies, it took a couple of setting canges, but finally it works like a dream - I have the laptop card to match.",
        "After much effort to get this installed and working, it works marginally at best. Technical support was and is also marginal, handicapped perhaps by English being a second language. I was naive and thought I could get the kinks worked out, and by doing so, missed the window to return it. I am glad other buyers have had good luck with the product, wish I would have.",
        "I have a network and two desktop computers wired to to this router and a wireless laptop. Great speed and connection yet!",
        "I think my SSID is seen across the county. At the time, IMHO, this was the best wireless router available.",
        "Got it today and it was a snap to setup and so far my wife loves it.Did not slow down my computer and the laptop is working great. Check this one out if you need a router",
        "Slim, great price, better than any product I researched in office supply stores or PC stores. I highly recommend this product. I can use my laptop anyhere in the house and in my backyard.",
        "It was easy to setup and install . Had it up and running in about 10 mins",
        "Easy setup, customer support walked me thru the part I had no clue about. No where on my property is without the INTERNET now! Fast and STRONG signal. Windows reports EXCELLENT signal strength every where I go with this unit. I LOVE IT!",
        "I got it working few minutes after installation. I couldn't be happier.",
        "the wireless did not work before I upgraded the lastest firmware. After the firmware upgraded. the wireless worked for a day then it drop the connection every 5 minutes. I you want to reset the router every fine minutes, you can buy this junk.",
        "This p.o.s. gave trouble from the moment I took it out of the box. I updated the firmware, I updated my nic drivers and wlan drivers. I moved it to different positions in the room (and then house). I experimented with various settings (encryption levels, etc). Bottom line: It bricks after a few minutes no matter what. So what? Everyone knows Linksys firmwares are buggy as hell. Well here comes the kicker: You **CANNOT** put dd-wrt or other third party firmware on this router. None of them support the chipset. Buy the WRT54GL and know peace. Until the linux firmware hackers start supporting this it's really pointless to buy. Don't say you weren't warned.",
        "Connected 24 hours a day at 108 Mbps and never kicked off the network. (I have a wireless network adaptor with SRX, so I see a 2x speed boost from the typical 54 Mbps). Range is great. Sometimes use the laptop 3 to 4 rooms away or outside and still see same great speed and connectivity. The WEP encryption is easy to set up following the installation CD. If you have the latest Norton antivirus on your computer, you need to set it to allow connection to the router. This is easily done, but necessary. Otherwise, Norton will disable the network kicking you and all other users off the network. Highly recommend this product.",
        "Update: After using this for a while, I noticed that the router keeps dropping the laptop wireless connection for no reason. I tried the latest firmware upates and all of the tech support recommended tweaks to the settings. I tried changing to new channels, disabling certain features, just about everything you can imagine. Nothing worked to keep this router from dropping the connection. It seems that when Cisco technology merged with Linksys technolgy, new bugs were introduced. I am getting rid of this one and going back to the classic blue WRT54GL. Reliability is most important.",
        "I bought this wireless router about six months ago and have had stability problems with it since then. The unit keeps disconnecting from my DSL modem. The DSL line almost never goes down so the problem is with the router. I have called tech support, read all the FAQs and tried all the fixes with no success. I replaced a Netgear router for which I only paid $30 six years ago and I wish I had it back. Avoid this unit...",
        "I've had my router about a month now, and I love it. At the farthest point from the router, I still have a 5 bar signal and I don't notice any reduction in speed from my wired ethernet. I did have some problems staying connected to the internet at first, but then I upgraded the firmware and I have been connected for 14 days with no interruption. This product is awesome, and I highly recommend it.",
        "This Linksys WRT54GX4 router has certainly lived up to expectations and I now get excellent signal strength all through the house. The house is built with brick internal walls, and in the living room, through at least three walls the communication is excelent. I replaced a Dlink WiFi G router because it had a very poor range. Setup was easy, (caveat: I had set up previous Linksys routers and the menu is the same). One small annoyance, I use WEP and Linksys only supports HEX. This makes it harder to remember the password than ASCII (as most users I prefer easy to remember passwords).",
        "After about 4 months of sporadic problems, I've given up and gone to Netgear's MIMO. This device has been problematic every time the power was recycled. I've done complete resets using the reset button on the back (10 seconds) and the wireless, DHCP just don't work anymore. Can't even access the web based administration page using the 192.168.1.1 address. When it worked range was good, but I have to recomend the Netgear at this point. [...]",
        "Great speed and range, but you'll probably need time with tech support to get this going -- and the quality of the support team expertise varies quite a bit. My modem and this router had an IP address conflict and I wouldn't have known what to do without Linksys tech support -- Randy in the Philippines, who was absolutely terrific. The online setup tool was no help in this situation. My wife's 2005 laptop [w/out SRX 400 card] is getting 54 Mbps upstairs pretty consistently -- it's dropped to 24 Mbps briefly but generally has been fine. Highly recommended, but do not expect to get auto-configure plug-n-play out of the box.",
        "I bought this router to set up a wireless network at a summer camp in an upstate New York. It was easy to configure out of the box and gave us astonishing range... at 200 yards through full-growth trees and leaves I was still 1t 60% and even able to disconnect and reconnect with no problem. I definitely recommend this product.",
        "Pros: Was able to quickly setup the device and enable the WPA security features. Web interface was clean and easy to use. Cons: Device has to be reset regularly to re-enable wireless connectivity for wireless clients. Yellow plastic covering used to label the ethernet ports prevents the network cables from \"latching\" properly. I am hopeful that the wireless reliability will be fixed in firmware updates, currently using Firmware Release Version 1.00.10 released on 11/21/2005.",
        "Easy to install, I did have trouble getting the computer to see the new item, but it was my computer being the problem I feel. I did while trying to figure this out use their so called \"24 hour tech support\" line. I got thru the first line of operators no problem, but when they were sending me to another operator and I believe I was gonna have to wait forever to contact them, so after 30 minutes on the phone I gave up.",
        "I needed to extend the range of my wireless router. I was using a linksys wireless b router. So I purchased a Linksys High Gain Antenna Kit for TNC Connectors HGA7T which was suppose to boost signal. It seemed to boost signal inbound, but didn't do much of anything for outgoing signal (nothing i could detect anyways) so I returned it. I purchased this WRT54GX4 and hooked it up. I'm laying across the house in bed right now and it is working great. I have almost full signal whereas before I had little to none. I'm extremely happy with this product and would purchase it again.",
        "I've used a number of routers trying to find one that works like it claims to. Well I have found it! the Linksys WRT54GX4 not only added 150ft to my distance, it has taken out those dead spots or poor signal in my house on the second floor, those areas now have excellent strength, and when you pair it with other GX4 products from Linksys the Mimo technology kicks in and your speed and volume/Bandwith will increase if not double. this router is advanced, but dont let that scare you away, if you want to make one purchase this is it",
        "I tried allot of different routers and returned 2 others to best buy before buying this one Ive had it for about 1 year now and it is awesome no matter ho many pcs I have in my house ( I now have 5 and 1 laptop) it works great I could not begin to tell you what a difference it has made in surfing as well as transferring files. I can also pick up the signal across the street at the park were I stream music to my PSP when sitting with my kids playing Ive actually been looking for a second one to extend my range.",
        "Great router, easy to configure. Range is not as great as I thought. I have a 4800 sqft house and after about 2000ft I get 45% signal. Works good though and I would recomend it to anyone looking for a great router. Also have 4 plugs in the back to hard wire anything next to the router. Makes it very handy.",
        "PRO: Works excellent as a host to one of my clients (LinkSys WAP54G with DD-WRT v.24). Signal strength at 75 feet (through 4 walls) is consistently between (-60) down to (-65). Speed Rate has never dropped below (40 Mbps). CON: Slightly Expensive compared to other Mfg's for comparable spec's. Poor utility firmware. No 3rd party firmware support as of now (to my knowledge). All in all, unit is a sound performer as is. My Other Units: LinkSys - (1)WRT54GS, (1)WRT54GL, (1)WRT54G, (2)WAP54G, & (1)WPC54GS Buffalo - (1)WHR-G125 & (1)WHRG54S",
        "I bought this router after reading about MIMO technology and all that claiming that it provides better siganl quality and greater coverage area. It didn't notice much difference compared to my old beat up D-Link DI-514 router for which I paid 9.99. I was looking for a router that would actually give better signal qulaity and strength and also my old router was lacking WPA and WPA2 security. Besides the security aspect it didn't seem to offer a big advantage in terms of signal quality and/or strength.",
        "The router is easy to setup, has loads and loads of features if you're a techie, and has excellent bandwidth and range. What more could you possibly ask for - well it ain't free that's for sure. I've setup quite a few routers in my lifetime, hardware as well as software ones, and at this price and performance, I'd very well recommend this for use in professional settings.",
        "I bought this router and since day one I had problems in accessing the configurations through the web utility. Linksys support's suggestions didn't work. I researched the problem and noticed that a lot of other people were having issues in accessing the router configurations through the web utilitiy. I problably had a faulty router to begin with. Anyhow I send it back for a refund.",
        "I read many reviews about the Linksys srx400, and was a little worried. I shouldn't have been. This is my 3rd Linksys router I have owned, and every one of them, including this worked like a charm. Right out of the box, I had this up and running on my wireless network in less than 10 minutes. No glitches. No dropped signals. Just a beautiful router. And it definitely has increased the distance that I can operate under. Don't listen to the people complaining about this. This router works as advertised. By the way, I also bought a laptop card (linksy srx 400) and it too worked like a charm right out of the box.",
        "I'm never buying from Linksys again. My friend and I both had the WRT54GX4, and both of our routers stopped working after some storms we have in our area. Mind you, just the wireless stopped working. A direct line to it is fine. Seems Linksys didn't make this product very well as it is sensitive to power surges. And yes, both of us use decent surge protectors.",
        "The Linksys SRX400 router has great range and is stronger than any other router in its class that I've seen. Its downfall is the firmware and code running the machine. Full of bugs and ridden with errors. Linksys may have released this product in a rush to be first out with this MIMO implementation but it did so at at the cost of quality control - in my opinion. It feels like the product is a beta/prototype and not a finished product. I would recommend anybody considering this product to sit tight and weight for the next major release of the firmware prior to purchasing.",
        "Setting this up was a pain. Had to call customer service, who were very friendly in helping resolve the issue. Needed to do a few hard resets. Seems its a known issue with the SRX400. Range is definitely better than my previous Linksys, although not too sure about the strength of the signal. Overall, a good buy especially considering that the new Pre-N technology has a long way to go before being widely accepted/used.",
        "I am very satisfied with the service and the product, I ever had any experience wireless and took me little longer to setup, but after this, is great, now I can have internet acess wireless on any room of my apartment, I will extend my connect to my brother's apartment with high gain antenna. I surely recommend to buy on Amazon and recommend this product. Thanks.",
        "This rocks over my DELL wireless router by far. The set-up was simple and my range went from 38% to 78% at the far end of the house. SWEET!!!!!!",
        "I probably should have gone with an older model. This models drops the wireless connection every 30 minutes (up from 12 minutes before we turned off IEEE 802.1X authentication). I wish the problems were catastrophic - try getting support for something that \"kinda works\".",
        "I have a basic knowledge of networking and I found this router to be just what I was looking for. The CD that came with the router did not work in the initial set up, but I called their 1-800 number and their tech support was fantastic. The walked me through every step of the installation; they are very knowledgable and courteous. My house is 2300sqf and I don't have any dead spots. I higly recommend this device.",
        "It was an easy and clean install. I did need to download the firmware update to stabilize the network, but it has been flawless ever since. My wife can now use her laptop out in her detached office, and the whole rest of the house is covered by a strong signal as well. This was a good deal.",
        "Short and Sweet...This is a GREAT wireless router. Set up was a breeze, in under 10 mins I had mine up and running. The best part, my signal strength increased dramatically.",
        "This product does not earn a rating. I purchased two new units and experienced identical problems with connections dropped every few minutes. Two different IT professionals could not make it work. The Linsys Tech assistance, although courteous could not help. Shame on Linsys for marketing such merchandise.",
        "For the early adopter, this device is full of promise. One bug to be aware of: The Micrsoft XBOX 360 wireless adapter (USB) is not currently supported by linksys firmware version 1.00.10. Cisco and Linksys are likely to remedy this problem shortly, but as it stands there is no work around.",
        "Got the new SRX400 router and matching laptop card for Christmas. Had a defective install CD, but was able to download and updated version off the Linksys website. Range and speed is soooo much better than the Wireless B with Booster that I had previously. Have had no problems.",
        "Purchased this along with a new Linksys WPC54GX4 adapter (the latest from Linksys). The installation was easy. And most important the combination reached areas in my home that my old router could not even come close to. In fact I can now go to the barn (200ft away) and go on line. This new MIMO technology is great.",
        "I purchased this product for it's long signal range support. it works fine within my house, no matter where I am. the signals are normally from good to excellent, covering the dead spots too.",
        "light weight, small good range, fast speed. most important very easy to setup.....",
        "Excellent router with lots of options. I have purchased two and one was DOA but NewEgg took it back so no worries. I definitely recommend it.",
        "delivers on the range and speed it promises, until about 5 minutes after you connect to it. Then the speed drops to 5.5mbps and everything slows to a crawl, even the router firmware itself.",
        "I thought this was new, but was actually refurbished and it arrived defective. I believe the sender is going to charge me shipping or some sort of fee. I think this is totally preposterous and unfounded. I would never buy from this seller again. Thank you, Bernard",
        "THE RANGE OF THIS ROUTER WAS SEVERAL TIMES FURTHUR THAN ANYTHING I HAVE TRIED BEFORE. I WOULD BUY THIS PRODUCT AGAIN. .. DICK",
        "Very easy to set up for a first timer and works great. I would recommend this product very highly.",
        "So a friend of mine purchased this product and I was there while he was trying to setup the darn thing. The stupid WAN port was cut too small. A STANDARD RJ-45 ETHERNET JACK DOES NOT FIT. This product screams returns and recall!!!",
        "This router increased my signal over 40% I have no problems anywhere in my house and constantly get a great signal...I highly recomend this product",
        "Nice router! Easy to set-up and it works great. The reasonable price was just a bonus. I recommend this router.",
        "Mine would drop all wireless packets after being on for about an hour. This behavior started immediately out of the box. I suspect the unit must have been defective, but I asked for a return not an exchange.",
        "Great solid wireless box! I was able to increase my wireless coverage error with no packet loss.",
        "I got this router and am very pleased with the ease of set-up and the quality of performance.",
        "It's very easy to install and very good !!! It's a good purchase .",
        "Im using this item for 1month... So far so good... Long Wireless signal...Fast speed...Im feeling satisfied....",
        "Great router! It was a snap to setup, install, and run! Highly recommend it. Linksys tech-support is great. A monkey can install this thing. Note: I didn't mention a Caveman. Look what happened to Geico when they did.",
        "Short and sweet: It works great, and with Vonage - once you update the firmware to .17. Say no more.",
        "The router did not work! Linksys tech support is awful and a waste of time! DO NOT BUY THIS PRODUCT!!!",
        "Have had experience with several wrt54g flavors by linksys, all are problematic. Do not, repeat, do not buy a linksys wireless router!!! They are poorly made and the firmware is poorly programmed. They constantly drop their IP address, constantly drop their wireless signal. In short, don't bother! Netgear is probably a better choice. But we'll see about that.",
        "I've just bought a new WRT54GX4 and I must say, it is working just fine for us.."
    ]
}