{
    "entity": "CD & DVD Drives",
    "text": [
        "This is a good entry level CD-RW device. I plugged it into my WinXP box, and that was all I had to do to install it. I'm using Nero to burn CDs, and it works nicely. The speed is not fast at all (4x), but not too bad. (If you are looking for speed, you should check the USB 2.0 or Firewire devices with at least 10x). Bottom line, reliable and easy to use entry level CD-RW.",
        "This item arrived dead on arrival. Seller has not responded to my emails. DO NOT BUY FROM THIS SELLER.",
        "My unit worked fine initially, and then stopped writing on most commercial discs. The first response from their so-called support group took three days by e-mail. They offered suggested corrections one at a time, with additional delays before offering the next step. Phone help is not available except during working hours. It took over a week to get instructions which could have been sent initially, none of which worked. After all that they said another unit would be sent at an indefinite time in the future. That was twelve days ago, and I've heard nothing since.",
        "I bought this to use to help me burn important data off my laptop when I am on the go. This was the cheapest and easy. The other reason that I bought it was the fact that I have bought IOMEGA products in the past an was impressed with thier service and lifespan. The device is real easy to setup and break down and doesn't really take up that much space when you are sitting in a hotel room or in a conference center. The only down side is all the wires involved.",
        "While not a computer expert I have been involved with PC's since the Commadore 64. I have installed hard drives, memory, scanners, read only CD's. in several systems. Software installation was a piece of cake but when it came to writting a CD it was a gigantic PITA. Data underrun errors nearly everytime. I tried to write ~200 MB to a disk and it would hang up with no error message. Would have to cold boot. I managed to ruin 5 RW disks and got 1 disk to write after hrs. of rebooting. I sent this lemon back after two days of fustration. Would not recommend to anyone. Running Win 98 with 64MB.",
        "I bought this drive only because it was Win/Mac compatible. But When I actually tried to install the driver/software, I realized that this drive is not compatible with OS X. I went to their website, but the driver was not available for OS X. What I like about it is that it doesn't take up much space. It's not the fastest CD burner on the market, but I don't burn 20 CDs a day and this is good enough. I hope they will come up with OS X driver soon.",
        "As with other reviewers, I have experienced numerous problems with this drive. At least 1/3 of all attempts result in ruined disks. I cannot use any other program while burning (and must kill all background processes). I can only use blanks made by certain manufacturers (expensive 'name-brand' only) and frequently the disks cannot be read by friends' CD players. As reported by others, Iomega support were of no help whatsovever.",
        "I was excited when I bought this, I was expecting IOMEGA to come out with another great product, but they didnt do so well on this one. Sure, it works.... It burns CD's, BUT the drive has bugs, it acts strange, doesnt want to read blank CD's, and gets VERY hot during use. The software package that it comes with is less than perfect, although it is usable. I have had better luck with IOMEGAs other drive, and with drives from other manufacturers.",
        "Ok, I don't have this exact model. But I had a discontinued Iomega 4x4x6 external CD-RW and it broke after about six months and was generally not good quality. I do give it 2 stars because it was decent when it was working and did set up okay. Problems seem really common with Iomega; I would not buy another Iomega item unless there was a very compelling reason. I had an internal Iomega Zip drive and that broke too. Iomega has real quality control problems and appears to be willing to release products before they are proven to be reliable. Because of Iomega's particularly bad record with external CD-RW's, I would be HIGHLY hesitant to get this specific device.",
        "Yes,it loooks good, but it just doesn't work. I've lost over 10 blank CDs, over 6 hours ( with the \"help\" of Iomega's customer service), and still couldn't make it work. Customer service tried to blame the media I bought (they didn't have anything else to say,i guess...) If you don't have a monge's patience spend your money with another product.",
        "I bought the Predator drive and regret not reading the reviews on Amazon.com! Initially, the drive burned CD's just fine. I used the drive for 6 months before I encountered the same problems of not recognizing blank CDR's, buffer underruns, system freezes, etc. I updated the firmware as instructed by Iomega to no avail. I've tried running the drive under different OS's and hardware. I even upgraded the software(Hotburn). Those of you who haven't encountered problems (yet) are just lucky. I'm no novice and you can trust all the other reviews including this one, DON'T FORK OUT YOUR HARD EARNED DOUGH FOR THIS DRIVE. Regards.",
        "After following the easy to understand directions for assembly and operation, I was well on my way to burning a CD. This drive is not only visually pleasing, it is easy to use and works great. It is a very good enhancement for my iMac. I definitely recommend it.",
        "I just got this item yesterday and, I've already burned several CDs. It was easy to set up, included softwares are intuitive & easy to use. In addition, the writer looks awesome. I was even hynotized by that thing on top of the writer for a few seconds. :) However, I do have one question though. Does anyone know what this file \"PowerReg SchedulerV2\" do in my startup folder? It was there after I installed the writer. I emailed Iomega & heard back from them within 24 but the tech support said he had no idea. spacemonkey148@netscape.net",
        "Your review was very helpful. I am in the market for a CD-RW and have been looking at the options for use with my new iMac. You said that the USB interface is modular with the Predator, and that if you upgrade to a machine with firewire, you could upgrade the interface. I have firewire now, does this mean that I could choose to use a firewire interface with this drive? Also I think that Toast will allow you to set your cache buffer up to 4 times the write speed, to avoid the underruns. You can also get a little help by increasing the RAM allotment to Toast.",
        "This piece of junk has been a problem ever since I purchased it. I have been able to burn a total of 4 cd's with it and when I complain to Iomega I get no response. I upgraded to Win XP at home and find that the software does not work with XP, and that it will cost me $50 to get new software that will make it work. I finally sppend the $50 and it still does not work and Iomega still refuses to respond. The only thing I get is on their junk email list. In my opinion Iomega Sucks, and I will never purchase another Iomega product",
        "I was a little nervous about buying this cd writer because it looked so cool, and I had such a lousy experiance with the last one I bought from a different company. I am glad to say that this is a pretty good burner... It worked a lot better than the last one did and it was definately worth the money. Do not buy any of the HP burners.. you will be glad you didn't.",
        "Last year I bought from dabs.com the said ext CDRW, initially I've had no probs & thought it great.Once one learns to burn music at the slowest speed. Now though I'm going through backup of backups of CDR discs as well the drive's conflicting with the PC ie causing it to freeze. Iomega support are no help, to them their drives are perfect, it's the PC's fault. I think not. The moral is DON'T BUY IOMEGA....",
        "Software loaded just fine but, I never got the item to power up. looks very cheaply made. I don't know if the power supply is bad or what? The led lights wouldn't come on and I couldn't get the unit to power up. what's up with the stupid connected module in the back? No phone support on off hours, so I boxed it up and sent it back. Now I'm looking at a yamaha internal instead.",
        "I have had this burner for a year and I have NO problems with it. Yes it is not super fast, it is 4x, but it is good for a USB port. I burn about 10 CDs a week and it has never given me any problems. I made a great purchase and this burner is so much better than the HP USB CD burner. Definitely a great purchase!",
        "I had a PII 266 Windows 2000 system when I purchased this drive and 90% of the CDs I burned turned out to be coasters. I then bought my PowerBook and it's been working flawlessly with my Mac and OS X. I'm now looking for the firewire adaptor for this drive, but I haven't been able to find anyone that sells it.",
        "This is a poorly made product and has been nothing but a headache. As another reviewer indicated, I made a lot of coasters.",
        "I had it up and running in minutes, and with the exception of a minor glitch recognizing mp3 files (roxio's website had the fix) it works great and I've burned 4 discs so far today.",
        "I've owned 4 of these predator drives. They are poor quality. I've had nothing but problems with them. Replaced 3 times by Iomega under warranty, and the 3rd replacement (4th drive total) broke. I finally wrote off my losses and bought a Creative SB1394, and it's a flawless piece of equipment.",
        "This device does work with ME. It shipped with version 2.0 of Iomega's software. You will need to have them send you version 2.8. 2.8 contains the drivers for ZipCD but they work fine with the predator.",
        "Great buy -it does all you ask it to - maybe a little slower than a Firewire model would do. Now I can store all my photos and files I don't use very much and my HD has room to breath again.",
        "I love this drive. Easy to use, and easy to carry around. Ive only had 1 buffer underrun out of the tons of CD's ive burned and it does [take]up my laptops battery power like crazy when the laptops not on the adapter but all in all im pleased with this drive!",
        "This has been nothing but trouble! It does not recognize any media I try to use and the tech support is useless. I have wasted HOURS trying to get this thing to work. I really wish I had bought something else! This unit is [bad]!",
        "The product is not only worthless, so are the costumer service and tech departments at Iomega. I have spent several months and over three hours on the phone with these incompetent rejects. I wouldn't dare buy anything else from this joke of a company. If you do, good luck!!",
        "Absolutly DO NOT BUY this drive I bought it and it didin't work so I sent it back to iomega and they gave me a new one and that one didin't work either. Do your self A favor AND DON\"T BUY THIS DRIVE",
        "I also found the tech support nice, but it has never worked consistantly. Tons of coasters!"
    ]
}