{
    "entity": "CD & DVD Drives",
    "text": [
        "I should have realized that inexpensive = cheap. From the moment I began to set it up there were problems. The menus aren't intuitive, the hardware doesn't work properly and is not solidly built, the software doesn't work properly... even the 'uninstaller' didn't work. And that was all on a brand-new Dell computer which had ZERO problems before I added this item. Pay more and be happy. I'll be returning mine tomorrow.",
        "Since the day I've bought this device I was not able to make a single CD. I've been in contact with Iomega technical support first via email (took weeks) and then on the phone (available weekdays only from 9 to 5!). I've received numerous (sometimes conflicting) advises from Iomega technical support personal. None of the solutions led to a satisfactory outcome. The device ruined dozens of blank CDs. If you have a Toshiba laptop DO NOT buy this device. It took 6 months to find out that this device is not compatible with Toshiba laptops (the problem is the USB driver made by NEC used on some Toshiba computers). However, Iomega CD-RWs work well with Mac computers.",
        "I opened the box, followed the instructions, got it installed, and then backed up over 300 meg in My Documents and over 400 meg in my Outlook.PST. No gliches. Everything worked fine the first try. I love it. It is sooooo... much easier to get files backed up this way -- rather than using the 100 meg Zip disks. Only drawbacks are it's big, ugly, and slow (compared to the internal drives) -- but it is easy to install. And I needed something simple and reliable.",
        "To put it simply, this thing is junk,I was using it to burn mp3s I downloaded from the net.First I bought a spool of 50 cd-rws, at least 30 of them were coasters.Iomega said it was the cds I was using ( great excuse, blaming blank cds).As of today I have tried 5 differnt brands of blanks,none of which can be reconized by the burner,it just keeps saying \"insert a recordable cd\" when there is one in the drive.Right now my two sons are smashing this burner in the yard with baseball bats,I wish the C.E.O. of Iomgea was out there also.DO NOT BUY THIS BURNER, YOU WILL BE SORRY!!!",
        "... I've had mine for about a year and all I did was plug it in, connect to a USB port, install the software - Make Discs. I haven't even read the instructions, why should I, it works! It's been used for classical music and datafile backup and it works great for all of them. When it comes to some of the more rabid naysayers in reviews I always wonder if their problems could be traced back to User Error?",
        "This unit works fine with my Dell system, occasional glitches aside. The adaptec software is good enough, though the labling programs need work. They frequently re-arrange text after you get it the way you want it. Very frustrating. Aside from that the CDs have come out flawless every time. Note, I have only used it for music.",
        "This is a very good CD-RW drive. I've used it for a while now and it works flawlessly on EVERY CD. The software included is a bit clumsy, but this can simply be fixed by getting good software. (Free off of the Internet.) When I hooked it up to an old 300Mhz K6 it had a bit of trouble burning at 4x but worked great at 2x. It burns at full speed on my 1.3 gig Athlon. In spite of the other reviews, it works fine on my friends 800Mhz laptop. This drive is worth every dollar and more.",
        "The device does what it is supposed to do, but the size should be smaller to make it easy to take on trips. I had some (easily solvable, but still..) problems with the USB connection of another device when I installed the CD-RW on my laptop.",
        "I purchased the Iomega External CD-RW drive about two months ago and like it as much or better than a faster top-of-the line internal drive I'd purchased earlier. The Iomega's speed is more than adequate--it works quickly and flawlessly. The USB port plug-in makes it easy to install (I installed it in five minutes with no problems). It certainly has my recommendation! I'm going to purchase two more as Christmas gifts!",
        "I recieved this drive as a gift Christmas 2001. Right off, burning CD's turned out to be a huge hassle as I had to \"coaster\" about half of the 50 or so CD's I attempted to burn in the first month. As it was pretty much the burner I was stuck with, I kept it, only to have it [fail]me by September 2002. Go with another brand.",
        "My Toshiba Satellite lap top would not recognize this Iomega CD-RW. After several weeks of trouble shooting with the tech support they finally sent me a new USB cable; but my computer still was unable to recoginze this CD-RW. After all this time spent trouble shooting and waiting for a new cable, finally, someone at tech support admitted that this Iomega unit is not compatible with Toshiba Satellite units. [....] Buyer be ware, John",
        "I was able to use my Iomega RW drive for a few months after I bought it. Then, one day, it would not recognize the drive. I have uninstalled and reinstalled many, many times and it still will not work. I have not been able to get any help from Iomega support. Also, sometimes the door to the drive would not open. I wish I had looked at the reviews before I bought it.",
        "I like this Cd ReWriter very much! The software is very compatable with my Macintosh and it works very quickly to make copies of all my software. Music takes some time, but music isn't what I burn a lot of cd's for. If you're looking for a good recorder to make back ups or save files, pictures, or artwork, this is a good burner for the money!",
        "I bought a Iomega Predator but had to return it. Neither me nor a friend could get it working properly. We tried it on two different laptops and usind Win Me and Win 2000. Iomega has a very good customer service website but their people couldn't help.",
        "I was pretty happy with this unit. However, after around one year and two months it wouldn't start anymore. I expected more durability for [the moeny]. I don't think I'll waste my money with IOMEGA again.",
        "Get this burner! I love it. I burned so many cd's on it and never had a problem with it. It takes about 15 minutes but whatever it's great. Get this burner and you'll never have a problem with it!",
        "I picked this up today and I love it! Got home and made one 23 track CD in 30 min. Not the fastest but hey, it works. I would recomend this to anyone. I have a laptop and I use it! It's the Greatest!"
    ]
}