{
    "entity": "Cutting Boards",
    "text": [
        "Yes, this product costs more than a basic board. The reason being this is not a basic board. I've needed a board with more area for some time so decided to treat myself with this chopping block. It's thick without being too heavy. I'm not sure if I'd be able to manage a solid wood block of this size as easily as this product. It will take me a bit of getting used to since this is my first \"block\" style board and it raises the cutting surface quite a bit up. I've included pictures of the underside and also of the side with measurement since it is not on the page currently.",
        "Ergonomically designed for people like myself with back problems. Alleviates strain and I LOVE this product. It is heavy, but of excellent quality.",
        "the first few months we’re driving me crazy because the board would wobble after each use, but learned that I need to use A LOT of oil and it helps control that. Make sure to pick up a few bottles. Once it’s well-oiled, it works well.",
        "I've used this cutting board, daily, for over a year now. This was a Christmas present to myself last year and I knew as soon as I opened the box that I would love it. It was beautiful, and sturdy, and really a piece of kitchen art ... after a year it continues to be beautiful and sturdy and an amazing surface to do prep work on. Yes, you will get knife marks on it but that does not detract from the beauty of the bamboo! I bought the board for use, not display, so marks just add to the character IMO.",
        "Beautiful piece. Haven't used it much yet, but so far it holds up well. I Havent noticed and knife marks. Easy to clean. I did oil it well several times before using it.",
        "there are non skid pads on the bottom of the legs to keep the board from slipping. This is made very well",
        "Excellent heavy duty product. Rugged construction and the skid proof feet are just what I needed to keep it stable on our granite counter. Also, it is very attractive. This thing looks like it could last forever, but I would definitely buy it again if I had to.",
        "Bought this along with new knifes for my wife for Christmas. She spent weeks trying to guess what it was. It's big and very heavy; make sure you measure space where you want to use it. I don't know anything about cutting boards other than she wanted bamboo. I read what seemed like hundreds of reviews on Amazon and learned that the heavier the board (thicker) the better the review. My original goal of $30 eventually ended up here...oops...but she was ecstatic and the board looks great sitting on the island.",
        "I bought this board to go along with my Island Cart with the Stainless Steel Top. This is a Huge Board! The board is used daily and has provided me with hours of satisfied use. It cleans up easily and is easy to maintain. The shear weight of the board along with the feet keep the board steady and in place. I am very happy and recommend this cutting board. Just check the measurements to make sure you have space!",
        "Clean by hand Avoid poultry and fish because bamboo holds and slightly absorbs",
        "loooooovvvee this cutting board, great quality, barely any cuts in the board after using for a month. Easy to wash. Love using the three bowls while chopping ingredients",
        "LOVE this cutting board! I actually use it to put my big crock pot on to protect my quartz countertops. It keeps the counter top nice and cool and it is really pretty! Just as pictured.",
        "This is the second one of these that I have bought, the first was a gift several years ago and it is still in use. This one is for me because I got jealous of the person I bought the gift for...don't judge. I'm looking forward to using it for a long while to come.",
        "When this cutting board arrived I took it out of its box, placed it over my stove top, laid my head on it and laughed from sheer joy. It covers the top of my stove exactly. The wood is beautiful and warm. I got mine late November/early December, and I use if everyday at least once, and it still looks new. It is easy to clean. p.s. I only use mine to cut fruits or veggies....we are vegetarian. Edit: It is Dec. 2012. I still own and love this cutting board. I'm thinking it will be the only one I'll ever have to purchase.",
        "I'm tall and do lots of veg prep...the height is a plus. Excellent quality and durability.",
        "Good shape, right height, hollow, not too heavy, doesn't scratch or scar easily. Space underneath to store knives and stuff.",
        "Love love love this cutting board! Very well made and looks very cool on my countertop! I’m using the recommended mineral oil on it and I know this board will be a part of my kitchen for years to come! Very nice!",
        "Well made, attractive and very useful. Raises chopping surface for comfortable prep area. Could use cut-out area on side to facilitate easier transfer to plate or bowl but very nice.",
        "We've had this for almost 3 years and it still looks great. I use Snow River Wood Oil on it and after it's oiled, you would never know it's that old. I do not cut meat on it...I use a plastic board that can go in the dishwasher. Just makes me feel better, but I think others could cut meat on it and be happy w/ proformance. Nothing stains it that I've found.",
        "Bought for vacation condo. Like it so much it is going home with me. It is easy to clean and very sturdy. Sits up so you can wipe unwanted items right into garbage disposal.",
        "Huge, well made cutting board. It comes VERY dry and needs mineral oil. Lots of it. It's also a little softer than I thought it would be. Knife marks quickly. Very heavy. Looks great.",
        "It's perfect for cutting and chopping. It does'nt slide and is easy to clean.",
        "Great cutting board! But difficult to wash due to the large size.",
        "Big. Bad. Bamboo. I love this cutting board! It was just what my kitchen needed.",
        "Really enjoy this kitchen piece; nicely made and i used and continue to use Mineral Bee wood conditioner made by Wood from The Hood and it bee very good!",
        "I bought this cutting board a while back and just love it. It stays permanently on my counter. I might as well throw out the rest of my cutting boards. I never use them.",
        "Although a bit expensive - worth every penny. Had two of those for a couple years - much better than the cheap ones.",
        "Spent a lot of time researching a large bamboo cutting board-and this one is well worth the money. The finish on it is incredible, the three little 'catching' containers are of a small but decent size. Just remember to frequently mineral oil it in the first few months (especially up here where we have very dry winters)...",
        "Big beefy board.........looks great, easy to clean albeit a little heavy for the lady of the house. You can cut a lot of veggies on this Baby!",
        "I don't think I will use the prep bowls much, but the cutting board is awesome and just the right side to do lots of prepping. A great buy too, at least $50.00 more elsewhere",
        "Beautiful made, large counter cutting board, quality is top notch, heavy duty looks great",
        "My wife absolutely loves this cutting board! Looks fantastic and well built!",
        "Cutting Board holds up well. We use it often. It is just the right size and thickness. Not too many better Boards out there. You will not be disappointed.",
        "This best cutting board on earth. I give it often as gifts. When I hear a friend in my kitchen say under their breath \"wow this is so great\", I know what their next gift will be.",
        "Totally strong and well constructed! It's actually a little bigger than I would have liked......my fault.....the dimensions were in the description! However, it is embraced right next to my kitchen sink and is working out beautifully!",
        "I received this today. Just like all the reviews stated. BIG , well made looks great on my island. Hope it hold up.",
        "Best cutting board hands down. We love the size and for a tall person it is nice to have the extra height of the cutting board. Wouldn't change a thing and I'm thinking of getting a second one.",
        "I like that it is bamboo, but you need to season it, as with any type of board I think. The containers are why I bought this board. I am always chopping and I like the size of this board.",
        "We have enjoyed using this board daily for 2-years now. Not a single complaint, seems to minimize knife dulling. Highly recommended.",
        "The legs broke off and I had to glue them back together. They probably won't last very long because of cleaning.",
        "Watched Ming Tsai use this many times on his PBS TV show and finally found one. Just what I wanted and I received it quickly, well-packaged and in perfect shape.",
        "LOVE THIS CUTTING BOARD. JUST WHAT I HAD BEEN LOOKING FOR. IT IS MADE VERY WELL AND LOOKS GREAT ON MY COUNTER.",
        "Got this for my Son and his Wife . They were very happy, kinda big but the'll grow into it",
        "Noticeable gouge out of one side where the finishing man jammed the router into the side. the rest is as I had hoped.",
        "It's a very nice product. The appearance of the bamboo surface on the block we received was not as nice looking as others I've seen.",
        "This is an amazing cutting board. It is really heavy, very solid, and does not move. A little bamboo fuzz the first week, but it is gone. I highly recommend this product.",
        "My wife hated this cutting board because of its size but the first time we carved a turkey she understood why I always say size is more important than longevity. No worries though. With proper lubrications this will also outlast the best Of them!",
        "This is a very nice quality cutting board, which I have been searching for! First thing I did was oil it as I want it to last. The only thing I do not like is its on legs which at countertop height makes it too high for cutting for me. I am short and those extra inches add a little too much height. It presents beautiful and would make a great gift.",
        "I purchased this because of how well it was built and added usages. It is well put together, looks great, sturdy, easy to clean and maintain, so worth every penny. What really puts this above the rest in my opinion, is that it is not only a great cutting board, but also a nice addition with snacks, appetizers, etc when entertaining. You will be very happy with this purchase. It will also make a great gift idea, which I plan to do myself.",
        "VERY happy with this product. Construction is excellent as is the finish. I rubbed it down as recommended with mineral oil and it did soak up a couple of applications but not overly. It is just beautiful and a joy to chop and cut up food on. My wife on the other hand is not as pleased as I am since it is BIG and HEAVY. But that is because it is a very solid and well built product. I can see myself buying a carving board from these folks in the future.",
        "Purchased this board as my current one was just too small for prepping fresh fruits and vegetables now that we are eating a healthy meals. This is a great size and looks great too which means I don't have to put it away each day.",
        "It’s big and solid and bamboo, can’t go wrong. Put together so very well. I’m putting it on my range when we have company to put things on, plates, or food, or whatever it fits perfectly on my range. Love it",
        "what a beautiful cutting board. I am so happy with my purchase and can't wait to put it to use once we move into our new home soon! highly recommend if you like bamboo and especially if you are in need of a nice sized board that is beautiful as well!",
        "The best cutting board I have ever bought, love it",
        "I've owned a lot of cutting boards and seen many more. I've never seen a cutting board bigger or heavier than this one. I've had it for a year now and it's still a pleasure to use every time. I can cut 6 different things on it at the same time. If you want the biggest high quality cutting board on the market and price is of no concern, then I don't think there is any way for you to be disappointed.",
        "Make sure you have the space for this great board...it is huge...and is EXACTLY what we hoped for. Solid, attractive, great mass, and the best cutting board we have ever had. Love to cook, and this this is the BOMB if you have the room. Use food grade oil as directed and it seals well. A renewable source like bamboo makes it not only good looking and utilitarian, but also a green alternative for our environment.",
        "I can find a couple flaw with this board, including it being stringy at first and taking stains too easy but most of the stains I get out and I really just like how bit it is and strong and I guess for lack of a better word awesome. I keep this thing on my counter 24/7 and when it breaks I'll be upset.",
        "Very professional looking, solid, beautiful on our granite counter - husband is very happy with size since he is the chef of the family!",
        "I purchased this cutting board for my husband and he loves it. Beautifully made and the prep cups save lots of time. Be aware, it is very, very heavy. At our home it will stay on the counter top.",
        "I sent for this cutting board after reading the description and the reviews. This is my third bamboo board (other two small in comparison but still quite good) and I will never own any other kind. This one is a good size so be sure your kitchen will provide the space; but it is worth every penny. Bamboo is much less likely to stain and scratch. Best thing about it? I'll never have to buy another!",
        "No channel to hold water like other cutting board. Looks nice in a big kitchen.",
        "5 hard years in and it rocks! Oil regularly and it should last a lifetime. Feel it was worth the money.",
        "I know nothing about such things, but ... I am a husband always in search of something for the wife at Christmas. This was a gift she very much liked. It is heavy, stays in place, has nice feet that don't scratch the granite counter, and it looks attractive. The wife likes the utility of it. I gave it five stars as a nice gift.",
        "I was impressed with the quality of this cutting board. It’s useful and beautiful.",
        "I purchased this board as a replacement for a very expensive walnut board that started to split, I contacted the maker of the walnut board asking for suggestions on how to repair their board and got no response. I decided to try this product because of the size and its reasonable price and I have been very happy so far, I also suggest that you also purchase the board oil at the same time if you don't already have it on hand as it is recommended and I agree it is important to keep the surface conditioned.",
        "Very nice piece of bamboo. Solid. Heavy. Excellent finish and the seams are...well, practically seamless. I have applied several coats of food grade mineral oil and it looks awesome. Very happy with this purchase.",
        "This is an awesome product and is the best cutting board I have ever owned. It is pricey, but well worth the cost. I did my homework and found this to be the most appreciated cutting boards by popular review at several sites.",
        "Washes up nicely, very large. We also use it as a serving tray for cheeses and meats during the holidays. Put toothpicks or fruit in the bowls and it looks great.",
        "Actually I haven't used it yet...but can't wait to. It's pretty big and heavy...need to find a good place to put it. As much as I make stir-fry, this is going to be a great gift! I'm sure......",
        "great quality....exactly like the one Ming Tsai uses on his cooking show Simply Ming. Having the stainless steel bowls build in makes it so much more convenient than a simple board.",
        "I have several Totally Bamboo wood cutting boards. They are my favorite and last for years and years!",
        "This is a great cutting board that has held up very well and has been used a lot.",
        "This was a great deal - I was going to use this to do a built in cutting board but liked the size and heft of this so I left it alone.",
        "This cutting board is huge. Once placed on the counter, it doesn't slide. The bamboo wood is so rich looking. Love it!",
        "Very nice product. Got as fit for hubby and he loves it. Adds a nice touch to kitchen counter. Would def recommend",
        "Make no mistake this board is huge! Huge. I love it!!!",
        "I have a very large island and could not find a cutting board large enough. This worked perfectly.",
        "This is a sturdy cutting board that looks terrific on our countertop. It is well made and well worth the money.",
        "Checked out many sites and many boards before getting this one. I even called the maker for info. Love this board. It is big, solid, and beautiful.",
        "I'm a big dude...my wife is petite. This thing is huge...it's almost like a piece of art sitting on your kitchen counter. It's tough to clean at first simply because it's so dang heavy. But once you figure out your own way to clean it then it's not so bad. It's almost like its more of an art piece than a cutting board...but it looks great in our kitchen and it's a damn good cutting board. We've found ourselves using smaller cutting boards for meats and chickens just because this thing is difficult to have to clean too often...but it's a great board. Also, make sure you oil this thing down every now and then so it maintains it's look.",
        "I bought this on special offer/clearance from Amazon. It was described as \"blemished\" - well, I couldn't find any blemishes, it looks brand new in perfect condition. We like it a lot, as it is HUGE and fits our counter/island perfectly. I would not have bought it, except for the ridiculously low price."
    ]
}