{
    "entity": "Cutting Boards",
    "text": [
        "Ugh! I didn't take the weight of this block into serious consideration before purchasing and that was a big mistake. This is meant to be a stationary block unless you're upper body strength is top notch! Not for everyday cooking. It takes a lot of effort to pick up. So, I only use it when I have a lot of produce to chop and end up having to sweep the chopped ingredients on to a lighter board to take to the stove. This was not a practical purchase for me. Nevertheless, it's good quality and very nice to look at.",
        "If taken care of this will last a lifetime. I know others that record said that it was broken when shipped. Mine was fine. Only reason I gave 4/5 was because I had to add small legs on myself. I didn’t want water underneath messing the block up. If this review was helpful please let me know by clicking the “Helpful” button below the review.",
        "I have purchased 3 of these. One for me and the others were gifts. All great until....the one I purchased in July 19 started to crack in September. The company (e block is totally unresponsive. Not even a returned call. Very disappointing.",
        "This is a very beautiful,heavy block. It arrived packaged appropriately and without any noticeable imperfections. I oiled it with Boos mystery oil several times a day for about 3 days on all sides. It looks great. I believe the key to keeping it lovely is oil. It will eventually need less but as a new block, I will continue to oil it several times a week.",
        "What a deal! This gorgeous and professional-looking chopping block would cost more than twice the price at a fancy kitchen store. Mine arrived in beautiful condition. Though it didn't look dry, I coated it with mineral oil and let it rest overnight. I've been using it ever since; oiling it about once every ten days or so. It's big...and it weighs a ton. Make sure you have a place to leave it out or an easy place to store it. I'm thrilled with this purchase.",
        "Bought this board for my husband who loves to cook. It is quite heavy though. When washing it, it is hard since it is heavy. I would recommend buying lots of mineral oil. It does absorb a ton of it and still is not given that shiny look. It is quite resistant to all the cutting we have done and is still going strong!",
        "At first this block was very good, when properly cared for. It needs to be left in the same spot on the counter as it’s heavy so it can’t really be put away. Also I put small rubber stickers on bottom to keep it steady as it slightly warps over time. However, it’s been about a year since my purchase and suddenly a large crack appeared. For an end grain block that has been meticulously cared for, this shouldn’t happen in 12 months. Therefore it gets 2 stars unfortunately.",
        "This chopping block is massive. It does not move. It does not slide around. I oiled it when I first got it. I have had it for several months now and have enjoyed using it. Cleans up just fine and has not developed cracks or chips. If you have the room for it, I recommend it.",
        "I gave it to my brother and sister-in-law and he immediately started using it. He was impressed with the fact that it doesn't move when he was chopping stuff on it (because its so darn heavy). He said most cutting boards move all over the place, so he was happy. This is a quality cutting board and worth what we paid, about $110.",
        "This chopping block is big, heavy, and well-constructed. After it arrived, I applied several coats of food-grade mineral oil/carnauba wax/beeswax combination to protect the wood against moisture. I've used the board several times have been happy with it. The board provides a very solid, flat cutting surface. No warping of the board has occurred. I recommend this product.",
        "I’ve been wanting a big chunky cutting board for a very long time. I was so excited to get this for Christmas but now it is cracked all the way through! Even after oiling it several times it still cracked! I am so upset as this is not useable anymore because of the risk of bacteria in the crack. I am 4 days past my return window and for the price I am so upset!",
        "Very happy with our cutting board. 5 stars for the actual board. 1 star for packaging skills. Rounding out to a 3 overall. We received the item in a box about 4 times as large as the 27 lb cutting board, with only a little bit of packing paper loosely put in. The beautiful expensive board arrived damaged. We initiated a replacement and a 2nd beautiful board arrived the same way, damaged which was disappointing. On our 3rd attempt we received an undamaged item.",
        "It's beautiful--you are proud to have it on your countertop. It's super thick and heavy--won't move while cutting a heavy turkey and you can put it on its edge to dry and probably won't warp. Came within three days. You would have to pay twice the price to get a similar board.",
        "Ordered this July 12, gave it as a fifth anniversary gift on August 4, and we’ve used it less than 20 times, oiling it religiously with the recommended product, per the instructions. Still, the board has a huge crack through one side. Such a disappointment for a $100 cutting board touted for its chef-quality durability.",
        "This is a beautiful and heavy end-grain cutting board. I use it for cutting up chickens and other meat for my dogs, as well as every day kitchen work. It is solid and provides a spectacular cutting surface. It has taken many blows from the cleaver and still works excellent for smooth, even slicing. It is large and it is heavy. If you are not looking for large and heavy... well, you should be, because this block is great!",
        "The chopping block had many imperfections and doesn't deserve 4.5 stars. Please look at the pictures since they say it all.",
        "Compliments galore on this, great looking piece and we use this almost every evening for cooking. I highly recommend also getting the oil as it does dull out after several weeks.",
        "Great quality chopping block. I researched chopping boards/blocks for a while before deciding on this one, and I was not disappointed. Lovely soft but tough wood. this is quite big & heavy which makes washing it down a little tougher than with my old chopping board, but it is fantastic value. The wood is soft enough that a bottle that fell on it made a small dent in it, which is a good thing when you're going to be using good knives to chop on it.",
        "Add style to kitchen. I love mine and last year for christmas this was 4 gifts. Everyone loved it and uses everyday.",
        "Beautiful! We oil it weekly. Initially oiled it a TON. Looks amazing. Very sturdy. Well worth buying this over the expensive models.",
        "You can’t put hot from the stove pans on it because it will crack. You can’t leave wet items on it because it will crack. It’s cheaply made. I guess you get what you pay for...",
        "Love this board. It is big and I leave it out all the time. It's the go to spot in my kitchen for cutting safely and saving your surfaces.",
        "Easy To clean , sturdy, made very, very well.No effort to pound chicken or anything , thickness is great",
        "Took a bit of searching to find a quality heavy duty end grain chopping block. I bought some of that oil that is recommended to keep it from drying out. Had this about 2-3 months now. Would order again. It's hard to find real quality anything anymore and this is good stuff.",
        "We followed the instructions for this board, and it started to break apart at the seams. Unusable after less than 2 months.",
        "What an awesome chunk of love. Great block. Durable, heavy and big. I expect this to be handed down to my children’s children long after I’m gone.",
        "Thinker than I was expecting, but that is on me. It clearly stated its dimensions, I just imagined the 31⁄2 inches as smaller in my head for some reason. It is a good sturdy cutting board.",
        "It was exactly what I wanted. I received it in great condition and I couldn’t be more pleased with my purchase. It should last a lifetime with proper care.",
        "Fantastic butchers block. A little too large and heavy, but after using it for a while, I still don't have any cut marks from my knife.",
        "Awesome cutting board if you want it to last and pass it down to your children this is a perfect board to buy tight grain and beautiful",
        "Heavy, high quality. Very thick so keep this in mind if you are short- this raises your cutting surface by 3.5\" Beautiful and VERY heavy. I have had this a few months. No cracking or blemishes. Use a quality oil to keep it in shape.",
        "A great board but I should have got the two inch. The three inch is crazy heavy. Plus it's a little high for me. But it sure doesn't go anywhere when you are chopping!",
        "Beautiful piece a wood but it developed a crack in 30 days. It was oiled daily for the first week, applied wax plus continued to be oiled every few days over the next 3 weeks. We also have the humidity controlled in the house so this was not the problem for sure.",
        "This is an amazing value on this block. It’s beautiful. Just be prepared for how heavy it is.",
        "This bloxk is as advertised..excellent quality.. please measure your counter space prior to ordering.. it is very large. Beartiful block. The factory finish was pretty good, but I did use a 320 grit sandpaper to produce a \"glass like\" smoothnes to it. I am now applying coatings of food quality mineral oil over the next several days to finish the prep work before first use... I purchased the mineral oil from my local CVS pharmacy. I am very pleased with the construction... This is a very good buy.. I would have liked to have seen a little better packaging... but no big deal, it was fine. Again, A GREAT BUY!!",
        "This chopping block is worth every penny. The craftsmanship is top-notch. It's a real beauty.",
        "Many uses for this cutting board very hefty from cutting and displaying your meat to charcuterie.",
        "I wish I had bought this block years ago. It weighs in at 27 pounds, and it does not slip, warp, or wobble. The height really makes food preparation more comfortable. Out of the box, it did feel a little rough particularly on the sides. I took care of that with some 220 grit sandpaper.",
        "Initial review: I just got the board in today. We have been using plastic boards but I wanted something more substantial that I could leave my kids with. This board is a beauty. I just put my first coat of oil on it. Packaging was fine on mine.",
        "I like the finish quality of the block along with the color of the wood",
        "Cuts fast. Looks beautiful after oiled. I knew it was big, but it is really a monster. The 3 1/2\" height makes cutting so much better. I didn't realize how much I hunched over while cutting until I used this board (I'm 6' 0\"). Love it; should have bought years ago. I don't think a Boos board for the same price would come close to this board. Stop looking and just buy it. Bought the Boos Mystery Oil to protect the board.",
        "Great block. Very heavy duty and just what I wanted.",
        "I own the Boos block that is the same size but only 2.25 inches thick. Compared to this chopping block - the Boos looks like a cheese board now. This block is prettier and the end grain is far better for cutting. What I have found is the Boos board is not end grain and the knife will \"move\" left and right while cutting and chopping - this block does not move the knife at all. So without hesitation I highly recommend this chopping block - you will not be disappointed. AND for the money, this is a steal. Happy chopping.",
        "I love it! It was very dry when I opened it. I started seasoning it immediately.",
        "It's a beautiful board but started cracking and separating after a few days",
        "Everyone who cooks should have a quality butcher block that will last for decades. I'm seventy one so I expect this to get me through the rest of my life even though I'm hoping to reach 100.",
        "What a beautiful board. Too bad it started to split on four seams after only 2 months. I’ve oiled it at least once a week. So disappointed. Return window closed, otherwise it would be going back.",
        "THIS WAS PERFECT FOR MY KITCHEN! THE HEIGHT OF THE BOARD MAKES IT EASY TO WORK ON. VERY HAPPY WITH THIS PURCHASE AND WOULD DEFINITELY RECOMMEND TO A FRIEND!",
        "Very nice hefty block just needed to be treated before use",
        "When this board arrived ontime, couldent wait to begin cutting on it. Its truly breathtaking in how all the squares are aligned and complements the kitchen nicely. She is a heavy bugger so no worries about it moving around while preparing food on it, but that is the name of the game.",
        "Hated it wood split after 2 months no refund garbage",
        "So far I'm very pleased with this, especially given the price. Very solid and heavy; well put-together. Definitely superior to the similarly-priced Boos edge-grain board I also own.",
        "Top of the line cutting board - not only the best deal for you money, but a 5-star culinary cutting board for anyone's use.",
        "It's vaster than I expected, heavier, but the knife bites well into the wood ensureing clean cuts. (Struggled with wife over where to keep it, but it's big enought to be considered part of the table.",
        "Very Nice Block for the price - Very good customer Service!! Thank You!!",
        "We just purchased this board it is large and heavy weight .end grain on this one and very nice looking amazon and dawns depot are putting a very good product out for the chefs in all of us to enjoy for a reasonable price .for such a quality piece . Thanks",
        "Love this chopping block.. Everyone who works in my kitchen loves the height and comfortable feel working in it. Color is nice, great weight. Oil it weekly.. On all sides..",
        "very nice, 40% less than what Crate and Barrel was asking",
        "Purchased in January and it was great until about a week ago it started seperating, we have followed all care instructions. We were hoping to get years of use for the price.",
        "Awesome chopping board. It is bigger and more hefty than I imagined. Very impressed.",
        "It's so much bigger than I thought it would be!! The perfect edition to my kitchen!",
        "I am going to keep it but there is definitely quality control issues. Just hope you get a good one",
        "I use it everyday, I clean it with white vinegar and I grease it now and then with coconut oil.",
        "Great looking bored but didn’t realize how heavy it really is.",
        "Absolutely beautiful...heavy..but beautiful for all your cutting needs. I would highly recommend it for the serious home cook for your kitchen.",
        "If you are looking for priced right chopping block, this is the one. This block should last longer than I'll even know!!!",
        "Great quality end grain board at a very reasonable price. It is heavy, which isn't a problem for me but should be kept in mind. I like the thickness as well - I'm 6'4\" and it helps raise the cutting service to a more comfortable level.",
        "This cutting board arrived timely and just as described. It is beautiful a true show piece for the kitchen.",
        "Very heavy and thick! Exactly what I was hoping for!! Love!",
        "This is a beautiful cutting board. High quality and worth the price paid.",
        "Crazy solid block, I just need to get around to installing some feet on it and it will be perfect.",
        "Great size and very impressive end grain is just right for my Japanese knives.",
        "This is a great boards for the price. Too bad that it has to be a qualifier. Both of mine have imperfections (router or saw marks, cracks) and some of boards are smaller dimensions so the stacking pattern is not consistent. To me this means they are either B-stock, or the manufacturer puts out a so/so quality or have sub-par quality control. Btw, I am fine with B stock, just tell me up front in the product description. As others have noted they are not packed very well, but it's a hunk of wood, and nothing happened to mine during shipping.",
        "Gave this item as a gift and the recipient was just thrilled. Beautiful chopping block and a very well constructed quality product. The recipient has used it and says it is wonderful.",
        "This is a solid, quality cutting board for the advanced home chef or professional. It works well for any cutting or chopping and, with proper care, is easy to clean and sanitize. After it wears, and all wooden blocks will eventually, it can be resurfaced and refinished like new. This block is solid and stays in place, as well as reversible so you can dedicate one side to raw chicken and the other to vegetables and other meats that won't get tainted by raw chicken.",
        "Product is just as described one down side was it had a small dent from shipping after a short phone call with an extremely polite woman a new board is on its way thank you",
        "Excellent so far. No signs of de laminating like the other two Boos boards I had.",
        "This just arrived yesterday and is gorgeous. I cannot wait for the mineral oil to arrive so I can treat it and begin using it. This is a solid, well-crafted item and I am extremely happy with my purchase. I will say it is very heavy, and the counter tops in my apartment are not the greatest, so I set it on a piece of those rubbery drawer liners so it doesn't damage the cheap press board.",
        "Been using this block for nearly 2 years and it's doing an awesome job. No problems at all.",
        "Absolutely stunning, and I am thrilled that it is Michigan-made!",
        "I was a bit worried that this would come dented or damaged after reading reviews but that was not the case. It was perfection and very well made........Great Deal!",
        "SECOND BOARD SENT....not any better. STILL has chunks of wood missing. Not the quality I anticipated- now I have to lug TWO heavy cutting boards to UPS. Awful. Board was nicked when I received it....extremely disappointed as it was to be a Father’s Day gift.",
        "Perfect! Everyone thinks I'm a professional chef when they see the chopping block! Ha ha!",
        "This is the best chopping block I ever had. Always bought Boos but last one warped. Just love it.",
        "I was more than satisfied in that it fully met all my expectations. It came quickly and without any dents or other damage.",
        "Good value, serviceable, longevity depends on maintenance as with any wood cutting board. Don't immerse in water, wash lightly and dry immediately, rub down after each use with odorless, processed coconut oil.",
        "It's definitely big, and THIRSTY! I took the advice of the other people who have purchased it and put quite a lot of oil on it. It was worth the time and effort. It's a beautiful board.",
        "I received one board and it began to crack after two weeks. The vendor appropriately replaced it and it is now cracking (about two months later) even worse than the original one. I suspect I should have realized this when this board was 1/3 of the price of a Boos board. I give up.",
        "I was very surprised that the quality of this chopping was better than expected. I am happy to have found it.",
        "Beautiful! Arrived in perfect condition. What a piece to be proud of in your kitchen. Should last forever!",
        "This is the thickest chopping block I could find. It's heavy and looks great in my beach condo.",
        "I bought this product for my son and daughter-in-law, and they have told me it looks wonderful on their work top, and they are looking forward to using it",
        "I use it as a anti-vibration base for my turntable. It is perfect.",
        "Purchased as a gift for my mother less than a month ago and it is already starting to crack and split. Fortunately, or unfortunately, depending upon your perspective, it has been less than a month so it can be returned easily. Very disappointed.",
        "This board is really solid and is obviously high quality. The wood itself looks good and it's end grain maple so it obviously functions well as a cutting board. I wound up returning it however, but it didn't look good overall. I didn't like how thick it was for it's overall size. I wound up exchanging it for one that was 24 x 18 x 2 1/4. It's just a personal preference but i liked how that looked a lot more on my counter top than this one.",
        "It got a little wet and warped until the blocks separated a lot!! Used for a few weeks and threw away. News flash, there's water in a kitchen. Has to be able to sustain some water without warping. I used oil and cleaned everyday but still warped.",
        "The cutting board is way too heavy to lift and it's splitting in several places after just a month or so. I did oil as per directed.",
        "All I can say is I love it just what I have always wanted amazon is a wonderful place to bargain shop for top quality Thank you Bernadette",
        "I love this cutting board ! It did suck down a pint of mineral oil very quickly, but now I am using the Boos oil and cream and it is not so thirsty. It is beautiful and great fun to chop on, giving me a solid surface that is perfect for my knives. It is soo thick, so be prepared... I did not find this to be an issue ergonomically, but I don't spend all day chopping, and I guess this could be an issue in some situations. All in all I would say I am 100% satisfied, and that is not an everyday occurrence. Highly recommended.",
        "Great product, but mine arrived damaged because it was shipped a box that was 1.5 times larger than the product with hardly any packing. This thing weighs about 35# so it just destroyed itself in the box. The parts that were not damaged were excellent quality and it's truly sad to see such a nice piece of workmanship and natural materials wasted. That said if you want a very heavy, very well made and finished cutting board, this is for you. It is crazy heavy, seriously, watch your toes!"
    ]
}