{
    "entity": "Food Strainers",
    "text": [
        "It seems silly to be so excited about this kind of product, but after trying several other sink strainers and being horribly disappointed, this has been an unreserved delight. It has sufficient weight to not bobble or be unrooted by bubbles. It is sufficiently voluminous and porous to retain a very large amount of detritus without impeding water-flow. The flanges are thin an wide, allowing it to not build up junk around the outer edges. Even the roll of the flange is an excellent design, allowing one to hold on to the strainer well while tapping its contents out into the bin.",
        "The \"Endurance\" brand is always well made and sturdy, and reliably durable. This drain strainer beats the competition in several ways, the best being that detritus (stuff you are trying to get rid of) doesn't get stuck in the holes and require you to fuss with it to get it out. You just bang the strainer once on the side of the garbage can and that's it! The kinds that don't work so well, typically with a finer wire mesh screen, embed icky stuff in their wires and require you to stop and pick them clean. Yuck! This is better. Buy this one!",
        "I was skeptical about these because of some of the reviews. But these are beautiful and very well made! They are shiny and sturdy too. I am impressed with the quality of the metal, which seems to be high quality stainless steel. I think some others with bad reviews received the \"imitation\" version or knock-off version of these. Make sure when ordering that it says at the top that this strainer is by RSVP International Endurance! If it says any other name, it will be the knock-off product! I ordered two of these for my kitchen sink...I have had them for over a month and they look as new as the day they arrived!",
        "After having my drain line cleaned out to remove a clog several years ago, I'm super-vigilant about keeping things from going down the sink drain. This strainer is very solidly-made, easy to clean, and is great for keeping cat food from going down the drain when I'm cleaning out the (many) bowls. I've tried lighter-weight mesh ones, but they rusted. I also wipe out any grease from dishes with a paper towel before washing. The drain company also recommended Thrift drain cleaner when your drain slows up, and it's some powerful stuff.",
        "Fits our standard stainless kitchen sink perfectly and catches all the food bits (which shouldn't be rinsed there in the first place, but...) I like the design much better than those old school sink strainers that were both clumsy to operate and clogged quickly. This captures more food and cleans up quickly over the disposal. Appears to be constructed with quality, heavy gauge, stainless steel. Highly recommended!",
        "Just received this sink strainer last week. So far it is working just as I had hoped. It keeps junk from going down the drain, is easy to clean out into the waste basket, and does fine in the dish washer to get it clean and remove any grease from it. I hope that it will work for me for a long time. The mark on the strainer was \"Endurance 18/8\" and the packaging seemed to be authentic--the plastic bubble kept it protected for shipping.",
        "We do not have a garbage disposal since we’re on septic. I wanted to minimize how much food goes down the drain. No matter how well you scrape dishes, there’s always something leftover. This strainer has been in my sink for well over three months and it does not show signs of rusting. It seems to be a high quality of stainless steel and well made. It’s easy to clean and can go through the dishwasher. I’m quite happy with this product.",
        "I took a chance when I ordered two of these after reading a post about someone receiving one without the original casing and without the engraved endurance 18/18 etched the rim of the strainer. But to my surprise I received two authentic strainers! The strainer looks great! And since it is in a plastic encased casing it is not warped or dinged up! I am happy with my purchase!",
        "This stainless steel strainer is a great design. I use one in the shower over the top of the pop up drain to catch hair from clogging up the line. The large size of the strainer allows it to completely cover the drain in an inverted position. The punched holes are snag free, much easier to clean than the old screen types, and more durable too. The strainer is very nice looking as the stainless is polished and does not rust. A really nice strainer!",
        "This is not my first strainer and I can honestly say that it tops the predecessors. In the event that I feel a need to replace it, I would repeat this one without hesitation. I like that the water drains better with this strainer, the catch works well and it's going to be easier to keep clean and finally, the fit is nicer as well as the appearance. This works well for me and I do recommend it.",
        "When we bought this strainer we didn't know what to expect. The last one we bought started unraveling on the edges and became sharp and could tear your skin when removed to empty. However, the first thing I noticed was how heavy and solid it was. Good quality. It looks much better than our previous strainer and looks like it could last for years. A great product and a reasonable price. Buy one today.",
        "I love my sink strainers. Exactly as advertised, these RSVP Endurance Stink Strainers fit my sink and work great. The rolled edge keeps my fingers safe when I pick them up. These look great in my stainless steel sink as well. After reading the great reviews, I bought two of them. In addition, my husband was impressed and pleased by their beauty and functionality. It takes a lot to impress him. Before I used the mesh sink strainers and they eventually wore out; causing holes to form and food particles to go down the drain. I plan to purchase another one for my son and daughter-in-law as a Christmas gift.",
        "I had an Oxo sink strainer that really slowed the water flow through it a lot. The water really r an slowly in the sink as a result of it being used. It separated from the silicone ring it had on it, so it was time for a new strainer. This one has good reviews so I ordered it. The water flows through quickly, but food doesn't sneak through. It sits flush with the base of my sink. I liked it so much that I ordered a second one, threw the other oxo strainer that I had in the other side of my sink out and replaced it with one of these. I recommend this strainer.",
        "If you are looking for the only sink strainer that you will ever need, look no farther. This one will last forever. I have one like it that I have had for more than 10 years and it still looks and performs like new. This durable strainer outlasts dozens of the mesh type. Well worth the money.",
        "Fits our new sink perfectly looks like it came with the sink love it! Very thick and sturdy great quality!",
        "This piece fits various diameter sinks due to the strong collar. It's holes are small, holding most refuse that would clog your sink. I \"wack\" it on the garbage can to empty it quickly and it never loses it's shape (like wire ones I tried)! I bought one in a local store, liked it so well, bought another online! Dumping it often is a small tradeoff, for a clogged sink! So worth it!",
        "After trying many different sink strainers, I ended up with this one. Note that the very popular OXO Good Grips, which aesthetically pleasing, is very hard to clean. On the other hand, this one is rigid and you can get some good elbow grease in there to force food and gunk out of the tiny holes. BTW this one was terrible as well. Didn't even fit my sink drain:",
        "This strainer works really well for catching food debris before it goes down the drain. Cleaning is easy. The heavy weight keeps it in place and prevents easy bending. Only after we used a different model made of screening did we appreciate how outstanding this one is.",
        "Bought this about 6 years ago as a kitchen sink strainer. I gave it 5 stars then and it is still going strong. It has survived everything including having cast iron cookware dropped on it. Recently purchased another one for my daughter's shower to keep her long hair from clogging the drain. Same great quality as the original.",
        "I've had this for at least 3-4 years and LOVE it! This strainer replaced the cheap, flimsy, mesh strainer and the standard one that came with the sink when we bought our house. This one fits perfectly in our kitchen sink. I personally feel the strainer has saved us from several plumbing issues because it captures a lot of the gunk and food! No rusting and it's used daily! It is very durable and I have not had any issues with it. Highly recommended! Looks so nice and so so much better than the cheap mesh ones. Very easy to clean and it doesn't get dirty unless you never empty or rinse it out. Highly recommended!",
        "By golly these are my new favorite sink drainer by a mile! They never rust, they always look good, dump waste out well and clean beautifully in my dishwasher when needed. I keep one in my garbage disposer opening to keep unintended items from dropping to the rusty depths of the monster. I especially like their wide rims that more than cover the aging rims of my aging sink.",
        "Good looking heavy guage item. Cleans back up to a nice shine and makes a nice appearance in the sink. Only complaint is that the basket is a little small and it doesn't self-center. If you mean to you can shift it to one side far enough to open a little gap between the rim and the drain. Small bits do get under the rim so it doesn't form a perfect seal but my guess is that this is true of any sink strainer insert.",
        "This will be great for my garbage disposal. Two times I have had Roto router in the last year. This will save the$155.00 per visit. I ordered another one for the other side of the sink. A great buy for the money.",
        "One of my favorite purchases from here on Amazon! I had purchased some cheap ones from the drugstore that didn't fit the sink quite right. The lip curled up instead of down so food particles got trapped underneath. Also, the mesh screen fell apart in no time. I went to Amazon and found these little babies. I've had them about a year now and they are still in great shape (have lost a little of their shine but no big deal). Should fit any sink drain just fine. When we moved a few months ago, I made sure to grab them from the sink before we left!",
        "I've had this sink strainer a couple of months now. I scoured reviews looking for a strainer that was easy to clean and would remain rust-free. My sink is a large, single bowl, Blanco composite granite -- which I love. This strainer cleans easily with a sink brush, and I run it through the dishwasher every week or so. After three months, no rust is visible. The holes are large enough to drain the sink quickly but small enough to trap smaller items that I don't want passing into the disposal.",
        "I bought 3 of these. They are basically OK. The problem with these is that they are constructed with a bent lip on the rim. This prevents the strainer from sitting lower on the drain assembly. This prevent all the water from draining away. If the bent lip was not there the water would not puddle at the perimeter of this strainer. To make a great strainer the thickness of the rim should be very thin to allow the water to pass over and down the center. Also 1 of the 3 I received had a dent in the part where the holes are.",
        "This is exactly what I have been looking for. The last sink strainer I had rusted - this is stainless steel and is very strong. Fits in my sink perfectly. Keep in mind you must empty the food particles that fall in the strainer. It is easy to clean. I am very pleased with the purchase.",
        "This is a lovely solid stainless steel item. It is the right size for my sink. But it leaves a gap around the edge of the strainer where it doesn't quite meet the sink, so food gets in around the edges. It slides around the drain, so some food hits the strainer and some gets caught underneath. Since my goal is to keep all the food out of the (broken) disposal, this doesn't solve my problem.",
        "This is a great little strainer. I had been looking for something a little more robust after the wire strainers I usually purchase kept separating from the ring and stabbing me! Instead of wire, this one is made of perforated metal. The nice, thick ring sits nicely in my drain and is flush to the sink base, which prevents food and debris from getting caught in the seam and slipping down the drain. It has held up well so far with no signs of wear or rust.",
        "After two years in a farmhouse kitchen sink on well water, this strainer shoes no signs of corrosion or warping, despite weekly trips through dishwasher and sitting wer and dirty overnight more often than I’d like to admit. Impressive. But this, you won’t be disappointed.",
        "I saw one of these at our AirBnB in Vail and thought I needed one. Boy was I right! Our 1930's home has a garbage disposal, but the original small lines tend to still get plugged. Until I started using this sink strainer, I had no idea how many 'crumbs' were being washed down the sink. Easy to dump and wipe clean. I have been using it since early June (now July) and highly recommend.",
        "I've been meaning to come back to review this strainer for years, and I'm finally getting around to it because I'm ordering one for a friend. It's the silliest thing to review, and the silliest thing to be so impressed about, but I cannot overstate how wonderful it is. After five years of use, it has not bent or rusted, and is just as efficient as it was on the first day I used it.",
        "Bought for kitchen sink. Much more hefty than expected. More effective than regulate stopper and super easy to clean. Bought a second to replace the cheap screen type in the garage sink.",
        "This has done an amazing job catching all the random food bits that end up in the sink. Nothing gets by it. It's easy to clean and empty out. I wish I had bought this sooner!",
        "But I do love this item! It works well at catching foods otherwise going down the sink, and it is easy to smack against the side of the garbage to empty it. It stays shiny, despite many cleanings.",
        "We like it. We have a garbage disposal and we have a septic tank & drain field and this limits what goes down the kitchen drain and into the septic tank. It is easy to clean and easy to use.",
        "Quality of the material is good -- firm, thick metal. The depth of the cup and size of the holes are appropriately designed. I am disappointed that the edges are not tapered down or made thinner to allow for small or light particles to enter the strainer from the sink surface. I often have small or light pieces that get lodged between the lip of the strainer and the surface of the sink. The lip is high enough that I can't manually push those pieces into the strainer without a significant layer of liquid to float those pieces over the side.",
        "I have been using a cheap mesh strainer to help keep the drain clean and unclogged (hopefully). The mesh strainers were collecting gunk and became impossible to keep clean and open. After using 3 or 4 of these, I decided to try this one. This is a solid strainer without mesh. I have been using this for about a month now and it is a great product. Extremely easy to keep clean and never clogs and happily, no mesh. Can't say enough about how much I like this product. It's worth every penny and I highly recommend it. Worth the price and if I need to replace it some day, I hope that it's still available.",
        "These are the the best sink strainers I have ever owned. They are thick top quality metal. The design is compact and effective. Food does not get stuck in its metal folds. The top piece folds underneath and continues in forming a very tight smooth seal around the other piece that has the holes. I have had these over a year now, being used in each of my kitchens' two compartment sinks. Neither has a dent or discoloration or rust. They are still in perfect condition after a years daily abuse. I have complete faith these will last forever.",
        "This is an attractive, heavy stainless steel item - it may sound strange to say, but it really enhances the appearance of my double sink. It is sturdy and lays completely flat, unlike all the previous useless, bent, junk strainers. After many months, it has retained its shape and appearance. For a few dollars more than the other fake-stainless, bent crap, this is a great deal.",
        "These are the BEST drain strainers! They don't rust, stain, or lose their shape. I've given them to family members, too. Everybody is using them.",
        "I was tired of buying dollar store strainers that looked horrible after a week and were hard on the hands. These are SO MUCH NICER! When there is a lot of food, I just reach in and pull out the food without a second thought. They clean as easily as the sink are smooth and make the sink look nice. Plus they FIT! I would certainly buy again, but I won't need to because they are quality products. I bought two, one for my sink and one for the prep sink. LOVE, LOVE, LOVE!",
        "After having to have a plumber friend come over to auger my kitchen sink only after building our house 5 years ago I realized I needed a product to catch everything that would make it to the drain. This product does exactly what it is designed to do and catches anything that ends up in your sink. I will be buying more just to keep as spares for future use.",
        "No more balancing nasty food on the strainer to my garbage can. This balancing act gone wrong always sucks and ends with swearing. This product holds all that nasty junk collected at the bottom like a little strainer and can be emptied without fear of nastiness on you or your kitchen floor. Has not rusted yet or smelled really bad like some plastic alternatives. If it lasts 5 years without rusting bad I will definitely buy another.",
        "I don't have a garbage disposal purposely because I have very old drains. I have tried many different strainers and this was the first strainer that collected food scraps while allowing the water to flow through while the sides sat firmly on the sink base. Most of the others I have tried either allowed food to get under the sides, or the water didn't flow through and everything would back up. It cleans easily as I can put into the dishwasher every couple days of use. This strainer is definitely a keeper.",
        "If you’re looking for a drain to capture more this does it. Mesh-like material that captures almost all food particles. Does require more frequent expelling if trapped particles and will cause slower drainage but certainly better than flushing food particles into your septic system. Looks good. Nice fit. Would recommend this product.",
        "I needed a kitchen sink strainer and I had used a cheap plastic one for ages. This was appealing but I didn't expect it to be all that. It is sturdy, stays in place and cleans beautifully with the stainless sink. Win.",
        "I absolutely love this (weird thing to say about a drain cover, right?). But it has VERY small holes so it will catch even small pieces of food. This also makes it easier to clean, because it will not snag a sponge. And for a metal sink, it blends in perfectly - matching the color and size of the drain so that it needs like it was built into the sink. Form and function: what more could you want???",
        "Prefer this metal strainer to the kind that have thin wire mesh in the bottom (they always immediately rust!). This one feels very solid, and no rusting! My one star off is because I wish the holes were just a little bit larger, because these small holes make the sink drain noticeably slower.",
        "I have hated sinks without garbage disposals because catching the food debris is such a pain. However, we live overseas and garbage disposals are very rare. This is a great sink strainer that really works. The metal lip is very thin so fits easily flush against most sink drains; making it hard for food to sneak by. The small holes catch practically everything. A quick flip into the trash can make clean up easy. It can also be thrown into a dishwasher for quick disinfecting. I recommend this strainer!",
        "I live in the country and need to keep kitchen debris out of my septic system. I've tried a number of different designs sink strainers, and this is the one I have settled on. Stout enough to last, easy to clean. This is the right solution.",
        "We are on septic, so we need to be carefull about what goes down the drain. It's amazing what these catch! I can't believe how much was going down the drain with our old standard sink strainers. These are pretty easy to clean. I just tap them over a papertowel to get rid of the gunk. Yes, sometimes gunk gets stuck in them and you need to clean them out....but that is the purpose fo the strainer...to catch all the small gunk. A brush takes care of the stuck gunk. I usually put them in the dishwasher once a week to really get them clean. We have had them about 2 months and are pleased.",
        "Easy to pick up, easy to clean, sturdy and keeps food from going down my drain. I highly recommend this.",
        "Great product. Watch for the diameter of the sink drain. My sink drain diameter is a little bigger than this product so It moves back and forth regularly. That doesn’t bother me too much but would have been better if it’s sturdy! But that’s my bad not the product’s.",
        "How did I let one year get by in my apartment without this gadget? It is so useful and keeps gunk from going down the drain.",
        "We love these for our new home that has a septic system. They keep lots of unwanted debris from going down the drain. Much better than the standard ones that you get with the sink!",
        "OMG, I never thought I would be writing a review for a sink strainer, but here it goes. Buy this strainer! It's fabulous, the best I ever purchased. The rim is wide and fits both my standard size stainless deep sink and dish disposal sink. It stays in place, it's heavier and the holes are smaller than the typical strainer. It truly catches small items like rice, and med size bird seed. Just give it a rinse when emptied, and it does not get all \"gooked\" up. I reallly love it! Good product and well worth the money! Go for it!",
        "This is a very nice strainer. I don't like the crappy ones from the home store or wally world with the rubber stopper built into them. I tend to not use the stopper and it always breaks off after a few weeks. The screen on this is sandwiched between two pieces of metal. I don't foresee it breaking any time soon (used all day for about a month now). This fits in my regular drained side and the disposal side. Chunks and what not do not get past it. It's very thin, so stuff just rinses right into the catch. It's also very easy to clean out.",
        "Hasn't rusted, hole size is good for kitchen sink, looks good. Not magnetic, so at least a decent quality stainless",
        "I am another person who has used the standard inexpensive sink strainers that break after so many months. These are great! I had ordered some that were less expensive and similar to these but they were much thinner which is probably why my husband cut his finger when he picked one up. These are very sturdy and look great. So glad I returned the others and bought these!",
        "Works and no screen to deal with that can poke you so this great all solid can’t hurt your fingers on this product.",
        "I love these sink strainer as I hate the wastes to go into the evacuation system. Consequently I throw in the trash what has been collected in the strainer which is more hygienic according to me.They are made of great stainless steel quality and have a great sturdy design. they are standard so they should fit any sink.",
        "Looks good and serves it's purpose. Much better than the cheap mesh. Well made. Happy that it is made in Korea and not China",
        "Such a good strainer for the sink. Holes in it not too small or too large just perfect.",
        "AWESOME sink drainer!!! Used all kinds and this one looks beautiful and drains like a dream. So easy to dump collected food waste into the trash with a tap against the trash can, easy to scrub/sanitize and I KNOW it will Last a long time, unlike the mesh ones I have been using. LOVE it. Had taken me awhile to purchase because I hesitated on the price but I tell you, it is worth it!!!!",
        "I love everything about this, except that it is not easy to empty. Particles tend to get stuck. The one I had before this was wire mesh and less food was left behind when I dumped it. Otherwise, it fits the sink drain really well, captures food particles, and looks nice.",
        "This is of excellent quality. I gave it 4 stars instead of 5 because the edges don't curve down into the sink, therefore, food gets stuck at the edges a little. (I have a second one very much like this one only it curves downward toward sink but the quality is not as good as this one.)",
        "I love this product! It replaced the strainers on my Blanco sinks that were letting all sorts of gunk spill down the drain and clog it. These let water through, but filter out the particles of food that can clog the drain. I kept the Blanco drains though because at times I have to fill the sink with water, and these won't let you do that. But I love them. Wish I'd found them sooner.",
        "So much better than mesh strainers- the rigid middle is easy to clean, food doesn't sneak as easily under the lip- the heft of the strainer keeps it more securely in place. Feels solid, durable. So far- a few months constant use- no fading or flaking or staining. I hope to find a smaller one for my rv sinks. Great product!",
        "This strainer has improved my kitchen experience. I no longer have to worry about stuff going down the sink and blocking it. This strainer catches almost all food particles and is very easy to clean. Sometimes I stick it in the dishwasher.",
        "I don't always take the time to write reviews but for this little product, it was a must! After using this sink strainer for a good amount of time, I can honestly say that I will never use another one of those mesh strainers again. Unlike the mesh type strainers, this one doesn't rust or get clogged up. It has mainatined it's beautiful finish and shine. This sink strainer is definitely a \"keeper\"! I would definitely purchase this item again (although the way it holds up, I don't see that happening anytime in the near future).",
        "These strainers are the best! We've purchased a cheaper Chinese version sink strainer and it looked cheap and discolored in less than a year. This RSVP Endurance brand is made in Korea and even sold by high-end kitchen stores like Sur LaTable. The strainer part is not mesh, but solid stainless steel and durable. We have three: two in the kitchen sinks and one in the laundry room sink now. They are simple but most effective.",
        "Much nicer than the screen style strainers we had. Much sturdier and easy to clean.",
        "I bought this strainer to replace one that was made with a wire mesh screen in the bottom. The wire screen always scraped up my fingers badly when I tried to clean it out, not easy to do. This RSVP Endurance Sink Strainer is much, much easier to clean out. The basket is a smooth perforated stainless steel, not a wire mesh, and bits of food just rinse right out. Much kinder to the fingers too! I use it in the kitchen sink to keep large and small chunks of food out of the garbage disposal, and it really works well.",
        "They look and fit like they were made to our specifications. Perfect.",
        "I place two of these on each side of my kitchen sink. Been using for awhile and probably save it from clogs. Can’t complain, not the most complicated item to really review. looks nice and works well for its purpose.",
        "So far I like it! It looks well designed and durable. I'm expecting years of use unlike the last one I got.",
        "Looks great in my sink, and does the job as it is supposed to, no rust, and hurting fingers.",
        "Yes. I am reviewing a sink strainer...but a VERY GOOD one. This is the best sink strainer I have ever owned. If I had more kitchen sinks without disposals, I would buy this for each one. The product is made of heavy stainless steel, cleans easily, and keeps debris from going down the drain when prepping food. I'd give this as a gift to those who are extremely hard to shop for...really.",
        "I purchased one of these a couple of years ago for the kitchen sink/garbage disposer. Sadly, when I decided to buy one for the other sink, I bought one of those \"two for the price of one\" deals and when they came, they were awful. Cheap, cheap, cheap. Now I'm buying another one of the Endurance 18/8. Humm, perhaps I'll get two!",
        "Love this little thing. I moved from an apartment with a food disposal to one without it, and found myself constantly clogging up my sink. The strainer that came with my sink simply wouldn't let any water pass once any food got in. With this one, you can let it fill up a bit and water still passes, then you just clean out whatever is in it. I haven't had clogged pipes since I got it. Highly recommended.",
        "Great tool for straining, sturdy, good fit, stays put; probably will last forever from the looks of it. Best strainer I've tried. And! Makes the stainless sink look shiny again. Definitely will re-order, if I ever need another.",
        "This is excellent! I wish I got more. I only ordered one. Aw. It looks SO nice! It's very good quality and it doesn't let food go down the drain. Excellent protection for my drain. It fits perfectly!",
        "I live in the country and have a septic tank, so no garbage disposal and old, smaller diameter cast iron drain pipes. Had a frequent need to snake my kitchen line for small food clogs, especially when guests (not sensitive to my old system) used the kitchen. Since purchasing this unit I have been clog free for months. One of the best small purchases I have made in years. It traps everything, and I throw it I to the garbage every day or two.",
        "Works perfectly! It drains well even with a bit of food in it. The fit and finish is great with no sharp edges or anything. It stays fairly clean and cleans up easily. The finish was a little shiny at the start, since my sink is stainless, but it looks better after a few months. I bought the one through amazon prime and it says Endurance 18/8 on the strainer.",
        "This is the BEST strainer I have ever had!! I have gone through so many in the past, rusting, bending, not doing the job right. Saw this on Amazon, read the reviews and decided to give it a try. I am telling you, it is absolutely PERFECT. It is heavy duty, fits my drain perfectly, does not let food particles get through, cleans up easily to shine as if new! I will be ordering another to have on hand just in case they become unavailable in the future.",
        "This little gadget has saved us a lot of plumbing expensive. It fits in the drain and stays there. You can put pots and pans a word without any problem. It stays flushed with the sink And it is so easy to clean and I had mines for over three years and has not rusted yet",
        "This fits and works great in our kitchen sink. We have a septic and cannot have a garbage disposal. This drain catcher works well at collecting all the dish scraps.",
        "I've tried 6 or 7 different drain strainers and this is the first one I've liked. It's heavy enough so it doesn't float if the sink starts to fill with water and no food gets through it or underneath it. It's also very easy to empty and clean. Highly recommend!!",
        "It does the job, doesn't exactly shake my world, but I don't expect that it should. It doesn't feel like the most durable strainer ever, but I'm content with it, and for the price I'll keep an extra in the cupboard for future. I like it better than the bulky OXO strainer I had previously, which ended up coming apart long before it should have shown signs of wear.",
        "Very sturdy and the holes are smaller than the first one I bought at Walmart, which I really like. To me, it's worth the price. Cleans easily and looks great in my sink",
        "Bought this when my garbage disposal broke. Still haven't replaced the disposal. Haha. This strainer is infinitely better than any I bought from local stores.",
        "This works great at stopping a lot of stuff from going down the drain. It's very easy to pick up and dump out all of the stuff it catches and put it back into place.",
        "Not flimsy, heavy duty! Stops debri from going down the drain.",
        "These are amazing. I purchased another. Easy to clean and VERY sturdy.",
        "It cleans fairly easily with just dish soap and a kitchen brush. Yes, particles still get trapped and it requires a little elbow grease to clean but it is far easier to clean than mesh strainers. I've never seen any rust. It tolerates 'Barkeepers Friend'-brand cleanser which is an acidic stainless steel cleaner (culinary stainless steel's best cleaning product along with vinegar). Attractive.",
        "Works like a charm! I have tried many different drain catchers. All had one shortcoming or another. This won the prize. Fits perfectly in the drain. Keeps it shine. Catches a lot of food but keeps on draining. It is tough. I can bang the food out into the trash without worrying about bending it. Great product. I plan to buy a second one soon,",
        "Absolutely the best Kitchen sink strainer I have ever had. It fits PERFECTLY! It sits as flush as can be in the sink! Very, very flush. It has the look and feel of quality. (Better than my sink :-) The best of its kind that I've ever seen. I was waiting for another mediocre strainer, which would be just ok. Not so. This is the best.",
        "I have been looking for a good strainer for years. Finally, I have found it. I like the size of the holes, it stops most things from going down, without getting all clogged up like a wire mesh one can. I've had it a while now, and not one speck of rust showing. It also just looks nice in the sink. I will be buying one for my other sink.",
        "After buying many mesh sink strainers, I found this one. I will never buy the other kind again!"
    ]
}