{
    "entity": "Food Strainers",
    "text": [
        "The pestle angular cone is too narrow! What happens is that the pestle handle rides on the collander edge and the pestle working surface cannot touch the collander screen. Because I needed to use the collander I did not want to delay by returning the unit, so instead I removed some of the pestle material from the handle. This allowed the pestle to work. Not everybody would have the tools on hand to modify the handle.",
        "I bought this to use for removing tomato skins/seeds from my sauce. I have an older aluminum version which works perfectly but didn't want aluminum in my food. The design on this product if awful. Because the stainless steel band around th top is attatched straight up and down instead on following the angle of the sieved portion the wooden tool does not touch the sides and therefor it wil not effectively push your food through. DON'T waste your money on this.",
        "Hard not to compare this set to the better one used by my mom. The older one held more and is a solid one continuous piece without ridges on the outside so it's easier to clean. This one looks tacked together at the screening point and I'm not sure how long it will last. Mom's is 50 years old and better made. I will be checking antique stores, garage sales and estate sales.",
        "So far, so good. The pestle isn't made for this unit, and almost appeared to be used, it's tip may have just been beaten up by shipping and handling. The metal handle is freakishly long, but I can work with that.",
        "Getting seeds out of berries is a difficult process no matter what. This is easy to use and cleans up easily. It's kind of big & bulky, but works better than the hand mills I have tried.",
        "It seems to be all right. It'll work well enough. But, I'm a little concerned with the condition of the packaging. Looks pretty beat up and an awful lot of tape wrapped around it.",
        "I ignored the other reviewers who mentioned that this is a 'china cap' instead of a chinois, but now I regret it. The price was too tempting. The description of this product should be modified to mention that this is a strainer but not a fine mesh strainer. I was looking for a chinois for it's ability to finely strain. I used this thing to make Cereal Milk, which left me with some chunks of cereal in the milk. Yeah, I could use a filter of sorts, that's not what was advertised. Oh well, lesson learned, I'm going to buy that $110 strainer.",
        "This product is easily > $100 at a big box store! Exactly as pictured and described. The materials are great quality. Works perfectly without the stand over a large stock pot. It's not tall enough to fit a 3 or 4qt Pyrex under the stand. A smaller bowl works though.",
        "I specifically purchased this chinois to separate my chokecherries from their juice. I found that in conjuction with my Steam Juicer, it works wonders. The steam juicer softens the fruit and pulls off the juice. The chinois helps me easily separate the seeds from the tasty, flavorful pulp. I add the pulp back into my juice. I love this product!!",
        "I am going to keep it, but I wish it were a bit more stable. It definitely pushes the pulp through the holes without any trouble. I wish I had gotten one that sat securely on top of a bowl. Cleaned up easily. I also wish it was easier to store.....it's rather big. It reminded me of my mom's, but I obviously 'watched' her use it and never did it myself.",
        "I bought this so I could use it when I make my relish. Love the stand it. Works well!",
        "It worked like a charm I was making apple butter for Christmas presents",
        "I got this for removing seeds to make jam, it doesn't work very well. Either you don't get all the fruit or you get bits of seeds in your jam. It is small yet cumbersome, has LOTS of sharp edges and is a nightmare to clean. Mine cost $49 at a local store and I will never get my moneys worth out of it. It will sit in a dusty storage area til I get sick of looking at it and donate it to the Salvation Army. A very pricey mistake.",
        "This works okay if you line it with cheesecloth but is terrible in terms of being an ultra-fine chinois. Do not expect it to filter out anything smaller than a pea.",
        "Well when I ordered the press is was not what was in the picture. The picture shown was an older Mirro press like I wanted. The stand is not as sturdy as the Mirro press and the cone and pestel is not as big and has a pointed end, not round for mashing. It does not have the curved edge around the top that makes it easy for the peelings to just come out in your juice. I guessd if it is what you are use to, it might work just fine for you",
        "I wish I had listened to the reviews that I read before purchasing this set. This looks like the old chinois set that my mother used for many years, but like others said, the holes are too large. When I tried to use it to make tomato juice, many seeds went through the holes, and I had to strain a second time using a sieve. Very disappointed. Maybe it will work for applesauce, but it was worthless for tomatoes.",
        "I really do need a chinois to strain delicate pastry creams. Found this set advertised as a chinois and ordered it. IT IS NOT A CHINOIS with its fine mesh but rather a coarser china cap. If you want/need a real chinois do not order this! I'm stuck with a hunk of metal I have no use for and I'm out $30.",
        "This chinois works well for making applesauce. I haven't yet tried anything else. Two drawback: the handle is not smooth and I have to use to towel around the handle to hold it comfortably. The base is wider than my 30 year old chinois, therefore I have to use a larger bowl.",
        "As a few other reviewers have recently noted, the handle was broken from the strainer upon arrival. There was no apparent damage to either the outer or inner box. This was obviously a factory defect, as the failed welds were visible on both the handle and strainer. I received a refund for the purchase price, but had to eat the shipping fees. This has probably been my most disappointing Amazon purchase to date.",
        "no good at all .arrived in a double box no damage to the boxes? the handle was dis attached .factory defect spot welds failed, then they tried to glue it back on with epoxy it failed to , i am a welder ,i spot welded it back on ,and repaired it i had two bushels of apples getting over ripe no time to send it back. Thomas Berry",
        "I bought this after borrowing a friends similar product to mash chokecherries. I just wish this wooden mallet had a blunt end instead of a pointed tip, I don't think you can mash the berries a thoroughly or as quickly with the pointed tip.",
        "Broth is a staple to any kitchen pantry. This chinois set helps you to sieve your stocks to create clear broth for soups, sauces, and adding to various recipes. As I tried to find a chinois for an affordable price,there weren't many that came with a stand and pestle. The more I used it the more I know that they are must-have accessories.Very good deal.",
        "This is a more affordable alternative to a crank-style fruit press, and does a good job of straining.",
        "If you have struggled with strainers before, end your misery and invest in this 3 piece stainless Chinois set. This is a great price for a great kitchen investment. The stainless won't rust and it has the strength to hold up really well over the long haul. With the wooden pestle, you control the speed and pressure. With the stand, you can set the cone-shaped sieve over any bowl to avoid awkwardness and mess. The volume of food this processes is impressive. The handle on the press itself just feels right for balance and handling. This is a practical, well-made kitchen essential that is really worth the modest investment.",
        "Materials excellent, and should serve our purpose, but fit of the chinois into the stand is not easy. It is a little to large in diameter so there is a struggle to get it in place.",
        "This worked like a charm for straing red Chile sauce. Only draw back was finding a bowl small enough to go under it.",
        "One welded piece came off during first use. Still can be used but it take more work though",
        "Bought this as a birthday present for my mother, she loved it! Great quality, she's really picky with her kitchen and this was definitely up to par!",
        "This works great for all my canning needs. Best price I have found and it is very strudy.",
        "A CHINOIS has layers of fine mesh screen. This is a CHINA CAP, with holes large enough to easily pass fruit seeds through. It doesn't deserve the star I had to give it inorder to post this warning!",
        "It worked great for making applesauce. However, some of the soldering came off where the handle is attached to the V container. So the handle is loose on one Side",
        "It arrived w the handle broken off. Had no problem returning it.",
        "I loved this set. I used it to make tomato sauce and it worked great. Had no issues and it was fun to use. Very high quality. Highly recommend.",
        "Product was not what was pictured clearly not the same design.",
        "I bought this for my sister-in-law to use for canning. She said it worked well but was hard to get the bottom of it cleaned out.",
        "When I received this product, it was smaller than the ones I used when I was in the restaurant business years ago. The handle was attached to only one side, not sure if it is designed this way or if it was not welded on both sides of the handle. There was also a small dent near the top. No instructions or manual provided. Makes me think it was returned and resold maybe. Even though it worked for the grapes I wanted to juice, I was hoping for something better.",
        "My son and his new wife wanted to learn about canning.. So when we grew tomatoes in the garden I found this would be perfect for getting the stewed tomatoes into sauces for his cooking. He is a chef in his own right and loves the flavor and texture of foods. He has used this also to strain the various chilies he has grown.",
        "I wanted this strainer for when I strain red chili and was hoping the holes would be small enough to get all the chili skin from falling with the chili. I would be a five if the holes were a bit smaller and the stand also a bit wider because I can't put a big bowl under it",
        "leaves a little to be desired, but it doe sork",
        "Wish I had purchased this years ago! Would have made a lot of the canning that I do SO much easier!",
        "Not as big as I thought it would be, but I didn't really know what I was getting. Very sturdy and great for high jars",
        "It's smaller than my mothers, but it shouldn't make much difference in use. Can't wait to give it a try.",
        "Works well. The holes do allow some tomato seeds to get into the juice.",
        "Difficult to clean but is only used a few times a year for tomatoes so I can't complain too much. If I used this weekly then it would really suck.",
        "This product is not a chinois, I repeat - This product is not a chinois. If you are looking for a china cap, this is a wonderful product and does a great job, but if you are looking for a fine mesh strainer (ie. chinois) then you are looking in the wrong place.",
        "VERY difficult to clean! This chinois mesh basket is not all one piece. The very bottom was attached in a way that on the inside at the very bottom little pieces of food get stuck under the mesh. It gets pinned between the mesh and this bottom piece and makes this so hard to clean. I would recommend finding one that is all one piece. It might cost you but this thing is not a good buy.",
        "The wood phestal is fraying at top bottom. Should have purchased unit with blunt end phestal.",
        "I was not impressed at all with this product - very poor quality. The base is not very sturdy and you really have to hold on to it when straining fruits through it. The bottom piece of the cone also broke off the very first time I used it so I am returning it and getting a better quality one. I wouldn't recommend this item to anyone ... they really should redesign it so that the cone part is all one piece!",
        "It was a great gift for person who wanted to can.",
        "Lost my old set. This one is stainless steel--an added bonus feature.",
        "I bought this to make apple butter with. I couldn't find one anywhere in town when I needed it. It is sturdy and built with quality. I also got a great price through Amazon. I did end up finding one after I purchased mine through Amazon. It was $10 more at the store and that was including shipping. I love it and would recommend it to anyone who wants one.",
        "This item broke the first time I used it. The bottom fell out. The weld was weak, perhaps a flaw in my unit but the desgin is poor in that a weld should not be in an area of high stress. Thus I cannot reccommend this product.",
        "My mother had one Chinois set and I wanted one for myself. O bought it and found out that it was not deep enough.",
        "It's not as big as I thought it would be. I'm using it, but I'm still looking for another one.",
        "Good tool don't know why I didn't get one before now Happ!",
        "Very good quality, It arrived on time Amazon is always good on delivering the items on time. the only problems about this item is that the advertizer had a much bigger dimensions than actual size. other than that is great. Thanks Amazon for your good service.",
        "Had a little problem getting the strainer part adjusted just right into the stand. Otherwise it performed perfect as expected.",
        "The inner box was smashed and taped up. The stand frame was bent. More of a Chinese cap rather than a Chinois and not fine mesh. .",
        "It was given as a gift to folks who do a lot of canning and preserving. They appreciated it, but don't know if they have used it yet.",
        "This Chinois set isn't as strong as the older model. I used once only for making grape juicy and the stand has bended and the mesh looks like coming apart. Very disappointed!!",
        "Exactly what I wanted; works perfectly. Amazon always comes through in a timely manner.",
        "The chinois seems a little too small and light to take the pressure of trying to squeeze tomato pulp, seeds, and skin out from the cooked tomato quarters. The wooden handle, while beautifully made, isn't up to the job. It works, but at the cost of some elbow grease.",
        "Works well just wish it was a bit larger but I would buy it again",
        "THE SET EARNED ONE STAR BECAUSE I DIDN'T RECEIVE THE 3RD PIECE OF THE SET.THE 3RD PIECE WAS THE WOODEN CONE THAT IS NEEDED TO MASH THE INTENDED INGREDIENT .",
        "This was what I needed to make my Tomato sauce. I cooked the tomatoes slightly and then prossesed them in a food prosser. After that I used the chinous to remove the seeds and skin. It worked very fast and I was done with my canning in no time.",
        "This worked perfect for making tomato juice. Was like the one my mother used long ago. When I processed the cooked peeled tomatoes and vegetables then pushed small amounts through the chinois it was perfect, removed all seeds.",
        "I thought the strainer was going to be framed mesh. The holes were too big and didn't serve the purpose I needed. It was made very nice, but didn't work.",
        "It was a Christmas gift for my daughter and her husband, and she loves it! It is very similar to one that I already had, and it's great for making applesauce.",
        "This sieve is great, now for all the people who says this is not a chinois you are wrong cause it is. If you want a fine mesh sieve then get a chinois etamine. but this product is great quality for the cost and just be careful with it and it will last a ling time.",
        "I am using this for canning tomatoes. It does a good job removing the seeds and skin. Nicely made.",
        "This 3 piece Chinois Set did the trick when it came to making my jam! Cut my time in half and left little or no waste. Great product and easy to clean too.",
        "Using it for applesauce to separate skin from the apple. Did well but at times gets skin caught in the tip of the chinois.",
        "I bought this contraption b/c it reminded me of one my parents had years ago!! It worked well and my applesauce turned-out YUMMY!!",
        "The product accurately met its description and satisfactorily fulfilled my expectations.",
        "love the design especially the pointed stick,was easy to use,holes in collander are too big let seeds go through in juice,was somewhat hard to clean",
        "This unit is exactly what I was wanting. It's very sturdy, well constructed and the delivery was great. Very satisfied with my purchase.",
        "Received item wonderfully. Gave a credit card # but was billed on an alternate # causing 3 NSF charges on different account= Nightmare & many $$$ = very bad experience :>(",
        "Using for tomato sauce and applesauce. The wooden dowel does not fit tightly to the steel frame . Very frustrating. I have been using a potato masher to process sauces with this setup. I would not buy again or recommend.",
        "I haven't actually used this product. I spent some time canning tomato soup with my son this Fall. He requested this item as a Birthday present. Not been used at this time. I am sure it will be used many times and passed down to the next generation, along with many memories of family time spent together making good food.",
        "This isn’t a chinois! This is a strainer/large food mill-type China cap. I bought this to replace a beloved but perforated chinois that I used to make my raspberry chipotle sauce and berry coulis.",
        "I did a lot of research before I got one of these. I called my Granny and she told me the one she's been using for years (50+) has been soldered back together (handle) on at least one occasion. And she said don't get aluminum. I intend to continue to make apple-butter and jams with it. It cleans fairly well, and the stand is well balanced. I wish the wooden pestle had a slightly longer handle for less mess. I will just keep looking for a dif. pestle.",
        "My daughter loves this product She is making wonderful baby food and applesauce. I’m so glad I got it for her",
        "My wife has borrowed my mother's chinois for years; so I bought this worried about the quality compared to the old one. When it came, our fears were dispelled. This is a well-made and full functioning chinois. If you need one, look no further. This Fox Run set was also a fair price as well.",
        "Really, really annoyed. The pestle does not fit. It needs to be wider and longer. There is about a 3/4 inch gap between the pestle and the straining surface. Fox Run, usually a reliable company has made a nice sturdy product then just contracted any old piece of wood to send out with it.",
        "The metal nose on tip is next to impossible to clean",
        "this works great for plums to get the most out of them",
        "I like parts of it, the stand is the real problem. It's top heavy.",
        "The product is labeled as a chinois and described as \"strainer features a fine mesh\". It is definately not mesh, it is metal with small holes stamped in it (a china cap). It works fine for what I needed it for, but someone looking for an actual chinois should look for a different product. I have uploaded several images for reference.",
        "Not a mesh chinois at all. It's a China cap; a solid metal cone with holes stamped into it. It's well made, solid, and beautiful. Good piece of equipment. But don't be fooled by the picture - I think it's the low resolution of the photo that makes it look like this has a mesh screen, like a chinois. But it doesn't.",
        "There are several things wrong with this device. The vertical braces that hold the upper rim are impossible to clean after the first use. The lack of detachable legs present additional cleaning and storage problems. The small circumference of the unit makes filling large pans with apple sauce impossible. Also, the reamer's end wore off during the first use. The manufacturer would do well to find some antique models of the same device and just copy them.",
        "This is described as a chinois \"mesh\" strainer. It is not! It is nothing more than a conically shaped colander with small holes. Quite a deceptive description. I'm returning it. Amazon is very good about their return policy.",
        "Very large bowl that can hold a good amount of fruit/mix. The pistol is very narrow on the bottom end, more narrow then I think it should be, but this is easily resolved by using the handle end when first starting out and reverting to the narrow end when finishing up.",
        "Very nice product. In very good shape except for one tiny ding in the metal rim. Probably done during shipping otherwise very good product look forward to using this item.",
        "I don't really know what to put here. I bought it as a gift to someone that told me they would love to have one. They took it out of the box and haven't used it at all. it looks sturdy and is well made. we get compliments on having it. guess Im satisfied lol",
        "It's been several years since I made apple butter & this year I really wanted to do it again, but I'd gotten rid of the family ricer. I was really searching for one when I found yours. Perfect for me & it got the job done. Thanks",
        "My Mom had one of these. She passed and it was sold. I worked around the harvesting of my tomatoes for years. I finally broke down and purchased what my Mom used for years. I now use it to reduce the tomatoes to juice with pulp minus the skin to use in sauces. I truly love it.",
        "wife uses it even though it doesn't fit down in the stand like it is supposed to. was not going to the trouble of returning it",
        "This is the second one I purchased so I would have a spare. The product works well and is easy to clean. I would recommend this food mill to anyone who does home canning.",
        "Quality! This is a wonderful chinois! Works just great! So glad I added this to my kitchen tools collection.",
        "I had one of these years ago that belonged to my Mom. But this was for a good friend who complainded to me that she had nothing like this to use when making jelly. I ordered this one and Dixie was MOST pleased. This one is stainless steel and as a handle - neither of which my chinois possessed."
    ]
}