{
    "entity": "Food Strainers",
    "text": [
        "Works GREAT for straining chicken stock. No dealing w/ cheesecloth or flat/round bottom strainers. The tightness mesh & narrow cone of the strainer extracts more stock, more efficiently, without increasing cloudiness compared to cheesecloth. Balances well on the side of the stock storage container. Would buy it again in a heartbeat.",
        "I bought this to strain homemade yogurt for Greek yogurt & labneh. The first batch it worked quite well but subsequent batches the curd goes through the mesh. I want the really fine creamy texture & don't want to do much to increase the curd size. So back to cheesecloth. I did make a large batch of chicken stock and it strained beautifully - crystal clear stock. It also works well for sauces and custards. So although the yogurt was a bit disappointing, I'm still very pleased with this for all the other uses of a fine mesh strainer.",
        "I bought this as a gift for my chef boyfriend. He has been using it for months making soups and purees of all kinds and loves it. In fact, I found out later that it's the same exact chinois that they use at his restaurant. High-quality professional equipment. I know a few other reviewers found it too big to comfortably use, but he said he would not want anything smaller. He's very very happy with it... chef approved!",
        "This strainer has been a a game changer for me when making soups. It does a great job straining homemade chicken broth. Wish I bought this years ago! It is quite large though, so storage could be an issue for some. I keep mine on the top shelf in my pantry.",
        "If you got or bought a nice blender (VItamix, Blendtec, etc) you should really get this to strain your soups so they are perfectly smooth. I made a ginger, butternut and carrot soup and it thought it was perfectly smooth, but after straining through this, I discovered a small mat of tiny fibers at the bottom. If you get this, also get a 2 oz ladle to help push the liquid through the chinois.",
        "Besides the screen having a slight deformity in one spot, it's a good strainer. The area on the screen that is deformed did allow some stuff to get through that we didn't want to.",
        "This is one fabulous strainer! I bought it for my yogurt making, but have used it for so many other recipes! I clean it immediately after using because it looks like it would be a bear to clean is anything dried in the screens! Tip it upside down in a water stream and it's done. LOVE it!",
        "All you really need is this strainer. Multiple uses, heavy duty, hot/cold, works like magic. Do you want that translucent broth that everyone loves with no specs. Bring your broth to boiling, use this strainer and a coffee filter or two and comes out golden!",
        "Having this strainer is a joy. It will not rust (like the one it replaced) and is high quality. Proper design with stainless steel mesh strainer and composite handle and frame is well made. The two rest hooks on the frame means that it will not fall off your container when loaded during straining. Job well done.",
        "This bouillon strainer is also known as a chinois. It's a very fine mesh strainer. I searched far and wide for one of these but to no avail. Took the plunge and bought one here. VERY happy with it. Useful for straining stocks and sauces. Also useful for home brewing. I no longer need cheesecloth for many of these applications. Two hooks on the side make it very stable. The wires that surround the mesh protect it against bumps. It should last a very long time. Wonderful.",
        "Best chinoise strainer I've ever used. A little large for a home kitchen, but not unreasonable.",
        "Works great. Way, way better than the cheap supermarket strainer I was using before. Catches a lot of cloudy crud from my soup stocks, and works pretty well for getting a nice smooth puree if you work it a bit. The one thing I would mention is that it's bigger than I expected, and with the addition of the guard, it's too large to rest on the rim of my stock pot. But hey, an excuse to get a taller stock pot! Can't complain!",
        "Beautifully well made piece of kitchen equipment. Not cheap but worth adding to your \"List\"!",
        "Strainer is lightweight and easy to use. I'd prefer a standalone but most of the time, you'll put it in a container when you're straining something. The handle is easy to grip and the plastic part helps to keep it steady in your hand as your pouring liquid into the strainer. It's a bit pricey but worth it!",
        "This worked extremely well for straining homemade chicken stock. As others have mentioned this strainer is very large (especially lengthwise) so having an extra stock pot or tall container is useful..",
        "Love the filtering quality of this item. It’s quality is impeccable!",
        "Best strainer EVER!!! I make nut milks and use this strainer, it has shaved off 10 minutes each time I go to make my nut milk. Now I've used it to make berry ice cream. All seeds and skins left behind. Ice cream silky smooth. Yumm!",
        "This strains like a champ - the very best I've ever had. However, it's rather unwieldy and can cause arm strain if you've got a big job to do. It would benefit from a stand.",
        "This is a chef's tool. You need a large bucket under it. Chefs use it to create flavoring for special sauces. They cook vegetables and meat in a pot, run everything through this, and get flavorful base sauces for gourmet cooking or demi glace. I purchased a small, stainless steel ladle to use with this strainer. I'd guess the cup of the ladle is two inches wide. We use it to smash stuff into the tip of the strainer cone to get all the flavor possible from a bouillon base without any particulate matter slipping through. Fine mesh. It's not a tool the average cook would use often, but cooks who strive toward perfection will use it fairly often.",
        "We bought this to strain homemade yogurt in 2013. Still working great!",
        "I bought this strainer to strain my home made broths. It works great. I also used it to strain grease after frying home made french fries. The grease it so clear.",
        "This is my go to strainer. Fine mesh, easily cleaned. I chose a larger size than I really needed, but that is really not an issue for me.",
        "I bought this f. amazon after reading on blog that this strainer would work well for making Greek yogurt. It is a very fine strainer, but a cotton cloth is a much more effective tool for the yogurt. I thought the strainer would make less mess, but as often as not, the yogurt would strain through with the whey. It was too expensive for sub-optimal performance. It is a good quality item, however. So will rate it highly. Just not useful for my particular application.",
        "Does the usual chinois thing, straining out solids from a stock. It's also sturdy and the wire bumpers protect the fine mesh. I do wish those bumpers were set up so the thing was capable of standing on its own, but I do suppose that would require a number of other design adjustments. Either way, of the available chinois, this is excellent, and given the care taken to protect it from the depredations of a busy kitchen, probably worth the extra cost in the long run.",
        "I Love home made greek yogurt. Rather than the hassle of cheese cloth, I bit the bullet and bought this strainer. The only thing you have to work around is that when a product needs to filter for a long while and be refrigerated, you need some kind of container. This strainer is very long. I found that it works over a plastic waste paper can. It does a really efficient job and I don't have to work with cheese cloth. I'm glad that I bought this.",
        "We regularly use it for making greek yogurt. To make greek yogurt place the regular yogurt very gently (using a big spoon) in the strainer and let it strain for 6-8 hours in a cool place. It effectively loses most of the whey with minimal loss of yogurt (less than 2%) and makes very good greek yogurt.",
        "I can't believe I lived without this. I mostly use it to make fresh almond milk, but I used it over the holidays to make silky smooth gravy. No more nut milk bags. Cleaning is a breeze. Such a fantastic product. Worth every penny.",
        "I have used this particular chinois on multiple occasions and at this point I wouldn't even consider using a different one. Downside: Damn these are expensive Upside: This will make you're sauces, custards, etc amazing every time! Overall: I will continue to buy these for every restaurant that I work at!",
        "I have been using it for a year or so to strain yogurt and cottage cheese, and it works perfectly. Perhaps sometimes hard to wash but further than that no complains.",
        "Absolutely LOVE this product. I thought it was a bit pricey when I bought it. But it is a must for anyone who makes a lot of broths. No more cheese clot for me. This is perfect. If you clean it right away then clean up is a breeze. Don't wait for things to dry on. (You can still get it clean but you will have to soak it first.",
        "I've used this for over two years to strain my homemade yogurt into Greek style. Easy to use and keep clean.",
        "I've been making yogurt for several months using cheesecloth to strain it into \"yogurt cheese\". I didn't care for how messy the cheesecloth was to use and used several packages before finding the Bouillon Strainer. It works beautifully and is easy to clean.",
        "Pros: 1.Sturdy and high quality materials used. 2. Very fine mesh 3. Works well in making Greek yogurt Cons: 1. Expensive Recommended if you plan to use it frequently to justify the cost.",
        "I bought this to use whem I am making Greek yogurt. It works fabulous and has really been a time saver. I would highly recommend this to use for this purpose. Also it has no metal on the rim so it will not be a problem with rusting.",
        "This is the best fine strainer to make clear brothes and sauces. The Matfer 7-7/8 inch Diameter Bouillion Strainer is well made and now the world is right again.",
        "I use it for straining Greek yogurt I know it is expensive but if you like Greek yogurt like I do and do not want to spend 20 minutes cleaning the cloth needed for straining yogurt each time then this is the ticket, I use it all the time It is strong, looks good, cleans up in 2 seconds (turn upside down over sink and use sprayer) Dishwasher safe, Holds 2 quarts easy",
        "Well worth the price! I make my own yogurt and straining has always been the worst part but this has made it a breeze.",
        "I use this to make greek yogurt. I've used cheese cloth and the cotton bag that came with the yogurt maker, but this is the best. The price is a little high, but for the hassle of cleaning and loss of yogurt I previously had, I find it's worth it. After straining, almost all the yogurt slides right out. The tablespoon-ish amount left is easy to scoop out with a spatula.",
        "Works well but takes up 1/2 the dishwasher! This baby is BIG as in deep so you won't be balancing it on the edge of a 12 inch bowl.",
        "If you want to make fresh juice, this is an excellent took, well made, heavy duty, cleans up pretty easily.",
        "This thing is great if you make stocks on a regular basis. Far better than other strainers, its large size makes straining stocks a snap.",
        "Easily makes Greek yogurt! Its a pricey investment but worth it. I bought this after trying to use cheesecloth to strain yogurt.",
        "I didn't know this strainer existed before I was trying to help my daughter with a dianosis of Ulcerative Colitis. It is a great tool and I have given them as gifts to my daughter-in laws too! It is great for making stocks and jellys! It arrive in perfect shape. Martha",
        "I purchased this to make Greek yogurt from regular yogurt. This is a huge strainer. It is well made with a good handle. It was worth the investment.",
        "Matfer quality, Really well made, very fine mesh and a very affordable price. We use it all day, everyday. Run it through the dishwasher, easy to clean.",
        "Very good strainer and very solid but unless you are a restaurant or have huge pots, it is difficult to find one that the strainer won't tip over from the weight and height of this strainer/chinois. Once ou find the right combination, it is really good.",
        "I recently purchased this item to strain the whey from homemade yogurt to make Greek style yogurt. To my disappointment I found it does not strain as fine as the Zimtal Nut Milk Bag I had been using. It has a bit larger capacity than the bag, but allows more of the yogurt to bleed through along with the whey, resulting in less of the finished product. The bag worked much better and I wish I hadn't wasted my money. In addition, it is a rarely used item that is a storage challenge. This purchase was an expensive lesson. I am going to buy a second nut milk bag and list the Matfer strainer for sale.",
        "I used this very one in culinary school, and it is a fine mesh chinois but not the finest but then again maybe I am being picky. I did return it and am planning on buying a finer mesh chinois but this is a very good one and better then what the average home user needs!!",
        "Nice construction but WAY too big to use effectively or store. Returned it.",
        "Works like a champ for yogurt. Pricey but better than others. First, wet the screen entirely then gently place a little yogurt in the bottom area. Do not dump yogurt in. It must be spooned in softly. Thin yogurt may tend to drip through the screen with the whey. Thick yogurt will not do this. It drains faster than any kind of cloth I've used. I give it a 5 star and thumbs up. A good investment.",
        "I purchased this item Used-Acceptable from Amazon Warehouse. Item arrived earlier than expected. The condition was much better than anticipated. The mesh had a few spots where the the wires were 'mis-aligned', but I would not go so far as describing it as 'damaged' (pictured). There is also some areas near the top where the plastic 'bled' into the mesh during the manufacturing process (pictured).",
        "Yes, it is big and takes up space in the kitchen. Yes, it is expensive....BUT if you make bone broth all of the time, it is worth it! This strainer is high quality and makes straining my home made bone broth simple! To me, it is worth every penny!",
        "Worked really well on straining my homemade yogurt into Greek style yogurt. It has no problems straining store bought yogurt as well. Haven't tried it for other cases yet.",
        "I bought this strainer to strain my regular homemade yogurt to make greek yogurt. It works great for this. I also used it to rinse quinoa which goes right through most strainers. I'm gradually replacing my cheap kitchen utensils and cookware with high quality items that really work and will last and this fits the bill.",
        "I have over 8 strainers in various sizes. This is one of the best. However, the price is expensive.",
        "Got to strain yogurt, used to use coffer filters with regular sieve. This is a BIG improvement! All the yogurt fits in one batch. Not messy at all, rinses clean under faucet",
        "I work in a high-end restaurant in Chicago, and bought this strainer for my home as it is the same ones we use there. It is as great as the expensive chinois I have used in the past. It handles hard, regular (professional) usage and is pretty easy to clean; I usually give it a good rinse in the sink and pop it in the dishwasher with no problems. It is pretty large and tall too, so use a tall stock pot with it if you can!",
        "This is a very heavy duty strainer. I've used it for purees and straining stocks and sauces.",
        "If you want the finest mesh strainer for soup stocks and sauces, I think you don't need to look farther. About the only thing about this product is that mine came without the stand or pestle, so I have to find these separately. But the strainer itself is excellent. For uses that don't need the size of this strainer, I findto be almost as good just smaller. The CIA one is single mesh but the pretty fine mesh, little practical difference.",
        "Yep, it's definitely big. I don't have a single vessel this can stand in, so using it is cumbersome and wobbly. It does a terrific job of straining, though!",
        "I have been making yogurt at home for years but always had a hard time getting extra water off it (I don't use whole milk). This strainer makes this part of my process so much easier. Saves time too!",
        "This works perfectly for straining my homemade yogurt. With it, I can make a full quart of Greek yogurt, saving me much valuable time. It cleans perfectly in the dishwasher, but the sprayer on my sink works well to clean it, too.",
        "I use this for making stocks and bone broths. It's pretty big, but once you make a few batches of bone broth, you'll appreciate the size and all the bones and other stuff that it can fit. Performs real nice in filtering the brother resulting in a very clean broth.",
        "it's big. I have a good grips that has the same cross section screen. This one is out of my league.",
        "Works great! It works great to strain yogurt. The large size allows me to strain 3 quarts of yogurt at a time.",
        "Huge, which makes it cumbersome to store, but worth it. Works great for straining large batches homemade yogurt.",
        "The only strainer i ever use, at work or home its just the best quality out there!",
        "It's a great item. Don't know why it's so expensive, though.",
        "I was sent three consecutive strainers with stretched holes at the seams. Other people seem to have had the same issue. This is totally unacceptable for the price point.",
        "This is just as all Matter products, very very nice. However I was hoping for the price and the reviews that I would be able to obtain clear broth with it. Unfortunately it is still not fine enough for what I am looking for.",
        "Love it so far. The seems in the mesh have some larger than average holes but most do that I've looked at.",
        "I balked at the price but now that I've used this strainer several times for straining whey from yogurt ...I love it. I can completely control the thickness depending on the time in the strainer. It cleans relatively easy (by hand).",
        "Gave this as a Christmas gift to a couple of gourmet cooks. They were quite pleased. It is very well constructed and was a very good price compared to similar equipment on the market.",
        "Very nice product, appears to be of excellent quality and likely to last a long time with proper handling. The mesh is appropriate and the strainer is well balanced. But, er, it's HUGE. I did not realize how large the item was and consequently was not able to use it...the only thing I had that was deep enough to accommodate it was my 16 qt stockpot, and that was just not practical. But as usual, Amazon comes through with flying colors on it's return policy. If you are looking for a good (large) chinoise, this is a very good value.",
        "This is one solid piece of kitchen hardware. It took a while before I could get my self to pull the trigger on this; but now that I have it, there are no regrets. It's very solid, and the Exoglass is an impressively rugged material. The mesh on this works like magic. It has the ability to strain liquid very easily (with hardly any stirring) while catching the finest particulates. If there was a strainer on the space shuttle, this would be it.",
        "Excellent product. Easy to clean! Now I can make a lot of new recipes... I am very happy with this purchase.",
        "Excellent product. My son's instructors were very impressed. The Exoglass holds up much better than strainers made from other materials.",
        "This is a really good strainer made with good quality materials and will specifically be useful for yogurt making for example. The reason I give it a 3 star review is because cleaning up this strainer with such a tight mesh is really complicated.",
        "I wanted one of these for a long time so I ordered this and the idea is great but it's a big size so you have to use with a big bowl under. It doesn't stand on its own so you have to somehow steady it while pouring at the same time."
    ]
}