{
    "entity": "Spade Drill Bits",
    "text": [
        "Before buying I read the other reviews that said they are bent and not worth buying. I decided that I would try my luck since amazon makes it pretty easy to return things if they aren't right. The package I received had 7 bent bits out of 13. Some of the other bits had damage to the tips. I ended up returning them.",
        "Nice assortment of bits for the price. I was using them on damp pressure treated lumber and they worked just OK, but that is really tough/gummy stuff to drill. Standard, dry dimensional lumber was a piece of cake. They come packaged in a roll-up case that can be fastened with a velcro strap. I saw one review mention something about the run-out on these bits. I wouldn't worry about that. Spade bits, by their nature, are for rough boring. If need better accuracy or a cleaner hole try an auger bit with a screw feed tip.",
        "Has worked great for many projects now, case rolls up and velcros to itself to make a tight roll. They have been fine for me so far, having used almost all of them and having used a few several times already, on multiple pieces of real wood, plywoods, and on a milkcrate. Just used it today to make a hole for my keyboard wire in my desk. will update as i wear them out.",
        "We bought this to install our door sense for our August smart lock. This did all the work for us. If you have on of theseI recommend to get this if you don't have the necessary tools yet.",
        "Bought in Sept, and they looked good. Loved the carry-pack. But finally I went to use them. Omg, most of them are so bent, the tip spins in up to a 1/8 inch diameter arc. Put that in a drill press and try to make a true hole? Not a chance! And one has a chipped/deformed cutting edge that i know will preclude it from working properly. I thought a Black & Decker product would be much better. I am outside the return window for Amazon so will try to work with the supplier. So if you buy, I recommend you put each in a drill immediately to check if they run acceptably true.",
        "Not the sharpest, you have to really push it through, bought as a simple home set so I wouldn’t need to drag tools to and from work. If your doing rough in stuff(not visible) or want to burn a bit up going through nails and not care this is for you.",
        "I have used these bits to drill holes for arcade buttons. I also used them to drill a very deep hole through some 2x4s in my attic in order to pull some ethernet cable / install a new drop in my bedroom. Good thing I had these because none of my regular drill bits would have been long enough! Some might argue why not buy a more prestigious brand. Well my argument there is, they do what they are supposed to do - cut! For the hobbyist who doesn't use these all the time (like me), they will probably last me my lifetime.",
        "Bought these to install solid lights in a very solid constructed wooden deck. They worked well for that purpose, I also used them to run Ethernet cord throughout my house. Ignore reviews from people that are telling you that these are cheap and that they break easily. You'd have to go out of your way to damage these.",
        "These are good bits, in a good holder. While not industrial quality, the bits work well, and seem more than sturdy enough for average homeowner use. The storage roll may be a bigger selling point, than the bits themselves. Finally, someone realized that those cheap vinyl tool rolls that crack and let things fall out of them right away, are not much better than nothing at all. This is a sturdy roll up pouch, with an elastic band to hold every bit in place, and a protective strip to keep the bits sharp, and not let them poke through under normal circumstances. The pouch itself seems to be either fairly heavy canvas, or Cordura, and should last a long time.",
        "These are handy-man/home owner quality, but for the price they are a very good deal. Spade Drill Bits are very easy to keep sharp with a file, so unless your force (burn) them they will last quite a while. BTW: even high end spade bits die when you hit nails or wall plaster with them. This is why I don't bother with high end bits.",
        "I haven't had the chance to use these yet but they seemed really well-made. They look sharp enough as well. They'd have to fail horribly at drilling holes for me to be dissatisfied with them.",
        "Built an art table for my children with a ream of paper on a dowel to feed through and over the table so they'd have a constant supply of fresh drawing surface. These bits were perfect for drilling the holes in the legs for the dowel to hang through. Makes quite a mess though! Wear your safety goggles.",
        "Many of the bits are blunt with burrs or slightly bent. I didn't realize this until I first used one of the bad bits, which was well after I could return the set.",
        "I never buy B&D tools, mainly bc I've had nothing but problems out of them. But since these are just bits, and inexpensive to boot, I decided to go for it. The case is nice, useful and compact when rolled up. Big plus. The bits are decent quality, although I wish they were notched for my impact. they seem to hold up nicely, but I'm sure I will be filing them soon bc bore bits dull quickly. Overall, it's a solid buy and comparitive to the more expensive sets at half the price",
        "I keep these in my cordless drill bag and use them all the time. Pouch is very handy at keeping them together. They cut great. More than adequate for the avid DIYer. Definitely worth the money I paid for them (under $10).",
        "Hex shaft is not a standard size. It is much smaller than any of the bits like these I have seen. They cut fine but do not fit My DeWalt cordless hex drive. If You plan to use these in a drill with a chuck then this is the set for You.",
        "After first use, they made the hole I needed but it was pretty knurly. I don't expect spade bits to make a perfect hole, but these are a bit worse then I expected...",
        "Poor quality. They didn't even pass a visual inspection. Not worth it.",
        "this is a great spade bit set and I am happy to have such a variety of sizes all in one set. the blades are sharp and have been consistently reliable and durable through a number of house projects and homeowner use. I was pleased with the price paid and the quality of the item. the case rolls up nicely for easy transportation and to prevent the bits from falling out and it also protects from getting poked by one of the bits while moving the set. works very well and is a high quality item.",
        "I like the short shafts. Great for areas with limited access. Not the highest quality. First nail and they are done. But the length makes up for it.",
        "I needed a specific size of spade to complete a project and this set fulfilled my needs...love it",
        "Gets the work done. I'm only using them for my plastic totes. Perfect for what I need.",
        "Got them today and used two of them tight out of the box. Very sharp and work well. Good price, fast shipping!",
        "It arrived on time, the deal for that many is awesome, and I suggest this to everyone. The packing was great because it has the case that you can put them back and have them organized.",
        "I put the largest bit from this kit through absolute hell with a recent custom HT install, I honestly thought I would destroy it on my first bore but after snapping the very the tip off the bit, twisting the neck 180° and being beyond brutal working through some creative construction in the attic of an older house the paddle survived and my project was a success.",
        "I needed these to make a hole in some.wood for a lamp I was building for my husband. I figured I may as well buy the whole set bc the reviews were good and the price was just right. I'm not disappointed.",
        "Questionable quality. Was drilling an untreated pine 1x2 strip 1/2” deep. Very dull straight out of package? Should have spent the $10 on one good name brand not the size I needed.",
        "Very complete set and I was impressed with the bits as well as the easy roll up for storage with Velcro latch.",
        "These paddle bits do the job they were made to do quite well for many jobs. As with all things like this, they will eventually wear down. But with the price and convenience of these, you cannot find a better deal. Would recommend and will buy again should I ever need more.",
        "Just not good enough, particularly the bigger bits. I bent the two biggest bits and broke the hex base off the third. The 1” bit then lost its side metal sharp points in one hole through an old galvanized duct. The case is really nice and I bet the smaller bits are fine, especially through softer wood. Nice selection and quite cheap. I wasn’t gentle.",
        "I had bought because I needed only 1 special size that 1 piece cost too much. But Black and Decker in whole set were not much more cost.",
        "For the price, OK, but they're not well centered and not particularly sharp.",
        "Wonderful set of spade bits for a great price. I specifically needed a 1-1/2 in bit making an \"antique\" style ladder. It was less expensive to buy this set than to drive to my local big box and buy the one bit I needed. So in the end I saved a trip to the store and got the entire set for less. Works very well. No problems with holding their sharpness in my low use home.",
        "am enjoying them so far, have only used to put in a few doorknobs, so hope to use it on a wider array of things in the future",
        "They cut, but it takes longer than the bits that have the extra points on the wings. These wings are flat so it takes more effort to get it to cut.",
        "All were fine but the one inch bit had a slight bend in it that makes it wobble.",
        "I would recommend to buy other ones with lock option",
        "These bits are not centered. They would be ok for a hobbyist but as far as precision use, spend the bucks and buy quality!",
        "I like the fact that the set has a large selection of sizes they drill great",
        "Rust easily while stored and four of the bits have bent shafts.",
        "These work great for the price. If you always use in wood they will last many cuts.",
        "I was pleasantly surprised by these. For the price, i thought it would just be this little mini set, but I was delighted to see that they're definitely full-sized, strong and the roll up case is a definite bonus that saves a ton of room in the tool bag. If you need these, you can't go wrong with this set.",
        "Good set of bits. Especially for the price I've spent way more for cheaper made",
        "OUTSTANDING! Perfect holes - All I used was a cordless drill - the sizes are just right. Didn't overheat. Terrific product.",
        "These drill bits are perfect for what we needed to do and are very sturdy. The price was great, as well.",
        "Nice set of spade bits in a wide variety of sizes. Pricing was very competitive and I'm happy with the assortment! This will keep us covered for any needs for years to come.",
        "Good price and value from Amazon. Husband is very happy with this purchase as they fit his drill and he has used many of these bits already.",
        "I’ll be honest: I bought these on price. But every time I use them, I’m impressed by their quality.",
        "Good quality. Drilled holes for my aquarium base to pass plugs through, and they works great.",
        "The shaft of the bits were bent and smaller than a quarter inch (as advertised). It did not fit an extension I wanted to use so I returned it.",
        "Two broke while trying to cut a 2 inch wood board.",
        "Had no problems drill through pine. Came with a pouch for easy storage and organization",
        "The ones I got does not have the orange edge but the pouch is great",
        "Nice collection of drill bits. I used the 1 1/4 size to quickly cut through medium fiber board (MFD).",
        "Had to install a spigot into a plastic jug! This made the job take seconds to do! Love them!",
        "Not bad for the price. If you are looking to do professional projects i would recommend going for some Irwin Spade bits but for small projects these will do the job.",
        "This is a great affordable set of drill spades. The sizes range from 1/4-Inch to 1-1/2-Inch, so you're covered for pretty much any size hole you want to drill. The case they sit in is nice and it can roll up and fasten with some Velcro. Must have for anyone doing DIY projects at home.",
        "been working fine so far ,sharp and like the little case good price.",
        "I ORDERED THESE BECAUSE OF THE NAME AND PRICE BUT WHEN I RECEIVED THEM I FOUND THAT THEY WERE NOT SHARPENED LIKE SPADE BITS SHOULD BE. I REALLY NEEDED A SET OF THIS VARIETY SO I FOUND SOME IRWIN HERE LOCALLY AT SIMILAR PRICE",
        "Had to drill a few holes into a piece of 2\"x4\" pine and I managed to break two of these. I wasn't pressing hard and let them rest in-between holes...Cheap steel.",
        "great quality set in a nice wrap. These will work well. The only criticism is that I wish the idiot sheet that has the actual hole size that can be drilled for each could someone fit into the wrap. It is very handy and will help to have around....maybe taped inside my too box?",
        "Not too much to write. It's a comprehensive set that works fantastic. Filled a void in my life.",
        "These are great filters. This is a complete set that has allowed us to complete a project quickly due to the variety of sized bits. They have stayed sharp even after going through oak. Thanks, Dennis Shipping is fantastic, One Day, Wow!",
        "Very Fast Shipping! Great quality as expected! Awesome! Thank You!",
        "Very handy tools to have - these make quick work of putting perfect holes in wood.",
        "Lots of drills for a very low price, but they go blunt straight away, I would not buy this set again!!",
        "Product is clearly made poor. I used 3 bits drilling into wood to make a few home improvements ant they broke!!",
        "The bit holder is great -- it's almost worth the purchase just for the nice holder (thick canvas which covers the tips (not evident from the product photo) and which has velcro to secure it when rolled up. The bits themselves are fine -- considering the price, there's not much one can justifiably complain about...",
        "This is my second set of these drill bits. My wife liked my set so much I decided to order her one too so that I could keep mine. In one handy roll-up pouch I have the ability to drill holes up to an inch and a half. I carry my set in my portable drill case and have it with me whenever I'm working on a project. Good drill bits, nice set.",
        "very nice set well made great value trusted company rollup bag",
        "While this is my general use set I am impressed. So many sets work well first time cutting and then quickly fade. I have used several sizes a few times with the cut being easy and smooth.",
        "Excellent spade bits. And the roll-up tool pouch works amazingly well too: very compact when it's rolled up, and it holds the bits securely. Very nice combination.",
        "low quality bits do the job, if you need precision for finished surfaces you need to purchase higher quality.",
        "Product arrived on time and already tried some of the bits, they drilled through some pine and hard maple well.",
        "Not the best quality, spend more get quality. However if you are only drilling through drywall or soft butter go for it, they might last",
        "Not much to say... for the price these work great!!!",
        "Nice, good deal for around the home projects. I mean...you can put holes in a lot of stuff. I used them to put in a dead bolt. No Problems. Comes with a nice little roll up case...worth the money.",
        "Love the one I used so far. Needed a single 1\" hole bit, however this package was cheaper, easier for storage, and it turns out of extremely good quality. Easy to remove and replace from cloth roll up bag. Very sharp and precise drill bits.",
        "nice, sharp, has a pouch to keep them in , even no i dont need it, I hope Black and Decker continues to do a good job, and hope they can turn craftmans tools around again.",
        "The shafts are not true so the holes drilled are a mess.",
        "Quality product and easy to use as well as compact, I can fold these away and stuff in my pocket. Good price also, in the big box stores you would pay upwards of $10 each.",
        "i have every size i ever need here. and the best part is the pouch keeps them in place i know i won't loose them. am good for loosing things. thanks",
        "Good price and quality. I have used these for several jobs and they have done the trick",
        "As described and I have used almost every bit in the set now. I like the carrying case.",
        "Good set of wood drill bits. Affordable and durable for light use. Comes in a convenient case.",
        "some of the shafts were bent right out of the box",
        "Was looking for an inexpensive spade bit set that had a wide range of bits with some sort of case. This is nylon and rolls up which is fine. Great price.",
        "Great Bits I use these for drilling holes in tree stumps to place night light candles in... these make a nice smooth finish and go through the wood like butter",
        "Spend your money on something else. These don't work very well in my hand drill not in my drill press.",
        "Decent set of bits. Machining could be better. With a good sharpening these are good bits.",
        "Not much to say here. I needed to drill a hole larger than any one of my drill bits could handle. Job done.",
        "This is a very convenient spade bit drill set and while the cloth holder makes getting the drills out a bit of a challenge the way it rolls up and practically disappears makes it very handy and convenient when you want a particular size drill.",
        "I like to have my shop organized so I liked this product with it's case full of bits.I also like the brand name so it was basically a no-brainer when I saw this item.",
        "My boys had lost most of my set, so it was time to get a new set. I really like these and they fold up nicely.",
        "Very disappointed. Have used Black & Decker products for 40+ years. This set of bits were very poorly made. Used the 1\" bit in a pine board, 3/4\" thick, two holes and the bit was dull!",
        "Nice set, plenty Sharp, the different widths are helpful, they roll up in the pouch for easy storing.",
        "Great set of drill bits for boring holes Was received in great condition and was received within 2 day time frame",
        "otherwise they are great. For the price they are a really worthwhile investment, but if you are going to be using the bits more than 10 times each you should go with a better brand",
        "Product arrived in time and as advertised. The drill not set also.somes with a cloth pouch that rolls up for easy storage. Great product and sharp bits.",
        "good for my homeowner use...not sure if they would hold up for long for production use but that doesn't mattter to me."
    ]
}