{
    "entity": "Spade Drill Bits",
    "text": [
        "These are good spade bits, but the plastic pouch they came in is junk. They arrived at my door in one of those bubble wrap envelopes and first thing I noticed is they all seemed to be clanking around on the loose. Sure enough, the sharp tips on the bits cut threw the plastic storage pouch rendering it useless. There was a day when DeWalt would give you a proper carrying case when you bought a tool, and the cordless tools actually included the battery ! Kinda sad....this whole corporate greed thing these days. Well DeWalt......your corporate greed just earned you 2 stars on Amazon from this buyer, spend 10 cents and put a guard on the tips.",
        "These side drill bits are exactly what I was looking for, however I noticed after the fact that the 7/8\" bit was missing. It should have been inside the packet but it was missing (removed by someone along the way or just left out of the package?). Everything else was as advertised.",
        "I love this bit set but I just received it with one of the 7/8\" missing from them and that's so bad",
        "I needed the 1\" for drilling into stumps in my yard to add stump killer. I found I needed to drill a pilot hole before using the spade bit on some types of wood, but overall the bits are well made and got the job done. A nice addition to my DEWALT set of drilling tools. Would recommend to others.",
        "2 stars is me being nice. Come in a nice little pouch. Sturdy construction. Seem to cut well... that's assuming the stay in your drill. I was using them to cut holes in my wood door. I used three different sizes. All three of them eventually let go of my keyless chuck and fell out. The last one shot out and hit me in the shoulder. I'll literally never use them again and just go buy proven bits from home depot.",
        "3/4\" and 7/8\" bit missing upon receipt. Fortunately I needed the 1\" but figured time for a new set so went for this item intending to use the 1\" for this project and replace my old ones also in the other sizes. The bit I used today seems to be good quality. For the price and hassle not worth messing with trying to sort it out. I'll pick up the missing sizes as needed locally.",
        "These bits are good for casual use. I am an electrian. After drilling just a few quick holes through 1-2 boards it was becoming dull. The wood started to smoke really bad and kept getting stuck no matter what.",
        "Great value for the money. Good strong metal. I usually use paddle bits to go through the headers while in the attic and dropping lines. With generic bits I can get away with about 6-8 headers before I feel like the bit starts to dull and not have quite the effect as when it was new. Not the case with these bits, they've been going strong way past that Mark and aren't not yet showing any signs of dullness.",
        "Once you begin using this you're thinking \"wow this is great!\" and then 30min later you no longer believe what you thought initially... simply put, the drillbits get dull way too fast... I was working on installing electricity in a wall and was drilling through a regular 2x4.... if these drillbits cannot withstand a basic 2x4 you cannot expect to reuse in the longrun... if you're looking for a one-job drillbit this is the one... if you're looking for a reliable set of drillbits... do not purchase this item",
        "I use them for wood and and just a beginner in woodworking. My first spade drill. I liked them at first use. Thought ''hmm they are ok but too bad there are no wider diameter in this set, let me buy some other on the market and see''. Boy i never thought i would feel such a difference in quality. I bought one Bosch spade drill and Makita and they completely suck comparing to this set. They just dont drill, they burn wood, they stuck. But this set drills like a hot knife through butter out of the box without any sharpening. Very glad buying this set, recommend it 5 stars!",
        "These are fantastic bits. I bought these to replace my 10 year old set and the difference is amazing. These remove material effortlessly, even at the slowest drill speed. I was using the 3/4 bit to countersink for some lag bolts and had to be careful not to drill too deep. This set has every size you should need for any routine project and most anything else. These are a great value and another excellent Dewalt product. If you need spade bits, buy these.",
        "I had a particular requirement, which was to drill drainage holes into a dozen planters. I tried some other products sold here, but they behaved as though dull (even though these other products were sharp to the touch.) These DeWalt branded bits were better suited to this task. Would have rated higher, but I wanted sizes beyond 1\".",
        "These work as well (or better) as any spade/paddle bit. They are able to drill through any wood with the right speed drill. Haven't tried to use them on metal or stone because that isn't what they were designed for. They are less expensive than any hardware store bits (Lowe's or Home Depot), and these ship straight to your door.",
        "I'm not really a \"do-it-yourself\" person, but I needed a cord access on my desk, so I made one! I've never done that before, but I was pleasantly surprised by the outcome. I ended up using the 1.5, which I bought separately. It is the same brand, it was very easy to use and did exactly what I needed. The hole was slightly larger than the grommet, but I used a little wood glue and it worked just fine. Be careful when opening the package, those tips are super sharp and they poke through the plastic case it came in.",
        "They are great product but when It came it was missing 2 pieces !? It says 6 piece set it look as if some one took opened the product and took them out sending it back right away and wanting a new one !!!😡",
        "The blades seem sharp enough to do the job, but I was irked that the plastic package was purposely sliced open for some reason before shipping which could have been disastrous if the bits had slid out, not to mention it rendered the pouch not reusable for storage of the bits. When I but something new I expect it to arrive in new condition - not sliced open.",
        "Great little bit set. I actually prefer this plastic soft packaging, so it’s easier to fold up and carry with me or store for later use. Dewalt is a product that you know is going to be good, so there’s no issues there at all. This is a great spade set",
        "Bits are very sharp, the metal is heavy, certainly legit DeWalt. I have to wonder what kind of people there are in California that they eat drill bits and so need a cancer warning on it.",
        "I bought these drill bits for making holes in my pots for orchids and drainage holes for my other plant pots. I love that I have various sizes at my finger tips should I change my mind about my project! 😊 These bits are wonderful...so happy that I bought them! I use diamond drill bits for my glass and porcelain pots.",
        "I've been buying the cheap ones forever and finally decided to splurge on a nice set. I didn't think there would be such a difference, but there is.",
        "this is my second set. Due to the diameter of the shanks not fitting in my Drill Dr., I ordered a replacement set after 20+ yrs of use, and have since had the originals sharpened by a service here in town. Great having a backup set with quick loading Dewalt hex shanks. btw-the old sets came in a ballistic nylon carrying case, too bad they are no longer available here.",
        "Theses are the best bits for the money. I am a plumber and I have used every bit known to man. I drill holes in everything from plywood to 100 year framing to oak flooring and theses preform very well. They are very easy the sharpen with a file. Just look at the profile of one you have not used first. If you want the best bits you can buy get some WOOD OWL , wood chipper bits.",
        "Its a nice set however there is an oily residue on the tools, seemingly still from the manufacturing process. The case it comes in does not seem like it will last. Other than that for the price I paid it was an amazing deal.",
        "The bit is strong. The size options are good but since there a projected point in the bottom, we cannot get the same diameter hole till the bottom of the hole. The design should be to get the same diameter till the bottom of the hole.",
        "These arrived on time and worked very well for home use. I've already put them to the test and if you need holes on something... This will do.",
        "Second time ordering these! My husband loved them as a Christmas gift and wore them out so I got him another set for his birthday!",
        "Used 3 of them so far and became dull less than a week.",
        "I use these bits frequently and I think they last long than the other brand's. My recommendation is a five star item.",
        "I have only used craftsman and black and decker. Neither come close to this! I have wasted so much time in the past without these.",
        "Well packed, doesn't take that much space up in my tool bag and are extremely sharp and powerful used them for a few jobs or worked like a charm.",
        "Well designed tip (better than most spades). Digs in quickly and evenly. Worth the premium over the no names. When getting to 1inch or bigger consider going with other types of drill accessories. But that's the same for any spade.",
        "The spade bits are great. The edges are beveled so they don't chip as easily. The flimsy vinyl case is pretty worthless, but I'm happy to get a cheapo case to save on the actual tool. Reuse one of your old tough cases, or just throw these in a Tupperware, and you're good to go.",
        "Unlike other reviews, I received all five bits thankfully. Only used the 1\" so far but it cut nicely and the bit seemed sharp.",
        "More like one time use. Edge tips wore off on the first hole drilled. Thankfully I had only two to drill. Will purchase a more expensive set in future. Was hoping with the Dewalt name I might get lucky with the price.",
        "I used this to drill a hole in PETG plastic. If you go slow enough it works well.",
        "Used to drill holes in and through studs so I could fish my cat6/coax through.",
        "Good quality bits for drilling holes in wood love dewalt quality",
        "I used this for internet cable wiring. it drilled through stud easily. build quality is strong, no wearing or damage is identified.",
        "The product worked great for the holes I was drilling in alder wood. Even the biggest drilled worked nice.",
        "These Dewalt bits work much better than the previous set I had. They really do chew through 2x4's with ease. Highly recommend",
        "Considering the price... Use and dispose after a couple drills.",
        "This is where you realize the difference between a cheap tool and a Dewalt. It's more expensive but the job is done faster and cleaner.",
        "I love these bits, they way the cut is extremely clean. Super easy, no tear off, or damage the wood. I attached a picture one one of many holes I cut down to install an screw flush with the surface. I have use these bit on much deeper holes, 2 1/2 inches, and they did the job with no problem.",
        "good for my application and good value for money too.",
        "I like these far better than some others I have used with spiral shanks and more aggressive cutting edges. This takes slightly longer but allows for clean smooth holes and more control.",
        "They dull out fast going through wood, but if you know how to sharpen them. It's not to terrible.",
        "I used the 3/4\" bit to drill a hole to install a cam lock in a wood cabinet. No problem encountered. The drill bit did its job.",
        "I had bought a cheaper set on Amazon, they didn't last a day. These fly through wood and still seem very sharp and no warping. Remodeling a house and drilling lots of holes for wires through 2 X 4s.",
        "Nice foldable case. Dealt always is good quality and always gets the job done.",
        "After buying a couple varieties of made in china bent garbage I bought these and am so very glad that I did! No bent bits and due to the thickness of these I would be surprised if they ever did come out of alignment. I'm sure there are ever better ones out there but these have been more than adequate for me.",
        "Very good quality very brand. Well pleased with them. Used them on 2×4 2×6 4×4 and 4×6 very durable. Excellent price. I would definitely buy them again.",
        "Longest lasting paddle bit you can buy. I'm a electrician and go through bits like candy, these ones actually last!",
        "My husband got this for his birthday. Came in handy shortly after when he rebuilt his Moms wooden gate. Even managed to drill through some metal for a short time. Worth every penny!",
        "WORKS FINE AND USEFULL TO WOODWORKERS. POINT WEARS DOWN FAST MAKING IT HARD TO PLACE EXACTLY WHERE YOU WANT IT SINCE IT WALKS AWAY FROM THE SPOT.",
        "Been working good so far, really light use. I don't use it everyday. So they are holding up just fine.",
        "this is a good deal for the price and the bits arent cheap they are good quality",
        "Dewalt! Beautiful! Made good! Looks goods! Tackled my job with ease!",
        "Work great and are very sharp. Have held up well and even hit a few nails. Would buy again.",
        "A great set to carry in my drill bag. Has useful sized bits for most projects.",
        "Some people like Milwaukee, I prefer Dewalt. Never has let me down once.",
        "Super fast and sharp, works with a hammer drill great for the dence wood products. Great product that holds its sharpness. Supper good pricing",
        "I wasn't sure what kind of use I'd get out of these at first. I work a lot in my crawl space and when I found that my wood drill bits weren't \"cutting\" floorboards nicely, these came in mighty handy. I've used all but the largest bit and all I can say is they really saved me a lot of time! They bore splinter free, fast and smooth!",
        "These are the only paddle bits I will pay money for because they do not have those little wing points on the outside corners that other paddle bits have, which seems to chip off after some time and rend the bit usless. These bits last a good while before getting dull in my experience at work, using them daily on regular 2X4's.",
        "Have only used the 1\" for 1/2\" thick wood blocks and it hasn't seemed to degrade at all after a few hundred holes. Speed is crucial to have something like this last a long time. Don't let them get too hot.",
        "Just opened up the package and its missing 2 things... why...",
        "It's not very stable when I try to used in my drill.",
        "Another quality set of dewalt products, the cut clean, and sharpen nicely with my drill doctor.",
        "i was able to finely make a hold throught a stud to fish cable.",
        "i looked everywhere and this was the best value i could find. I've only used one of the bits but the quality seemed good.",
        "I'm glad I purchased this set.....dispite reading some of the reviews. I was needing a 5/8 drill space bit for a outdoor project I was working on & while searching online I came across this set. I drilled over 15 blocks of wood & the bit is still going strong. I will add that if you push the bit in the wood as it's drilling the bit will jam. Just take your time & everything will go as planned. This set is great & the price is even better.",
        "FEEDBACK: Great Item, Very Fast Shippin! A very nice Experience!",
        "I had a set of name brand new ones. Was drilling holes in recently cut down tree stumps and these made the job 10 times easier and faster! They stayed sharp even after drilling over 25 holes atleast 3\" deep.",
        "Worked well and fast to drill drain holes in the bottoms of planters.",
        "DeWalt products are my favorite. I have tried many and keep coming back",
        "Best spade bit set made. Pushes the quality of forstner bits, even in hardwoods. MUCH better than dog eared bits . Easier to sharpen and amazingly clean holes.",
        "I install a lot of different stuff.this bits drilled quick, going through hardwood is not a problem.",
        "Nice set of bits. Thought this was a really good price considering they are DeWalt. Bits have a hex on the back end to avoid twisting in the chuck. Seem to hold up well. I hit a nail and didn't see any serious damage to the bit.",
        "The tips of mine broke, might cause I was useing a impact agasint the back of a vanity for pipes but eh, still worked great while lasted",
        "I've only used one drill once, so far, but the whole pack feels like quality stuff and that one use was successful. Drill, baby. Drill. This is not a drill. I repeat, this is not a drill. That was my drill bit.",
        "Works better then the ones with the points on the ends of them.",
        "For drilling larger holes, you might need items like these after you establish a pilot hole. Recessed spaces for door lock catches would be one example, but there are many others. Highly recommended if you do shopwork or carpentry or are a handyman. Plus, DeWalt makes great attachments.",
        "I got the bits, I have not used them, they do look good, thank's.",
        "The set I received was missing the 3/4” and 7/8” drill bits...",
        "Love it. Just finishes installing my security cams with these tools. Cheap, shipped fast and sharp. I missed ordering the 2 feet drill bit, but was able to grab that at a local shop. The good feeling of having this can help you get your job done. My security cam system was languishing in the basement for almost a year :)",
        "Very sharp and seem to stay that way as long as you don't hit any hard metal like nails.",
        "Dewalt continues to offer superior products for the professional and novice alike who desires quality tools for their shop . These boys are a prime example . I would not hesitate to recommend them to others who desire quality tools at an affordable price ..",
        "Just what I needed to complete a job.Made it easy.",
        "What else is there to say, it's Dewalt. The product works great, just like most Dewalt products do. I like the fact the sides are rounded without spikes. It makes for a smoother cut.",
        "Successfully drilled a hole through the thin board on the back of a piece of furniture. Was able to mount and drive it easily with my normal cordless drill.",
        "Works as intended. I used these to DIY a pegboard and it worked great. Easy to use.",
        "Still going strong after a few months use. Good DeWalt quality.",
        "Very pleased with the quality of work. I would have given it 5 but I have not used it long enough to know how dorable it is. Very well-made however",
        "Totally Fine Transaction, Thanks. We would buy product again if needed.",
        "Helped me to finish up a cabling project. I also used the DEWALT DW1588 6-inch extension.",
        "These are great spade bits! I was looking for a set I could use in my impact driver and these fit the bill. They are very sharp and have always cut through wood very quickly!",
        "Love these. I can fold the pouch in half and slide it into a side pocket in tool bag. These are heavy, solid spade bits.",
        "Dewalt quality at its finest. It was a great deal and they have held up great.",
        "Had a dead tree limb so hard the saw would not hardly touch it. Drilled holes first then saw made short work of it. Best local price was $22.50 + tax bought individually and they weren't De Walt. Top quality, rapid delivery. great price. What ,ore could you want. Clearly 5 stars.",
        "Of course it's a good product - it's DeWalt. Hard to beat spade bits. These are sharp and ready to go as soon as they get to your front door.",
        "A really nice set of high speed wood bits that also can be used in 1/4 inch hex impact drivers that are popular now as well as conventional drill chucks."
    ]
}