{
    "entity": "Circular Saw Blades",
    "text": [
        "I am returning this blade because it the cost is almost twice what the Evolution equivalent is. I dont expect anything that is made in China to be worth more than something that is made in Japan or the USA. Another reviewer stated that Dewalt had stopped making these in the USA or change supplier and they did not last as long as the ones made in the USA. I have ordered the Evolution Power Tools equivalent. I just had the hope that Dewalt had a trial run and came back to the USA blades. LET US NOT PAY THESE BIG NAMES, BIG MONEY FOR PRODUCTS THEY MAKE CHEAPLY IN CHINA WITH QUESTIONABLE QUALITY!",
        "After many years of using the USA made blade which outlasted any other blade we had tried, the sell outs at DeWalt have now off shored the complete construction of the DWA7747 blade. Unfortunately, after using Chinese made blades before finding the US made DWA7747 , I'm expecting this Chinese blade to now produce the same sub par life and low quality cuts as all other Chinese blades produced. Nice job DeWalt on showing your true colors, not Black and Yellow but Red and Yellow.",
        "Only got maybe 100 cuts before it jammed up and bent on my dry cut saw, took it SLOW and used wax on most cuts too. Mostly worth it anyway because I had some small I-beams (W6x12), a dozen 2x4x1/4\", and some 1\" flat bar that needed cut and it would have been hard to do it any other way.... Amazing while it lasted, now I'm going to try the MK Morse one which is made in the USA like this DeWalt blade used to be and hopefully that can last me through the rest of my shipping container house project!",
        "A tooth fell almost immediately! Was cutting mild steel, only 1/8” with hardly ANY pressure at all! I am hoping this is an isolated even and it was just this particular saw that came deffective. I have other brands that have lasted quite a bit of constant use before getting them sharpened!",
        "I built a hitch basket out of .090 1 inch square tubing and the blade was dull by the end of the project. roughly 30 cuts in all. I used light pressure for the cutting process, basically just the weight of the cutting head and it was on a evolution saw. The factory evolution blade lasted much longer.",
        "I cut between . 095 material up to 1\" cold rolled on a Evolution saw. I've only used two other brand names in the Phoenix area (that's all there is) and with two teeth missing on my DeWalt blade, it out performs the others especially on flat cuts. I'll never try anything else, one learned an expensive lesson. There are cheaper blades out there, you will regret your purchase.",
        "I probably made 500+ cuts with this blade in 1/4\" steel angle, and square tubing before it finally started getting dull. I even cut quite a bit of heavy aluminum stock also with really good results. I was so happy with the performance I bought another identical blade and sent the old one to be sharpened. If you don't bear down and let the blade do the work you will get lots and lots of clean straight cuts.",
        "This blade is perfect for my steel cutting cut-off saw. I have made hundreds of cuts and the last nearly the equal of the first.",
        "Does okay, not as good of a cut as the Morse Metal Devil blade.",
        "Works as advertised. Packaging from amazon was a little odd, but I would buy this again or recommend it to anybody. This is the 2nd blade I have used and so far it seems to be much better than my original SteelMax Blade. I would not throw out a new blade specifically to upgrade to this one.",
        "We use this in a police evidence room to cut up guns the court orders destroyed. The women make it look easy.",
        "the blade cuts well , but its not really that much better than the lower priced Oshlun. Personally I wont spend over $100 for this blade when the Oslun is $71.00 and i get as many cuts. theres not a sharpener in my area, so i dont know the price of resharpening these blades.",
        "This thing will cut 3/8 steel plate so fast you will think you are cutting plywood... very impressed",
        "Cut 57+ pieces of 1/4\" x 1-1/2 angle iron w/o problems. Perfect fit on my DeWalt dry cut saw. Arrived ahead of last delivery date.",
        "We've only had this blade for a couple of work days, but can verify that it cuts well. It cuts quickly and cleanly. We're very happy with it so far.",
        "The first one lasted for 3 years of moderate use, estimated 1000-3000 cuts (no idea). I bought a cheaper one to replace the 1st and it only lasted 1 year. Ended up buying another Dewalt.",
        "Well, I don't know what I could say about a Dewalt product. But the pricing is spot on.",
        "These blades last and last, amazing how much steel can be cut with one blade. Leaves nice clean edge that is warm at most to the touch.",
        "love it but had to buy a new saw with lower RPM to use it safely per instructions on packaging. Our Dewalt was too fast.",
        "I didn’t know that these saws existed. I love it. I cut one inch hot rolled mild steel bar with it. It lasts longer than I expected(three months and counting)",
        "I have been using a band saw in our home fab shop for 35 years. I just bought an Dewalt chop saw and this blade. I WILL NEVER GO BACK TO THE BANDSAW. This blade is AWESOME!!!!!!!!",
        "This the only saw blade that I use ,it provides excellent quality, great performance and durability .",
        "Granted this is part of a new chop-saw, but I've never used a saw that cut aluminum like it was wood. What was a 15min cut with a recip-saw became a 20sec one with this bugger",
        "I've tried cheaper blades...Don't bother. this blade lasts ten times longer.",
        "Great cold saw blade for metal . Highly recommend it .. I have ordered and used many. Best blade and best prices I have found. Outlasts other brands by far.",
        "This is an overall good blade. We chop some steel and a lot of aluminum. This is the same blade that came on the saw. Since we chop a lot of aluminum we purchased aluminum specific blades. This blade is much better on aluminum than those were. Their shipping was excellent.",
        "This blade cuts perfectly! Only thing I don't like is that I put up with the blade that came on my Norther Tools saw for a year. My advice- throw away the cheap blade and buy this DeWalt, best investment a metal worker can make!!",
        "I find this blade to out-cut the carbide tipped porter-cable blade. It’s been in service for the past five months and still cuts like the first day",
        "Works great for cutting our threaded rods in our Assembly operation. As long as you don't force it through the metal. it should last for many cuts.",
        "Best aluminum cutting blade on the market. works great for steel as well, but we cut alum 95% of the time",
        "excellent blade, goes through 1/4 inch steel like butter. ive owned 3 so far. every day use in welding shop. they last me about 8 months. and im not easy on them",
        "Longest lasting blade I've used so far. I've tried the evolution and metal devil blades but they don't last no where near as long as dewalt.",
        "do not attempt to cut bed rails with this they are tempered beyound belief",
        "my dewalt is fast for this blade is the best cut cool yea!!!!!",
        "It did cut good for about 15 cuts then the teeth started breaking off.",
        "GREAT QUALITY DO THE JOB I BUY OTHER BRAND AND WELL I DONT KNOW IF THIS ONE IS DISING FOR MY MACHINE BUT THIS ONE WORK GREAT",
        "I've purchase cheaper blades than these, for a savings of 20-30 dollars. The cheaper blades last a fraction of the time that the Dewalt blades do.",
        "It worked great for about 3-4 weeks. Then it went really bad.",
        "Works great. Used properly, it will last for quite some time. Very satisfied. I use it in a mairenance repair shop for a construction company. Use it frequently.",
        "Worked awesome until an accident knocked the teeth off. Got it resharpened and a few carbide points replaced and it's back to great ($20) - so no big deal.",
        "Great quality! Cuts beautifully! Got it right away! I'm happy!",
        "Cuts cleanly and precisely. No flex or wavering. Just cut slowly and let the blade do the work. No more grinding after the cut.",
        "Tips break off after just an hour or so of using it.",
        "Works great in a Rage2 dry cut saw, but wanders a bit even at very slow feeds with 3/16\" angle.",
        "Use this in a shop with ~45-50 engineering students. They abuse it and it keeps going. Good value for the money.",
        "Gets about 750-900 cuts. I just took one to see if it can be resharpened. Last much better than other blades I've used..",
        "I bought this to replace the one that I bent. A piece of angle iron got jammed. This one works as well as the Milwaukee blade that came with the saw.",
        "I made 6 cuts in 2\" angle iron, 1/8\" thick. I was very patient, cut very slow, used an oil based cutting lubricant, and my brand new blade barely made it through the last cut. This is the first Dewalt product I have EVER had a problem with. I followed the included directions exactly and I have just wasted my money. Did I mention I was dissapointed?",
        "This is a very good product for the money, I've been cutting structural steel with the same blade for over a year. I always mist the blade with water when I'm cutting, seems to help keep the blade cool.",
        "Prior to this blade I've only used abraxive wheels in my Porter Cable chop saw. So far I am very pleased with how well this blade cuts through metal. My grinding after every cut has been \"cut\" down to almost none which saves me all kinds of time. I've only had this blade for a week but I would recommend this purchase to anyone using abrasive wheels. I'm amazed and unless this blade fails right away I won't be going back to abrasive wheels any time soon.",
        "These cutting blades are fantastic. We have be using these for more than ten years and a blade will make hundreds of perfect cuts through the equivalent of 3/8 x 3 x 3 angle iron providing you are sure to properly clamp the stock.",
        "Bought this blade to cut metal studs. Started out super but after 100 studs or so getting dull and leaving ragged edges.",
        "teeth started chipping right away now its useless after just a couple weeks of use.",
        "If you have been using abrasive wheels in your chop saw you are missing out.",
        "well if you have a saw like this then you already know how awesome it is.. as long as your work piece is clamped down securely, the blade cuts awesome!!! I totally recomend this blade and the saw it came with!",
        "It cuts fast and in the long run, it cuts more steel than the cheap blades for the same money.",
        "Ive been using been using these blades in my chop saw for years. Great value For the Dollars. Quick shipping too.",
        "Theses blades are incredible and when used properly work as good as any fine wood chop or miter saw. No one get's to use it that is not trained on how to. Cost is not prohibitive to the untrained. Still going strong after several jobs.",
        "When we first looked at how aggressive the teeth are on this blade it was a little intimidating. This saw and blade cut like no other. Amazing!!!",
        "I don't know how we got along before these blades and slow speed cut saws were invented, but if you're still using abrasive blades, you don't know what you're missing!",
        "Terrible lifespan. Tried the blade twice averaging about a month per blade. Bought the porter cable riptide, let's hope it's better",
        "The blade seemed to cut alright, didn't last very long, wasn't a real clean/smooth cut and it was super loud to use, I will probably run other blades before I buy another on of these",
        "it has 66 sharp teeth and garanteed to throw hot chips so watch out, and be careful not to use too much downward force. great for cutting up old pallets too",
        "The new DeWalt blade is like a new broom, it will gives you a clean sweep !!",
        "Works great but doesn't last as much as the older version 72 vs. 66 teeth",
        "I don't personally use this blade. I resell it. Most people who use this blade, give it a good rating and they seem to think it is well priced. I have bought these for some time and will continue to purchase them.",
        "This blade does not last much longer than an abrasive blade. Based on the cost of this blade, abrasive blades are less expensive to operate.",
        "This dewalt chop saw blade is the best blade I have ever used. When using this blade do not force the blade when cutting if done you could put to much pressure on it and brake one of the carbon tip. It would be a very expensive experience. I have purchased several of the blades for my 2 chop saws. I would purchase another one again.",
        "This is a great blade for cutting heavier guage mild steel. Runs smooth and can be resharpened several times to extend the life of the blade. Works well on my milwaukee saw."
    ]
}