{
    "entity": "Circular Saw Blades",
    "text": [
        "All of my work has been with extruded aluminum. Installed on a compound miter saw, this blade has made very smooth and accurate cuts. Absolutely no chatter on thin or thick stock. The thicker blade I believe adds to the blade's stability.",
        "I just received this blade today and took a few test cuts on on 1.5\" solid bar using TRIM 585XT @ 10% concentration for coolant/lube. I'm very impressed with the finish - as good or better than what I'd normally expect on a wet horizontal bandsaw! Cutting action was smooth and free of any chatter. While I can't say any radial saw would be my preferred choice for cutting Aluminum this did a fantastic job. I do realize this is not actually meant for sections over 1/4\" but it works very well. This saved me from buying a very expensive tool to add to a cluttered garage.",
        "This is my second blade. I cut aluminum with it and it works great. I used the first one for over three years, and cut from thin to 1/4\" aluminum without any problems. I bought a gallon can of WD-40 and used a spray bottle to wet the blade before each cut. The first one is getting dull (probably could be sharpened) so I bought another one.",
        "They shipped me the thin version of this blade THREE TIMES. I can't believe how much effort I put in to this and still don't have the correct blade. It is a great blade. I have had one for 2 years and cut 7075 Aluminum with it daily. But I am beside myself frustrated with this purchase.",
        "I purchased this to cut 3\" x 8\" PVC beams with an aluminum core inside. The aluminum was about 1 1/2\"x6\"x1/8\" thick rectangle tube. I got perfectly clean cuts through both the aluminum and the PVC trim that was wrapped around it. Because of the PVC being a finished product, I didn't use a lubricant like WD40 on the blade, but ended up not having issues with the blade gullets filling with metal. I also cut a few pieces that were 1/4\"x1 3/4\" solid aluminum and have no problems. Overall, I am extremely pleased with the performance so far.",
        "I'm building an \"Affordaplane\" ultralight aircraft. The aluminum is the toughest there is, and mu band saw could not touch it, my jig saw made it look like I chewed the aluminum in two, nothing would work. So I bought a cut-off saw but it came with only a metal cutting blade. I found this blade and bought it. It ate the aluminum like candy! I was actually able to cut a 1/16\" slice off a 2\"x2\"x1/4\" square tube. And after several hundred cuts, it is as sharp as the day I bought it. It is a bit pricey, but super well worth the cost. Try cutting a piece of grade 6063-T6 aluminum with anything else, and you will understand.",
        "We cut literally miles of aluminum extrusions with these blades every year. As long as you keep it lubricated with WD40, wax sticks or similar it sings, leaving a nice straight cut with minimal burrs or heat buildup. I've tried just about every ten inch nonferrous blade around, both cheaper and more expensive. If you're looking to bolt a blade onto a standard woodworking chip saw and cut metal, this one is the best.",
        "Works great for cutting extruded aluminum tubing (like 8020) on a good miter saw",
        "Seems to work so far... Will write more when it has proved itself in commercial use over time.",
        "Great blade that is capable of making some nice clean cut in thin-wall aluminum tubing. I suspect it will last quite a while with my sporadic use but, in the event I need another blade, I won't hesitate to repurchase.",
        "Awesome product. Hard for me to believe a blade can cut this smoothly with no sparks and does not even heat up the metal. Manufacture an aluminum hunting product and this blade speeds up the entire process.",
        "Very nice blade. Its much thicker and heavier than any blade ive had before. The extra mass helps stabilize it as it cuts so you get smoother cuts. The vibration damping slots work well also. The chatter and vibration ive learned to live with is gone. Its a little more expensive, but youll see why when you get it.",
        "This blade works very well cutting aluminum picture frame molding which is primarily why I bought it. A touch of wax stick to the blade provides a cut that needs virtually no touching up.",
        "Good blade. Cuts great. I would like one that the kerf is a little less. It's a pretty thick blade.",
        "Purchased this blade for cutting 6061 T6 Aluminum and it works great. Cuts very clean as it was designed to. Cuts through 4\" tube very easily. I would highly recommend this blade for any one looking for a high quality blade for cutting aluminum.",
        "I bought this blade to cut a plexiglass mirror. A different blade caused chipping along the edges. This metal cutting blade provided a very smooth cut. I am very satisfied with this blade and recommend it without reservation.",
        "When it absolutely, positively needs to be cut in half right now... Count on this.",
        "blade duller than a old blade missing 8 teeth I will attempt to get blade replaced with OEM Mikita",
        "Cuts nice and clean with no vibration or gouging. I do custom shower and glass barrier system installations. I like this 72 tooth blade because with care I can use it to cut both thin and thick extrusions and you don't need a large powerful miter saw which means I can save space on the truck.",
        "This blade is built heavy. I run it it my dewalt chop saw that should be high enough rpm. This blade cuts fast and clean.",
        "Cut through extruded aluminum and 2\" angle like wood. By far, the cleanest and smoothest cut I've ever seen on aluminum. Take it slow and keep it lubricated and it will last a long time. Sure does make a mess though.",
        "Cuts aluminum like wood. Be careful though. Your miter saw instructions will generally give you precautions to follow so that a given blade doesn't catch the metal (the piece that is cut off) and shoot it like a bullet off the back side of the saw.",
        "Working in my metal shop, my band saw motor gave up the ghost. I got a chop saw and added this blade to cut 3\" aluminum rounds. While I only cut a small amount at a time (then give it a chance to cool), it cut like butter and was an extremely smooth and straight cut. Far more accurate and about 20 times faster than my band saw. Highly recommended for cutting aluminum.",
        "I always use a dry cut blade made for steel on aluminum with good results, so I tried this dry cut blade on aluminum. This blade cuts very slow and leaves a large burr.",
        "Bought this blade to cut hurricane shutter did mine and two other neighbors still sharp and ready to go. Outstanding item.",
        "It makes long cuts in 1/4-inch thick aluminum (6061) smoothly, with no vibration or chatter, and leaves and excellent finish.",
        "I used it to cut through 80/20 extruded aluminum. It cut like a hot knife through butter. Would recommend to anyone cutting 80/20",
        "I USE THIS BLADE FOR 1/2 INCH ALUMIN A WORKS GREAT. I LOVE THE LIFE TIME WARRANTY AS I HAD ONE REPLACED.",
        "Since more than 10 years we use FREUD LU89M014 noon ferrous for cutting copper bar, obtaining a good performance and a long life, so we are happy with this product.",
        "i have not put into production yet, Freud blades are good quality/value blade's!"
    ]
}