{
    "entity": "DVD Recorders",
    "text": [
        "It sucked because you had to sign up for certain services that charge a monthly fee to see particular shows TV or Movie, if I wanted to pay for every little thing I would just have stayed with Direct TV.",
        "The TiVo is all that it promises to be. It has \"re-organized\" how I watch television by providing information about ALL possible showtimes for programs; among which I can then choose. The only reason I give it 4 starts instead of 5, is the REBATE. It is a long process, and even after submitting all documents and being approved for one, it takes 4-5 weeks MORE to receive the rebate check itself. It also does not have HDMI or component hook-ups. So though the Best Quality recordings (an option on can choose) are still good (through a digital cable box), it cannot record nor provide an HD picture. I hope this ability will come in the future.",
        "This works great. I am happy to be able to record programs again!",
        "Tivo is the most amazing invention since television. With very little spare time, it's wonderful to be able to sit down and watch all my favorite shows without having to plan and plot on a VCR. It makes all the best entertainment TV has to offer even better by making it available at your leisure. I guarantee you won't regret buying this. Other than you may find yourself watching a little too much of your favorite programming!",
        "Not going to beat a dead horse...there's plenty of reviews on this product. However, I love this product. I would recommend this to anyone that hates spending time watching commercials, hates flipping through channels constantly looking for things to watch, and likes actually being able to no-kidding own whats on the box and not have to lose all your recordings just because you change cable service providers.",
        "I was looking back to see what my first ever Amazon.com purchase was, and found that it was this Tivo in 2004, which was also my first DVR. Interesting.",
        "The concept is very good and makes TV watching a better experience. However, the installation is not nearly as simple as the box and the description will lead you to believe. And if you need to contact TIVO's technical support, be prepared for a very long hold time...very long. And the support personnel are neither knowledgeable nor courteous.",
        "I read many Web Forum discussions about the TiVo Series 2 DVR. Many experts stated flatly that the machine will not operate without a TiVo contract. I have recorded a few hours of programming with no TiVo service. It is necessary to log in with the sevice to receive the operating system over the phone line; for this there is no charge. I do not recommend this product for the faint of heart. For the technically inclined, the machine will provide a lasting source of amusement at a relatively small investment. The vendor gave excellent service.",
        "I love TiVo. this is great to watch our shows when we want to watch them. Setting it up is easy. Best part is with a press of a button we can record an upcoming show to watch later if we are on vacation, or like most times, forget that it is on.",
        "I loved it but now that that Verizon Fios has it built in I no longer use it.",
        "I thought that it was pretty hokey when people would say that Tivo had completely changed the way that they watch TV. I am now a believer. I didn't realize that it would help me with my wife too because I am not worried about when stuff comes on, so if she wants to talk then so be it - I'll start the latest episode of Lost once she is done talking. So much less stress!!",
        "The Tivo cannot find my wireless connection. My other Tivo Series 2 unit set up in the same place with the same wireless connector has no trouble at all. I have tried it in a different location where our other Tivo worked fine with the same result. I have been on tech support, checked all my network settings and we concluded that there must be something wrong with the Tivo unit where the wireless connector plugs in to the unit. We also tried using the other USB port--nothing. This Tivo unit may be new and never used, but it is not working for me.",
        "Nice product for the price. Piece of cake to use and set up. 2 things I had to get with it...a Tivo wireless USB adapter, $30, (no phone line) and the IR cables,$11, to change the channels on the satellite box. If you have a standalone DVR, you need the cables.",
        "I purchased this for my girlfriend and have to say that in the few years that we've owned it, we use it every day. We can record our favorite shows for weeks and watch them whenever it is most convenient. We never watch live TV and can fast forward through commercials in a matter of seconds. One of the best investments I have ever made!",
        "TiVo needs to do a better job of explaining that an 80 hour TiVo only records about 40 hours at \"High Quality\" and about 30 at \"Best Quality.\" High Quality is noticeably granier than your regular television. Had I known this, I would have bought the larger capacity TiVo so as to record at Best Quality for everything. Other than that, TiVo is spectacular.",
        "it's been a great experience so far. we've hooked up the tivo and have had only user issues (\"how do we get to xxx? how do we record channel xx?\"). since we have most of our music on our computer, i was able to dig around and find a way to stream our .wav files to the tivo and through our stereo speakers. we're very happy with the purchase!",
        "Product in working order but had to buy ir blaster and adapter. Seller would not return emails after purchase",
        "Arrived in good condition.Easy to set up and easy to operate.Now we know what we have been missing over the years. So easy to record or set up recordings.",
        "What a refreshing thing it is to be able to fast forward through TV commercials, and to not be tied down to the times when the networks decide to broadcast my favorite shows. I found the system intuitive and easy to use - even the remote!",
        "Once you have a TiVo, you will never be able to live without it. You will be thoroughly annoyed every time you have to watch TV somewhere that there isn't one. Thusly, I bought this TiVo for my brother so that I don't ever have to be without it when I visit him.",
        "This model is no longer supported by Tivo. You also must have either a phone line or internet which requires an 80.00 adapter.",
        "this product is very good, it is ues but good .but i can't reat movie becouse is tivo is allrigted activty",
        "Works Great,although it is only a 40 hour model, instead 0f 80 hour which was advertised. Other than that its fine.",
        "Way to many things to get this up and running.",
        "is it worth $13 bucks a month, i think so but i'm also a long time owner so i feel the need to stay put! sure you can get a free dvr from your cable company but tivo is fun and just freakin awesome!",
        "It took me forever to set this up with my satellite dish only to find out after making two phone calls, and being on the phone for 45 minutes, that this won't work with it!! DON'T get this if you have Dish Network satellite!!!! I was very disappointed as this was a birthday gift for my daughter. By the end of the night, we were all ready to throw this out the window!! If you have any other kind of dish, make sure it works with your system. I have since ordered a DVR through my dish company, and had it installed in less than 5 minutes.",
        "New 54XXX models have a newer Linux kernel that supports LBA48 drive addressing (>137GB HD) along with Tivo 5.x software. Old Black boxes: Tivo 4.x and no LBA48 support. Tivo Hacking Links",
        "I purchased this item hoping I would be able to hook up to my cable box. I later found out I need more wires and this has been a complete waste of money. I don't really blame the seller but Im NOT happy with my purchase. I would like to return it if that is an option.",
        "The product arrived today. However, it does not have remote control with it although the picture of the product ([...]) clearly includes the remote control. The box it came with also has the picture of the machine with remote control on it. The only other things included in the box are 2 cables and a power cord. How are we supposed to use the machine without a proper remote control? The seller is deceiving to sell it without clearly indicating that his or her Tivo machine does not include the remote control. It's just ridiculous!",
        "Nice machine, was easy to set up. We had to hook it up to the phone long, so setup took a long time (plan on it being overnight). Also the remote buttons are really too small for elderly folks to use. All-in-all, I agree with the other reviewers. (...)",
        "I never ordered this item and don't know hwere this came from. I don't have one, nor do I want one."
    ]
}