{
    "entity": "DVD Recorders",
    "text": [
        "I bought this DVD recorder used. There is nothing wrong with the machine. The problem is with the remote control but thankfully, I have another remote control from my previous DVD Recorder which it happens to be the same brand. and it works perfectly.",
        "The product was sold in \"very good\" condition. It arrived without a power cord. Once I got a power cord the unit played back too fast making all the voices sound like the chipmunks. Then Amazon said it was my responsibility to pay to return it. Shipping was $22.00. Can anyone think of a reason to think my rating is inaccurate?",
        "This is one of the best DVR machines out there. Enough bells and wistles to put you in technogeek heven, yet simple enough for someone like me who is severely visually impaired to use and enjoy. All you really have to do is put in a blank disc, hi the record button, and hit the open/close button on the remote when you are done. The greatest thing I like about this machine is that even in EP mode, the recordings you get from it literally blows VHS out of the water. A fantastic machine at a very low price. GET IT!",
        "I have 6 of these DVD recorders. It is so user friendly. Panasonic sent me a disc update to increase the speed of the drive to 8X. No one was selling the 4X discs anymore. I was in a total panic. I tried a Toshiba DVD recorder and it took a rocket scientist to figure it out and I still had major problems. Needless to say, I returned it. I highly recommed a Panasonic.",
        "I used this extensively for 10 years (March 2005-April 2015). It was so reliable that I am picking up another used one. (FYI, mine says it is the DMR-E55 without the S--I don't know what the difference is.) I often used the DVD-RAM to record shows over and over again.",
        "Item was as described however it did have an unknown flaw. Return was processed quickly and without any hassle.",
        "No remote control. No directions for set up or operation!",
        "I've had this recorder for about a month now and it is great! I bought it mainly to record tv shows to replace my VCR and it's doing a great job. It's a snap to set the recorder to record. I like the fact that it tells you how much time you have left on the disk. The price was really great too! I would recommend this to anyone who's looking for a reasonably priced recorder. Only wish it would take DVD-RW instead of DVD-RAM.",
        "This product was a total piece of junk it doesn't record nor does it read any disc the Customer new this they didn't even send the remote I had to buy one on ebay now I have a new remote an a unit that doesn't work thanks alot",
        "HAD THIS MODEL BEFORE - LOVED IT GLAD TO GET A REPLACEMENT FOR MINE",
        "I purchased pansonic model dmr- e 55 I have had it since July 2004 and the year is 2016 bought it brand new in 2004 and still working with no repairs! pansonic makes quality products!",
        "This should say it all: I just came back from the repair shop. When they saw me walk in with the unit the clerk said, \"I can't believe how many of these units come in.\" This very model. I used it for a few months, made 20 or 30 recordings, then it just failed. I called tech report, told them the error message I was getting and they told me to bring it in. I have a feeling I'll be returning it often till the warranty expires and then I'll throw it out. For what it's worth it worked well until its demise.",
        "This is my first dvd recorder and I am quite satisfied so far. Using the s-video input from my satellite receiver gives a dvd like quality recording. I have had this for a few months now without any compalints so far. This is a great dvd-recorder for anyone wanting to start out in this field. Playback flawlessly on my other panasonic dvd-players(s27 & 32s), not sure about other brands. Menus are asy to use. I recommend highly.",
        "You should look at the reviews for this Panasonic DMR-E55 unit with the black outer finish on Amazon for many more reviews of this silver version. All I can add to those informative reviews is how pleased I am with its incredibly easy set-up and very well designed interface and remote control. I'm thrilled with the quality of the recording even without using the higest quality format. I'm actually surprised the unit is so inexpensive considering the quality and number of features.",
        "This is a simple and complex machine. Simple in the way of how easy it is to use. Just press the REC button and you are done. And complex with all the useful features like MP3 player, CD player, DVD player, and my most surprised feature RF. If you are watching T.V. downstairs and recording upstairs, just press stop on the remote whenever within about 100 ft.",
        "THIS IS THE FRIST DVD RECORDER THAT I HAVE USED AND THE SETUP WAS EASY AND I WAS RECORDING IN ABOUT 15 MINUTES,THE OWNERS MANUAL WAS A LITTLE TO BE DESIRED ABOUT HOW TO FINALIZE A DVD,BUT IT WAS FAIRLY EASY TO FIGURE OUT AND THE RECORDING IS GREAT"
    ]
}