{
    "entity": "DVD Recorders",
    "text": [
        "Probably the best 480dpi (may also have 720dpi-med HD quality) recorder ever. I bought my first one from Best Buy for about $350. Only good for DVD-R; -RW and RAM single layer 4.7g. Got the second one right here on Amazon for $125-still using it. Would buy a used one again as I now have 2 remotes.",
        "Bought this as a replacement for my broken model. Everything works except the on/off button--okay since it came with the original remote. This works a little differently than my original one (for some reason), eventho it's the same model. Too bad Panasonic stopped making these great recorders.",
        "Pass this one by for the ES-15 which has more features and capability. But if you can get it cheap, it is a good entry level recorder. The next step up is a HD recorder which is much better for time shift viewing, but the ES-20 is fine for doing the same as long as you have plenty of DVD-RW or DVD RAM disks. The RAM is better for editing out commercials and setting up chapters. It is an excellent machine for transferring home VHS movies to DVD-R. The DVD is actually of better quality than the VHS since the ES20 cleans up noise. Very happy with it.",
        "This is my first DVD recorder and I was looking for an inexpensive unit without too many bells and whistles. After reading reviews, I came to realize that DVD players can have a myriad of problems so I got this because it was reported to be trouble-free. I got some cheap Staples DVD-Rs (100 for $18) and have been burning discs with no worries since. This Panasonic recorder is easy to set up and use and has only toasted one DVD thus far. I rate it very high on reliability and ease of use and those are my biggest priorities.",
        "Had read some other reviews prior to purchase and thought, OK let's get it. I have been very pleased with it. I really didn't expect it to perform as well as it does? The copies from VHS to DVD are better than the VHS original! Playing the finalized DVD's on other systems, computers etc is no problem at all. Not even a blip! TV to DVD, VHS to DVD+R is easy. The DVD Ram discs are great. For the money I would not hesitate again to purchase this product. Really like the Black that matches my other components. Unit does what it says and the setup is easy as long as you read the manual and understand everything first.",
        "I have had this for over year now. I just love it. I wouldn't know what to do with out it now. I have recorded so many tv shows & movies with it. I have recorded every one of my favorite TV shows, so when I go to the lake where my travel trailer is set up I can catch up on my shows at night or when its raining. It is easy to use & set up. You do have to buy the right kind of dvds (DVD-R) so you can finalze & use on the other dvds.",
        "the recorder does not work. I missed the deadline to return it because it was a gift. Tried to get several people to assist but figured out that the issue was the recorder. I feel that this was misrepresented.",
        "3 months of me using it and the AV output won't work. Its not even my AV cables!",
        "Love this dvd recorder. I burn all my movies with nero to Memorex, Fujifilm (+) and (-) even make VCD's on Verbertim, Maxell CD-R's and it plays all. I had a recorder before that only recognised Memorex alone. I never heard of DVD-RAM and it comes with a blank one. I like the feature of playing while still recording, very nice. My only thumbs down I have on this, there is only one output. But it suites my little needs and the price is good. Panasonic really has good quality in playbacks.",
        "This DVD recorder is easy to program recordings and the outcome is very good. For nearly the same price, some recorders don't even come with a \"digital optical out\", or \"S-video in\". The quality of the image in \"LP\" is as good as in \"SP\", so you can put 4 hours of recording on a disc with no loss of quality. Another feature is the \"FR\" function, which fills the disc with your timed recording for best quality possible when it's length is an odd time like 2.5-3.5 hours. Probably the \"best buy\" in this price category.",
        "This is my first experience working with a DVD recorder. This Panasonic model came highly recommended. I found the directions for set up and operation to be easy to understand. I did call the 800 number for help in using the unit with a Dish receiver. My call was handled in an efficient manner once I got someone I could understand as the connection was not good. I have been very pleased with the Recorder during the first two months of ownership.",
        "I received this DVD Recorder with a defective remote controller, so I have been unable to use it (no timer recording, no finalizing a disk). I have now spent three weeks communicating with automated voice mail trying to find out how to get the remote controller replaced, and sent five email messages, that have resulted only in receipt of another telephone number, resulting in no help. If anybody knows how to penetrate Panasonic's customer service morass, I would be eternally grateful",
        "avoid panasonic DVD players/ recorders. they have bad capacitors that lose thier charge and make it had to start up after just 4.5 years this died on me. waste of $ Not Recommended If anyone has any questions about this please don't be afraid to ask me. I'd be more than happy to answer any and all of them.",
        "Excellent machine except it kept freezing after finalizing a disk forcing me to disconnect the machine in order to get it functioning again so I sent it back.",
        "I was lucky to find this; it's great that Amazon has third-party sellers and I picked the highest rated seller. One can no longer buy these units new. My old one was great until I switched cable services and the installer fried my unit. Have huge library of DVDs I have recorded and am relieved I can still enjoy my movies as I refuse to pay for the overpriced offerings by cable and other services.",
        "Over all I'm happy with the performance of this item. But I have had the occasional DVD that will not finalize. This can cause the player to \"freeze.\" I cant get the player to perform any other functions such as going back to the menu. I have to unplug it and start over.",
        "The unit arrived promptly and is working like a new one, We are very happy with the purchase and would do it again.",
        "After receiving it, tray does not open. Customer service tried to help, but had to send it for repair. Warranty specifies repair or refurbished model, which I do not like at all so would have prefered to get the money back, but more than 30 days passed since purchased. Guess Japanese Panasonic is better than \"made in Singapore\" This cannot happen in a brand new DVD recorder, probably last Panasonic product I purchase. Suggest Amazon gives extended money back warranty for this kind of \"big\" failures, like receiving a brand new DVD and tray does not even open to insert the disk.",
        "If it does break. Get another one. and another one. I love this machine. It does what is needed for a great price.",
        "It's a pc a crap does not work. Remote control also dose NOT work, so I just have to return it.",
        "This machine worked okay at first, but quickly started developing quirky problems. Various features, one by one, started failing. While the machine was still under warranty, I called the manufacturer. The representative was quite dismissive, and sent me a CD with \"fixes.\" Apparently, the problems were common. For a while longer, the machine was working okay, but then I found that I had to unplug it and reset everything every couple of months... then every couple of weeks... now daily. If I don't, it ignores any programming and also stops responding to any of the controls on the remote or the front panel. Thanks, Panasonic. This DVR just isn't worth purchasing at any price.",
        "We had this product long enough for the warranty to expire, which is about the same time it stopped working, except for the clock. We missed a lot of shows because this thing would randomly malfunction, sometimes working great, sometimes freezing up completely so that the only way to reset it was to unplug and start over. I've had good experience with Panasonic in the past, so this was an unpleasant surprise. Luckily, our credit card covered the purchase so now we can buy another product, from another company of course. This market is way too competitive for low quality mess like this. Don't waste your money.",
        "I bought this at Best Buy and had to bring it back after the first week because the clock stopped keeping the correct time. The second one had the same problem. I updated the firmware from the Panasonic web site, but the problem persisted. This one's going back too. The other problem is unless you are using costly DVD-RAM disks, you can't choose where to put chapters and can't title chapters. I'd shell out the money for the DVD-RAM but those won't play on other machines. I think I'll wait for the technology to improve on these recorders before I try again.",
        "If you have a cable box do not connect by the manual...If you do you will not get all channels...I ran cable to cable box and out to the Rf connection and out of Rf to TV.I still used the 3 RCA between Cablebox and Recorder....I Could'nt use all the fancy other hardware hookups because the TV is old.....So my options are limited!!!!!I use most for recording but will transfer alot later......If you tape a movie raise your volume on box to high....Use volume control on TV remote...You might have to program you TV remote...I'm getting new LCD soon.....",
        "I am very disappointed with this product and Panasonic. The dvd recorder is barely used since we bought it in February 2006. A week ago when I tried to finalise a dvd+r it just froze, after trying to reset the dvd recorder I received a split screen on TV. Now the recorder does not recognize any dvd format other than the dvd-rom and does not record on anything. We will have to take it for repair. Hopefully it will work again.",
        "The Panasonic ES20 is a good DV recorder. Not finiky about blank quality, fairly intuitive. Lacks a few important features: 1. No zoom. This means when you watch a movie you rented it is always in the narrow \"letterbox\" shape. No way to fill the screen. 2. No Tv Guide feature 3.No way to control your cable box from the DVR 4.Will not tell you how much time remaining. Think long and hard before buying.",
        "This is one of the best Panasonic had made. It is made in Singapore and very good quality unlike Made in China products. It has fast play for new DVDs... very user friendly and works like a charm. All the features are excellent. I highly recommend it. Also had DV input for your Mini DV camcorder. This is great!",
        "The Panasonic is a good value recorder. It's on-screen guide is easy to use and helpful. Even the Panasonic toll free number, into Chesapeake Virginia, was helpul in setting up. The recording quality is very good in both the 2 hour and 4 hours mode; and works fine with SONY DV-RW and the RAM disk. I bought a SONY at first which toted recording all formats, but at another $100, why i asked. I decided to take it back in favor of the Panasonic. I do wish the remote had a better way of fast forwarding through commericals, like a \"plus 30 second\" feature. Overall, I'd recommend this recorder as a good value.",
        "I bought two of these. The S-Video and RCA-video outputs stopped working on each one after a month, one going completely black and the other losing horizontal sync. These units probably have very cheap integrated circuits in the output path. Best Buy let me exchange them, but I'm not confident that the replacements will last very long.",
        "This is my first dvd recorder, and so far it has worked great. I have used dvd+r,-r,-rw, and dvd ram discs and have not had a problem. The best feature by far is being able to watch a program that is half way done recording, and starting at the begining. I can get 8 hours worth of cartoons on one disc and they play in our portable dvd player. This will make vacation travel time with the kids a breeze. I'm impressed, especially considering the price. I'm sure there are better models out there, but for my needs this was a great buy.",
        "I am very happy with my ES20K. The fact that it has a TV tuner makes it a great gift as well. Very similiar to a standard VHS recorder. Though copying from Tivo was pretty easy as well. I used a DVD-R disc in it from my Mac and it worked just fine.",
        "I thought I had the best DVD Recorder yet, but despite the mostly New Raves over this product, it will stop recording to Regular DVD's when the Warranty runs out, I tried a second one and got the same results, it won't play anything but DVD-Ram Now! Panasonic also did not send me a $50 Rebate that came with it. They sent me to a web site where it wasn't listed. JMO, This unit is great at first but don't through away Your VCR. Good luck to the rest of You.",
        "We purchased this last April and have had nothing but problems. We have not been able to record on it for the last 5 months. It does play DVD's, but when you first put a DVD in, it takes 'forever' to read it before it ever starts playing. Also when it was recording - it won't even let me watch the DVD's that it recorded. I do have to clean it 'often' in order to just watch DVD's. I have an old (approx 10yrs old) DVD player and have never had any problems with it. - Warning DON'T BUY",
        "The product is great, easy to use, but by somehow it doesn't read and write on Philips DVD-R disc. Other discs are ok.",
        "I used it for a very limited period of time and then because I was busy, I did not touch it for 3 months. Today, I turn it on, it is broken! Maybe a power surge? but every electronics around it is working fine. What a piece of crap! I don't think I will buy Panasonic again",
        "The first one worked fine until video outputs stopped working after a month. The replacement unit worked for a few weeks and now it will not read or play DVD of any type, even rented or purchased movies. A lot of features but poor quality.",
        "After many hours of experimenting and trying to comprehend the instruction manual on how to record etc ad nauseum, I decided to play a Netflix movie - It won't play because it doesn't have the new Region Code - So BEWARE - if you want to use this as a DVD player in addition to a DVD recorder - you will find it won't play any of the commercial flix unless they are up to date with the Region Code!",
        "My wife and I have spent at least 5 hours trying to figure out why this thing operates the way it does. First, it more than occasionally locks up which requires you to unplug to correct; Second, it doesn't record based upon your scheduled setup...it either records early, not at all, or one day and not the next; Third, it will not play DVDs due to the Region Number mismatch even though there is an available menu option to play all DVDs (won't allow me to access this option). Need I say more? Don't waste your time on this one.",
        "It seems Panasonic has become like other Corporations in that the customer is treated like the enemy. Panasonic.com doesn't return any emails or calls and even customer service has ignored all of my emails. I sure hope the recorder doesn't break because there is no way I'd expect any help from Panasonic.",
        "Purchased the unit and went to play a childrens DVD and it will not play because the ratings setting will not alow it to play. Attempted to change the ratings setting and was prompted for a password. Have never setup a password and the manual does not list a factory preset password. Turns out the ratings setting will not alow ANY DVDs to play. This is junk! Do not buy. How can I unlock this stupid machine?",
        "I buy the equipment because the information say it was a multi region, when I tryed it was only region 1 not a multirigion. and is to expencive send this back.",
        "Anybody reading this should report this DMR-ES20 to the GOVERMENT and THREATEN Panasonic to MAKE a TOTAL RECALL for FIRMWARE UPDATE for the SCHEDULE RECORDING LIST FUNCTION! This company took TOTAL advantage of consumers when they KNOWINGLY put out a DEFECTIVE PRODUCT!! thanks very much"
    ]
}