{
    "entity": "Keyboard & Mouse Combos",
    "text": [
        "It did what it's supposed to. Not as comfortable as other Logitech products I have used, feels cheaper and clunky, I can definitely feel the input lag",
        "I purchased these some time ago for my parents. They managed to pick up on how to use everything quite quickly, and greatly enjoy the fact that it is wireless. The mouse has a nice heft to it, so that you don't feel like it would break. And with all Logitech products it looks like it's built to last. The only real problem I have with it is the fact that I'm a left handed person and it would be quite difficult to use with a left hand. That and if you install the software bundled (not required for all computers, but some need it) it is quite clunky.",
        "Seller tested this pre-owned unit prior to shipping and even sent additional photos. I'm replacing the same Logitech unit that I had used for years until the receiver quit working. (A new-style wireless mouse with USB receiver was not an option since I still need PS2 ports due to a KVM switch). When the unit arrived, it looked brand new and functions that way as well. I'm using the unit to write this review! Thanks! I highly recommend this seller!",
        "The installation was a breeze, almost plug and play. However, if you want to use all the shortcut keys and other features of the keyboard, you must run the installation CD that came with the package. When the battery was low, it even popped up a message on the system tray to remind you to recharge the mouse battery. The only negative was it didn't compatible with older version of Logitech cordless mouse. Overall, it's a great product, I am very satisfied with it so far.",
        "I like this product for all the features it has, but I've had several problems the worst being the scroll wheel on the mouse not working which turned out to be a bad driver. I put the new driver on and it is better, but I still occasionally have a problem with the scroll wheel not working. It did install very easily and otherwise seems to be a good product. My overall feeling is that it is a little buggy though.",
        "The keyboard is fantastic--a great improvement over previous models. The action is tight and it seems quite durable. I have no idea why Logitech decided to shrink the buttons, though--not thinking of people with disabilities, obvioulsy. All in all, though, it's a great keyboard. The Mouse, on the other hand, is horrendous. It's big, clumpy, and basically has terrible movement. I ended up getting the MX1000 a few weeks later. Logitech really cut corners with this mouse. Buy the keyboard alone and get a good mouse. Shame on Logitech.",
        "I liked this product more than the other WiFi desk top products I use. The mouse charges very fast and lasts at least a week without the charging craddle. I will definatley buy this product again, if this goes bad. The service from Amazon.com was outstanding, as always!",
        "No cords! An absolutely great product from Logitech. Keyboard offers everything possible, including features that are the mouse has...no need to keep switching back and forth with the mouse. The keyboard has a security of it's own. It's comfortable to use, does not constantly need new batteries. I would keep this for my next computer - don' want to give it up!",
        "I use this keyboard and mouse in my classroom at school. They work perfectly and haven't had any trouble. I teach with a project hooked to my computer and on occasion have to move my keyboard & mouse to my podium which is about 3 feet away from the CPU and the mouse and keyboard have no problems communicating with the receiver. Would definitely recommend.",
        "This is my second set of logitech wireless keyboard/mouse combo I've had (the first one handed down to my dad) and I'm very satisfied. I find the logitech input devices very comfortable and natural. Specifically about this set, I like how the wireless base also acts as a charger for the mouse. The keyboard multimedia buttons aren't quite as customizable as I want, but it's still pretty good.",
        "This is a great way to clear your desktop. The keyborad is filled with neat features and special funtion key capability. Installation was easy and using the product has been a delight. I especially like the one button access to E-Mail and Media Player and the F Mode keys that access your Microsoft Office applications.",
        "Never came with the mouse or sensor, was scratched and packed badly.",
        "One of the best keyboard & mouse combinations I have ever owned or used. Has very good range and has stood the test of constant daily use over a VERY long time. I still use this keyboard today, 8 years after purchasing it here on Amazon!!!",
        "Operates as advertised. Easy to set up and use. Responsive to slightest touch. My only fault is forgetting to put the mouse back in the pod for recharging the batteries.",
        "Been using it for over a year, and have had no problems, works great, probably better with XP, batties are still the same in the keyboard, charger works good. Recomend it",
        "I have an older model logitech keyboard combo on my home work computer and I love it. The updated design and optical mouse make this a joy to use. This replaced a dell quiet touch wired keyboard that came with my system. Absolutley worth the investment!",
        "I have had this set for years and it is still going strong. Great keyboard set.",
        "This item meets all my expectations for cordless keyboard and mouse. The mouse batteries are rechargable and is shipped with it's own handy recharger. The keyboard is smooth operating and can be positioned almost anywhere. If you are looking for a nice accessory with quality components, this item is for you.",
        "I just got this pruduct and I can't complain about it. The keyboard is great and the mause is perfect. Installation did't take me more than 5 minutes (if you follow the quick directions that come with the product). Then, you are ready to go!! I highly recommend this combo!! (Logitech Cordless Desktop LX) 700",
        "I bought this combo with a rebate making it a great price. I re-programmed some of the keys to go to favorite web sites. Sometimes I forget to put the mouse in the charger when I leave the computer but the batteries have not run out yet.",
        "Keyboard has a good feel to it. The mouse is a little heavy, due to the batteries, but it is very ergonomic.",
        "Very satisfied with this product. The keyboard is very smooth and has every feature I could want. Logitech mice are the best, no question about it. You can't go wrong with this product or Amazon, both are rock solid.",
        "Wonderful! You'll love it! Get one .... With $35 bucks you get a terrific combo, plus if you're NOT living Seattle, WA (Amazon.com's location) you don't have to pay the sales tax ;-)what's else do you want? :-)",
        "I bought this after having tried a cheaper one by KSM which turned out to be total garbage. Couldn't be happier with Logitech!",
        "I was satisfied with the purchase and my logitech cordless desktop LX700 is worth money.I didn't had any problems while using it.Its good.",
        "We purchased this wireless keyboard and mouse set to use with a notebook computer. It has worked beautifully since we set it up. We have been using it for a month or more. I highly recommend it. Great price on Amazon too!",
        "Some keeys need to be striked hard. Microsoft was a little better",
        "I bought the Logitech LX 700 in Feb and haven't had a single problem with it yet. The keyboard is well-designed,attractive,and very functional.The keys have just the right feel to them. The mouse works efficiently.It is a bit heavy,but as long as it works well,I can live with that! The recharger dock has worked very well.No battery change needed yet and it charges the mouse like it is supposed to.Installation on Windows XP Home was smooth.No disc needed! This is an excellent wireless keyboard and mouse package!",
        "I purchased this product because I got tired of being \"wired\" to my computer with cords. This product is great because it provides the user with so many options as to how to configure both the mouse and the keyboard. There is a \"hotkey\" for just about anything you need. I especially love having the ability to scroll down pages by using my keyboard instead of my mouse if I want to. By the same token, I also love being able to use my mouse \"hotkeys\" to scroll through web pages, close them, etc., without having to click on the little \"X\" in the top corner of my browser. All in all, I would highly recommend this product.",
        "this is a good combo i got it with the rebate and it came out to under 40 bux shipped. It works pretty well, set up is unnecessary, as it is all automatic, but you can run their cd anyway for added features. I found that there is occasionally some lag or interference, which is attributable to keeping the mouse base close to the computer and speakers...if you move it a little further away, you have a better connection.... i'm quite happy with this product, and recommend it.",
        "I bought this set about a year ago. Due to mixed reviews, I wasn't sure what to expect. I must say, that I haven't had a single problem with either the keyboard or the mouse. With the keyboard, there are no delays and no connection problems, even if I go across the room. The mouse works perfectly and battery life is terrific. To say that I was surprised and pleased by the quality of this product would be a huge understatement.",
        "This keyboard is the best. I love the feel of the keys and the mouse. Logitech does a great job of making things shaped for your hands. The ead of the controls on the keyboard are great because I can navigate and scroll webpages and my graphic programs without having to rely only on my mouse to navigate around. I alco love the features on the mouse to have a shortcut buttons and the forward and back buttons. I love this keyboard and mouse combo so much that I bought a second one to use at work. It deffinatly makes me more productive as I have both of them set up the same.",
        "This is such a great combo. Thumbs up to Logitech for designing an efficient keyboard with just the right functions and ergonomics while keeping it aesthetically appealing. The only few complaints about the keyboard is the ability to change the function of the Audio Preset buttons. People have mentioned this earlier, and now that I have it, I understand why they say Logitech seemed to have forgotten about these buttons therefore I only gave it 4 stars. [...]",
        "I've wasted time with other, cheaper cordless desktops and I wish I would have sprung for the LX700 first. The mouse feels awesome and the keyboard offers great looks and outstanding functionality. Best of all, the wireless connections work flawlessly, including with advanced mouse functions. Errors on cheaper branded desktops proved maddening; I'm happy to report no such trouble with Logitech. Logitech's done it right.",
        "I have had 2 of these keyboards, one at work and one at home, and made the mistake of buying a Microsoft unit for my wife at her work. Well let me tell you what a mistake. So now I have hunted all over the place trying to buy a third unit for her. Just found a refurb one here at Amazon. This unit is smooth, easy to handle, quick, no click three or four times to get it to connect with base, nice features on mouse, and quick connect buttons on keyboard. This is the only one for me folks, dont let any of the others fool you. This one is it!!!!!! Book'em",
        "I just purchased a Logitech LX 700,and it is really great. The setup was a breeze-just plug, charge, and play. The software adds functionality to the multimedia controls and this works beautifully,too. The design is sleek with a black case and charcoal metallic insert around the keys. The keys have a very nice tactile feel, and the scroll and zoom controls on the left of the console are a nice touch. Best of all, it looks really good with todays black/silver computer cases (including my Dell Dimension). I highly recommend this keyboard. -Patrick T.",
        "I've had this keyboard and mouse for six months now, and I haven't had any problems. The keyboard and mouse look great, and many of the extra buttons are very useful - and can be assigned new functions using the software provided. The media controls are particularly useful, whether it be for quickly skipping a song without changing applications ( especially useful if you are listening to music while playing a game) or pausing a movie without taking the mouse out of it's charger. Speaking of which, I have never had a problem with the mouse going flat. Leaving the mouse in the charger provides more than enough power for the mouse to be used all day.",
        "Great price, great delivery, the keyboard has all the functions one can need and will use, great speed, very good battery life, the only thing not great about it, is that you have to download an update in order to make it work correctly, not that hard work but neither what you expect from a top notch installation procedure",
        "This was my first purchase from amazon and everything went smoothly. The package arrived sooner than expected and was shipped very securely. The price was hands down the lowest I could find (by nearly 25 dollars!). The keyboard and mouse are excellent and I agree with most of the reviews. I haven't fully utilized all of the functions yet...but have had no problems. Two minor drawbacks. The mouse is a little heavy and the keyboard distance is not great (maybe 8 feet at most). Otherwise an excellent product at price that can't be beat. Highly recommended. Thanks.",
        "After using my laptop a lot, I started getting a lot of pain in my wrists. I started looking into external keyboards. A friend recommended this product to me. I thought it was a pretty good price, so I went ahead and bought it. I have been very satisfied with my purchase (over 2 years now). The mouse holds charge very well. Also, after using this product, the pain in my wrists went away. Overall, I am very happy with this purchase.",
        "If people would take the \"Tour\" provided in the software, they would find out how to program the Audio Preset buttons. In reality they are Website Presets. Simply go to a website, press and hold one of the Audio Preset buttons, until the Website name flashes on the screen in green. That's it, it's set. My opinion - I don't like the Mouse - I'm using my old MX700 mouse - I love it. The keyboard - Its the best. Period.",
        "Great product. [...] & free shipping. Best deal ever. EZ setup. Cant complain for [...]. Lots of short cuts.",
        "Today the button work, then tomorrow they decide not to, I have updated the software and I still have the same problem on 2 PCs, also the feel is not like that of a corded mouse, I spent $69 and I am not pleased, they just better send me my rebate back or else, if any one knows of a better unit please let me know.",
        "Both the keyboard and the mouse work great. There is an excellent \"Quick Tour\" that explains all you need to know about the keyboard. Unfortunately, it doesn't provide any information about the mouse and the extra bottons on it. Other than this drawback, I am very happy with this purchase.",
        "I bought it because it had the rebate and thought it would be nice deal with a free shipping. I found the mouse on this combo is extremely uncomfortable. Basicaly every time I put my hand on it I begun thinking about the edge under the fingers. If you want it.. go in the store and try it first.",
        "it's the most beautiful and comfortable keyboard i ever used. i can not stop putting my hand on it and enjoying it. Everything is beyond my expectation. there are so many functional keys on it so i can do lots of things without using my mouse. i just want to say it is worthwhile. i like it very much.",
        "I bought this wireless keyboard and mouse so that I can stay out of the radiation from the monitor. For the mouse to work properly, it has to be within 3 feet. After 4 feet, it's dead-even with almost fully charged batt(half an hour use after overnight charging). My old mouse has 6 feet wire, so What's the point of using wireless? I'd love to give five stars, but not for this one. So if you want to use it within 3 feet, go ahead. But if u need some distance, try something else.",
        "I bought one of these for work and home so I could have access to all the quick keys at the top and get rid of any extra extra wires around my desk. The keyboard feels great and the mouse even has some extra buttons that I'm still trying to remember to use more often. It's a great value for a wireless keyboard and mouse combo.",
        "Nice layout, nice key feel, lots of features, I loved it for the whole 3 months it worked. Then one day, its dead, never been dropped or anything. A few weeks before it died some of the programed buttons quit working. This happened to a friend as well with the same keyboard. Out of warrenty. For the money, I'd try something else.",
        "The keyboard keys are sometimes unresponsive. There time when thet are struck and nothing appears in the screen where one is typing. Have thought abour trying to return it but I probably cannot find the paper work.",
        "have been using it for about a year now haven't had much problems with the range or the charge of the mouse battery. i recommend getting rechargeable batteries for the keyboard. when i bought it i paid 100 but prices are waaay down now. definately a great buy:)",
        "My desk is usually cluttered and sometimes I feel like kicking back. Now I can find a clear spot on my desk to mouse and lean back in my chair without dragging the computer case into my lap. It's great.",
        "I ordered this product as a gift for my mother-in-law for Christmas. The battery pack for the mouse was defective, and would not charge. Logitech told me it was amazon's problem. You can't find a phone number to talk to Amazon. Via e mail and a few days, they said they would send a complete new product (I guess just sending a new battery pack was too tough). I told them (via voiceless email) to send it to my in-laws, so of course they sent it to me 1000 miles away. I had to pay out of my pocket to get it to the right spot. Lesson learned-- returns are tough on Amazon.",
        "I have yet to purchase a Logitech product which hasn't lived up to it's prior billing. The Cordless Desktop LX 700 is no different. Solid construction, excellent features and great performance. What else can I say? As always, Amazon complimented the deal with great service.",
        "I use this mouse/keyboard for work and I have no complaints. the product arrived quickly and with no problems.",
        "A nice rechargable mouse-single charge comes almost 2-4 weeks. Key board is okay, it would be better if there would have been lights to show CAPS lock on etc., I sent the rebate, received back a post card saying I didn't send the sales receipt, When I called up, the CSR said, the sales date provided in data is wrong, so she is submitting back again which will take, 6-8 weeks again!!!",
        "I have had it for about a year now, and i have seen nothing bad about it, still using the same battery as when i got the thing. It has great range and is very comfertable, the mouse is so great on the hand too.",
        "Love it. Having no cords hanging around is great. Just have to remember to put mouse in charger.",
        "I bought this a week ago, The LCD display doesn't work, and every time I reboot the PC I have to reinstall the driver to make it work. DO NOT BUY this.",
        "I don't know about you people, but I bought two of these and they both went down in less than two months. I will never buy anything form Logitech ever again.",
        "I never could get the computer torecognize the keyboard and mouse. returned this item.",
        "This keyboard is for USB but the mouse is for PS/2 connect only. Laam-o! I read a many reviews about this being \"cutting edge\" and \"smart\" but it's dumb! PS/2? cmon gimme a beak! I'll never trust another reveiw, not even Tom's Hardware who odviously has Logitechs working with them!"
    ]
}