{
    "entity": "Keyboard & Mouse Combos",
    "text": [
        "After installing the lap top software to enable the shortcut keys, my laptop exhibited some bad behavior. If I remove it from the docking station and carry it to a conference room to plug into a projector, when I hit Func-F8 to switch the display mode, the screen blinks and flashes, and maximizes the magnification such that I cannot even display powerpoint. This may be my company's firewall and other security stuff, but removing the keyboard software fixed it. Also the fingerprint reader response is very, very slow. 20sec or so between putting my finger on the spot and getting the logged in screen.",
        "When I first bought this kb, I was running XP. Windows sign on was great, and it was cool to log into all my favorite websites. The fingerprint log on still works on Vista, however, security for most websites is much tighter now. What I mean is, before to create a fingerprint logon for a website, you just scan at that site's log on screen. The software would recognize this was the actual logon screen and a wizard would come up to help you through setup. All my banking sites are not recognized by the software.",
        "I find the fingerprint reader reliable and very, very handy. In addition, the standard layout keyboard has a nice typing feel...not too mushy nor clicky. I like the wireless mouse for its simplicity (no side buttons) and it fits my hand well. I would only remove a star because the special intellikeys (assignable keys) are not that well designed: They need to be pressed too hard and the top of the keyboard gives (bends) a little). The volume control keys are particularly bad.",
        "Great seller - took the item right back. The item is junk unless you happen to run Windows XP. Otherwise you are SOL as there are no drivers for it.",
        "the biometrics, which is what I bought it for, didn't work. everything else worked. I had to return it.",
        "Excellent keyboard and mouse. East to install and configure fingerprint scanner. Works every time. My Favorite Keys are easy to set up and are helpful. Finger print reader saves time when logging in to various web sites. Recommended.",
        "Doesn't have quick sign in when yu have quite a few? Is the last to upload.,Doesn't have clear identification for caps lock on or off",
        "Very easy to set up, works well, but does take a while to pull username and password from saved memory. Sometimes up to a minute. Mouse works well.",
        "we enjoy the finger print options and the mouse is great too.. the keyboard has tons of options.. i would buy this again...",
        "do not purchase it doe's not work with windows 10 there is no driver for it. but its a nice keyboard",
        "Pros: 1) software for fingerprint works flawlessly and VERY robust 2) the keyboard is a STANDARD layout unlike many previous ms keyboards Cons: 1) the fingerprint pad needs to cleaned (towel + water) REGULARLY or it wont sense your fingerprint anymore 2) very poor design in that it takes TWO valuable USB ports when they could have designed it to use one and have the wireless receiver integrated into the keyboard. 3) the mouse (Wireless Optical Mouse 2.0) tapers out at the bottom which pushes the pinky finger outwards which makes for a very unergonomical hold on the mouse (at least for me) My old Logitech Click! felt so much better being it tapered in at the bottom.",
        "This product performs well for me in the following ways: 1. It works as described. 2. It makes entering ID and passwords much more convenient. 3. More complex, longer and stronger passwords are easily accomodated, rasing my security. 4. Use of the fingerprint reader allows me to log on to a site without other persons in the room seeing my passwords, or even noting their length. All-in-all I am glad I purchased this product!",
        "Biometrics is a fantastic idea....and Microsoft is one step closer with this keyboard :) It not only saves me time by remembering dozens (if not hundreds) of passwords for ALL my FPT accounts and website logins, it also is a comfortable, easy to type with keyboard. I liked this keyboard so much, it is now the only keyboard we use at Stormfront Productions (...). Highly recommended for people tired of forgetting passwords!",
        "Great keyboard/reader IF you have only a 32-bit system. Microsoft hasn't the software to support this for the 64-bit yet. To see which system you have; 1. Click Start and then click Computer. 2. From the menu bar, click System properties to view basic information about your computer. 3. Under System, see System type for details. You should see a 32 or 64 somewhere on your screen. If you have a 64, then good chance the reader won't work for you. However, the mouse and keyboard might.",
        "Altough the pictures of the keyboard clearly show it without any wires coming from it, when it arrived it had a USB cable attached to it, the very thing a person wants to avoid if they are going for a wireless product. The seller refunded the cost of the unit but kept the S&H fee (a source of profit from the much lower actual cost to them) and would not pay for the return postage. They said we should have scrolled down to the bottom page of the web site to read the small print -- \"USB wire attached\". Beware of dealings with this marketer.",
        "I really love this item. I purchased it because of the fingerprint reader and I am very happy I did. It installed great and is working brilliantly. I use it for my Windows log-in and all sorts of other online log-ins as well. Not sure how many you can add- but I have already added a lot of login's and it hasn't failed me yet.",
        "Attention! It does not support Windows 7- 8 and 8.1 - I did not find a solution to run on Windows 8.1",
        "This keyboard and mouse are so cool. I have owned alot of keyboards and by far I love this one the best. Once setup you can go to any website that has a login and scan your fingerprint in about 2 seconds and your logged in. It does the same for Windows as well. One downside is I wish the mouse was recharagable like my other keyboard (Logitech Coordless Something). Besides that great keyboard.",
        "so far this keyboard has been great and for the current price, i think it was well worth it. the thing i dont like about the product is the corded keyboard, and the limited range that the mouse has, and also it would be nice if the mouse came with more buttons and not the standard two button optical mouse. but besides that everything is great! and the fingerprint reader is incredibly useful! i will comment again if i have any prblems.",
        "Does not let you logon to domain with your fingerprint. Thus is just a toy for home use. Wait until they make a version that lets you log onto your domain with your fingerprint (oddly they act like somehow a \"password\" is more secure than your fingerprint, which as you know can't be copied or stolen). Product will be worthwhile once you can log onto domain. Otherwise, don't waste your time or money. Mike Crowe",
        "I was disappointed after trying to use the fingerprint reader with my Mozilla browser, apparently it only works under Internet Explorer. Not a good decision by Microsoft since most of the techno savvy people who purchase this product are not going to want to be forced into using Explorer. I gave this product 4 stars, because it works wonderfully under the intended environment. Perhaps they will release an update that will allow the fingerprint reader to work under different browsers.",
        "I love my new fingerprint reader keyboard, but I am having problems with the mouse. it keeps locking up on me and I have to unplug it from my computer and replug to get it to work. I have uninstalled and re-installed it. I have went to HP help center and no one can help me fix this problem",
        "I've had this keyboard for a few days now and couldn't be more pleased. The fingerprint reader works great and is definitely an attention getter in the dorm. The keyboard itself is very comfortable and well designed. The same goes for the wireless mouse. I would definitely recommend this one.",
        "This Product is great. Only issue is that it isn't Vista Compatible out of the box it takes some major digging on Microsoft's site to get the fingerprint reader to work",
        "JUST SO EVERY1 KNOWS THIS IS NOT A WIRELESS SET AS DESCRIPTION SAYS !!! just the mouse is wireless not the keyboard im not big on giving reviews but figured evey1 should know this",
        "I've got a million and one passwords. I don't mind using Microsoft products. This is the best keyboard that I've ever used. I've become dependent on it. It's a great time saver.",
        "I am very happy with the purchase, it is excellent product, very easy of using, and he adapts, perfectly, to my necessities, the truth recommends it thoroughly, this very complete one the keyboard and the mouse is very practice, buy it without thinking, its technology, doesn't let doubt some that it is a serious product,",
        "The fingerprint reader on this thing is worth every penny. I was sceptical on how accurate this would be but it has lived up to all it can be!! FYI: Only the mouse is wireless, not the keyboard",
        "It's a great product from Microsoft and i love it. Had no prblems with it yet and the fingerprint reader is easy and fun, comes in handy.",
        "Sometimes my fingerprint opens the computer and at other times it doesn't work at all. Overall it is very undependable. William Ray",
        "its great security and has a lot more great features than i expected. it was well worth it for the bargain price i got it for",
        "While there is no problem with the wireless optical mouse, the fingerprint reader does not function at all even after uninstalling, reinstalling and doing all of the other pomderous instructions that are not included with the product but have to be found from the start menu. I have never purscased such a useless product with the exception of MS's media networking system. Rob"
    ]
}