{
    "entity": "Keyboard & Mouse Combos",
    "text": [
        "I've had 2 of these keyboards and mice. I love them. I've literally worn the mice out gaming...the scroll wheels no longer work. The keyboards, I've dropped a thousand times. They both work fine. The price is outrageous, but you get what you pay for. The only thing I don't like is where the sleep button is on the keyboard. My computer set up is in the living room so the keyboard roams. I still occasionally grab the corner with the sleep button. I looked for a mouse that would work with the keyboards. Too bad they don't sell the pieces separately. There's probably a method to the madness. 2 mice in 8 years...pretty good for today's throwaway society.",
        "Highly recommend this keyboard/mouse combo. Keyboard has a very nice feel with soft touch and very quiet keys. Mouse works on just about any surface, could be a little larger for my hands, but otherwise feels comfortable. Very friendly with my KVM (IOGear) I can switch between multiple PC's and not have any drops.. switching is seemless. Would highly recommend users also install the third-party UberOptions SetPoint enhancements ([...] This lets you program just about any key on the mouse/keyboard and have it apply globally or per application. So in iTunes I can use the mouse alone to skip forward/back, change volume etc. In Word I can use the same mouse keys to do Cut/Paste instead. Very customizable.",
        "You get a decent product for what you pay. Here are my pros and cons. Pros: -Keyboard keys soft and quiet -Mouse comfortable to use -Reception perfect -Keyboard and mouse design -Clock/timer built into keyboard -Software allows mapping keyboard keys and mouse buttons to different functions Cons: -Battery life for mouse. Advise using rechargeable. I'm only 1 month in and am getting critical battery warnings (although they seem to come and go) -Had to install the software a couple of times to get it to work. Still get startup errors sometimes when booting into XP. -Still getting used to the design of the delete/home/end/page up/down grouping of keys (different than standard keyboards)",
        "I just bought the MX3200 for a Brand New Dell Desktop with Vista. The Keyboard and mouse both worked perfectly right out of the box. I am using it for my T.V. and at a distance of 12 feet they both work flawlessly. I \"DID NOT\" however download the drivers from the disk. I read all the horror stories about the drivers so decided to forgo the possible headache. I just wanted to write a quick review for anyone that was on the fence because of all the bad reviews reguarding Vista issues.....I believe the driver disk is the problem and not the keyboard or mouse. Bottom line: I LOVE THIS MX3200 DESKTOP!! :)",
        "For me this is a high quality setup. Nice feel of the keys and the mouse feels good in the hand. This is one of the few keyboards with lots of nice extra keys that I can program to launch my most used applications with a simple quick touch. The mouse has all sorts of extra controls for those who might fancy that. Very nice indeed. The initial setup was very quick and easy. Basically, just put in the batteries and plug in the dongle. No bottons to press, it was all automatic and fully compatible at the PC's BIOS level. I highly recommend this outfit.",
        "The Logitech Cordless MX 3200 works very nice. I previously had a generic Microsoft version. My upgrade to the MX 3200 works well. The keyboard has most functions well integrated. The function keys work in most software applications with no additional programing. The time clock on it and date is also convenient. The zoom on the side is really great for presentations of spreadsheets. I am very happy with this product. It did take me about 1 -2 days to get used to the keyboard, as the keys are slightly in a different muscle memory area than my last one.",
        "We have three PCs in the house, and this keyboard mouse set do the job and never seem to interfere with each other or any of the other wireless products. We like the comfortable use of the wireless keyboard and mouse. My son is a hard core gamer and he never complains about the performance. I like the features of controlling volume from the keyboard, and being able to use it while sitting in my chair. Best value for the money and the applications that I've found after thirty years in the PC business.",
        "I bought this keyboard/mouse set to use with the computer hooked up to my TV and it has been working just fine. The keyboard hasn't been getting used much but the mouse does. I ended up buying another set to use at work and I've never had a problem with that set either. The only qualm I have is that the mouse I have at home is starting to have some of the rubber wearing off near where your thumb goes. I don't even use it that often and the rubber is already wearing off. The quality could be a little more improved.",
        "The mouse is very comfortable and easy to use. The keyboard has taken some getting use to. Overall this is what I expected from logitech and they haven't let me down so far. Installation of their software was a pain and I ended up uninstalling which was a complicated mess and I could not get it entirely removed, so now I do not have all of the functions available for this keybord but most of it I won't use anyways. If not for the software issues, I would have given it 5 stars.",
        "I have had this for at least 4 years and I have had no problems. Batteries last long enough that I'm not even sure how often they die. Solid construction, though after a while the grip on the mouse has started to wear away. The mouse is my favorite, I haven't found a single mouse that would give me any reason to upgrade. I'd like two more buttons, but the ones that have more are in awkward spots.",
        "Spilled a drink in it. It died. Ill take half the blame.",
        "MX3200 keyboard and mouse are great. Keyboard works great whether sitting flat on up on its front legs - I am at home with either one. The keys are very gentle and easy to use - I can use for hours without finger strain :-) Mouse has been using one set of AA batteries for a month now. One can easily turn it off with button under it, but I keep forgetting and it just keeps going. Software makes it even friendlier for individual users.",
        "I've tried quite a few wireless keyboards over the years and I'm always disappointed by how finicky they are. This keyboard and mouse are truly the answer if you suffer from corpal tunnel syndrome or just need a keyboard and mouse that maintain a good signal to the computer from more than 6\" away. The keys practically massage your fingers. The clock/date at the top of the keyboard is a great feature and there are more function keys and added features than I know how to use. This is worth every penny you'll pay for it--hands down.",
        "Still functional in 2017! Damn good quality and awesome customer service by Logitech. The mouse had some wear over the years and they sent me a new one covered under warranty few years back. Love Logitech.",
        "All I needed was a wireless keyboard which is good because the mouse is very uncomfortable for left hand usage. As well the \"dynamic zoom\" bar on the left side of the keyboard is very finicky, sometimes it won't work right away unless you switch windows back and forth, and rarely it will go off by itself and zoom for no reason. The reception is good as long as there's nothing blocking the front of the keyboard. The revamped editing keys might take some time to get used to if you use the standard layout a lot. Overall it's a very comfortable and stylish keyboard with more programmable hotkeys than a standard user will probably ever need.",
        "I used this keyboard from 2007-2013; both items still work great; I would still use these but I decided to go back to a wired mouse/keyboard setup when I build a new computer. I bought two sets of these, one for a friend and one for myself and he has had zero problems with his either. Great Products!",
        "Purchased approx. a month ago and it works as I expected...which means it's a Logitech product so, of course, it works well and very dependably. It has more features than I need but that's OK, I just needed the freedom from wires in the space I have now. I wish I could get it with a wireless Trackman, as that is my favorite style of mouse, but they don't offer that option.",
        "Logitech is the way to go with wireless K/M. PROS: The Keyboard is stylish and slim. The key strokes are smooth. The mouse is very comfortable in my hands and smooth when using. CONS: The zoom feature on keyboard. It would have been nicer if they had put it elsewhere on the keyboard instead of the side. At time I accidentally swipe it when looking at websites. Overall it's a great product and well worth the money.",
        "I have had this product for years now and it has been dropped, kicked, and moved around to three states without fail. It is incredible for the price!! I will get the same thing again if this one ever dies. I don't see that happening any time soon.",
        "Very happy with this product overall. Only mildly irritating is the dynamic search & zoom function on the left side of the keyboard, which can be activated by a piece of paper touching that surface. Outside of that, the function keys are great, the touch on the keys is comfortable, as is the mouse. Definitely recommend.",
        "Very comfortable to type on and quiet. The only thing I could find fault with is that the lettering on the keys is very small and light colored. If you don't know the keyboard you need a light close by. Very easy to use the mouse and I love not having to be wired to your tower. I definitely recommend this product!",
        "I love this keyboard and mouse. It's ergonomic but not so much it's uncomfortable like some are. One thing I can't figure out is the clock display. It's very faint and I can't figure out how to make it brighter. It was very Easy to install and operate and a good price. Great addition to my home office.",
        "This is a great combo! Amazon still has it @ the best price anywhere! I've had this combo for over a month without one glitch! Highly programable, stylish, nice lay out and plenty of nice options. The only draw back I found was that I would add lighting for clock and lites on the keyboard for num lock and caps. Made a nice addition to my custom built system!",
        "Bought this to go with my new Dell PC with Windows Vista installed. Works seamlessly with Vista. The keyboard is great, much smaller than my old Microsoft wireless keyboard. I love the new smaller F keys. The mouse is very comfortable, as I sit for 10 hours a day editing documents. Would recommend - wireless is definitely the way to go.",
        "I got one of these with my new Dell and loved it so much I bought another from Amazon for my husband's computer. The mouse is especially comfortable for me, and the keyboard is great since I usually put it in my lap. Both have more features than I'll ever use, but there is always the possibility that I'll learn!",
        "Batteries don't last as long as advertised. And the keys and mouse buttons get really soft after years of use.",
        "I liked this so much at home, where I've used it for several months, that I bought it again to use at work. It's comfortable, with good battery life and wireless range. About me - I spend a lot of hours on computers each day, have small hands, and never learned to type properly.",
        "Logitech has never disappointed me once. This is a very easy to install and very easy to use cordless keyboard-mouse combination. I am extremely pleased with the product and Amazon service as well. Amazon is a great place to shop and purchase large variety of products safely and easily online.",
        "This review is for a Logitech Cordless Desktop MX3200 Laser. This is a full-featured Keyboard Mouse combo from Logitech. I had researched the features before buying, and this was at the top of my list. Excellent product and excellent design. Love it, No regrets what so ever.",
        "I wanted the best keyboard possible. I tried some that were more expensive but they has problems with vista. After trying several, this one is just great. It has all the bells and whistles but isn't too big. I've been using it for about 6 months.",
        "I have been using these items for 3 months now. Very simple setup and works great. I am running Vista on a Dell laptop at my workstation and everything has been functioning without a problem. I even went and bought one for my new computer at home. I would highly recommend this product.",
        "Keyboard and mouse works well.Install was easy, with download from Logitech site, for latest SetPoint software. Help section(for programming keyboard)a little confusing,but a call to logitech support solved any problems or questions I had.",
        "The only issue I have with this desktop is that it appeared it was a single thumb connection, when in actuality it has a 'wired' receiver/transmitter as well and it's just somewhat smaller than average. I was disappointed at that.",
        "This product has been trouble free. They did a good joy with the mouse they provided. The only problem I have with the unit is it is too dark for my old eyes.They could have made the keyboard much lighter color so you could see the keys in poor light. I would rate it a 5 star if it was not for that.",
        "I don't think anyone has used this keyboard and mouse set before I did because it was listed as used but I swear it was in best condition. Props to Reforger. This keyboard has a pretty nice feel to it. Not too different from a standard keyboard. Although, the wrist thingy is really convenient. The mouse has the best. I have back and forward in web pages and volume up and down, and new tab. Although the new tab button for me is a little too close to the volume up and down. The software is pretty good and straightforward. Definitely recommended.",
        "These are quality products, work great, hook-up easily and allow so much more freedom! No cords to slow down movement; keyboard even displays date and time and many other options. I wouldn't go back to the old styles, ever.",
        "I have been very impressed with this keyboard. I haven't had any of the problems as stated in some of the other reviews. The response is as good as any wired or wireless keyboard and mouse. All the features you could want. Amazon shipping was Great!",
        "Keyboard feels very good as does the mouse, but the wireless feature is far more tempermental that my old Logitech 700 series combination. I have to move the signal sender/receiver around all the time to get consistent performance.",
        "Unlike every other mouse/keyboard combination I have seen, this product does not permit the user to flip the left/right mouse buttons to facilitate use by left handed people. Also, the keyboard will only lay flat on your desk, with extremely limited options for angling it upward for comfort. Logitech customer support is nonexistent. I gave up on their help line after 37 minutes. The left/right restriction is only hinted at in the manual, where it states that \"some models\" are for right-handed use only. Logitech does not have any indication on its packaging that the product cannot be used by left handed people.",
        "i got 8 years out of it and the keyboard JUST went bad.",
        "The keyboard is unlike all the other Logitech products I've purchased in the past with the smallest of font on the keys themselves. Not being a touch type person I often have to look at the keyboard and even with good lighting I can't see these keys very well. The mouse was fine but they came as a set so they were returned that way. Thank you to Amazon for a quick RMA and a quick refund.",
        "this set saved me - i was working with just my laptop keyboard and touchpad - then an ad hoc set that plugged in - but this set was a dramatic improvement. The design was a big step up in the comfort department. well worth the price!",
        "We use this and the MX 3000 in our office. We do have a few MX 5000 but they have continual connectivity issues. The only advantage I see in the MX 5000 is that you dont have to use batteries in the mouse (uses a charger). But considering the increased price of the MX 5000 and the connectivity issues, the MX 3200 by far shines ahead. The mouse precision is very exact also. Overall, really like this combo.",
        "I hated it. It's in a drawer along with all the others with built in wrist supports. The keys feel \"wrong.\" Not really the fault of Logitech, it's the way I type. I am used to a notebook computer which has keys in very different positions on the keyboard. I have to hunt what I want on the desktop keyboard. I refuse to use a keyboard that makes a sound when I tap the keys, too. Just me being different. I prefer Logitech over any other brand of mouse even though I use Gateway computers.",
        "I Love it because,I have one for two years and work perfect. I have not got any problems and you cant do anything.",
        "My son purchased the original one for me in 2008 while I was recuperating from surgery. Wireless is wonderful. Love the features and ease of use.",
        "I love this keyboard and mouse. Well made and very responsive. I have to learn not to bump the \"Dynamic Search & Zoom\" slide - really had me perplexed the first time I bumped it and my browser screen shrank nearly out of sight.",
        "This keyboard is awesome!!! It integrates perfectly with Windows Vista, and does more than any keyboard I've ever had. The fact that it's wireless is a huge plus, and the keys are quiet when you're typing, too. I highly recommend this keyboard.",
        "I found that this product had way too many features, like the tactile zoom function on the keyboard, I kept hitting it by accident and it kept zooming until I turned it off. Also the battery life on both the keyboard and mouse only lasted a month to two months at a time before needing to replace the batteries.",
        "The keyboard and mouse works just fine. the mouse is well designed and is comfortable. the keyboard has soft keys and also firm. nice product.",
        "this new cordlesss keyboard and mouse are excellent; great value; easy to download software; each generation just keeps on getting better. The $20 rebate made this a real bargain. Thanks Logitech & Amazon!",
        "I purchased this wireless desktop kit back in 07' and it's still in use. I gave it to my son, meanwhile I've purchased another Logitech kit for myself. You can't go wrong with Logitech.",
        "This keyboard, mouse duo is second to none. Response time is immediate, and never is it sluggish.",
        "The keyboard came to me in near perfect condition. My only issue with it is if your are used to a flush desktop keyboard like the flat hp's or the apple keyboards. It takes a few days to get used to its curvature. However it's a mega awesome keyboard and mouse combo especially when you download the drivers for them. IT's my favorite one yet.",
        "I just purchased the Logitech MX3200 and had the same sound problem reported by several others. I'm disappointed that Logitech did not fix this despite the numerous bug reports on this site. To restore my sound capability, I needed to reset the \"default device\" under Control panel/Sounds and Audio devices/Audio/Sound playback. It seems that the mouse/keyboard installation had changed this setting. I hope this fix helps others with the same problem. I couldn't be more furious with Logitech!",
        "Mouse design and features are great. Keyboard works fine but is a little \"busy\" and zoom feature is in a poor position - at least for me. Soft padding material on both pieces attracts way too much fingerprints/smudges.",
        "- Keys are soft and comfortable - Mouse grip fits hand nicely - Wireless connection is pretty reliable",
        "Not very happy with this keyboard. It just feel right and is hard to type on. Maybe it will just take some time to get the hang of it. I would return it if I could get a full return.......",
        "The Logitech MX 3200 is a great product and very easy to install and use if you are looking for a cordless keyboard and mouse the MX 3200 is a great choice. The item was shipped and receive very quick and was a great price. I would for sure use this seller again. Thanks Dave",
        "Running with Vista needed to go to Logitech for drivers. Great key board and mouse no problems with install.",
        "The product was brand new, the customer service was outstanding and the time from ordering to receipt of the product was excellent!",
        "It been a month since I am using this keyboard and mouse. They are pretty good. Mouse is accurate. Keyboard works well with less clutering of wires due to single USB port usage with the help of a small device that connects them together.",
        "I read the reviews on Amazon before buying this and I was glad that I did. Haven't installed the software to really make it sing yet, but the keyboard and mouse worked immediately after plugging in the usb antenna.",
        "The combo is very useful even though its a bit pricey. I use it with a laptop and love it.",
        "This is an excellent key board and mouse combination for the money. Full featured, good range, and sharp looking. Mouse is extremely ergonomic. I liked it so much I purchased one for home as well.",
        "Keyboard and mouse were very easy to install and they work flawlessly. Just what have come to expect from Logitech equipment.",
        "I always buy Logitech products and this keyboard has all the options I need.",
        "I was very impressed with this product. It worked as soon as I plugged in the receiver.",
        "This is a fantastic system. Quality construction and the tactile feel of keyboard and mouse are first rate. Recommended.",
        "Received on time, installed easily and runs great. Everything I expected. Will purchase again from Amazon.",
        "This product is made well. Good material, very sleek. The only problem is the range isnt very good.",
        "Had one feature on the mouse that did not work. I called up and Logitech replaced the whole unit. They both work great. Good value for the money",
        "The title says it all. I am not sure who to blame: MS or Logitech but after killing 2 days of constant install/ uninstall, I've finally given up on this product.",
        "I purchased the Logitech MX3200 Cordless Desktop Laser keyboard and mouse. The delivery time was very fast, the service was excellent!",
        "This product works really well and Very handy when you have a lap top",
        "Complete POS worn out crap covered with paste wax. Scarred up, chipped up, worn out. Buttons all smooth on the space bar and return. The silk screen on the mouse was half worn off. 10.00 at a swap meet. Never again. Stupid me.",
        "Product delivered new in the original box. Have not been able to use it yet, but I don't expect any issues. UPDATE (17 JAN 14) - I have not had any issues with this product. It is responsive and durable. I use it with a computer that is a couple of years old, so any lag issues I have I will be willing to blame on the computer itself. Logitech products have been a staple for me when I need something that I know will have minimal, if any, issues."
    ]
}