{
    "entity": "Keyboard & Mouse Combos",
    "text": [
        "I have had quite an assortment of keyboards and various form factors of a mouse. These are both the best I have ever had. The form of the keyboard is easy on your hands and the mouse has a very light touch. With aging eyes, I also like the magnification feature on the mouse! I don't use it often, but is great when you want to enlarge an area of fine print or a picture.",
        "Terrific mouse: Very accurate and the zoom function a great tool. Keyboard has a light touch plus the white keys are easy to see in a darkened room. 5 configurable hot keys plus dedicated ones for mail, internet etc.",
        "Seems to have a decent range for this type of wireless connection, great response from the mouse, i have an older version of the this KB/Mouse and it doesnt work from as far away",
        "I bought this set as a replacement for the Microsoft Office keyboard I had been using the for previous 3 years. Was I ever sorry! The mouse appears to work okay but the keyboard was a disaster. It missed about every 3rd or 4th letter that I typed, resulting in \"wre\" instead of \"where\" for example. It was very frustrating and, of course, there was no easy way to contact Microsoft technical support, which, as far as I could determine, doesn't really exist at all for home customers like me. In any case, I bought a Logitech MX3100 wireless set to replace the 6000 and have not had a single problem with it.",
        "I have used many keyboards and mice over the decades and have found the Microsoft Laser 6000 set to be superb. The breath of functionality and degree of comfort are excellent. Each work perfectly with my Mac Powerbook (when at my desk) as does the software.",
        "I've had a few of these keyboards for my job. I transcribe for a living, so I use my keyboard a lot. So glad I could find this keyboard.",
        "This keyboard is great, the build quality is good and I love the layout, however the keyboard that this replaces (for mac users) had mac specific keys including EJECT which is necessary on a mac and i thought would be on this keyboard. I am disappointed that they stopped making the Mac specific one and have this as the Mac compatible one now.",
        "The keyboard and mouse do exactly what they are supposed to do. It's great to do away with wires!!!",
        "This was a bad purchase. Mouse touch is very hard to control; tried adjusting a number of times but to no avail. Also, the screen says mouse battery is weak (and opening programs by clicking doesn't work at times), so I've changed the battery and moved the pickup unit closer to the mouse, but I still get the same problems.",
        "this was the 4 th time i purchased this set. My first 3 (2 for pc one for an apple) Lasted for years this one for 2 months. Last microsoft keyboard i will buy",
        "I have to disconect it at least 5 times a day because it suddenly gets stuck in a key stroke and keeps typing it until you disconect it phisically",
        "I read the good and bad reviews. With such a wide range of opinions, I thought the product must work from the good reviews written. And if it does work, the bad reviews must be operator error.If it works for some it should work for all. I think I made the right choice. The key board and mouse work great.",
        "I just recently got this keyboard and mouse and have had no problems with it. The zoom feature on the keyboard is very handy and the magnifier on the mouse is an outstanding feature! Makes it easy to read some of the very small print on the screen. I also have not had any of the missed key problems that some people have reported. I've even tried typing as lightly as possible just to see if it would miss anything, but it didn't. Every keystroke was recorded. And not having all the wires to contend with is great. All in all, I'm quite pleased.",
        "I don't use my keyboard that often, yet even with infrequent use, the space bar broke after only 4 weeks of use. The keyboard is a cheap imitation of other better models. The shape is the same as some other MS models but the quality just isn't there. Go with the MS 4000 model, it's much sturdier and has all the same bells and whistles as the 6000. Plus the mouse is ambidextrous, which may come in handy if you ever need to switch hands (as I did for a while due to an injury) or have someone else use the computer.",
        "I wish that I had read some of the reviews here before buying this product. The big problem is the left mouse button which only works part of the time. Quite often I will have to click the mouse 4 or 5 times before an action takes place. Sometimes performing a left click will cause whatever I'm looking at to scroll very quickly. Since I use the left click all of the time, this is unacceptable. The problem didn't start until about a week after I purchased the product. The mouse movement is fine, the scroll-wheel works, but doesn't have a good feel. I don't not recommend this mouse and keyboard.",
        "This is the second keyboard i bought. It's exactly the same one I bought for my other computer. Both of them are used on iMac computers. While I had absolutely no problems with my first keyboard, I did have some problems with the second one. First of all, when I installed the software, I could not get the CD-ROM out of iMac and the computer become unresponsive completely with the CD-ROm inside. And when I finally got it out thanks to apple service representative's help then i noticed the keyboard skips some letters when typing fast.",
        "Bought this to replace my desktop elite also from Microsoft.Installation was simple.What I noticed right away is how precise and quick the laser mouse is.Much improvement over the intellimouse explorer 2.0.It's got a magnification button that is a nice feature as it can expand and contract.Also very comfortatable and a good fit with your hand.The keyboard is nice too although not revolutionary.It's your basic upscale type of Microsoft keyboard and what's nice about it is that the keys are white.I prefer white over black.Also the mouse and keyboard are in an attractive silver and grey.It would have been nice if they found a way to light the keys.Anyway,it's worth the price as the mouse steals the show.",
        "Mouse is good, Keyboard is junk, specifically the space bar needs redesigning. There should be a recall on this keyboard. Spacebar gets hit more times than any other key, and it is the weak link in the keyboard design. Like I say the Mouse is great. Spacebar will get locked up on the right or left side after awhile. Don't much like the curved keyboard either.",
        "Got this package on sale. Installation was easy. Software on CD was outdated but you can go to Microsoft site and download the newest. Keyboard feels great. Mouse on other hand... terrible! I got this because friend had his Logitech wireless keyboard/mouse and I loved his setup. RF receiver have serious problems syncing with the mouse at any range! Pointer jumps around and always doesn't track right. Pro: [] Keyboard feels great. [] Keyboard <==> RF receiver is almost perfect. [] Mouse feels very solid in hand. Con: [] Mouse <==> RF receiver is HORRIBLE!! Spent more time on frustration than actually using the mouse. [] 27Mhz RF instead of 2.4Ghz wireless.",
        "I'm real happy with this product, I've been using it for a couple of days. The one thing that's killing me is the funny placement of Insert, Delete, Home and End keys. I still use the old cut, copy and paste shortcuts (shift-delete, ctrl-insert and shift-insert) I think they're from unix and Windows 3.1, but they still work everywhere in Windows XP. Maybe old habbits die hard but I find them a lot more natural as far as placement of your hand. Anyway, my fingers don't stretch that far on this keyboard and I'm loosing my grove while writing code. Oh well it feels like a million bucks, just wish I could have my cake and eat it too!",
        "Pros: Like a quality piano, the keys give a sense of weight, the bend in the keyboard tool some getting used too but now am typing a full speed. The mouse offers great control, though I haven't much used all the buttons that are one the form. Cons: The only gotcha is if the computer freezes, there is no way to control-alt-delete. Also, Setting the favorite keys to non microsoft items tends to reset after updates and restarts.",
        "This keyboard/mouse combo has been great. I haven't had any problems with it. In fact, I'm buying a second one for work. The zoom slider on the left works great with Adobe Photoshop. Also, the music buttons at the top work with MusicMatch.",
        "I bought this thinking it was a Microsoft product so it couldn't be all that bad. I was wrong. Typing causes characters to be missed. At times typing would cause programs such as the calculater to open up. I made sure I had the latest drivers and software for it. I also made sure the receiver was close to the keyboard. Anyhow, I got fed up with it and sent it back. I would not recommend this to anyone. I went ahead and purchased the logitech wireless desktop and hope I have better luck with that.",
        "I've owned this for a year and am looking for a new keyboard. I have continual connection problems with mouse and keyboard and continually have to reset. Low battery warnings appear every day. This keyboard was not cheap and I thought Microsoft could do better, but I can't afford to waste my time trying to type a sentence.",
        "As ususal, being a Microsoft product the Desktop 6000 is good. Also as usual I find that I am paying a premium for the Microsoft brand. One of my fellow office workers bought a similar product by another company and got essentially the same features for about 15% less. Time will tell if the Microsoft product will outlast the off-brand...",
        "Our main home computer is a laptop. I often find typing on the laptop keyboard difficult because the keys are so close together. We got this keyboard and we love it! There are no annoying wires to deal with and when we aren't using it, we can put it away. When we need it again, we just place it on the desk and type away without having to plug it in. So convenient! It also has highly useful one-touch keys to open our most used computer functions. I highly recommend this product.",
        "The keyboard may be eregonomic, but it is NOT Apple compliant. The two biggest problems are is that (1) it does not lay out the meta keys as does apple, i.e., the Function, Control, Option and command keys and (2) the function keys do not work in the sense that they do not behave as the F1-FX keys on the Apple. Having an ergonomic keyboard is great, but this hunk of (expensive) plastic sits in a box gathering dust as it is not what Microsoft advertises, Apple compatible.",
        "I really love this product for the price it works so good I use the keyboard and mouse with out the wires to get tangled and I can use it with or without the mouse pad the zoom on the mouse is great also when you can't see what a product or text is so small you can click on the zoom on the side of the mouse and you can see what your looking at up close. I also think the way the mouse feels in your hand it great as well as the keyboard is so easy to use and has key strokes you can personialize to your liking.",
        "Microsoft's competition has succeeded in infiltrating their hardware products division. I say this without fear of contradiction because it is the only plausible explanation for how Microsoft allowed a single Wireless Laser Desktop 6000 to have escaped immediate and summary incineration. A troupe of rabid baboons would not have let a single unit of this dross past the first QA check. Why spew invective? Because I purchased two of these jaw-droppingly subpar pieces of junk at the same time (one to use at the office, one to use at home) only to discover the hard way that seeing \"Microsoft\" on the box means bupkis.",
        "the only complaint we have about this keyboard is that it seems to use batteries pretty quickly. it has a good distance from the base. we can sit pretty far away and watch movies using the keyboard. the comfort thing on the keyboard is really nice. the mouse is really smooth and works great. would definately reccomend.",
        "Works well, and I like the typing action on the keyboard. I have big hands, if you have small hands you may find them a little widespread. The mouse eats batteries. Do not believe the hype about how long they last.",
        "This is my 4th keyboard in the past year and a half; between myself and my daughter we've spilled everything from coffee to apple juice on our previous ones. When the apple juice spilled (yet again) on this keyboard, it was really easy to pop off the letters, let them dry, then clean them up without any permanent damage to the keyboard.",
        "I am very unhappy with this combo and will return it. The wireless connection is terrible and the keys on the keyboard stick (brand new). I like my Logitech optical mouse much better.",
        "Installing this keyboard caused my screen saver and power saver features of my monitor to stop working. Apparently this is a known problem. I couldn't find a work around. After about 3 days of use, the keyboard and mouse started flashing wireless connectivity error messages. I replaced the batteries, but that didn't help. The operation became intermittent at that point and I returned it.",
        "Beautiful set, but the performance let me down. The mouse works approx. 30% of the time, causing you to click over and over again on items. The keyboard will work for periods of time, then skip letters when typing. Back to Logitech for me!",
        "This product is definitely working out. In fact I am laying in bed as I type this. The only problem I've had so far is with the space bar because sometimes when I press down on it, it doesn't register. Otherwise it is working out great. I don't have to sit in a computer chair and get neck pains anymore.",
        "One warning for users with over head lights. The 6000 keyboard that has tranparent (light gray) keys is very hard to read if the lighting is not quite right. I have a light directly above my desk and the reflected glare off the keys makes all the letters and numbers disappear. Go for a black key or similar model.",
        "This product works great with my iogear KVM switch that only has PS2 ports! The laser mouse works great and the keyboard has a great feel. I love the curved keyboards!",
        "This was a gift for my boss. She loves it. I'm going to have to get one as well."
    ]
}