{
    "entity": "Keyboard & Mouse Combos",
    "text": [
        "One of the best keyboard setups I've ever owned. Gave it as a hand me down to a family member and they are still using it and are very happy. Why did I give it away? I bought a new one silly.",
        "Although it may seem expensive this keyboard is worth every penny. It's essentially a laptop keyboard the size of a regular keyboard. Being able to detach the keypad is a great feature for people like me who have limited desk space. The keys feel great, the only issue is the \"0\" on the keypad, I don't know why they have a \"000\" next to it and I often hit it by mistake; but it's not bad enough to want to knock down a star from this oherwise great product.",
        "No complaints here. Works perfectly fine with my set up. The fact that the 10-key is a separate unit couldn't be a finer option. Gives me more room on my workspace. I use a Wacom pad for graphics and also to avoid repetitive whatever you call it syndrome, so the mouse has been stowed for when I am on the road. Perfect combination and I love Logitech products and their customer service is US based, so not only do they understand you clearly, they seem to be trained clearly on how to troubleshoot.",
        "Only negative thing I could say about it is that, \"mouse\" feels little uncomfortable, because it might be small for allot of people as it is for me, but the keyboard is the best.. I've had allot of keyboards before this one but \"THIS ONE ROCKS\" YOU WON\"T REGRET <GET IT> IF PRICE IS EXPENSIVE FOR SOME OF YOU \"consider this\" YOU GET WHAT YOU PAY! ! !",
        "A perfectly executed design! Great key touch, the mouse and number pad have power switches to conserve battery life. Be sure to have the latest BIOS on your PC or the keyboard won't be recognized at boot. large, accessible reset buttons. The batteries on the mouse load from the top of the unit so you don't have to endure the red light during installation. The keypad has date, time, and temperture readings. The mouse is small in my hand, but perfect for my wife and daughter. It's a real leap in design and execution.",
        "Firstly, the set up/install for this product could not be easier. Took longer to open the battery package then it took to get everything operative. The keyboard is trim and solid and the keys have a very nice feel-not at all rattly like so many are. The separate calculator is a very nice feature too. And it all looks great. I am not sure yet about the mouse because I prefer not scooting around and still love (I know it's ancient technology!)my old trackball. Going cordless is great!! And Amazon's price was great as was their fast shipping.",
        "This keyboard resembles that of a laptop, except full size. I bought it because of its slim size and I wanted a quiet keyboard. The only downside of this combo is the mouse, which is somewhat lacking in features.",
        "Received the keyboard and it has a different layout and the buttons are all written in Spanish. this is not what they advertise!",
        "This thing is fantastic. Used if for years and years and it keeps going perfectly. I like the media controls on the calculator - I use it like a remote when I go outside.",
        "This product works well, although a key did pop off. It was fairly easily repaired, but shouldn't have happened in the first place. Otherwise, works well. Nice having the 10-key pad.",
        "This keyboard is decent, but the spacebar sticks really bad. It is really annoying when you are typing really fast and the space bar doesn't register. I wouldn't care if another key stuck that was less used, but the space bar is one of the most important keys on a keyboard, and if it doesn't work properly then the keyboard is useless. I would go with the Logitech S510 instead, that keyboard has the best tactile feel of all of the keyboards I have used, and I have used a lot. Good luck in your keyboard search.",
        "I love most every part of this keyboard/mouse combo. I use it every day, and have had it about a month. The mouse is small, fits my hand very nicely. I absolutely love the separate numb pad, works perfect for my needs. The keyboard is quiet, and easy to use. I am getting used to not having a cap indicator. What I do not like about the keyboard, in fact I hate it...is the space bar sticking. Some days are much worse than others. I had read many reviews before purchasing this specific item, and I knew there were definitely problems with that. It would be perfect, if only.....",
        "\"While the keyboard and MediaPad are both good, there are still some problems. The MediaPad chews through batteries with no option to turn it off, the whole thing creaks like it's loosely put together, and the mouse had a light, shabby feel, especially compared to my MX Revolution. Also, I've had problems with the bluetooth dongle being dropped and then not recognized by Windows (Both Windows XP and Windows 7). However, these problems are all minor, and only add up to one star being taken off on a few areas.\"",
        "I would love this keyboard except for the spacebar, which sticks very badly. It installed easily-is sleek and comfortable-but is not usable for very long because of this glitch. I'm starting to see more reviews on this spacebar problem-so it looks to be fairly common with this model.",
        "Great devise, good battery life, keypad and mouse work great. Regrets: no way to elevate the keypad as one can do with the keyboard.",
        "This is a very useful keyboard for someone who needs to type but not necessarily need the 10 key pad all the time. It also takes of less desk space when you need to conserve space in your area. Pros - good quality feel, nice keys and media buttons are not enourmous Cons - the 10 key pad's lcd screen displays decimals as commas. Good product to purchase",
        "I love the slim design of this keyboard. I get used to my laptop keyboard at work. Now, at home I can have the same type of keyboard on a full size version. The detachable number pad is also great.",
        "I had to replace this after a few months because it began to act up and not type a key when depressed. The replacement does the same thing on the space bar ocassionally. I would not buy this item again. It is a clean design and looks nice. But I would prefer one that actually worked 100% of the time.",
        "I used the Cordless and the Blue Tooth Cordless. Both connect easily and have sensitive and accurate response. The mouse works well on any surface: the couch, my leg, etc. I like the 2 piece keyboard. I use the number pad and mouse alone with the Laptop a lot.",
        "The mouse doesn't track well on my oak tabletop. Problem with the number pad once in a while. It fills in fields as though a key were stuck (though the problem seems electrical, not mechanical) and I have to reboot the computer. Other than that, it's a good package. I like the functionality. The price was right.",
        "This has been an outstanding device. It is light and compact, nice touch on the keyboard and good mouse control. Set up was extremely simple.",
        "This is a must have for any laptop user. The keyboard and mouse work great, but I really love the num pad. And the fact that it doubles as a simple calculator with a clock and temp read-out...genius. I would absolutely recommend this product to anyone that uses a laptop.",
        "I'm disapointed in the keyboard. It doesn't always recongnize a key when I push it. I'm having to re-key alot! Also sometimes it will display the letter I'm entering multiple times across the screen.",
        "If you want a wireless keyboard that is light and has the feel of a laptop but the spacing of a normal sized keyboard then look no further.",
        "i love it. yet i dont. the only problem is the spacebar. which doesnt seem to respond when tapped, which in turn makes me look like a headless chicken when im typing really fast. yougetwhatimsaying?",
        "Keep your old keyboard and mouse handy. The diNovo works about 80% of the time. When it works its nice but you will have to switch to your old keyboard sometimes in mid document",
        "The KVM was one of the best things to happen to me in my computing life. However, my KVM (a Belkin Soho 4 port switch) has PS/2 inputs for keyboard and mouse. Most USB keyboard and mouse devices work fine through the KVM, but this wireless device does not. You know, I could really care less about wireless, and I don't need a new mouse (I use a trackball). I feel like I'm being railroaded when I have to pay for wireless and a mouse to get a nice keyboard. The least they could do is include a wire interface that you could plug in if the wireless configuration fails."
    ]
}