{
    "entity": "Keyboard & Mouse Combos",
    "text": [
        "I've had this since 2009. The mouse stopped working in 2012, but I had dropped it a few times. The battery life of the mouse was about 2 weeks. The keyboard still works fine, and the battery life of the keyboard is really good (typically 6 months with 4 hours of use every day). The bluetooth adapter is a Microsoft hardware, and the drivers lack any support for audio devices. You can only use the bluetooth adapter for the keyboard and mouse. A good deal if you only want to use the keyboard and mouse with the provided bluetooth adapter. The bluetooth keyboard and mouse did work with my Android 4 tablet. Windows 7 64-bit.",
        "I bought this keyboard and mouse combo for one reason - to sit back in a comfortable chair and operate a PC connected to my 42\" LCD TV. For this purpose the system works brilliantly. It is light weight and much more responsive that the last bluetooth keyboard and mouse I purchased. The mouse is so responsive I can use it on the arm of my chair. Stylistically, the keyboard is so low profile that it is barely visible when sitting on a flat surface. However, this is NOT a production keyboard. Key travel is minimal, function and certain other keys are touch senstive and there is no numerical keypad. So don't expect to spend a lot of time typing",
        "This purchase was for my parents' MediaCenter and my main two requirements were range: over ten feet; and easy enough to use for non-experts. PROS: -excellent range for the price (30+ feet) -easy to set up and use, only the 'WIN' key is a bit confusing -includes recharging cradle for mouse -Completely compatible with Windows MediaCenter 2005 CONS: -significant lag from first keypress or mouse movement after power-on or waking from sleep -batteries seem to run down much faster if you don't use the switches to turn off the devices -odd escape key and function keys",
        "I really liked this keyboard/mouse set up. Switched it out for the Microsoft natural keyboard and a wired mouse because I couldn't get the wireless to work with my KVM. Let my brother put it to good use and it is still going strong. Never had any of the issues with disconnecting I've read from others. Maybe I just got lucky.",
        "Mainly bought this for my living room Vista HTPC. They don't have anything better than this out there (discounting the 8000 model). Pros: Mousepad and buttons on the keyboard, small form factor, responsive, great reception (Bluetooth), decent mouse, special-purpose keys for Vista and for multimedia Cons: Wished the mousepad was bigger, no Forward key, the usb dongle is locked with the specific keyboard and mouse pair When, o when, will they make a Bluetooth keyboard with a trackball built in it ? Anyways, till then, this will be the next best thing.",
        "Could just be /my/ mouse, but it's been flaky since day 1. Would work for awhile then sometimes just randomly die. I'd retry it the next day and it would work, go figure. Now it seems to have died for good and I'm calling Msft for support. I hope they take care of it. This stupid thing is only 5 months old! Oh, the keyboard is nice though, sleek and light and although there's a minute lag due to the Btooth, it's pretty useful. I prefer the raised keys but overall the kybd is pretty good. So, 4 stars for keyboard, 1 for the mouse, = 3 stars.",
        "This might be an OK keyboard for home media use, where you use it very little... granted I don't know how you would use a mouse in a situation like that though. But as a daily keyboard, this just doesn't cut it. It has a very awkward feel to it. The slight curve on the keyboard isn't ergonomic at all and there is no elevation change as you would expect from an ergonomic keyboard... so what you get is the worst of both worlds... people who want ergonomics won't get it and people who can't stand ergonomic keyboards won't like it either. I really have no clue who Microsoft's target audience was for this product.",
        "This key board was a birthday gift from the wifey. It works great and I love the low profile keys. Its just like a laptop key set. Only cons are the lack of a number pad, the drivers suck and caused me disconnects until I stopped using them, and the touch sensitive functions keys are way too sensitve when you get near them and are awkward to use because they are tiny. Great keyboard to sit on your lap while on the couch!",
        "Love them. These thing are durable! They are constantly being dropped and tossed around in my house, and other then the cosmetic cracks and ding which are to be expected in my house... they still work well after about 3 years. Battery life is pretty good too, and I use rechargeable so it ain't no thing.",
        "This is a product I have had and used for over three years. I expected for a better version to come out, yet Microsoft seems to have quit making these useful products. Now that my old one has begun to die I find this one and it is great!",
        "I had a Logitech and had nothing but trouble. This is the perfect alternative. It is trouble free. It stays put and does not slide around on the desk. It take up very little space. When I shut down my computer I had to play with my logitech keyboard because my computer would not recognize it. I used logitech support 23 times. Microsoft has made a great keyboard!",
        "No longer supported by Microsoft, if you find it let me know, and I will fix my review.",
        "Recently, I have been having a lot of problems with my wrists from all of the work I have been doing on the computer for school. After just two days with this product, the pain is gone. The keyboard is super light and compact, which is perfect, because I have a small desk. All in all, this is a great buy. I would highly recommend it. Plus, it even looks cool.",
        "Best Bluetooth wireless keyboard for entertainment center as well for desktop/laptop.",
        "This was by far one of the best keyboards Microsoft has ever made, but it is really too bad it has always cost a fortune. I still use 2 of these to this day for media center computers.",
        "I liked this keyboard and I hated this keyboard but the bottom line was that the number key lock did not work correctly. It has a great feel and great media buttons. The mouse is also good but could use some more buttons.",
        "This product is awesome! I took it out of the box and had it set up in 10 minutes max. The touch pad is a little small for any mouse heavy activities but great for selecting what movie you want to watch and it fits in a lap with no problems. I highly recommend this product especially for any one with HTPC.",
        "it takes a while to get used to. it does not have a number pad, which is okay with me as i hardly ever used one. but the keys are shifted over a litte to the right so it throws your typing fingers off. Other than that its okay.",
        "We made the switch to a wireless keyboard a few years ago. We started having alot of problems with our first one and decided we needed to replace it. This time we upgraded to the bluetooth keyboard and wireless mouse. It is nice to be able to put the mouse on the \"docking station\" and keep it charged when not using it. so far no problems.",
        "Keyboard works great. No problem with connectivity. The accompanying mouse is quite large. Although, you cant beat the rechargability of the mouse.",
        "I love this product. It give me an extended range that I need. The design is nice and both item work well. I am use to having the number key on the side, if this feature can be added, it would get 5 stars.",
        "Bluetooth keyboard and mouse with touchpad on keyboard. Takes getting used to but once you have used it for a few days, it's great. Very good for use in your lap in addition to desk. For those numbers people, note there is no numeric keypad.",
        "My husband and I have differing experiences with this keyboard. I mostly like it - very sensitive and once you learn how it responds best is pretty good. My husband finds it difficult and is unhappy with the range at which it is useful.",
        "I selected this keyboard for simple fact it was the smallest or most streamline I could find. I try to reduce clutter as much as possible in my work space so this fits the bill. I never use number pad so I don't miss it. After about a month it is performing well and I have no regrets. I would purchase again if it was stolen or destroyed.",
        "Returned, did not feel right. Company was alright to deal with, but the product was expensive and not what I expected. Can't be specific, but if you type a lot and try this you'll know what I mean.",
        "Didn't work well for me or on my system. There is a big learning curve here also, very annoying trying to type and getting it wrong which I've never had happen with any keyboard. Don't recommend this one. :(",
        "An OK product, kind of pricey. Seems like it lags when you type, but frees up cords.",
        "For the most part, this is a great keyboard. The only problem is that it does not have the \"tabs\" to lift the keyboard into an angled position like almost all keyboards have.",
        "It's a great product. I'm very happy because has easy of use and battery long life.",
        "Very nice keyboard. Easy to install and use. Bluetooth has a great range",
        "The item pictured was exactly what I needed and was familiar with. However, I didn't receive the item pictured. I received something different that is worthless to me. Another 65.00 down the drain. Careful what you buy on Amazon evidently. Hopefully the trash collector can use this heap of garbage."
    ]
}