{
    "entity": "Sandwich Makers & Panini Presses",
    "text": [
        "I bought this a year and 2 months ago and the bottom cover that covers the electrical wires just melted and fell off. Could have been a fire hazard Very disappointed. Pictures attached",
        "I would give this a four star, I made 2 grilled cheese sandwiches and a pizza sandwich and all three were very good. I cannot give it a 5 star because the heat is slightly uneven as seen in the photos, but they tasted good all the same! I would recommend getting this product based on my one time use, will post an update again after a few more tries to make sure it continues working well.",
        "I am not one to write reviews, unless it matters. I 2as so disappointed in this sandwich maker. It is so incredibly shallow, that you can literally only fit a tiny amount of ingredients. For example, I made pizza pockets. In one triangle sandwich, you can fit a tsp of sauce, a Tbls of cheese, and 2 pepperoni. Even then, it is tough to get the thing closed, and when you do....oh the mess. And then the clean up. Nightmare. Headed on to getting a panini press.",
        "I bought this sandwich maker for my nephew who is 9 years old. He loves it. He’s very picky when it comes to food so this gift would allow him to eat what he likes and try new things. A little FYI for everyone in case you didn’t know. Did you know you can make eggs and pancakes in a sandwich maker? My youngest use to make it in there when he was a kid and it tasted good to be honest the eggs and pancakes weren’t dry. I just got tired of eating them every weekend. Lol",
        "Cheap plastic broke (see picture) on my second use. Literally my second time using this product. Buyer beware.",
        "Quick & Easy. Makes the BEST grilled sandwiches. Light, easy to store and perfect sandwiches come out every time. We used it for guests the other day and they could not believe that I produced sandwiches for all 4 of us in a matter of a few minutes. They raved about the sandwiches and said they were going to purchase the same Cuisinart Dual-Sandwich Grill. Sandwiches do not stick, and the machine cooks to precision. GREAT BUY---wish I had bought one years ago!!!",
        "This is absolutely the worst product ever manufactured. The indents on the cooking surface are so shallow it is absolutely impossible to make anything in it. Just two slices of bread cannot fit without part of the bread being squeezed out of the machine. Forget grilled cheese, it cannot handle an eighth of a slice without overflowing and making a burned on mess. French toast, no. Grilled cheese, no. Buttered toast, no. This unit has absolutely no purpose. Buy something else, this is worthless.",
        "If you buy factory sliced bread, thin deli sliced meat and cheese this might work for you - it does do a good job of toasting. However if you are like Scooby or I and prefer real chunks of meat and like to stack fillings there is no allowance for this. I had a sandwich maker with a spring loaded rear hinge to adjust height for bigger sandwiches but can not find it again. Nonetheless for $20 it might be worth trying this one, but this is the second Cuisinart sandwich toaster that has failed me now",
        "My favorite sandwich maker! My childhood one (that my family got from Walmart) died and I needed a replacement. I was so happy to find the exactly same one here and I love it! PS make a \"pizza sandwich\" with this. Just put tomato sauce and shredded cheese on any type of bread and cook it in this sandwich maker. This was my childhood go-to since it was fast and delicious. I can still taste the nostalgia no matter how many times I eat it as an adult!",
        "I would give this sandwich grill/press a minus 10 stars if possible. Turned my sandwich into a flat mess one piece of cheese, squished bread ended up with a yucky disaster not even edible. If your interested in having a nice grilled cheese sandwich you won't get it with this thing. I will be returning it Asap",
        "Well it's a great idea. But I tried to make something more than a PB&j or grilled cheese...don't do it! Tried to put just some tomatoes on my grilled cheese and got cheese and juice all over. So I spent 30 minutes cleaning and tried agian a few days later. This time a pastrami with a little bit of swiss. Don't do it. Juices and cheese everywhere. So now it site in the cupboard. It's nice. It's silver. Maybe I will get risky again one day and try it. But if I do it will only be for toast. And I have a toaster so....",
        "I bought this in the hopes that I'll curb some of my take out spending. It's been working thus far! So far, I've made grilled cheese, tuna melt, and an omelet. It does quite well for a quick and easy meal. It's very easy to clean -- simply wipe down with a damp cloth! As other mentioned, you'll want to use standard slices of bread only. Large slice will not fit into this unit. Also, the heating is slightly uneven, but does not greatly impact sandwich quality. That is why I'm taking a star off. Outside of that, great value and would recommend.",
        "Great product, great price. This type is the best, clamshell - where you lock it in - it helps to form a closed edge crust and keep the filling from coming out. Tips You don't need to spray down the plates when making a sandwich Don't put any butter/spread out the outside of the bread Out of the box and already in use. French toasties Sandwiches in the morning!",
        "We use to have one of these when I was a kid living back in the UK. I didn't even realize they were a thing in the US until I stumbled across it on Amazon. Absolutely delicious pockets of grilled cheese goodness! Downside is you can't remove the plates for cleaning so it's a little hard to clean if you have an overspill. For the price though it does the job great!",
        "The well to hold the sandwich is not really deep enough, therefore, it causes the food to ooze out of the sides and creates a mess. I really had to press down when making pizza sandwiches, which didn't contain anything more than sauce, a couple of pieces of pepperoni and very small amount of cheese. The bread is a regular size slice.Tried again with ham and cheese. 1 slice of each, same problem. My old one (not this brand) worked far better. Had to throw it out after almost 20 years of use. I'd recommend looking at other brands.",
        "Its very convinient and fast for making last minute sandwiches. Very easy to clean and use. It gives green light on perfect time when the sandwiches are done.",
        "Every single time cheese comes out and makes a huge mess. I didn't have such a problem with my old one. I tried different bread, different cheese. I tried everything to prevent it, but every time the same. I hate it and going to return it😐 Also it too small!! Most of the bread is too big for this grill",
        "This was to replace our last sandwich machine which was more powerful than this one - 850 watts compared to 700 - even so I couldn't really tell the difference in speed. It is a nice machine, cleans easily and I like the ability to wrap the cord around the cord storage in the base. It also has a 3 year warranty which is nice. The booklet that comes with it has different sandwich recipes as well as an omelet and fruit tart recipes.",
        "People who gave it more than one star. How can you be okay with this peace of ... ??? It should never be in production! This is ridiculous! It took me 30 minutes to clean all the mess it leaves after one sandwich and I was able to clean only 80% of it. The rest is unreachable. Yet, they say it's easy to clean, just wipe it! Really??? Design has tons of flaws. When cheese melts it gets outs of it and spreads all over the sandwich maker and gets into every hole possible even the spiral spring. All over plastic parts and underneath the sandwich maker.",
        "I should have read previous reviews more closely. This sandwich maker is very small. I purchased the smallest bread I could find and it was still too big. But beyond that, it is a cleaning nightmare. I used two slices of individually wrapped cheese slices for a sandwich and it was everywhere, including in the back that is almost impossible to clean properly. I did like the slim style, so I stored on my countertop vertically, it feel down on it's side and the cord holder completely broke apart and now not only is there no cord holder, it has no stand. I tossed it in the trash. Very disappointing.",
        "This sandwich maker works great! It brings back memories from childhood. My kids love it when we make the pizza version of the grilled cheese the sandwich maker. It heats up fast after plugging in and only takes a few minutes until they're done.",
        "Probably the worst sandwich toaster you could buy. Anything of this design steer well clear of. Set your sights on something around $45 minimum. It gets clogged with food and burns and smells really bad from the third sandwich onwards. You can't take it apart to clean it. I tried. Everything is designed for quick manufacture. Probably costs $5 to make.",
        "This sandwich maker is ok, considering the cheap price (it doesn't seem that you can get a good branded sandwich maker these days, they are all sandwich presses). The main gripe I would have with it is that unless you are only doing a toasted cheese sandwich, it will be too thick to close the lid properly (even a cheese sandwich is too thick and you have to hold the handles together for a while.",
        "I used to love these sandwich presses as a kid and decided to buy one! Reminiscing of childhood. Great quality product",
        "The old-fashioned sandwich makers from decades ago worked so much better. I bought this one especially for the brand, so I was hugely disappointed the way cheese melted and ran everywhere, making it utterly impossible to clean.",
        "This toastie maker is vastly inferior to the Sunbeam Big Fill that I had the pleasure of using until recently. It takes way longer to crisp. It's too small to easily fit hand-cut bread, closing it is impossible for minutes even with pretty simple fillings, and contents often spill far and wide. You can do better!",
        "Ok its nothing more than ordinary touster. So i give compliment for being standard. On the other hand, it says it suppose to be deep so I assumed that the tousts could be more filled. But that's not true. its just the standard depth. So far didn't damage though. which is a big plus :D",
        "Will take you 30 min to see any kids of black on the bread, if you want to make 2 toasts then you will have to cut the bread almost to half because the size is super small. Can’t lock the toaster no matter what.",
        "I have had this jaffle maker for a while, I do use it a lot, however, please be aware that the coating on the inside is not very good, it has pealed away and it's time for me to replace this with a new one. I grew up with these so I know this should be able to handle my needs. Other's I've had previously were much better quality, and performed for much longer. Also they were better quality. I shouldn't already be needing to replace this. I will try a different brand now to see if it will meet my needs. I think it is cheaply manufactured. Aside from that Jaffle makers are totally brilliant!",
        "Works fine while grilling but has no controls to regulate. You plug it in and it just starts to heat. Even though it has auto on and off heating you need to unplug it in order to shut the machine off or it would just go on and off. Also, be careful while dealing with cheese as it melts outside of the grill tray and fills the gaps and crevasses close to the fold. It’s very hard to clean then.",
        "I have one and bought this non-stick grill grill for my grandson. I like how easy it is to use. My only complaint is that it is hard to clean into the crevices around the edges of the grill.",
        "I just got the machine and on my first use, the handle broke while I was closing the lid to make a french toast. I don't know if the material used is not strong enough and I am very unhappy and disappointed. Aside from this disappointing experience, the equipment is easy to use and clean, also it gets pretty hot quickly.",
        "Eh, the hollows for the sandwich really should be a bit deeper so you can add more than one topping and the edges higher that would actually seal the edges. It is more of a glorified grilled cheese sandwich maker. A frying pan works better. It might be cool to make kids sandwiches on but an adult sandwich, no dice.",
        "I owned a sandwich maker years ago and the machine was heavy and very clearly nonstick. This machine claims to be nonstick in a cheap plastic exterior. Not only did I have to trim down the bread to fit it into the maker, I had to scrape some bread off the nonstick plate. On the areas where cheese \"oozed\" out (plastic), I had to use a knife to scrape off the melted cheese. Since the plates are not removable (so you cannot get the appliance wet) and they aren't really nonstick.. the whole thing was a pain to clean. Huge disappointment. Fortunately, Amazon was kind enough to accept this return since it would have been trashed otherwise.",
        "This thing is a huge hassle to clean(from a light minimal overage). It also dries out the bread so much it makes it almost crumbly/chalky!!Companies these days have no pride!!",
        "I had one of these as a kid and I used to love how my sandwiches would come out I just had to find one of these again. It came on time and with no damages or issues. I’ve already used it a bunch of times and its worked like a charm everytime. Cleaning it may take a bit especially if you use alot of cheese (like i did) but other then that its great!! I love it!!",
        "This is a nice product. I have used and abused 2 previous sandwich grills. This one is very nice and made by Cuisinart. It will be great!",
        "After owning 2 proctor slilex this thing is by far a better build . The locking mechanism is way more durable for a thicker sandwich. The only person peeve I have is that it doesn't make any noise when switching from red to green . It's a steal for the price .",
        "Love this toastie machine, have put different types of bread and all come out perfect. If you butter both sides of the bread you get a deeper brown toasted colour. I've used cheese, ham tomatoes all without any problem. Going to get another one for the office",
        "Why is flavor a review option?????? Oh well. I love this sandwich squisher thing sooo much I ate sandwiches for 2 weeks straight. Difficult to clean the back if the cheese explodes. The inside is easy to clean with a napkin.",
        "It's not the best product. I could do better with just a pan on the stove. It works well in a pinch though, for something quick & easy. I wouldn't recommend.",
        "I am sure this works great. I had it sent to my granddaughter because she always loved my grilled cheese sandwiches and this is what I used to make them. She was thrilled to get it.",
        "The perfect product to make quick, easy, yummy sandwichs! Very easy to wipe up and clean afterward, along with the fact that it heats up sandwiches in only a few minutes. Very pleased!",
        "Not sure why they thought this would be ok to send, but it’s in terrible condition and it looks like there’s old cheese melted into the product. Out of the box, this is not what anyone should expect to find! Also noticed that even if it didn’t have cheese already melted on all over it, cleaning would be difficult because you can remove the grilling plates. Not to mention the design means melted cheese or something on the back (as shown on the pictures) would be difficult to clean. Returned and would not buy again.",
        "Our first time using. Followed directions. This is a nightmare to clean! We did ham and cheese, one slice each. Cheese oozed out everywhere. In electrical coil wire, melted into crevice between plates and handles. All areas that cannot be cleaned. I am not sure it is hygienic to use with all that old melted cheese. I am thinking it is bound for the dump.",
        "Works great but very hard to wash it. I’m making my kiddos sandwiches with cheese in it. Cheese spills out from edge and it’s impossible to clean it.",
        "Love this so much that I have one in office and one at home :). It works great and makes delicious sandwiches. Easy to use and super affordable.",
        "It does what it's supposed to. but when using cheese, it all leaks out no matter how little I use, it messes all over and is extremely difficult to clean!",
        "I spent months looking for one of these at an affordable price before searching here and finding it quickly. I got not only myself one but my mother who had also been searching for one. My kids make pizza pockets, meat and cheese grilled sandwiches as well as grilled cheese sandwiches. My parents use it for sandwiches and a dessert turnover. We love it and have missed it.",
        "Bought this little gadget to replace the last one that we had for 8 years. Great for grilled cheese sands, as well as fruit tarts for breakfast. So glad that I found it online as nobody carried it where I live. The nonstick surface is great for cleanup. Just wipe with a damp cloth or napkin and your done. Small, economical and worth every penny. Makes two sandwiches at a time creased in half. Looove this sandwich maker.",
        "This is perfect for making the perfect grilled cheese sandwich with crispy edges! It's quick with light control that tells you when it's ready to use (quick) and when the sandwich is done. Quick easy clean up. This is my favorite kitchen item...next to my microwave. Lol.",
        "We ended up returning ours because it’s a little smaller than the one we had previously. It’s doesn’t fit the toast, for that I give 3 stars",
        "This is a very simple Sandwich maker and works just fine. I have been using this for more than 6 months now and do not have any reason to complain. This item worth the price.",
        "Good for a basic grill sandwich. My kids love it. For regular slices only and don't use too much cheese, it melts very well. Easy to clean.",
        "The design leaves much to be desired as the base that support the appliance is plastic and quite fragile. We have had a number of these and nearly each met its fate with the base breaking and then the sandwich maker is no longer stable. the \"3 year warranty\" is a joke in that they charge $10 for handling plus you need to pay shipping. Just bought a Proctor-Silex to replace this as it looks like it is better made and it cost a bit less too",
        "I liked a lot. The only issue its that its really hard to clean because you cant disassembled it. But putting that aside it’s awesome",
        "My kids like “pizza sandwiches” for lunch. We also like putting lunch meat and cheese in there. It works as expected. Fast and easy.",
        "Great little sandwich maker. I had one of these a long time ago ( a different brand and it broke). so I finally got around to buying another one. It is super convenient to make pizza sandwiches and other types really fast for a snack or dinner and pull it out of of a cabinet. stores pretty easily and the cord wraps around the bottom holder. It has been easy to clean and no problems seen with breaking as others have.",
        "I bought one of these early in my marriage. It lasted 20 years! I was very glad to see that it is still being manufactured, and look forward to another decades-long relationship.",
        "The product came with glue pasted in the chamber. And now some update review. Stay away from this product. All cheese flowing out from the back. Its a defective design.",
        "So far, so good...does create some hotspots on the sandwich surface...not always even, but sandwiches turn out good. Looks good on the counter. Nice fit and finish.",
        "This was exactly what I was looking for! A little bit hard to clean but not outside of what I was expecting. One day my husband washed it in the sink with water running 🙄 I thought it wouldn’t work again. I just let it stay for a week or so and it is still working like new.",
        "Very Disappointed. I bought it a year ago and the only good thing I can say is that it arrived on time. From the start I thought it was very light for its size. It heated to fast(bread too crisp and cheese uncooked, and it had a funny smell as well. But I thought I’d give it a chance, perhaps I just had to learn how to use. Second time and it breaks open. Lid from base., cheep plastic!!!",
        "As of right now I love this product and it’s exactly what I wanted. As long as it holds up and lasts a while I will continue to recommend it",
        "I hate this sandwich maker! The grilled cheese sandwich can out like a rock. i had to cut all the crust off the bread to get it to fit. Cheese spilled over the sides and back of the sandwich maker. There is cheese stuck all over the screws in the back of the sandwich maker. i have no idea how I am going to get this thing cleaned. I am so sorry I bought this thing.",
        "I used to have one as a kid (my mom used to make me sandwiches with this), they are definitely more dry than I remember but v great for a quick grilled snack",
        "save your money, I love love love toasties and grew up with something similar. this is nothing like it because the plates are way too small to accommodate two pieces of bread, which is the whole point of this appliance. I threw it out it was that useless",
        "Grew up with a similar toastie maker so was really excited for this. This pushes all the cheese out because the pockets are so small so you are just left with toasted bread and a big mess to clean up. Hard to clean and doesn't even do the job properly. If I could return this I would for the panini style and realise there are no makers of the old style toasted sandwich maker that make em like they used to....",
        "Makes an okay grilled cheese. Difficult to clean to the point we do not want to use it because the cleanup is a challenge.",
        "Returned it because I decided I didn’t need a sandwich maker. Not because of any problem with product.",
        "Not easy to clean but still love it. Bread, slice of cheddar, bacon, turkey, sliver slices of apple, raspberry jelly, bread. You are welcome.",
        "I bought this to replace an older one. This is a great appliance for making grilled sandwiches very easily! I even use it to make pizza foldivers!",
        "Easy way to make a grilled cheese. Butter the plates, add bread, mayo, cheese and some lunch meat! Press down hard for a few moments before putting the clip in place. Wipe clean while still warm. We have used this non-stop for about a month. Very good for the price.",
        "The Dual nonstick electric sandwich maker was great. fast with cooking the sandwich. Giving it a 4 start because its a pain to clean. Its hard to get into the crevices to properly clean. It might harbor alot of dirt and bacteria in the future. Only for short term use",
        "Very difficult to clean. Everything gets stck on the plastic edges. And never comes out. Too small to. Yeah not so good overall",
        "nothing after first use..almost burned my hand..product returned..there no warnings this would happen",
        "Very easy to use does wonders for the kids for quick meals and most definitely cooks very quickly just my kind of home appliance lol",
        "It makes the bread really soggy and what would have been a great sandwich becomes a disaster. I tried it with every type of bread to make it work, but it makes every bread soggy which destroys the taste of bread completely. I wish I would have returned it in time. Do not buy this!",
        "I grew up using these all the time and was excited to try this! This one smelt very burnt plasticy so I am returning. Sad because it does bring back nostalgia!",
        "First time using this. It ’s very easy to use and the sandwiches are really yummy! My daughters love them.",
        "Just 11 months after buying the bottom plate has melted and come out, exposing the electric wires. It is unsafe and hence useless now. It should be replaced but the manufacturer does not respond. Disappointed!",
        "Probably ok if you use thin square bread. I use Arnold bread and it is too hard to close",
        "Product worked as expected, however the design makes it absolutely impossible to clean. I used it to make a grilled cheese sandwich and the cheese melted it seeped inside the sandwich maker itself. There is a tint gap between the plastic casing and the grill tray. I ended up unscrewing the device open in order to clean the cheese off from the inside.",
        "I really like this item, it makes great sandwiches, it lightly toasts the bread so it is never over done or burnt. It fits normal sized bread as expected and the nonstick seems to be durable and it is easy to clean. I would recommend this product.",
        "For me personally, I am disappointed with the very small amount of anything you are able to put in this machine. Once bread goes in, you are really limited to what you can fit inside of it. Should most definitely have deeper wells.",
        "Returned it. Food gets in under plates and onto electrics. Inconsistent cook times for same food.",
        "The first time I used this I made a ham and cheese sandwich. You would think it would be okay since it is a thinner sandwich but no. Everything came out of it and it was so messy. The pockets need to be bigger so you can close it easier and not have your filling spilling out. Also after the sandwich was done the inside was still cold inside!! The cheese wasn't even melted! I have not touched this product since then. What a waste.",
        "got this for my sister and i see her posting the grilled sandwiches on instagram all the time I guess she loved it",
        "Even after greasing both sides, bread sticks and difficult to take out. The plate size also too small as a normal size slice of bread is too big and I have to cut it smaller to fit.",
        "We make a lot of sandwiches; so this sandwich grill is perfect for us. The fact that it makes two sandwiches at once is beyond great! The only drawback is if something accidently spills over, it's not all that easy to clean up. Other than that, it's a perfect addition to our cooking utensils.",
        "Makes great jaffles (toasted pocket sandwiches). We've had ours for over 2 years and it still works great. It's easy to clean with a damp cloth. It holds all sizes of sliced bread. The larger slices do hang over but it still works fine if you lower the preheated iron slowly and let the bread soften til it is easier to close. It doesn't hold much more than a slice of cheese and some thinly-sliced veggies, but we usually just use cheese anyway. I'd love to see Cuisinart make another one without the divider line in the middle.",
        "The pockets are advertised as deep, but are very shallow. This was the most important feature to me.",
        "I would give this a 3 star, I made 2 grilled cheese sandwiches and all were good with the cheese out side. The issue is with the Tried to put just some tomatoes on my grilled cheese and got cheese and juice all over. The cheese melts out every direction and down onto the counter.",
        "I remember these working better. Unfortunately I've tried many times and still can't perfect a good simple grilled cheese. The bread never toasts enough even after two or three times through a cycle. Not a complete waste but might be worth spending a little more on a better one.",
        "Works great The bread doesn't spill out for me as some have noted The sandwiches are crisp (could be crisper if you ask me, just leave it longer after the green light comes on) It's evenly cooked It's VERY fast Doesn't stick, easy to clean CONs: No on/off switch, you need to plug it in/out Feels a 'little' flimsy, like I need to handle it carefully or the hinge may break (not broken just feels like it)",
        "I bought this for my husband because he always talked about the \"snackwich\" machine he used as a kid. He has already used it many times and find that it toasts the sandwiches very evenly. It is easy to store. It is generally easy to clean, although there is a slight ridge that a sponge might be needed for if any food escapes the bread during heating.",
        "This grilled cheese is awesome. I use it almost every night. My only problem with this is that I cannot clean it well since the plates (nonstick plates) does not come out.",
        "Makes delicious melted cheese sandwiches and omelets. It's quick, and super easy to use and non-stick!",
        "This one good Good product at this price I am making sandwich cheese sandwich is perfect make it perfectly",
        "I didn't love the first one I had of this but still bought again cut price was pretty good. What happened with first one is that if bread was too thick, the handle cracked while closing. Hope doesn't happen with this one."
    ]
}