{
    "entity": "Sandwich Makers & Panini Presses",
    "text": [
        "Love it. Works great. We bought a much more expensive Breville unit, and were always disappointed with the results. We came to find there was some kind of problem with the Breville thermometers, but Breville refused to support the product even though it was their manufacturing defect. I will NEVER buy Breville again. But the DeLonghi unit is great; looks great, works great, and doesn't completely break the bank. We use ours for Panini's, but you can use it to cook or grill just about anything. Highly recommended!",
        "I bought this unit based on excellent Amazon reviews. Here is what I found out upon using it for about 2 weeks: 1. it has no off switch, and when you plug it in/out of the wall, sparks come flying out of the socket. There is no way to turn this unit off except unplug it, which yields sparks that look very unsafe. The only thing it has is a temperature knob. 2. There is no way to determine the temperature. The readout is \"Low, Medium, High\", but there is no information anywhere on what the actual temperature is, which is necessary to cook stuff. I checked the manual, nothing. 3. It cooks paninis :)",
        "This is my first panini maker but so far turns out to be exactly what I had hoped for. Pros: 1) Solid Construction 2) Nice lock for folded storage. Sits upright in our kitchen cabinet. 3) Nice grill marks (I use olive oil on the outside of the bread.) Cons: 1) As with all these types of small appliances, if someone could invent a removable grill section, it would make it much easier to wash. As is you just have to be careful when washing so as to not flood the sensative areas. 2) I want to eat Panini's every meal. Would give it 5 stars if it would just have removable grills to make it easier to clean.",
        "This is such a handy addition to my kitchen! It makes the perfect panini, and I use it regularly for grilling burgers too. It drains the oil well, which you need to catch in a bowl at the side. It would be better if the grilling plates were detachable for cleaning, but otherwise it's awesome! I like how the grooves are a good distance apart, so they are easy to get a cloth in between when cleaning. And I like the carrying handle and the overall look. Very stylish, and very easy to use.",
        "Cooks well enough but my previous grill was a G. Foreman and the plates were removable on that one. This one does not and it makes it a little tougher to clean. Guess I got spoiled by putting the grill plates in the dishwasher of the George. Overall, not a bad grill and I don't regret buying it.",
        "This is my second one. I needed to change just because of the surface scratches after 5 years of heavily usage. It is a great grill. I use it every morning for breakfast",
        "I had purchased another panini press that had multiple functions. I returned it because a part was broken when it arrived. What I wanted was simply a panini press of good quality. This is it. It heats quickly and evenly. It is easy to wipe clean. You can't go wrong with is model.",
        "I was hosting a book club for Dreaming in Cuban and naturally I wanted to serve a menu which matched. Cuban sandwiches seemed the best idea and this press had the best reviews so I waited and hoped even though it was out of stock. Great decision as it arrived in time and even though I had never used it before, book club went off without a hitch. For days afterwards I pressed every sandwich I ate. I love it and am grateful to all the reviews which convinced me to order this model.",
        "I have enjoyed this product for the price. The heating plates work really well, and they are easy to clean with a wet paper towel. Fairly large cooking area. I dislike that the back spring doesn't flex quite enough to lay flat on a sandwich. Because it angles upwards, the back side of the bread makes better contact with the grill plates and therefore it cooks faster",
        "This unit is built to be used. It has a temperature control and an indicator when done, and a light indicating that the unit is powered up. It made great sandwiches. The grooves are rather deep, but spaced fairly far apart for easy cleaning. After considerable research regarding Panini grills, I am totally pleased. I highly recommend this grill for purchase.",
        "Overall I'm pretty happy with the grill. It heats up super fast and cooks food evenly. My complaint is that it is really hard to clean. The plates don't detach and once the grill is cooled enough to clean it the food is pretty stuck on. My trick is to wet a small towel and when the grill is cooled I put the towel between the plates and shut the lid. It softens the food enough that it can be wiped down more easily.",
        "I couldn't be happier with my new panini maker. It is so easy to use and even easier to clean. I love how stylish looking it is. Sometime you get one of these products and hate to bring it out in front of people because it looks cheap but not this product. Very classy and does an excellent job grilling. The only thing I wish is that the recipe book had more \"classic\" type recipes. These are pretty flashy and require a lot of specialized ingredients but those that I have tried have also been very good.",
        "Really great! We received this panini grill for Christmas and have used it almost every day since for someone in the household. Sandwiches for dinner - now that's a novel concept and super fast as well. You don't need to oil or butter the bread if you are counting calories and the panini are absolutely delicioso! The recipe book is fantastic. The machine works great and will also double as a \"George Foreman\" kind of grill for meat, poultry and fish. Awesome highly recommended A++++++++",
        "I mainly use this to make hash browns with no oil. It works perfectly. Is easy to use. It's pretty easy to clean. I wish a tool was provided that helped clean because with all of the grooves it has if you cooked something oily it would be a struggle",
        "I was very happy with the panini press.... I was very pleased with the quick delivery... The issues with the lack of an on/off switch was really not a problem for me.... The only thing I may have been disappointed with is the low to high temp knob.. There seems to be alot of play when I adjust the setting.... Other than that, the grill works well and it is easy to clean... We will be using this alot this winter... When you've had a long, hard day at work, this is going to make my dinner making venture very simple.... Hot paninis and a mug of steaming soup... Yum.",
        "First panini grill I've owned. My in-laws have one and use it regularly --- that's why I decided to get one (plus the fabulous sale price). So far, I love it. We use it for paninis, grilled veggies or grilled sausages and veggie burgers. I am aware that there are more expensive panini grills out there, but this is highly recommended for first-timers and those not seeking a high-end professional one. This is also a very helpful gadget for those wanting to watch their calories.",
        "My favorite tool for \"quick dinner\" night. This appliance gets a lot of use. Both our boys know how to use this on their own and it offers a great consistent cooking service. Great quality and beautiful product as well. One minor complaint---You cannot turn it off, you have to unplug it. Easy clean up. Of course we use the proper tools and cleaning process.",
        "Works perfectly from sandwich to bacon to steaks! Make sure you use only paper or sponge to clean and never metallic utensils... It does not press the cheese out as some other people said. I have even washed with water and soap and it works great. My kids love it!",
        "It works pretty good, the nonstick is easy to clean (for a panini grill). It's a cheap option that works well without all the bells and such.... my only complaint would be the locking mechanism on it is really cheap....",
        "Great grill. Use for panini peppered turkey & grilled tortilla sandwiches. Sturdy machine. Like previous reviews, the lack of an on/off switch feature was inconvenient, but purchased a switch for the plug and it works well. I bake homemade flatbread, brush on a little butter to the crust, and you get a super sandwich. Trying these out at our little deli/restaurant and it is a hit. Endless recipes to try. Will purchase a second one.",
        "Min - max gradients were too small to read with my old eyes. So I basically guessed. Worked out fine!",
        "I have been very pleased with my panini grill. It has done everything that I have tried to do so far. I even cooked the bacon I used in my panini sandwiches. The only thing I have discovered is that I have better results using thicker sliced bread. I am eager to try some different variations of what we like. I love the locking mechanism that allows me to store it without difficulty.",
        "Very good to heat up easily but this upper press couldn’t parrarell, tiled sandwitch. But no peeling pan easily heat up fast.",
        "This is my second one after the first one lost its non stick abilities after about 6 years of regular use. This works well for a quick hot sandwich for lunch.",
        "Unlike just toasting a sandwich, the panini grill heats the entire sandwich, straight through to the middle. The juices from the meat (if you use meat in your sandwich) are pressed into the bread and flavor the entire sandwich. It's compact enough to fit into a kitchen cabinet, yet large enough to grill a man-sized deliciously satisfying sandwich.",
        "definetly big cooking service, like the fact that it heats evenly. some presses push the sandwich forward and falls apart. this is high enough so that the top grill comes down straight onto the sandwich.",
        "This unit is very easy to use, cleans up easily, heats up quickly, cooks evenly, and has a very solid build quality; however, just one thing missing - an on / off switch. Without that, you have to unplug the unit when you're done using it. A fairly obvious oversight for any appliance. Would have rated it a 5, if it weren't for this issue.",
        "Bought this a couple years ago. It still works well and looks good. My only reservation is that because it isn't a flat heating surface, it can be a bit of a nuisance to clean. Even then, it isn't that bad. I use a scrubbing brush when it is still warm and some kitchen towels make light work of it. Just not as quick as it would be if it was completely flat.",
        "I have purchased three of this identical model. My own in my primary household, one for our ski house and one for my daughter in college. It really is the best and makes a sandwich a meal. I like this brand so much I bought their toaster which is now the trophy on my kitchen counter.",
        "I love this grill! I mainly bought it to grill chicken breast and its amazing how good it is. It's easy to use and it cooks everything to perfection. The only thing I can complaint about is the cleaning part. It takes me a while to clean it after I cook chicken on it because the grill compartments don't come off but other than that, this thin is PERFECT! :)",
        "This is a great grill..I've been making some wonderful panini sandwiches, nothing fancy, but very tasty. I bought it too for cooking hamburgers and steak and chicken. So far I've cooked steaks on it and hamurgers. Didn't try the chicken yet. Its very solid and doesn't take up too much room as it stands on end. I would recommend this grill.",
        "A lil big, but it's very efficient and we love it!",
        "A must for a perfectly grilled sandwhich. Temperature controls work very well, for the best grilled vegetables and meats.",
        "We bought this Panini grill for our daughter and family and decided to try ourselves. The unit worked great. We loved it - so we bought a second unit for our daughter's family Christmas. They opened it and were excited to use it. It would not heat up. Even on high it was only warm to the touch. Amazon has worked with us very nicely and has given us return labels for the defective unit and shipped a new unit to our kids for their Christmas. Hopefully the new one will work as well as the first one.",
        "I bought this press because I didn't want to spend alot of money, I have so many other kitchen appliances that I only use occasionally. Most presses are $100. or more, this one is a name brand and under $50. The things I do not like about it are the plates are not detachable so you always have grill marks. If using a softer bread, like plain white, to make a grilled cheese, it sort of really presses it without much pressure. It also gets very hot on most of the outside surfaces, so user must be extra careful when using.",
        "Great grill! Second one that I buy. My first one went out after more than 10 years of use.",
        "We've used this many times and its never let us down. Works great!!!",
        "I don't know about this purchase ... it was supposed to be new, but arrived looking scratched and used. Will give it a try in the next couple days ... hopefully it will work as promised.",
        "It cooks great, but the stop to hold it up broke the second use. Just makes it a little dangerous to use, but still cooks.",
        "I've always been impressed with De'Longhi products and this is no exception. It takes little time to achieve full heat, is easy to clean, and stores away without too much trouble.",
        "I am not sure if I read any bad reviews on this item. If there are or were any posted the writers must surely have received the wrong grill. This is a really fine piece of kitchen equipment, super for the quick hit and run lunch time needs, perfect for the weekend need to get in and get back to the pool or deck. We really took our time reviewing other machines, this one is really well made. Heavy enough to keep pressure on the top of the sandwich while cooking, easy to cleanup as long as you follow the directions and use a touch of PAM, Canola, or Olive Oil. We are extremely pleased with our machine.",
        "I looked at all the Amazon reviews and made my decision to purchase this Panini Maker. For cost, features, convenience of clean up, I found it excellent (not to mention free shipping and quick delivery). I wouldn't hesitate to recommed this appliance to family and friends.",
        "I love this grill. I like the way it looks, cooks, plus it is easy to clean. The fact that it doesn't have an on/off switch is not problematic; I think it's safer that De Longhi designed the grill that way. I've bought several since my original purchase for friends!",
        "I had this grill in Europe and loved it so much I bought the same one in the USA. It works great for regular toasted bread , toasted sandwiches, and also grilling meats, fish and other foods. So easy to clean. We use it every day - great value for money.",
        "Bought one for myself my two kids loved it got them each one for Christmas only one I found with temperature control",
        "only problem is it makes such great sandwiches that i eat too many. works just as it should, stores away easily. highly recommend",
        "Great grill .We have one for 10 years . Bought one for my cousin",
        "I love it I just ordered another one for a friend to give her for Xmas I didn't buy the Teflon finish and I'm so glad I didn't the one I got has like a stone finish it's beautiful it won't scratch and it wipes clean with a sponge no soap or anything a child could wipe it clean. and the price from amazon is amazing thank you amazon. hazel",
        "Great grill!!!! Recommended by a friend who's had their grip for over 5 yrs. Makes dinner time easy! Clean up can be a little tough which is the only negative.",
        "I bought this hoping we would use it and my wife grills everything in it. No fancy features it just works.",
        "Makes wonderful pressed sandwiches but be prepared because it weights a ton.",
        "Love this Paninni Grill variable temp control and adjustable hinge make this grill a winner. I and my family use it all the time now. Only caution is that outside can get hot. I highly recommend this unit",
        "Maintains temperature once heated which is so important for a panini grill. Use it for everything!",
        "We had one previously, so when we needed a replacement, we purchased the same panini press. Very happy purchase and it too gets daily use.",
        "Great buy, easy to clean. I bought this to replace my old foreman grill. It does th job. We make patties on it or grill shrimp. Has a fat collector,",
        "We order the DeLonghi CGH800-U Retro Panini Grill after using one that my folks owned. Great quality, well built appliance. I would recommend this unit to anyone shopping for a Panini grill.",
        "We got this at a very reasonable price. It works the way it supposed to and we are pleased with all it can do.",
        "I bought it two days ago and already cannot do without it. Can cook fish, chicken,sandwiches, burgers....anything...its fast and delicious. I do a lot of research before i purchase anything and for its price, its the best in the market.",
        "Grills perfect panini, sturdy. Though the grill plates aren't removable nevertheless. They're easy to clean.even cooking and simple to operate, great value for money",
        "I got this for my parents. They are old-fashioned and didn't want it. The weren't going to use it so I got it back and started using it. It works great and makes great sandwiches.",
        "The grill really works great! Heats up in a minute and easy to clean Ha! Like it",
        "i use it often and am very satisfied with it",
        "This was the perfect gift for my father in law. He uses it everyday (and i make sure to use it everytime i visit, too). They even use it to make warm salads. Works great, and the paninis are great.",
        "My whole family likes to use this grill. Looks nice, good weight. Would recomend this product. Makes great sandwiches. Easy to store...even heating..",
        "Love my DeLonghi. We've been using it for other food items in addition to Paninis. Because it toasts bread so well, we threw away our bread toaster -- no need for a toaster any more. The bread comes out very thing and crispy-- Bacon also comes out nice and crispy. I recommended it to a friend who also ordered it from Amazon and she is delighted with it. Amazon beat Macy's price by almost $20 and I paid no shipping or tax -- whoopee!.",
        "What an amazing panini maker. Doesn't take long to get used to--other than not pressing down on it--it does it all itself! Wow!",
        "This is a fabulous product and makes a great gift. It comes with a recipe book yet you can invent your own . Yummy.",
        "Used it the day it arrived! I made my first panini then I grilled a few thin chicken breasts. My family loved the taste. The only downside was cleaning it as mentioned by many. Not that much of a big deal but you do need many towels to clean it depending on what you cooked.",
        "I bought it as a gift for my grandaughter.It looked really nice and heavy made.They like to make Panini sandwiches so they are happy with it.",
        "The knob got deformed after a week or two. It doesn't really have an effect on the heat amount anyways..",
        "This has been great. Super paninis and no problems at all. I like it so much I have already purhased another one for my daughter.",
        "I have had this product for less than 60 days and it broke",
        "Sandwiches made delicious. Can make three at once! Easy to clean as well!",
        "A great product. Large enough to make two good sized sandwiches at once. Works just as advertised. We tend to fill our sandwiches to the hilt so cook times for us need to be extended. At midpoint setting, we cook our sandwiches between five and eight minutes. Outside of sandwich is just nicely toasted; not too dark. Easy to clean!",
        "So far so good. This gets a lot of use and has held up well.",
        "Excellent grill and panini press, does a good job, no complaints !",
        "THIS PRESS WORKS JUST LIKE ADVERTISED...I LOVE IT! STURDY AND CLEANS SO EASY!!!!",
        "Bought this as a family gift. Nobody likes it. Nobody wants to use it again after trying it once. Difficult to clean. They need plates that are removable, otherwise don't even consider buying it. Removable plates will make a world of difference. Also found that the locking latch was misaligned, poor design.",
        "It doesn't generate enough heat and I can hardly even get any grill marks. It does look good though.",
        "Fantastic product. Love to cook with this sandwich press. Been enjoying this for some time now. Thanks. Continue to Love Amazon.com shopping.",
        "I thought it had removeable plates. I ordered the wrong one. I found the easiest way to clean it was to put wet paper towels on it while it is warm and let the steam loosen the crud. Then I take a wooden spoon to scrub with paper towels and clean it while hot. I do not use soap, just water. I will get one with removable plates for my Christmas present.",
        "We fell in love with Italian cooking during a trip last fall. We've enjoyed experimenting with new recipes. Thus far we've liked each of the sandwiches we have put together. The recipe book furnnished is complete. The machine is well made but definitely not an \"on the counter\" piece.",
        "I bought this as a birthday gift for my 12-year old son who is a blossoming chef. He loves it! It is easy-to-use, seems safe and straightforward, and makes great panini sandwiches!",
        "It's attractive but that's about it. I've used it about 8 times since I received it as a Christmas gift and have been cleaning it as instructed, only using damp paper towels, and the nonstick finish is wearing off already. I also don't like seeing sparks at the outlet every time I unplug it.",
        "I like it so convenient and easy to clean. Everything taste so much better.",
        "I absolutely love this panini press! Its cheap but durable and its also doesn't take up too much space in the kitchen.",
        "I am happy with my purchase and my husband loves the way the meats taste as it hold the juices making it moist! So far no complaints...........enjoying it so far!",
        "I could not be happier with this product. I've used it for vegetables, sandwich and my favorite good sized chicken breasts which cook in 6 minutes. It heats up fast and is easy to clean.",
        "We recently moved, and this was one of our first purchases once in the new house. This gadget saved my sanity because the difference between a typical sandwich and a panini is like night and day. A great purchase for the money!",
        "hard to clean grill cooking surface does not come apart for cleaning no timer? dont buy one keep looking for something else",
        "Item all over ok. Material kind of cheap. Display is different than in the Manuel shown. Not very good insulated. Works fine.",
        "I bought this for my wife and she loves it. It is easy to use and produces excellent sandwiches. This product would receive 5 stars if the heating surfaces were easily removed to clean.",
        "Worked good for about a month and then the non-stick surface began to wear off. Even burgers stick to it now. Do not recommend.",
        "I just purchased this grill for my wife for Christmas and wish I hadn't. I had read all the reviews an thought this was the best choice on the market, but due to some flaws it was not. The Good: The grill itself is good looking. The Bad: The controls were cheesy plastic. I could have lived with this, but the grill would not heat up enough to grill the pannini, which it is supposed to do. Luke warm is the best it could do. Perhaps it is defective, either way I am returning this grill.",
        "Awesome product, makes the best paninis and it comes with a wonderful recipe book! The heat control knob is a little bit loose but it doesn't effect performance. Great buy!",
        "Heats up fast and heats evenly! Great buy!! Lever to adjust height is a little sticky but no complaints at all.",
        "The grill takes up alot of space on your counter. The teflon grill has some small surface scratches but I don't think it will hurt the surface much. It does heat the sandwhich all the way through. It will make any panini maker happy!",
        "We bought this unit and tried it and it never got hot enough to grill a cheese sandwich. Coming from Italy, it may be made for 220 volts. 110 does not cut it. Half an hour and it never got hot enough. We returned ours.",
        "Very hard teflon coating. Even temperature. Easy to clean. Easy to use. Its comes with a panini recipe books.",
        "Gave this as a gift and she loved it. She's always making paninis and they are delish! Great quality. I read many reviews before buying...well worth every penny!"
    ]
}