{
    "entity": "Die Grinders",
    "text": [
        "I thought this was going to be a good die grinder but any time I want to change out a tool (wire wheel or flap disc or carbide grinding bi) the chuck fights me the whole way. It's not very fun dreading having to change out the bit. Yes I loosen the tightening nut when trying to change out the bit.",
        "It did not state that it did not come with the wrenches to be able to use it. Disappointed that now I will have to wait even longer to get the work done with it. I would not recommend this product.",
        "I've used this for quite a few cleanup uses with various 2 inch sanding and cleanup pads. Lots of power! Good feel in hand. I love this tool. I do oil it. Only owned about a month, and has maybe 4 days use on it. I recommend based on performance. Time will tell on longevity.",
        "Decent tool, well made, ergonomic design. Reasonably priced, imo. Only complaint: No trigger lock-out, which is a nice safety feature.",
        "Very good tool, I even bought a second one. Lots of use. Used 8 hours straight. No problems, just make sure you oil them often.",
        "The head keeps coming loose spinning the head around. I don't know if that's a common problem but I know I hate it.",
        "you can't beat it for the price. I use it daily and its held up to some abuse in a shop setting",
        "Originally had problems with it but campbell has good customer service and replaced it. Speed control is nice and easy, works great!",
        "Great size, with enough power to get the job done. We'll be buying more.",
        "Ease of use. Hand held comfort. Does the job well",
        "Very good product, and shipping was fast. I do wish more accessories came, but good a product.",
        "Good control,collet does not tighten down securely to hold some tools.",
        "I use from time to time, great product and great price",
        "Speed control is smooth, and overall feel is great. Happy with this for less than 35bucks!",
        "It came apart in the first 2 minutes of use. I'm a proffetional grinder and all arround finisher. So I know my tools. Put back together. But should not have too.",
        "worked very well. Light but easy to control for speed and angle. Used it to grind off the head of a stripped bolt and worked great. very good buy",
        "It is constantly coming apart. Pain it the butt and hard to get anything done when you are repairing it all the time.",
        "After maybe 5 times using about 10 minutes each time head keeps coming apart .Would not buy again",
        "High quality! Gets the job done for fine detail work in tight spaces",
        "Works great and is really nice for getting in the small places also.Alot of them are just to large on the ends and this is easy to hold also. Price is right also.",
        "The tool works great! Only downfall is the plastic housing. The threads strip out over a while. I suggest using a swivel fitting the help.",
        "Within 20 minutes of starting to use the grinder the collet loosened and made the tool inoperable I repaired the problem once and 20 minutes later it was inoperable again. After having it for one hour I packaged it up and promptly returned it. I hope the one i received but I got a Chicago Pneumatic that works fine. I would not recommend this grinder in any way, shape, or form! It DIDN\"T (Get Stuff Done) at all.",
        "I actually love the trigger and the fact that there is no pain in the ass lock built-in to it that I have to take out again, been using these type of grinders every day for 35+ years about time they finally made them without the stupid flip lock."
    ]
}