{
    "entity": "Die Grinders",
    "text": [
        "Only issues are with the seller not the product. The grinder works great and I am happy over all. The product description said mad in America so that's why I chose this product. When I received the product I found out it was not. If I had known It was made in Taiwan I would have saved the $30 plus and just purchased one from harbor freight. My last grinder from there lasted 3 years and cost $20ish bucks not on sale.",
        "This little die grinder has some serious cajones - far more that you would expect for the size. When I opened the box I was concerned the small form factor would mean no power, but my use on a brake job removed all concern. Where my IR edge series grinder would bog down, this little CP just powers thru. The small size is great for automotive use. It is a little bit noisier than my IR but still very tolerable. Love this CP - it's my new go-to die grinder!",
        "This is my second one of these. The last one had tens of thousands of hours on it. I Like the small size for getting into tight spots in bowls, and impellers. I work with Dudes' that run with Dotcos, and other $500 plus tools, and I rate these things a lot by the amount of vibration. I expect and require anything I take to the shop to earn its keep, it's going to get used. If your doing hours of handwork with any of these air tools the smoothness of the thing when running determines how much hand fatigue you will get. These by this manufacturer for the money are the smoothest ones I have found.",
        "Needed to replace my bargain 1/4 inch air after twenty five years of use. Decided on the CP875 after reading reviews and could not be happier with my purchase. I typically use the die grinder to clean up a gasket surface areas, clean a cast iron pans or surface prep before painting. With my use and a little maintenance occasionally I expect this tool to preform with no issues. I like the size and overall feel of the tool compared to my older tool this tool has much less vibration. Don’t care for the safety device on the handle, takes a little patience in the beginning but becomes second nature pretty quickly.",
        "This is a very useful tool for getting into tight areas. It's pretty low powered and uses different wrenches than its larger cousin but still does the job. As others have noted, it does appear to leak a bit of oil around the air vents which may lead to surface contamination if used for finish work. For me, not a problem as I use a die grinder for roughing, not finish work.",
        "I am an Auto Tech and I was replacing a Matco one that I have had for 25 years and has been abused. this one is the same size and feels heaver , more solid, than the Matco one. I have only used it once to clean up some rotors and it is fairly quite. It is not rear exhaust as some of the descriptions suggest and was the main reason I purchased this but after using it I think it should last 25 years or more.",
        "Replaced a cheapo central pneumatic angle die grinder with this one. For the price it can't be beat. Very small but definitely power dense. Has plenty of power to run a 2\" roloc wheel or carbide bur bit. I run it off of a 135 psi gas powered compressor on my service truck and it does the job. I started buying Chicago pneumatic tools after I discovered a lot of the matco tools were re-badged CP.",
        "I love this tool. It is powerful, easy to use and has totally out performed my expectations. I used it with the 2 inch Roloc quick change discs to clean the machined surfaces and remove old gasket material while changing the Intake manifold gaskets on GM 5.7L engine. It did a fantastic job and made the job much easier. I wish I would have bought these years ago.",
        "Decided to stop replacing my harbor freight one every month and try this one out. Been using it every day for a year straight and not a single problem and is a lot more quiet than the harbor freight one.",
        "I have this same exact one at work for about two years now, and it’s held up. So when my cheap Harbor Freight blew up, I said I’m getting this one for home, to use out in the shop. I’m a fan of most Ingersoll Rand air tools, but this one is comparable to the IR in my book.",
        "Way better than harbor freight, and as good as my Ingersoll rand straight grinder. Chicago pneumatic air tools are good tools. The build quality resembles that of my IR straight grinder. Good power, as long as you got a compressor that can produce the CFM's tools like this needs.",
        "What else is there to say. I've been using this 90 grinder everyday for years to clean up welds, and debur parts and it still works nearly as good as when I got it. Runs super quiet without sacrificing power. Great tool.",
        "At my job i use die grinders all day. I have had numerous brands this is by far the best! It has plenty of tourqe and never bogs down like the cheap die grinders. Am definitely buying a second one.",
        "This die grinder couldn't be better. I use it with 2\" sanding disks and scotch brite pads to prep surfaces for welding, de-burr and soften edges, and clean rusty surfaces for paint. Despite the small size of this tool it has plenty of power for all of that. I have even run the wire knot end brush without running out of power.",
        "Chicago Pneumatic is a quality mid-range brand. This die grinder runs tight- low vibration and low noise. Handle is a good size. I have applied a decent side load while using a burr tool and unlike other 90 degree angle grinders, head did not come loose. I am required to do what it takes to get the job done and this tool keeps up. Only complaint is when I am using a 2 inch disk arbor to deburr parts, the head exhaust blows right at the hand- Cold on the hand.",
        "Great little die grinder. Very solid, good fit and lots of power. Good purchase.",
        "Great compact die grinder. I have one at work and at home. Does produce some minor vibration but that is to be expected in this price range. If either of the two eventually fail I wouldn't hesitate to buy another.",
        "I've only used it a time or two so far it works good just make sure you oil it often and it should work good",
        "This is a wonderful grinder at a great price. If I could only have 1 pneumatic took this would be it. It's quiet, strong, light, durable. Awesome tool",
        "Very nice. Small but packed with a punch. I’ve used the grinders on thin steel for preparation for welding. Works really well with roloc abrasives.",
        "Everything was well packed and the tool is really nice looking when you open the box. After using it for the week I now find myself wanting to use it more. It the right size for my hand and it is comfortable to hold. After working all day and my hands get sore using this at the end of the day is not a bother. I will probably look at what other tools Chicago Pneumatic has and but more from them.",
        "Good weight balance, needs a lot of air to operate at full capacity but other then that it’s a nice tool to have",
        "Very nicely built compact grinder. Feels solid and has some heft. Has a good amount of power to it, especially for this small size. I reach for it over my HF ones whenever I need to do something tougher like using a cut-off wheel.",
        "This is the best one I've ever used. Small and powerful. You will never go wrong with it, it's small size, I was able to get into a drum break on a machine without removing it. Works perfect.",
        "For a little tool this thing is a beast for sanding.",
        "Professional grade. Good handling. I have 2 of those , it's all about maintenance. Keep it lubricated and it will last for a while.",
        "Bought it at a good price and it has held up as good or if not better then the name brands, snap on, Marco, mac, ir",
        "Really can't say anything bad about it. For around $50 it's a steal. Had it just for a couple of months so really can't say much about durability but knowing CP it'll be a life time. If you need a small grinder - get this one or an IR. The only down side is very slight vibration to the handle when spinning at full throttle but not a lot at all. Other then that - great tool.",
        "Much quieter and smaller than the Husky grinder it replaced. It vents exhaust to the front and is very well made. Included two different collets but I almost exclusively use the 1/4\" collet for everything.",
        "Awesome little thing I love it. Use it on light and heavy duty stuff.",
        "Great die grinder, I like the smaller size I can fit it into tight spaces. I work in a tool and die shop, works good for polishing and prepping odd shaped pieces because of the size. Accidentally ran a line full of rust and still worked fine.",
        "I've used the crap out of it and it seems built to last especially for such a small unit despite the fact that CP has sold out to China like almost everyone else. It has started slinging grease from the head, though my shop air pressure might have been too high at one point and blew the seal.",
        "Good for the price. Had one break/stop working after 2 years of regular use and just ordered another.",
        "As long as you dont have small children around your airtools, Tear out the trigger safety. Way more user friendly. Extremely happy with product.",
        "I gave a 4 out of 5 only because of the fact the air oil you put in it at first will keep out the air side but after it does that at first . It's all good just make sure to give it a run before you use it so you aren't oiling up all your parts more .",
        "Smaller than expected. Pretty quiet, great price. I have had my fair share of cheap ones and expensive ones. I feel this one is just as good as $100+ ones I have had in past. So far holding up, I think I will get the same life as the $100 ones as well.",
        "This little grinder feels great in the hand. It's compact and fits in the hand quite nicely but is suprizingly hefty for it's size. There's no shakes or rattles even at high speeds and all the threads are buttery smooth. Definitely reccomend this grinder.",
        "Super light and works good has enough power for cleaning off old gaskets and etc...",
        "Nice pneumatic die grinder. Small in size but powerful. It’s what I expect from Chicago Pneumatic. Great tool!",
        "Haven't used it yet. But love the size! Smallest angle grinder I have ever owned. Update once I have a chance to use it.",
        "Damn good tool!!! If it ever break's I'm buying Another one just like it.",
        "Damn good tool!! If it ever break's I'm buying another one just like it.",
        "wist theres a option to adjust rotation of spin. right handed, spins in a direction where debris & spark fly right at your face",
        "the first one i got had missing red paint. Amazon exchanged it no problem. I has been working good and strong for a few years.",
        "I'm a heavy duty mechanic and I've used this die grinder almost daily for 3 years in the shop. It's been used and abused since I bought it and continues take it all without a problem. Between my IR, Mac and Snap on die grinders, this one is my go-to choice every time while also being by far the cheapest.",
        "Finally found a die grinder that has enough power to run a 4\" cut off wheel. Very impressed!",
        "I finally use it works great in very tight places and the rpm is awesome.",
        "This air grinder came in the mail just as advertised. So far it works great. I have only used it as a hobby type of tool. I run it off of my 60 gallon single stage compressor and it doesn't seem to take as much air as I thought it would. I have other tools that take two to three times as much air to keep up with. It's very small, palm sized, but works just the way I was expecting.",
        "Haven't used it yet but looks and feels like its quality made. Nice finish to it update once used",
        "ok here goes, this thing got great reviews is the reason i orderd it, when it arrived i thought what the heck??? this thing is smaller than my hand lol , i was thinking very seriously about sending it right back but then i thought , what do i have to lose by trying it? So glad i did, i fell in love with this lil thing lol, great tool, great price!",
        "I have use this often cutting steel, mostly under 1/8 inch. Good quality. I will buy another some day.",
        "Product works great for for a die grinder. Though vibrates alot and has excessive safety features that you just don't need.",
        "I have gone through 2 of these but I an not complaining. They are very good quality for the money. It works very well I think I went through 1000 2 inch sand disc before I had trouble. I an border line abusing it and it held up well.",
        "In 2008 I ordered a die grinder and they sent me a angle grinder. I kept it and have been using it daily for 7 years. I should add that I work in a forging plant and that grinder has been used and abused and still works. I have been doing this kind of work for over 25 years and these are the best little grinders that I have used.",
        "Pretty nice tool. Gets cold in the hand quickly when used in cool environment. It would be nice to have rubber or plastic grip. I love the size, and power!",
        "Works great! Used harbor freight ones most of shop life. Moved onto this and wished I had done it sooner. Very smooth.",
        "Man this thing is strong! I've had a few different ones over the last few years and this one definitely spins the fastest! Just remember to oil it so it'll last a lot longer",
        "I use mine every day for cutting/grinding/wire wheel. It's an unbelievable value. All the power you could need and butter smooth.",
        "You can really tell the difference in quality between these and central pneumatic",
        "I have used Chicago Pneumatic tools since 1982. They are among the best quality made. The tools are higher priced than some of their competition, but, cheaper when longevity is considered.",
        "Very good tool. More torque than cheap ones. Comes with wrenches that are a step above the cheap flat ones that come with $15 grinders.",
        "As a professional automotive technician I have to say that for the price this die grinder is great. Although time will tell, way less expensive than what is offered on a tool truck.",
        "After my IR became unusable due to the locking nut getting stripped out after 14 years. I decided to go with a CP and have used it a few times and can say I honestly couldn't tell the difference from my higher priced IR . I feel it will last a long time .",
        "I've used this thing very lightly since I purchased it. Has run flawlessly. I've used 3 cutting wheels worth of use on it and works great. Defiantly suggest buying it.",
        "Don't let the size fool you, this little die grinder can hold its own.",
        "I use it all the time in the motor shop at work. Just add oil and you are good to go!",
        "I use everyday with a 2\" sanding disc , works great and fast",
        "Works great for aircraft sheet metal work. Nice and small, it allows you to gwt into tight places without issue.",
        "I use this little thing to remove paint and bluing off guns. Also, I have recently used it to take off paint and rust from an old snap on tool box for restoration. This thing works great and is small enough to fit in tight areas. In addition, the safety switch is extremely useful to not turn on if you lay the tool down for a second. Most def worth my money!",
        "So far been very good and high powered. Uses a ton of air but don't matter to me at my work. Think i will be using this for the next 10 years. I oil it every use.",
        "This is a great die grinder! All I buy for my work",
        "This Chicago Pneumatic cut off tool is a perfect size for numerous applications in my shop. It's always useful. Thanks",
        "Great for its size ans price. It will last near forever.",
        "This is the second CP tool I have recently purchased. The first was a air operated mini sawsall. Quality rating IMHO is excellent. The tool is compact, and powerful. I purchased this to clean IRS piviot points on my current project. With the Scotch Roloc pads, I was able to get a smooth clean surface. As another rater indicated I need to purchase the proper grease fitting adapter to grease the gears.",
        "Another high quality item from Chicago Pneumatic. I've never been disappointed.",
        "I did not like that it needed such a large air compressor to actually use... my 6 gallon was definitely not enough.",
        "I purchased this grinder for one purpose and that was to grind the bolts off my exhaust manifold, which worked well. Now I use it for numerous other projects in the garage. I'm glad I bought it.",
        "This thing cranks, more power than you expect, very compact",
        "Has enough power for any use. Used it for small wire wheel or grinding for welds. Way better than any of brand cheap version of this tool. CP makes good stuff.",
        "This thing works great and has handled everything I've used it for as of yet. Quite strong compared to some others that I've used and seems to be quite well made. I would certainly recommend this to anyone for medium duty work which is all it will ever see from me. The governer is not the easiest to manipulate consistently and is the only negative I can find, but the paddle is easy to use to vary motor speed so it's not too bad. Great tool for the price!",
        "So far, it is proving the right tool for our project(s).",
        "Used it a lot for two years now, no problems",
        "It's small, like honey I shrunk the kids. Good quality, good for tight spaces.",
        "I have been a journeyman toolmaker for a many years and had to replace the die grinder I bought as an apprentice. This new one is a significant improvement.",
        "Nice durable tool. Safety latch lock gets a stiff after using the tool for several hours. Otherwise, this is a good value.",
        "Great tool, quality construction and materials. Solid Aluminum body and aluminum parts. Tool should last a lifetime under normal use and maintenance",
        "Tool quit working within 2 mo. of limited use. Contacted C- P not much help in getting tool repaired or replaced. Said could send to one of their authorized repair locations along with proof of purchase.",
        "Excellent grinder performs just as it should and it's very powerful. I repair curb damage on rims and this grinder is nice and compact and more than powerful enough to grind all the curb damage down on an entire rim.",
        "I bought this too to sand down my metal deck stairs. Works great. I can't believe the power that comes out of a tool that is so small.",
        "Very good product. The tools Chicago pneumatic are the best Thank you!",
        "I am a long time full time Deburr operator at an Aerospace manufacturing company and have been using this tool as well as the CP straight motor version of this too and I use these two tools very aggressively on very hard metals for several hours a day now for several months for 4 days a week. I put the oil in it at the beginning of every work day and do my job and it still works as good today as it did several months ago. It also has alot of speed and torque which is what I need when I'm blending metal surfaces of titanium, 15-5 stainless. and inconel",
        "Gotta say, I was a little skeptical about a product from Chicago. However, I am more than pleasantly surprised at the build quality, speed and looks. Very nice Die-Grinder to be sure. I originally picked this because it's red and since I work in a motorcycle shop, can be easily located. Once I used this thing the only way I could describe it is the fit and finish are very good and I would buy Chicago tools again for sure.",
        "This is your standard angle die grinder. Well built but loud. This is replacing one that has seen daily use for better than 10 years.",
        "This is a great little grinder! I bought one six months ago, and I liked it so much I bought another.",
        "Price and quality seems to be at least on a par with others. It uses a considerable amount of air to operate it continuously, as others I have owned.",
        "Not sure why they painted it red but whatever still works great with 2\" Roloc pads.",
        "Works very well. Has front air discharge didn't realize when purchased prefer rear air discharge but beats the crap out of H.F.Tools and H.Depot air tools. Would buy again.",
        "Cannot go wrong with \"Chicago Pnuematic\" Tools I have used them for years! They last and the quality is obviuos!",
        "Bought it to work on an exhaust manifold and it got the job done lickity split. Easy to control with it's small size.",
        "This thing is holding up well, although it was a bit pricey."
    ]
}