{
    "entity": "Skillets",
    "text": [
        "The copper cladding is an extremely light coat, and when you cook the copper streaks and the stainless appears underneath. This happened after only ONE use of a pan when I followed the directions to the letter. Very disappointed in the quality of these pots. My parents had copper pots that worked and looked gorgeous for 40 + years - clearly these aren't made the same way.",
        "These look pretty out of the package, but I had to use a TON of oil to keep things from sticking, and after only ONE use, the copper was tarnished and appeared to be rubbing off. See my photo for a comparison of a pan after one use next to an unused one. Super difficult to clean because things stick so easily. I am sending back. Very disappointed in the quality. I have other Calphalon pots and pans that I’ve had for years with no issues, they are just getting worn out so I wanted some new ones. These are NOT WORTH THE MONEY!",
        "I've always wanted copper kitchenware - but did not think I was up to it. So I finally took the plunge with this relatively affordable set -- I mean, for the French stuff you can mortgage your house for just a pan and a pot! - and so far so good. Food heats quickly and cooks well, and the quality of the items makes me treat them \"mindfully\" - washing them by hand, heating them up slowly etc. which definitely improves the results of my cooking, as well.",
        "You will need to have copper cleaner to clean the bottom of the pans. They are super gorgeous and durable but you can tout them in the dish washer and you need copper cleaner to keep them looking new.",
        "They look great out of the box, no spots on mine, and they seem to work just fine for cooking. However, they are extremely high maintenance and spot incredibly easy. You literally can't leave the exteriors wet at all for longer than a few minutes. I know this is somewhat common for copper cookware but these seems particularly sensitive. After less than a dozen scrubs with a soft sponge and some bar keepers friend, the copper sheen will come back and spots will come off but the copper on the outside of one of the pots is starting to wear away. Totally unacceptable. Will be returning or donating.",
        "Very happy with this set. Heavy than a prior nonstick set of Calphalon that we are replacing. The pots did have spots in them and marks when the box was opened. All of that cleaned right off with the included package of bar keepers friend. Yea the copper changes color after use and when heat is applied. That’s what copper does, but it cleans right up to shiny new with some of the proper cleaner. See before and after photos.",
        "I was very excited for my copper pans, however after the first use and wash the copper color went away. I wanted quality pans, but I also wanted specifically the copper color so I was very disappointed I had to return these.",
        "This set of pots & pans were in horrible condition when opened. They looked like someone had painted on the finish & did a terrible job. We opened them, looked at them, boxed them back up & returned them immediately.",
        "Beautiful out of the package, but they do discolor easily. Good quality and sturdy otherwise.",
        "The color is a bit orange, but also uneven. Like it was sprayed on inconsistently. Some pots had marks that looked like a cigarette butt had burned it. One pot looked like it had been used, the bottom was blackened. Sadly they had to go back. I do not recommend. These were never used, so I can not comment on the cooking features.",
        "It should get zero stars, after ONE use, the copper faded completely off a lot and the color turned to red and pink on the 8 inch pan. This is not “pure” copper as it suggests. It has to be painted.",
        "Do not purchase if you want copper pots...the copper color disapears when used",
        "Fast shipping and a great price. Wonderful product also. They were a gift for my wife and she loves them.",
        "I did not buy them for art pieces as the copper stains after the first use. At first I was frustrated with food sticking even after seasoning the metal. However I found recently that using an Olive Oil spray works great.",
        "These are not what I was hoping for. They are not easy to clean and are not non-stick. I miss my 10 year old pans terribly.",
        "The set is cute but it needs maintenance and I don't always have time for it.",
        "Beautiful and so glad I traded in my old ones.",
        "These are not only the best pans I have ever purchased but possibly the best purchase I have ever made. The quality of the design, look and feel is top class. These distribute heat incredibly well so even cooking is achieved time and time again. I would highly recommend the product and seller to anyone.",
        "The color is very beautiful! This set is a little harder to clean & the outside does not stay the copper color for very long. The pans do keep an even temperature throughout the time you cook.",
        "great, beautiful, read directions prior to use,and you will have a lifetime of enjoyable use.Well worth the money.Home chef and foodie.Judy",
        "Wow! Not only does this set cook phenomenally well on low (propane), it cleans easy and looks beautiful! Even better? The lifetime warranty.",
        "It has the right weight, the right look, it cleans well, and other than knowing to heat the pot or pan first, before you add oil or butter in it, it is easy breezy.",
        "We bought th3m for a gift and she loves them",
        "I *love* these pans. They are gorgeous to look at and the food just slides right out of them as you cook. I haven't had such nice cookware before and I'm really happy I invested in them.",
        "One of the best purchases I've ever made. Love everything about them. My only disappointment is having not bought the sooner.",
        "Discoloration not everyday pots needs keep up with cleaning polish of it but my girlfriend loves it",
        "If I needed a second set I definitely buy them super quality",
        "This is such a beautiful set, great price, quality purchase, I definitely recommend this cookware",
        "Upgrading to these pans from years of just tossing together various sets.. I will say, that these are filling the void which I've been missing for all this time! Granted, there is a bit of a learning curve with these, as they are non-stick.. However, if you're getting these, you already should be knowing what you're getting into! A wonderful set for the price, and jeez, these things heat up, and are move even than anything I've personally had in the past. And, with the tri-layer, copper outside, hanging these really stand out in the kitchen!",
        "Beautiful and well made. Also it's much easier to care for than I first anticipated. Looking forward to adding to the collection.",
        "I bought these as a gift, after my son used them he raved about how well they performed.",
        "After several days of use some blemishes are not coming clean, and take a lot of work to keep up. Not to mention after further inspection have found several flaws from manufacturer.",
        "These products look good but do not function well.. used them a couple times and the copper is already fading and the inside of th pans have stains in them. Not recommending.",
        "Ordered twice both times came with marks all over the pots so mad!",
        "Very pleased. Arrived safe and sound, we really like this set!",
        "I bought this set as used form amazan (confusing name you think?). They claimed it was only open box and actually new. It was not new; the smallest pot had been badly burned on the bottom and the next biggest has been allowed to boil dry. I was not able to remove the marks. Careful with amazan claims",
        "Horrible cookware. I do NOT recommend purchasing these. Everything sticks. They change color after use and washing. They spot on the copper and look horrible.",
        "Do not buy this. The food gets sticky (see picture from a simple attempt of an omelette). No Teflon. The pans get de-colored after a few uses. I tried to send them back and seller ignored me. So upset with Amazon that they can sell this.",
        "So there was a little tarnish? Or whatever it is called on the copper bottom of the pans and pots but it didn’t bother me because I wasn’t buying it for the looks. The pans are lighter than my previous pans which is a plus. Still trying to get the hang of using stainless steel I was using non stick pans previously but easy to clean up and wash and cooks everything more evenly and I don’t have to use as high a heat point. I got them on sale for about $155 so I would say they were value for money for the price I got and I had been eyeing them for awhile and finally pulled the trigger.",
        "These pots and pans are not worth paying extra for. The copper exterior isn't actually copper. It's only a copper finish which deteriorates and looks horrible after just one use. The pots and pans do cook well, but I would have been more satisfied by purchasing the stainless steel pots and pans for the lower price they are sold at. **UPDATE** I love them now. I bought some barkeeper's friend and cleaned them and the discoloration went away and they're all beautifully copper again. No longer regret buying these.",
        "First time using the pans and the copper coating has started to come off from three of the pans. I've been on hold forever with Calphalon. Per their website it looks like I have to mail it in and see what happens. Just a little concerned that the coating is going to come off from the rest of the pans now. All cooking and care instructions were correctly followed.",
        "I recieved package quickly. I had to send back to company because they were discolored. Warranty was immediate and they replaced them quickly. They Cook will and look beautiful! No complaints. Customer service was very helpful.",
        "Love these pans. First off they are beautiful. I had to get used to cooking on stainless because I had cheap non stick pans before. The key was to start at a lower heat. They heat evenly every time. They are easy to maintain as well. Just a sprinkle of Batman’s friend every few weeks with a wet sponge, and they look like new! They are also really pretty with natural patina.",
        "I love this cookware but I've got to learn to cook with it.",
        "I'm thrilled to own this set - the copper is beautiful, the handles feel sturdy and elegant in my hand, and the heat distribution is fantastic. I haven't yet tried these in an oven, but stovetop cooking - even on our old, uneven heat coil stovetop range - is easier than before. I'm not the type who needs my pots and pans looking brand new every day - so I'm not worried at all about discoloration - copper cleaner every 3 months or so will be good enough for me!",
        "Comparing this to the other copper or tri-ply products on the market, this is by far the best bang for your buck. It's heavy and has a good feel, cooks great (gets hot in seconds), and looks great. If you're looking for something flawless though, this probalby won't work for you. Stainless steel on the inside gets scratched pretty easily and the copper on the outside starts to discolor faster than you'd expact. Understanding is you can just use barkeeper or something to restore so not a big problem for me.",
        "This product was a good price and I have only used the pan, but it cooks amazing. I was undecided because of the reviews on here about discoloring. but they clean up nice nothing like the review on here.",
        "Product arrived at a very effecient and timely manner and handled with great care! The cooper really spreads the heat evenly across the pan or pot very well and the handles don't get hot to the touch so you can move them around easily while cooking without the worry of burning yourself. Overall I'm very pleased with this product and would be buying from this brand and company again!",
        "This pot and pan set has it all - attractiveness, function, versatility, and usability!",
        "Look great but they are not induction compatible as the description on Amazon and the manufacturers website says. Will contact the manufacturer and see what is going on.",
        "Act like a chef? This cookware is attractive to look at, heats evenly,makes cooking a pleasure. The different sizes in the set provide the ability to cook whatever you desire",
        "So bummed. Beautiful product but we have an induction stovetop. Amazon says this is induction capable, but it's NOT. I opened it up and immediately noticed it didn't have the symbol that my other Calphalon has. I tried it anyway, hoping but no luck.",
        "Poor, copper is thin, stainless steel showing through in spots. There are burn marks on bottom of pans, looks like they were return by someone and resold. Buyer beware, company nor Amazon will stand behind their products if purchase is more then 30 days, so if buying for holidays you should not buy early. Photo shows pans fresh out of the box.",
        "All the pots came scratched, dented, exposed steel or aluminum.... Exchanged for another set that came in the same exact way... Either the manufacturer has poor Quality assurance or a poor packing department... Getting it refunded....",
        "These were not as nice as I expected for the price. The copper immediately gets water stains and looks dirty after the first use. I expected some discoloration, but not this much. They also are not as heavy duty as our other stainless pans. I got them for my husband's birthday last March, and am disappointed in their quality. I would give them away, if it wasn't for the price we paid. Ugh!"
    ]
}