{
    "entity": "Skillets",
    "text": [
        "Disappointed in level of finish on pan. Scratches on cooking surface, and rim was sharp and had a groove that would trap food. I returned the pan without attempting to season it, and ordered de Buyer, which is much higher quality. It's worth the extra price. The de Buyer arrived with a bees wax covering, which will make seasoning a lot easier than the Matfer Bourgeat I suspect. For me, this is the second time in a row that America's Test Kitchen has struck out on their recommendation of a product.",
        "The 11 7/8” pan has warped twice on me now with very little use. On the recent replacement you can even see lines where the material is evidently different. These must have terrible quality control. When I contacted the manufacturer they refused to look at the pan, insisting that I did something wrong to them and made me go through the dealer I purchased them from to get a replacement. I won’t be buying from them again.",
        "The first pan arrived with significant damage from the factory as the cuts and scratches were under the smooth protective coating of Bees Wax. Returned and exchanged. The second one arrived with similar scratches but was acceptable. \"Bees Wax\" protective coating on my second pan was just about impossible to remove after :30 minutes of hard scrubbing with a synthetic scouring pad, hot water, and mild soap I only had the flat surfaces removed and none of the walls or handle would come off. If I could get the coating off I'm sure it would be great. Oh well will try to return the second one.",
        "Wanted to love this 14 5/8 pan. Arrived with a small rock in the pan. Ever so slight. After putting it on low heat and starting seasoning procedd, this pan looked more like a bowl than a pan. Really disappointed. Goimg back to amazon today. This was rated ad highly recommended by amerivas test kitchen. Makes me question their reviews. I think i will stick with my cast iron pans.",
        "The pan is coated with some kind of plastic substance. I spent an hour trying to get it off and still did not succeed. The amount of Labor in frustration required in this task nullifies in my opinion the benefit of the purchase. The manufacturer needs to think of a better way to protect its pan. It may be easy for them to put on a coating that is nearly impossible to remove but they simply transfer the headache to me. Certainly my time and effort could be utilized elsewhere. I would not buy a product of this nature ever again until such time as the manufacturer can figure out a better way to protect its pans",
        "I was super excited for this pan. It came highly recommended from a close peer. But, the results were underwhelming. After seasoning the pan (2-3 attempts), I still had food getting stuck despite using enough fat for cooking. Heat distribution was weird and maybe that's because I use an induction stove. Pan warped slightly after a month of regular use. My excitement died slowly and I resorted back to my cast iron pans. Maybe another day Carbon Steel, maybe another day. EDIT -- Still sucks despite several attempts at reseasoning. Frustrated big time.",
        "Poor quality control. This pan was warped when I got it. I carefully followed the manufacturer-recommended seasoning process but in doing so, noticed the pan start to spin on the cooktop when it came up to temperature. There's a noticeable wobble on a ceramic cooktop. I'm a cast iron and carbon steel veteran and understand proper care. For example, I never heat pans too rapidly or place a hot pan in cold water. This one just arrived warped. Some quick searches revealed that these pans are infamous for warping. Return started. It's sad because I can see how this would be an amazing pan, were the bottom flat.",
        "First unit warped (i have an electric coil stove) and would spin like a top on my stove. I didn't do anything crazy to it but maybe these are better for gas stoves. Replacement issued by amazon has been fine thus far. I didn't follow the potato peel instructions, simply just rubbed it down with a very thin layer of oil and baked it in the oven for an hour.",
        "After sale customer contact support appears not to exist. NO USE ON A SOLID SURFACE STOVE. Will start sitting flat on the surface - as you use it will spin and burn items in the center as that is the only part spinning on the surface. Maybe it will work well on a campfire - choose something else if you want to use it on an indoor stove. Attempts at contacting matferinc email had absolutely no results. It even acknowledging receiving my letters.",
        "The pan does what it is supposed to, but with a major flaw— the bottom is not flat. Would be fine if I had a gas stove, but I have a smooth glass surface. The pan spins free like it is on ice, and doesn’t heat evenly because there is an air gap between the surface and the pan everywhere else besides the very center. Pretty disappointed given the price.",
        "The manufacturer instructions to season the pan call for sautéing potato skins, oil, and salt to initially season the pan. This does not work, and after a day of trying to heat, oil, and cool the pan even bacon still stuck to it. I have stripped the pan down to bare steel and re-seasoned four times in the past two weeks and it still acts like it's made of Velcro. This pan makes a satisfying clang when thrown in a dumpster. Also, buy a smaller pan. This thing is massive.",
        "The pan arrived with some scratches and scuffs but the pan works well. Food doesn’t stick to it too much once it’s seasoned well and it is pretty easy to clean. Update: I've had this pan for a couple of months now and it's my favorite pan! The pan really is non stick if you season it well and use a reasonable amount of oil or butter. I like that there are no rivets where the handle is attached that the food would get stuck on. Food does not get stuck/snagged on the scratches I mentioned in my first review.",
        "I’m happy with this pan. I bought it as a gift for some friends of mine to try and permanently replace a Teflon pan. After receiving it and washing it, and seasoning it with grapeseed oil and high heat the pan works wonderfully and will probably outlive both my friends and I. I’ve found it worth the price when looking at the costs of replacing Teflon pans after they inevitably wear out. Will get one for myself and will get another one of a larger size. This pan fits two large eggs perfectly and they cook very evenly.",
        "Tried hot water, boiling water, heating with water, scrubbing with steel wool, barkeeper friend, dish soap, finally the oven as described by cooks country, then potato peels, salt and oil. Hours later, I could only get some of the plastic-like coating off. The oven just baked it on. Did not have this problem with de Buyer Mineral B. What a waste. Will throw away and stick with de Buyer. Would return, but waited too long to get around to trying it.",
        "this is it!! 1st off its completely non stick (after seasoning) better than ANY non stick pan I have ever use. It is well made, heats properly/evenly and produces great food. It does not char meat as well as cast iron, but nothing does....this is a close 2nd though. If you are looking a pan, honestly get it....you will most likely have it for a life time and LOVE cooking on it as much as I do",
        "I hate non-stick coated pans, all of them including ceramic. They never last and the coating always chips. I'm big on cast iron but for eggs, hash browns, anything that needs a good sear they are not ideal no matter how well seasoned. These pans are awesome! I can fry an egg and it slides right out - also excellent for fish, pretty much anything you would sauté or pan fry. The 12 5/8\" is big! Bigger than I expected so if you are tight on space go one size down. I also own the 8\" and it's my most-used skillet.",
        "The pan looked great and was very well made...handle was welded on the outside so I imagine clean up of inside pan would be that much easier because of the inside's very smooth surface. It was however, nearly as heavy as my cast iron skillet. So I am returning it. I got this because I was told that the carbon steel pans had all the benefits of cast iron with the added benefit that they were significantly lighter. With it being nearly the same weight I might as well just stick with my old faithful cast iron skillet...it's served me well for years.",
        "Purchased this after reading the test reviews on American Test Kitchen. Original idea was get a nonstick pan for eggs. Don't like coated pans though. So I thought I give this one a try. ATK hit the nail on the head with their review. I followed the cleaning and seasoning instructions and so far nothing has stuck to the pan. Everything just slides right out and wiping with a paper towel is all that is needed for cleaning. Solid construction and the bottom is completely flat with every millimeter in contact with the stove top, glass. The weight is perfect.",
        "This seemed like a well-made product when I received it. Unfortunately, the bottom is not flat. I'm not sure if it came that way, or if it warped when I seasoned it in the oven, because I never tried cooking with it before seasoning it. Either way, it's not really usable on my electric stove because it has a few hot spots where the bottom of the pan touches the burner, and some much cooler spots where there is no contact. I have a carbon steel wok that is made of thinner metal than this pan, two carbon steel skillets, and several aluminum saucepans. None of them have warped on my stove like this pan has.",
        "I ordered 12 in. First of all, it's too heavy for it not to have a second handle. Second, it warped/bowed after first seasoning and one time use. I would keep it if I had a gas stove. After seasoning, my first order of cooking was steak. The steaks turned out great, but the pan bowed. I'm returning it because it can't be used on electric stove top.",
        "Just received my 12\" pan. Hot water to remove the coating? Hah! I put it in the sink with hot water, then added a gallon of boiling water. Using a BBQ grill brush it took an hour to get the coating off. I went thru the effort because I knew what the results would be. Used grape seed oil, warmed up the pan, oiled it, wiped off the excess, then 500 degree oven for 2 hours, cool in oven for 2 hours. Did that 5 times GORGEOUS patina! As good as any non-stick pan.",
        "Yes, sadly, there are some warped and \"rough\" finished skillets out, I can almost guarantee their fakes. Matfer B has an excellent rep. I have been using a high end cast iron skillet for quite awhile and decided to try a carbon steel for various reasons, most of which is LIGHTER. They also have a much much better and CONSISTENT non-stick properties, with zero hotspots... Excellent searing and browning characteristics... See ya cast iron!... I will never go back...",
        "I ended up throwing it out. The bottom was warped when it arrived. As soon as the pan got a little heat the warp grew worse. After having purchased a different carbon steel pan I feel that these pans are too thin.",
        "Admittedly, the coating they put on the pan is extremely difficult to remove. However, after scrubbing with hot boiling water and soap for about an hour I finally managed to get it all off! I seasoned the pan according to the directions that came with it, and I must say that I'm very happy with the pan. First thing I tried after seasoning it was frying two eggs. I sprayed a very small amount of Pam in the pan and the eggs slid around the pan like they were on air! Nothing stuck! Deducted one star for the tedious effort required to remove the protective coating. Very nice pan, otherwise!",
        "I followed instructions for the seasoning. (Potato peel, Salt & oil) I used a gas stove for seasoning. After doing so twice, it passed the egg test but then I realized that the pan was warped. It is getting worse every time I use the pan... I got this pan because this was recommended by America's Test Kitchen on Youtube. (& it is lighter than my cast iron pan) But if I knew the pan would warp like this, I would get it.. I am not even sure if I can/should return this warped pan..",
        "This is a very well constructed pan. It is easy to season with some potato peels and salt. The handle is at an angle so you can put it in the oven, and not have an issue with clearance. However it's a little bit uncomfortable for the weight of the pan, which is slightly less than your typical cast iron pan. I bought a large silicone sleeve to go over the handle which is a nice addition, but not really required. It heats quickly and evenly. It is fast becoming my favorite pan. Overall a great buy.",
        "Compared to similar pans, I like that this one has a welded handle. As a result, the inside of the pan is completely smooth which helps in cleaning. I wish the pan had come with a soft handle, but I purchased an inexpensive after-market silicone handle that takes it from good to great. Though this pan is a little heavy, I think that helps with the heat distribution, which is very good. It heats up quickly and is very responsive to changes in heat. Since you never use soap in carbon steel, it is super easy to clean with just water and a paper towl.",
        "Worked great until 6 days after return date. Egg used to fly across pan, now it sticks hard. I’ve kept the pan seasoned per maker instructions. Would like to give a new pan another chance, but it’s 6 days beyond return date. Huge disappointment— this was an American Test Kitchen recommendation. They should use real home cooks to evaluate their recommended equipment before giving their seal of approval. I guess I can use it as a planter. Can’t cook with it.",
        "This is made in France, so this is a quality item. Pretty good with the egg test: I discovered that it works best with butter, rather than oil. The break-in was difficult: Hard to get the coating off, a lot of work, but eventually got it off so I could properly season. I've even fried steaks with this pan, and it was excellent.",
        "I was unsure about carbon steel pans, but this was highly recommended by America's Test Kitchen, so I thought I would give it a shot. The initial seasoning is of course a project. But once that was done, this became my new favorite pan! It heats-up quickly and evenly, is a good size, and works for everything! I've even made fried eggs and they slid all over the pan. I definitely recommend this! (Edit: Bought this for a friend for a gift and he loves it!)",
        "So far frying potatoes is about the only thing I have fixed in this skillet... But the potatoes have a crunchy, golden brown sear and taste so much better than with a non-stick skillet.. I have done away of all but a couple of my non-sticks.. Only reason I kept them is they are pfoa, ptfe and pfos free and they are new.. Although, I will not ever buy another non stick skillet ... Carbon Steel, cast iron or stainless steel is the way to go in my opinion... Food taste better cooked in these skillets!",
        "This frying pan did not disappoint. To cover all bases I seasoned it twice using two different methods I came across while doing my research. First with grapeseed oil in a 550° F oven, then the potato peel, salt, and oil method on the stove. After doing this eggs slid around in the skillet perfectly, in fact I almost lost one while swirling it in amazement. Tonight I pan seared salmon and it turned out beautiful! I can't wait to buy more carbon steel pans.",
        "I ❤️❤️❤️❤️ This pan. I got it to speed up my breakfast routine. I was using cast iron pan but that was slow to heat. Then I got Teflon and scratched it, so now I have this pan that I love. It heats quickly and evenly. It cleans up nicely with a paper towel. And there are no rivets to attach handle for food to get caught in. It does take about half hour to properly season pan the first time you use it, but now I barely use any oil and my food doesn’t stick to it. I want to get a whole set of them.",
        "Mine seems to warp when heated up but lays flat when cold. Seems more suited for gas-fired stove not glass top like mine",
        "This turned out to be a great pan. Bought the 9\" model. After reading the instructions I thought that removing the protective coating would be difficult. It arrived with a substantial scratch on the cooking surface. Thought that this would be a problem. But after following the directions to remove the wax, and then seasoning it, the scratch was not a problem. I used near-boiling water and mild detergent with a scrub brush. The acid test I gave it was an omelet. Slipped right out of the pan with no problem. Now looking at getting a larger pan to replace my \"non-stick\" one. Worth the investment if one never has to keep replacing non-stick pans every few years.",
        "This is a great crabon steel skillet. But I didn't check the weight.... It's 5lbs. Too heavy for me to work with. Keeping it and will use ocassionally. Update: I would not recommend this pan for the price. It's already warped. I didn't shock the skillet at all. I have kept my beautiful professional stainless steel pans for almost 16 years. none of the three skillet/fry pans have ever warped. Secondly it is hard to season to get it to not stick right but at this point.I don't care I won't be buying another one.",
        "Came recommended from a chef friend of mine after me losing yet another set of non-stick pans to age. Once seasoned this thing has been fantastic, eggs slide right out, nothing sticks, and the few times a accidentally stripped the seasoning it was an easy recovery. Follow their initial seasoning instructions and you'll be fine. For those complaining it discolored after use I recommend stainless pans, these are intended to discolored. Heat distribution as good as my 80 y.o. cast iron at about 1/3 the weight. I will be buying more.",
        "I wish I could like the Matfer but they have serious quality control issues. Both my original order and replacement order showed up with scratches and gouges all over the pan. I've read about quality control issue from the reviews but didn't realize how bad. When I returned the pans I was charged a restocking fee. I ended up getting a De Buyer Mineral B 32cm for a little more but the quality over all was MUCH better, the handle was finished nicely, the wall was thicker and higher, the pan is beewax coated for easier and better seasoning. I'd think twice about buying a Matfer.",
        "I had to know what the hype was about the carbon steel. I measured the largest burner on the stove (14”). Although I have a glass top, not ideal for these pans. I watched a few videos on YouTube and managed to season it well enough. I try to use this pan for everything . It has become non-stick. I am now neglecting my cast iron in favor of this pan. It’s lighter and easier for me to handle. Everyone should try to own at least one. I now have two.",
        "You can find this Matfer carbon steel frypan in any restaurant kitchen in France. Along with Mauviel and deBuyer, these are probably the most common fry pans in France and elsewhere in Europe- and I think they are interchangeable. I switched to carbon steel from cast iron several years ago because the Matfer heats up faster and also doesn't have hot spots like the cast iron, although I still use cast iron for certain things, like cornbread. Do a Google search on 'carbon steel pan' and 'Cook's Illustrated' to see articles and recommendations for carbon steel pans. Matfer has been the standard for a long time.",
        "Love it. Heavier than I expected it to be, but still waaaaay lighter than cast iron. Followed America's Test Kitchen'a recommendation on how to season it (potato peels, salt, oil) and it worked great. Continues to get better, with more use. The handle does get really hot, but one of the silicone handle holder for my cast iron pans works great. Photo shows after seasoning and with a Lodge silicon handle holder on it.",
        "This pan took a seasoning super well. The heft and build quality was superb, better than expected. A serious piece of pro gear. I used the potato peel, onion, salt and oil approach. Between the two seasoning procedures, I had to cook dinner with it. Came out super well. I'm stoked with this new pan which has the best qualities of my cast iron and my wok, without their disadvantages.",
        "About a month ago we ordered 2 sizes of those pans, 14\" and 10\". After we seasoned them according to the direction, using the potato peels, oil, and salt on top of our gas stove (which was a bit challenging but well worth it!) we did the fry egg test. Came out super! :) We've been using those pans almost on daily basis ever since, and did all sorts of cooking. In between times, we also bought 12\" pan. We love them all. They are not light, but way lighter than our cast iron. We are very happy with our purchase and also planning to use them on our grill this summer.",
        "About a month ago we ordered 2 sizes of those pans, 14\" and 10\". After we seasoned them according to the direction, using the potato peels, oil, and salt on top of our gas stove (which was a bit challenging but well worth it!) we did the fry egg test. Came out super! :) We've been using those pans almost on daily basis ever since, and did all sorts of cooking. In between times, we also bought 12\" pan. We love them all. They are not light, but way lighter than our cast iron. We are very happy with our purchase and also planning to use them on our grill this summer.",
        "I have a Lodge 12 inch carbon steel skillet and thought I'd splurge on this 11 inch Matfer. I scrubbed off the coating and assume I got it all. Did the potato skin, oil and salt first season. Then I seasoned it in the oven the same as a cast iron pan (light coat of Crisco, in oven at 420 degrees for an hour, three times). First omelet attached. Pretty good after seasoning Only used a little butter. Surprisingly, the Lodge 12 inch pan is lighter (4 lbs) than the Matfer 11 inch pan (4 lbs, 2 oz).",
        "If you follow the instructions, this pan seasons very well. Like all carbon steel, you have to keep after the seasoning and take care cleaning or cooking acidic foods. However, this is a fairly large pan and for carbon steel, it is quite thick, so it heats relatively slowly and is very heavy to lift and maneuver. The weight probably keeps the heat even, although this is closer to a cast iron skillet than a typical carbon steel wok. When properly maintained, this is still my favorite skillet.",
        "Unfortunately this pan did not perform as I had hoped. I followed cleaning and seasoning instructions in the review article by Cooks Illustrated that highly recommended this item. I found the protective cover could not be removed satisfactorily and to make matters worse the pan warped during this initial use. I have returned the item. Attempts to contact the manufacturer were not succesful.",
        "I scrubbed it clean with detergent, seasoned twice with veg oil. Tested an egg. Works dynamite!! Made an omelette. All I did was wipe the pan clean with a paper towel Just remember, never soak the pan. Water is its enemy. Just wipe out with paper towel immediately after use. Oil again and re-heat to season if necessary. If food really sticks, add 1 or 2 tablespoons of kosher salt and scour with a paper towel to remove residue. Salt will not harm this product. And no detergent. EVER! (Oh, the high angle on the pan handle is for picking the pan up under-handed when flipping an omelette onto the plate. It fulfills its purpose 100%)",
        "I am disappointed, but hopeful. I have seasoned the pan three times based on the Cook's Illustrated magazine which highly recommends this skillet. While parts of the pan season well, it is not uniform and I get more sticking than from a well seasoned cast iron skillet. In the magazine, they stated that following proper seasoning, which is to heat 1/3 cups each oil and salt with the peeling of one or two potatoes for about 10 minutes, it should be fully seasoned. Again, mine is not, but cast iron does not \"season instantly,\" so I'm hopeful this will improve with some age. I may report back in a month or two.",
        "I got this pan based off ATK reviews - but it was really disappointing. The pan was never fully flat, it would probably be fine for a gas cook top but for an induction stove like I have it led to extremely uneven heating. If you're not worried about a perfectly flat pan then it's a great choice, seasons easily, cleans easily, relatively lightweight, oven save, grill safe etc.",
        "This is the one recommended by America's Test Kitchen. It is similar to a cast iron pan in evenly spreading the heat but is lighter weight (5 lbs vs. 8lbs.) Like a cast iron pan it has to be seasoned before using. However, the recommended method was rather messy. It required sauteing oil, salt and potato peels for 15 minutes and doing it twice! The smell lingered in my house for several days. It is called a black steel pan because it will turn a dark color with use over time. (See enclosed photo of the pan after seasoning.)",
        "I've been wanting to get away from nonstick cookware and have been branching out to cast iron and carbon steel. I did a lot of looking around before I settled on this pan, and I am really happy with my choice. Seasoned properly and used correctly, this is every bit as non-stick as any pan on the market, and it just gets better with time. Mine now has a nice dark-brown finish, and I can cook just about anything in it, and it's become my most used pan over the last several months. As a matter of fact, it never leaves my cook top except for a quick cleaning!",
        "The removal of the shipping lacquer was difficult (and I would recommend seeking out some alternatives to scrubbing with hot water to anyone looking to purchase this), and the first seasoning was done as recommended but did not take well, resulting in necessary repeats. I've been using various non-sticks for years, along with cast iron, and have wanted a carbon steel skillet for some time. This one is simply the best, with a smooth interior surface all around, including the joins at the handle, and a deep, sloping shape that makes cooking an easy pleasure. Take the time to prepare the skillet properly, and be rewarded with an heirloom item that will last generations.",
        "I love love these pans. You do need to season them well. Also be sure when you first get these pans to wash them in warm soapy water to scrub them as they have a thick coating on them, then you can season them. We use them all the time and so far nothing sticks and they cook evenly and clean up well. Treat them like your cast iron pans. Oh, when they are seasoned they look \"stained or dirty\" thats the patina, do not scrub this off. These will be pans you can pass on to family just like your cast iron pans.",
        "This thing is a tank...much heavier than I imagined. Seasoned it per manufacturers instruction and performing very well. I almost purchased a less expensive brand but glad I didn't and stuck with my gut feeling. Buy the best and you'll never regret it. After cooking with it for some time I love these pans! Fantastic sear on meat and simple to clean once seasoned correctly.",
        "The pan has worked wonderfully. My wife was skeptical about getting the pan but now the pan is her pan of choice. When seasoning the pan we attempted to follow the potato and salt recommendation but that was a disaster. What worked for us was to clean and dry the pan, then oil the pan and place in the oven at 500 degrees for 2 hours. After the 2 hours. we turned the oven off and let the pan sit in the oven all night to cool. This resulted in a non-stick pan. I would recommend this pan to anyone.",
        "I have had to re-season this pan numerous times. I recently cooked six slices of bacon in the pan on medium heat and the bacon removed the seasoning. I have resurfaced this pan with different grits of sandpaper all the way down to 1000 grit, and still see inclusions in the surface of the steel. I then re seasoned it with grape seed oil in the oven several times and have still had the same issues with the pan and sticking. I have an electric induction cook top and never cook anything in this pan at to high of a heat and still have issues.",
        "There are slice marks in a ring around the bottom. I actually already owned one of these pans for some years now and it does NOT have cut gouges anywhere on the pan. I give up on trying a second, it seems like the company gave up on quality. If there are deep cuts like this on the pan, the bottom can warp, and rust WILL find it's way into any gouge. If you can find one undamaged I recommend it.",
        "Solid pan, a lot lighter than my cast iron. I can flip with the pan again! I couldn't get the non-stick to work with potato skins and oil. A little olive oil/ butter is ok for cooking anyhow. Sometimes I just soak it before cleaning, and you can just use a dish-cloth to clean and dry it. At least I know no chemical non-stick finishes are going into me gut.",
        "I use it every day. I always use a wee bit of fat (butter, lard, or tallow). Since its initial washing, soap has never touched it. Maintenance is dead simple. After use, and while it's still hot, run it under HOT water. Dry with a paper towel and apply a THIN coat of oil inside and out. I wish I needed another one, but I don't. And I doubt I ever will. This will outlive me.",
        "I do not care how many YouTube videos about how to season this bad boy, NONE OF THEM WORK. You'll still need a boatload of oil to fry an egg and it still may stick. Absolutely ridiculous. Don't believe the hype.",
        "We love these pans. This is our second purchase of these pans and as long as you follow the directions for seasoning the pan and cleaning etc. you will not be disappointed; food will not stick. Your also secure in knowing that there are no chemicals getting into your food with steel pans.",
        "If you're looking for a restaurant quality pan that gives you the same cooking results as any top rated restaurant, then look NO FURTHER! You'll be amazed by the quality of this pan & the performance, especially for the price!! You MUST READ the instructions for seasoning the pan & I'd recommend doing it immediately as it starts the nonstick process & DON'T be tempted to wash with soap or let it \"drip dry\" once cleaned!!! These type pans require a little care much like cast iron but sooo worth it!!!",
        "The pan is flat when cool but starts to warp when warmed up. I got this for my wife for her birthday and will be sending it back because it is clearly not compatible with ceramic stoves. It might be good for gas ranges but electric ranges will heat this too quickly in the middle and cause the pan to warp in the middle. I will be buying something more suited for ceramic stovetops.",
        "Sadly it warped a bit not long after I got it, so that now it rocks and too easily spins on my induction plate. I can still use it but it's annoying. Kept it for the bbq.",
        "Great size but... 1. challenging season the skillet. We followed the directions to the letter 2. Also seems like some \"rust\" builds up on the skillet I watched a youtube video to better understand how to season the skillet. I basically had to burn the potato skins/sa;t mixture to stop the rusting. The discoloration/rust seems to have stopped.",
        "This thing is amazing. Great heat distribution, the ability to sear like cast iron, and the benefits of nonstick once it’s seasoned. Cleanup is pretty easy, but obviously not using soap means you might have to work at something that’s stuck on. It’s becoming more nonstick every time I use it so I don’t think that will be an issue for very long. ATK is right this is my new skillet for just about everything.",
        "Came with a deep scratch on the inside that no matter what I do, will not take a season. Also incredibly hard to season. I followed the manufacturers recommendation and seasoning failed. I followed three other methods I found online with slightly better results, but after a use or two and the seasoning would be gone.",
        "I seasoned the pan following their direction and just did not work. Was about to send it back, when I found youtube video by Uncle Scotts Kitchen, that show how to season by baking pan. After I got a good seasoning on it, I was chasing my eggs around the pan, not enough friction to get my spatula under the eggs. Follow USK directions fully and this might be your go-to pan. Search carbon steel pan seasoning.",
        "Its impossible to remove the coating the pan comes with. I tried everything. Scrubbed it with steel wool and bar keepers friend for an hour. Tried blasting it at extreme heat to burn off the coating. I have no idea what the coating is made of, but there is no way to get it off.",
        "Pros: very sturdy, non-stick after seasoning, sears food very well Cons: heavy (but understandable due to the size), warpped The pan developed a slight wrap the 1st time I used it. But since it's a big pan, I can live with that. However, after a few weeks, the warppage was so severe only the center portion of the pan is touching the heating surface. It burns the food in the middle of the pan and the rest of the pan was at much lower temperature. I don't know I got a bad unit or it's the norm.",
        "Since I don't have a gas cook top, I seasoned the pan in my oven. After scrubbing off the protective coating the pan is shipped with, set your oven to about 25 degrees above the smoking point of the type of oil you're gong to use to season the pan. Spread a very light coating of oil over the entire pan, and wipe off any excess. Place it in the oven for about an hour and then allow it to cool. Repeat with a second very light coat of oil and repeat the heating and cooling process. Your pan is now seasoned and ready to use.ready to use .",
        "It's the little things in life. I was inspired by Americas Test Kitchen's review to purchase this skillet and I can't believe how much I have enjoyed using it. The browning ability of this pan and heat responsiveness far surpasses my expensive nonstick skillet. Initially I was dubious about the claim it would be non-stick, but I'll be darned...after seasoning I made pancakes without using oil and they did not stick AT ALL, so far nothing has stuck. Great skillet, especially for the price! It does have a metallic smell which does not transfer to the food, and it is not pretty to look at after seasoning, but I don't care.",
        "These pans are incredible. They hold and reach a good temperature and withstand any level of heat a range or home oven can reach. And so durable. The first one I purchased has lasted years, and I have added other sizes. Reach non-stick finish quickly if you just follow directions of the manufacturer. Not hard to keep the finish, either. Just don't expect scrambled eggs to not stick. But it's easy to clean the pan, just soak for a bit with plain water. And remember to put a thin coat of oil on the pan before storing.",
        "I used a stiff brush with soap and hot water. Put oil salt and potato peels on stove and realized I didn't get any of the coating off. So this morn wiped out oil and washed with a brillo pad two times. Thought I got all manufacturers coating off. Back on stove with salt, oil, and potato peels. Still haven't gotten all the coating off. Pan has yet changed colors. Considering I'm going to get this I will keep going. I'm thinking I'm going to like this pan just need to get that coating off.",
        "I was surprised at how thick this pan is! I’ve used blue/carbon steel pans in many restaurants, and this is easily twice as thick as any I’ve used. Perhaps that means my grandkids will learn to cook on it. I’m seasoning it now, and I can say it definitely takes some time to heat up. I love that there’s no rivets inside the pan. They never fail to build up material and become a nuisance and the scullery never seem to scrub them with much enthusiasm. A river-less interior definitely means a smoother cooking experience. Time will only tell if I prefer the heft if this pan vs the agility of the cheaper carbon steel restaurant style pans.",
        "Once you get it properly seasoned, then this pan works great. Definitely follow all the advice about cleaning it thoroughly when you first get it as it has a sealant to prevent it rusting during shipping. Then you season it with the lightest coat of oil to prevent it getting sticky. I did my several times, but I don't think it was actually necessary I just like the darker color.",
        "Its a beautiful pan as it starts to become seasoned and at a great price. I have a feeling it will just get better and better as the season builds. I cooked two rib eyes, post sous vide, side by side - one in this and one in a lodge cast iron and it seemed like the Mafter got hotter, even though it was on a slightly less powerful burner. I will update this after a few months of seasoning via usage and see how cooking an acidic pasta sauce fares.",
        "Be aware that the bottom of this pan will deform and bow out, if you use it on electric stove-top. At this point my pan's bottom bowed out so much, that I get an incredible hot spot of about a US quarter in diameter where it touches the electric burner, and the rest of the pan's bottom is at less of a temperature. I don't know if this is avoidable. I'm still using the pan, but this makes it harder to use without burning whatever touches the hot spot.",
        "The pan is not as light as I expected. It's lighter than cast iron pan but it is heavier than regular non stick pan. The good news is that the pan meet it's expectation of even heat and nonstick if properly seasoned. They are as good for cooking as advertised. However, if you expect the pan to be as light as nonstick aluminium pan you will be surprised.",
        "This pan warped in the center first time cooking with it. The suggestion from vendor to use potato peels and salt to remove coating did not work. Boiling water in the pan finally loosened the coating for removal. Pan felt heavy duty enough but it warped easily under medium heat - Very Disappointed and hope to return if possible.",
        "This thing is HUGE - my husband bought it and I asked him which cabinet this was going to fit in? He shoved it in our largest one and it wouldn’t close. I told him to get lost with this thing",
        "I love this pan! I seasoned precisely how they instructed and started using my pan right away. I use it for pretty much everything. It certainly is a nonstick pan now. It is normal for this pan to darken, and that’s a good sign that it is becoming even more useful and nonstick. I even cook eggs in this pan. I have also used it for making an apple tart. Enjoy! ****Pics to hopefully answer the question if the handle was welded on. Someone asked if the handle was riveted or welded on. I’m assuming welded.",
        "product arrived damaged. inside base was marred and heavily scrtched. sent a note on seller feedback. have not heard from manufacturer yet. very disappointing. could have bought less expensive brands but i went with america's test kitchen recommendation. waiting to see what they say. unhappy customer!",
        "I had Fissler and Lodge. Both of them didn’t fill my desire. I needed something that filled the void. This one was perfect for me. Lighter than Lodge and heavier than Fissler. Longer handle than Cast Iron, and robust surface and material. Perfect all around on for me☺️",
        "This was to replace a 60 year old cast iron skillet that unexpectedly cracked on me (yes tears were shed). Unfortunately, as many youtube videos demonstrate, these don't work very well on glass topped ranges. Works great on my propane burner but has a definite hotspot on the glass top range. And while it was not dead flat on purchase, definitely spins as it heats up, but I attribute that to the hot spot on the range. In all fairness, it's also true of my Du Beyer so it's not brand specific. I'll keep this as it still has it's uses but doesn't function as optimally on my range as it would on gas.",
        "The size and weight of the pan are excellent. My only problem is with the initial sealing process. Prior to starting the oil, salt and potato peel process, you have to remove the clear protective coating from the pan. I labored with the recommended brush for 30 minutes and I don't think I got it all off, particularly along the curved rim. The resulting seal is incomplete and causes some sticking. I would much rather deal with some initial rust than the very tough protective coating.",
        "This pan is HEAVY! you will have a strong writs if you use it a lot. I may order another one but go for a 10\" next. I seasoned it in the oven and tried the fried egg test and its totally worth the price. All I do for cleaning is rinse and wipe it out. the seasoning gets better with age.",
        "Both ATK and Milk Street have touted this pan, but I notice they never, ever use it on their cooking segments. Maybe that should have told me something. This pan is nothing special as far as heat distribution or even browning. Seasoning it is laborious and the seasoning doesn't last. It may work for a professional chef who cooks with it many times a day, but for the home cook it's an over-hyped piece of equipment. Mine is headed for the trash.",
        "The first pan I bought arrived with deep scratches on the inside bottom of the pan. Returned and just received the replacement and that, too, has scratches on the inside bottom of the pan. I’ll be returning that on as well and will not order this pan again.",
        "It's well known that a carbon steel pan takes some getting used to. You can't use it the way you use a stainless steel or non-stick pan. I'm still on the learning curve, and the pan is still in the process of getting a bit more seasoned with each meal. So far, I am very satisfied. Fried eggs, pancakes, salmon have all turned out very well. I am optimistic; it is just a different way of cooking.",
        "One seasoned it was non stick, warped like a Pringle as soon as I used on glass top stove",
        "I seasoned this pan to a beautiful dark bronze in my gas grill. Works awesome. I only had a problem when I tried to heat a later of oil to the smoke point on my flat top stove as is my practice with cast. It warped. I turned it upside down on a 6x6 block and pounded it flat with a plastic dead blow mallet. 2 minutes. It's not cast so I'm not going to treat it like cast. It will be my daily driver from now on tho!",
        "I have a cast iron pan which this pan is replacing - I needed something a little larger. It works great and takes to seasoning much more easily than did my cast iron pan. It just doesn't look as good after use because the pan becomes discolored.",
        "Terrible quality control. The pan is heavily scratched on the inside and bottom surfaces. The bottom surface looks like this pan was placed on top of a stove or something similar. The edges and handle have heavy machining burrs. For this price point I expect better quality control. I’m returning this immediately.",
        "Took my time..got instruction on seasoning pan from youtube..as I said, TOOK MY TIME! If you buy a quality skillet, you should season it properly. If you are too lazy, buy some crappy teflon! This is my favorite pan in my kitchen. Im gonna buy another in a different size. I recommend this pan for serious foodies. Worth every penny..and worth the effort it took to season it.",
        "Incredible pan. Seasoned per the directions and it has outperformed any nonstick pan I’ve ever used. The pan was a little heavier than I expected, but it’s still maneuverable. I’m using a gas stovetop, but I have heard carbon steel pans can have trouble on induction stoves. I was between this and a Mauviel. I’m glad I went with the Matfer as the lack of rivets is really nice to cook with and makes cleanup easier. I highly recommend this pan and will likely purchase a couple for friends/fam members who are serious chefs.",
        "I love these pans!!! Way better than the old black ones. They cook amazingly well once you cure them. I used coarse salt, potato peels and olive oil and cooked it in the pan until it turned brown. That worked very well. They are kind of heavy but not as heavy as my cast iron skillets.",
        "I've been a cast iron fan for years. This is even better. It does require proper seasoning and particular care in proper cleaning, just like cast, but once done it's better than teflon by far (plus it doesn't wear out). Very well made.",
        "The seasoning was very easy ( I did 3 rounds) and the pan is a dream to use - almost non stick, very easy to clean and heats up fast, no hot spots and keeps the heat very well - from steak to over-easy eggs is very nice. I had other brands but this one feels good in the hand and it feels like it means business - and the price was not bad either"
    ]
}