{
    "entity": "Skillets",
    "text": [
        "First time using this pan and it has an overall a good nonstick surface but it isn't entirely flat. This causes things like eggs to instantly spread to the outside of the pan making it so your food is all right against the edge. Very disappointing.",
        "I have bought this pan for about 5 years based on a review by America's Test Kitchen. They are now substituting a subpar pan. The earlier pans lasted about a year before the non stick part didn't work as well. That was as reported by ATK. Last years pan didn't seem to last as long but I wrote it off. The pan I just received no longer has the metal handle so you can't put it in the oven. It is MUCH lighter than the pan I am replacing. I WOULD NOT RECOMMEND THIS PAN. It is a cheap substitute for the former pan and it's performance",
        "I bought this pan about 4 years ago, and surprisingly, it's still working very well. The finish still mostly nonstick, though not as good as brand new. We haven't been babying the pan either, and the quality seems evident compared to another faberware skillet we purchased around the same time. The faberware pan has a bit of flaking all over the rim of the pan, this t-fal does not. And while the central surface of the faberware isn't peeling, it's much more prone to bonding to foods than the tfal. Overall, it's not perfect, but it's not expensive and has performed better than all my previous pans at higher and lower price points.",
        "Might have been a manufacturing defect, but the first time I used this pan the nonstick coating peeled right off. If you can't preheat a pan to medium heat on a gas stove without the coating flaking off, it's not really a pan now is it? I've heard good things about T-Fal, but my experience has shown me otherwise. I'll find a small nonstick for eggs somewhere else, and stick to cast iron/stainless steel for regular cooking (I can almost nail a classic french omelette every time on a stainless steel pan anyway, so the nonstick might not be in my future).",
        "Could not cook foods without it sticking badly. Used no oil like instructed, used a little oil with fryer eggs and still had them sticking. Tried everything and it’s just not good. I have a T-fal ceramic pan that is outstanding. Stay with ceramics. Avoid Teflon’s.",
        "I just don't see how others are having success using this pan. To me, the hump in the middle makes it useless since everything runs to the sides. Maybe some humps are smaller than others but, if so, that doesn't speak well of manufacturing. One commenter said the hump was a result of running it under cold water but I don't agree. For one, it had the hump right out of the box, and two, I don't think they would make a teflon pan as delicate as that.",
        "This pan warped on the first use. I am returning it for a refund and will spend the money to buy a decent pan. T-fal provides me with another example of you pay for what you get.",
        "Bought these for my 72 yr old mother. After unboxing I noticed the 10 and 12 inch pans were asymmetrical, not perfectly round. They don’t come with lids but round lids from sauce pans won’t fit properly. She already threw out her old pans and refuses to let me return these though. Inner and outer packaging was not damaged and only 2 of the 3 pans were bent.",
        "02/28/2020 -- ORIGINAL REVIEW I'm pretty careful and easy on a frying pan, and use on induction burner. this pan is expensive..i think but it works okay so far. been using about a month now and still seems okay. 05/03/2020 -- UPDATED REVIEW my 12\" cover does not fit it properly,, the skillet is out of round. it cooks food in the center of the pan quickly but not towards the edge and by the time that food is cooked, food in the center is either overcooked or burned. so back to using my old skillet until i buy another. would i purchase again? = absolutely NO would i recommend? = absolutely NO",
        "Love this set. I'm a home chef, I cook and entertain ALOT and I'm very picky about my cookware and accessories. I've got professional grade cookware that I've paid a pretty penny for. Last year, on a whim I purchased a TFal single frying pan for under 25.00 and fell in love with it. It was also a lower grade product than this set. Initially, I purchased this for my niece, but when I saw and felt the quality (handle, material, base) I kept it for myself! : ) It's my day2day go-to pans, even against my All Clads. Jaime Oliver uses these on his PBS cooking show.",
        "For the price, this pan is great. It fulfills my needs. The non stick coating works very well and the pan is exceptionally easy to clean. Haven’t had it very long so I don’t know how long-lasting the coating is. But it seems very hard and durable. Good construction. This has become a workhorse of a pan, especially for eggs. Excellent value and inexpensive enough to replace when/if needed. No non stick pan lasts forever.",
        "I had read all the other reviews of this pan, and wanted to think that the convex cooking surface would relax and 'flatten' when heated up. It does not. I liked everything else about this pan, and wanted it to replace the 10+ years old T-fal Professional pans which are used daily for breakfast. In fact, they had be relegated to the 'donate' box in the garage after this new pan arrived. Used the new one twice to fry eggs with same result - the white of the egg ran down-slope to the lowest outer edge of the cooking surface. So the old pans came back into the house and this new one got returned. The only, but fatal, flaw.",
        "We needed a new pan. My elderly dad tends to fry cook everything on high all of the time. This skillet is holding up so far. It’s easy to clean, looks nice and far better than the one I purchased at a box star because of a tv advertisement I saw . I would buy this product and manufacturer again. Only bad thing I have to say is the red, heat sensing circle in the middle seems useless.",
        "We have been using T- Fal cookware for years with no problems ( and several other T- Cal items) As a retired baker with over 40 years in the trade ,I am very much aware of the need to \" season \" metal cookware such as pans , even if it is \" non stiick \" - perhaps reviewers who have had sticking problems might season or reseason these and be surprised at the result!",
        "I so needed to replace my small fry pan that I use for eggs. After much research, this is the one I choose. I did good! I love this pan. I have used T-fal before, so wasn't real worried. But this pan exceeded my expectations. The heat distribution is comparable to my cast iron - nice and even. It cleans so nicely and easily. Just wiping it with a paper towel has it looking good, ready for the next egg. Although I mostly use plastic or wood in my pan, omelets really need a fork. So far, this pan appears to hold up well to the occasional omelet. Yep! This pan works for me.",
        "We followed use and care instructions very carefully. Nonetheless, the pan warped on first use. Now all oil collects around the edges, leaving the center bare. The first omelet stuck to the pan in places. I Gave three stars for scratch resistance, only because there is no \"not applicable\" option. We use only plastic and wood utensils, so scratching is not an issue. We bought this pan to replace one from Walmart that we had used for years and which gave good service. We will try to return this one and visit Walmart once more.",
        "Bought this specifically to use as an omelette pan. It is fantastic. It heats relatively quickly and evenly. After having seen some popular YouTubers using it I figured it couldn't be terrible and I was happily surprised that it exceeded expectations. Other pans in this price range typically feel cheap. This pan feels sturdy like a steel pan. I have used it roughly 50-60 times and it still performs as new. I even decided to test it against a much more expensive all-clad pan, and it held its own. I haven't really tested how it holds up to abuse bc I use silicone utensils. My only regret is not getting a set because I use it almost everyday.",
        "I only use wooden or soft plastic-like utensils for this pan and store it properly without anything on top of it...and the pan still managed to get scratched. It isn't as non stick as I wanted it to be -- like, I can hardly flip eggs without carefully lifting them off the pan first with a spatula. This pan is still great and more durable than copper pans I've used in the past, but I really caution that the non stick coating isn't as robust as some others I've used.",
        "this is my second Tfal frying pan, the first one had the waffle pattern/carbon fiber look to it, but since that one did not seem to be available, i got this one to replace it after 5 years. Someone indicated that this pan has a convex shape to it. I did notice that it is slightly convex. I doesn't really bother me, but i can see why some don't like it. What i like about this pan is the durability and easy clean up. It is supremely non-stick. I wouldn't recommend metal utensils though.",
        "I'll admit that I purchased this based on the recommendation from America's Test Kitchen, and it hasn't disappointed me at all. The pan seems to distribute heat pretty evenly; although it has made me realize that my stove isn't level. Eggs and other items I've cooked in this have been easy to slide around with minimal sticking. It's also easy to clean with a sponge. So far it seems resistant to scratches; although I've been pretty careful and only using soft nylon or soft plastic spatulas with it.",
        "This is the third one that I ordered. It does not look the same as the pans I previously ordered. The ones i bought before had the anodized spots as that the Video shows. This last order had no anodized spots on it. I hope it is as good and durable as the previous ones I ordered....Time will tell. Buyers take notice of this post.",
        "You need to be aware that these pans have been designed with the high point in the center of the pan. In my case, this is a problem because any small amount of liquid will run off to the edges. For example, a table spoon of oil that you may add spice to will be sparsely distributed around the perimeter therefore defeating the purpose. I thought that this may have been a manufacturing defect, but was just informed by T-Fal that the pans are designed with this high spot in order to counteract the effects of repeated thermal expansion over time.",
        "Used to really like this pan but not anymore. They are not formed into a nice round pan but rather warped on one side. They also are not perfectly flat and if you crack an egg in the middle, it will slide to the side. Our range is perfectly flat so it's the pan. They're usable so we didn't return them but after receiving 3 in the last couple of years and all had defects...no more for us. They have to know there's a problem just by looking at them after manufacturing them. Obviously they didn't or don't care. That's a shame as these were really highly rated pans and 4 years ago worked and looked perfect.",
        "So far i really like this pan. It is definitely better than the last Teflon pan I owned. As per instructions I have not put it in the dishwasher. As far as versatility, I only bought it for one purpose and that is to make my crêpes. I do really like that i can use a metal spatula! I detest those plastic ones. Teflon products in general make me nervous but making crêpes is a delicate process especially gluten free vegan crêpes. I will try to update as i have only owned this pan a few weeks",
        "This is the 4th pan I've bought. I normally use for cooking eggs. Can usually get a year out of them, even with cooking eggs at least once per day. They are so cheap, I just toss them when they start to lose non-stick properties...yet for others the pans were probably still serviceable. This time the surface looked different. It's not as pictured, with the small checks. The pan I received was a solid gray with the red circle in the middle. The surface is definitely not as non-stick for fried eggs as the previous pans. Very disappointed indeed.",
        "I have several other family members who cook in my household. Unfortunately in less than a year they wore the coating off the pan. Once the coating was gone, there was no need to keep it anymore. If you were the only one using the pan, it might last longer. I have since moved on to cast iron pans. They take a little longer to heat, but they are very durable and you can reseason them if someone does something stupid to them. I occasionally see a recipe that recommends a non-stick pan, I sigh, and move on.",
        "It's a very well done skillet. And it's the second one of this type I purchased after the first one started to peel. This is my first choice for cooking, but I noticed something weird. Certain types of oils like Grapeseed oil would run from the center to the perimeter of the skillet as if the bottom is not perfectly even. Which of course is causing problems because stuff in the middle starts to burn.",
        "Actually pretty heavy and well made quite surprisingly. Wasn’t expecting too much for the cost and was conveniently surprised. Seems to be cooking fairly well and really no complaints at all so far. Shall see how long they hold up however didn’t spend so much so it is what it is if they don’t last just buy more!! Has met and exceeded my expectations. Quickly shipped and shipped with care no issues so I’m happy!!",
        "Probably no worse than any other non-stick pan. Probably best to treat them all as disposable. Can't remember exactly when I bought this but not worth the extra money. Just like all of them starts out great then got greasy and impossible to clean on the bottom. After awhile despite my trying to not have the heat too high, cleaning carefully no abrasives, etc. drying the inside immediately got the pan got opposite of whatever non-stick is. This has been tossed in the recycle bin long ago. Keep thinking there is some magic non-stick pan that holds up to how an average gal cooks. Probably better to buy the cheapest pan and just toss as needed, well for me anyway.",
        "This pan is ACTUALLY 12”!!! And it has a good curve on the sides for flipping eggs. I had an earlier version of this pan (it was my favorite) and used it everyday for 5 years and would still be using it if a houseguest didn’t use a metal fork on it - Ruining the finish. My Calphelon 12” lid fits perfectly on it. DON’T use metal utensils. DON’T use HIGH heat DON’T use it to cook very acidic foods DON’T put it in the dishwasher (it wipes easy) If you take care of it, it will last a LONG time!",
        "I own one before getting the set, obviously it's great that's why i decide to get the set this time. so I own all clad, and its heavy. decided to get something light and nonstick to my list. So this is light, and heats well, easy to clean. and I have induction cooktop, it works fine, although my stove top sometimes cant sense it, dont know why.",
        "Haven't owned this pan long enough to judge the quality. Purchased it on the recommendation of Americas Test Kitchen as their top choice for nonstick fry pan. I Like the heat indicator in the center to tell me when the pan is hot. So far it has performed well and is mostly used to cook eggs. I no longer use nonstick pans for searing and frying meats as they seem to wear out much quicker when used with high temperatures. Find my cast iron skillet or stainless steel pans work much better for that.",
        "The first test I do on any skillet I buy is to test if the bottom is flat. I do that with a small amount of water with the pan on a level surface. This pan failed that test. The water pooled around the edge of the pan, and the center was completely dry. I returned it and replaced it with a Anolon Nouvelle Copper Nonstick 8.5-Inch French Skillet. This skillet not only passed the initial test, but has proved to be the best non stick skillet I have ever owned in both construction and function.",
        "Heated pan to beyond what I would ever use and spot never turned red. Not as stick-free as prior one. Cannot just swirl eggs; must free them with a spatula first. So, more trouble for \"over easy\". Liked ten yr old better, but getting scratched. Cannot really recommend, except I have an induction cooktop and this was inexpensive. I would not recommend for regular or heavy use.",
        "This is the second one I purchased, and only had the first one for a year before the non stick part started to chip pretty badly. I would be mad about this if it was expensive, but it’s not :). I’m giving it five stars anyways and a repurchase because my husband (who is a chef at a very tendy fancy LA restaurant and truly a kitchenware snob) refuses to cook eggs in anything but this (this is exclusively what we use it for, we just call it “the egg pan”). I feel like it has also upped my game in the kitchen! Perfect eggs always!",
        "Originally, I gave this pan 5 stars. We used it to make scrambled eggs mostly and French toast and it worked beautifully. I used only soft wood products or a plastic spatula on in and it cleaned up quickly with a sponge. However, it did not even last 6 months. I bought in April, used it about 5 times a week and by November the coating was coming off. I was most scared the first time this happened that the coating was in my children's eggs. Not sure if mine was a defect. Had to buy another brand pan. TFal is usually a trusted name.",
        "The nonstick surface is great, the handle is securely attached and the silicon grip is thick and doesn't get hot. The pan heats very quickly and evenly. It's a great pan except the bottom isn't flat, the center humps up. It doesn't make a difference with solid foods like potatoes and vegetables, but eggs run off to the sides. I have no idea why they made it like that, I'd give it five stars if there wasn't a hump.",
        "The pan is exactly what it reads aside from the size. This is a very tiny pan. I was assuming it was a legit 8in dry pan. I returned an oxo brand that was 10in and measured more like a 12in.... and I assumed if anything this would be closer to a 10in medium sized pan. I’ll keep it so I don’t have to do another return but I still need a medium sized pan.",
        "Either they have changed or a knock off. I originally bought these pans several years ago and they had a checkered pattern on the cook surface. They were smooth and lasted for a couple of years. Now recently purchased new ones and they don’t have the same cook surface. They also don’t seem as slick as the older model. I went to the official Tfal site and they don’t have this model listed anywhere. I am coming to the conclusion these are counterfeit. I will use them until they stop working but don’t expect that is for long.",
        "Purchased 12/2012 from Amazon Use it almost every day for sauteing or frying. Pop it into dishwasher daily. Showing signs of aging, but still very usable and still nonstick - see photos 5 stars for quality and durability. Will buy again, eventually.",
        "Bought because we saw it on TV - replacing an absolutely terrible Green Pan (too much heat causes the GP to lose its non-stick). The T-fal has been steller. The Thermo-Spot is a great feature. I can't say much about the scratch resistance because we always use non-scratch utensils. I just wish I'd purchased the next size larger.",
        "I am and have been a fan of T-fal since the company first went into production .I never had a bad item, and this skillet is number one with me , Especially since Teflon has at last been made known to be harmful. I new about Teflon years before the public as I was warned on it when in the Navy and jets engines used it for seals, So when the first pan and skillets with the coating came out I refused to buy it. Now with the hard anodized and other safer materials its great.",
        "The non stick coating is great! The pans are well made and look great. They are super easy to clean. My only gripe is that they are not flat on the bottom. I intentionally use a low/medium heat with these as suggested, but the center on the pan heaves upward forcing any butter or oil to the outside edges of the pan (s).",
        "I am very saticfied with this purchase. I have used the pan several times now and I love it. I use it for eggs. I sauté veggies, then add the eggs and haven't had any sticking. I use a small amount of EVOO, and a dab of butter first. When I clean it, it's as simple as wiping it out with a paper towel. Great pan so far!!!!",
        "Perfect non-stick pan for the cost. I cook multiple times a day, and this instantly became my go-to pan. Owned for 3 months; no issues. The product was packaged very well, came with a manual The size is great for large omelettes, steaming vegetables, cooking ground meat or chicken strips. Don't let your imagination get in the way of what you drop on this lil devil. This does not come with a lid, dog bed, vacation, or soccer cleats. If you want those, I suggest you cough up dough and get your search on.",
        "I have other nonstick pans before, but they started to lose their nonstick feature sooner or later. So I bought this pan to replace them, and so far it is really good. I bought this pan for making omelette in the morning, and it never failed me. The pan is really nonstick and I don't even need to add any cooking oil. Cleaning the pan is also very easy. Just wait for the pan to cool down, then use sponge with water to wipe it clean. That's it. My wife and I really love this pan.",
        "Great value for the price. These pans are hefty and that conveys quality. The surface is super slick, and washes up easily. Nothing will stick to it. I tried inferior copper alloy and it didn't satisfy me. The competitor felt like cheap, tin. Some may have an issue with the thermo dot dealio creating a hump in the center of the pans, but it doesn't bother me one bit. Give one a try or buy the whole set, you won't be dissatisfied.",
        "We purchased two T-fal pans from Amazon. We use them almost daily. They are great! They are non-stick and easy to clean. I am really impressed with this company as I also love their Opti-grill and we cook many nights on that. It has removable grill plates and can go in the dishwasher. Yea! I was initially not happy when my husband got these pans because T-fal used to be a cheap brand which I would only buy to save money years ago. I am so pleasantly surprised by these pans and the Opti-grill that I am a big fan of T-Fal now!",
        "I have not stopped using this skillet since it arrived. Recently started cooking meals for my Maltese and it is the perfect size for one cup of food to cover just the bottom. It is so easy to clean....use it twice a day. Haven't waited for the pre-heat signal before using....could be why the heat distribution doesn't seem appropriate.",
        "The skillet performs well on my induction stove top. I use it almost every day. The coating does not wear off for a couple of years. I very seldom cook above a #2 on my burner, which helps to preserve the coating. If I have to go to #3 heat, I only do this briefly.",
        "Not impressed. My eggs stuck did not flip easily. Not sure how it got a four-and-a-half star review. I don't know about scratch-resistant cuz I only used it twice and both times I had a little bit of eggs sticking. You get what you pay for. I'm going to buy higher-quality one next time.",
        "Our previous T-fal E93808 lasted for 2+ years. It was a great pan that could take quite a bit of heat and heated evenly. Great for scrambled eggs, searing and sautéing. This one, the coating is startling to peal off. This might be a one off problem, but be forewarned.",
        "I purchased this product 11/2017 and it went in the trash on 6/3/2019. Did not even make it 2 years before the coating started coming off. When new it was great - maybe a little slow to heat - but cooked well for what I needed and wanted. But then it started having marks in the coating that slowly turned in to large areas with no coating. Not buying this one again. I got what I paid for I guess,",
        "Years ago I bought outrageously expensive non-stick pans from All Clad and Calphalon. Both failed (became sticky) in under a year. This one is starting to be sticky after 6.5 years. It's also lightweight compared to those others. It's the only non-stick brand I've ever had that held up so well. Happily purchased it again.",
        "I purchased this pan over 3 years ago and it gets almost daily use on an induction cook top. I use silicone utensils and generally clean it by hand. It still looks and performs like it did when new. Other reviewers have been disappointed with the sloping design of the bottom of the pan, but I find it helpful in controlling the amount of oil absorbed by the food. The 12\" pan is on order now and I hope it will match this pan's performance. Highly recommend!",
        "I've had a few of these T-fall non stick pans. They seem to work for about 5 months. Then everything sticks really bad. I'm about sick of their \"non stick\" hype. Apparently they've got a new one out for 2019, that's supposed to be better and is allowed to take more heat. We'll see.",
        "Mine lasted two years. (purchased here on Amazon Feb 2016) The coating is now worn to the point that food is sticking to it. For twenty bucks, I don't know how long it should last, so I'll give it 4 stars instead of 5. For the two years that I used it, it's been my favorite pan. So I'm buying another one to replace it.",
        "Cleans and cooks great but don't hold your breath waiting for the color-coded T to fill in letting you know the skillet is ready. 😕 It does work on induction stoves. I was surprised to read that I had to season it like an iron skillet. I'm afraid of scratching the cook surface if I stack them.",
        "This is actually my second of these T-fal pans, the first having been purchased many years ago and used until the nonstick began to give up the ghost. It doesn't last forever, but for the price I don't think it can be beat. The pan heats fairly evenly and quickly, and releases well as long as you care for the nonstick surface and don't run the heat too high. The handle is comfortable, and the pan is light enough to be easily lifted with one hand while cooking. Is this the best nonstick pan you can buy? No. I've had better overall performance from All-Clad and other brands. But I've never seen anything as good for even twice the money.",
        "I like this good quality teflon pan. We have had several. It works well for a long time and does not scratch easily although we don't use metal utensils with it. It is easy to clean. However, we use it continuously every day and at some point the food starts sticking maybe because it has been in such a heavy use or because it has been on too high heat. It still looks good at that point.",
        "I bought this to replace my old Tfal non-stick 11\" skillet. It doesn't have the tall sides like my old one, but so far it's working well. Be sure and use medium heat, as directed, and it should do you well for many years. I do wish it was made in France, like my old one, but so far, so good.",
        "Just got this pan today. It only works on Samsung induction on small burner. Weird bc it's a large pan, but doesn't work on our large burner. We've had this stove for over 3 years and bought crap tons of cheap pans and pots, never had this issue so know it's not the stove. Pan is cheap and disposable so keeping. Will update more after using it. But clear issues being it's inconsistent with compatibility with burners on induction stove. Boo..",
        "I bought this pan because America’s test kitchen recommended it and clearly stated it works on induction stoves. It did not work on mine (I bought three different sizes and none of them work). The seller also states it works on induction. All my other pans work just fine so this is very disappointing. Maybe a change in the mfg materials?",
        "My old 10\" T-fal finally gave up the ghost after about 3 years...it lasted a lot longer than was expected and the Professional Series came highly recommended. I would have given it a 5th star but the cooking surface is smaller than my old one. Other than that it is a great pan. Non stick...really! and cleans up beautifully. No need to put it in the dishwasher..it cleans up faster than washing a fork and hand washing will probably prolong its life. For beginning cooks the red \"ready\" indicator is a bonus. No guessing when the pan is hot enough. A great product from a great company.",
        "Pan has held up well. It started to lose its non stick ability but then I \"seasoned\" the pan as some others suggested. I simply heated up some coconut oil on medium heat until it started to smoke, let the oil cool and then wiped it out with a paper towel. Eggs now slide out like when I first got the pan. One thing you should not do is put the pan in the dishwasher (as I found out). This will reduce the nonstick ability of the pan.",
        "This pan provides an amazing array of uses. The nonstick surface is truly nonstick, making cleanup incredibly simple and fast. I use this pan almost every day and have yet to see any wear on it. One thing to note when using nonstick pans is to avoid using stainless steel knives or other metal utensils as they can scratch the surface of the pan and ruin the nonstick ability. I purchased all silicone utensils for our kitchen and they are much more compatible with this pan.",
        "The set of T-Fal pans we ordered as a Father's Day Gift are wonderful ! Nothing 'sticks' to the pans' cooking surfaces, and the pans are easy to clean ! We've tried other \"As Advertised on TV\" non-stick pans that didn't provide the results we were looking for, and the non-stick surfaces didn't last very long. We're really happy with these T-Fal pans :-D",
        "The nonstick coating on these is far superior to any other pan in the price range. They do have a slightly convex shape, however, which can affect cooking certain things though. Still, even with the slightly irritating cooking surface, all other aspects of this pan far exceed expectations.",
        "This is a great frying pan. Yes, it is slightly raised in the middle to allow the oil and grease to flow to the edge, but I'm not sure that's a bad thing as some have suggested. Very solid. Comfortable handle. Not too heavy. Attractive and easy to clean. Food doesn't stick but a little. The red glowing button doesn't seem to work with gas ranges, however. This is a much better pan than the green pan I purchased a few months earlier. Fantastic buy for the money. I highly recommend!",
        "I’ve bought hundreds of things on amazon and have returned a few. This is one. Why? Convex shape of pan. Not only is this shape going to heat unevenly on an induction stove but it’s also going to push everything to the sides - on any stove. This pan is only good for generally sautéed whatever and done on a gas stove. This design is so bad it’s comical. Most things u cook and don’t want to stick u also don’t want them to move to the sides. This is th most useless pan",
        "A great skillet. We've had several over the past 10 years. Nice high sides so they can hold a lot of food. Clean up is a dream. Since nonstick skillets wear out fairly quickly and you really don't want to use them past their prime, I don't feel bad about replacing them every year or so at this price.",
        "Omg I can’t believe how long I waited to get a new frying pan! My last pan still stuck no matter how much nonstick spray I used, this new pan I can put eggs in with no spray and they just float around the pan like magic! Why oh why did I wait so long!",
        "jst used it and made scrambled eggs / cheese . i did not use cooking spray and nothing stuck to the pan . and clean up was a snap . wiped right ot like no other pan i have had . so much better than the copper colored pans i have",
        "So far I’ve had great success with the coating. I use a rubber spatula so I expect to get a lot of time out of this pan. The center is raised a little, but I aim for the low spot when I cook eggs, so it works out fine for me.",
        "I have been using this frequently for 2+ months now. It has worked great so far, and is my first choice when I don't need a huge skillet. The non-stick surface has been working great and cleaning up like a dream, both inside and out (I do tend to use a non-stick spray). Haven't run into any issues with gunk building up around the rivets inside the pan, which is a nice change from a previous set that were good other than that flaw. I picked up a smaller sized ceramic pan in the same timeframe that is terrible - I will probably replace it with the 8 inch version of this pan.",
        "I found out about T-FAL through Cooks Illustrated, ATK. I've used this frying pan for the past several years and I absolutely love it. It works as advertised, non-stick works well. The coating hasn't flaked off. It's kind of cool that the center turns red when its hot--but it doesn't inform my cooking personally. There is a bit of a range for how hot you want the pan to be depending on what you are cooking. I guess it is nice to know whether the pan itself is hot, if the stove happened to be left on.",
        "The seller claims that this pan is \"exceptionally durable\" and fine for metal utensils and dishwasher treatment. I have literally never seen a less durable non-stick surface. You can see from the photos what cooking 2 meals a day and 1 trip to the dishwasher a day did to this \"durable\" pan. That was for 25 days by the way - less than 1 month. Now it's unusable since the nonstick skin is peeling off. I really regret this purchase. I would give it 0 stars if I could.",
        "I just can’t get used to the idea that a properly constructed pan becomes convex the first time I use it and the manufacturer says it’s fine. Everything will leak to the edges. Making evenly cooking food near impossible unless it fits on the top shelf. It also seemed to be shedding metal or coating after the first time. Had to return it.",
        "This is the perfect breakfast egg pan. It has durable, excellent nonstick coating, a comfortable handle, an enameled exterior so it doesn't react to detergents, and a magnetic stainless steel bottom plate so it works with induction cook-tops. The size is just right for individual omelettes, and the shape allows easy turning and sliding food out without disturbing it. If you need a pan lid (T-Fal doesn't make one for this pan), the Winco AXS-16C fits perfectly and is available on Amazon.",
        "We have had to throw out so many \"non-stick\" pans. These are wonderful and much less expensive than our other experiments. A tip, often not known: If you use ANY cooking oil on these they may use their anti-stick properties!",
        "I have purchased several T-fal pans that induction compatible over the years-three from Amazon before this one. This pan unfortunately is the worst of the four T-fal pans I've purchased. The nonstick is a coarser quality than previous versions of this pan. The scratch resistance also isn't as durable and scratches more easily. The pan also has hot spots and uneven cooking compared to previous models.",
        "This is our 3rd or 4th repeat purchase - they do a great job and we just treat them like a disposable product vs. something like a cast iron skillet - which will last forever. Depending on how many times a day you use it, utensil material (metal vs. not) and how you clean it - we go through about 1 every 16-18 months or so. Highly recommended for what it is.",
        "The pan just needs to be rinsed to be clean after using it. The heat distributes evenly even on my uneven electric burners. i am going to order a larger one next and toss the old one i have. I have T-fall I'm still using since the 70's and they still heat evenly even if they are well used. The best.",
        "I own an earlier version of this pan. I got several years good use out of it until eventually the non-stick surface became too worn. Having been satisfied with the earlier product I ordered this (ostensibly the same pan) replacement. In this newer version however the design of the pan bottom has visibly changed and I find that the heat transfer (I have an induction stove) is much diminished from what I was used to with the older pan. Subsequently I find myself turning the heating element up higher to achieve the same result. I don't know what prompted the design change (cheaper to manufacture?) but they've gone backwards in heat transfer efficiency. So, overall, I'd say I'm disappointed.",
        "I love this pan!!!! the reason I only gave it 4 stars is because mine only lasted about a year before the non-stick coating began to flake off. I would expect this pan to last longer than a year! however, that aside, I love the pan so I just bought another one to replace my bad one. I bought this pan originally because of the recommendation from America's Test Kitchen... and they were not wrong. it has a large cooking surface and all round nice performance. my food doesn't come out cooked as well in other pans. buy it. it's a good price too. last time I paid $34 and this time I just paid $27.",
        "Nice and big, just what I wanted. I wanted a big pan with no lid, and this is it! I was apprehensive after reading some of the negative reviews, but after 2 months and more than a dozen uses I haven't had any problems. I'm being careful with it, no metal utensils and handwashing. We'll see if it continues to hold up. It's a little heavy, but I'd rather have that than too thin and light",
        "When our everyday 10\" covered fry pan was needing replacement, I researched and found this pan on Amazon. On Prime, it arrived, double boxed, in two days. It looked great. Then I discovered the pan was a 12\", and we needed a 10\", because we had two other 12\" pans. My bad! Not to worry, it was purchased on Prime, and I could return it. Amazon wanted $8+ for return shipping! Then I discovered that on Prime the shipping charges to me were paid by Amazon, but the customer has to pay return shipping except for clothing, shoes and other sized items. Bottom Lines: a good learning experience, read the fine print, and our daughter will enjoy her new pan.",
        "This pan is easy to clean and I guess scratch resistant, although we use only appropriate spatulas, etc. However, we can use it only on our smallest heat element on our induction cooktop. All of our other pans, pots have a broader range of compatibility but this one, due to the bottom surface size, does not. So good pan on right size induction but don't expect it to work on any cook surface but your smallest.",
        "Love this pan. Our family uses it multiple times daily. I make omelets for breakfast and the wife cooks dinner in it at night. After 6 months of multiple daily use the non stick properties are starting to diminish. I don't care, we use it so much I'm buying another one.",
        "I am so disappointed in T-Fal. I have use their products on my induction cooktop for years. I needed new nonstick skillets, And of course ordered new T-Fal. Only the very large skillet works on the correct size burner. The smaller skillets have such a small burn area that they only work on my smallest burners and therefore only heat the very center of the skillet. So a grilled cheese only gets cooked in the very center of the sandwich and not the outer edges. Do not buy these skillets.They barely work on an induction top. Buyer beware!",
        "Going to return. Everything sticks and burns. The bottom of the pan is ruined after a few uses.it also seems to release a sticky soot in the air.my upstairs wooden floors became extremely sticky after cooking with this pan.something is off.i have bought this exact pan a couple times over the years and have not had a problem like this before.",
        "This pan was used in our home about 4-5 times a week for 4 years. Only recently is it showing significant signs of wear- scrambled eggs are sticking noticeably. The value on this thing is amazing. It does have a slightly raised center, but being so small it doesn't matter much on the 8\". Heats evenly and quickly on my gas stove. I'm buying a new one and looking forward to another four years of egg and small-portion cooking.",
        "Had this less than a year. Severely warped in that time. No longer sits flat on my stovetop, resulting in poor evenness in heating across pan surface. I'm generally pretty gently with my pans, so no heat shock while I owned it (Fast heating/cooling cycles). I had good luck with my T-Fal saute pan in the same line, but this was a dud. I can't speak much to the longevity of the coating because this pan warped more quickly than I lost coating on my cheapies I used to buy.",
        "Well built, thick bottom, great heat distribution. And doesn’t leave half of my eggs stuck to the bottom.",
        "I had some misgivings before purchasing this. Now they’ve replaced my ridiculously pricy all-clad pans which don’t distribute heat evenly. These pans are much sturdier than I thought. I like the three different sizes which enables dinner for the whole family and lunch for one. For the price, it was a good purchase.",
        "This pan is a freakin hot rod, if you can’t appreciate a professionally kick ass pan, don’t waist your time, go to the Goodwill and by a bummer of a pan. I have cooked everything from risotto to paella to seared veggies, to sautéed everything to steak. If you love to cook, this pan will meet all of your needs.",
        "After we'd had this pan for about 9 months of what I'd consider normal household use (family of 5, probably used 3-5 times a week?), a bubble started forming under the nonstick cover. Having read the various reviews, we never used metal utensils or washed in a washing machine; every time we washed, we washed by hand. We loved the pan until the bubble formed, and not long after the bubble formed, it popped, and the bare spot quickly grew. This is super sad becuase now we have this great pan that we can't use, because the nonstick flakes off.",
        "I waited a while to write this review to give it a real test. We cook alot. This pan works as described and can give your food a descent sear. The only issue i have is the fact that it is not flat inside. The center is actually higher than the outer edges. So you pour oil in the pan and it all goes to the outer ring. during cooking you end up constantly picking up the pan and swirling the oil around. I only use this for blackening food now. But it works, just not an all around skillet",
        "So far so good. I will up it to 5 stars if it lasts an entire year without warping or Keflan damage. It's nice and heavy, seems to heat evenly, and non-stick coating is very good. Downside (If you get the larger 12\" version) the sides dip down causing liquids to pool away from your food. This is good if you want that, but if you want to add liquid flavorings or trying to sear with oil, it's really bad.",
        "Working great so far. Bought to replace calphalon. Lot cheaper. Plan on replacing once a year if used a lot. Update. Lasted one year almost to the day, use about every day and often twice a day. Probably could squeeze another month or 2 out f it, but for 23 bucks, why bother.? Great pans. Just ordered my second one. Hope they keep making them. Better than man costing several times as much! Update. Just ordered my third one. First lasted 13 months, second lasted 17, Which is good. Took a star off due to 50% price jump."
    ]
}