{
    "entity": "Skillets",
    "text": [
        "Perfect for egg muffin sandwiches, it's the right size and height after cooking compared to the \"Mc\" brand. It is the best I have found after many years of trying. If you have ever wanted to make your own egg muffin at home, this pan is the one to use.",
        "Throw your money at amazon and never look back. I cook a great steak. I love cooking steak. Enter this cast iron skillet (shout out to my momma for the recommendation). Holy crap this thing rocks. I cook everything in this baby. You ever reheat pizza on a cast iron skillet? You ever get cold in the winter so you just heat up the skillet and let it sit in bed with you? Well I have, and I have the burn marks to prove it. I love this skillet, what a phenomenal purchase.",
        "I don’t know if I got a defective one or not but it’s horrible! I looked up online, in these comments, per instructions how to clean this pan and I do so accordingly. I have done everything correctly and according to instructions but EVERYTHING sticks! Ive only used this a handful of times and whether is use a ton of oil or none the pan is completely dry and everything sticks to it. I have ruined several dishes due to this and I’m scrubbing like crazy, no soap, and oil it after. Still horrible. Returning.",
        "We bought both the larger and smaller sizes. We've had other iron skillets in the past and have to say these are very high quality. Beware, they are heavy. My wife and I were not all that impressed with the manufacturer's pre-seasoning and suggest that you season yourself with a high temperature vegetable oil. Place a thin coating of the oil on the inside of the skillet, heat oven to 350, place skillet in the oven for 1 hour. Turn oven off after 1 hour but leave skillet in the oven until it has cooled. You're ready to go!",
        "This product said that it's fully cast iron but IT IS NOT! I used it one time and the entire side of it split in half like it was made out of clay or something.. not sure but if I could give it 0 stars I would. Very disappointed!",
        "This is a quality pan and became totally nonstick after a few seasonings. Reasonably priced and made locally. This pan will last forever with proper care. Picture shows a batch of latkes in action.",
        "I love Lodge products. I really do. They heat well, great for everything from eggs to pizza and more. One flaw about Lodge specifically, pre seasoned items suck. Take the time to reseason them yourself. Maintain proper cleaning techniques. You'll have a glorious pan for eternity. The reason for 1 star is how Amazon ships it, and possibly stores it. Look at reviews and you'll see many instances of pans having minor damage to pans that are literally broken into pieces. My 8 inch skillet appeared with two chips. One that existed for so long it began to rust. Buy a Lodge pan in a physical store, so you can thoroughly examine it. Never on Amazon.",
        "FREAKING TINY! listen up... Here's what you do. You pop an oversized biscuit in it... Cut the biscuit top of at the 1/2 way mark in cooking. Drop an egg with crumbled cooked Bacon on it. Put the top back on. 12 minutes later... Bacon egg and cheese biscuit! All in one time Skillet!!! I love to use this Skillet to make garlic, thyme, butter sauce, for steak! It needs to be cared for like any other cast iron skillet. It needs to be seasoned like any other cast iron skillet. It actually.... Uhhhh... Kinda cute.",
        "I ordered this pan to bring to college with me as I will be cooking all of my food now, instead of purchasing a meal plan. I bought it because of the great reviews and its many uses and supposed durability. Unfortunately, I just opened this package and noticed that there were already 2 small spots without seasoning that are already rusting. I was looking forward to use this as the reveiws were great for this product but seeing it now, am highly dissapointed. I am quite certain that this is just a fluke, as there are many happy buyers, but it is still disappointing.",
        "4/21/2017: This is my first ever cast iron skillet. I have a griddle of the same size from Lodge that I purchased from here a couple of years ago but only started using recently. I think I am beginning to understand how to cook with and care for cast iron cookware thanks to a bunch of enthusiasts on YouTube. I like feel of the cast iron and after the initial seasoning, it looks fantastic. This is not much of review at this point. I hope to update it soon. 5/1/2017: Do yourself a favor and get the 12 inch skillet, even if you cook for only two people.",
        "The center of the skillet protrudes. It's higher than the sides. The oil runs down to the sides while the center is dry. As a result the center gets hotter, which means uneven cooking. It's junk.",
        "Rough as 40 grit sandpaper. Maybe some work with a grinder will make it usable. On the plus side not expensive enough to bother with a return.",
        "I got this yesterday , and this morning I have tofu scramble for breakfast , so this is how it looks after on use :( I dont understand how i ruined the pan after one use .I also put a pic of another pan that I had for years to compare",
        "Upon opening, I did noticed a flaw 1 skillet, like a crack was \"rubbed out\". Did everything right on glass top. Turned heat up a bit but noticed the skillet was cracked with a max opening of 1/8 inch. Went to look at the other and you could see the crack already. Both shipped in huge box together. Went back to kitchen and once the heated skillet had cooled, crack was 90% gone. I WOULD MAYBE have noticed the crack in the unheated skillet, but I had purchased over $600 worth of Lodge items, 12 total cooking items, tripod, and handle gloves..all Lodge. Wanted Lodge for quality.",
        "I am very pleased with this skillet. I seasoned it twice at 450f for an hour and now I make scrambled eggs, fried potatoes and fish - all without sticking. But today it passed the ultimate test - I made a whole batch of thin crepes and they turned out wonderful. No sticking whatsoever, no black residue like some other cast iron skillets I tried and it seasons so well I don't have to redo it all the time like I did with my other skillet, which still would stick to everything (old mountain). Buy this skillet, you won't regret it. It's actually my favorite skillet now and I'm planning to buy one more.",
        "I just noticed today, after i fried eggs, metal smell was terrible...and i tasted the metal as i ate the eggs..lifted up the eggs and all black residue was under the eggs.. basically i ended up eating the black metal residue!!!! anyways isn't this skillet supposed to be used as is? now i am doing the oiling and baking in the oven to season the skillets...will see how it turns out...not really happy with the metal taste and black residue!!! buyers should be warned about this!!!! skillet itself is good for frying or in the oven or on stove top....but i didn't know that it requires additional process to keep it safe and free of black metal residue...",
        "Rusted after 1st use. Didn't even heat it up. We used it for dry treats as a cute appetizer dish. Wiped it clean with damp sponge, it was never submerged in water, and then patted dry with a paper towel. The next day there was rust marks all over it, as seen in the picture. Not practical at all for use. Would not recommend to buy. Returned for refund.",
        "I am disappointed with this Lodge pan that I purchased from Amazon in August 2018. I followed all of the directions for using it. (I even used organic flaxseed oil on it, as recommended by Cook's Illustrated). My old 12-inch Lodge responds well to the flaxseed oil treatment, but it doesn't seem to have the same effect on this new eight-inch pan. After just four months of use, my eight-inch pan is half-rusted and half \"almost-rusted\". See photo. I'm wary of buying Lodge pans now; I wonder if this is a genuine Lodge pan. I feel as if I wasted my money.",
        "5 stars for the pan, 1 star for the pot holder. this new design of pot holder is awful. the old design (mini inside out fabric oven mit..... basically) worked well because you could slip it on and off of the pan's handle easily without having to directly touch the pan. This, no. If you try putting this on the pan without using your opposing hand to keep the pan from moving it will push the pan off the burner rather than sliding over the handle. Same story taking it off. So basically, you need an oven mit anyway which really reduces the utility having the pot holder to nearly pointless.",
        "I love this thing! I'm a recent convert to cast iron cooking. As everyone said if you don't over clean it and just cook crap off it before you use it they work well and non-stick. I'm really impressed with how much better the food tastes. Shocked really. All my cooking is now cast iron. Somebody needs to make a cast iron Foreman style grill! I'll buy that in a second. Anyway, weighs a ton like it should. Cooks great. The rubber pad thing is helpful but collects grease inside so wash that out a lot. Don't wash the pan a lot though. Just heat and spatula scraping and it is more non-stick than the non stick pans they sell.",
        "I'm giving this a five-star review because it is an excellent pan. Unfortunately, I already own this pan. Whoops! We got one this size for our wedding. I really thought that eight inches was bigger than this, lol. So, I'm posting this review so y'all can see the frying pan WITH my hand in the pic as reference so you can actually tell how big it is (spoiler alert - not very!) It does fit four eggs or four fat sausages, in case you're wondering, but I wouldn't put a fifth one in. Anyway, don't make the same mistake I did - order the right size!",
        "Cute, but thought I would be able to bake apples in them. Iffy! Certainly not individual meatloafs. I’ll keep, but would have to be horrible for me to return. Seldom do. They were packed really badly. Good thing cast iron. Hugh box for small items. Bought 6. Then 6l little blowup pouches. Liked the picture delivery took of the package on my porch. Probably not necessary in a gated community. I’ve been here 15 years and one golf cart has been stolen.",
        "I love it. On the stove, in the oven, on the grill, or sitting right down in the coals of a campfire...nothing heats as well and as evenly as cast iron. This 12-inch skillet is big enough for six quarter-pound burgers, lumberjack-size pancakes, a couple trout or bass, and it's deep enough to bake an upside-down cake for dessert. One thing we like to do for breakfast when we're camping is fry and crumble sausage and bacon, then add garlic, onions, peppers, and finally eggs. This skillet is big enough to fix enough for the whole family at one time, so only one pan to clean up before we head out for the day.",
        "I was so excited to get this in the mail. I've owned several cast iron skillets, molds, what have you. Our last one of this size pitted(it was ancient), and there was no coming back and I didn't realize how important this size was until we no longer had it, so I ordered another. It arrived with a crack. So disappointed. I had already thrown all tags away and begun to cook with it when I realized. I'm going to use it anyway it's just frustrating because it's not like this item was cheaper than you can find elsewhere. CHECK YOUR SKILLET BEFORE TEARING THE TAGS.",
        "Although it claims to come pre-seasoned, it's pretty clear that it isn't enough to keep your food from sticking horribly to the bottom of the pan. I followed a guide online about how to properly season a pan, and I haven't had any issues since. I recommend everyone do that prior to using it. It feels to be pretty standard cast iron, and hopefully lasts a long time, but I was very unimpressed with how rough it was and the lack of proper seasoning.",
        "My mom had cast iron so I got this pan, cooking eggs is a joke. I't say's pre-seasoned but the egg stuck bad so I washed and dried it then Using an olive oil saturated paper towel, coat the entire interior surface liberally, preheat oven to 350 degrees F. Bake the skillet, upside down on the upper rack for 1 hour and next morning tried again and food sticks to it. This pan is no better than one from the 99 cent store.",
        "I just wanted a small skillet, I have been told skillets are awesome for cooking and versatile. I used it once and washed as directed, the surface instantly started to flake off and discolor. I based it with oil thinking it would correct the problem, used it again and it just got black specks in my food. It is very poor quality and not at all what a skillet surface should look or feel like; it is super rough and flaky.",
        "First pan arrived with large scratches on bottom of pan. Was returned and I ordered a replacement. Second pan came with actual rusty area on rim of pan. Not good on a cast iron pan. Will return and not try ordering another. With the defects on both pans, neither should have been sent out. Very disappointing.",
        "This is my first cast iron skillet and I am overall very happy. It's not really preseasoned that well. I still had to rub oil and heat it until the oil started smoking. I've used it 5 times now. I oil everytime after use. Cleaning is easy. While the pan is hot, throw a cup of water and use a scrub brush made for cast iron skillet. All the food comes off and you have a clean skillet without any elbow grease involved.",
        "Supreme quality cast iron. It's a little heavy for me and my husband and I both have to use two hands when moving it around but we just love this cast iron. And one of the best added perks is we noticed this is the same skillet Chef John from foodwishes.com uses! We were very tickled to see we bought the same skillet as our favorite celebrity chef! This skillet was also recommended by America's Test Kitchen. So you know it's good!",
        "Bought this to use at our campground because I was tired of cleaning the char off other pans. It comes already \"cured\" yea I don't know about that. Its the hardest thing in the world to keep clean. I used it for one meal and have sat it on the side and probably will throw away. Its just way too difficult. Cast iron shouldn't be difficult in fact they should be rather easy to work with, but this was not. Perhaps I should have cured it before using but the directions with this one say not to, that was a mistake. If it wasn't then this simply isn't a good brand.",
        "I wanted to love this cast iron skillet, but everything about it has been wrong.. I followed the instructions and oil down the pan for first use, but Everytime I have attempted to make something in my skillet the food sticks to the bottom. I am very disappointed.. I even brought the metal net to clean the pan. That didn't work well. I brought this pan to use as my main cooking pan. Know I now I should have done more research.",
        "My family has used cast iron skillets for years, and I mean that literally. My mom, and her mother both used them, and now that they are gone; their skillets reside in my kitchen. When using them it brings back memories of when I was a little girl, and my Nana frying chicken, and my mom making cornbread. Always, brings a smile to my face. Take good care of these skillets; they get better over time. Oh yes, I have a few of my own but with the 2 new additions...yes, deserts for 2. I will some day, have all of mine continue on in the family with one of my three granddaughters. No arguing about them girls 😊",
        "I just needed a pan for frying an egg or two... Wrong decision by me! If you have the same idea, don't buy this! Buy a teflon coated instead. this pan does not have a mirror surface, rather a porous one. Eggs get stuck in the pores and don't clean off easily. It looked so beautiful in the beginning, but I after I tried to fry some eggs, I got the horrible result, Everything is STICKY and I spent almost 30 minutes to properly scrub the food off of it... DO NOT RECOMMEND if you wanna have an everyday pan for frying.",
        "Some of the photos promoting the 3 1/2 inch mini cast-iron skillet are very deceiving and do not reflect the size of this skillet. It is super tiny and not what I expected based on the photos. To give you a perspective, it only holds 1/3 cup of water and does not look like it would be large enough to even cook one egg.",
        "I have wanted a cast iron skillet for some time. I carefully read about each one before choosing and am so glad I went with Lodge. After reading about the history of it, I knew it had to be the right one. It's a great pan, I am still working on getting it seasoned but I am really enjoying it. Even thought I read that most recipes are for 10\" I felt the 12\" would be best for me since I often have guests. I really don't think it will be difficult to adjust the recipes, just a change in length of cooking time.",
        "This is a perfect fried egg pan. I used a spray oil and did not pre treat the pan. It cooks up the sides of the pan and came out perfectly. This is the small 3.5 inch one.",
        "Check the bottom of the pan carefully. I've returned two. Both had BAD pits caused during casting.",
        "Will add to this review later. Purchased this as my first ever cast iron cookware. Love the size and weight. Had read enough to know I needed to add to the seasoning of the pan. That said, the interior was still rough. Gave it to a friend who sanded the interior down and has been seasoning it for me. Cooked eggs on it today and am delighted with the results. This is the only reason I gave it 4 stars. For the price you can't beat it. Will let you know how it works out as time goes by. 1st pic is before he seasoned it. 2nd pic is after seasoning",
        "I would have given this a better review closer to when I first bought it. It seems the seasoning is coming off. It looks kind of bad. My other cheapie thrift store cast iron pan does a lot better. Haven't done anything weird. I usually season after every use and never use soap on it, but I left it as it was after washing so you can see the damage to the seasoning.",
        "I was so excited about getting my first cast iron skillet and this one had nearly 15000 reviews and a nearly perfect star rating, and was so reasonably priced, how could It go wrong? Well I super enthusiastically opened the box to discover the skillet broken, the handle entirely sheered off at the point where it joins the body of the pan, that’s how. I must admit my utter disappointment quickly morphed into anger. Seriously, how bad does the quality have to be for cast iron to break in a (badly but still) padded box? I wonder at the legitimacy of all of those positive reviews. Don’t waste your money. I won’t be using my refund to rebuy this item.",
        "Truth be told, my husband loves this more than I do LOL Its a great skillet. Fits one egg, and leaves it shaped perfectly for an egg sandwich. I have an electric stove, preheat the pan on a 4-5, butter generously, put on egg in and cover tightly with foil, reducing heat to a 3 and cooking for 3 minutes. The egg comes out perfectly cooked for him with a runny yolk, and you know what they say: happy husband, happy... he complains less about alll the things you buy on amazon. Happy shopping ladies ;p",
        "This skillet is huge and awesome!! I was concerned that it wouldn't work well on my electric stove top because the diameter is much larger than that of the largest elements. It actually worked pretty well although the heat was not evenly distributed across the surface. The meat browned much faster on the sides nearer the center of the skillet but that was expected and just meant turning the meat to get it browned evenly. Not a big deal; I was happy to be able to fit all of the pieces in the skillet at the same time!",
        "I ordered this skillet with the intention of hanging it in my kitchen. When I received this skillet I was really surprised to see that it was a non stick skillet. I have always been a cast iron snob. Old school. I have cast iron from my Great grandmother. Although This Lodge cast iron Rosie skillet totally Rocks, but it is now my favorite frying pan. I have to order another one now. 👍😎",
        "Love my ironware. Nothing better. Once you get used to cooking and maintaining the seasoning, you will never want to use anything else. I have ironware that's over 100+yr old. That's all I use. From stove to oven to my BBQ/Smoker & even my campfires. If you are New to Using Quality Ironware, get on YouTube and search for the videos Lodge has and watch some of the users videos. It takes a lil knowledge and patience. Never use degreaser based detergents or wash in Dishwasher!! This will remove all seasoning and cause corrosion(rust). Read the yellow care card that comes with every Lodge piece. It has Vital instructions on it. Also, visit Lodge's website for cooking videos & recipes.",
        "Honestly we cook on the same surface multiple times a day for years it really matters what you cook on. I’m a minimalist in the sense that if I can get one or two things instead of ten I’ll prefer that. To me this cast iron skillet handles that. I’m just appreciative for the great value that is this product. It’s a really good price for what it is. I used to use cheap non stick pans but then did my research and learned about all the horrible chemicals that leech off those. And don’t read their advertising because they pretend like they’re safe but they’re not. Cast iron is safe though.",
        "Only been cooking in iron a few years. My go to pans inside and outside at the bbq. It's a Lodge. What more to say. If your on a budget, Amazon Basic is a not a bad product. Go for them. I have a number of them. But, I found i was happier after grinding them smooth and seasoning a few times. They have ridges more then bumps on the finish which food tends to stick to. Over all, Lodge just out preforms them out of the box. Lodge has a much better seasoning from the factory. AND, Lodge is AMERICAN made. That was important enough for me to pay a little more or wait for a sale.",
        "I love Lodge & would never return their products -- received this today, shocked at the size, but tested it out :-) That all said, it's perfect for an EGG for one, worked beautifully. What I was most surprised about -- the depth. It's shallow, so an inch or so? I had somehow expected more like 1 3/4 inches, or so. Again, Lodge Iron is QUALITY & stands up to time, -- it will make a great pan for Apple Crisps, one egg, a broiled Chicken Leg, etc.",
        "Just like the one your grandma used. Well made. Made in America. Pre-seasoned but use a small amount of oil the first few times to help with the seasoning. PLEASE KEEP THIS IN MIND: This pan is no light weight - it is VERY HEAVY. I'm a 6' male, 200 lbs. and I use two hands to move it. If you have issues with picking up heavy items you will want to stick with a smaller pan or one that is made of more light weight material. Otherwise, recommended.",
        "I was a little surprised how large this skillet was, but I’m very pleased. It came very well seasoned. I rubbed some Crisco all over it and put it in the oven. Later in the day, I prepared a vegetable medley and cooked it in the oven in this skillet. It turned out great, of course. Typical of a Lodge product, this is a very sturdy, dense piece of iron. You will likely need to use the added handle to lift and move it. Because of its size, the skillet overhangs most burners. Still, it does a great job on bacon and I just made some fried rice in it last night. Pretty amazing. I recommend this skillet.",
        "My t-fal was taking a turn for the worst and since I LOVE my Lodge cast iron grill pan, I decided to go cast iron for every day stuff. I am pretty convinced that other than stuff that requires boiling, I'm replacing my chefmate and t-fal with cast iron as those items are falling apart. I hate having to need a screwdriver with my cooking utensils to screw the handles tight. so far all Lodge products I've purchased have been great. I love the silicone handles for moving the pans around because they ARE heavy, but now that they are fully seasoned, they are awesome.",
        "During quarantine I worked on perfecting my cornbread recipe, for which you obviously need a cast-iron skillet. I am typically only feeding my husband, my son, and myself, though, so a big 10-12\" pan of cornbread was far too much for the 3 of us. I cut my recipe in half with this little skillet and it works out perfectly! It flips out onto a salad plate and still cooks evenly - I think I took about 4 minutes off the time I originally used for the full sized pan recipe. I'm so happy to have this smaller size now!",
        "I only expected a cast iron pan nothing special, but once I picked this thing up and saw the way it was constructed, the way it felt to hold (very heavy, by the way - but that's a good thing!) . I followed the instructions, oiled it up, put it in the oven, turned off the oven -- and the next day I had a beautiful work of culinary art. I love the way this pan feels and the way it cooks (evenly). It gets hot quickly and I have since put away my favorite non-stick pan - as this will now be my everyday cooking pan!",
        "I have been wanting a cast iron fry pan for a long time, I have all non-stick fry pans but love watching how the cast irons pans sear when a chef uses them on TV. I guess I was nervous about the ‘seasoning’ aspect, but since my husband grew up with his mom using cast iron, he was sure it would be fine. I haven’t looked back since I purchased this...no more freezing outside in the winter when trying to bar b q steak, I just pull out my cast iron pan! It’s fairly easy to clean and season (the hubby does that), and I do love how it sears meats.",
        "You can't go wrong with Lodge. I see a lot of comments about people getting upset about rust, but honestly I think a lot of that comes from not knowing how to properly care for cast iron. I know people get huffy and say they know what they are doing, but they usually don't. This little pan is awesome. We did a skillet cookie and it cooked evenly and perfectly. I seasoned it when it first came and have used it several times since, it it still has a beautiful black sheen. Don't bother buying cast iron if you are not going to do the research of properly caring for it.",
        "I’ve gone through several cast iron pans. This one is by far the best one. I bought this late 2018 and still use it at least 3-4 times a week. It really brings out the flavor of every dish. I even made deep dish pizza with it. Every kitchen needs to have this pan! Make sure you season it after every wash. If yours comes with a silicon holder, don’t use it. It’s too dangerous to use: it doesn’t fit well and the handle gets very hot. The only other complaint I have is that I wish the handle is a bit longer and wider.",
        "Lodge is a known name for Cast Iron Skillets & other Cast Iron cooking units. Cleaning is not a problem or hard if you follow simple basic described rules. or go online for experts advice. I have been using Lodge for years and decided tp add another to my kitchen. I finish mine with Kosher Salt using a soft sponge to swrl it around to get any small particles still evident. Then rinse out. Then use Pam spray in the skillets & reheat for 4 minutes on high. Wipe it out. It seems like a lot but truly is not.One skillet is always on Grill ready to go.",
        "Lodge is synonymous with quality USA made Cast Iron. I like this better than the Ozrk brand someone bought at a local big box and gave me. This is much better quality and USA Made. This pan came pre-seasoned, but go ahead and re-season it anyway. Can't hurt and you know you want to cook bacon. I like it for smaller things, maybe one egg or one grilled cheese. Anything where you don't need a large surface. I've had to for a while now and it holds up just like all my other lodge Products.",
        "Very large, heavy, and well made skillet. I've used this twice since I got it. Once to make scrambled eggs and then I made a lasagne in it. It's fantastic. The lasagne was done fifteen minutes sooner than I expected, so if you're using this for baking, make sure you check your oven well before the timer goes off. It's a great skillet and I can't wait to make a deep dish pizza in it. Update: I made a deep dish pizza, it turned out great. I've also made hamburgers and they were awesome with just a little salt and pepper for seasoning. This skilled releases very well, is easy to clean and never sticks.",
        "I was not expecting to love this 10.25\" pan as much as I do. The first one arrived with the handle broken, but it was quickly replaced. (The person who packed it must have thought cast iron was unbreakable.) After trying to season other cast iron pans myself to no avail, I knew I needed one that came pre-seasoned. My other problem has been buying pans that were too large and heavy to move--no matter how much I went to the gym. This pan makes everything taste better. I am so happy with this purchase and thanks to all the people who put in reviews that I read.",
        "I was really excited to purchase this item, as I read great reviews. I’ve been using it for a month now and the amount of smoke that comes from it because it’s uneven on the bottom is too much sometimes. I have to leave the vent on every time I use it so it doesn’t smoke up the kitchen. I thought I wasn’t putting enough oil but I realized it’s that all the oil goes to one side of the pan, so of course things to cook evenly because the heat distribution isn’t the same. It’s been great however if I put it in the oven.",
        "I wanted a small single serve pan that I could go from stove to oven to make a single serve of whatever I cook & this is the perfect size. I also wanted something to use over an open flame such as a campfire, fireplace or BBQ & this is it. I fried one egg the other day & it did use a fair amount of oil since the pan needs to be seasoned—but it came out great. This a durable pan that will be in my collection for a long time to come.",
        "Affordable and indestructible. A little heavy, but they last forever. As with all cast iron, don't let it get or stay wet for longer than 1 minute or so. Don't use soap to clean it - use chain links and abrasion to wear off food particles. But mostly, BUY THIS. It will also help you if you suffer from anemia. If you don't have anemia, but enjoy chewing on ice, buy this. Cook on it. See if you stop craving to chew on ice!",
        "Compared this Skillet to other Lodge products I own and the surface is different. It's minutely dimpled. I think Lodge started using this when they pre-seasoned their cast iron. I believe the dimpling is much better in reducing sticking. Amazing that this American company has resisted \"the China\" syndrome and continues to produce a superior product at a competitive price. Also this pan is $5 less on Amazon than at Walmart. This is really a good deal.",
        "My second 12\" cast iron. Ordered in the morning and got it before noon! Thanks to Amazon Prime!!! My first Lodge lasted me over 10 years and I enjoyed cooking with it a lot. It's so heavy duty that Amazon shipped my second Lodge in a white plastic bag without any stuffing/protection, and it arrived with no problem! With cast iron, seasoning is the key and you are good to cook. Looking forward to another 10+ years with my new Lodge cast iron!",
        "Bought in June of last year due to what I had heard regarding durability. Used it less than 20 times and noticed a crack forming near the handle.",
        "It's a Lodge Cast Iron Skillet. Can't say much else about it. It'll tear thru the shipping box, so hopefully the transit to your house isn't too far else you might end with an empty box. Every size has its purpose, I have 4 or five of these skillets now ranging from 6.25 to the 12 inch skillet. I've only had to replace one of the skillets after my sister dropped it and the handle broke off with a part of the skillet wall.",
        "This skillet is perfect. For so many types of cooking and baking. Sorry I waited so long to get it. When I recently was gifted a nice cookbook for cast iron skillets, I pulled my old no-name skillet out of the back corner of my cabinets. It worked OK, but heated very unevenly. I then noticed that it wobbled around on my stove. The bottom was not perfectly flat. This Lodge skillet is perfectly flat on the bottom, heats evenly, and holds a lot of food. Get a cast iron cookbook, start cooking your way through it, and you just might throw away your teflon coated non-stick pans.",
        "As with most cast iron skillets, technically, you're not supposed to use soap and water, which I did and after letting it air dry, the pan was covered in rust color. I did some Googling and found instructions to revitalize it. I cleaned it again as instructed and then rubbed olive oil over the entire thing. I put it in the over for an hour (I think at 400 degrees) and it came out looking brand new. Ta-da! The red handle cover isn't necessary unless you're using it on a stovetop but an oven mitt works just fine.",
        ". After pretreating with flax oil, eggs. That was a mistake. I later read that eggs are chemically (sulfur/iron) a mistake in iron and hard to cook well besides. The eggs stuck and in using a spatula to remove them, a nickel-sized hunk of the baked-on many-layered coating came off. I was not able to even the surface. I’d have had to remove all baked on (and factory treated?) layers of the skillet. Customer service kindly offered, after I asked for suggestions several times, to replace the skillet. The agent did not feel the skillet was defective.",
        "I bought the 10 inch pan when it was on sale wanting something larger than my old 8 inch pan. when I received the pan I was disappointed to find the pan is tiny. Apparently the pan is measured from the top of the lip of the pan and not the actually cooking surface. My old 8 inch pan actually has a bigger cooking surface than this \"10inch\" pan. I would say it might have a 7 inch cooking surface that would probably be good for a couple of eggs but you couldn't fit full size bacon in it or even 2 chicken breasts.",
        "At first I thought it might be too big and heavy. But once I got it seasoned with a couple of bacon cooking episodes...it’s my go to pan for steaks and fish. I don’t mind the size and weight because it’s so versatile. I can cook three large steaks at once or two steaks plus veggies. Easily to clean. Just keep it seasoned and dried during storage and it’ll last forever. This is my forever pan!",
        "LOVE IT!!!!! I am a Chef...A REAL ONE...I ORDERED 2 BECAUSE I GOT A GREAT SALE!!!! THEY....ARE....HUGE!!!!! Now I wait for the 12 inch Lodge to go on sale (or not...they are priced so well, I may go ahead and do it)...to buy 2 of them for my collection!!! I have everything but a habachi.....SOON!!!! I think everybody should go cast iron for the bulk of their cooking. I have a pan from another brand (my daughter got it) and it is buckled in the center and dangerously wobbly. I NEVER HAD A PROBLEM WITH MY LODGE! I have 11 pieces so far. You can't go wrong.",
        "This is a great cast iron skillet. I see complaints about eggs sticking, yeah, this isn't teflon coated, so you will rarely get the whole egg without leaving some behind. I also have a really old cast iron skillet that the cooking surface is smooth, that takes years of use though. I scrambled some eggs up the other day, no problems at all, but, again it's not a stick free teflon skillet. I seasoned it again out of the box, even though it says it's pre-seasoned. Really makes a nice steak, bacon, ham, potatoes etc.",
        "Great pan! It comes pre-seasoned, which was nice to start out with. It's large and can hold an entire \"skillet meal\" for a family of four easily. Cleaning is a breeze with a chainmail scrubber I found here on Amazon, and by keeping the seasoning fresh I've got a non-stick pan! I just use a little oil on it (you can buy oils made for cast iron pans or you can use coconut oil after washing - no soap!) and voila, you have maintained your virtually non-stick pan. I like mine so much I got one for my daughter and her husband. This company even has detailed instructions for the new user regarding care and cleaning of your cast iron.",
        "Got this for roasting chicken and baking pot pie but it's great for stove top cooking, too. Comes pre-seasoned but I season it after each use and it's virtually nonstick. I have the cast iron cookbook as well that has care and cooking tips that are helpful. There are some good recipes online, too. The silicone cover for the small handle is a good investment as the pans have some heft to them!",
        "I didn't buy cast iron cookware as I had concerns of difficulty of maintaining them. Boy was I wrong! There are definitely some basic things you need to do (don't let it sit in water too long, or cook acidic food, etc), but once you have a good base coat of oil, you just need to be consistent with your cleaning and application of oils at each use. Don't let fear hold you back, get rid of your rubbish non-stick pans and explore the wonder of cooking with Cast Iron!!",
        "Non stick from the first use. Even heat distribution and retention. This is my first cast iron pan. So I did some basic research on care and use. There are some blogs that suggest sanding the lodge pan, but that would take off the factory seasoning. I cook, wash with water and a stainless steel chain mail scrubber and put back on the stove to dry over med heat for just a min. When it’s dry, I rub with a little oil and let it be.",
        "I have several Lodge skillets as well as two Griswold skillets from the 19th century. The Lodge products seem to have gone a bit downhill in quality over the years. They do not season properly as my older Lodge skillets did. In addition, the heat distribution of the 8\" pan is rather uneven. I have replaced that pan with a 8\"French Chasseur Pan that is more than perfect. Eggs actually do slide out perfectly (it looks like a tv commercial!). It is a bit expensive at $113.00, but after spending a lot of money searching for a good pan, I am very happy. I have purchased one of the expensive pans for each daughter.",
        "I love this cast iron skillet, I have used it many times since buying, and it has been amazing and made such a difference in my cooking. I have recently started switching what kind of chicken I buy to be able to have it cooked with crispy skin in the skillet. Note to self though, do NOT cook anything with honey or any sort of sugar in the skillet, as the first recipe I cooked in it I burned the crap out of the pan, and thanks to some careful doctoring by a friend's father, was able to fix it.",
        "Good quality cast iron, like most other lodge products. However, the pre-seasoning on my pan was basically useless. Super rough on the bottom (moreso than other new lodge pans), food stuck badly even with lots of oil. I decided to sand down the bottom and re-season the pan myself. I wipe the pan with flaxseed oil and bake upside down in a 450 degree oven for 1 hour, and repeat this a few times. Requires a bit of time and effort, but food no longer sticks at all now, and the pan should last forever! So overall a good bargain purchase, it just takes some work.",
        "Skillet seems fine. Definitely big enough. I'm glad I didn't order the 13\" one. Unfortunately the silicone handle is a joke. Is not in the least bit tight. The handle rotates inside of it (see video). No better than an oven mitt. And it is an inch longer than the handle. My lightweight 10\" pan has a handle almost twice as long (see photo). I don't know why they cast it so short. I may see what I can do with wood. Don't know if the handle would get hot enough to scorch the wood, but at least I'd have something to grip. Or may return it. Cast iron part seems fine.",
        "Lodge products are my favorite. This skillet was lager than I visioned but it is perfect for what I need. I cook for 7 other people in my house so when I make fried chicken I can fry 16 legs or 11 chicken breasts. It also is great for baking a whole chicken in the oven, a full roast. Overall, everything I have ever purchased from Lodge has exceeded my expectations. I will not ever use cast iron from another manufacturer. With out a doubt, the best!",
        "Had to return the first one because of 'skips' in the finish on the top edge, but was an easy return (had UPS pick up) and was promptly replaced. Had been wanting a 12\" skillet for some time as the 10\" I had just wasn't quite big enough for my purposes. Will use this skillet for years to come. Perfect for cooking steaks. Better than on a grill or in any other type pan/skillet. I preheat the skillet (in the oven is easiest), sear the outside of the steaks, then continue at medium heat until desired internal temperature is reached. Clean up is a breeze and as with any cast iron, re-season lightly.",
        "I was pleasantly surprised at the quality of this cast iron frying pan for this price. I cleaned with cast iron cleaner and dried thoroughly. Then I seasoned it three times, letting it cool down completely each time. The first cornbread I made slid right out beautifully, no problem. The pan already has a dark patina from the seasoning and that will continue to improve as time goes on. I bought this pan primarily for baking cornbread because you can't beat cast iron for that. Lodge pans are high quality and they are known to outlast their owners and get passed down from generation to generation.",
        "I've had several cast iron skillets over my lifetime so don't understand why I am having so much trouble with this one. I use a low slow heat and it's supposed to be pre-oiled and I add a little more oil yet everything sticks to it! The surface of this skillet seems to have some kind of texture that I do not recall being on cast-iron skillets of the past so am wondering if that's why I'm having problems.... I'm sorry I bought it.",
        "I love this skillet. Usually you have to season them when you purchase, and the process by which I season requires it to be set in the oven 5 times (with flax seed oil), but I only did it the one time and it needed no more seasoning. So basically this is truly a preseasoned skillet, which I've never actually found (they all say they are preseasoned, but you still have tos season them). The skillet performs very well and for such a small size (8 inch), it holds quite a lot.",
        "This is the one and only cast iron skillet to buy. It's the best one I have ever used out of all my skillets. It's made in the USA and this is one product that is made right. I will be ordering all of my cast irons from this company ONLY. Already pre-seasoned and ready to cook in. It's nothing compared to the skillets you buy from china. Those skillets from china are NOT any good, which I had to throw OUT. Rusted with some sort of a red tint. Cheaply made.",
        "I had my first Lodge for 40 years and still going strong and very well seasoned with age . Just could not pass up this newer version with a convenient little handle across from from the main handle which makes it easier to drain grease . It comes pre seasoned and I tested it out on my expensive filet mignon. The steak was perfect and the heat was evenly distributed. It was so easy to clean and and just added a touch of cooking oil the next time . I originally received my first years ago as a bride years ago , and am ordering as Christmas gifts for my grown Kids .",
        "I bought this skillet to cook some steaks (starting in the pan and finishing in the oven) and this pan was perfect! It arrived in good condition, was simple to use (it can get hot while cooking— be prepared with oven mitts!) and even easier to clean. I think this is the perfect skillet for young adults who want to start building their cookware collection but don’t want to break the bank doing so. It’s sturdy, affordable and big enough to cook steaks/eggs/veggies... pretty much anything you might want to pan fry under normal circumstances. Would absolutely buy another for a friend!",
        "I do not regret buying this item. Cooking food is easy now, I don’t have food sticking as often as I did before. I love this skillet so much, I purchased another one from the same brand in a bigger size. It does take a lot of care, easy to do, but not if your inpatient like me; this is not the kind of pan you let soak in water. Mine rusted a bit, but that was my own doing for not following the care instructions it comes with, but it was easy to restore.",
        "Have wanted a cast iron pan for a long time, finally got it and it’s a disappointment. There were scrapes all over after the second use, used only silicone utensils and cleaned it with damp paper towel, so I couldn’t scrape it. It just cracked. It heats up so much that even the silicone holder doesn’t help, you still can’t touch it. Really heavy and not comfortable in use.",
        "After using it for a week I have to say this is one of my best purchases to date. I see a lot of people complaining about it “sticking” and I would have to say that is user error. I put some olive oil in it and essentially cooked the oil then wiped it clean before the first use and it cooked my chicken wonderfully . If needed you could always put some water in it bring it to a boil and wipe it clean when it cools down. Just make sure to add a little bit of your choice of cooking oil after you clean it. I find it especially wonderful for making pizza, turns out perfect every time.",
        "My wife originally bought a \"value\" cast iron pan. She season and seasoned it. After months of complaining, someone finally mentioned that Chinese made cast iron pans are not of the the same quality as American made pans. We bought this pan and with one attempt at seasoning, she was able to cook eggs without them sticking to the pan. She was delighted. In the long run, it would have been less expensive to buy a quality American made product that works than to buy a \"low-cost\" product that doesn't.",
        "This is so adorable cast iron just like the bigger one I got smudging my home I got the idea from Patty from the g-team paranormal they're a little charcoal coals you could put in the pan light them they stay hot and you can put your sage on top and let it burn you can walk around the house by the hand the handle does get a little warm so you need to wrap something around it",
        "Exactly what I wanted, no issues with any of it, just as expected, and an ideal size for me to cook for one person (although I have a bigger pan that I use when making a whole meal in it!), heat up things, melt butter, cook an egg, etc.",
        "This is a very heavy pan that looks better than most cast iron skillets you find in stores. It is very heavy and holds heat well. I seasoned with oil and light heat and it provides a great flavor. Seasoning Steps: 1. Scrub skillet well in hot soapy water. 2. Dry thoroughly. 3. Spread a thin layer of melted shortening or vegetable oil over the skillet. 4. Place it upside down on a middle oven rack at 375°. (Place foil on a lower rack to catch drips.) 5. Bake 1 hour; let cool in the oven. Overall this pan is great!",
        "I bought this skillet for my mom who exclusively uses cast iron pans. She recently got a new glass top range and wanted to replace her smallest iron pan with one that has a smooth under side (no ridges). This product met that expectation, but has a very rough/highly textured cooking surface. We have seasoned it 3 times now but food still sticks to the pan. We hope that with continued use this problem will resolve but for now we won't be frying any eggs in it.",
        "Very rough cooking surface. Doesn’t wipe out easy and it says it’s pre oiled but your gonna wanna do it yourself. Spend a few bucks more and get a quality skillet",
        "Pros: works great with a metal spatula. Lots of room to fry dumplings. Cons: Very heavy. Takes a long time to heat up across the pan. Outer edges do not cook well on a regular burner."
    ]
}