{
    "entity": "Dutch Ovens",
    "text": [
        "I like the size and decided to buy one after seeing allot of YouTube videos I decided to make pineapple upside down cake upon waiting for it to bake I heard a weard piping coming from the pot after the cake is done I let it cool and went to wash it and noticed it is cracked from top to bottom and the return cost is nine times what I paid for the oven in my experience I don't recommend buying this dutch oven.",
        "I am so excited. I have lots of cast iron and several dutch ovens in my camping gear but needed something smaller for when I am not cooking for a big group. This is perfect.",
        "Good quality cast iron. As with all cast iron cookware the key is keeping them seasoned properly. Once seasoned you must watch how you wash them, (no dish washer, no soap, only hot water and a nylon scrubber works best for me) and re-season them after washing. Once you get the hang of it, it becomes second nature. Cooking with cast iron will also add dietary iron to your meals. I am low in iron but cannot take iron supplements as they upset my stomach. But cooking in cast iron helps keep my iron levels up.",
        "I like to make special dishes in the Dutch Ovens when camping with the Boy Scouts. I bought this one so I could make a Cherry Cheesecake. This product worked well and the cheesecake was very good. I also used this oven on the stove to fry chicken nuggets.",
        "This is a great little dutch oven. After comparing reviews of other brands I'm glad I decided to go with Lodge brand. It's a nice quality, and we like the size for our family of four and it works great for cooking with. At first we didn't follow directions about the coals on top/bottom and burned some meals. But with the cookbook and coals it makes some very nice meals.",
        "It cooks evenly, works very well for camping and cleans easily. We've made pizza, stew biscuits and breakfast egg bakes in it already. The possibilities are endless for what you can make with a little patience and creativity. Cast iron has so much character and will last many generations if you care for it properly.",
        "Lodge makes some awesome stuff. This is one of the many pieces I own made by Lodge. I love that it's made in the US. This is the coolest thing to have over a campfire. You can even use it with charcoal. Has worked great for fried cinnamon sugar donuts and mountain man breakfasts. Using the lid as a griddle is quirky, since it isn't flat on the inside. Definitely get the lid lifter and the lid stand.",
        "I own a lot of Lodge cast iron and usually love it but this dutch oven came with quite a few factory flaws both inside and out. It will take hours of sanding to get rid of the really bad flaws on the bottom of the inside. So now I realize why I got it at such a bargain price.",
        "I had a smaller dutch oven from when I was single and didn't need to cook a ton of food. Now that I am a dad with 5 mouths to feed, I needed to upgrade to something bigger. This is perfect. The deep version is great for large dinner type meals (stews, meats etc.), leaving the little one as a \"bread\" oven for desserts and breads. It came preseasoned which was nice since my old one didn't. Not hard to do, but I appreciate not having to do one more thing if I don't want to. Sturdy and as solid as my 25 year old one.",
        "As with all Lodge dutch ovens, it works well. It will last well into the next century and beyond if taken care of. My only complaint is that I will have to find a machine shop to smooth out the inside in order to have the wonderful surface of my Wagner 1920s skillets. The old cast iron was cast differently and as such, when cured, nothing sticks to them. I wish Lodge would have a smooth out service as an option.",
        "I have a 12\" dutch oven and love it, but most of the time it is bigger then I need. I bought the 8\" because I wwnted to be abkebto cook for 1 or 2 people at a time. I just finished a 7 day kayak trip and the 8\" was perfect. It fit in the boat easily. It used fewer briquets. It cooked evenly. This thing will find it's way in a lot more trips. By the way, my meals were drooled over by everyone on our trip. I almost felt guilty about cooking for just me, but you know COVID and all. LOL.",
        "I have many cast iron skillets and dutch ovens. This is my first Lodge dutch oven and upon opening the package and looking at it there were rust marks all over it along with the seasoning being chipped in multiple spots. On top of that it looked like the oven part had been dragged on both sides by the rim. Not sure if this is a lemon i got but make sure you check your product when you get it!",
        "After taking a dutch oven cooking class at the U. of Scouting over the Winter, I was very excited to finally make this purchase. I've had it for just under a week and already used it 4 times. My scout den was here last night for a camping trip planning meeting, and we made up some monkey bread on the campfire to enjoy while we planned. This dutch oven is very well made. Having a few cast iron skillets by Lodge, I am very confident that with proper care, this dutch oven will l last a lifetime. Excellent investment and I highly recommend for anyone who is interested in cooking outside.",
        "this is big, great for a family cooking over fire. will buy a smaller one. it is too big for just the two of us. was able to bake cornbread in it but it did burn on the bottom a bit. be ready for a heavy, heavy pot with this size!",
        "It's a lodge. Finish is a bit rough and if your so inclined to strip it down smooth it and reseason it, no judgment from me. For my needs it's fine. I have a wagner pan that is glass smooth as pans should be for an oven I'm not as picky. It's big enough to serve 4 adults some stew with a side of biscuits and nobody leaves hungry. May feed more or less depending on your use. It is otherwise a good piece for the camp kitchen, the new standard. Not the best in every class, certainly takes the best overall.",
        "I'm new to Dutch oven cooking this year but trying new things since we're quarantined because of covid. This oven works as many youtubers show in their videos. Follow the charcoal recommendations and it works. I've roasted chicken, Chuck, beef stew, and campfire peach cobbler. I also use it over a propane turkey fryer burner to deep fry French fries and onion rings. Does a decent job keeping the oil temp steady given the volume of oil it can hold.",
        "i like the size of this pot. perfect for two people. it's supposed to be seasoned, but don't think that food will not stick to this pot. i burned meatloaf in it and after soaking, scrubbing and screaming for three days, i sandblasted the burnt residue off of the inside. now it's nice and clean and i will season it myself. it's great for cooking over a campfire. It's affordable and just plain fun..",
        "I probably own at least 30 pieces of lodge cast iron! It's high quality and American made. The customer service in my experience has been often. I had an issue with one piece I purchased where the coating was coming off. I emailed them. And they called me back! They were so nice and helpful. It's good heavy cast iron. You can easily cook on modern cast iron as well as grandma's cast iron as long as you are patient and willing to learn how. It's easy to maintain and when properly cared for will last a lifetime. I highly recommend lodge.",
        "This is my first type of Dutch oven. The finish on the inside is a bit rough but have no issues with things sticking and it cleans up nicely. So far we are quite happy with the Dutch oven. It’s a nice size for 2 to 4 people. We made a pot roast so far and pineapple upside down cake everything has worked out great. In my opinion it’s a great plan for the money and quite sturdy",
        "The inside of my cast iron pot is deeply scratched on the inside. I am returning it.",
        "This is my first time using a Dutch oven for camping. It was awesome. I did buy the liners and made a campfire cobbler which burned a bit because of my heat source - but cleanup was super easy. And the cobbler got rave reviews. Worked on the camp stove and in the fire. Rugged. Solid. Built to last. Caution- take something to lift off lid or to grab the carry handle as they understandably get hot in use. Also- lid can double as a griddle. Small but effective.",
        "Same Lodge quality as always. Broke it in by braising and stuffing a three pound tri-tip in on top of a bed of sliced onions. Stacked my six inch Lodge (bought before they were discontinued and became expensive treasures) filled with scalloped potatoes on top and they both came out as only food cooked in a Dutch oven can come out. The next morning, I filled ithalf way with oil for french fries and made some gravy from left over from the tri-tip for a routine and scrambled eggs breakfast.",
        "Never used a Dutch oven before. After watching a you tube video I decided to give it a try. Made baked beans for a picnic. Then made a breakfast in it the next morning. Good heavy cast iron. Didn’t burn the food but I paid attention to the heat. Not a set it and forget it cooking style but if you are into outdoor cooking this worked good.",
        "Great little oven. Perfect size for two people. I don’t know why it was so hard to find one this size. My wife and I have made breakfast bake, cobbler among other things in this and we would even have a little left over. Solid and durable. My only complaint is the handle. I had to bend it a little so it would hinge down. Out of the box the handle would stay more upright and would be in the way.",
        "This dutch oven was ready-to-use right out of the box. All I needed to do was wipe it out with a damp cloth. I did apply a coating of vegetable spray before baking some pre-packaged cinnamon rolls using charcoal. They couldn't have come out better if I had used a non-stick pan in a regular oven. Clean-up involved using some hot water and a plastic scraper to remove a bit of residue and then wiping with a dry cloth. I used it again the next day to make biscuits; again no stick and easy clean-up. This is an ideal size for meals for one or two people, and it doesn't take up a lot of space.",
        "I now own three Dutch ovens and a plethora of other cast iron cooking gear. Lodge is the best. I highly recommend the 12\" deep oven for your first, or if you only plan on owning one. Most recipes call for 12\", and the deep version allows for baking cakes and bread.",
        "Bought this for my Mom, and she loved it. She says that it does get heavy with food in it, and it can be difficult getting it off the fire as a result.",
        "My son did chores around the house to earn enough money to get this dutch oven. It was the only one he wanted. Nothing too much to say in a this review - if you have ever used a dutch oven it is exactly what you would expect of any Lodge product. Perfect size and coming preseasoned is a great bonus. It saves time and when you have a 12 year old chomping at the bit to make brownies in it as soon as it arrives at the front door - it works out perfectly.",
        "I live off grid and OMG this thing bakes and roasts just as good as any electric oven. I fist learned about Dutch ovens in a camping video.. once you learn how many hot charcoals to place on top and below, then you can pretty much control the temperature. Along with my solar oven this helps give me more options.. and.. I can bring it along when I go camping.",
        "Solid construction as expected from Lodge. Perfect size for feeding a group of 5-8 adults. With proper maintenance this Dutch oven should last several lifetimes. For ease of use I recommend getting accessories such as the aluminum foil liners, Lodge A5-11 4-in-1 stand, Lodge A5DLL lid lifter, Lodge A-CARECP1PLT cleaning and care kit.",
        "This is my first Lodge 12\" Dutch oven. I just love it. Easy to use if you follow the directions for the food you are making. First try was a cowboy stew and it came out just perfect. Better than the one I tried on the kitchen stove. Clean up was a breeze. I loved this one so much I went out and bought a Lodge 10\" camp Dutch oven kit with a 10\" cast iron frying pan! I'm the cook for the hunting camp so these are gong to come in pretty handy. Can't wait to go camping.",
        "My husband went to a Scout training for leaders where he saw this in use and fell in love! He had no idea you could make so many things with it! During the training they made a cake in it, and after he purchased it, he immediately used it to make a batch of brownies. We had already switched to cast iron cooking in our house, so we were not intimidated by this. The legs are a necessity for outside use.",
        "I absolutely love my dutch oven! If you are camping and you are a foodie this is definitely for you. To keep it at 350 degrees put about 10 charcoal size coals under it and 18 on the lid. Things will bake just as good or better than they do in your home oven. We have made biscuits that are better than what I can make at home and apple cobbler to die for! I highly recommend this for outstanding camping food.",
        "The lid arrived without one side of the handle attached and it's now incumbent on me to attach it. Disappointed, especially after reading about the integrity of the brand in their \"Camp Dutch Oven Cooking 101\" pamphlet. Off to find some pliers...",
        "Fantastic to use! My son used it every day on his two week road trip. I had wanted a Dutch oven for years, but, thought the large ones were a bit too big for our use. This 2qt. one is PERFECT! The right size two people, or a small family, who aren't cooking for a whole scout troop.",
        "When I took the Dutch Oven Cooking two-hour course at our church, the leaders recommended Lodge Logic over any others (even if cheaper). We bought this for the long term. I learned so much about Dutch oven cooking and care of the oven here, how to stack with coals in-between, etc. There were about 7 Dutch ovens and recipes, about 7 teams and 15-20 people. We learned to line with aluminum foil to preserve the oven and make cleanup easier. Our casserole received outstanding reports and tasted delicious. So Dick and I recommend Lodge Logic Dutch ovens! We are thinking of getting a smaller one too, say for gluten-free cobblers and cornbread! Alice from Dallas",
        "Anything Lodge is a great product. Its made in America. China made cast iron cookware will warp, crack and is simply not worth the money. You'll be doing yourself a favor by going with Lodge.",
        "We bought this size DO because there are only the two of us on most camping trips. Used it daily for the last week on a trip and it was absolutely a perfect size for us. Made lasagne, biscuits, casseroles, etc. We can also see how this size will work well for family gatherings for special things without any left overs. And it's Lodge and that by default makes it a well made beautiful DO. Beautifully pre seasoned and ready to go out of the box. Definitely recommend this, especially if you are cooking for a smaller group.",
        "I don't think it's possible to cook something in here and not have it taste amazing. Great oven, excellent quality, lid fits tight, legs are long enough to bring it up over the coals. We have made cobler, enchiladas, pull apart bread, beef stew, and a couple breakfast casseroles. Everything turns out great.",
        "Camping and want to bake well don't leave home with out you Dutch oven. Also don't buy a cheap crappy oven. Buy an American made product the Lodge Dutch Oven. Wonderful cast iron products. This oven made wonderful white chili, biscuits, cinnamon rolls, and pot roast. This made camp cooking fun.",
        "I bought this Dutch oven specifically for camping but we’ve actually used it in the backyard at home. It is a quality product as I expected from Lodge. I wouldn’t really use it in my kitchen because I have an enamel coated Dutch oven but it could work on my stovetop.",
        "This dutch oven is worth the price as NONE of the other companies are American made. I made one of the most stunning pot roasts over an open fire with this baby and it came out beautifully. Large enough to handle a 4 pound roast with 8 onions, 3 carrots, 2 cups of red wine and a quart of beef stock. YUMMY!",
        "Not much to say, it's a Lodge dutch oven, find some fun sounding recipes and go at it! This is a good size for two families (8 people) but a bit large for going by ourselves, just the 4 of us. May look at getting the next size down. Visit the Lodge site and see the difference between the deep and the regular dutch ovens. One is better for baking, one is better for other cooking (stews and roasting and such). If you are going to do a mix of cooking and only want one, get the regular depth ovens like this one, they allow you to brown the breads and baked stuff easier.",
        "love this one! I wanted it so much to make bread on open fire. Shallow works best for biscuits and bread as the heat on top is closer to the food! Plus it doesn't weigh nearly as much as my next larger deep one!",
        "Love Lodge products! I have several Lodge pots and pans and really like them. I use them a lot and also take them camping. They're great if you know how to use and clean them, which is fairly easy to master.",
        "Great Dutch Oven! Just purchased two of these for BSA Troop 996 in Alexandria, VA. The Scouts used these for the first time at National Capital Area Counsel's Goshen Scout Camp Bowman. These Dutch Ovens only get better in time. They are easy to clean and maintain. My only suggest is that if the recipe calls for foil, do not use the foil as a liner. As a long time user of Lodge Cast Iron Products, they will last generations.",
        "I use this in conjunction with the \"outdoors gourmet's\" \"youtube\" recipes I have a couple of faves but this thing is awesome for midweek meals. try the chicken and biscuits recipe`",
        "I use this wonderful Lodge Dutch oven for motorcycle camping. Being retired ... I do a lot of camping and it is wonderful to be able to have hot bread, bisquets, chile, stew etc. Just the right size for one or two persons. It arrived pre-seasoned which was a real plus. Easy to clean up. I use the Dutch oven with charcoal briquets, only takes about 12 - 16 to make bread or chile, stew etc. If you like to camp .... make room for this wonder ... it is quite small but makes 2 quarts. A gallon plastic zip lock will hold enough charcoal for a three or four day camping trip and fits right inside the Dutch oven.",
        "I ordered this on thursday/friday.. it shows up on Monday.. lighting fast shipping, its cast Iron so its obviously high quality. My only regret is not thinking longer harder about how big i should have bought. I purchased the 8 quarts and after giving it a good long look i probably should have went for the 12 quart.. you have a large camp or a large gathering and 2 gallons can go quick.. now if your looking for a midsized camp pot.. look no further. I should also add that this is quality cast iron, if taken care of this will outlast you and most likely your kids.. this item could easily be passed down through generations.",
        "This is an excellent cooking implement. Comes ready to go, but you can season it again if you like. I did, but I don't think it was necessary. This is one of the best ways to cook a meal outdoors. One or two of these and a good frying pan and your good to go for any camping trip on which can afford the weight. Smooth casting, well fitted lid. No apparent inclusions. Legs are a must if you plan to use this outdoors. The bale is sturdy and easily supports the weight of the oven. Good introductory book on how to use the oven and some recipes as well.",
        "I followed a recipe from a video on You Tube. It was great being able to do go outdoors and cook a meal. Mine was a chicken nested on vegetables. I sat there reading a book and would do, as you are suppose to, turn the lid 1/4 in one direction and the pot in the reverse direction. Also had charcoal ready from my chimney starter to add more brics. It was fun. I look forward to making biscuits and one recipe for apple pie. By the way, the lid fit tightly on the pot. No issues here in regards to that.",
        "This is my second one. First one have had for years and works great. This one is for my son. I'm sure it will serve him well for years.",
        "Wonderful dutch oven, but man it is heavy!! Warning..do not hit your hubby with this or you might give him brain damage...seriously...",
        "I bought this about 2 yrs ago. Sturdy, durable and easy to maintain. We LOVE to cook in our dutch oven over the campfire! It's so cozy to see it hanging on our tripod and fun to cook in. This 8 qt one is big enough for me to make beef stew for my family of 5 plus our friends who camp with us (up to 9 people total so far). It IS hard to clean (especially while camping) and even HARDER if you don't clean it right away so make sure you at least rinse it out as quickly as possible.",
        "One of several Lodge items purchased as Christmas present for my grandson, He loves cast iron, and Lodge is tops in that category -- especially for camping. He was thrilled! Has used this several times and has adlibed a bit. Has had some great successes and a few failures. Success or failure, he having a ball with it!",
        "You just can't beat a high end high quality cast iron pot for camping or cooking anytime! This pot will be well loved and well used for years to come!",
        "Nothing beats some old fashioned dutch oven cooking with charcoal! Lodge makes an excellent cast iron product, don't settle for less!",
        "Got it just in time for my trip. As long as you got a good heat source it works out well. Got the 10qt because that was the only one available. I’m really impressed by its size. It works out for big groups. I also really recommend you get the lid hook that helps you remove the lid while it’s hot. You can also use the hook to remove the whole cast iron if you don’t have flame retardant gloves.",
        "with 3-4 folks camping, i struggled with 4qt vs 6qt. The 6qt 12in is pretty heavy but is perfect size for our campouts. The 4qt/10in would have been too small. The instruction book and recipe book were excellent in getting us started. The lid that holds charcoals is a must since most recipes call for coals to be on the top and the rim around the lid ensures easy placement. One thing they do to help you get consistent results is to use regular charcoal briquettes, this made our first few tries successful. Lodge Logic quality speaks for itself.",
        "What a great pot and a great size. I fed 6 adults and three children a tasty dinner from this pot, and also made a yummy breakfast casserole.. I've really been enjoying this size - I have a larger one that is just too big unless you have several more people. I hope to pass it down to my children, and that they will pass it along as well!",
        "This is the perfect size for one person (8”). It’s the typical current production Lodge, slightly rough finish that could probably use some additional smoothing, but I just put it to use as it came. I’d definitely buy it again",
        "Before selecting this Dutch Oven for my camping trips, I read many, many reviews. Everything I read highly recommend Lodge. After a summer's worth of use/abuse, I have to say it lives up to all the hype.",
        "This Dutch oven is excellent quality. I purchased the lid tool and the tool that raises this Dutch oven off the ground. The food it makes is delicious 🤤",
        "Great product, it arrived factory seasoned and ready to go. I bought a carry bag and used the dutch oven on a weekend camping trip and it work great",
        "Its exactly what you'd expect when you buy a lodge dutch oven. Works great, and if your food doesn't turn out good your the only one to blame.",
        "My husband was amazed with the food I made during our recent week long camping trip. It was so nice not to have to grill everything! He can't stop talking about it. Flavor of food was excellent. It came with a small cook book, from which I tried a few recipes. Very easy to use. Cleanup is ok but once you taste the results, you won't mind the additional care it takes to keep clean.",
        "You can basically make anything in this. I’ve made pizza, cake, and cornbread, just to name a few. Seems sturdy and is easy to clean",
        "I have always been pleased with lodge products and this item was no different great quality for the price",
        "By far one of my best purchases. So many uses and the shipping was prompt and free with Prime. Love cooking with cast iron.",
        "We bought this because our 5 quart was just too big for the two of us. Now we can make smaller dishes so no leftovers to toss when camping. Lodge quality and durability!",
        "Received product and box was totally intact. No spots, tears, holes or anything. I take it out to season and there is rust in the bottom. (Wish I would have taken pic before I cleaned). Also noticed some chips and imperfections in lid and oven. Have ordered Lodge products before and they came immaculate. Hope I didn't receive used product, because I didn't order used.",
        "My husband is an Eagle Scout, a professional camper!, and this was his oven of choice as it has the raised rim to hold the coals very well. He loves this product!",
        "This purchase was #8 2qt. camp oven from lodge. Arrived in perfect shape, no cracks or dings. Made with the same quality that I've come to expect from lodge. Made in Tennessee where I live. Very satisfied and would recommend.",
        "This is perfect for 2-4 people when you need something a little deeper than the standard DO. Have cooked whole chicken and ham shoulder and my favorite pigs in the corn field (recipe is online). Cann't go wrong with Lodge quality. Got good price from Amazon.",
        "Always loved Lodges products. So I bought this for my smoker and cook cobblers, mac and cheese and more directly via my smoker.",
        "Fits in my mini max big green egg. Cooks great. Mac and Cheese that we did in there was delicious!",
        "Fit and finish on this product is great. Cooked in a few times and it does a great job. Have another larger Camp Chef and thought that was great but this one is a little better for fit and finish and I have used it to cook in the oven at home and carry to dinners or lunches. Fits in on buffet line and gives your dish a little rustic charm. Have not used it with open fire yet. The Camp Chef does great so I'm sure this one will as well.",
        "Lodge Dutch ovens are one of the best current production ovens. I cook 10-12 cobblers at an annual event using only Lodge ovens. They seal well and distribute the heat evenly. My cobblers always turn out great and are a crowd favorite. I highly recommend the 8 qt. deep oven. More room for larger meals.",
        "Cooking with a camp dutch oven is an art, and the best way to improve your skills is to just keep doing it. We have a 12\" and a 10\" with offer nice cooking versatility. Lodge pots are high quality and good value.",
        "Ordered this for our camping trip over this Labor Day weekend. Made chicken and rice for our first try. Turned out to be the BEST chicken and rice I've ever had. Then we tried a blackberry/peach cobbler and it was good but will need to find another recipe for the batter. Really liked this item. I need to order another one that is smaller. This one is perfect for family of 4. I need something for just 2. Easy clean up and wiped down with oil. We will enjoy many meals camping with this.",
        "Love my new Dutch oven. Immediately made beef stew in it over hot coals. The stew came out perfect. The Dutch oven arrived to my house quicker than expected. Great seller!",
        "Bought for my step dad and he loves it. It even comes with a little cookbook",
        "I’ve waited a long time for my Dutch Oven and it was worth it. Cooks stew perfectly and is a breeze to clean. Will also take camping when the weather breaks",
        "Having never used a dutch oven, we were leery. However, we ended up cooking all of our camp meals in it and were very pleasantly surprised. I was REALLY surprised at well it cleaned up without scrubbing. Its my new favorite camp tool!",
        "We use this one with the legs in our outdoor fireplace. Works great.",
        "This is the best dutch oven for camping. It cooks casseroles, desserts, and soups perfectly. For easy cleanup, order the aluminium liners, they are a lifesaver!",
        "Got this for my daughter who like to cook in an open fire. She loved it.",
        "The Lodge Logic 8-quart Camp Dutch Oven's quality is very good. The lid fit the Dutch Oven very well that it retains the moisture. Excellent for cooking foods that are desired to be tender. After seasoning the Dutch Oven, cleaning is easy and quick after cooking a meal in the Dutch Oven. It fares better than the non stick cookware in terms of ease of cleaning and quality. If you take good care of the cast iron Dutch Oven, it'll serve you very well and your generations. Foods tastes better cooking in the Dutch Oven than a slow cooker.",
        "This Dutch Oven was packaged great, came seasoned and is the Deep oven, which is more versatile. Lid fits great, it came seasoned but I still washed it and then seasoned it again, kind of my thing! Great oven!",
        "I have the 2, 4, 8 Qt Dutchies now, along with a few covered pans and pots. All Lodge. My 2 Qt is by far the most often used. The most versatile for small meals or single side dishes. There's no better beans than a can of your doctored favorites cooking slow over the fire while your out being a lumberjack or something. This one works well under a small campfire. Of course you'll need tools to really get it right, so read my other reviews if you like, but buy this Dutch Oven.",
        "I have been using Lodge dutch-ovens for years with the scouts. I have not replaced one in the past fifteen years. Once you get the boys cooking in these ovens they want to cook all their food this way. I would recommend that you cook bacon in your dutch oven prior to camping as it will season it a little bit better than already seasoned. The additional purchases have been made to add to the patrols gear. Each patrol has between 2-5 dutch ovens each. They are easy to clean and maintain The oven retains heat versus similar ovens.",
        "I like the compactness of a 2 qt. Will have fun camping and making smaller portions.",
        "This was a pre-birthday gift for my husband. We were going camping and he was planning to make our other Lodge dutch ovens work. The dutch oven arrived just in time. He was planning to make cornbread to go with his sweet potato chilli. The cornbread turned out perfectly. He can't and we can't wait for the next treat, it supposed to be pineapple upside down cake. We don't even have to wait for the next camping trip, works fine on our charcoal grill.",
        "Probably the BEST buy I have made in YEARS!! Love this oven.",
        "We seasoned it the evening before use first time just to be sure it was ready. Made excellent lasagna for dinner. Planning to buy a small one too.",
        "Makes me look like Gabby Hayes cooking up a storm for Roy Rogers out on the dusty trail. I don't know why people think a Dutch oven is a mystery and something to shy away from. They're always amazed at how great the biscuits taste, as well as the stews and other concoctions that can be created in this wonderful, versatile utensil. And of all of them on the market only Lodge gets my vote...been that way ever since I was a boy scout. Just common sense to me, that's all.",
        "Heavy iron oven that really holds the heat. This one is sized perfectly for 2 or 3 people. You can put it on the coals of a fire pit, and it retains the heat so well that you can take it off the coals and cook in it. The lid seals well to keep ashes out. So you can get rid of your stick pile and use the free energy to cook dinner too. When it is still hot I rub it down with olive oil and put it away for next time.",
        "Super product high quality did a great job. This was perfect for 2 people I used it to make biscuits on the camp fire and it worked great. The pot also holds heat for a long time after the fire dies putting out a lot of warmth. The feet leave enough room to push coals under and lid is nice and tight keeping any coals you put on top from getting inside the pot.",
        "I use Lodge cast iron for camping mostly and it works great. I haven’t had time to do a proper seasoning but they work great right out of the box.",
        "What can I say it is an American made Lodge dutch oven. These shorter ones are better for making breads and biscuits in as the heat on the lid has less distance to travel to the food."
    ]
}