{
    "entity": "Dutch Ovens",
    "text": [
        "False represented !!! lodge says made in America but in the small print this product is made in china. Their enameled stuff is all china made trash. If I wanted china made trash I would not have paid more for what was represented as made in America . If I had realized this was china made trash before my return window expired I would have RETURNED it.",
        "If you like FLAMES with your chili - this is the pot for you. Seriously, the paint melted to my stovetop and caused a fire. My husband and I received this as a wedding gift and have used it around 5 times to make different things. I was making chili in it today and had it on the stove at medium heat with oil in it when suddenly it bursted into flames. This is extremely upsetting to me and it has caused damage to both my stovetop and made my pan unusable. I'm unsure if this pan just malfunctioned or if something is wrong with all of these products.",
        "It looks great and wished i could keep it. The concern is it's made in China... concerned with the enamel being toxic possibly. I will have to return it and hope there's not hefty shipping charge.",
        "This has become my go to cooking pot. It does everything. If you are limited on space throw every thing away and get this Dutch Oven. I have cooked pasta, fried sausage, eggs and stir fry. Makes great pot roast in the oven. Works on all cooking surfaces, glass top, gas, and induction. This is an update. This pan lost it's enamel shortly after the first month of use. It became impossible to cook anything , except water without it sticking. Terrible investment. Apparently not a flawed item, as I bought a smaller size and the same thing happened. Buyer beware!",
        "Amazing Cast Iron pot. The quality is superb and the metal is heavy but practical. I used it to bake artisan style bread a couple times and the results were just as if I had put my bread in a brick oven. The color is fantastic and bright. Don't worry if you put it in the oven and heat it up and it turns a dark angry red color, it will eventually turn back to a bright red when it cools down. The enamel non-stick surface is so easy to clean, I don't know why I didn't buy this before.",
        "this is a great cast iron dutch oven, but i think that there's a few things to note about it: 1. The bottom of this dutch oven is more rounded than one would expect. 2. The exposed cast iron edges need more maintenance than one would expect with an enameled cast iron dutch oven. These aren't necessarily bad aspects, but aspects to note. Personally, I would like this product more if the bottom was flatter for a more even cooking surface.",
        "I was really excited to receive this and impressed that it was made in America. I really try to refrain from buying products from China, especially with this recent political turmoil between Canada and there. Lodge is extremely misleading. I was incredibly disappointed to see MADE IN CHINA in bold letters as soon as I opened the box. I feel that as a company they do this on purpose to sucker those like myself into buying their products. I will be sure to never make another purchase from Lodge nor would I ever recommend anyone buy from such a dishonest company.",
        "Wish I had better things to say about this, as I was super excited to purchase. While the functionality of Dutch oven is fine; I’ve maybe only used it 3 or 4 times because EVERY. SINGLE. TIME. I’ve used it, no matter how delicately it was handled...it’s chipped. That is the nature of these coated pots I assume, but it looks horrible and when you pay this much money for a pot, one can’t help but to be pretty disappointed in the purchase.",
        "3 stars instead of 5 because the lagoon color is VERY different than pictured. The picture shows a rich green/teal that I was very excited to add to my warm kitchen. The true color is a drab, cool blue with not even a little hint of green. I double checked and the box says lagoon and I didn't see another color choice like it so the photograph is just misleading. If you are looking for a cool blue this may be for you.",
        "The product description and company description would lead one to believe that this product was made by a family owned business with two US foundries. The fact of the matter is that is blatantly FALSE-the product is shipped in a box which is boldly marked MADE IN CHINA. The fact is there are many great quality products manufactured in China and although this might be a great product, customers deserve to know the truth.",
        "So the reason I buy lodge is because it’s made in USA I’m not too impressed with the fact that a red enamel Dutch oven is made in China too close to Christmas to send it back I am very displeased with the fact that this is made in China",
        "I was looking for a good Le Creuset alternative, and I'm very, very happy with this purchase. With Le Creuset, sure, it's nice, but you're spending hundreds of dollars more for a brand. The difference between the two? Marketing. This dutch oven does exactly the same thing. I've tried a bunch of different recipes in this pot and it all came out perfectly. Heavy, durable pot, gorgeous colors. Highly recommend.",
        "I have been using my Lodge Dutch oven since July 2019. I bought it primarily for artisanal bread baking. It works very well. Heats evenly and cleans up beautifully. When I was initially shopping for another dutch oven, I agonized over whether I would regret getting what initially appeared to be a cheap knock-off. My angst was for naught, as it works as well or better than my much more expensive Le Creuset. I have also used it for Beef Bourguignon and other slow cooked dishes with excellent results.",
        "Just received this product about 20 minutes ago. As soon as I pulled it out from the box, I noticed that one of the handles had a good amount of the enamed chipped off. Will return it and find one with better quality. Very disappointed.",
        "I got one year of use out of mine, using it maybe 3-4 times per week, it was been great but today the bottom exploded while I was sauteing some sausages. Definitely not a buy it for life item :(",
        "I ordered three of these Dutch Ovens one each for my wife, daughter and granddaughter for Christmas. They immediately became their favorite cooking pots. They love them! They are the perfect size for the three cooks who cook for three, two and one. And they are so attractive they serve directly from them on the table(s). Rarely do I find a present for the favorite ladies in my life that they love. These truly are great pots. The lid fits securely and the handles are perfect for handling hot. Given the raves I have gotten for these presents, I would recommend them to anyone, but especially to guys who have no idea what to buy their ladies for Christmas.",
        "I’ve loved this product! I had a Lodge cast iron dutch oven (without enamel coating), but it was tough to keep clean, so it retained scents and transferred them to food I cooked. I decided to get an enamel coated dutch oven was tempted to get a Le Creuset, but am glad I stuck with Lodge! There really is no need to spend the money on Le Creuset for a dutch oven—the Lodge is great. It’s easy to clean and maintain, cooks evenly and distributes heat well. I’ve had my Lodge cast iron skillet for a decade, and plan on this dutch oven lasting just as long.",
        "Had a fifty year old set of Le Creuset that can't be re-enameled and has lost a lot of enamel on the inside. Replacing them would be price prohibitive - saw this and got it for 1/8th-1/10th the cost. It looks good and there are none of the enamel problems (bare spots) that some reviewers noted. I only use cast iron now, whether for cooking stews, roasting chickens, or frying (I have fry pans). Love it, and love this line - only wish it was made here, which I thought it was, but its from China.",
        "Got this for my mom to replace her 20+ year old MADE IN USA Dutch oven. She did not want to settle for anything other than German or made in USA, so we picked this guy out because it was supposed to be \"PROUDLY MADE IN THE USA\". She was \"slightly angry\" to say the least when she got her Chinese as she called it junk.",
        "Bought this item as a Christmas present at the beginning of December, it was opened on Christmas morning and much of the enamel was chipped off the exterior and now amazon is refusing to allow me to return an item that came damaged even though it is within the 30 day return window.",
        "Somebody needs to foreground problems with the Lodge Dutch Oven. I have ordered one twice in the last year - both times it has arrived with a large patch of bare iron (no enamel, so major rust problem) near the handle. Obviously there are production issues with the enameling, and quality control is not doing its job.",
        "A great Dutch Oven with one drawback: after washing it with soap and water, rinsing, and drying, the first trip into the oven left it with tiny black spots all over the lid, and the pot--inside, and the outside. It took considerable elbow grease and a Scotchbrite pad to get it back to normal. Be careful of your first trip into the oven--I don't know what they coat these things with at the factory, but soap and water doesn't touch it, so expect some black burned spots.",
        "Arrived badly damaged. Chipped and rusted on the outside of the pot surface upon opening the box. Also there is a small crack on the inside of the pot. Worried about cooking in this and eating enamel in the food. Very bad quality. Do NOT recommend. I hope I get a refund for this so at least I can be satisfied with the customer service.",
        "Why would you pay over $300 for a European model when you can get the same basic thing for well under $100? Just made chili in my 6 quart enameled dutch oven. I like to do stews and such in the oven in a dutch oven. I haven't been able to do any stews with tomato or chili because of the acid in the tomato sauces and such. It wreaks havoc on regular cast iron and makes the food taste funny. Now I don't have to worry about that! Fantastic product! Can't say enough good about Lodge products!",
        "Well I was disappointed to get the box and see made in china printed on the side. One of the reasons I buy (or used to) Lodge is because it is American made. Now apparently even Lodge has outsourced manufacturing. Disappointed, wont buy new Lodge anymore.",
        "Best cookware purchase in YEARS!!! Looking for a simple stockpot, frustrated reading negative reviews, expanded the search to Dutch Oven. Lodge has created such amazing versatile cookware with this enameled cast iron that breathes life into mealtime and is a blast to play chef with. In one night, functions included chicken sauté & pasta prep, kept warm for late arrivals in the oven; delightful participant in all activities .... how will the bottom look? Clean, new. How about the interior? Same, absolutely a breeze to clean. Thank you, Lodge .... 6 quart White Dutch Oven, LOVE this cookware!! And perfectly suited for our glass top stove!!",
        "On the Amazon site, Lodge states: \"Lodge Cast Iron operates two foundries on the banks of the Tennessee River in the small town of South Pittsburg, Tennessee; a town Lodge is proud to call home.\" I bought a Lodge cast iron pot - and on the box it came in, this is printed: \"Made in China\". So - why is Lodge making a statement which seems to imply it is American made?",
        "I love this thing. I mostly use it for bread; although the instructions say not to heat it up in the oven empty I do it all the time and have never had a problem. I also use it to make stews and rice and have never had a problem with food sticking to the bottom.",
        "Purchased Dutch Oven for making Sourdough Bread which requires 500 degree, one hour preheat. Turned out great. I've read some people had problems with finish. Mine has stayed like new through 20 loafs so far.",
        "Lodge certifies their enameled cookware to be lead free. This is a very good Dutch oven, with a metal knob that withstands high heat. The inside is like glass - very smooth - and food releases easily. The Lodge Caribbean blue is darker than Le Creuset's, and the cast iron seems a bit heavier than that of Le Creuset or Cuisinart, but it is very pretty. The pot is versatile - good for hot dish or roasting or vegetables. It heats super evenly, even if your oven doesn't (no more dry-breasted, raw-legged chicken). I can't afford LeCreuset, and the one pot I did buy from them on sale was not as nice as this one.",
        "The only reason I give this 4 stars is because the color is misleading. It's nothing like the picture. Beautiful, still.",
        "I purchased this in feb. it is now chipped in two places on the inside of the rim, Im not sure if we ate these chips or where it went. its odd because its on the opposite sides of the inside, just about squarely opposite. I had thought lodge carried better products than this, I won't be purchasing again. I expected it to hold up longer than six months. I went with them because of the name brand, I should have tried many of the other brands on amazons site apparently. I thought I was paying for the name and reputation. I guess not.",
        "This product is NOT made in the USA as stated in the description. Lodge claims a family based , proudly made in USA product for decades. Package arrived clearly marked 'MADE IN CHINA\" in large red letters and the brochure inside also says made in China. I support USA made products and would have never ordered it had I known it was made in China!!! Will be returning item.",
        "Perfect size. Much better for 2 people (still with lots of leftovers) than the 6, 7, or 8 quart models. No kneed bread recipes all fit fine. Its also alot easier to move around and makes me less worried for my glass top range and metal oven rack. I've got an 8 quart Martha Stuart one and while I like its features better (shape, lid basting rings, large flat bottom for searing), the thing is just too huge. This one actually gets used, looks nice, and the price is awesome.",
        "Where has this dutch oven been all my life? It's so versatile I am a little upset with myself I didn't have it sooner. I bought a dutch oven cookbook with this and it's such an amazing dish I seek out things I can make in it. I would advise to read up on the care of this dutch oven (comes with instructions) as they are particular in their care if you want your investment in it to last. Love it!",
        "I got my Lodge Dutch Oven on a Saturday and served the best post roast ever on Sunday. This oven really cooked the roast evenly and kept the roast moist, even the part not covered in liquid. I always wanted to own one of these and finally my dream is reality. Next up: BREAD",
        "At first I’m giving this product 1 star because I was under the impression Lodge was made in USA but this one isn’t. Should have done better homework... I’ll use it and see how it does. If it performs well I’ll update my review at a later time. UPDATE I used this and it worked great! Still not happy it comes from China but it does do its job well. 3 stars",
        "I've had this Dutch oven for a dozen years so far, used it at least weekly; baked with it, fried with it, made soup and casserole and curry and every other thing with it, and never once a problem. It's durable as a tank and versatile as Meryl Streep. If I was forced to have only one pan in my kitchen and give up all the others, this would be the one I'd keep.",
        "This dutch oven is excellent and performs as well as one three times its price. I've used it four or five times so far and it transitions from stove top to oven flawlessly. My favorite cooking in it so far has been skin-on chicken thighs, which turned out so crispy people thought it was deep fried. I've only had it a few months, so I'll have to wait to see how long the enamel holds up, but so far, I'm extremely happy with the purchase, price, and delivery.",
        "Things sauté quickly and nicely in this versatile pot. So great to have the ability to use on stove top, induction or in the oven! Even though I’m only cooking for two, I can make a smaller recipe just as easy as a larger one. The beef stew I made in this was the best I’ve had. All cooked tender without burning or getting dried out. Wish I had gotten it years ago!",
        "The enamel coating on the inside of this dutch oven does not hold up. There is a limited warranty but the company does not seem to want to honor that. I would never buy another one of these. Update: I contacted the company at their website and after some time, they have replaced my dutch oven. So their warranty and the company's reputation do mean something to Lodge. That said, I would NEVER use this again to bake bread. The high heat damaged the enamel coating irreparably.",
        "What can I tell you? It's a good pot...stews, chili, fish chowder, Hungarian mushroom soup, Cajun beans...this pot has seen it all in the few months I've owned it. Cleans up really nice. I get a good fond on the bottom going for some dishes and if I over do it and burn the fond, I soak the pot over night and the fond comes up. BY THE WAY...Enamel is basically glass. If you chip the inner surface with big metal spoons or spatulas, the iron underneath will eventually be exposed. At that point the pot is only good as a fish bowl for very shy goldfish... Use wooden spoons and spatulas people! Wood!",
        "After emailing and calling the company, I sent photos to which I was told Lodge would replace our chipped/blackened enamel cookware, which we have cared for per the instructions. Crickets. To be fair, Lodge makes decent, non-enameled dutch ovens and skillets for a fair price but the Chinese-made enameled stuff is junk. Staub and Le Crookset are expensive but supposedly the multi-layer enamel is more durable and both companies honor their warranties.",
        "I got this because about half the recipes that I use a pot like this for have tomatoes in them, and I got sick of re-seasoning my more traditional dutch oven. It is exactly what I needed, and pretty besides. My wife leaves it out on the stove because she likes looking at it. The company is very open about it being made in China. They even include the reason why they did it that way. I use my pots to cook instead of express my politics, so it didn't matter to me. Great product!",
        "I totally love this dutch oven! I never owned one before, but, doing so much more cooking now, I felt it was time to finally get one. I used it tonight to make chili, and it was such a joy to cook in. We eat whole food plant based, so I don't cook with oil. The vegetables cooked perfectly and evenly, without burning. I didn't have to stand there, constantly adding water and watching the pot the whole time. The heat was distributed evenly and worked great on my glass stove. I will be saving up to add to my collection, getting rid of my other \"nonstick\" pans.",
        "Horrible buy. A pin sized hole has developed on the inner surface, from which rust leaches out. I have observed all precautions- soft handling, wooden or nylon spatulas and all the other works. I am amazed that this should even have happened. It may still be under warranty. But I do not think there is any need to pursue the manufacturer given their history of avoidant responses and bad customer service here in the comments. All I can say is, if given another chance, I would certainly not have brought this product and now feel cheated.",
        "I wanted to love this Dutch oven! It arrived and was beautiful, but after removing it from the box, I found 2 places where the enamel had chipped off. I had read reviews that this had happened to others but decided to take the chance. I have no doubt it would have worked wonderfully but I didn’t like the idea that it was already chipped and would likely continue to chip over time. I returned and opted for a cast iron double Dutch oven instead so I wouldn’t need to worry about the wear and tear on this enamel pot.",
        "Great value and the oven cooks awesome. Cooked a Pot Roast and 2 batches of Lasagna (See Pic) so far. Soaked in warm soapy water and used a non-scratch pad to clean and it still looks brand new with very little effort to clean.",
        "Firstly, like many people I was misled by Lodge's page that trumpets their 'Made in America' credentials then hides the fact that these pots are Made in China way at the bottom of their description. I don't mind buying something made overseas, but I don't like feeling like I was tricked into doing so. The pot itself was pretty mediocre quality so we decided to return it and try to find something better. Then I discovered that Lodge do not accept returns. Period. So we are stuck with a pot that's not what we thought it was and isn't what we are looking for.",
        "Doesnt do what it’s made to do. Looks great. High quality surface. Great heat distribution. Great for searing. BUT terrible at being a dutch oven. The lid seems like a snug fit, but it’s not. This thing WILL NOT retain moisture on its own. Chili in the oven was bone dry after an hour. Braised short ribs bone dry after an hour. The only positive is that the enamel surface didnt shatter under the dry heat. You’ll need a layer of heavy duty foil between the lid and base if you want to use this as a dutch oven.",
        "I had to wait almost a month for my Lodge pot (thats like a year in Amazon 2 day delivery times) but it was well worth the wait. I am using it as a bread pot. It cooks my homemade breads perfectly! And it is so beautiful I decided to leave it on my counter as part of my decor. Plus because it is air tight, so I can store my homemade bread it it and it will keep the bread soft inside while keeping the outside crusty. I will definitely be buying more Lodge products in the future. (Love that it is made in USA)",
        "The product arrived damaged with a broken handle. Amazon and Lodge tossed the issue back and forth. Neither company resolving the issue. Horrible customer service by both companies. Lodge also claims to be Made in the USA. This product is made in China. I would rather pay more for a product made elsewhere, or less for the same thing made in China from somebody else. I will no longer shop at Amazon or purchase Lodge products.",
        "Great product for cooking or for making bread? Came in perfect condition with no chips or problems. There seem to be some confusion on the reviews about preheating the pot. Yes, you can preheat this product if necessary, but Not on the Stove Top. It requires even distribution of heat so if you intend on preheating it, put it Inside the Oven.",
        "I was reluctant to try this inexpensive Dutch Oven because I was worried about the enamel chipping and bubbling. I put it to the test frying, searing, baking, making soup, roasting and canning. I was impressed with how it performed during the various cooking methods I tried. Food did stick a little but that will go away as I continue to use and season the pan. Compared to the Le Creuset and Staub pans I own now, I didn’t notice any difference. For the price, I highly recommend this Dutch Oven.",
        "I am so pleased with this enameled Dutch oven. It is a great addition to my kitchen. Some of the reviews I read said there were issues with the lid, but the lid fits perfectly. Is very easy to clean. Everything that I have cooked in this has been fantastic!! My husband said it deserves more stars because he has gotten to enjoy a lot of great meals that this product delivered. Would not hesitate to buy this product again. The price was amazing compared to other sites with the same Lodge brand and other name brand Dutch ovens - if you know who I am referring to!",
        "I am super bummed- the enameled Dutch oven is actually made in China. I thought I was supporting America made products but I guess not. For everyone else- only Lodge’s cast iron (not enameled) is made in the US. All enameled products are made in China. The product description goes on and on about how this stuff is made in Tennessee but doesn’t clarify what is made in China. Lame",
        "This is a too good to be true type of situation. I've been using this dutch oven for 6 months and the non stick coating of the enamel has completely worn away making it a nightmare to cook with. It is pretty on the outside and a piece of junk on the inside. You get what you pay for. Le Creuset is the way to go. Don't waste your money on this. Invest in something good!!",
        "I really love it but theres one annoying aspect. The rim is not covered in ceramic. Its exposed iron. So it rusts. If theres steam (which there is!) u have to quickly dry it. When washing, u have to dry and oil it quickly to prevent rust. Its a bit annoying to do. I learnt my lesson since theres a tiny bit that rusted and I hadnt noticed it at the beginning. It had not reoccurred after I started drying and oiling rim immediately after every wash. I dnt let anyone else in the household use it for this reason since I know the wnt be careful, which is a shame since its a great product.",
        "I cant believe all the poor reviews here. I own a 3 qt and a 4.5 qt and use them both frequently. The 4.5 qt is used mainly for bread because of the shape but the 3 qt is my almost every day pot. I am very rough with it considering and it has never chipped or broken and remains easy to wipe out after cooking. I make a lot of tomato based soups and stews so I do get some staining but a little boiling water with baking soda takes them right out. I was given a la crueset as a gift and prefer the lodge.",
        "I can put this on the burner or in the oven. As for quality, this will outlast me. Be aware that this is heavy and therefore has a lot of thermal inertia. That means that if you have the heat on too high it will take a while to cool down. Instead of turning the burner off, transfer to a burner that hasn’t been turned on. Very easy to clean. The lodge lid handle has a heat limit, so I might turn one out of brass for it just because I can.",
        "This little pot is a must have! It rounds out all my other sizes of this type of pot. It holds 1.5 quarts of liquid right up to the rim. So, I keep this in mind that for cooking, count on it as a 1-quart pot. I like the handles which take up less room on the stove top while cooking. The handles also make the pot easily-handled. The quality is superb! I recommend Lodge highly and cooking with enameled cast iron is the best for our health.",
        "I went looking at another high brand enameled Dutch oven, specifically a brand that starts with Le and ends with set, and was aghast at the price. Lodge showed up as an alternative, and I was like, yeah, that's what I'm talkin' about. The color is beautifully rich, and so far I've found it to be very versitile. I've used it for soup and stew, and I'd like to try a chicken in the pot at some point! Very pleased with this, and I'm always looking for an excuse to use it.",
        "If you've never used a dutch oven you don't know what you're missing. I originally purchased a cheap off-brand dutch oven to try and I loved using it, but after a year or so, the enamel started to bubble. I upgraded to the lodge model. This is my go to pot for soups, stews, braises, beans... I prefer this over an electric slowcooker when I'm home. Being able to brown meats and or sweat vegetables in the same pot you're for the final dish adds complexity to the flavors.",
        "Really love the way it looks - GORGEOUS RED and the rounded edges on the bottom (perfect look for dutch oven baked bread). Docked one star just because it's SUPER heavy. Apparently the Le Creuset isn't as heavy, though of course, the Le Creuset is way heavier in price!! (And the Le Creuset doesn't have the nice rounded bottom that the Lodge has.)",
        "(Same as the companion piece) It is rusting around the edges after 4 weeks. I went away on vacation and could not return it before the return expiration date, so now I am stucck with it. The companion pot is also rusting in the same way at the very edge of the pan as if the enamel was insufficient around the top edge. We are not sure if this rust will affect the food we cook in the pan or if the enamel will continue to peel away. I have only used them a couple of times. I am happy with the way this product cooks, but I won't buy it again.",
        "I was concerned that the exposed edges would rust but I read that they were matte porcelain so I felt better. After my initial use, I washed and dried per the instructions. I left it out to air overnight, just to make sure it was dry. When I went to put it away, I noticed rust in several spots on the pot and lid. So much for the matte porcelain finish. I believe it's just exposed cast iron and not matte porcelain which leads me to think the pot and lid will rust and the actual porcelain will start flaking away with more use. I'm returning this to Amazon.",
        "Purchased this inexpensive model upon Consumer Report’s and Cook’s Illustrated recommendation. Incredible buy—it works perfectly and is a wonderful addition to my cooking appliances. I use it several times a week and it performs flawlessly. Great soups, stews, main dishes, veggies. Cannot recommend it enough. Awesome value.",
        "I make several dishes that start on the stove and finish in the oven. I had used a Le Creuset before it died and thought I'd try something different. While not scientific, I honestly can't tell the difference in quality or performance. It's such a treat not having to transfer from stovetop ware to ovenware. It heats everything evenly and clean up is simply a breeze.",
        "I purchased this for baking homemade bread. It works well for that and is easy to clean. However, it wasn't until I received it that I was presented with the fact that it is manufactured in China. I'm not against China; however, several product testing reviews have cautioned about purchasing enameled cast iron produced in China because the manufacturing standards are not as rigid, and if it cracks, you should throw it away. I assumed that since it was being sold as a Lodge product, it was going to be produced in their US facility where standards are high. I would not have purchased it if I had known otherwise.",
        "It’s really big and heavy, but the white one is beautiful. I love it. I’m using it to make sourdough and it works just fine. The restriction says to not bake it higher than 500* because of the steel parts (the handle) or something, but I was able to bake my bread at 550* and it was fine. Some of the white coating has chipped off at the edges but I don’t mind it. I got this one from an open box deal and it’s great!",
        "At first I was very disappointed to see that this unit was made in China..when I researched the Lodge company website it looked like products were made in USA. Putting that aside, after a year of intense usage; mainly for baking breads. it's had some slight darkening on the outside due to intense 450F heats but no cracking, chipping of the enamel. Improvement for this model would be to have a handle rather than knob on the lid/cover but overall, for the price, I am very satisfied with this product.",
        "I bought this for a bean pot (we love all kinds of beans around here) but I've made stews, soup, and pot roast in it. Very versatile and cooks evenly and I don't have to up the heat as much. I'm glad I saw this! Warning, it is very heavy, don't let the lovely color fool you.",
        "They say you can put it in a oven up to 500 deg. Used first time to make bread at 425 deg and a large chunk of enamel popped off. Now they say I can't return it. No Lodge enamel dutch oven is worth it. Maybe I can use it for my dogs water bowl",
        "The dutch oven performs as expected and the interior enamel is flawless, but the top edges of the pot and lid have severe corrosion after only a few months of use. Definitely worse quality control than past items purchased from Lodge.",
        "I got the Dutch Oven specially for baking sourdough bread. I baked in it twice (I never have done it before and was not sure it will be good especially for the first time). I think I was successful because of this Dutch oven. I definitely will try to bake something else in it. And one day will try to cook something like duck. The pot is not so easy to clean, the high temperature lives some spots on the surface. It is ok with me. I am sure if you want to keep your pans and pot like new, don’t use it. I can recommend this Dutch oven. Very happy with it",
        "This item came cracked and chipped for my sister’s quarantine birthday. We have both now contacted Lodge to get help with the return when Amazon diverted us to them to which Lodge referred us back to Amazon who is not answering the number they told us to call. Piece of junk and so frustrated at an already trying time. Save yourself unnecessary anxiety.",
        "I’ve made bread in this Dutch oven 3x and it’s turned out beautifully. Also used it to make one-pot stew and soup meals and it was an easy clean-up. My daughter borrowed it to make bread and she will be purchasing this Dutch oven as well. I loved the color selection and it is an excellent value compared to higher end products. As a petite woman, my only con would be the weight, but I am getting used to it.",
        "I have been wanting a Cast Iron Dutch Oven forever! Each of my daughters received one for a wedding gift and I finally decided to get one for me! I could not see paying a lot for the other name brand. I figured, I love my Lodge frying pan, so this would be worth a try - I was right. It is a beautiful blue color outside. The white interior makes it easy to see how things are cooking and cleans up easy. The round shape makes nice bread and has no corners for grime to get into with other uses. Don't hesitate buying the Lodge brand! Great price and quality!",
        "I hemmed and hawed over whether to take the plunge and invest in a Dutch oven made by two other well-known companies or get this one by Lodge. I ultimately went with Lodge and am very glad I did. I mainly use it for making sourdough bread (turns out very well) and it's also great for deep frying and stove-top braising of meats. Compared to those other brands, I saved about $200, which makes the deal even sweeter. Easy to wash and lovely deep color (red) too. I'd highly recommend this if you're looking for a great quality Dutch oven, but don't want to spend a mint.",
        "Update** We did finally connect with Lodge; the email server I had used to send pix to them was rejected by their server. Lodge CS did accept our return, and sent a brand new dutch oven, which arrived and is perfectly flat on the bottom and works great on our glass top stove. Kudos to Lodge for their concern; I only gave 4 stars because of the surprising inability to do the return through Amazon.",
        "For some reason, my kitchen arsenal lacked a proper Dutch oven, and I sought to remedy that. While the \"top rated\" French brand was tempting, I have used Lodge products for years, and read through the reviews here praising their version of this pot. I've prepared several meals now, all involving first some form of braising, and then oven baking for varying lengths (latest was eight hours), and the results are spectacular. Even heating with sealed-in moisture, and some of the easiest cleanup around, which is a massive consideration for something like this. Love it, and hope anyone considering the item will not hesitate since the price is right, and it's a fine product made here in the USA.",
        "Good value for the price, but I could have sworn I read something on the Lodge site that said these were made in the US. When it arrived, it was clearly made in China. Perhaps my mistake. Enamel on the edge of the lid is not very thick; the first time I set it on the stove and banged the lid slightly against the edge of the body, a small piece of enamel from the edge of the lid flaked off. But it cooks very well.",
        "I paid more than $10 extra for this particular color, and am disappointed that it's not the color pictured. It's called deep teal; but the picture is more of an emerald or bright hunter green. The actual item is more blue than green, a very muted teal. I would say the name is accurate; but the picture is not. I only paid the higher price for this color because I expected it to be as pictured.",
        "I love, love, love this cast iron Dutch oven! It's big and beautiful and really holds the heat! Great for soups, one-pot meals, and big lots of cabbage or corn-on-the-cob. Cooks faster and more evenly than my other big skillets and pots. Wish I could afford the whole set. This one is the perfect size to have if you can only afford one. It's very heavy, but easy to clean, and is so pretty I leave it on my stove all the time.",
        "I ordered the 6 qt dutch oven in storm blue for my daughter for her Birthday. The color is beautiful. They are getting ready to remodel their kitchen and she wants open shelves. Plans on the Dutch oven being on the shelves, she says \"Its too pretty to be in a cabinet.\" She has had it about a week and a half and has used it 3x's.... needless to say she is in love with this Dutch oven. The handles are a great size, heats evenly, cleans up beautifully. I want one now!",
        "I have had the Indigo Lodge for over 4 months now, and have used it enough at this point to review it. I have used it for numerous cooking applications and I am totally delighted with it's performance. It has been easy to clean, browns beautifully, and hasn't chipped or stained. Of course, I take good care of it and follow directions as you should with any enameled or porcelain cookware. I can't imagine that the much more expensive ones are enough better to justify the significant price difference. The indigo color is deep and rich and snazzy looking. Still look brand new.",
        "I've been using lodge cast iron skillets for years with great success. They have perfect heat distribution. When it came time for a dutch oven, Lodge was a no brainer. So the ceramic cast iron is made in China. Yes, it's a little disappointing but these people have to stay in business. They're been around since 1896. You're still helping to support an American company. Yes, they probably should say that these are made in China in a more obvious way. Note the directions say you cannot heat up the dutch oven without anything in it and the flames should never shoot up the sides of the pan or you will burn the it. This is standard for ceramic pans.",
        "I have had this Dutch Oven for a couple of years now and use it often. It does cook nicely but it stains badly and is very, very difficult to clean. It also has a few chips in it. It just does not wear well...I am disappointed with it. I have a small Le Creuset and it cleans like a dream and always looks beautiful, but for a large 7.5 Dutch Oven the cost is prohibitive. If you can afford it, go for it!",
        "This Dutch Oven seems to be every bit as good quality wise as the more expensive Le Crueset products. Would buy again and probably will get some of the other Lodge enameled items. I use this for everything from baking bread to roasting meat in the oven to pot roast on the stovetop. Only drawback is its weight which is only a bad thing if you have arthritic wrists and fingers. Its a good thing for overall strength and longevity. Great product and I would buy lodge products again without hesitation.",
        "Pretty unhappy with this item. Have had it just over two months and it already has a huge gash out of the inside where I can really see just how thin the enamel is. I thought this would be something that would last for years and years and that is not going to be the case. Go with cast iron or just spend the money on a better quality product",
        "It looks great, Bigger than I was expecting, for good and bad. I used it to braze chicken in oven, worked great, Used it to fry on electric stove, worked great. Have been treating it very gentle when moving or cleaning, and no chips, no stains, no scratches so far. This kind of item should last for many years, so we will see how it holds up!!! PS, I have a cheap Lodge cast iron skillet, now thats a beast, works great and you dont have to treat it with kid-gloves.",
        "I ordered this in “Lagoon” and it came in the color as seen in the photo, which doesn’t match ANY of the colors that are advertised, so if that’s important to you, beware. I’ve only used it once and it seems to work as advertised. I recently re-did my kitchen and am disappointed about the color because I wanted it to match. I had already cooked one dish in it before I realized it, so I didn’t contact the seller for a refund.",
        "We've used this about 1x per week since purchasing. We always pre-warm enameled pots on low and wash them by hand. In spite of this there is a network of fine cracks in the enamel.",
        "I saw before I bought this that often the paint is chipped. I had the smallest little chip but you can't see it unless you are looking for it. This pot is easy to clean and does a great job baking my bread which is what I need it for. If you were to compare this to a creuset, this is practically the same thing without the name brand on it so I would say this cheaper option is 100% worth it. Overall, I would definitely buy this again and would recommend to a friend.",
        "It arrived in perfect condition, and included the rubber clips that protect the lid and pot when storing. It is much bigger than I imagined, and HEAVY! It is a substantial piece of cookware, not thin or cheaply made. Great job cooking, heated evenly, cleaned up easily. I definitely recommend this when looking for a less expensive, but high quality dutch oven.",
        "I bought this Lodge enameled cast iron pot because it touted family owned Tennessee forge. Made in USA. Clearly when it arrived the box was labeled made in China. During these Covid times I’ve been trying to buy US made to support our economy. Disappointed in the false advertising. I cannot comment on ease of use or cleaning as it just arrived yesterday. I’m sure it’s fine. Please change the product information as it’s misleading.",
        "“Lagoon” is more like military green than the rich emerald that is shown in the picture..... don’t order this with any other item- as amazon didn’t pad the box, and it crushed other items it was shipped with.",
        "Temp limit on the enamel is 500F which makes it fairly dicey to use it for Sourdough and deep frying, but the enamel doesn't just fall off if you exceed the temp so it's not as big a concern. Baked over 8 sourdoughs and used it for deep frying fish sticks. both worked great. I would suggest taking the top knob off for the sourdough and using the pot upside down in the oven. There was a bit of a challenge on a gas stove to get oil up to 350F without the bottom exceeding 500F, but that worked out as well without damaging the pot.",
        "I love this thing! I’ve had it for a few months now and it’s great! I use it constantly for pasta sauces, braising short ribs and even baking bread. My only complaint is that it came with a tiny chip or missing portion of the gritty enamel on the brim, it hasn’t affected my cooking capabilities in any way, it’s more cosmetic and I don’t see it with the lid on so overall I’m happy. I have a glass top electric stove so I never have to worry much about sliding it, but I would be cautious if I were using a gas stove. And I love the color! I’ll use this for as long as it lasts. Hopefully decades!",
        "The dutch oven arrived with multiple chips in the enamel in a box indicating the item was made in China. I immediately returned it because of the chips. The fact that the enamel was chipped makes me question the quality of the workmanship and product. I thought I purchased an American made product; I will definitely reconsider whether I want to purchase this product again."
    ]
}