{
    "entity": "Coaxial Speakers",
    "text": [
        "Cons: Your audiophile friend will give you lots of cons about these speakers; they sound just okay. Pros: Price. It will also discourage you from inviting your audiophile friend over; he's a d0uche anyway.",
        "I installed 2 of these speakers to go with my other home ceiling speakers. My hope was to get good sound and not pay as much as I had previously. I am comparing these to Polk speakers that I spent $90-100 for each speaker. These were much cheaper. I'm not an audiophile but the sound difference is readily apparent. If this is all your current budget has for speakers then it may work out for you. My biggest problem was that one of the speakers died 6 months after install. My money saving project is now costing me more than I hoped and will have to reinstall new ones.",
        "I installed 12 of these in a large room driven by 2 1000 watt iNuke amps (3 speakers per channel wired parallel = 2.7Ω/channel). They sound great for both PA and music/movie applications. Good speakers for the money! I installed them on 24\"x24\" ceiling tiles, and I cut 23\"x23\" 3/8\" plywood to keep the tiles from sagging. I just used the speaker's built in clamping devices to hold the sandwiches together. Easy to install, and they look good, too. My only problem was that Pyle would only let me order 5 pair at a time, so I had to wait for the first 5 to show before I could order the last pair.",
        "They sound really good for the money paid, however getting the grill off and back on again was the most difficult thing I have ever experienced for an in-wall/in-ceiling speaker. I dread if I ever have to get them back off again. It took me an hour to get both grills back on the speakers and had to somewhat reshape the edges to get them to fit back in. I would not have purchased these had I known it would be this difficult to install the grill.",
        "Great Speakers! Be prepared to use an Equalizer and add a good Subwoofer.... Once you dial things in sit back and smile! Don't expect these things to perform laying on your desk, get em in the ceiling where they belong and you won't be dissapointed. I don't care what kind of wall speaker you select.... Expect nice performance but the icing on the cake is some EQ'ing and a Subwoofer...",
        "Installation was fairly easy, thanks to the provided template. However, getting the screens back on was a different story. I had to cut tiny notches in the sides of the screen with wire cutters in order to make them fit back into their housing. Thankfully the notches don't show once the screens are installed. The sound quality is great! My kids LOVED hearing movies like the Star Wars series on them. Be sure to buy a good receiver and subwoofer to supplement the total sound quality.",
        "These things are a steaming pile (pun intended). The sound quality is awful and the manufacturing quality is even worse. When they arrived the plastic post that holds the adjustable tweeter in place was broken on one speaker. I had to glue it so it wasn't dangling from the ceiling. Please keep in mind I am not an audiophile and I think most speakers sound about the same but these aren't good enough for the intercom at the grocery store.",
        "5 of 8 have broken so far. It didn't matter if they are installed inside or on an outside patio protected from the elements, the plastic housing will turn brittle quickly (within a year), fall from the ceiling (very dangerous) or crumble to the touch. I was left with big holes in my ceiling and shattered plastic everywhere. Once the housing goes, they are more or less useless, especially for their intended purpose as ceiling speakers. I live in Hawaii, which is warm but not extreme. I was attracted by the reviews and quality for the price, but I will not buy this brand again and do not recommend it.",
        "Really easy to hook up, template was good. I didn’t find getting the grill off to be hard. Only had it a few months but no problems being in the same small room as the shower. Sound quality is great for listening around the house, not sure how it would go with trying to be obnoxiously loud.",
        "Bought these as in ceiling rear speakers for my 5.1 surround system home theater. They do not handle bass sounds. Played Fallout 4 on my XBox One (deep bass sounds in that game). The speakers sound like they were blown. Had to turn the volume on the rear speakers to -10 just to get rid of the blown out sound.",
        "Installation was a snap, the template that came with the speakers helped out a great deal. I am using them for rear surround speakers, so I wasn't too concerned about the lack of bass that some reviewers commented about. For rear surround sound speakers, these speakers work well. Can't beat the price, and the performance is good.",
        "Best indoor ceiling speakers you can buy for the money, period. I went bigger for my actual home theater, but a single pair of these sound much better than any of my friends home theaters which they all spent a lot more money to build. If you're tempted to go with something smaller or cheaper to save a couple bucks do yourself a favor and give these a shot anyway. Super worth it!",
        "The speakers showed up with good instructions. One of the speaker grills had debris painted into it, but the speaker itself worked great, and I love that the tweeters were direction adjustable. It was very heavy because of the transformer that you would use for 70v systems. I have a traditional setup, so I removed the transformers and the speakers work fine, and were much lighter.",
        "I was a little worried about these when I did a sound check before installing but it was just the speakers reverberating on my countertop. Once installed the sound quality was great and they get LOUD. I have them ceiling mounted about 8ft apart in a 20x25ft room and I'll probably never have them on more than half volume (this is with the Pyle Bluetooth amplifier). Installation was a breeze, the screw tabs make it very easy to get a tight fit.",
        "We built a custom media room 3 years ago and have agonized over the right ceiling speakers since it is a tight space and the need for custom directional flexibility. After serious research we found these Pyle speakers to be the ones. Installation was a bit tricky as the original holes for the wiring was too close to beams and rafters but the relocated positions actually worked out better. Once the holes were cut, it was a cinch to secure the self adjusting clamps. getting the grills back in was a bit dicey but the finished product was worth the effort. We particularly like the directional tweeters flexibility and ease of positioning.",
        "Was very hesitant to purchase these based on the low price. That usually means low quality. After reading the reviews and all the good things written about them I decided to try them. Speakers were easy to install and had no issues. Didn't expect much when turning them on but was very surprised that they sounded so good. Could use a little more base but after fine tuning through the receiver am very happy with the purchase!",
        "Really Surprised Me. I replaced My RV Ceiling Speakers With These.The Installation was a breeze and the sound quality was Everything the Reviews Said abiout them plus even Better for Me.The Sound is just outstanding in my RV now,Happy Little Camper Now",
        "We bought 8 so far installed 6. They sound good for medium level background music.Installed in 8' ceiling. If you have blown in insulation be prepared for a big mess.Also how are you going to keep the insulation from falling on to speakers ? We used 5 gallon buckets at each location. Cut off wire handle apply silicone sealer to rim of bucket glued to top side of dry wall . Makes good bass reflex box and prevents insulation from contacting speaker.",
        "These speakers are great for background music. I have to in each rooms in the basement and when they are on you can hear them throughout the house. They where very easy to install.",
        "I have used several products in the past and although these are not the highest quality speaker they definitely exceeded my expectations for the cost. They have a directional tweeter in the center and the plastic housings seem pretty well made. I was easily able to install them in a drop ceiling. Simply used the cutout stencil to draw the circle, cut the ceiling tile, popped the speaker in and just tightened the screws. Connecting the speaker was just two easy push clips where you slide the speaker wire in. Overall, I've dealt with a better product but was very pleased with both the quality and sound. Don't count on a lot of bass with them though.",
        "Good for the price, got these and installed them in about an hour, along with the pyle Bluetooth in wall receiver. The speakers sound fairly good, and are what I expected at the price, they aren't overly rick sounding, and lack some bass, but again for the price this is as good as you'll get. They also look good installed, nice finish and blend in fairly well with a white ceiling.",
        "I sent the speakers back. The customer support was slow and I truly believe the person did not know what he was talking about. The speakers are heavy and have 14 wires in the back and we still don't know why. They did not work with our sound system, so I bought different ones.",
        "I was prepared to pay ~$90 per speaker for some Polks. They could be aimed within their cans, and actually had backing. Their tweeter looked fancier. But these Pyles sound great, and are of plenty high quality. At certain volume, the audio isn't as crisp in the mid-range as I imagine a higher quality speaker would be. I made my own cans in the attic out of cardboard boxes, and then covered those with insulation. Easy. These are also good enough to use in a surround system. I'm considering replacing some mounted MB Quarts with these in my media room. They're very clean looking. Also, the tweeters can be angled to give some directional treble, and a little \"fancy\" perception.",
        "I paired these with a 100 watt Yamaha receiver for my whole-house music system. I'm using Amazon echo's to link the system together. These speakers have excellent mid and high range sound, but as almost all ceiling applications they lack bass. Adding a powered subwoofer solved that problem.",
        "Price was right, sound quality was decent until I blew one of them just a few months after purchasing. Don't play your music too loud with them. I have finally gotten around to replacing them after 6 years. When I went to pull them out, the plastic casing was so brittle that one crumbled and fell out of my ceiling before I could even loosen one bracket.",
        "We have used these in our restaurant for over 6 years. The sound is excellent (especially for how cheap the price is). I accidentally destroyed on so I went back to my purchases and order another one without lookin at any others.",
        "These speakers showed up in good packaging and condition. Installation was very easy, it came with a template to trace on the ceiling and a wiring diagram for the speaker's. I used this in conjunction with an in-wall powered, control panel:  This combo works amazingly well and is great quality. The only thing I could find that was a negative, is that the speakers do start to distort at extremely high volume. Obviously for the price you can't expect totally non-distortion. However all-in-all, they are loud, crisp sounding speakers. I will buy more.",
        "They seem like nice little speakers for the price but reinstalling the grills are near impossible. I am very handy and can do about anything but this takes the cake, ecspecially if you are working off a ladder for ceiling install. Grill slipped off and broke tweeter off so be careful. At this point looking for an aftermarket grill that will fit over.",
        "This is the second set I have purchased installing them in each home I have moved into for surround sound. They sound great for the price. Super easy install and they look great too.",
        "For the cost, these work very well. The center tweeter does occasionally need to be super glued back into place because it pops off - so be aware of that, but nothing major - just poor manufacturing process. Sound is very good, and makes for a very nice addition to a multi-room deployment - not sure I'd use them in a true theater or surround setup, but for this purpose, they're great. If you're planning on using these for ceiling tiles, they're too heavy (even in a 2'x2' tile), and will cause the speaker to sag (putting a huge dimple in the tile). To correct, put a piece of drywall on top of the tile (with a matching hole cut).",
        "Just got them, hooked them up to my stereo receiver just to check them out, they sound way better than I expected for the price! I will be using them as surround speakers in my ceiling . Definitely recommend them if your expectations are realistic and sound quality doesn't have to be top notch.",
        "I love that the speakers are of made for the ceiling, giving me surround sound without having to pay all that money for a sound bar. Makes me feel like I’m in a movie theater.",
        "This is the 2nd purchase for my friend. A year back I installed in my home I am pleased with the sound of these speakers in a ceiling installation with 4 speakers on a 7.1 home theater receiver. The sound is fine for a good 3D video experience and for general music with reasonable base, very good mid-range and reasonable treble. The tweeter angle adjustment is much too limited. installation is easy.",
        "If you are looking at these speakers, you are most likely not an audiophile willing to spend hundreds of dollars on a speaker. And I am here to tell you that these are great sounding speakers that are reliable and well-worth the price they are asking. We installed a pair of these in a situation where they would need to be playing music 15 hours a day, 7 days a week. And they have been doing just that since February 2013. Price is right, quality is right. Look no further than these for in-ceiling (or in-wall) speakers. These are the ones for you.",
        "These speakers sound good and are very nice for the price. The only problem we had was getting the mesh covers back on after install. It was a real pain......4 speakers took 20 min to install. Getting the four mesh covers back on without destroying them, a little over two hours. Sound quality is fine, but not sure I would buy them again knowing how hard the screens are to put back on.",
        "These worked very nicely, and were easy to install. Been installed for ~9 months with no issues, although admittedly we don't yet have a GOOD sound system to drive them. Note that the screens on these were a little difficult to remove, but there is a tiny tool provided that does work. Also, the aiming for the tweeter is pretty easy and obvious to accomplish in person, but not from reading the description. In our application, they're mounted on a vaulted ceiling with insulation over top of them.",
        "The speakers were just installed yesterday and they work just fine! They are connected to my doorbell and do a good job in carrying the sound throughout the house and even outside on the patio. A huge help!",
        "Great speakers. We are currently using (4) of them mounted in the ceiling in a workout room and they provide the energy I need to get through a boring workout session. The speakers have a nice, simple design that does not draw extra attention to them. The adjustable tweeter, found in the center of the speakers, is a nice feature as it allows you to direct some of the sound in a different way by about 15 degrees.",
        "I purchased 12 pair of these and was very happy with the sound quality for the price. They were great for whole house audio. Unfortunately, the cheap plastic they use for the mounting surround cracks and falls apart after only a couple of years. I now have to replace the entire lot as they are inoperable due to the broken plastic and are falling out of my ceiling. Do not buy these!!",
        "These sound spectacular and are super easy to install. My wife is really impressed with the sound and was afraid to ask how much I spent for this awesome sound. I told her and she could not believe it! Adjustable tweeter direction is an added level of coolness. Even at higher volumes, they hold up and sound really clean. Glad I bought these.",
        "for the price these speakers are amazing, super easy installation(i have an open attic), ran 100ft of wire & installed 4 speakers in 90 minutes. comes with a stencil, all you will need in a measuring tape, pencil, keyhole saw and a philips head screw driver. i used my cordless drill to tighten the speakers to the ceiling, go slow and not too tight because grill will not fit back in these are not bose by any means but i was blown away by the quality for the price, 2 for $36, i was able to give my living room a super clean surround system for well under $100, i would and will buy these agian!",
        "Great speaker for the price. Did not but these expecting top of the line speakers. I knew what I was paying and I feel like I got more than what I payed for. Very good value for the money.",
        "Cannot be beat for the price. I love audio and consider myself to have a pretty keen ear. For the price id say theres probably no home theatre speaker this price that can beat it. Sure theres much better products out there definitely. But keep in mind these are your average speakers that keep your wallet happy as well. Overall quality of the fit and finish looks great. Sound quality is pretty good overall with a little less bass than id expect but thats ok for what i will be using it for.",
        "LOVE These and a great addition for my dolby atmos setup.. Looking back now I wish I would of went with the 8\" ones but these still pump out some serious sound.. The tweeter being able to rotated towards the seating area is a nice touch.",
        "I use the two speakers in my kitchen ceiling. I got a really good black Friday deal on these speakers and thought that if they don't perform very well then I'm not really out any money. Well, they arrived and I installed the speakers which was relatively easy to do and was very pleased with the quality. I'm not using them to blow the windows out of my house but they do not distort the sound when the volume is turned all the way up. If your in the market for ceiling speakers and are a little hesitant of the quality because of the price I can tell you that they are made well and have a really good sound.",
        "Sound great and price is right. Put one in the kitchen and one in the living room and they've filled the front part of my house with sound. Paired with an in-wall bluetooth receiver and its easy to connect my phone and jam. :)",
        "Surprisingly good audio quality for the size and price. While these aren't audiophile speakers and I wouldn't put them in a home theater, they are great for ambient sound, I've installed several pairs of these in bathrooms, kitchen, garage, patios, etc for use with a whole house music system, and they work great. I've never blown out a speaker and have had them at very high volume (backyard parties) with no distortion.",
        "I've had these over head speakers for about 6 months now, and I really really like them. I have no complaints at all. They are bright and crystal clear, and work excellent as ATMOS speakers. Definitley worth the small price for big results!",
        "incredible mids / nice response range. tweeters are ok for highs (not like horns on my vintage altec model 19) 12\" or higher sub will complaint 4 of these speakers including a quality center channel. Cons needs gasket material around plastic and ceiling contact. No low sharp bass response need subwoofer. Free air or cabinets seems to have little to no effect ( mostly due to mid range). Buy a quality center channel speaker and a larger subwoofer to pick up the weak points in these speakers.",
        "I've had these speakers at my coffee shop for 8 months, and they still work like charm. sound quality is great! If amplifier turned all the way, it will get really loud too!",
        "I recently upgraded my surround sound receiver from an Onkyo 805 to an 838 with Dolby Atmos and I wanted to put some speakers in my ceiling to utilize this feature. These were very simple to install. The hardest part was, like anything else, running the wires. But after installing them I put in John Wick which was in Dolby Atmos and WOW!! I love these speakers! I am sure you can get better ones but these were on the Deal of the Day for $50 and I am very pleased!!!",
        "smallish media room in basement with 8' ceilings down there...I always wanted to replace the 2 rear speakers that were surface mounted to the ceiling and hung down maybe 6\". those infinity speakers came with a great audio package I purchased at closeout prices when Circuit City was shutting down, so no choice at the time. these Pyle's do more than the trick for us. easy install. sound great to me. will never really crank them up like others have reported. should last us just about forever.",
        "Delivered on time. Installed as described per directions. No surprises. The sound is good.",
        "I have these set up as my rear left and my rear right and have them pumping everything above 80hz, my subwoffer does the rest, at high volume I don't hear any sound degradation, I'm sure that there are be better quality way more expensive ones out there but when comparing them to a friend of mines who as his whole setup with klipsch expensive speakers my ears aren't fancy enough to tell the difference. I have the same brand but squared for my front left and right as well. I basically wrote the same review for those as well.",
        "I put 4 in my cieling and they soubd great. But alone they will just sound ok. You nees a sub-woofer or complimentary speaksmers as these speakers are mid-range. Also i read othrr reviews and i disagree with whst some peope said. The speaker covers were very easy to put in and 5hey fit snuggly. Not sure if others were defective or something but mine were easy.",
        "Terrible. I bought these years ago and finally got around to installing them. After I got the holes cut in my ceiling, I attempted to install these and the plastic just crumbled and broke. Seeing other reviews of them falling out of the ceiling, I'm thankful I never got them in. Stay away from these and this brand!",
        "Bought these to install in my living room as surround speakers. First off I purchased 4 and 1 was defective. However, Amazon as usual was on top of it and got a new one to me within a few days. The speakers sound ok but do not seems to have a good range of sound. At least to my ear. Will upgrade down the road and move these to the patio ceiling or some other space where its not so important. Good price but I guess you get what you pay for sometimes.",
        "These speakers sound great, I made my own box and mounted them in the ceiling. You can't beat the price.",
        "Less than a year old and both tweeters are dead. Paying for shipping both ways for repairs will cost about as much as a new set. Don't know why these speakers are so highly rated. They actually never sounded good even with a working tweeter. Overwhelming mid range. Loud but not even close to a good quality. Should have returned as soon as I got them. You've been warned.",
        "Very disappointed. One speaker worked for 20 minutes. The other speaker never made a sound. The speaker that never made a sound smelled burnt. I test it with a multimeter and confirmed it was dead. Complete waste of time and money.",
        "Got these speakers for our finished basement ceiling. The quality is high (the units feel solid), and the audio sounds great. If you're painting the screens, make sure you use VERY light coats, or else the paint will clog up the holes in the screen. I got a bit heavy with the spraypaint, trying to cover the entire screen in only 2 sessions, and it clogged. If you do it in 4-5 sessions, it will look great. All in all, I would highly recommend these speakers.",
        "After reading every review about these speakers I was slightly hesitant to order. After getting and installing them I am truly blown away! The sound is amazing! Super clear mids and highs! Bass is okay, but I don't need bass from these,my subwoofer handles that. Only regret I have is reading all of the reviews and not ordering these sooner. I will buy these again and again. Overall amazing product.",
        "I just finished installing these speakers in my basement speaker and they work great. I got them on sale and I couldn't beat the price. They came with the little key to remove the mesh cover and also a good solid template to trace on the ceiling. So far the sound output has been fine for my needs and I have no complaints about the speakers build quality. Just make sure to inspect and try it before installing them.",
        "The speakers sound great in my bathroom and was not difficult to install.",
        "I have no doubt that there are better speakers out there, but these sound great, and you pay 1/4 the cost of \"good\" speaker brands (since most are not sold in pairs). If you are doing a whole house on a budget like we did, start with these, chances are unless you are in the 5% who consider themselves an audiophile, you will be perfectly happy. When I received my order I checked each speaker out for the cracks that some mentioned and they were fine. We have 5 sets installed and all were fine.",
        "Speakers are great in my man cave basement, I bought 4 total to go along with two stand up and center speakers with a sub for 7.1 system. These act as my side and rear speakers so I didn't want to run wires along the floor or walls so this was perfect. I bought these in 2013 and almost 3 years later that still work good and everyone who comes over loves the look and sound!",
        "I bought my first pair of these with the intention of testing out the sound quality for my home theater setup. They're really quite wonderful for anyone looking for fairly dynamic sound in a typical sized living room, and are low enough profile that they don't stick out like a sore thumb on my living room ceiling. They were easy to install, too. Though I have a fair bit of experience fishing wires through walls, so your milage my vary. I will be buying several more to complete my home audio setup.",
        "We purchased a total of 8 speakers and they work fantastic. Installation was simple. I highly recommend these speakers!",
        "Purchased 4 sets of these, two in the kitchen, 4 in the living room and 2 in the sitting room. They were easy to install (according to the hubs who typically knows what he's doing when in it comes to this kind of stuff.) They sound great, but we don't really \"party\" too much so we have never had them full blast. They sound great when we have music on while cooking dinner or playing with our baby before bed. Great price for a great product.",
        "Overall I do like them. They sound really good. They are mounted in my basement ceiling and when I watch a movie vibrations can felt REALLY good from the main floor. Only thing that bothered me so far is that the front cover fell a couple of time on one of the speakers. But I am this is an easy fix. Anyways I would recommend them",
        "Very impressed by these speakers. I am a very cautious person when it comes to parting with my $$ so I do no end of research and seldom write a review but in this case I make an exception. I wanted a set of speakers for my living room and kitchen but didn't want to spend a lot. I took a leap with these and and i'm so glad I did. I have these hooked up to a 4 channel receiver and it ROCKS. They will go as loud as you need them to go without a hint of distortion and in all honesty I would buy another pair of these tomorrow.",
        "I intentionally went cheap here. I used it for my rear speakers and it work fine. Not the best quality speakers and the directional tweeter thingy is a joke, but it makes sounds and for the money, I cant really complain too much. Update: DANGER!! the plastic decays and fell OUT of my ceiling!! Both of them! Literally crumbled apart. Do NOT mount these in your ceiling! Lucky it didn’t hit anyone when it fell.",
        "Sounds great. Bass response is acceptable for the price. Tweeters not built to last.",
        "Great product and shout out to VM Express who these were purchased through, probably the best customer service I’ve dealt with. Had a minor issue with one speaker and they went above and beyond to rectify the issue, and did it all on a Saturday.",
        "When using template for holes cut outside the line for sure otherwise you'll be adjusting the holes and losing a lot of time. Great quality, great sound",
        "Great value for your money only one complaint you can't put the mesh back on once you adjust the direction of the speaker...",
        "These are OK. They do the job for the price. My installer (a licensed electrician, nonetheless) overtightened several. The drywall held up but the speaker brackets cracked and several speakers fell out of the ceiling, chipping the tile floor. Make sure you know what you are doing.",
        "These are slick speakers. Installed in a drop ceiling in my hair salon and they are perfect for that area.",
        "I do not need an over the top surround sound system. Wife would go crazy! These are great and sound excellent to me. Every NFL game I watched this year, I was able to hear clearly what was being said on field from my living room unless the broadcaster cut out the audio. Even for other sports. Movies are great to watch as well especially Transformers. I love these speakers and bought a second set for another room. Great price, easy to install and well worth it.",
        "These connected easily, the clamp system works very well and the sound is amazing and clear. I had pre drilled holes and cables so they didn't take me more than 10 minutes each to install.",
        "Make sure to use a stud finder before purchasing and get a good idea on what your getting. I first got the 8\" but had to spend over $20 send them back and get 6\" as they wouldn't fit between my joist. Come to find out, my upstairs floor joist were doubled up on a 12\" span... not the typical single joist on a 16\" span. There is no way you can tell a difference bw this speaker and any other than bose. Great sound, easy install.",
        "These are a fantastic deal and operate exactly as advertised. I mounted these in the ceiling of my bedroom and routed them back to a mini amp plugged into my flatscreen TV. The built in speakers on the TV were subpar, to put it nicely, but now all our programming sounds great. They were also very simple to install (the hardest part is routing the wire through the ceiling to the speaker -- but that's not Pyle's fault!), and my wife was pleasantly surprised at how nice they look.",
        "I hooked up a sound system in a 40x25 dining room using 8 of these speakers and a Pyle PTA 1000 Amplifier. Great, balanced audio, and these were very easy to install in the drop ceiling. Have played quiet dinner music up through loud rock through the speakers for various occasions. They won't blow your socks off (especially without a discrete subwoofer), but do their job very well.",
        "Five stars because for the price, you won’t find anything better. They are not cheaply produced and don’t feel flimsy. Easy to install and look clean.",
        "Met my need completely! Installation is easy but be sure you know what is behind the drywall! In my case, there is a fire sprinkler system pipe that ran too close to the drywall so I had to shift the speaker an inch further away from the optimal location! The locking clips are great in that the screws are long enough so that it can accommodate variations in ceiling thickness.",
        "When I received the speakers, I was dissapointed that the frame of the speakers is plastic, but sturdy. There was a template for cutting the hole in the ceiling in the package. Installing the speaker is relatively easy, what was the hardest was running the speaker cables to the amplifier. The sound coming from those speakers was clear and loud. There was no thundering bass coming out of these speakers, these are only 61/2 inch installed in a ceiling, not in a well designed speaker enclosure. Vocals are very clear and good treble. I'm very happy with these speakers.",
        "Pretty good speakers for the money. We use these quiet often and recommend them for power up to 200 watts at 8 ohms. Easily installed and comes with a cutout template for sizing your cut out opening. Four rotating clamps hold the speakers very firmly to the wall or ceiling. Also works well in drop ceiling tiles. Very smooth sound with good base and even high and lows.",
        "Hard to find fault with these for the price. They sound pretty good even without a subwoofer but I'll probably still add one later. Installation was fairly easy and I put 4 in my ceiling in about 1 hour...2 hours if you count the prep work in the attic. I built cardboard domes to protect the back of the speaker from the blown insulation in my attic. Also, prevented the insulation from falling down in the living room when I cut out the holes for the speakers.",
        "I am running 4 of these as my Surround and Surround Back Channel speakers as part of my Onkyo 818 AVR Home Theatre setup and I am very impressed by their performance. They are cheap and I wasn't expecting much, in fact, I planned on having them a year or so and then dropping some big coin on a nicer set but I think I'm going to keep these. I've used them for about 9 months and have zero complaints.",
        "I just received the speakers so we haven't had time to get them installed. I'm sure they will work great and I can listen to music throughout the house while I am cleaning or whatever. I've had them before in my previous home so I know I will love them. Thanks",
        "Sound is much better than we could have ever expected, especially for the cost. Very happy that we didnt spend a small fortune on different speakers. Color blends nicely into ceiling color. Very happy!",
        "I was leery of buying used, but these speakers are as new and worked to my liking. A good value.",
        "I NEVER HEARD OF PYLE SPEAKERS SO DIDN'T KNOW WHAT TO EXPECT. I'M PLEASANTLY PLEASED SO FAR AND AM STILL CONFIGURING FOR A GARAGE/SHOP. I ORDERED A SUBWOOFER THIS MORNING AND AM BUILDING MY OWN CABINETS AND CROSSOVERS. WHEN I'M DONE, I THINK MY GARAGE WILL 'ROCK' FOR MINIMAL INVESTMENT. THEN I ANTICIPATE A 5* FEEDBACK. HOPE SO ANYWAY. :)",
        "Great product for the price, my only concerns was, one tweeter was loose, and a wire connection had to be fixed, and the adhesive for the speaker grilles was all melted together. Other than that they were easy to install and they sound Excellent in my four corners of my Game room. thanks!",
        "Very nice speakers, clear sound, love the directional tweeter option",
        "Excellent Speakers, Took lesst than a hour to install. Pre_setup and testing was a breeze",
        "Well packaged & Prompt delivery by Amazon. I bought \"high end\" speakers for my living area, also I needed a pair for the balcony and I had a limited budget. I bought those speakers not expecting much and I was gladly surprised by the quality of material and sound emitted by these speakers. I highly recommend them.",
        "Put 2 sets of these in my ceiling this weekend and am very pleased. They are for highs and mids so don't expect deep base that is what a sub is for. For the price I would do it again if so needed. The construction was good and I had no issues. These sound great to me but I am not audio snob. Money talks. Great for everyday tunes and movies.",
        "I bought 2 pair of these speakers for our whole house audio system and they are performing well. They are loud enough for our relatively small rooms and sound decent. These aren't Bose speakers, but for background audio, they work as well as more expensive speakers we've had in the past. I was a little hesitant at first because the price was low, but they have impressed me and I have no complaints.",
        "Very happy with these speakers. I was worried they'd be a notable step down from their other speakers due to the almost too good to be true pricing, but they're just as good as their RC80's."
    ]
}