{
    "entity": "Coaxial Speakers",
    "text": [
        "This is my second TV I install the speakers on. Great sound with tons of mid bass... makes for a nice clean installation. My only gripe is if you want or need to remove the grill after they're installed you could possibly bend the metal grill trying to pry it off. I have a different brand that are magnet attached grills which are nicer look and easier to remove.",
        "I bought this speaker as an in wall center channel speaker and it excels in that role. This compliments 4 Yamaha NS IW660 speakers that I used for front and rear surrounds. The speaker chassis is solid and will not be prone to any components vibrating which can be annoying with some in wall speakers. The sound is excellent and clear. The highs are crisp and not tinny and the mid-range response is excellent. My only dislike is that the cover screen is domed and I would have preferred a flat screen for a cleaner appearance.",
        "I am not an audiophile, but I was a little concerned about some reviews I ready about using in wall or in ceiling speakers. I use this as my center channel speaker in my 5.1 system and I LOVE IT! Everything sounds so good, the looks amazing, and they were the easiest thing to install. I actually found it easier to install these speakers than mounting a set of Bose. I could not recommend this enough.",
        "I was able trim my wall stud with a reciprocating saw and leave it intact with about 1 1/4 of it remaining there. My wall was not load bearing, so it was not a big deal for me. Then i pushed the insulation around and made two separate boxes essentially. Sound is impressive with some tweaking of the equalizer. I wish they made this with a seperate midrange driver to give it more presence in the midrange. You will need a sub woofer to get the real lows.",
        "If your handy, or it's new construction, this is the item you want. I did have to modify a wall to accept the speaker, but boy am I glad I went this route. I added some insulation and a pair of the Yamaha IW470 and now I have a solid sound system that really captures the movie/media experience.",
        "Works great as my center channel. Be aware that it is wider than typical 2x4 spacing if mounting horizontally. I had to remove a part of a stud and build a header to support this as vertical mounting was not an option.",
        "Mine came used from Warehouse deals. The \"wings\" that install in the wall were all stripped. Be extremely careful and don't use a power drill to install. Sound is good but not exceptional",
        "Great speaker, but has to make cuts in the studs to place it horizontally.",
        "In my movie room Work great. Loud and crisp...easy to install...",
        "This speaker was purchased to serve as the center channel in a make-shift 7.2 surround system (includes a Polk Audio sub, and a combination of Yamaha and Polk Audio speakers). It replaced an Onkyo surround system. The speaker delivers with distinct vocals and great clarity. The center channel speaker is crucial in any surround setup, and this one delivers. I think not getting these same speakers for my left and right fronts proved to be key as well, but I could see purchasing these for the 3 front speakers. The only thing keeping me from giving that 5th star is the fact there is no mid-low cutoff control. Overall, good job Yamaha",
        "Excellent speaker, I use this as my center channel speaker in a 7.1.1 surround set up!",
        "Great speaker. Sounds great!! Had to trim a stud so I could center it under my TV.",
        "Works great as a center channel speaker as a part of my 5.1 surround system. Can point the tweeters towards your seat. Well-made, nice mesh cover, and easy to install.",
        "Great prices and fast shipping. Speakers work great, just a little tinkering with mounting system to make it work properly",
        "Extremely pleased with the sound quality. The installation was extremely easy. I paired the speakers with a Yamaha receiver and could not be more pleased. All this and the speakers look good as well.",
        "Installed one of these speakers as a center speaker for my 125\" projector home entertainment set up. Sounds super clear and works great!!!",
        "I use this speaker as a ceiling mounted front center speaker in a 5.1 surround system just in front of 120 inch screen. It is more than adequate with good sound and good coverage. It was extremely easy to install.",
        "sound is excellent connected to my 145 watt per channel 7.1 Onkyo surround system, very happy. I installed it above my tv and was able to pivot the tweeter on a downward angle. installed it myself and was extremely easy.",
        "Haven't done a sound test yet. They showed up on time and in good condition, the installation was very easy. The grill and surround was easy to paint. Looks awesome!",
        "22 inch wide speaker that requires full depth around it. Standard home walls are framed 16 inches on center. If you buy this, make sure you have some construction experience in your tool belt, because you will have to cut the stud(s) in the wall to make it fit. My location was easier than most to resolve. If it's a load bearing wall look for a smaller speaker.",
        "I installed a set on the side of my tv and they sound great!",
        "Great speaker for the money. Best sound I've heard from an in wall. Easy install and a very solid speaker.",
        "Received quickly and sounds is good, price was in my ball park. I have already recommended speakers to a friend. Thank you Russell",
        "I'm more than happy to install this product to my home entertainment room, it does what it suppose to and I cant differentiate the sound quality from the much more expensive product than this..."
    ]
}