{
    "entity": "Coaxial Speakers",
    "text": [
        "Used these to replace the factory speakers in my 2008 Chevrolet Silverado. They work great a day seem to be good quality. The ole work truck is now a beats lab and the envy of the neighborhood ruffians who blast their Vanilla Ice and MC Hammer all day.",
        "Nice speakers for the price BUT ARE NOT EVEN CLOSE TO A DIRECT FIT for the front speakers on a 2001 Honda Civic as the add suggests. I had to order some 'adapter ring' from another vendor and still drill new screw locations. PITA that I happily would have paid extra to avoid if I knew ahead of time. Sounded much better than factory speakers once all was said and done.",
        "Installed in 2012 chev malibi LS you have to remove factory speaker. Then mount to the door ..have to drill 4 hole s around the opening. We're factory speaker was no clearer problem. No cutting! of the door panel ..good looking installation",
        "First off i want to point out that i initially bought these to replace my blown stock speakers and they did the job perfectly until i started to play them at very close to max volume. Which will allow Audiophiles to hear the shakes that it makes when trying to play 3 way all at once. Regardless though sound quality is a solid 8/10 because it certainly is better than what was in my car from factory.",
        "Installed in 2002 Suburban 2500 front doors w stock head unit. They sound great, can’t beat the price. Had to drill holes and use the included holes clips and splice the wires, but I didn’t want to spend any more on adapters for a truck that old. Also ended up disconnecting the stock tweeters since these have their own tweeter and it sounds weird with both connected. I will likely buy for the rear doors too.",
        "The speakers seem like good quality and fit like they should with very little modification to the factory mount. My only real problem is the sound quality. Which is mainly due to their size and the “three” way design. They don’t have very good low frequency performance and the higher frequencies are more pronounced than I like. If I turn the bass up and mess with treble and mid then it helps out some. But it’s still not enough. I would recommend these speakers to anyone but would say that if you’re concern is quality then I would go with a more higher price boss or other brand.",
        "Great sounding speakers for mids and highs. Lacks a bit in bass at higher volumes, but for the price they are great.",
        "I left another review I bought the 6x9 and 6x5 and the 6x5 blew within a couple of days on a radio pushing 50 watts rms to each speaker and now one 6x9 terminal is coming loose so out of 4 speakers I have one working they may be good for a car with a factory headunit still installed but they definitely cannot handle what there rated at",
        "Easy enough to install, however sound quality was HORRIBLE! Right off the bat , one speaker sounds blown or broken. The sound of the other was mediocre at best. Sorry but my 15 year old speakers that I was replacing had much better sound quality in comparison. Will see how the return policy works and hopefully I can trade up for speakers worth the time",
        "Good speakers, don’t get me wrong, but not really as good as what I was reading. They were worth the price, don’t let me discourage you from buying them because personal preference is everything and this is just an informative opinion. I put them in my sound bar in my soft top wrangler and I was replacing so y explodes that were just old, but they only sound slightly better than the explodes. They don’t have that clear sound like another more expensive brand I heard, but they did the job. They are worth the money, I’m just saying that they weren’t as good as most of the reviews I read.",
        "All around good speakers. Excellent upgrade from car factory generics. These are comparable to a 3 way Pioneer for less money. I DO NOT recommend running a powerful amp (for the 6 1/2) as the size of the magnet is similar to a 40 rms 150 max watt speaker. A low/medium wattage amp will suffice or they most likely will burn out. Superb bargain for those on a tight budget wanting crispier and cleaner sound.",
        "Retrofitting speakers in a car, 04 Trailblazer in my case, will require some modifications, especially in the front doors in my case. Once fit, the produce low mid frequencies in excess. Not boomy bass and not excessive treble. They will probably require you to EQ your stereo to make them less money. But these are hardly supposed to be high end speakers. You get what you pay for. But they do work.",
        "THESE BOSS 3 WAYS ARE PREFECT FOR MY REAR DOORS, THE SOUND QUALITY IS AWESOME HIGHS AND LOWS HIT PREFECT.",
        "These sound great very impressed. I have had several brands Pioneer, Sony, Kicker, and Rockford fosgate which I currently still use in my vehicle. I bought these as a cheap option for a office area in my shop, I mounted them in the ceiling and they are hooked to a \"300\" watt LG HI-FI system and wow for the price you can't go wrong.",
        "I installed this into my 99 trans am. Only needed one but for the price im happy it came with two. These fit great and installed unto the factory speaker ring just fine and it sounds great. Im using these with a setup that has the factory amp deleted. If anything changes with these speakers ill modify my review.",
        "IF you want cheap speakers that are no BS and just work, look no further. Wire them up correctly and mount them well, you will have a set of decent sounding speakers for very cheap.",
        "First here is what is being reviewed: BOSS Audio Systems CH6530 Car Speakers - 300 Watts of Power Per Pair and 150 Watts Each, 6.5 Inch, Full Range, 3 Way, Sold in Pairs. There's all kind of crud being reviewed here in the speaker page. These 6.5\" speakers are the boss, actually the brand. They do the job and I would buy them again.",
        "Great price for door speakers that needed replacing for years and finally got around to it..Even bought 6x9 for rear windows install that's how brave I was feeling...Will order again for other car..thx..PS door speakers came with wire to run to stereo thought that was great..6x9 speakers didn't..",
        "These speakers are nice and great quality for the price. The downfall is that they do not fit my 2002 Chevy Blazer without having to make modifications to install them. Which is a hassle in it's self to have to go buy other parts to make it fit properly. I'd say the speaker is more of a 6.75\" size and not the 6.5 it states it is.",
        "What can I say? 2 speakers for less than 20 dollars. I installed them on my 1999 Suzuki swift which had blown speakers. They sound about what you’d expect for the price, bearable but lacking base. They definitely won’t impress, but they’re great for the price. I paired them with a cheap Chinese double din stereo for a full 4 speaker Bluetooth system that cost less than 80 bucks. Great if you just want to get by with a car that you don’t love. But if you’re looking for something to put in your daily or a car you’ll have for a while please put in a few extra bucks and buy some nicer speakers. You won’t regret it.",
        "Some people bitch about anything and give a low rating, these people need to get help. I find the speakers I bought for my Blazer works very well when I turned the volume up sound great, did not use the face cover for them due to they fit in behind the door panel. Just screw in new holes will not match factory screw holes, but it is very easy to install. Great price ans sound, don't forget the cable adapters to make your install easy with the cables. I am a Sound Enigeer/ Electronic Tech for over 30 years.",
        "All speakers need a break in period. Just don't crank them up to the highest possible level and think you're doing this because you're not, you're probably blowing your speakers. Put them at a level that they sound as good as they can and leave them there every time you drive until a 24 hour total period has gone by.",
        "Reading the previous reviews made me hopeful, but unfortunately these speakers were awful. The drivers side blew within a few days, and it took a couple weeks, but the passengers side eventually blew out as well, and we don't even listen to music very loudly. Crackly from the first night they were installed. :(",
        "Sound quality is as expected for the amount paid, possibly a bit better than one would think to receive on a price tag like this one. I installed this pair into a Smart Fortwo 451 Pure , these were in addition to an all in one subwoofer I had professionally installed. Overall happy with my purchase and would recommend if on a budget and/or if just as a complementing upgrade from stock to an aftermarket subwoofer amplifier system.",
        "Purchased these on a limited flash sale. They sound much better than stock, but of course they are a budget speaker as advertised. Great Bang for the buck. Will most likely purchase another set for the back. These sounded better than I had anticipated for the price. Decent mid bass and treble. Would definitely reccomend for a cheap upgrade.",
        "These speakers are nothing special. For the price you get what’s expected. Music to come out of the speakers. There is a little rattle on one of the speakers but could just be a defective batch. Installing was a bit difficult. I recommend buying the connectors to connect to the speaker wire.",
        "Value for sure. Sounded great for your average person. They were clear and had a good range. I previously had much higher quality speakers in the car I installed these in and I was surprised at how well (clear) these sounded.",
        "i installed these in the fairing of my 04 Harley electra glide. i have a 300w amp( Rockford Fosgate) powering them. sound is great, clear and i can hear it doing 80 mph with a modular helmet on. i don't know how long they will last i've had them in for awhile and no problems.",
        "The are clearer than my old speaker but do not put out the volume they did. Noticed the stereo getting quieter as i changed each one out. I did a poor job of mounting them and one has a small rattle haha. I assume its the vibration on the door wall",
        "Wow! What a difference these speakers made for my 2014 Jeep Wrangler. The installation was a little tricky because the screws don't line up with the old ones at all, but I got it to work. And I am not an expert at installation by any means. Couldn't be happier for $20.Sounds like I spent hundreds.",
        "These speakers are legitimate crap. I installed them in my 2004 Chevy Suburban to replace the OEM speakers and they sounded blown from the get-go. I was using them in conjunction with a 12in bass box which was connected to an amplifier. The speakers were coming out directly from an Alpine CDE - 125 BT. They weren't being driven by an amp, or they probably would have exploded. They are definitely going back to the company. Picking up some Pioneers instead.",
        "Speakers looked and sounded great for about 1.5 hours. the the left speaker started to go in and out, after about 1.5 hours stopped working. Got home took in a part and checked all connection swapped right and left speakers, and the left side worked and the right side didn't. returned for credit.",
        "Not at all what they are listed to be. Strange screw pattern so i had to drill for my application. Sound quality is terrible. Bass doesnt sound deep and treble is painfully high. Very disappointed. I have purchased other boss speakers in the past and they were great.",
        "Honestly they perform worse than I thought they might but hey they’re cheap. They cannot handle any form of bass well either. They’re also about 1 inch smaller in diameter than needed to fit 6.5 inch speaker holes. I had to create my own brackets to use the speakers as well because there were no brackets provided. Either save your money and get a set of kenwoods or pioneers or just live with what you have now.",
        "I was hoping to be able to swap my Altima’s speakers with these but unfortunately the boss speakers were too small. I’m not the best technician either so I wasn’t able to figure out the wiring. I’m not sure how to cut and reconnect wires and was hoping more for a clip and play type of installation. Either way I can’t give a bad or good review but I hope this helps anyone with Altima’s",
        "Had to get replacement because box came damaged and parts thrown everywhere. My replacement came it was boxed a lot better, but the sound quality sucks. I was pissed but I guess you get what you paid for..I returned it just want my money back.",
        "These speakers sound great and I was really impressed that at this price they also included a set of wires. The wires are color coded, probably about 8-10 ft long, and have female disconnects on one end and stripped ends on the other. I was expecting to have to provide my own wiring for the project so it was a nice surprise that I could just plug the wires onto the speakers and attach the other end to the amp without even getting out my electrical tools.",
        "Preface by saying, I installed these in a 20 year old, so I wasn't looking something high end. But for the price, they sound great! The sound is a little tinny, with not a lot bass. If you are a big audiophile that wants high end sound quality, look elsewhere.",
        "Used to replace door speakers in 2006 Suzuki Grand Vitara. Definite improvement over original the bass is tight and mids clear. Had to do some reworking to get them to fit to my satisfaction but it was worth the effort. These are small, inexpensive speakers and are probably not going to provide mind numbing clarity, bass and fidelity but they sound good to me and are just right for my purposes.",
        "These replaced my honda civic door speakers flawlessly. All i needed was a speaker adapter ring and i was on my way to great surround sound.",
        "Perfect balance of sound and value for your money. Sounds great as replacements in the soundbar of my Jeep Wrangler TJ and with such a great price you really can’t go wrong.",
        "I bought these speakers about 3 6 months ago. They were easy to install and sounded great (with some tweaking of my equalizer). When installing them, I suggest soldering the wires, because the wires that came with them are a bit...brittle. I still like their sounds, and love how they compliment my sub. I turned the lows down, and turned up the mid and high-end​ responses, and i love my sound experience. I wish they were a bit clearer, but for the price, I can't complain.",
        "I gave it 5 stars for the price. You can't complain if you weren't willing to spend more. They sound good at medium volume. installed on my 2001 Silverado work truck. factory speakers were blown so this was a nice replacement.",
        "If you want this to sound loud and clear, get an amp of at least 600w. I got them installed first to the radio did not like them and when I got an amp Now I love them.",
        "Dont expect top of the line .These speakers do the job for non amplified straight off the deck speakers . Dont try to amp these up to stated rms they will blow .",
        "The wiring supplied was not good as heavy as I like, but I was buying speakers, not wire, so I used my own. They sound good and clean through all the volume range,non amplified. I would recommend them to anyone using a standard stereo system.",
        "Front speakers in my car went out so I elected to go with these just to have front sound once again. I was definitely impressed for the price! Bass sounds great and clear sound. Great speakers for the price.",
        "Sounds better than the 01 stocks that was in the car.. And seem to be holding up pretty good.. It's one of those deals where you get what you pay for. Would I buy again sure for the price I would because they do work..",
        "I installed this on my Honda Civic 2004! The holes were in different placements then my old speakers but I was able to drill new holes. It works great! I bought a wire harness from Best Buy to connect the wiring to my car! I put them in the rear speakers. Sounds great!",
        "Cant give a review on sound quality, bought these for a BMW E46 330i because Amazon said they fit. They look nice and the build quality looks good. The only problem is they are a 1/4 inch to big to fit in a BMW. It would require you cutting your door panel. Gave them 3 star only because I am unable to install them and give them a real test. The speakers where not the issue, its was being told they are a direct fit for my car.",
        "Bought these for my husband..the speakers in his truck sounded not as good as they should've! So these replacements worked wonderfully. It's crystal clear, you hear everything and you dont even need the volume up too high! Hes happy and so am I!",
        "Speakers sound pretty good for the price. A little bit on the canny sounding side, but for $20 they are well worth purchasing. I also mounted them into the round 6.5\" speaker enclosure set and that improved the sound of these speakers.",
        "Installed in a 2012 Honda Civic, I left one of the factory speakers in just to hear the difference and the factory speakers sound better and they are louder. Very easy to install and it works but honestly I wanted louder speakers then the factory so I’m going to put the originals back in tell I find something better. If your not worried about how loud it is and the quality of the sound and your just looking to replace like a blown speaker for cheap then this is a good option for you",
        "Was used to replace OEM speaker of 2008 Veracruz. Needed to be customized in order to work. It works but is not of OEM quality.",
        "Yes, these are good speakers. They are not just good for the money; they are good in general. I have paid $40 and $50 for speakers that were out matched by these. I use them as door speakers in my truck. They definitely beat the factory speakers.",
        "Sound is quiet and tinny. No ooompf behind the speakers. 150 is \"max\" power per speaker, I'm gonna guess RMS is 20 because the sound is that lackluster. An average of 4 star review seems very generous. If you're selling the car, don't care about audio quality, or literally only have $20,these are fine. If you're looking to improve working speakers, these won't help.",
        "A little tinny, but fine. Fit the available space. 2009 Malibu, front door. You will have to removed the modular speaker unit and drill mounting holes. Order adapters for wiring connection or cut the connector off of the original speaker. Hot glue the connector to new speaker and solder the wires and plug it in.",
        "Product is good. Great for the money. Stupid Amazon packaging. Giant box and packaging waste for 1 small speaker box and antenna.",
        "These speaker are exactly what you’d expect for the price. Boss may make a better quality, but these are not worth the money. Save your $25. The amazon return process was super easy.",
        "Worked perfectly in my 1982 Dodge W150. Sounds excellent and easy install with great figment in stock door speaker locations.",
        "I bought the wiring adapter along with the speakers and the installation went well with out a hitch. I couldn't use the original mounts which were snap in plastic rings.",
        "not a plug and play but did not expect that, look at online methods to remove and replace inner door panel. They also advise on installing.",
        "These are just fine for my needs. I am NOT particular about high quality sound. These are able to drown out the noise of thinks banging around my cargo van. These were easy to install in the front doors of my Chevy Express van. I would buy them again.",
        "Like the fact of the red and black color scheme. Dislike the speaker wire provided did not have proper connections",
        "It said it fits for a 2003 Honda Accord. It does not, the top is too wide for the stock hole. Good price they don’t sound the greatest either.",
        "These speakers sound nice and look great. They are universal so one has to be creative.",
        "I love music and these Boss speakers push out a great sojnd for the price easy to install and came with enough speaker to do the job",
        "The speakers are great. Can't beat the price. And easy to install. They look sweet when all hooked up.",
        "I've been through 3 with these speakers!!! door speakers.. only putting 100w into them..",
        "I was upgrading the sound system in my truck with and while I was still buying parts for it, the stock door speakers blew out. I found these super cheap and needed something to get me by until I could upgrade permanently, they showed up the next day. I installed then and was very impressed. Unfortunately they didn’t last, after 3 weeks one of the speakers blew out.",
        "I had to leave a review, And I don't normally do so. With these speakers, I had to say something! As a Hobby woodworker, I wanted to spread the sound in my media room, so I ordered these 6.5\" Boss Speakers, I gathered some scrap wood pieces from my shop, and put together some 8\"X8\"X8\" little (Cube) cabinets for them out of 3/4\" Oak. Just awesome sound coming from them, delivers a nice base with well matched Mids, and Highs!",
        "Installed these in the rear doors of my 96 Blazer. Speakers sounds great and installation was painless. Mounting holes did not match up but didn't really expect them to, I just drilled new ones. Great bang for your buck. I'd recommend for anyone looking to upgrade from stock. I think I like them better than my $50 pioneers I have in the front seats.",
        "Put these in the front doors of my 2000 S10 Blazer. They fit perfectly and just required drilling new screw holes in the plastic housings. Easy install and the door panels for back over them no problem. I’m using the factory radio and these sound great for as cheap as they were.",
        "If you are looking for a replacement speaker for a blown stock speaker and dont want to spend alot of money but need a good sounds quality this is a good choice.",
        "Not a direct fit for my 2001 Civc EX Sedan but with some fabricating and work they are certainly an upgrade from the stocks. Can't beat them for the price but don't expect to be blown away.",
        "Great Sound and Great Value. Used them for my custom bluetooth box. Will be ordering more.",
        "My outside speaker went out and needed this to be replaced, so I order them here from a great price. I was able to get my speaker working again with a great quality sound, i save $100 by not buying a new one instead I just replace it with these parts.",
        "I thought they would be alot louder.they are louder with the right adapters that you put the speaker in to be able to mount to your vehicle. But without any surround there isn't much noise.",
        "Great sound for the money. If you want Bose sound buy Bose speakers but if you're on a budget these are of good quality. No issues as of yet. Have been installed for three months.",
        "Have a Nissan Frontier, 1999 year model. Worked perfect. Easy to install using existing wires and mounts. Good quality. Thanks.",
        "Purchased to replace blown speakers in my work truck and was pleasantly surprised with the sound quality. My only real complaint is the wire that comes in the box is absolutely junk. If you can't reuse the factory speaker wires don't use the ones that come in the box.",
        "I bought these to replace the factory speakers in my 2016 Nissan Versa Note. The factory speakers were tinny and gave out at higher volumes. These Boss speakers weren’t hard to install but they are only marginally better than the factory speakers. They are not louder but do have a more consistent sound. They are a good, not great, replacement for the price. I will buy better speakers for the back of my car, though.",
        "Worked and fit well in my daughters Volvo s40. The sound wasn’t the best. Good for the price",
        "There is not a 3 hole configuration. Amazon said it was a match for my Honda Element, but I had to drill new holes in the rim to make it work. Aside from that, the sound is good, and I don't understand how they can make money selling them for so cheap.",
        "Replaced my factory front speakers with these. They are about as loud as my factory, but the sound quality and bass is much better. Will be hooking up to an aftermarket radio next week and see if that will make them louder. I have no complaints and am quite surprised by these speakers.",
        "As promised , greatsound and fit perfectly in our 2010 Silverado",
        "I ordered these for a friend that has a '97 Honda CRV since one of the original speakers died. Installation was pretty easy but sound quality was better on the original, almost 20 year old, Honda original speakers. Wouldn't recommend unless you're only looking to spend the less mount of money possible just so you can still listen to your car stereo!",
        "Nice full sounding general purpose speakers. I bought 2 pair for my daughters VW Beetle. They fit perfect in the doors and easily in the rear as well. They are not great, but for the price, they are perfect. Sound comes out of them. They work. A bit flashy which my daughter likes. I think that as long as they make sound they are pretty good and using that scale, these are very good...",
        "For the low price i was sceptical but these surprised me. Sound great even at higher volumes. Good product, great value.",
        "I am more than satisfied with the quality and sound of these speakers...toss in the low price and this is a hard deal to pass up! Very good!",
        "Boss was never a really good brand of audio but i was really impressed with these. great value and sound quality!",
        "Decent for an inexpensive speaker. The sound is a little bright. I like that they have plastic cones because my old truck doors are far from water tight.",
        "What can I say, they were cheap. The sound quality is so-so...no bass. What can you expect from cheap small speakers. I bought them to put in an RV to be able to have a little better quality sound...it failed.",
        "Easy to install in my 2002 Chevy Suburban LT. The sound is decent for the price. It sounds a little tiny. The instructions to install it were easy and it only took me about 20mins to put in.",
        "The quality isn't very great. They are good for lows but I can't seem to balance out the mid, and the highs are good but if there's too much volume they begin to crackle horribly. Wish I would have went with pioneer or some other brand. I have a sub, amp, and bought a stereo from boss and haven't been really pleased with any except for the price.",
        "After two different sets these are GARBAGE!!!! They work for about 3 days then the different tweeters and woofers started going out. The sound quality was amazing WHEN they worked. Too bad it don't last.",
        "Maybe i got a bad batch but for whatever reason no mater what i do, at the frequency of a G note they buzz/rattle. They sound fine but the buzzing is maddening, and i know its the speaker itself not the enclosure. I have the 5 way 6x9's of this same series and their ridiculously awesome! idk what the deal was with these.",
        "Easy to install. Appreciated the wires with clips already on them. Made install super easy.",
        "These speakers just work. There isn't anything special about them. But for what you pay for them, you can't expect amazing highs and deep lows. But they work. They're easy to install, with a basic two pin interface. They don't sound bad. There isn't any grain or interference. If you're looking for something to upgrade your stock speakers with, you could start here. BUT, there are speakers for just a few dollars more that would blow these guys out of the water.",
        "Sound quality no where near the sound quality of the stock entry level manufacturer speaker. Speaker was installed in the lowest basic trim package of a 2004 ford regular cab ranger pick-up. Purchase to replace one factory speaker that stopped working after 15 years. The existing working ford factory speaker is 100 times better. I didn't expect a lot for twenty dollars, but I am shocked by the extreme difference."
    ]
}