{
    "entity": "Electric Kettles",
    "text": [
        "This is my 2nd Chef's Choice electric kettle. The first is still fully operational after at least 6 years, but the lever for the top got a little iffy. I LOVE this kettle. I use it at least twice daily and I honestly don't know why I didn't switch to an electric kettle years and years ago. Cleaning lime build up (our Nevada water is brutal) is just a matter of heating about a cup of water with about 1/2 cup of vinegar and letting it sit to cool, then rinsing thoroughly.",
        "This may have been a good product at some point (it was recommended on Good Eats back in the day), but production quality on it is horrible as of 2016. I've had this for less than ayear and the lid no longer closes and so it doesn't shut off properly and sits there boiling away which overstresses the plastic even further (and the plastic inside the lid is now getting weak and gross). Do not buy this. There's better options for the buck that don't use weak plastic hinges and lids.",
        "I am replacing one that I have had for a number of years because the Auto-Off function stopped working. I bought my first one based on the recommendation of Alton Brown. It heats water very fast, has a large opening that allows easier cleaning. My mother used to heat water for tea in a stove top kettle which took forever and she did not like microwaving water because it does not retain the heat long enough - she is very happy using this kettle.",
        "This hot pot lasted exactly 4 months before the auto shutoff didn't work. About a week later an electrical burning smell came from the unit and it ceased to work. Although a fan of Chef's Choice products, this one is a severe disappointment. $60 is too much for a product that only lasts such short time.",
        "Pros: Heats water quickly, easy to clean. Cons: Mine doesn't always turn off when the water boils. It will sometimes sit on the counter heating the water to the point that it causes the kettle to shake around. I wouldn't feel confident turning it on and walking away for 10 minutes. As it boils, steam can escape from the hinge at the back of the lid. I've burned myself twice because of this. I was hoping it would be a single piece all-metal container, but there's a plastic connector to the water meter on the back.",
        "The most amazing and effective kitchen device I've ever used. Heating water for cooking faster than any stove, boiling eggs, making umpteen pots of tea. Lime hardly builds up and is easily removed because of the very large, wide swinging lid. We've owned two so far and both are still in service (passed the first one on to my mother for gentler service). The ONLY drawback to this product is that the level indicator seal gets leaky after 5 years of service and dribbles onto the base. Thank you Alton Brown for recommending this product many years ago!",
        "I wish there were a way to open lid further and temperature control would be nice as lid has slightly warped due to heat of water over time!",
        "I bough this 5 weeks ago and it has already stopped working. It is tripping my circuits and does not work at all. I owned one previously for several years and it gave out....this one only survived a few weeks. Workmanship must be poor on this one.",
        "I like that it's cordless and I use it often. Unfortunately I was hoping to use it also as a cooker but the automatic shutoff keeps interfering with the cooking of anything. Next time I'll get one with a timer (if they exist)",
        "Mine has been in constant use since March 2010 and the poor thing just died. No complaints from me, I've already ordered it's replacement.",
        "The Chef's Choice 675 Cordless Hot Pot works beautifully. It heats quickly and I like the stainless steel of the pot. I love that it turns off automatically when lifted off the heating element. My only complaint and warning, be very careful when pouring boiling water. The top is not tight fitting and water does come out on each side of the spout. If you are not careful you can burn your hand with boiling water, as I did.",
        "I have had one for over ten years and had to replace it because I broke it. It has travelled for 70,000 miles on business and pleasure trips. Great for making hard boiled eggs for breakfast, warming soups and other foods. Very easy to clean. It is primarily used for heating water, but as stated can be used as a hot pot for cooking. I was thrilled that it was still being made. My recipe for the eggs is: put 4 eggs in pot and cover with cold water. Bring to a boil and then wait 20 minutes. I wash the eggs in hotel rooms before placing in the pot as a precaution .",
        "We wore out our first one after about 5 years. We use it 2-3 times a day. This is our second one.",
        "Second one I've purchased, the first one I purchased years ago. I would not be without it. I use it twice daily to boil water for my coffee French press, as well as other tasks but I use it daily for this purpose. Thank you Chef's Choice for continuing to produce and distribute an excellent product - unlike some in the cooking manufacturing community who ceased making an excellent product.",
        "Using for two weeks now, so far so good. This unit has a seamless stainless steel lining. That equals no bad plastic tasting beverages. I bought a Braun that was lined with plastic and it made my French press coffee taste LOUSY. (I can't imagine using the Braun for a lightly flavored tea. Maybe the more expensive Braun's are stainless, but not for this 49.95.)",
        "Great product. I am replacing the same model that I bought about five years ago and wore out after lots of use",
        "I love this thing, it boils fast, has a large capacity, is easy to fill, turn on, turn off and pour. The only reason it doesn't get 5 stars is because the lid doesn't lift very high which makes cleaning just little tricky.",
        "You need to buy this if you dont have one.",
        "Love this kettle. I use this almost every day. Use it for heating water for cooking. Way faster than stovetop. I just heat water,then dump into a pot on the stove. Shortens heating time for a pot of water by a good 5 minutes Also great for making hard boiled eggs. Just add eggs and water, bring to boil and leave in the pot for 5 minutes or so. The only problem I see is that it can be difficult to pour without spilling when the kettle is full. I would not recommend this if you have low strength in your arms as it can be awkward to pour.",
        "It boils water quickly, and the wide mouth is convenient for putting eggs in, etc. However, within a week of purchasing it, it stopped automatically shutting off when the water got to a boil. Without an automatic shutoff I might as well be standing over just a pot on the stove. A little disappointing.",
        "I purchased this hot pot for boiling water for coffee. I wanted a full stainless steel interior that would be easy to clean. It was. However, the hot pot had 3 major problems. 1. It did not turn off after the water boiled (did once and never again). This is a major fire hazard. 2. It let off a ton of steam (compared to other hot pots I have had) which started to ruin the paint on my kitchen cabinet above where it was on the counter. 3. The lid on top did not close all the way. I returned the item.",
        "We use this mainly for water but have used it for other liquids. So much better than a stove kettle. If it stops working a little sandpaper will clean up the connection with the base.",
        "We bought this because Alton Brown recommended this one and it seemed to fit out needs. We have had it for over a year now and it's still GREAT!!! Love it and don't ever want to live without it. It has a good opening to put the water/or other liquids into it easily. It heats up very fast too!",
        "Our original one died and there was no question that we would replace it with a new one of the same kind. This hot pot is efficient and its features satisfy all our needs.",
        "I bought this item on the recommendation of a friend. It's works great with heating water quickly. It definitely takes less than half the time of a microwave oven. I suppose the only issue is the automatic shutoff. It does work but it takes a little longer than I would like; the water is at full boil for at least 15 seconds before it shuts off.",
        "Heats ridiculously fast. We have a tear drop camper that holds 6 gallons of water but no heater so we use this to heat water to wash dishes. We are impressed.",
        "I can't say about durability over years because I've only had it for a month, but its everything I hoped for -- the automatic shut off works, but sometimes it seems like it shuts off well after the water has been boiling for a while. I have no problems with spilling when pouring. Overall very useful.",
        "I bought one in 2008 and this is the end of 2015 already. Still going strong! Be it boiling water or cooking instant noodles! My next hot pot will be this same one!",
        "Good capacity, and with 1600 W heater element, it gets the water to boil extremely fast. My issues with it are that the lid does not open wide enough that it is hard to reach inside the vessel to place or pick-up eggs. The boiler could also use a \"Low\" setting, at about 800W, so that the water doesn't foam and boil over every time I make pasta or noodles.",
        "Very simple, simple is good! Use it every morning. Excellent design. I knew Alton Brown would not steer us wrong.",
        "I HAVE USED THIS SINCE 2005.NEVER HAD ANY ISSUES.JUST BOUGHT ANOTHER ONE FOR MY DAUGHTER.STRONGLY RECOMEND THIS.WORTH THE MONEY.PLEASE DONT WET THE BOTTOM PART.CLEAN ONLY THE JAR.IT WILL LAST LOOOOOOOOOOOOOOOOONG....",
        "This thing boils water so fast, it is great! It is also nice because it shuts off once the water is boiling.",
        "The kettle function well. But the plastic cap was really in cheap quality. And it cannot totally opened. I bought this product as a hot pot, but the heat couldn't last long.",
        "perfect kettle. love it. Expect nothing less from a product that Alton Brown recommends.",
        "The product arrived quickly and in good packaging condition. I really liked the large opening because it is easy to pour into. however, the content kept boiling over and made a mess on the counter every time. Other electric kettles I had did not have this problem.",
        "Wish I could provide a more in-depth review. Alton Brown recommended this kettle, so I purchased and found that it was non functional. Returned it for a refund. seemed to be well-made. I liked the straight sides and large opening, but it wouldn't heat. Didn't want to troubleshoot bad electrics, so returned and decided not to replace.",
        "Just received it and am returning it. I had thought that the interior was 100% stainless steel, but it's not. There's a silicon piece inside the pot at the bottom (which is connected to the bottom part of the handle).",
        "It could have been a good kettle only I can't use it in australia! Yikes would have helpful to say that. It has cost me $45 freight to send back of which I'll get $15 refunded..NOT HAPPY JAN !!!😠",
        "I have been looking for an all stainless steel electric kettle with a wide mouth opening. It makes it so much easier to cook something in it, and to clean of course. I love everything except for that hole inside the kettle where water goes in to indicate the water level on the outside of the kettle near the handle. That hole makes it a bit tricky to clean as you have to completely drain the water from the water level hole if not you will be tasting soap. I don't use much soap when cleaning it. That's why it's 1 star off. Otherwise this was good, especially during travel.",
        "This is a kettle that I would only use for heating water. There is a vey tiny clear plastic straw like channel to measure the amount in the kettle. I don't know how that little channel could be properly cleaned if this product were to be used for food preparation. Yuk! This equipment is too unhygienic to recommend it's use for food preparation. I did not not need a kettle so I returned it",
        "Great product, as advertised. Heats full amount of water to a boil with-in minutes. Reccomended by Alton Brown (good Eats). Just as described, I put 6 eggs in, filled with water, pressed button. Unit heated quickly to a boil, shut off automatically and waited 10-12 minutes, cooled the eggs and they were absolutely perfect, I've never had a better boiled egg! Excellant for soups and other beverages, including coffee. Cleans easily do to stainless steel construction and the heating element not being exposed. Cordless adds benefit of \"no cord\" to worry about while handeling a pot of boiling liquid. Highly reccomended.",
        "I purchased this kettle from amazon about 9 years ago. It still boils water for my morning cupp'a quickly. I agree with other reviewers about the positive aspects of this kettle, but because it doesn't have adjustable temperature control I would only note that it isn't ideal for green, white, or oolong teas - I still use it for those teas, but transfer the water to a tea pot and use a thermometer to measure when the water is the appropriate temperature.",
        "Had one for many years that finally gave out. Tried different brand but seemed far more cheaply made. These are simple and easy to fill and the element does not touch the water. So I bought a new one to replace the one I used twice a day for many years.",
        "Yes, this is the kettle that Alton Brown uses on good eats. I had to replace my last electric kettle that looked like a regular tea kettle when a guest at our house put it on the gas stove to heat some water (mmmm. . . nothing like the smell of burnt plastic). So, I figured getting one that looked different might prevent future accidents. This one turns out to be much quiter then my previous kettle and I like that you can lift the entire lid to get a good cleaning in if necessary.",
        "What I like about this electric kettle, is that it's fast, and convenient, which is great for making French press or Aeropress coffee. It's large capacity is handy for brewing a large pot of tea, to make iced tea. The large lid opens more than similar kettles, which allows for easy cleaning, temperature checking, and more unconventional uses. The only issue I can think of, is that if you plan on making pour over coffee, you may prefer a boiler with a gooseneck or a better spout.",
        "Very poor quality. The first one came with rust. It was swapped in a timely manner. But the later started to leak near the gauge in 2-3 months. Design is very bad and may not last longer than a year. Also the steel is of low quality. Not worth the prize. Good thing is that it does boil water very fast!",
        "This is the second one of these I have owned. The first one finally started getting rust spots, after 12 years of daily use - quite literally daily use. It is one of the most reliable appliances I have every owned, and a dozen years later, - the new has no changes, same exact quality. No frills, simple, works every time for years and years. A great deal!",
        "This is a well-built electric kettle. The only thing I don't like about it is the lid does not open all the way making it a little difficult to clean - so 4 stars instead of 5. Other than that it's very easy to use and durable with a sturdy and stylish base. I'd recommend this to most anyone needing an electric kettle and it is worth the extra money over cheaper models/brands.",
        "Love it - incredibly fast, much faster than a kettle - depending on how much water you put in it, it heats up in about 90 seconds, seriously. Can use for any liquid but we use it for water for tea or coffee press. I don't know how long it will hold up based on other reviews but it is really convenient. The pitcher comes right off the base, it is easy to fill, overall a great product.",
        "I bought this as a gift to my daughter,. haven't given it to her yet but my son has the same brand of Hot Pot as this, same number, etc so am sure she is going to love it as she wants one!",
        "When shopping for a gift for my husband, I read Alton Brown's website (he hosts the show Good Eats) and was impressed with the idea of owning a hot pot. We make hot water on the stove for hot tea and cocoa frequently during the winter, and iced tea during the summer. This hot pot is superior to heating water in a kettle on the stove. It's one appliance that will stay on the counter, it gets used so often!",
        "If all you want to do is heat water, this is the best. It is fast, quiet and reliable. It pours very well. This was purchased to replace an earlier version of the same model. Unfortunately, they shortened the cord a bit (pulled all the way out) and removed the red float, so it's harder to see when you have the right amout of water in it. However, it is still a really great product.",
        "Perhaps the best way to heat up to 1 quart of water. Faster than the stove or microwave, and the auto-off makes it simple. We use it for heating small quantites of water for cleaning dairy related implements and tools. And it does great for hot drinks.",
        "This is awesome. We have had a couple of different brand name kettles in the past. This gets so much hotter so much faster.",
        "Large capacity, easy to use, easy to clean and boils quickly. Very happy",
        "I've had other electric water kettles but like this one the best. The wide mouth makes it much easier to scrub out.",
        "Love this little hot pot. First off it works well and it does shut off automatically. Second the cord is long enough as it was just wrapped up underneath. Haven't attempted to use it for anything other than just water so I can't say how it does with anything else.It's faster than boiling a kettle on top of the stove though.",
        "this beast just keeps on going. only the spring on the lid is worn out so i have to push the lid up with my finger. the auto-shut-off feature takes a while to activate so you need to be present when it boils or you will waste some energy. i just tested it and it uses just under 1400 watts.",
        "Despite mixed reviews I haven't had a single problem with this kettle and I'd buy it again. My tea is ready in 5 minutes flat and the reheat is two minutes. I also tried hard boiled eggs in it, worked great. I would buy this product again. Update, 10/25/2010 Still working 2-3 times per day.",
        "Bought this product due to a recommendation from Food Network's Alton Brown of Good Eats and Iron Chef America fame. It boils water, automatically turns off, and doesn't have a rim to cause stoppages in Ramen noodle delivery. I haven't tried to make Ramen in it yet as I am concerned that the measuring window will be difficult to clean.",
        "There are cheaper ones and there are more expensive ones, but this is the one you need to buy. It has the largest opening so you can access the inside for cleaning and--Boiled eggs, thanks Alton Brown for the tip!-- and no plastic exposed to high heat. We use every day and strongly recommend!",
        "I saw this on Good Eats and Googled that and electric kettle and found it. I don't drink hot drinks that often but I use it for brewing tea for iced tea and also for iced coffee drinks. I also hard cook eggs in it. The wide mouth is better than the kettles with smaller openings. The auto-off feature is a great addition especially for the eggs. Just add a few minutes for soft boiled eggs or a few more for hard cooked. Love it.",
        "I bought one for myself and use it everyday....several times each day. I just bought another to give as a wedding gift. It is perfect for tea drinkers, and you can also heat soup and broth. I highly recommend it!",
        "Have used this continuously now since purchasing - and Alton Brown was RIGHT! This heats water quickly, is easy to use, is less costly than turning on the stove, and it works great. Would recommend.",
        "Alton Brown was right about this one. I use it daily and it does free up the burner where the tea kettle used to be. It also heats faster than the kettle did. Works perfectly. Mostly I heat water in it, but I have cooked eggs as well.",
        "Very disappointed in the product. The boil-over sensor broke in the first use and the water level sensor trapped fluid and did not seem sanitary. When I contacted Chef's Choice to request a replacement, they refused because I did not return the defective product from New Zealand to the US. It did not seem to make sense to transport a broken hot pot half-way across the globe. I had a 10.00 hot pot that lasted for years. This product does not seem worth the money.",
        "I expected this electric kettle to heat a little faster than my stove top kettle set on the burner...but I didn't expect it to heat that fast! Love this kettle and I am kicking myself for not buying sooner!",
        "Absolutely incredible pot.This is our second.The first lasted for over 20 years. What more can I say!",
        "I have used this like 4 times a week for past few years. Boils fast and built to last. I recommend it highly!",
        "Perfect performer, another Americas Test Kitchen winner recommendation for category. I use it nearly every day.",
        "Dissappointed the lid warped from the heat and as such no longer shuts off automatically. I place weight on the lid now or just wait until its ready. I use it daily for coffee, hard cooked eggs, soup stock, etc.",
        "This is REALLY nice. FAST boil and easy to clean--no exposed element-you can use it for anything. It is EXACTLY what I wanted and am VERY pleased. We use it every day. Eggs, tea, stock--it does it all and easy to clean stainless.",
        "I love this electric kettle. The design is simple and beautiful, and it has the biggest opening I've seen on an electric kettle. We used it at my cafe, and it was a total workhorse. It finally broke down after at least 1000 uses.",
        "Never knew I could get boiling water so quickly! I use it for everything, beverages, soup, and best of all to speed up boiling water for cooking pasta and canning.",
        "One of the very few disappointing purchases from Amazon. The auto shut off feature stopped working after a month. Now if I forget about my boiling water it will just cook away until there's nothing left. Waste of money. UPDATE: Yesterday, not only did the boiling shutoff fail, but the emergency shutoff failed as well. I forgot about the boiling water (which is what the emergency shutoff is FOR) and smelled burning plastic. Went into the kitchen and there it was, the base completely melted and fused with the kettle. If I didn't smell the melted plastic and unplug it, it could've easily started a fire. I will NEVER buy ANYTHING from this brand again.",
        "It worked well for about 6 months, then the on/off switch started to go out. 4 months later it does not work at all. Dont waste your money.",
        "This item was received dead on arrival.As in inoperative. I guess I could use it as a pitcher.",
        "I LOVE this hot pot! Water comes to a boil in a minute. It turns itself off and basically delivers everything as described. I highly recommend this one.",
        "This is a nice product, doesn't heat as fast as the kettles I'm used to using when traveling abroad. Actually the whole reason I bought the \"international\" version was in the hope that it would be like the ones I've used there. Also the picture of the product I did not think that it would be metal, but rather a white material. I really did not want stainless, but that's what it was. The design and ease of use however is excellent.",
        "1) Leaves water mineral stain on inside that does not come off. 2) Lid cannot be removed for proper cleaning.",
        "Piece of junk. Only lasted a few weeks. Waste of my hard earned money.",
        "A terrible piece of crap. The lid doesn't close properly, so the steam burns the crap out of your hands. The temperature gauge doesn't work, so it sits and boils and boils until it lights on fire and burns your house down. Because it's a fire hazard that needs to be watched every minute, there is no more convenience to it than a conventional kettle- at least then it would whistle when the water's hot. If this slips your mind for a couple minutes, you might be running for your life, trying to escape your house fire. Worthless. Will never buy this brand again."
    ]
}