{
    "entity": "Electric Kettles",
    "text": [
        "Bought it five months ago and already full with corrosion. How disappointing. According to the company policy this product is not entitled for return which makes it even more disappointing.",
        "First I was very happy with the product. Nice kettle ,beautiful design, good performance That last about 2 months, Recently I noticed crack on plastic part next to glass (see pictures). Kettle is use daily, never been dropped For me look like material problem. Before this kettle I was using different brand ($20) no problem for 3 years. I hope the problem is with my unit only",
        "I used Breville SK500XL for a about 2 years and it was ok. Recently the plastic cracked near the power button. I decided to buy a new one - the same model as I liked the design. After using the new one for 2 weeks, exactly the same portion of plastic cracked near the power button. I returned it and decided to buy a different brand. When I bought another kettle (different brand), I noticed that the plasticky smell that usually accompanied the boiled water disappeared. Turns out that I put up with that smell for 2 years and didn't even know that it was because of the Breville kettle. Will not buy Breville again...",
        "SO disappointed. Like others who have commented here I had a Breville hot water pot identical to this one for 8 years. It stopped working eventually and even though I read here that the new ones were not as good, I bought. That was November 26, 2016. Here we are 4 and 1/2 months later, and it died. It will not power up, it blinks but won't stay on to heat the water. DO NOT BUY THIS! There's got to be a better choice for this amount of money. Shame on you Breville. What happened?",
        "Plastic around kettle disintegrated and stopped working exactly a year after we bought it. Very poor quality",
        "I bought this a little more than a year ago. The ring around the switch started breaking up a couple of months afterwards, but that did not interfere with its functionality. The product looks and feels high quality. However, just this past week, after a little more than a year, the kettle started blowing the fuse, and I have to throw it out. Not going to buy another Breville. I expected a longer life cycle of a product in this price range.",
        "I was swayed by the brand name. Laugh all you want, but the design of the Breville power plug is what won me over–it shows great attention to detail and usability. This product is no exception. If Apple designed kitchen appliances, they would be hard pressed to create a better kettle. Drip free, ergonomic, classy smooth-open lid, and a fast boil in a clean, sleek design.",
        "This kettle is our go-to gift for house warmings and move in parties. We have one and have gifted several others. When my wife wanted amother for work she ordered this from Amazon because she didn't have time to go to the physical stores anymore. The BedBath version has a water level gauge that lists units of cups. The Amazon version has a gauge in Liters. Also the BBBeyond version lights up the whole water gauge window. The Amazon one only lights up the bottom of the gauge window. Functionally, a great kettle, but we prefer the BBBeyond version.",
        "Recap. I really like the Breville hot pot. Had the first one for a couple of years. Had to replace it as the plastic trim that surrounds the view-able water level feature cracked and broke away. Bought this replacement in March 2016 and now the same thing is happening. We use this pot daily for tea and heating water for French Press coffee. I dont know what the answer is to this problem but what ever materials are used in the plastic trim around that area breaks out in the same place. This is a manufacturing issue I believe.",
        "I bought this back in 2015 and have been using it nearly every day since. It's still in great shape, though I have had to attempt cleaning out hardened mineral deposits, which was not an easy task. Nevertheless, it is reliable, simple, and works well. It continues to serve me well today!",
        "I really liked the look, size, and solid feel of this kettle. In fact, I liked it too much. I got one for home, one for work, and one for my sister. I even got another one for home when the first one broke. Only the one at work is still working. I would give it one star except that none of the competitors seem to last either. What happened to the old English models that took a higher current and lasted forever? If, like me, you are willing to pay a large premium to get durability, then save your money on this one.",
        "We use this every morning to prepare our hot lemon water with cayenne. I pour filtered water in it each evening and with a quick switch in the morning hot water is ready in no time. No more microwaving or waiting for a pot to boil on the stove. Great for hot tea preparation. Owning this seems a tad extravagant but what the heck- life is short, no time to wait around for water to boil.",
        "This kettle gave good service. Love the quality and the product. But for 80$ at the time of my purchase 3 years ago, this didn't last. The bottom edges have given out and the kettle now leaks. For the kind of money I paid, I was expecting it to last at least 5 to 8 years. This was disappointing, hence 4 stars. Otherwise this is a good quality kettle.",
        "I only keep things on my countertop that aren't ugly, and the Breville is a stylish little appliance. It heats water quickly, has a quiet \"ding\" to alert you that the water has boiled, opens and closes easily, and I like the clear bit in front so you can easily measure the water, the swiveling base, and the fact that the cord is easily manageable. Zero complaints thus far.",
        "I bought this in November 2015. Around 6 months ago the button to open the lid stopped working. Then around 2 months ago the on-off switch started falling so that it would not automatically switch off. The kettle is now retired. For the price, I can't understand why it seems impossible to buy an electric kettle which lasts 10 years. I operate switches in vehicles all of the time (think indicator or starter etc etc) or light switches in the house and the failure rate for this kettle based on my experience and other reviews is not acceptable. I cannot bring myself to re-order from this brand again.",
        "I'm very happy with my Breville kettle. It does a lot of things well: * It pours cleanly! Even when you pour quickly. No more puddles all around the kettle. * A little bell chimes when it switches off. * The opening is large enough to reach in and scrub off the scale a vinegar boil won't get. * It boils water quickly. Much faster than other kettles I've had.",
        "This was used several times a day every day for 2 years and then died. I am contemplating contacting Breville who might send a replacement, but that's not really what I want. What I want is a product that doesn't end up in landfill and or recycling after 2 years. I can't give this product a good review because its nothing better than average and has left me disappointed.",
        "I bought the item in February 2015, the item starts to show 1\" x 1/4\" thick rust around the right inside-neck. I use that to boil water 2 to 3 times a day. Maybe we need to empty that at night to dry? Breville is a good brand but after 9 months of use!! It boils well, very attractive looking and very versatile, still, I need to replace that with another one. I used to buy all the kitchen appliances from the Bloomingdale's near my home, for the past 10 years, they honor any returns all the time without attitude. This is the first time I bought from Amazon. I wrote to Amazon already, will see how they respond.",
        "While this product may not be very long lived (it is our fourth Breville kettle in about ten/twelve years) it should be remembered that an electric kettle is probably the most used item in the kitchen. In our experience the on/off switch has been one of the weak points in its design but our latest kettle feels more positive as you switch it on so maybe, if there was a design flaw, it has been remedied. The soft opening lid is excellent for protecting your hand from scalding steam and the Breville plug design makes plugging it in and out a breeze. I would definitely recommend this product.",
        "We had one of these a long time ago. It worked very well and lasted a long time. Saved us a lot of time heating water for various things. Last year or so it was time to replace it and I bought a cheaper brand but it did not work as well or last nearly as long. So I am back to the Breville and very happy with that decision.",
        "Died in 2 days. Bought this because my other exact same kettle died. It came back to life the very day this arrived. I kept it anyway for back up. The other one died in 11 months. No problem, I had this on in it original box never opened a shelf. It lasted 2 DAY! Sunday to Tuesday AM. Seriously? I paid $93.68 for this garbage. I can't return it. In the trash it went.",
        "I have had this kettle for 3-1/2 years. My wife and I use it 3 to 4 times a day, day-in and day-out. It does the job and we have no problems to report. After reading some reviews, it may be that they have changed materials in the last few years, but the model we purchased has been bullet proof. Boils water quickly and the pour spout works great for my 1-cup coffee pour-over cone filter. Would definitely buy again.",
        "I first bought this kettle exactly nine years ago and it has worked flawlessly. Only now is the interior floor of the kettle starting to get mild rust discoloration spots. I know “stainless steel” can vary in its mixtures of chromium in them lending them more or less resistant qualities. You can almost never know what specific type of stainless mixture is used. Ah well. Going to buy a different kettle this time, though. Still, nine years is a good run.",
        "My original Ikon kettle just died after almost exactly five years of daily use. Make that several-times-per-day use. I was tempted to upgrade to one of the newer temperature-control models, but decided to stick with this simple, sturdy design. It looks good and works well. I also bought one for my workplace after we went through several cheaper kettles in the span of a few months. A year and a half later, that Ikon kettle is also still going strong. It probably gets used 10-20 times per day. Only four stars because I wish Breville would make this with BPA-free plastic (or no plastic at all).",
        "Bought this in 2010 and it's still going strong after 7&1/2yrs. Not sure about the quality of the newer models but mine has been used at least twice per day every day since it arrived with zero issues. I would have given 5 stars but there are some small plastic parts on the inside which I think have since been removed.",
        "Purchased in March 2016. Broken on button in 2019 so had to replace. Simple kettle with no real functionality. Didn’t feel high quality and indeed didn’t last very long",
        "The plastic piece encircling the power switch on the kettle cracked, and the switch fell in and that was that. I called the company, who after a lengthy interview process told me they would issue a return authorization, which never appeared. I liked the design of this kettle, so I willfully ignored the negative reviews. Too bad for me. Should have listened to you guys.",
        "This product is a life savor when you want to heat up water quickly for coffee or tea. I’ve been using mine for 4 yrs daily. Amazing brand , great quality. Just purchase 4 more as gifts for the holiday!",
        "We loved the product, but it started leaking out the bottom a few months ago. Whenever we lift the kettle off the base, water leaks out the bottoms; doesn't matter if it was just after getting filled, or after it had boiled. Now, there is mold at the bottom of the water reservoir. The mold makes no sense as it has only been used for water, and we don't have hard water or use well water. So disappointing.",
        "I've used two Breville tea kettles, the first one back in 2003-2004. It did eventually fall apart after a couple years. We replaced it with the current model and it has served us exceptionally well and without fail or complaint. It is used in an office and gets heavy use by tea drinkers and those who can't stand coffee pot coffee. We have had zero problems with this newest model. As to use, we fill a pump-type thermos from the kettle, so we almost always leave the kettle empty between uses, but we leave it plugged in 24/7. I'm finally buying one for home. It is so convenient and so fast and so sturdy, that I just love it.",
        "Boils the full unit of water in 6 1/2 minutes when auto shut off occurs. Although you might be able to get boiling water in 5 to 5 1/2 minutes if your going to pour the water into pot on stove to boil something else (pasta). My method is to put 2\" of water in pot on stove and turn on heat. I then boil the rest of the water in the Breville. Then when Breville is boiling so is the water on the stove. I found that the same total amount of water boiled exclusively on stove alone can take 12 minutes. Thus a great time saver. Thus with 3 minute pasta your eating in 9 minutes.",
        "Updating after using every day for more than 12 months -- I noticed the small stainless steel lip inside under the spout area is rusting away. I clean this kettle every 2 weeks with vinegar to keep it clean from mineral build up. Sorry to say I will be replacing it with something else. Also I don't like the fact that plastic touches the hot water via the filter as you pour the water out. It's easy to handle, and does not take much room on the counter (I have very little kitchen counter space). I love that it has auto shut off.",
        "Does the job, but 3 days into it I am starting to see rust on the lower \"stainless steel\" plate, also fingerprint marks everywhere. This is a no go I guess. Here are the pictures.",
        "We ordered this after our son nearly burned the house down with a tea kettle left unwatched on the stove. We make a lot of cocoa and tea and this kettle has been a welcome addition to our kitchen. It holds plenty of water, heats very fast and shuts off automatically with a pleasant \"ding\". We have had the same one at work for a couple years which sees steady use and it still works great. Time will tell as we've only had it for a few weeks but so far it has exceeded expectations.",
        "I purchased this kettle primarily because of the stainless interior, wishing to avoid any plastic. And I have been pleased with my Breville toaster oven. I wasn't sure I would like the under the handle location of the water level indicator, but since it lights up when the kettle is on, it's easy to read. I also like the sleek stainless exterior; the styling is such that it should fit into most decors. My only caveat is that the exterior does get quite warm, so it should be well out of reach of small hands when it's heating water.",
        "Not the greatest experience with a boiler. The measuring part of this has bubbles of water for days after boiling water and is hard to read now, I only JUST got the boiler and the water is stuck in there, I'm hoping it doesn't mold! UGG not happy!",
        "Switch broke a little over the two year mark. Not sure why a simple, premium kettle should have such a short life span, and now the thing will have to go to landfill. Chose a Fellow, with full stainless construction on the inside to replace, because this one had plastic on the inside, which the steam would always condense on, which would then drip back into the receptacle. Not into having plastic (BPA free or otherwise) in contact with something that I drink.",
        "Have owned this electric kettle for about 7 years and it's still heating water! My husband likes his coffee made in a Bodum Chambord Glass coffee press. He makes himself a large container full almost daily, I use it to heat water for my large teapot for me, preheat water to go into my pressure cooker which saves on propane costs and for any other tasks where I might need boiling water. Nice stainless steel container that has kept right on perking all these years. Cleans up easily and has a fairly small footprint on the counter.",
        "I really like this kettle. An inveterate tea drinker I am very particular about a kettle and my wife wants it to look good in the kitchen. The Breville fulfills both of our requirements, in spades. Great looking, quick to boil, it shows how much water is in the pot clearly. It doesn't whistle when boiling (which I would dislike). The only slight niggle is that it doesn't switch off automatically if you lift it off the stand, but will carry on boiling when you replace it. Nevertheless I give it 5 stars as it is a great kettle.",
        "You can always boil water in a pot, true. However, if you get used to using this you will never want to do that again. It shuts off upon reaching boiling point and gives off a ping. No longer necessary to to constantly check or forget and have water boil down,.. with the possibility of ruining the pot. Conveniently pours and stays Hot safely. I'm left handed and handle that swivels on plate accommodates any direction you choose to pick up. R.Pergola",
        "This is a great kettle. Sleak, shiny, and most importantly, it gets to a boil very quickly. I really like the detached base, so it's easy to pour without the cord getting in the way. The automatic shutoff works great. The reason it is not getting five stars is the unfortunate placement of the water-level indicator. When you're holding the kettle to fill it, you have to twist your hand to be able to see the indicator. Should be somewhere to the side.",
        "I bought it 10 years ago. It is still going strong and looking good. I use it daily. It hasn’t failed. I also bought several to give to family members because it was a good product. It is safe (boiled then shut) and quick whenever I need hot water.",
        "Purchased about a year ago....Excellent kettle except for some slight discoloration at the inside base which may be related to our water hardness.... Heats rapidly, auto shutoff after boiling temperature attained (even though the water boiling sound likes its done)....a gentle bell chime when done! No operational issues after 1 year of near daily use Just bought another as a gift.",
        "It is a great kettle. It boils water fast, it is easy to clean and easy to see the water level. What else to expect from a kettle? It is hot? Of course, it is hot, it is made of stainless steel. The handle is very convinient and there is no need to touch the kettle itself. Nobody has ever burned himself in our family, even my husband! It did came with the \"metallic\" taste of boiled water. So, I boiled a vinegar solution first, and then a couple of times clean water until the vinegar smell had disappered. Voila! It is good to go. Enjoy! in fact, I am ordering another one for my vacation home.",
        "This is my second one—to replace the first, after the on/off switch somehow detached and sank into the body of the kettle (it looked something like an “innie” belly button. It had been in use for less than two years. My daughter had the same thing happen with her Breville kettle. I could figure no way to get it fixed except at great cost. I pray it won’t happen again!",
        "It stopped working after ~11 months of use. No clue why. It was great when it worked, but I'm very disappointed with the short lifespan. The cheaper kettles that I bought previously all lasted much longer.",
        "We've had a few kettles, as most burn out in a few years, but this Breville is really great. My wife uses it multiple times a day, as we work out of our house, so we give it a real test. The kettle looks better in person than in the pictures, and looks great out on the counter. It's clean lined, solid looking, and balanced in your hand. Form follows function, and both are perfect. The Breville heats the water quickly, and keeps it hot for a long time. It's by far the best kettle that we've had.",
        "I loved this tea kettle, I bought it and it lasted me about a year. A huge pro is that it heats up the water SUPER FAST! But like some other reviews on here, it formed a crack above the on off switch quite soon, and finally I have to throw it out because the on off switch ended up coming out of the tea kettle. I would love to buy again because I loved the fact that it heat up quickly. I just wish it didn't have this defect.",
        "I have this for about a month now. It heats quickly and looks high quality. I also did not have any major clay issues at the bottom, so did not even need to clean so far. I wish it was ALL stainless steel inside, but there is a plastic part. The company said it is BPA free, so I just hope it really is.",
        "This is a generally good product until the plastic parts where you push the button in to heat the kettle and the vertical plastic part surrounding the glass cup measure start coming apart and breaking. This is the second identical Breville electric kettle I buy, and now have to replace. Very shoddy in that respect.",
        "This kettle quickly heats water. Good quality. Light weight. I take it on car trips with my own coffee/tea and condiments. More than I wanted to pay. Excellent product. Very attractive. Addendum: We used this all winter. Now, June in the South, it's on vacation. It's still a great item. This brand has done well for us in a large toaster-oven as well.",
        "My wife is English, so we are constantly boiling water for tea. This is a heavy-duty kettle that looks smart and holds a LOT of water, great if you make several large pots of tea during the day. Lighted indicator on the spine tells how many cups are to be anticipated from each batch. The base is very stable and the electrical connection is protected from any water splashes that might occur.We'd had THREE of them already!",
        "I drink tea throughout the day and having a good kettle that is reliable and doesn't have deposits at the bottom is very important to me. It is very easy to clean with some vinegar and the connection to the base is high quality.",
        "Heats water for tea and coffee quickly and without heating up the rest of the kitchen. We love it and have given it as gift too. We even use it to preheat water to speed up cooking pasta. Works much better than any other kind I've ever used.",
        "I bought this kettle back in February of 2010. It is used about 4-5 times a day; I am a big tea drinker. As of today this thing still works great. Sometimes I will stand next to it and stop the boiling process before its usual cycle so it doesn't get to hot where I have to wait for a while to drink my tea. My father and my girl friend loves it when they use it. If this thing ever breaks down, I will purchase another one. This also does not leave any after taste since it is all made out of stainless steal.",
        "Have been using this for years now so it's definitely sturdy, great quality not to mention an attractive design. I no longer have to worry about a kettle and the stove being on. This turns off when the water boils and I don't have to worry about a fire hasard. Easy to clean. You do have to make sure you only pick it up by the handle because the body gets very hot from the boiled liquid. The handle is very comfortable to hold.",
        "I have other Breville products and no complaints. However, I'm on my fourth kettle!! They don't switch off when water boils and I find this very dangerous. I have been in touch with Breville and they keep sending me new kettles, all with the same defect. I just want them to fix the problem. I would strongly suggest you look for other electric kettle options that turn off when the claim they do.",
        "I have two of these (one was a house warming gift). It begins and ends every day. I love Breville's designs and their reliability even more.",
        "I discovered these Electric kettles when I lived in Ireland. No one heats water on the stove in a traditional kettle there. I was happy to find this one by Breville here in the states. We drink tea a lot in my house and its great to just fill this up with as many cups of water as you need and flip a switch. You have hot water in under two minutes. Yes I have timed it :) It would be hard to go back to waiting for the kettle on the stove to whistle.",
        "Purchased in August 2012 this boiler is really a great time saver. It's worked perfectly for us until last week. I turned it on and the water wouldn't boil, even after 5 minutes. The boiler was making a sound as if it was trying to boil. Well since I've had it for nearly 3 years I wasn't to upset. I know the boiler has some type of electronics built in so I performed a hard re-boot (unplugged it while it was still switched on then plugged it back in) and now it's working in. Hoping for another couple of years out of it.",
        "We bought this particular model first in 2007 and it served us well for almost 10 years! The only kettle (brand) that proved its quality for such a long time. We bought number 2 couple of years ago and it's serving us perfectly. We bought kettle #3 (everything is the same, model, brand) in the fall for one of our family member and again, nothing but 100% satisfaction. Highly recommend!",
        "Lasted 5 months with light use and quit working. Will edit review when we get a response from customer service & let you kno results.",
        "This is the slowest kettle I have ever owned. It takes what feels like FOREVER to start the boil and then takes even longer to auto-shut off. My past two kettles were Russell Hobbes which boil much faster. The first one lasted 20 years. The other one I purchased recently as a replacement but I thought the Breville would be better and faster. Not really the case. It is a lot more pleasing to the eye, but just doesn't get the job done the way I want it. I may just have to return it.",
        "LED light broke after a year or so. Now it's hard to tell whether it's on or off. Still heats the water though, hence the three stars.",
        "I wanted to see how the Breville held up before writing a review. Well I just checked my purchase date and it was September 2010 and I have to say, it's still the greatest! We use it every morning and love how fast it boils water. It initially took me a while to realize I could put it right down on the counter instead of back on its plate -- it has pads on the bottom to protect your counters -- and that just made it that much nicer to use. Great capacity, no problems. Love and highly recommend.",
        "You can never go wrong with Breville. They have yet to disappoint me. I own a juicer, this tea kettle, and a food processor. Superior quality & durability. I wish they would make kitchen appliances like fridges, dish washers, and ovens - I trust their brand.",
        "Solid water heater. However, the lid open button can use some work since it is easily to wear out when the kettle still works fine. You hate to throw away a work device just because of a worn-out button. Right now, we just fill the kettle out of its sprout without even open the lid. They really need to change the design or the matterial it uses.",
        "Super nice, until the electrical connection on the base failed. It lasted a couple years. Started with a blinking light shortly after we bought it and gradually it just stopped working. For this price, it needs to last way more than a couple years.",
        "This my second one. I like its simple design and it does a great job at boiling water. Easy to clean.",
        "Literally saved by the bell every morning before I go to work. The finishing chime is a lovely feature. My uncle bought this to replace an old homegoods kettle and I was so impressed I had to buy one for myself.",
        "I can't use my Breville teapot anymore because the power on/off switch broke. I just pushed it in as I usually but this time the switch just collapsed inside the teapot. I bought it here on Amazon in October 3, 2014 so it's 4 days after the warranty was up. Disappointed it didn't last longer because it's so pretty and did work well.",
        "This will be a very short review, as I agree with all of the points made in the positive reviews. I only have a couple of details to add:' 1. The cover opens easily with the push of a button and raises itself *slowly*, so it doesn't fling condensation about. Very nice! 2. The boiling cycle is, of course, interrupted when you remove the kettle from its base, but unlike most modern electric kettles, this one does not turn itself off, so it will resume heating the water when it's placed back on the base. This isn't a \"con\", but it's something to be aware of.",
        "Loved it, but after only 2 months, the lid stuck open. This is the second time this model of kettle has had lid problems. On my previous kettle, the lid stuck closed, so we filled it through the spout, until it died (5 years).",
        "After having my wonderful trusty Hobbes electric tea kettle for over 10 years till I dropped it last year, I needed a kettle that would work well with repeated use. After reading the reviews, I chose the Breville Ikon. It looks great and, at first worked well, but what a mistake! After about a year, I started having the same problem with the connection on the base not working. First it was occasional; now I can hardly get it to work at all! What a rip-off! The mfg should change the engineering on this so it works for more than a year....especially at this price!",
        "I have owned two breville kettles, firs lasted about six years, and I was very pleased with that. When the switch finally gave up I bought another. The switch in this one died after two years. I wish they would make a really reliable kettle that would last.",
        "After reading so many negative reviews on electric kettles-- especially about plastic-smelling and tasting water, I was skeptical, but took a leap with the Breville unit. After over a month of use, we are very satisfied. We use it at least 3 times a day, and it is performing very well. Right out of the box it did smell of plastic, but I boiled and dumped several times as suggested in the instructions-- including once with vinegar which sat over night. That seemed to take care of it, and we were getting clean, pure water on the second day. The unit has a sturdy feel to it, and looks good. Completely satisfied.",
        "This product is very attractive, easy to use, easy to keep clean, and does an excellent job. I already have an older version & use it everyday and it's still in an excellent shape. I love it so much, I got one for my mom. She is thrilled with it, too.",
        "This Electric kettle is so wonderful. It heats up so fast (and it's pretty :). I wanted to get an electric kettle since it is the most energy-efficient way to get started on boiling. It surpasses a microwave and a kettle on the stove and I certainly use this multiple times a day. In the beginning I was wiping it down inside after use to make sure it didn't rust but I feel like this is a beast and doesn't even need it. It's made so well. I love Breville. They're really great products (I have 4 now) and they're sleek and modern without looking overcomplicated.",
        "I purchased one of these after my elderly father burned out 2 burners on his stove after forgetting he had the tea kettle on. It is a godsend! It boils water fast and turns OFF after reaching temperature so even if he has forgotten he turned it on, I don't have to worry he's burning down the house.",
        "Went through two of them. Each lasted around 18 months. For the first one, the cap broke. For the second one, the plastic on the side broke. For a brand like Breville, supposedly selling high quality appliances for correspondingly high prices, this is not acceptable.",
        "This was used to heat 2 to 6 cups of water for over 3 years, for tea pots and coffee presses. Over the last month the plastic cover around the level gauge has cracked and fallen off the kettle. Seems like cheap construction for an expensive device.",
        "This was slightly more expensive than some of the others I looked at, but now I am so glad I sprang for this one. It works very well, and heats water quickly. Its well made. One nice surprise - a little blue light shines when it is heating - and this is most attractive! I am going to stick with this brand for other kitchen appliance purchases",
        "This is a great kettle - easy to clean, fast boiling- but this is the second one we have bought where the plastic under the switch broke - and we have been zapped by the current. Pity - it’s fantastic otherwise.",
        "My first Breville Ikon kettle lasted 10 years before I accidentally hit the on button and dry boiled it. Got the replacement same day, love it.",
        "This is my first kettle. I use it several times per day. It heats the water quickly, and has a soft ding to let you know when it is ready. I would give it 5 stars, but the water level gauge is somewhat hidden under the handle making it not very easy to read. I have another Breville appliance so I felt pretty confident ordering this online. It's also sleek looking sitting on the counter-top.",
        "rust present along the top of the rim a few months after warranty. supposed to be stainless steel! i wont buy another!!",
        "I ordered the kettle as I thought it wouldn't have any plastic in the kettle - many mentioned that it doesn't have plastic. In fact, it DOES have plastic in the kettle holding the mesh. To avoid contact to the plastic, water level should be less than 50% of the whole kettle. Anyway, hot water will poured through the mesh making contacts to plastic. Also the water level indicator has two rubber holes upper and lower, and the level window looks like plastic too. Please take a look at the photos I noted for your information. I can say it has less plastic than others, but it is not accurate to say it doesn't have plastic.",
        "We have had this stainless electric kettle for years. It has been flawless! It looks good sitting on the counter, and it boils water very fast. It is a work horse and a performer! You won't be disappointed. Sometimes it is really worth it to pay a little extra and get the best. This is it!",
        "I have had this for months now and it has never failed me. It boils water even faster than a pot on the stove so I ended up using it to boil water to pour into the pot if I need to make oatmeal or something like that. Super easy to use and looks great on the counter, too.",
        "i love it, even though it gets really hot to the touch, careful not to leave close to edge of the counter so little hands cant touch.",
        "Very balanced, easy to maneuver when full, nice handle and love the soft opening top. Only downside: we make black tea and that needs a full rolling boil. The highest setting cuts off too fast so we have to press the on button again to get the full boil we need.",
        "I really like this kettle. The capacity works for me. The heating element being sealed appeals to me. It works great, looks great and is reliable. There is one thing I would change (or try to change) if I were designing the next version: I wouldn't put the water level indicator behind the handle so it is hard to read while filling. That is the only flaw I can see. I realize there may be a good reason for this that maybe I can't see.",
        "I had a fancier version \"Breville BKE820XL Variable Temperature Kettle\" for over 4 years before it died. We really used it A LOT, so I didn't mind going with the same brand. But this time a simpler version. I really like the modern design and the shape of it. As far as the functionality, well it does the job (how hard can it be :-). 4 start because I had to replace it, the first one arrived with the faulty connection between the base and the kettle. The replacement has been working so far (4 months) with no problems.",
        "The plastic around the on/off switch began breaking apart within 3 months. Now---a year later---the plastic around the bottom of the on/off switch has completely crumbled. There is no way to glue it back together or fix it. Now, I have to buy a another one and throw this away. It isn't worth the $70+.",
        "I recently purchased this product after being introduced to it by a relative. The kettle is phenomenal as water heats up quickly AND QUIETLY NO MORE WHISTLING! As someone who prefers a French press coffee in the morning heating my water up this way is fast and quiet as I start the day, plus the best part it turns itself off if by some chance you do forget you were boiling water with no damage very easy to store and maintain . I would definitely recommend this product to everyone!",
        "After having two Cruisinart kettles that went bad I decided this one was for me. The newer Crusinart has too many electronic features and I just need to boil water, don;t need all that jazz. This one is much more basic and well designed. It's powerful and does a better job than my old one. I am happy with this kettle and you will be also.",
        "Great Love it I have used many and this one is the best Yes pricey but it is fantastic Can reach in and clean the stainless steel, and turns off by itself All these features were just what I needed no more struggle with cleaning and the turn off by itself is a great safety feature for this busy farm lady The water heats so quick almost ready by the time I grind the coffee.",
        "This is my second Breville hot water pot in 15 years. My whole family has one of these and the first got hers over 20 years ago. Heats quickly and It fits in with my kitchen decor. I'd buy it again.",
        "The best of the best. Breville appliances are always expensive, but they're \"High End\", and this hot pot has performed flawlessly now for about five years. Although, I use it mostly to boil eggs and such. It's fast and reliable as well as durable. I am expecting it to last the rest of my lifetime.",
        "boils water fast, looks great, like the light that lets you know it's on. The pot is heavy (when full of water) and gets hot when the water is hot, but I imagine that most kettles with boiling water in them would be this way. Hopefully will last at least a couple of years (the most I've gotten out of an electric kettle is four years)"
    ]
}