{
    "entity": "Webcams",
    "text": [
        "It is a basic UVC camera. I get 800 x 600 resolution and did not have to install any software to get it to work. I already had guvcview installed. on Ubuntu. I really like the sliding cover that can cover the lens. Why is Microsoft software all junk and yet they sell some quite good hardware(mice and cameras)?",
        "I was using a Microsoft LifeCam VX-1000 cam before upgrading to this. Not a lot of innovation, but still: * A decent video quality, much better than my older one, bandwidth permitted. * Much more conveniently attaches to Laptops' screens. * Much more compact; also comes with a small, pretty hard case. * The eyelid can be closed -- and rotated vertically -- to avoid damage or dust. * Cheap (online) On the down side, Microsoft has a software, which unsurprisingly interacts well only with Messenger; it still works, of course, with others, say Skype. And their driver with mandatory software is about ~100MB and takes ages to install.",
        "This litle unit does everything it advertises. It mounts above my flat panel monitor with a little Velcro and has great resolutioun and sound quality. The manual tilt feature allows you to have the monitor at the desired angle and then center the picture as necessary. In addition it sports a good set of electronic adjustments for Zoom, Brightness, Contrast, Hue, Gamma, Low Light,etc. I bought one for my daughter (she received it from Amazon in less than 24 hours!!) and now we Use Windows Live Messanger video calls instead of the telephone, and get to play a little backgammon as a bonus. Great camera at a good price.",
        "I CAN'T TELL YOU THE SPECS OF THIS CAM BUT IT IS NEAT.I LIKE THE WAY YOU CAN CLICK PUSH THE CAM BACK IN TO PROTECT FROM DUST...CAME PACKAGE NICE BUT IT REQUIRES A SOFTWARE IN WHICH I RECEIVED BUT THE COMPUTER STORE THAT SOLD ME A COMPUTER SOLD ME ONE WITH FAULTY ROM BUT FOR WHEN I AM READY I WILL SEE IF I CAN BY PASS THAT AND JUST DOWNLOAD SOFTWARE AND INSTALL ON MY CPU..THEN I WILL GET BACK OF HOW GOOD IT WORX.THNX",
        "This Webcam has great cam hide style that's why I bought that cam and it's Microsoft that's the reason too but I'm very disappointed with this cam because this cam doesn't compatible with SKYPE, FACEBOOK, YAHOO MESSENGER....! This cam is supports Google Plus and Nimbuzz Only....! Camera has great 2MP picture quality but It's not supports all Social Media that's why I'm so Disappointed...! Don't Buy this if you want to run on skype or facebook or yahoo messenger......! This is for Only Google and Nimbuzz.",
        "The software is nothing very useful to me. This works well with the MSN Live Messenger fine. Resolution seems fine and this is mostly a satisfying camera as a webcam. If you want to use this to discretely view things using it as a streaming webcam the lighted microsoft emblem might draw attention to this camera. Alternately that informs you that the thing is working as well, so depending on your needs, that may be good or bad. I would buy this again.",
        "I bought this unit and it works \"great\". Not good in dim light and no focus adjustment so nothing past 4 feet... If you want a portable cam with easy setup and great video its for you. But if you want a cam with more fetures and your not in need of the portability try the Philips 900nc..better unit with more features and killer dim light ability..read my review there for more...",
        "This is a good camera. It was recognized in Windows 7 and Windows Vista without any problems. The quality image is acceptable. This is beatiful and small. Good for Microsoft with this device. Please, be aware. This camera is recommende to have excellent images for objects located a little bit distant from the camera. For objects very near is not a good option.",
        "I have use it with a desktop computer, Windows 7 x64 Pros: - Good in low light - Easy to configure - Nice camera effect for chat - You can turn up and down the camera len, so easy to mount to laptop. I was have some fix to mount it to my desktop LCD. Cons: - You must install software first, installation requires internet connection and you must set default browser is Internet Explorer to continue the setup. - Quite heat but no so hot even the camera is not in use",
        "The camera's software would not install on my laptop that runs Windows Vista. I installed it on another computer with XP, but the camera would not work in Skype due to an \"Unknown Error.\" Installing the latest NX-6000 drivers available online and latest version of Skype did not help. The microphone works well on Skype calls. The camera works fine in a video application that came with it. I haven't yet tried it in any other IM application. The packaging asserts that it is \"compatible with all leading instant messaging software.\" This does not appear to be the case, but maybe I will be able to work it out later. Any ideas?",
        "Very compact, but with great resolution both with respect to audio and video. The installation, using bundled software drivers and MSFT Live Messenger, was a snap (easier than my parallel experience with Logitech QuckCam Communicate STX). The camera works equally well with SightSpeed, the other communications software package that I have used the camera with. Comes in a handy, very compact carrying case. Very high Cool Factor to the package and performance.",
        "This little compact camera is great. I have tried other cameras and was disappointed with the picture quality and cost. This camera is very good for the price: it has great picture quality (clear with representable color); it is easy to install and use; it can take high resolution still images; it is compact and streamlined; and the lens can retract for safely carrying around with your laptop (also has nice little solid carrying case for extra protection - very portable). I am very satisfied with this camera.",
        "I have never been able to establish a stable connection with this camera. it works great thru its own program, but is very unstable when using Skype. Must always disconnect and reconnect to the computer to get it to work. Sometimes this does not work either. I am using VISTA which may also be the problem, but I have not been able to find anything confirming this. All troubleshooting information on the Microsoft website leads me to pulling the plug out of the computer and reconnecting it. This is very annoying, and as i said before, doesnt always work. However, when it does work the audio and video are fabulous.",
        "This camera is probably one of the best on the market at the moment and the highest resolution as well. It has a nice design and comes with a nice compact protective case. Only problem is that if you have a notebook with a super thin screen (such as the Vaio TX series), then it will not clip on the screen as advertised. Other than that, it's a great camera.",
        "Provides an ok picture, but it should not be used with laptops. A known bug with this is that the antennas of many laptops are in the top of the display, right where this device clips on. Other devices like logitech - provide some shielding so that the wifi antenna doesn't interfere with the audio from the microphone. This microsoft device, however, picks up a tremendous amount of static because of interference from the laptop antenna. Microsoft offered a full refund immediately and stated that this is a known issue.",
        "Should have read the information more closely. This is a 2 megapixel camera which is totally unsatisfactory for any use in 2020.",
        "This camera was very affordable and does exactly what I want. Like other reviews the mic isn't the best, but its not a big deal. The video quality is very good for such a simple camera. Its fun to use and I would recommend it to anyone that wants a basic, good quality web cam.",
        "I feel this product is definitely worth it for the price. Only good for laptops though. Picture quality is alright, definitely not as good as they advertise. I found some of the software to not function completely but the camera itself serves its purpose. If you want something for the long term and will use this often, go buy a more expensive camera.",
        "Worked great for a long time until the clip broke.",
        "This is really a piece of crap, I bought it for my dad, since I was going to be travelling, I wanted to be able to see him when we spoke through skype or MNS. The camera never worked. We installed it, on Windows XP and it was always \"loading\". Called Microsoft customer service and they couldn't help me make it worked. They were supposed to send me a new one however it never arrived. The truth is, I didn't even complain about this because it such a bad expierience I did not want to risk it again. We had to get a new camera (Genius) that works perfectly and its extremely easy to use (plug and play)",
        "It's pretty much as it describes. As far as compatibility problems go. I have Windows 7 and it just told me to go online and then started to download the update it needed to do the installation so no real problems there. Granted I've only used it for about a day but the video quality of it seems fine about what I had expected. The only thing about it is with the sound it has some weird humming or pulse kinda sound. I'm going to see if I can't do anything about that maybe the other person doesn't hear it? I'm not sure because all I've done was video record myself. So far though it seems what I paid for.",
        "I only bought it because it was on sale. If it was full price, no way is it worth it. The quality was decent, but no more than $30 decent. Now we have a smart phone and never use webcams anymore, but it was a good 6 months of decent webcam chatting.",
        "I don't know why but this is not working fully with my Skype on my windows computer. I have a mac too but when I try just to use the Camera (Because MacBook already got microphone inside) it shut off the Skype in 5 seconds... So I am not really recommending this product. But the Logistic one! They do greater job!",
        "It's an okay camera if you don't expect extra sharp images and crisp colors. It's easy to install and works fine. When I ordered it I thought the resolution was higher. It is however 2.0 MP which is just about enough for a skype chat with one's family!",
        "Microsoft product made for microsoft applications. I couldn't get the zoom to work at all and couldn't get it to work with Skype after installing microsoft drivers with microsoft app. Only easy was uninstall. I went back, reinstalled and updated drivers, and it works great now and still. I really love that the lens manually pushes inside the camera to shut it off. Easy controls for the best quality image.",
        "I purchased this because I have a 6 year old P-4 computer and I wanted the best resolution/video that would run with my computer. This works great. Clear images, microphone picks up sound well. I use it with Skype and it was easy to install and run. Good image in low lighting situations. Great pic in great lighting.",
        "The Micorsoft Lifecam NX-6000 Webcam is a great product for the price. It works well especially for what I am using it for....a camera in a squad car. It has great picture and sound quality. It is a great value for the money.",
        "This worked just fine for Skype on an old laptop without a camera. Good price, good picture.",
        "The NX-3000 was a better product in my opinion. Poor auto focus and an over all poor performance. I will continue looking for a solid, inexpensive and reliable portable cam.",
        "This camera works well and has good picture and sound quality. However, mounting it on my laptop was a pain. Since many laptops are trying to be thinner and thinner, this camera only clips onto laptops whose screens are at least a 1/4\" thick. For a similar price and the best mounting system I have ever seen on any camera try the LifeCam HD instead.",
        "I love it and have used it for many years and it works perfectly, love it and it has made me lots of money, very reliable and compact.",
        "Excellent item. Sharp images, compact size, easy connection ~ plug n play. Used in a business to attach images to CRM Database, works like a charm. Super nice price from Amazon!",
        "This Cam works Great, and is very easy to use. I saw it at Staples for $99, and was delighted to see the low price Amazon offers. I HIGHLY recommend this Cam.",
        "I love this webcam. Great value. Loaded easily, no issues with Windows 7, picture is clear and mic picks up voice clearly. Size is perfect for laptop and travel.",
        "We love the way this fits securely on our HP laptop and the great resolution. Easy install and very portable. Comes with a travel case. We are buying a second one.",
        "The install was easy and it has been trouble free. Everybody has been complimentary of the video & audio quality. I use it exclusively with Skype and have not installed the Microsoft update. I understand that the update causes problems if you use Skype, so I haven't bothered with it.",
        "The mic on this is completely unusable camera is mediocre BUT it clicks in for security so that's nice",
        "easier to use, quality matches price. Video resolution and Audio works fine. heats up a little bit with consistent use.",
        "It was a hi-tec years before. But I still like it. I do not need high quality images, so it is enought.",
        "So I have used this Camera on vista and Win7, but both I had some major driver issues. It has GREAT picture quality, the frame rate is average, and sound rocks! Unfortunately, it looses a star because in order to use it I must unplug all my jump drives!! I can use the camera when transferring files, it sucks! But other then this, it is great.",
        "I like the clarity that this webcam gives and I love the portability as well. I would recommend this product to anyone who wants a new webcam for their laptop.",
        "got 2 . one here and 1 for daughter in Peace Corp in Macsdonia. speak almost daily and very satisfied with units. sure beats spending about a buck a minute to speak to her by phone . we use skype",
        "Eventhough this webcam is sold as being certified to work with MicroSoft Vista, it DOES NOT. I can't give it any kind of rating for audio, video or ease of use because it never installed properly. I tried all the latest and greatest donwload upgrades and updates from MicroSoft and it still DOES NOT WORK!!!! A nice looking piece of JUNK! Save your money and buy a Logitech.",
        "It looks great with good quality image and video, I find difficult to fit it some where on top of my notebook as its channel doesn't fit with my laptop width. One of my friend has been using it for a while and he advised me about this cam, but it was a bit expensive when I checked with other vendors like above 50CAD. But I got it from Amazon for less than 30CAD.",
        "Microsoft LifeCam NX-6000 Webcam - This product works very well and I am very satisfied with it.",
        "The photo and video quality are very good but the software has some incompatibilities with Skype software. Being a webcam it shouldn't.",
        "Very good quality overall and excellent image.I especially liked the clamp that fits over a laptop screen and sturdy storage case.",
        "When I ordered this webcam I was worried that I would not receive this item soon enough before my trip departure date. I placed my order on new year eve, I was astonished when I received the package on the 4th of January. Every thing works well with great quality.",
        "I am in Love with the picture clarity and the size of this webcam. It comes with a some cylinderical zip pouch to keep it safe. Its really CUTE.",
        "So far, this camera has been effective. The only issue is that there is a low buzz which sounds like the person using the camera is peeing. Other than that, works great.",
        "Out of the box and operating within 15 min. Great quality. Good value.",
        "This won't even fit a Think Pad X61 notebook! I use it on a desktop PC (I had to put velcro on it. What was Microsoft thinking when they designed this? I didn't install the software since I don't use Live. I just plugged it in and it works fine.",
        "I had ordered this product from Amazon. Product is good as expected but the problem was I did not recieve the product in its original packing.",
        "Not a bad little gizmo. I wanted a webcam with autofocus and I got it. I'd love to have paid half as much, but just remember, we've got all of this great technology for $60.",
        "This is one of the very elegant and robust web cam I have came across. It very small and picture quality is awesome!!!",
        "This product was easy to install and works fine. The picture quality is good (not great) but for the price, the product preforms well.",
        "I recommend this product. It is easy to install and use. The small size is also an advantage.",
        "The webcam is an easy to operate, fully functional device. Perfect for laptops. The Range on it could be a little better. The mic is excellent.",
        "Best web cam i used... I bought 2 of these web camera...",
        "I found some minor issues with this WebCam: (1) I cound not mount it to the top screen cover of my laptop (an IBM T series) (2) The video quality is poor using an older USB 1.1 port. Conclusion: Microsoft expects you to use a 2.0 port with this WebCam. No biggie!",
        "Worked well with Skype. Easy to install on a Dell laptop running Windows 7. Great price.",
        "i could not get it to work with my vista so i have a piece of junk on my desk",
        "they sent back my money because the web site was so stupid they listed the wrong camera i was so dissapointed because i realy was looking forward to gtting the camera it was faulsly advertised",
        "Not only does the product perform well-- I am even more satisfied with the webcam as it is updated on a regular basis by Microsoft. I would definitely recommend this product..",
        "It does not work with Windows Vista, I'm not even using it. Tried to download updates, there is none available.",
        "It's awesome, a great buy, the software is amazing and the images are outstanding, I'm very satisfaied with the buy!",
        "High quality images and video for the price paid and the compact design. I was disappointed in the limits to the Microsoft software. No motion detection available was very disappointing.",
        "It is a horrible product. I bought and i had a lot of problems just installing it. Finally after installing it, the image resolution was horrible so i had to struggle with the webcam until finally i got a good image. After 2 weeks it just stopped working , i red the manuals, went to the microsoft website and tried everything they tell you to do and i could not fixed it. Off course you can call a technician from microsoft but they will charge you 35 dollars. In summary , this is not a good product. Not for this price. I feel i was robbed",
        "cam gets terribly hot. Worse picture quality than my $5 webcam. Need I say more?"
    ]
}