{
    "entity": "Webcams",
    "text": [
        "Bought this cam for video chat. It draws a bit of current from USB port and I am in the process of upgrading to all USB2 so my computer will not stall (which happens occasionally when everything runs at the same time). In comparison to other cams I have watched this one is practically high definition and although the frame rate slows down to a crawl it will even support 720! I find you can get outstanding color contrast and brightness levels if you fiddle around with the exposure setting the color tint and brightness too. Then WOW! I mean I just never see anything as good out there so bring it on baby!",
        "Worked so well, that I bough 5 more for hte rest of my family across the country. Easy to setup, and the built-in color and light feature truely give a great picture. I use Microsoft Live Messanger most of the time, as I feel it gives the best interface and video quality. It tend to get more dropped connections, but I think it may be due to bandwidth and other things not related to the camera. I use Skype video when I talk with my family that has a Mac or has a slower DSL. The video is a bit more blocky on full screen, but it is fairly realtime.",
        "I bought this product in 2006 when it was brand new. It seemed cool since it had software that would add stuff (hats, mustaches etc) to the image. As any logitech product, it was discontinued rather quickly and the software stopped working. I still use the camera on my windows Vista Machine. I havent tried it on Windows 7 or 8. The generic drivers download automatically since its almost impossible to find the logitech drivers.",
        "This is my first webcam, and I was a little apprehensive about being able to get this set up. No problems, though, as the directions were easy to follow. The picture and audio are excellent, and I look forward to using this webcam often. The settings toolbar gives you instant access to any of the features that you need. This was a great purchase!",
        "We purchased two cams (Nov. 22nd) as a Christmas gift for my in-laws who live 18 hours away. We tested them with my parents who live an hour away. The audio was so bad that we could not communicate with each other, even though we both have high-speed Internet connections. Since my father-in-law is hard of hearing we knew the cam would not work for us. We returned the cams to Amazon on December 13th, and as of today, January 11, the cams have not been received by Amazon. I was told the purchase price would be refunded, but I have not received a confirmation e-mail concerning the credit to my bank account.",
        "I bought this camera and was extremely disappointed because the picture was blurry and could no way be fixed. I think they have problems with the focal point setting on this camera. So I returned it. I exchanged it for the much more cheaper Logitech QuickCam Communicate STX. Once you check the advanced image enhancement settings for the C-STX to low light boost and color boost, the C-STX is one of the best cameras on the market. The Quickcam Fusion cam software did not have these options.",
        "It has a nice wide view. Video quality is good. I've had audio problems and still do. I had recommended this Fusion to a coworker, and they also had problems with audio. My brother inlaw installed the fusion cam on he's Dell laptop, after installing drivers, everytime he would try to run the web cam, he would get the B.S.O.D (Blue Screen Of Death). I'm a big fan of Logitech, but I can't recommend this product.",
        "This is a great camera accessory for your computer and great to use with Skype and other applications. I even bought one for my family, who lives miles away, so I wouldn't miss out on my Neice, as she grows up. Since my purchase, I have bought a new computer with a built-in camera and no longer have use for this one. If you are interested in buying mine (in the same condition as when purchased), please comment on this review and I will get further information to you. I still have the packaging and information paperwork that came with my purchase. I bought this item NEW from Amazon.",
        "I bought this camera a little while ago. It works great as a webcam and the mic picks up sound very nicely. Unfortunately, Logitech has decided to drop TWAIN and WIA support in their drivers in their latest QuickCam 11.x software. If you need this type of support, take a look at Creative Labs. I recently had a need for this feature for integrating image capture with other software. I can't do it with this webcam.",
        "This is the first web cam I ever purchased, and I'm not a techie. I have read some negative reviews arount the net on this product, but as far as I'm concerned, this cam delivers on what it's suppose to give up. I consider it to be a great bang for my buck. I'm sure you could do better, but for this meat and potatoes guy, I'm very satisfied with my purchase. I've been up and running about a month now.",
        "So far, I have only used this camera once but it worked very well and lived up to all of its advertised capabilities. I used it on Skype. The only con I found was that it made my audio on my computer start to crackle even when I am not using the camera. If I disable the camera completely, the crackling goes away. This may also be just my computer and other computers may not have this little problem.",
        "This is a great way to keep in touch with the loved ones. This camera is wonderful, though this is the only webcam I've ever used. Easy to install, easy to use and up and running in no time. Just a side note for those of you that aren't especially computer savvy - please make sure you have enough RAM on your computer to run it. I didn't and had to buy a memory card before this would work properly.",
        "Great camera. Great design and really interesting idea of attaching it to the monitor. The software that comes with it will make you smile. And the picture quality is really good! Highly recommend this camera. Don't forget to adjust your microphone setting on the desktop. Some times it is set to the max which makes the voice to come out overloaded. Once adjusted, you get a good voice quality also.",
        "I use this with Microsoft Windows Messenger (the most reliable service I've found). The quality of the images are good, and the built in microphone works well. The only thing I'm not too impressed with is the ability to adjust to the lighting situations (I use it facing away from a big sliding glass door I have to my balcony). Overall, though, I'm a Logitech product fan, and this is a very solid web cam [...]",
        "I like my webcam . It has automatic focus when daylight or night - no problem when it`s all dark in my room. Even if you move a lot it has a special function that it will follow your face on a conversation. Microphone is OK. I give it 4 stars because when I finally installed my webcam and turned off my computer and later turned it on ,had to plug it in another usb slot for a correct operation. After that had no problems.",
        "I'm not sure how the QuickCam Fusion stacks up agains the rest becasue my last webCam was from the stone-age. But as a stand alone review I truly feel this webCam provides quality video with a clear picture in COLOR. Software works well too. I had no trouble with it at all. YES, a bit pricey - but it DOES work very well. As always, THANKS for reading my reviews and be well. The WebbMan",
        "My Wife and I moved about 800 miles from our grown Kids. We gave them each this webcam as gifts. The webcam was easy to install and works great on Yahoo Messenger. The only snag was that you have to change the resolution to the lowest setting to use it on a live call. Therefore, the webcam's capabilities far exceed that of \"free\" services on the web. Sound and face tracking were excellent.",
        "This is the second Logitech Quickcam that I have bought over the last 3 months. What I love about the Logitech Quickcam is the ease of installation (load a disc and plug in usb cable); plus the many features of the cam. I have recommended this cam to several of my friends and family. The price is right and the product is exceptional.",
        "Our daughter moved to Oregon 1 yr. ago and we purchased a set of these to stay in touch. We use these about once a wk. so we can visit with the grandchildren. Really makes the wife feel better after an online visit and the daughter dosen't feel so homesick. As close to realtime as we could hope for. Easy to install. Just add Skype and you're good to go.",
        "The product itself looks real nice, unobtrusive. The video is excellent, the software provides very conveniant (as well as very specific) easy adjustments including the options of disabling the camera and microphone. Also sits very easily on CRT monitors. Very easy to set up! A tell-tell indicator lamp to the right of the microphone lets you know when the unit is active. Very strongly recommended.",
        "Back in the day, this was an amazing quality. It still works, but there are much better cameras nowadays.",
        "I purchased this item to use in webcaming via Skype with my out-of-state parents. They are 80+ years old and have purchased their first computer...all because they want to have virtual visits with their first grandchild. The Quickcam Fusion works as advertised, helping my son to earn many compliments about how good looking he is. Apparently, the microphone also works well because my parents must turn down the volume on their end when baby Liam cries for his next feeding.",
        "Get complements all the time on the picture quality. The face tracking feature is awsome (but can be a little tempramental at times). I use it's internal microphone for my internet calls and it works great as well. No complaints except the price was a little high but the quality has proven to equal out.",
        "I'm very pleased with this camera, and the price for the quality is right on the mark. I got this for myself when my son went to college. The first few weeks were rough, but having the ability to see and hear him clearly was so reassuring and I'm so happy I got this Logitech. For realistic sound,lifelike and clear visuals I give this an A+.",
        "I am totally disappointed in the quality of the picture. \"Automatic\" never works but is even worse if you wear a light color. Adjust the Contrast and Brightness to compensate and you get a washed out picture. Turn Auto off and it's almost a black picture !! Great extras if you could get the cam to work !",
        "One of the best webcams I ever purchased, drivers are not so friendly and the software is no good, but the actually came does display an excellent picture and I still use it today 8 years later.",
        "Ok windows vista users dont worry this cam works with it...All you have to do is download the update for the cam very easy...It will ask you upon installing the softwear...I love this cam great for a laptop or desktop...It is not the smallest cam for people on the go but its a good cam I like tripping out my friends with the softwear that comes with it..Has a long cord witch is nice too..",
        "well worth it. We use it to show off the newborn to our family overseas and they love it. It picks up on less than favorable lighting and does a good overall job with the picture. Broadband internet is obviously required, but i think it is a great product",
        "I have a 1.1/1.0 usb port and it actually does not support this webcam. The consequence is my pc keeps restarting everytime I tried to turn on the webcam. I called logitech and asked why my pc keeps restarting. He said theoretically 1.1 should support it but sometimes it might not. Now I have to change my 1.1 usb to 2.0.",
        "I don't know much about webcams, but the picture quality on this one seems awful. It makes my face as red as a tomato and my eyes into darkish blobs and my mouth and teeth into a blurry maw. The software with the cam allows very limited adjustments and offers no solutions to these problems. I hope there are better cams then this on the market?",
        "I bought this for my grandchildren in Utah. I miss them very much. We instant message each other as often as we can. It is such a thrill to see them as well as hear about their day. Being far away from loved ones is hard, but this Quickcam is the greatest and I am very pleased with the performance and ease of installation. Well worth the money.",
        "Sometimes the cam do not always show a good pic(but that can be do to the light in the space that's being used in). Also some times the cam goes out and need to be unplugged and plugged back in. Plus sometimes you cannot get a good picture quality(it show you in a blue tone) the only other cam i can compare it to is the one built into the laptop i use.",
        "This is a great web cam, the software didn't load quite right in Windows Vista but nothing to bad (lock up after software installs but all was well when I did a reboot)I love all the software add-ons'. would recommend",
        "The built-in hook does not attach well to the top of laptop screens. Otherwise, it works OK. The software that similates your face's emotions does not work most of the time, which makes it useless.",
        "just don't use it that often. picture was great, audio a little difficult to setup. i think the logitech and skype software argued over who was in control.",
        "The camera itself works well although there are times when the picture freezes and the voices are a little behind the actual speaking. Setting up through Logitech for the video is simple but you only have a 30 day free trial. Then it will cost you. Other services are free and are shown.",
        "The webcam is working well. However, there are a problem at the beginning. Since the webcam software has a conflict with Dell computer, the monitor turns blue when connecting the webcam to the computer. The problem was solved by changing a file type in system32 (use google to search for the similar problem).",
        "This is a very nice camera. Picture resolution is excellent, and it picks up in low-light conditions well. I'm using it with a laptop over wireless and movements are smooth. The bundled software is kind of bizarre, but that's OK because I don't use it anyway. I'm very pleased.",
        "This cam gets many comments on how clear and sharp the colors are! I have NO PROBLEMS with the driver 9.5.0 which came with it. I HIGHLY recommend!",
        "this is a nice little webcam but with one huge flaw - it crashes certain OS - I have the Media Edition 05 and it certainly crashed mine. Not just once - nine out of ten times....many Logitech webcams have this issue. Check their website for a complete list (somewhere under tech support...). I ended up buying the Logitech 4000Pro and am very pleased....",
        "The camera and attendant software are very easy to use. The video quality is excellent, in fact exceeds expectations for a product in this price range. Would readily recommend it to anyone wanting to get up and running with a web cam capability as quickly and easily as possible.",
        "This is a webcam that adapts very well to all kinds of flat screens. It is easy to use and provides excellent image quality.",
        "This is the best webcam I have so far. Remember, this is a webcam not a real camera. Be realistic about the expectation.",
        "As IT Manager for a mid-size law firm, I've purchased three of these cameras for attorneys to use during video conferencing. The set up is easy and the camera itself is very easy to use--even for a non-IT lawyer.",
        "Device is easy to install, but flimsy and not very stable on a laptop. Did not compare to other comparably priced cams, but overall, it's ok for the money.",
        "Not too bad on my desktop LCD, but pretty inconvenient and clumsy on my laptop. It's been in the drawer for a long time now.",
        "Nice camera. Serves the purpose I purchased it for. Some features see a little flaky and difficult to control.",
        "Camera worked as advertized, adjusting to lighting conditions and sound environment. I liked the way the flexible back adapted to whatever you hung it on. The lip could be a bit larger to improve stability. The software offered a path to the popular telephone programs like Skype.",
        "Sent one of these to my son and his wife in Oregon so we can visit and see grandson.... wow... amazing depth of field. Great product.",
        "Great video and sound. Not easy to setup to the computer but my computer is old.",
        "Of all the models and brands I have owned (5) it is by far the best. Rick",
        "I love this product!! It has a very clear picture. It is very easy to down load and run!!",
        "This is the best webcam I have ever had and I think it is a very good buy for the money... It has awesome quality and alot of kewl features... Incuding built in mic... It also comes with a Logitech headset! All around good buy!",
        "My wife I communicate with our grand kids up North and my son says the fusion works very well.",
        "This web camera is awesome! The installation is a breeze.It took us 5 minutes to complete install without any problems and before we knew it, we saw our video on the computer! The quality is not exceptionally clear but compared to what is available at a similar price, it is great and the audio quality is perfect. It covers a pretty wide area and the lens of the camera is completely adjustable from left to right or up/down. Very very nice!!!",
        "I've been very happy with the logitech quickcam. Picture is very good, it's very easy to use, and very easy to set up. Would highly recommend this webcam.",
        "this cam was the best thing i got from amazon... it works perfect and is very clear n even has a mic in the phone with some other good things included!! if u need a cam with all the perfect things in it and are on a budget this is the cam your looking for !!",
        "after I have tried other and cheaper webcams I ended up with the Logitech Fusion. And to keep a short story short - I works flawless and the installation was a piece of a cake. go for it and you won't fail.",
        "Great resolution. I like it how it can rest on my notebook. Great camera!",
        "I defintely recomment this webcam. Very easy to install and use. Love the quality and features. It was also delivered fast!",
        "I love it. You get what you pay for and this is worth every penny. Good microphone, good in low light, good echo control. If your thinking about it, Get it - skip the cheaper models (which I have made the mistake of buying and returned) !",
        "I bought one for my parents for Christmas and one for us. It works great. My parents love being able to see the grandkids. The picture quality is great and the kids love being able to see them. I would have given this a 5 but the installation was a little tricky, if you have problems just call tech support.",
        "My husband and I got this this so that our parents could see their grandson, as they live out of town. The webcam works really well, and is easy to set up. Some feedback issues when the camera is next to the speakers, but other than that works great.",
        "Quality camera, Quality software ( easy to install & use ) Thanks again Amazon.",
        "Pros I have Windows XP and had no problem installing the Quickcam. The It workes as described. I have been using it in conjunction with Skype for 4 week and I am enjoying my grandchildren. Cons.. None",
        "We love this little gadget. Sets up easily and helps us stay up close and personal with our friends and family that are far away.",
        "It has a lot better quality than the cheaper cameras. Clarity is much improved when used in low light. It still has some audio feedback problems when used on our laptop, but still better than a regular cheap mic.",
        "The video quality on this is great! I like the weighted \"thingy\" that keeps it perched on top of our monitor. The software installed with no issues, and it works like a champ!",
        "No carrying case makes it difficult to travel with. Other than that i love it.",
        "The Logitech Quikcam Fusion is an excellent webcam - super video and much improved audio. It also is better designed for flat panel monitors than other webcams.",
        "like the web cam sits nice on my flat screen montior; best is it does not fall off like the others i have had",
        "This is a great cam, I have really enjoyed using it. It is my first one, so I can't compare it to others.",
        "Logitech products seem to work in XP very well. The problems with Vista are being solved. My wife has a Vista computer. She has a webcam from Logitech that is now working. The logitech webcams seem to work with Live Messenger the best. I like my webcam and would not trade.",
        "This camera is not bad but I believe it's overrated and the reviews are exaggerated. However I think the quality-price is alright. I will give 3-1/2 stars.",
        "Like others have said - if you own Windows XP Media Center Edition the camera can cause lots of system problems, errors, crashes, etc - and that's if it even installs. Skip it and choose another camera.",
        "The met my expetations and it arrived in a timely manner. Howevwer, there was too many issues having to call back for a driver and then having to download myself software in order to make it operational. Simply put: I would have a preferred to receive a disk with the package to upload the software in my PC",
        "It works pretty well, but still difficult to adjust to screens like a laptop.",
        "it worked with my laptop. The laptop is toshiba satellite, so be careful if buying this guy for toshiba."
    ]
}