{
    "entity": "Webcams",
    "text": [
        "Got my wonderful Creative webcam, proudly installed the software, uninstalled the software, installed the software, uninstalled the software. Anyway you get the idea. Not put off by dumb machines, I tried several changes in the default layout. It seems the layout the Creative believes is the living end, AIN'T! I had to change it to AVI and the Intel Indedo video compresser and changed the audio compresser to MPEG layer-3. Best it's little heart, within range it follows me around when I move in the chair, keeping me centered in the picture. I like that. I was this close to sending it back (*) because I had a problem!",
        "Bought for my niece when she went away to college. It arrived on time and in excellent condition. It proved to be very handy.",
        "thankyou i like this cam with voice for my computer next time i will buy more for this cam with voice and save more money thankyou.",
        "My image on my screen is very sharp,however on the other side of transmission the picture is some what blured ( pixelated). The problem could be other then the quality of the Live Cam itselfe. G",
        "I got this camera, it is very simple and picture quality is very good and its a good camera for personal use.",
        "In image quality point of view, it is not something special. You can have the same image quality by purchasing a webcame for much much lower price.",
        "We love this camera we tried another by a well known company and the software and camera did not work with our operating systems. The camera had so many quirks we could never get it working. I am not a computer expert and I got this thing up and running with no problems. I would recommend this camera to anyone.",
        "Webcam does not get detected most of times. Even though it is detected, the webcam does not show the picture. System has to be restarted to show up the picture.",
        "I'm not sure why the other reviewers are not having the same excellent experience that I am having with my Voice camera. The installation was easy, the image is clear and the directional live audio feature that they have, works great. When I video caht with my friend, he says that the image is clear and the frame rates are fine. Also, if there are others around, the directional live audio feature only picks up my voice. The software bundle is very good compared to the other cameras out there. Overall, I'm very happy with my camera and highly recommend it.",
        "After hours of trying to figure out how to focus we have given up and ditching this camera. Since this model only has auto focus there is no way to adjust it manually. We tried calling techincal support and they were no help because we cannot see a serial number so we can send it in.",
        "Liked the built in microphone. The zoom and pan features are nice. Unfortunately the video and still picture quality is poor. Probably will toss when another \"good\" deal comes along.",
        "I only use the video portion of the camera and use cell phone for audio, so I haven't tested the audio aspects. The video quality is very good, although it does tend to have a fisheye effect that is noticeable.",
        "I like the webcam alot, but I am a little disappointed with the resolution. I figured it would have been more clear since it claims to be 7.0 megapixel.",
        "Received the product in tact.... good product, no problem installing the software. Can consider to purchase, but definitely not for the full price!",
        "Not totally impressed with how the cam works. A little slow and choppy and had to reinstall.",
        "Its good with its result and quality is fine, Easy to install and use. The only problem is , its hard to attach it on the laptop , because of it usually fell because of the loose grip.",
        "I bought this one, and return on the same day since it does not work with my wireless D-Link USB 2.0 network adapter."
    ]
}