{
    "entity": "Webcams",
    "text": [
        "I purchased 4 of these Logitech 961400-0403 Quickcams for use with friends over Skype because of the price, performance and features. The resolution is very good for VOIP, and the face-tracking and special-effects features of the associated software work as advertised. I initially purchased a Logitech Orbcam for significantly more but these are so much cheaper with equivalent performance for VoIP that I would choose these any day. Possible improvements: 1. Although the form factor is for Laptops, a wider mounting clamp for desktop LCD monitors would improve its usage. I had to fabricate one for my desktop. 2. A side-to-side swivel mount would also improve its usage.",
        "First of all I had to go onto the website for instructions on how to install the software and driver for Windows Vista users. Finally I got it up and running after about a half hour. The webcam didn't track hand movements very well and the video came out really blurry. My built in laptop webcam was much better in that regard. It's good for someone who stays still and just speaks into the video. The camera didn't fit on my laptop and kept falling off, which got really annoying. After a few hours of recieving this product it's now boxed up and ready to be returned.",
        "I bought this webcam to use with my laptop when I am away from home. I have owned several different webcams and my basic needs are a camera that can deliver 640x480 resolution at 30fps. This camera does a good job of delivering that level of service which is enough to provide a relatively smooth picture. The Logitech software for enhancing a picture in low light also works well as does their software that cancels sound loops that would lead to feedback. The one drawback I have found is the mount has insufficient spread to clamp onto my laptop's display frame.",
        "I really like this one, because it is small. The picture quality is good (I had problems getting a clear picture in the begining, but all I had to do was turn the lense to focus). I really like that it has a build in microphone and speaker. So much better than sitting with your headset. The only thing I don't so much like is that it doesn't fit snug on my laptop and it can fall off when I close my computer (I have a Dell laptop) All in all I really like this product.",
        "I was recently shocked to discover that my Dell laptop did not come with a built-in microphone, making it impossible to have a Skype conversation. So I ordered this camera with a built-in microphone a little bit suspicious of the quality due to the low price. The price was so low though, I decided I would just throw it away if it did not work. I'm happy to say that it works great. It is plug-and-play. No issues setting up and using for the first time. You won't be disappointed.",
        "I love it. The software installed in my Sony VAIO with no problem and the camera provides a high quality video even at low level room light. Some of the accompanying software is annoying, but not a major drawback. I also have a Logitech on my desk top. These cameras have come a long way from the first Logitech I bought only a couple of years ago and ended up giving away because the software wrecked my computer! Unless you're Steven Spielberg, this will do the trick nicely.",
        "I really like this camera. The only drawback I found is that you can not tilt/move the camera sideways after it is fixed on the laptop screen. You can move it upside down (but not left to right or vice versa). There are several other cameras including some from Logitech which let you do that. You would be better off getting something which you can move sideways and/or upside down. Right now, I have to move the whole laptop left or right to adjust the picture.",
        "Excellent camera. Relative to a Labtec product, the resolution was far superior, the room-level light capability much better, and the focusing ring made acquiring sharp images much easier. I was particularly impressed by the close focusing capability. This inexpensive camera can produce close-up images that rival a far more expensive low-magnification scope plus video attachment. The driver was also faster than the Labtec's, allowing a useful boost in frame rate at lower resolutions. I think it's difficult to go wrong with this camera.",
        "I purchased this webcam so my stepdaughter could webcast her sister-in-law's baby shower for my wife. My stepdaughter is in California and her mom and I are in South Carolina. It did the job. The video worked great, although there were some issues with the sound being interrupted. I think another program was running at certain intervals and that was the culprit, not the webcam itself. It did the job we wanted it to do and now we enjoy video conferencing with our stepdaughter regularly.",
        "I was looking for an inexpensive, small webcam and found this one on Amazon. This camera is easy to install, easy to use and the picture is pretty decent. I understand the picture quality could be a little better if I spent a little more money, but with a limited budget the camera does the job. I am happy with my purchase and would recommend this webcam for anyone who is budget-minded.",
        "Works great, no problem with focus that some reviews mentioned. Also it is possible to just install the drivers rather then the full 100MB plus package of extras if you don't need them, just read the directions on the CD initial screens! Clip may be a little restrictive if your laptop cover is very thick or is very curved at the edge but it works fine for me and should work well on most laptops.",
        "I purchased this webcam a month ago. It works pretty well. Very easy to install, take videos, and take photos. The light balance feature is also particularly helpful. It doesn't have perfect picture quality, but is still pretty good. One slight problem: The software does not come with a voice recorder...when using a voice recorder and the software they give you, it caused my computer to shut down and had to recover from serious errors. So don't open two things that use a webcam at once!",
        "The web cam works very well. Installation was easy and the cam is designed to be versatile. I would prefer a better mounting arrangement than the clip that is supposed to clip over the edge of the notebook. The clip does not have much flexibility and will not fit over a wide notebook screen frame. I had to supplement the clip with velcro to get it to remain mounted on the notebook.",
        "Couldn't get it to work with AIM, but it didn't much matter, it works magnificently with MSN Messenger. I've never had a problem with it, I've rarely ever had lag issues, or performance issues of any kind. Sometimes there is a bit of an echo in the speakers, but it's not so much that you can't get over it. All in all this is a great product that produces a VERY clear picture if there is enough light. Also, the filter on it for brightening in low light situations is very good. I'd recommend it to anyone. It fits snugly, but securely on the screen of my Dell Inspiron 9300.",
        "Works well with my laptop that didn't have a webcam. Resolution wasn't as sharp or clear as a built-in webcam, but it served the purpose for Skype and taking quick pics. I didn't care for the software that came with it. It was a bit buggy and would crash.",
        "I don't know why everyone loves this webcam, maybe I got a dud. This camera has never worked properly for me. I've reinstalled it about 10 times and now it won't even turn on. The installation process failed on multiple occasions. This is the most frustrating piece of equipment I have ever used. Maybe it's because I'm running Windows Vista. Who knows. All I know it that I want my money back.",
        "I've had about 4 webcams and this one is definitely the best. My first logitech webcam I broke. I always put it away on the same way, like the cord and such. Turned out the wires popped out, ripping the cord, in some places. I understand this was not the webcam's fault, but mine. So, this camera is so good, I bought another one of the same kind. The sound is great and the image even greater. I have absolutely nothing to complain about. If you're looking for a good webcam, you found it.",
        "Before picking up this one, I've tried Microsoft NX-6000 and Logitech Fusion to pare with my Dell M1210 w/o much success. In both mentioned cameras microphone didn't work with Vista Ultimate RTM installed in my notebook. With this one, the mic did work right away, but I needed to install the new driver from Logitech site (QuickCam v10.4.0 Build 1401) to get the picture. Both video and voice performed extremely well even in the very low light condition (dusk, after sunset in the room with no indoor light, just undraped window). All my peers mentioned very good picture quality. I am totally satisfied with the purchase and recommend this product to anyone looking for miniature 2-in-1 solution.",
        "... at first. I used it mainly for photos and yahoo chat. But lately every time I plug it in, my computer goes to the blue screen and has to do some sort of crash dump thing! It's ridiculous! It's not the first time I've had a problem with a Logitech product, but it will be the last. I've wasted too much money on products that work well the first 6 months and then crap out. Don't waste your money!",
        "This camera is absolutely outstanding. The resolution is great, it is fast, and associated software and drivers are outstanding by all measures. Despite being cheap, it bears the Logitech quality. Just make sure before buying that it would fit your laptop, since it won't stand freely by itself.",
        "I got this camera through a consumer reports website, it was one of their best picks. Fantastic image resolution!, I don't use it every day but so far it works great, although I had some problems between their software and the Windows Vista, I don't know which one is to blame. The camera it's a great product though.",
        "I bought this camera as a needed tool for an online class and had to return it. The minimum requirements do not state that it does not work with Windows 7. I could not install the drivers on my laptop, so I went to the Logitech website to try to find a driver for W7, but there is none. This camera is not supported for W7.",
        "I bougt this because I thought it'll be easy to carry in the included travel case and easy to clip on. I'm very satisfied with that aspect. Picture quality is pretty good, requires little bit of software tweaking for low light condition. Clips on laptop screen nicely wire stays behind the screen. I owned two intel webcams before and software never started unless I wanted to use intel software but with this one if the software is installed then it's automatically launched even if you use yahoo messanger for picture. I'm not too impressed with the software otherwise it's 5 star.",
        "The picture quality on this camera is incredible for its size. It automatically adjusts for low light. The only downside to this camera is that it does not auto-focus, but that is the ONLY downside. The adjustable clip fits my tiny notebook perfectly, and I can just slip it in my pocket when I'm not using it. If you are debating whether or not to buy this camera, buy it. It won't let you down!",
        "i have brought this Logitech webcam recently, at 1st, i was a little hesitating because of the price, but because i need one, so i bought it any way. I am very pleased with the quality (the image) of this webcam, especially when the light is not shinned right on my face (back-light), it adjusts the brightness automatically. i guess just like the old say \"what you paid is what you get\".",
        "If your looking for a decent web cam for under $30 this is one of the best. It works great on a laptop and has a nice carrying case to transport it while on the road. The resolution is great for the price and the microphone is sensitive and can pick up sound great and cancels out background noise fairly well. The face tracking software could be better but I don't use it.",
        "Even though this seems to be a good basic webcam I can only give one star because the software for this webcam really slows down my computer. I tried it on three different laptops with the same disappointing results. I ended up uninstalling the software and don't even use the webcam now.",
        "I just got my quickcam and it was very easy to setup. I had some trouble focussing though since it is manual focus and the ring was stuck. However, with some nudging it finally loosened up and now the picture is crystal clear. It is so small and just excellent. Great work, Logitech!",
        "Purchased for machine shop for use as webcam magnifier. With manual focus, the close-up focused camera provides 20X magnification. At 1-inch distance I could safely monitor the drill bit positioning and drilling process. Any manual-focus webcam is capable of 20X and more magnification.",
        "Bought this for my wife, works fine but the software that comes with the camera is bloatware. If you try and just load drivers, the camera doesnt seem to work as well. For the price its fine, but logitech should allow a driver only install.",
        "Really clear image and voice. Smaller than I thought it would be, but clips securely to the top of my laptop. Software is too unwieldy and slows my computer. When I have time, I'll uninstall it and just reinstall the driver, like another reviewer suggested. At first, I couldn't get the cam to focus, but learned from these reviews that we're supposed to manual focus right on the cam itself. It would've been helpful if the manual said that. No problems using this with Yahoo Messenger. Love the built-in mic.",
        "(...) I think its a pretty nice camera with really good video quality...!!! i had labtec webcam before .. but this webcam is way too better .. I have compared the two webcams side by side.. and Logitec wins hands-down..!! The additional feature of mic is really handy. I have not yet tweaked with face tracking provided with this webcam !!",
        "I am happy with this product. It is easy to use and it works on my Laptop with Ubuntu Linux. It fits securely onto my laptop, which is a Dell inspiron 2200. Once I figured out how to adjust the resolution, it has worked well with SKYPE and the webcam capture program in Ubuntu Linux. I would recommend this product for a easy, low cost solution for a laptop webcam.",
        "This cam has really good quality. It's little and compact, and of course you can put it on your notebook. I gave it four stars because I tried it on my brother's laptop, and it wouldn't get hooked on it. His screen was too thin.",
        "A very good laptop webcam. It works really well and has never stalled or frozen on me. It also records and takes pictures. Its cost effective here and perfect for a laptop for a new user.",
        "This is a great buy. Especially since it has both a mike and camera in one. We used it to talk to family in Costa Rica and we could all participate at the same time and get in the picture.",
        "decent picture quality. biggest issue for me is getting it to fit and sit properly on top of laptop screen. i have to place on the slider lock portion just above the screen to have it sit properly. not entirely pleased with the fit. sits loosely on top. would't buy it again for that reason.",
        "A bit smaller & simpler than anticipated, but can't complain for the price paid. The installation CD was missing some files which I fortunately was able to download from the Logitech website. I can't wait to tryout its video capabilities.",
        "I bought this and it is one of the best cam's I have used. It does a good job and the clarity is good and I have been using it since 3 yrs and its still going good.",
        "The images were not so clear.cause image isn't better just support slightly higher resolution.",
        "I really like this camera. The price was right, the quality very good and easy for me to set up and use. I use this often and have for months without a glitch. All good.",
        "This webcam serves its purpose, but I was expecting more. The sound quality is very good, and the frame rate of the video is decent, but the overall video quality is disappointing; it looks very pixelated. The software is very easy to install, and the webcam couldn't be easier to operate. It's a good webcam for the price, but if you're looking for a high-quality webcam this isn't the one for you.",
        "Never could get this to work and the included software entangled itself so badly, it has been difficult to remove. Windows Vista",
        "This product is exactly what it says it is. The picture quality is pretty impressive for such a small camera. I have read many who dislike the clip but it fits fine on my Dell 1505 laptop. I would recommend this to anyone.",
        "It works perfectly. Has a little bit of trouble with the light, and is very light so standing it up is difficult, but it works very well.",
        "I like this camera. It's fairly easy to get it to stay on the laptops I've used it with (both HP), the software sets up quickly and effortlessly, the camera is small and lightweight, and the picture quality is really nice. I can't think of anything I don't like about it. I would give it a 5, but it's the only Webcam I've ever used so I don't have anything to compare it to.",
        "The install was easy and took under 5 minutes. It's small, light weight and friends tell me the voice quality from built-in mic is perfect. The colour is a little blah but this one received the highest marks of all notebook webcam reviews.",
        "Excellent, inexpensive & works fine with Windows Vista & Skype. Very happy my communication problems have all been solved.",
        "The camera itself is ok. But the spring that clip on the laptop screen is too tight, it hardly gets on my IBM T-40 and T43P (~0.75 in thickness). I have a QuickCAM pro 5000 at work which works much better, although larger in size. make sure you measure your laptop screen thickness before you buy this camera.",
        "Nice and compact with a short cable and a carrying pouch. Convenient for laptops. The only negative is that you have to manually focus your camera. Works with both PCs and Macs (with Macam drivers - the picture in the mac is actually better). Would reccommend it.",
        "I have used this webcam for a while now with my laptop. Works great, very portable, comes with a nice pouch to store it in. Love the quality of the picture, and the fact that one can manually set the focus.",
        "I like the size of this webcam but it doesn't fit the top of laptops very well. But the pictures & video are good.",
        "Quality of the video is excellent on Yahoo messenger. The face tracking is so so. Audio is good on messenger. Works great for video mail through Comcast. You can take a snapshot like a digital cam with a button on the unit (once it is clamped down), or hold it and use like digital cam. This would have been 5 stars if the clamp was worth a crap. It is useless out of the box on my Toshiba A75 laptop. It would have been better just to let it hang on the LCD rather than this clamping design. Velcro here we come!",
        "The Logitech camera was very easy to setup and very good quality. Got it setup in minutes and the picture was very good quality. I got it for my 15 year old daughter and she was very pleased. Good for the price.",
        "This is the best of three webcams that I own. It has great resolution, easy to use, portable and fits easily and securely on my laptop. No disappointment at all with this item. Great value and makes me smile.",
        "Good cam for the laptop, but is not compatible with Windows 7 64 bit. I was able to get it to work. Go to Logitech website and download the plug and play search. It will find a web cam, but not this one. Go ahead and install the driver and ignore when it says incompatible driver. After install open the camera program and it will work. Amazon did not mention this web cam has issues with Windows 7.",
        "A great webcam. Turned out to be better than I expected. Perfect for notebooks. The mike works just perfect.",
        "Well the camera is easy to install and get going but the quality is dismal at best.",
        "Easy setup, easy to use with Skype and good price on Amazon.com. Works best with notebooks. It would be great if it came with a little stand for when you use your notebook as a desktop.",
        "Great picture BUT that's where it ends. Whenever I shut the cam off it blue screens my laptop, the audio is nonexistent. Tech friend of mine did some checking and found some vista compatibility issues. If it wasn't for that I'd actually still have it hooked up to my laptop.",
        "works fine with my laptop, nice camera controls and resolution, no hesitation to buy it.",
        "I'm not good at technology but I purchased this to do Skype with my sisters who live in other states. I was amazed at the ease of installation with the CD and how small it is for storage. It came with it's own storage pouch and it's so tiny it fits in my purse.",
        "Works great with Windows, Ubuntu Linux, Mac, you name it. This is a great webcam for anybody, or if you're not sure you want to spend an arm and a leg for professional business webcam chat. To have a webcam, just jump in an purchase this one. You won't be disappointed.",
        "I bought 2 of the Logitech Quickcam Notebook. One for me and one for a friend in Ireland. They were a good value and work for the purpose. We can now share a cup of tea 3000 miles apart.",
        "The video was remarkably sharp, but never could get any sound no matter what I or my computer guy tried. Returned the camera and bought a quickcam pro elsewhere that worked fine. Go figure.",
        "You won't make a mistake for buying this cam. I recommend to everyone.",
        "I like using this cam with Skype. The quality is great during the day. At night I need to shine a bright light on myself for the quality to be ok for the cam. The sound seems to be decent through the mic and Skype.",
        "I would say the image is fairly good. Also I like the functions like take pictures and take videos. However, the holder design is terrible. It has no way to put on a laptop like Dell or IBM. So I have to hold it by hand every time I use it. I hate to say it, but the designer must carzy. They seem never tried it on different laptops before they put it on market.",
        "works as described, easy to install, though the installation does change some windows xp professional settings for music playback which i had set up for itunes...i wish it had a separate stand it could be put on when u want to change it from being clipped on your laptop....",
        "I use this with both a PowerBook G4 and a Dell Inspiron. It says it doesn't support OS X but once I installed macam ([...]) it worked perfectly. Logitech support told me that the Quickcam Deluxe for Notebooks (note confusing reordering of words in the name) supports OS X.",
        "The product is good and very easy to install, the microphone could have been a bit more powerful. One has to sit very close for it to pick up the voice.",
        "I Have been using it for about 4 years now! works great. The quality of picture is good. Really sturdy!",
        "I bought this webcam few days back from Amazon. For the price its OK but the picture quality is very bad. It's Ok for me because I hardly use the webcam. If somebody who is looking for good quality webcam then this is not the one you are looking for..",
        "THE PICTURE IS VERY SMALL-I USE THIS TO SEND VIDEOS TO MY SIGN LANGUAGE PROFESSOR AND WISH THE IMAGE WAS LARGER",
        "Small in size but big on performance: clear, bright, detailed picture, easy install and user friendly tools; less than $50, it's a steal.",
        "Average camera - the quality is average, the cord it too thick so you cant put it in a stable shape while you want to move it around. I think for the money they could have done a better job. But it is not that bad.",
        "I can't get the webcam focus corrected,and the image remains too blurry to even identify who it is. After trying several times to use the webcam I gave up and put it back in the package.",
        "setup was a breeze and the units worked off the bat. I was able to set them up with google chat right away...just remember to turn off the viewing pane before running google chat.",
        "It's the most simple, easy to use webcam I've used till date. It clips on to the laptop screen and stays in place. Picture quality is decent. Great value for money. I have no complaints so far.",
        "Love this camera. The lighting is always perfect and it's so tiny, I can even take it in my computer bag. I'm buying them for my entire family out of the area!",
        "It does what they say it does. Freezes my comp. sometimes, but that' probably b/c I have too much on it.",
        "Easy installment (if you call usb plug-in is one) and great image and sound",
        "Seemingly nice and compact webcam, however once you connect it to the USB port and see the video output, you will be very disappointed. Horrendous video quality. Splurge on a better model, it's worth it.",
        "The camera is a great little thing. Comes with a little case to keep it protected. Nice clean pictures.",
        "I haven't used it much, but so far it looks good. Easy to install, works as described and it comes with free case. I liked the case.",
        "I love this webcam. Not only does it clip easilly on my laptop, but the microphone is clear and the picture is sparkeling! You can see the sweat on a person's brow and I wouldn't exchange it for the world!",
        "Thank you for reading my review(s). like the quality of this camera and easy to install with the CD provided and easy to use. pros: good quality cons: does not stand on the laptop properly, I am enjoying with this product.... Thank you KiranKumar Gollamudi",
        "Logitech Quickcam for Notebooks Deluxe works like a charm. Thanks so much!"
    ]
}