{
    "entity": "DSLR Cameras",
    "text": [
        "I've never owned or used a DSLR before, so this camera was a perfect starter choice for me. I've known how to use some settings on cameras, but the DSLR has more to offer that I was not expecting. The lens that came with it is also very nice and I love it. I'm not even an amateur, if anything I'm a beginner in this type of field, so all the extra pieces I got (including the manual from my seller) is fantastic. I would definitely recommend this camera as the quality is quite good for an old model DSLR.",
        "I loved the camera, but the metal pins for the Cfast memory card were slightly bent and hard to align with memory card changes. They began snagging and breaking almost immediately.",
        "I had an old Rebel EOS film camera with many accessories and autofocus lenses. I bought just the XTi body with the intent of reusing my lenses etc. Camera is very high quality, takes excellent high-res digital photos, but after trying to take some low-light shots I realized that I needed an image-stabilization lens. Not the fault of the camera at all. It does so much, the only limitations are really my own knowledge. I haven't yet used the software that came with the camera...still using the very good iPhoto that comes with my MacBook. When I learn more about the camera, the software that it uses may be more valuable (for post-processing raw format images, I guess).",
        "The camera and the extra things were in excellent condition. Also, after purchase the combo, the seller added extra things without any extra cost, so I was very surprised for that. This is my first experience in Amazon and I am so glad with it. This completely exceeded my expectations. Now I am really happy with my camera taking pictures wherever I go :)",
        "It doesn't work, and I have ran out of time to return it due to an incredibly busy few weeks. Whomever sent me this failed to mention that the manual controls do not work. I still respect this platform and know these things happen but I am not satified with this product and am stuck with it. I earnestly hope no one has to deal with these same issues and these problems will not continue.",
        "This camera is just what I needed and has served me well so far. Reliable and easy to figure out, but with plenty of functions! Preowned and based on the condition I received it in, I wouldn't have guessed if I didn't know.",
        "Using for a photography class. I've used Nikon D3000 prior and the picture quality for this is comparable. Takes great pictures and works great. Camera was delivered a lot sooner than estimated. I would definitely purchase from this seller again.",
        "This body replaced my original EOS 300D Digital Rebel body. It is a bit smaller and lighter than my previous, but is still constructed well. Aside from the upgraded CMOS sensor and added features, the big difference for me is the LCD display. On my digital rebel the settings display only filled the top portion of the small LCD. On the XTi the information actually fills the whole screen which a 2.5\" display. For my 40+ year old eyes that have reduced near vision that is great! I now can shoot and adjust without having to pull my glasses up to see the shutter speed, ISO, aperture, etc. The bottom line...its solid Canon quality at a reasonable price!",
        "My Canon Rebel EOS SLR film camera is my back up camera to this one. I like having digital that's easy to work with.",
        "I do commercial work for hotel advertising. Already own a Rebel 8MP, but having two bodies eliminates changing lenses so often. Why the Canon? Least digital noise in higher ISO settings, durable body, very user-friendly settings. This XTi has a quick change on point of focus and a larger LCD viewer which I like. In the nearly 3 yrs of using my first Rebel, I haven't found much about these cameras I don't like. The one thing I miss, that I had with my G series Canon point & shoot, is a preview of my shots in a tip-out LCD viewer. That being said - it's a great camera for the money. - Ed Plimpton, Xact Image Photography",
        "Highly satisfied! I bought from the seller TTD emporium for 140$ and I didn't know it came with a lens also! Only downfall was it not having a lens cap but I could find one for cheap so that's no biggie. It barley looks used. Came with a 15-58 mm lens, two battery packs, and a charger. Said it would come between April 5- 10 and it came on April 5. Would for sure use this seller.",
        "I have really enjoyed this camera a lot. Arrived quickly. Came with accessories and battery. Perfect condition.",
        "I got the camera I expected and it's in good condition except for the fact that it almost never actually takes pictures. It just says \"busy\" or the flash spazzes out and acts like a strobe whenever I try to use it. I've had a photo class and have some experience using cameras but never have I had these issues and I'm not sure if it's user error with this particular model or the camera actually has issues but I'm not entirely happy with spending as much as I did on a device that does not do what it's made to do.",
        "Have run about 5000 pictures through this came, with most photographs also containing the RAW image. The controls are easy to access and understand. There are three top level menus and none of the top entries go deeper than three levels. The camera is well constructed given that it has been dropped a couple times resulting in only minor exterior bruises. Perhaps a single noteworthy draw back is that what is to be photographed can only be seen through the eyepiece, but after photographed it can be displayed on the LCD with a configurable display time.",
        "It's hard to imagine why anyone would look elsewhere for a DSLR. Unless you have large hands this camera handles very well. Best of all the controls are so easy to understand and they are located in a most useful fashion - easy to get at when needed, often without removing your eye from the viewfinder. The well lit and large LCD displays all camera setting before exposure and a good image of the captured file. It comes with just about every imaginable feature so you can start with point and shoot and gradually work you way up to complete creative control. Hesitate no longer - this camera is the one you really want!",
        "Bought this for my daughter, came in excellent condition. Very happy with the purchase. Thank you!",
        "I boight this camera for my photobooth. It has worked just fine with the kit lens it came with (18-55). Has not failed me and already recovred my money and some with photobooth. It just works!",
        "Purchase for my inspiring 14yr old photographer...She loves it but think she may want better lenses for some of the pic ideas she has in mind.",
        "I'm just getting into the photography world so I didn't want to spend a lot of money on the get go. I've had the opportunity to use a Rebel in the past and I fell in love. I knew it was going to be where I would start. It's easy to use and the settings are getting easier to change as I'm getting use to what each of them does. Definitely worth the price even for a used camera.",
        "I've had the Rebel XTi for about 2 months now and I'm glad I made that switch from a point-and-shoot digital camera. You cannot go wrong with this one, a good balance between price and quality of output. Anything I say will be redundant since the ratings on this camera speaks for itself. I'm already lusting for lenses and I'm sure a lot of you are. Yes, the lenses do get a bit expensive but a good picture is worth spending the money. I did have some trouble with the viewfinder on the camera I received but thanks to Amazon's great customer service, the replacement was at my door in 2 days!",
        "This camera is easy to use, I bought this so I could take pictures of my Grandchildren. One is a brand new Granddaughter and catching her smile with my point and shoot just did not work as well as my 35mm Konica SLR. With film processing becoming very difficult to find in my area, I decided to go with a digital SLR. The first 2 weekends I had this camera I shot over 200 pictures. It was nice to be able to shoot with a SLR again. I would recomend this to anyone who used a 35mm SLR and wants to go digital",
        "I've been looking for a camera that doesn't produce blurry pictures, takes FAST pictures, & reduces red-eye, and this camera meets all my expectations and beyond!! I'm not a professional photographer, I just like to take pictures especially of my kids and this camera is perfect for my needs. It is very user friendly especially if you've owned a canon digital camera before. I replaced the canon powershot A520 because it was soooooo slow and took too many blurry pictures and lots of red-eyes. The rebel is so much better and I would recommend it to anyone who likes to take pictures.",
        "Takes great pictures. Easy menu to follow. Fits great in the hands. Not to heavy. Great quality. I would probably buy the body only. I bought the kit lens, but I don't really use. I bought another lens that I use on it more.",
        "This is my first digital SLR camera and I absolutely love the pictures I get out of it. I have always had a crappy little point and shoot camera and wanted something nicer for the kids sporting events. Be warned that the software doesn't work that comes with it but its not really needed unless you want photo editing software. Greater starter SLR camera that almost anyone can use. I love the rechargeable battery that comes with it.",
        "Great camera for the hobbyist and semi pro who needs more than the point and shoot can deliver.",
        "I got it for my 13yr old daughter and she love it but it didn't come with a strap but that was ok we just got one of Amazon but overall great camera!",
        "So far so good, after many reviews and trying to make a good decision on my part to purchase and now a few days of pictures I could not be more pleased. Camera takes great shots, great detail, speed, and most of all my kid can aim and shoot and get great results as well as leaving me the freedom of very good artistic control of everything. The difference between this camera and a $300 small digital camera is well, no comparison. Spend the extra $ and get a real camera like this. :)",
        "Excellent camera, I'd recommend this camera for anyone looking to break into photography",
        "I could not be more pleased! For some one that is a little more than a novice this camera is simply excellent!!! High-quality photographs and easy to use. I did eventually replace the lens with an 18-55mm IS lens that is a better quality lens but the kit lens is ok for initial use (I also bought other IS lenses for it). The camera is light weight and takes truly outstanding photographs when used with good quality lenses. Considering the overall cost, I could not recommend it more!",
        "My Photo instructor recommended the Rebel XTi and I am very satisfied with the ease of use, learning the functions and most of all becoming the photographer I never knew I could be. Easy to understand the manual and basic functions. I love the finished product (even unedited). I truly recommend the Canon family for cameras. 10MP is very well enough for the average sizes of photos I need. Beginners don't be afraid. It does adjust well to trial and error. Go for it!",
        "This camera is pristine & exactly as described from the seller.",
        "I have been wanting an SLR digital camera for some time and I am really glad I bought this one. It has many different options for taking creative pictures as well as a very simple \"automatic\" mode for taking pictures without any hassle whatsoever. The pictures are awesome and I am glad I made the decision to buy this camera. I love it. The instruction manual is like a novel, so just take it a bit at a time. You will be taking great pictures the moment you open up the box.",
        "I've had this camera for almost two years now, and I've taken well over 10,000 pictures with it. I've never been happier with this digiecam than with any camera I used before. I went from a 35mm SLR to a hi-grade P&S digital, and then to the XTi; and haven't looked back since. I'll be upgrading to the XSi in the near future, basically the same camera with a little bit higher resolution sensor, live view and a few other bells and whistles.",
        "A great camera with excellent picture quality. With all the shooting modes, just set it and shoot. If you are traveling, my 7D is big, bulky and heavy. It's like taking an extra kid with me. The rebel XTI is a great , light and compact camera.",
        "After going through 3 generations of Canon compact digital cameras (s410 being the last and still working after 2.5 years), I am very glad to finally have made the investment in a digital SLR camera. The quick startup time, the small shutter lag and flexibility of the XTi are fantastic. I have taken several hundred photos so far under a variety of conditions and I am very pleased! I still use my s410 when I don't feel like lugging around the XTi.",
        "Everything was in the box as advertised. I am pleased with the purchase with one small exception. The only instruction manual included was in Spanish which I do not read or speak. For me no big deal, as manuals can be had online for a few dollars. The main item was the camera, a Canon Rebel xti and as stated it works great and looks like it was used very little.",
        "I bought this camera after owning the original film rebel and then a Canon Powershot s50. I have been in love with this camera since it came out of the box. It is the perfect size for my small hands, but still feels solid and sturdy. It is very fast, takes wonderful photos and is very easy to use. I was on the fence between this camera and a comparable nikon model. I'm so glad that I stuck with Canon. I have an online business and spend a lot of time photographing my items. Owning this camera has taken the process from something I dread to something that I genuinely look forward to. Thank you Canon!",
        "My Canon Digital Rebel XTi combines the creative enjoyment I experienced with my 35mm SLRs in the past with the convenience and versatility of digital cameras. Anyone from beginner through professional photographer will be pleased with its myriad capabilities and ease of use: beginners can start with the \"automatic\" functions and develope their skills as they experiment with the vast creative features and functions of the Rebel XTi.",
        "This item came within the specified timeframe and met all my expectations. I used it as a spare camera for a wedding and also for the lense it came with. I did not realize it used flash memory, however, ( my mistake), so I just bought a SD to Flash converter and it works great.",
        "I recently took the plunge from \"point and shoot\" to DSLR. I spent a good 3 months reading reviews, etc on Xti. I was worried I was going to be getting in over my head. BUT I am so happy with this camera. Its not as hard to use as it looks and with \"The Field Guide\" it has helped me really figure out how to get great shots, and now I can take pics with confidence without having to shoot in full auto mode!",
        "This is my first digital SLR and I'm glad I made this camera the first. It's easy to use and fun to learn all the features. The quality of photos are far superior to my previous point-and-shoot 2mp camera. Now that I have this camera, I'm taking a lot more photos and really satisfied with the results. The price is not too high that a first-time buyer is intimidated and not too low that you feel its a cheap starter. The kit lens (18 - 55mm) is okay for basic use but I'm already exploring to purchase a better lens. Overall, the Canon XTI is a great camera especially for digital SLR rookies.",
        "Great camera, great value, good quality. Very good condition. Great seller, product is as promised... correction, better than promised",
        "I purchased this for my daughter for Christmas. I have one myself and wanted to be able to share my lenses with her as her experience grows.",
        "Bought this for my granddaughter going into the 9th grade, taking a photography class. Would have been nice to have the instruction manual with it, though.",
        "this is the all time greatest item I have gotten from amazon I bought it as a graduation gift for my oldest daughter she has been so busy breaking this camera in she loves it and the freedom she has with her chosen gift",
        "I love this camera, it is my first dSLR and i have been shooting for over 3 years now on a point and shoot digital camera, this is like the best upgrade ever. i think this is a great first time SLR users dream, its easy to use and has a whole bunch of settings for beginners and novice photographers alike. Not to mention the price just went down even more then when i bought it last week.",
        "Buy the camera, read the manual first, then shoot five pictures at each setting, indoors & out, study the results, then read the manual the second time. Repeat the above and read the manual the third time. Only then will you understand what a great camera this is and what fantastic pictures you can take with it. This camera has a great 'electronic brain', the photographer must make sure his brain is connected to it.",
        "I own more cameras than I care to mention. I bought the XTI because of its small footprint, and excellent megapixel numbers. I have not been disapointed at all. I love it. 16 X 20 prints that look super sharp are possible if you are using a good lens. It is my favorite travel camera now. I would highly reccommend this little machine for those who are moving up in the digi world from the point and shoot cameras. Compared to my Nikon D2x it is a feather weight, but still gives great performance. Toss it over your shoulder, and you won't even know it is there.",
        "great product, had to get this for one of college courses for beginners in photography. the product was good enough to do my photo projects and what was necessary for basic picture taking.",
        "We really love this camera. We have been wanting one of those really nice Nikon cameras for a while and finally were prepared to spend over $1000 for one. I did a lot of research and found I actually liked this one for about $400 cheaper. I couldn't be more pleased with its functionality. I am not a professional so I don't know a lot about cameras but for me it works great and the picture quality is amazing!",
        "I am pleasantly surprised to see that this really is a good upgrade from my previous XT and wouldn't hestitate to buy it again. Amazon's first copy they sent me was faulty but were really quick getting me out a replacement at no cost that worked perfectly. Little things like that go a long way in making you a repeate customer. Oh, and buy the black body... it's way sexier ;)",
        "exactly as he stated it would be and MAN is it beautiful. Havent used it to its fullest yet but man is it good to have a good body again.",
        "Body only, but we bought it knowing we could use an existing lens from our old analog camera. This was an inexpensive way to get a digital SLR we could hand over to our 13-year old son to learn photography.",
        "This camera is exactly what i could want. Perfect for a college student. like myself, who does freelance photography and perfectly able to use for normal photographic moments. My only negative comment is that i should have purchased an 'IS lens' separate, rather than the body/package deal. The lens that comes standard in this package is not practical for low-lighting shots.",
        "I use this camera everyday to take photos for my clients whenever they decide to purchase or sell a home. Does the job and could not be any happier.",
        "I purchased this product refurbished, what either did not realize is that where the memory card goes two of the prongs were damaged so I can't use it Highly disappointed.",
        "Was a nice Camera for the teachers to use so I could my camera back",
        "This camera was delivered as described. I received the product within a few days and I have been having fun with it since....Thanks..",
        "Excellent quality photos and all the manual adjustiblity you could ever want. BUT before you buy the camera with the 18-55 kit lens, THINK ABOUT BUYING THE BODY BODY ONLY AND A LENS SEPARATELY. The lens is very cheaply made and at f3.5 it limits what you can do in low light situations. I would suggest the Canon EF 50mm/f1.8 II as a good starter lens.",
        "I wont spend time saying how great this camera is.. there are a lot of other reviews saying that. My only comment is that the camera is pretty compact, and if you have big hands (mine are \"normal\".. I'm 5'8\" high), and you plan to use big lens, it's going to be tough to handle the camera for too long. I have a Canon 70-200mm f/4L IS USM and it becomes pretty heavy on the Rebel... I wont return the camera or the lenses, but will probably sell the camera in the future and get a 40D. I'll give it 5 stars easily.",
        "I've had this camera almost 2 months now and I love it more every time I use it. We just had an ice storm and I took some of the most amazing pictures! This camera is easy to use and very versatile. I did invest in a good quality photo software program and it expands my photography efforts tremendously. I'm not technical, so I can't talk as if I am...all I can say is that this camera will not let you down or disappoint you. Well worth the money....but then this was the best deal around.",
        "Having come with the experience (and the Canon lenses) of the XT my only decision was to upgrade to either Canon's XTi or the new 40D. I liked the heft and feel of the bigger 40D but with two shoulder surgeries, that extra half pound was something to consider. There were some nice features to consider as well, but along with those came the added cost--more than double the price. Weighing these differences and the fact I am an amateur photographer I made my choice on this camera. Am I sorry? Of course not, its still a beautiful Canon!",
        "Excellent camera. Great flexibility. during a recent trip I was shooting pictures indoors by upping the ISO where other could not because flash was banned. Quick focus helps me catch grandkids in action where previous digital cameras could not. Multiple shots are fantastic to catch that winning pose. Definitely the best camera I have ever owned",
        "After owning a Canon AE-1 in high school (25 years ago), I bought this camera hoping that I could upgrade from my old Kodak 2.6 MP digital camera. Out of the box, this camera is unbelievable. Even if others have rated the 18-55mm lens low, I found it to be a fantastic camera for the beginner/amateur as myself. I have already purchased a nice zoom lens, and cannot wait to try it out. I would recommend this to ANYBODY that is thinking of starting a hobby or career in photography.",
        "Sturdy and easy to use it has accompanied me throughout many years in extreme weather conditions and keeps on working as when just bought.",
        "Flash dose not work, also we did not receive the 150mm lenses advertised in the purchase prior to Christmas add from seller, I did contact seller via email 2x with no resolution. Other than that it dose take good photos as long as flash is not needed.",
        "I love it, although there are still a lot I have to learn about this great camera. So far, just putting it on the auto feature is giving me a lot of beautiful shots.",
        "As I have never owned let alone used an DSLR this is of course a masterpiece of camera, amazing pictures, amazing quality, amazing everything. The only thing i wish it had was a little more features, my Canon A590 IS has a little more features than the XTi but other than that it is an amazing item for an amazing price!",
        "I keep seeing reviews about this being the best camera for the AMATUER. The pros at national newspapers and magazines were using this level camera three years ago. Moving up to the 5D won't make you a better photographer. I've sold plenty of photos with this camera. I sold plenty of photos with an old 3.1 megapix Olympus I had as my first digital camera. Really don't worry so much about the camera. Buy some good lenses, take a class, learn to work with subjects, look at the light... Often you don't have to be the best phographer, you just need to be the best photographer THERE when it comes to news and events.",
        "It's not the expensive digital SLR that Canon has but the picture quality and options (settings, lenses, etc...) are terrific. Extremely easy to operate for beginners or more advanced users. Lens compatibility (Tamron, Sigma, Konica, etc...) is outstanding compared to other big name SLRs. Can't go wrong!",
        "this is a fantastic camera it does so many things and has great pictures quality",
        "This has been a nice camera for several years now. It has been a workhorse and has held up very well. It has always produced nice pictures and we have never had any problems with it. We have been very happy with this purchase.",
        "excellent purchase. we have used it from vacations to taking pics for importing to 3d printing/modeling.",
        "It was between this camera and a Nikon. The thinking behind my decision was do I want to be in the Canon camp for camera owners? My answer yes. I have a Powershot SD780IS which takes great pix. A Canon video camera (which uses the same battery) and a canon printer(coincidence)which churns out a pretty good 4x6. I feel the brand has proven itself a leader in the category, plus I feel very comfortable with their lens selection. All in all, you can't go wrong. Flip a coin if it helps, but this camera is easy to use and takes great pix. Especially when paired with my 200m L-series lens.",
        "I got this as a gift for my granddaughter, who is a novice photographer. She loves it, and tells me she is driving her friends crazy taking pictures.",
        "Did an extensive comparison of all DSLRs with particular emphasis on Nikon and Canon. The is the best value and you sacrifice nothing in the way of bells and whistles. It's fast and responsive and I particularly like the picture style settings where I can set parameters and quickly change the settings as conditions change. Comparing it to the Nikon D40 or D40X, the XTi offers so much more, I couldn't begin to list it here. Go for it, if you looking for your first DSLR or a backup to the higher end Canons.",
        "Amazing condition! Thank you so much! I'm so happy with this camera! It even came with a car and wall charger!",
        "I love this camera so much, I have two of them. Takes high quality photos. You do need to upgrade the lens, when you can afford it, but will still take great photos.",
        "I have owned this camera for over two years. It was an upgrade from a point and click camera. I will never go back to the point and click. I do not have any camera of this quality to compare it to. It has been easy to learn to use. What I like most is the ability to control everything manually. The clarity of the photos are great. I have been able to blow them up and maintain the clarity of the photo.",
        "I've been using this camera for the past year and it is simply the best SLR out there in the market. The interface and controls are very intuitive and this is where it edges out the Nikon. Canon also has a great range of lenses and accessories to back this camera. Great SLR camera. Go for it!",
        "I bought this Canon rebel Xti digital slr to replace a 1968 canon 35MM slr that needs to be repaired at a cost more than what I purchased this camera for. I'm still learning how to use it,but so far it takes great photos,what my wife likes is she doesn't have to wait for photos.",
        "Excellent digital camera. But, if you have large hands it is hard to hold, for some reason they made it as small as possible. If I wanted small I would have bought a compact camera. I had to buy the optional batter compartment to add more surface area and weight. STill the best.",
        "Love this camera! I'm still a beginner so I have lots to learn about using all the features, but this camera takes great shots in full auto mode.",
        "Very easy to use - usually takes great shots. Has a ton of modes - my only wish is that I could pick and choose the features I want to build my own custom shooting setup. For example, to use RAW mode you can't be in any basic modes - but auto-flash only works in the basic modes.",
        "I ordered this camera without any lens. I had all the lenses from my Canon EOS IIe which is a full frame 35mm film camera. All of the information I have read stated my lenses were compatible with the new camera. Naturally the first thing I did when I received the camera was to try all my various lens and they worked perfectly. I am very happy with my new digital camera and the flexibility it allows me to shoot in various situations. Anyone want a good buy on a Canon EOS 35mm IIe in excellent condition?",
        "Sadly, the camera sensor failed and it is too expensive to repair it. Canon! please standardize your batteries instead of making them specific to a model. This is NOT environmentally friendly.",
        "Bought this for my daughter, who is an aspiring photographer. She is 14 and she loves it. It takes good pictures and it teaching her how to use a dslr, without paying big money.",
        "This camera is my first SLR camera and I absolutley love it. I love the fact that there are many manual setting that you can choose from, such as setting the white balance, to the ISO, shutter speed, and aperture settings. It's great all around, and my friends think i look like a pro, although I insist i am not. As for the kit lens, it has good sharpness, fast focusing, not the quietest though(I'm not sure wheter or not it has the USM), but that really doesn't matter to me. If i could rate it out of 10, I'd give it a 9, it'll earn the last one after i fugure out the rest of it.",
        "THIS IS THE SECOND XTI CAMERA THAT I HAVE BOUGHT. MY SON IS AN PROFESSIONAL FIREFIGHTER AND ARSON INVESTIGATOR. WE BOTH USE THE SAME CAMERAS FOR FIRE PHOTOGRAPHY. DOES NOT HAVE A LOT OF EXTRA BELLS AND WHISTLES. I AM GOING TO PURCHASE A THIRD ONE SOON. THIS IS ONE OF CANONS BEST.",
        "I've had numerous point and shoot cameras from Canon, Sony and Kodak over the years. This is my first step into the SLR arena and all I can say about this camera is \"AMAZING!\" The ease of use, speed of picture taking and image quality if truly amazing. There are numerous other larger reviews out there so I won't go on with this one, but I wanted to put my 5 stars in. Great job Canon!",
        "I own the Canon AE1 so when looking for a digital camera, Canon was the brand I stuck with. I have been wanting a digital camera for years and finally took a leap and bought the Rebel XTI which I have had my eye on. I have tested lower priced cameras and am so glad I waited to purchase this one. It is so easy to use and for my small hands it fits great! I love that there is no shutter delay so I don't miss shots. It may be more camera than I need, but I know I won't out grow it soon.",
        "Bought this as a second camera body, arrived in very nice shape.",
        "Photography is a relativly new hobby for me and I've gone through several cameras over the last couple years. After talking to a friend of mine, a professional photographer, I settled on getting the Canon Rebel SLR. I couldn't be happier with the camera. It's high end enough to do everything I could ever want and still not overly complicated. With a new baby on the way you can be assured that this camera will get a great deal of use.",
        "So far, so good. As always Canon puts out a great product. This is my first digital camera but not my first Canon. It has so many features that if you don't use it all the time it's easy to forget some of its features. I love that it fits all my other Canon lenses. So far, I'm very happy with this camera and I plan on remaining loyal to Canon as long as they keep pumping out superior products.",
        "Purchased this camera with the understanding that it had been refurbished by Canon. I have been completely satisfied with the camera, and the ease of handling, all accessories and instructions were included same as a new one, plus a considerable savings. I received the item sooner than they said when it would ship. I would purchase again if the same situation were presented and the need were there.",
        "This is a very nice beginning digital SLR camera for the serious amateur and budding professional. Lots of features and quite capable of taking very nice pictures. The lens in the kit is okay though it is a step below the camera. I did get several USM lenses and they work just fine with the XTI. I did order the battery grip along with the camera and I would suggest it to everyone as the camera, though very capable, is on the smallish side without it.",
        "I did a lot of research before buying my first SLR camera....it was down to this Canon rebel xti and the Nikon D80. I decided to go with this one and so far am very happy. I am currently enrolled in a couple classes to help me learn more techniques in photography. This was less expensive then the Nikon and does exactly what I need it to do as a beginner. I'm very satisfied",
        "Good product. Gave to my husband as a gift. He was able to use it for a computational photography class.",
        "I use this for astro-photography and it's works well. The only thing I really miss is a live preview on the screen and a DC jack to prevent swapping out batteries. The sensor also get quite hot and shows strong \"amp glow\" when exposing for 4minutes at a time during summer nights, but that's hardly its fault. Other than that, it allows me to capture images of nearly invisible objects thousands or millions of light years away, so I can't complain.",
        "Camera doesn't turn on anymore n the battery was charged I don't know what to do.. help?!"
    ]
}