{
    "entity": "DSLR Cameras",
    "text": [
        "While a lot of people might want a newer 5D for their sharpness I think the original stands out a bit more in its personality/presentation. While 12.8 MP isn't hard to beat these days a picture that gives you a genuine feeling is. Sharpness is not going to do that for you. These are the first set of pictures I took with this camera immediately after buying with a canon 50mm 1.8 If you want a camera that breathes life into you photos, I'd say this is the one.",
        "I really am loving this camera. It's image quality, dynamic range, and color is better than anything i have ever owned. The camera came pretty beat up but it was loved, to be expected with a camera that is 14 years old and sold used, but for $300, i would suggest this to anyone starting out, or anyone wanting to go full-frame. Sensor needs cleaned and battery was horrible, 30 min life, but KEH Camera had no problem sending me another! Buy this used 5D over a Rebel anyday!",
        "I ordered 2 5d's form Adorama and they were both broken in some way. I went with 5 star camera and they sent me a great 5d mark i 12.8mp. I still use it to this day as a backup! Delivered me a solid camera body for a fair price.",
        "This is my first and only full frame camera. In 2015 it doesn't have all the bells and whistles of even $300 mirrorless cameras, but the files and color are as gorgeous as when this camera was first released. I've shot over 60,000 photos with this beauty and intend to shoot many more. If you can get this camera in your collection and have it serviced for free by Canon before September 2015 because Canon has already announced that they intend to stop service after that date as parts will no longer be available. You won't regret it. If you just want a pure photographic tool, this is it, and the prices recently are just great.",
        "My instructor said that I needed a full frame camera. Looked around and they are really pricey. But this is just what the doctor ordered, it wasn't out of my price range, ( i am in school) and it works like a charm. I use it more than I do my Rebel",
        "For a used SLR camera, it looks very nice and functions extremely well. I had one of these when the EOS5 first came out. I liked it very much, recorded some of my best and favorite pictures, but had not used it much in the recent years. When I tried to use it again recently, there was a problem in the viewfinder that I couldn't fix. That eventually led me to search online for a used one in good shape and via Amazon found a supplier who sent me one. It came promptly, as promised, and I was delighted with it when it came.",
        "You can CERTAINLY notice the difference in sharpnes between this and a crop sensor. I had reservations going from a 12 mp cropped sensonr to a 12mp full frame - it makes a deifference. If youre an intermediate photog looking to up your game on a budget this is a great next step.",
        "I was really excited to receive this camera only to let the 3rd party charger charge 12 hours and not work and I didn’t receive the strap that is suppose to be included in this bundle. I am hoping the SouthTown can rectify this so I don’t have to send this camera back. Items were packaged nicely and again i was really excited because the camera body was decent but I won’t be able to enjoy the picture quality or rate that because the battery doesn’t work.",
        "The second I went to use it the mirror popped out. Thankfully it was a fairly cheap fix but the fact is they sold me faulty equipment.",
        "For those who like older cameras like I do this is a nice one to use. Magic Lamp runs well on it.",
        "It has been a great addition to my camera collection. Thank you so much for this find. The body is in exceptional conditional, dials work great, viewfinder looks good and the shutter has held up. Thank you!",
        "This camera was ahead of its time back in 2005. Even today with improvements in processing, new equipement, etc., this camera is consistent, sturdy and has excellent image quality from 100 - 800 ISO. Net it out - other cameras provide additional bells & whistles but they've really only caught up or slightly pushed past the image quality of this camera in 2008. Here are my decisions for purchasing this camera: image quality, big viewfinder, fully utilize my wide lens, consistency in output and control. This camera is a best buy at the current price!",
        "I've used this camera body for the past year and a half. A few weeks ago I used a Canon 5D Mark II at a shoot for some shots, and used this body for others. I could not tell the difference when I was editing them in Lightroom. That speaks for itself. With the right lenses this camera takes some amazing pictures. I'm so glad I got this!",
        "I have researched for one of the best DSLR cameras without breaking the bank and have found it in the 5D model. A very flexible camera, truly a masterpiece for shooting landscapes and portraits as well as anything in between, the 5D fulfills any needs I had prior to owning it. My only wish is that it had a more flexible bracketing system, such as 5 frames bracketing instead of 3 frames. Still, worth its weight in gold, the 5D is the one DSLR I would recommend for any job and for any serious amateur or pro photographer out there.",
        "This camera is everything I thought it would be and MORE! I took it to Disneyland the week I bought it and took some pictures of the firework show and they turned out perfect! I upgraded from a Canon Powershot S2 IS, and while that's a great camera to learn on, the 5D allows you to I completely recommend this camera to anyone looking for a more professional camera that will allow them to use their full range of camera skills. I love love love this camera!",
        "Amazon had the cheapest price (at the time) and the camera is everything I expected and more. I upgraded from a Rebel XT. At the same time I bought two new L-series lenses - well worth the money. I'm still learning all of the features this camera offers. The low-light shots are amazing - the speed is great. I'm a semi-pro photographer and am extremely happy with my purchase - even knowing that any day now Canon is going to roll out the upgrade.",
        "I haven’t used it yet. I need a CF card for the camera. It’s a BIG step up from my Canon T3. Other than that, the body doesn’t have any scratches or scuffs. The viewfinder looks great. Nothing is missing.",
        "640 dollars for a full frame camera. I can never imagine. It works really well, although it came out for over 8 years. The Iso can extend to at most 3200, but it doesn't matter if you have a tripod. The maximum pixels is 128million, but it doesn't really matter. The maximum continuous shooting speed is 2.8. Just don't use it to do it. You need one more camera for this.",
        "A great camera and affordable price! I use this camera as a back up to my 6D, I use it for weddings, regular sessions and for landscapes and never have a problem with it. It takes beautiful pictures, works great with my flash and all my lenses, I have L lense and non-L lenses.",
        "Absolutely love my 5D classic and still would recommend the full frame beast in 2020. Closest DSLR I have that gives a film look and the colors right out of it are so pleasing. Highly recommend this for the price!",
        "This is a great camera. I recently upgraded from a 20D that I also loved... but after one day shooting with the 5D and then looking at the results, the 20D will only be used in case of an emergency, or for B roll types of stuff. I'm a long time pro photog from back in the days of film, and I don't miss those days at all. Today's young photographers don't realize how great they have it with equipment available like this.",
        "not to happy with this product but i guess you get what you pay for,spend a little more and get the best and battery life was very short like one day of uses. Not good.",
        "The EOS 5D is a terrific digital SLR. Its price point isn't for everyone but if you're a very serious amateur or want to upgrade to a camera that's pretty close to the 1D professional version (several thousand dollars more) - this is the camera. It has far more features than I am familiar with for the time being - but it is not hard to learn. I recommend it if you're really serious about photography. The Amazon price, shipping, and business dealings are excellent.",
        "This camera is a few years old but I find it a trusty and reliable camera. I mainly use it for web content and print advertising and with a good set of glass I'm happy to continue using it for a good couple of years before I even considering jumping up to the Mark II",
        "A great work-horse camera. The unit I received had the usual wear and tear of something this old; but considering: it's a fantastic, early-generation professional camera.",
        "Fantastic full frame camera! The picture quality is great and the colors are rich. I will be shooting a lot with this camera for street photography as well as studio portraits.",
        "When I got the camera, I noticed a black ring around the viewfinder window; strong vignette. Only 40% of the camera's viewfinder can be used to take a picture. The pictures come out perfect, but you can't see what you are taking before taking a picture. After researching I found the camera is missing is a focusing ring. This wasn't listed in the description before purchasing; claimed like new.",
        "For a camera thats more than 10 years old, it takes amazing pictures",
        "This camera is amazing. I had a nikon d5500 and I wanted to get something a bit better and more serious. I wanted a full frame and this one was it.when I first got it I noticed a huge difference. This camera made my old camera I bought in 2017 look like a toy. It's from 2005 but it packs a huge punch. Best purchase ever.",
        "Amazing, professional camera. Beautiful files straight out of the camera. It's lightweight but it's no light weight. The 5D is a full-frame camera that means your wide angle lens will produce the image you would expect. The price drop made it possible for me to invest in a second body. You will love it!",
        "I wrote a positive review just the other day, however while taking pics today the mirror fell off. It's going back to Amazon for a refund. 😢",
        "I'm absolutely in love with the pictures that come from this camera. Even at the highest ISO, it delivers great pics with hardly any noise. The previous owner(s) had obviously taken great care of it (thank you!!). For someone looking to move up to full frame and doesn't mind having the bells and whistles of more recent cameras, the 5D is a steal right now.",
        "I'm very satisfied with my purchase. It was delivered in a timely fashion and everything works as expected.",
        "All This camera has changed the way I take pictures. Beautiful color and textures! I can shoot with it all day. Seller was outstanding with care, speed, communication, and delivery of product. I would purchase from seller at the drop of a dime.",
        "I just upgraded from the Rebel XTI and can't believe the difference in clarity! If you've got the budget, get this camera....you wont be bummed. If you are shooting in low light I would suggest getting the body only and a lower f-stop lens.",
        "Just arrived, looks so clean, better than I expected. Can't wait to use it!!",
        "The price started dropping like a rock ever since Nikon full framers hit mass production and now it's almost down to EOS 20D level. The Canon is simpler to use compared to Nikons. Much less buttons & software wizbang, but as a means of getting a picture onto a full size sensor, they do the same thing. When scaled down to internet resolutions, the benefit of full size sensors can't be beat. Shots at 1600 ISO are indistinguishable from 100 ISO at internet resolution. At full resolution, there is more noise in the shadows than there was on the EOS 20D. They have to shrink pixel size even with the larger sensor to sell more to the armchair experts.",
        "Believe the hype. There is something special about the images from this camera. If you are considering purchasing the Eos 5D 12.8 in 2014 you will not be disappointed with it's image quality. I think you would only find disappointment if you are expecting some modern day creature comforts i.e. (auto iso, crazy high iso, blazing fast auto focus and tracking). The high iso still looks good though 1600 is better than some aps c options out there as long as you nail exposure because dynamic range is not really high. I still enjoy using the Canon Eos 5d I think you will too. Just remember the magic is not visible until you upload the images to you home computer!",
        "I don't have to say much, the experts have already said it all. Canon is king and you won't be disappointed with this camera. They've left no stone unturned. I'd like to get my hands on a 1D and compare the differences, but I have to say, for my needs, this meets the bill. I'm a Designer/Art Director and use this camera for everything from art for print and web to shooting finished pieces for my portfolio. Also used it to shoot a wedding and was quite happy. One point, if you spend the dough on this camera, expect to also spend it on accessories.",
        "I bought my 5D used, knowing how it stacks up feature-wise to newer cameras (like my 6D). It's wonderful to shoot with, and I love the photos that have come off it so far. I could wish that it had Live View, or that Canon made 64-bit Windows drivers for it, but when it come to taking pictures, those don't matter so much.",
        "This is a much older DSLR, but I absolutely love my camera! I purchased it \"used\" but I feel such a kinship with it, it's as if I had it since it was just born :-) Canon is my go-to camera brand, and I'm happy with all their products, but this camera - combined with Canon a Canon lens - takes super-sweet photos. Love Love Love.",
        "Great all rounder shines in landscape nothing comes close for this money, ok a new one be coming but will be $3000 [...]",
        "I added the EOS 5D to my Rebel and 30D. What a great addition. So far I had nothing but fun shooting with this camera and the EF 17-40 mm f/4L USM glass. There is a reason this guy here has been shooting with Canon for the last 33 years.",
        "Has help up well through 80+ weddings and is still going strong - has been replaced by the Mark II but my 2nd shooters still use this camera and enjoy it.",
        "In the past years I was working with several other cameras, 1D, 1Ds, eos 20, 30, 40 Canon's D200, D300, D700, also with micro four thirds and Fuji X Pro 1 cameras, and definitely the EOS 5D, is one of my favorite cameras, even today in 2015 is a great tool for the professional photographer.",
        "Probably like most people that are waiting for that \"phantom\" 5d MKII, I couldn't wait no more. The rebate pushed me over the edge. I'm glad I took the plunge. This camera rocks! I'm so glad I upgraded. I'm sure the next version is gonna have all the bells and whistles, but this has become a legendary camera. Everyone has already gone over the specs and likes and dislikes. I just want to say anyone waiting for the new version and wondering if they got this, would they be happy......be assured you will be VERY happy.",
        "I bought my used camera from Adorama Camera. It works perfectly, however, the shutter was broken when it said it was not. I contacted them because I had 180 day warranty. They said they could refund me but could not send me replacement or repair the broken shutter. I spent $250 to replace the shutter. It still is a great camera, though. Made well. Takes wonderful photographs. Superb bokeh with the Canon 50mm f/1.4.",
        "This camera is awesome. It is great in low light and I can still ghost images which I prefer doing. I've gone to the dark side (digital) and I really enjoy it. This is my first DSLR.",
        "been using crop sensor cameras since my Nikon D80 came out. Wanted to see if a full frame was worth the extra dollars but didn't want to spend a grand or more. This camera is great and has returned my love for photography. The colors are great and now the focal length of lenses give me what I expect",
        "I gave it a 5 because it is what it is. Image quality isn't that much better than the T3 (also 12 MP) but now I have much more control over DOF. Thank Gawd I got the T3 first or this camera would have confused me no end. Not really a beginner camera. I would recommend the T3 and later as a beginner camera before you move up to one like this.",
        "I got this as an upgrade from my 350d (rebel xt) and it is fantastic. If you have a good collection of lenses, you will notice the upgrade in performance, though on my 28 1.8 prime, the distortion was a little more pronounced than it was on the 350d. Another thing I wish I had considered was the 5d kit (with 24-105) which offers a significant discount on the lens.",
        "When buying this camera, i was upgrading from a canon 20D . I had originally planned to buy a canon 50D as my upgrade. I am very happy that I went with this model. Get this camera, the full frame makes your wide angle lens more effective.",
        "This is an oldie but a goodie. I'm new to photography and wanted a full frame camera. This was the best deal I found at just under $500. the camera is in great shape with only signs of normal wear.",
        "My first digital camera that got me started in the photo world. It recently got ripped off by a place called Calumet photo in Santa ana. So yeah, never doing that one again!",
        "I've nothing but good things to say about this camera and it's files. Beautiful and worth every cent.",
        "50 years from now if you go to the Smithsonian Museum you'll find the Canon 5D on display. It is the first pro-sumer level DSLR that has a full sized frame sensor. If you don't know why that's important - you have no business buying this camera. If you do, then you already know why this camera is so special. The build is top notch. Solid feel, well laid out controls, wide selection of accessories, everything you could want in a top of the line camera. I honestly can't think of anything I would have done differently. Some of the professional reviews mention little picky things that they would change, but for me this camera is perfect.",
        "Works great, but it smelt like cigarette smoke so I had to spend about a week trying to get the smell out of it. Other than the smell (which I was able to get out) camera is working fine. I like it!!",
        "contemplating the Mark III now causes me to reflect on what an incredible product this has been",
        "This camera is amazing. I have been a canon user for many years, upgrading as I go. I can not think right now of a camera they could come out with to make me want to upgrade from the 5D. This will certainly be my camera for some time to come.",
        "A really great camera. Solid build, photo IQ is excellent and the more i carry it the more i appreciate it.",
        "a 5 star camera for sure We increased the quality of our photos by at least 20 % from the D 30",
        "What would be a good email or number to contact you all about a possible return issue that I am having?",
        "The camera was in good shape but the sensor fell off as soon as took the 5th picture. Luckily there was a canon store near where I live and got it fix.",
        "I recently sold this and purchased 5DII, primarily because 5D LCD not large enough for me to evaluate and edit files in-camera. Waste of time to edit in computer, if can eliminate pictures in camera. For years, however, this coexisted with canon 50D, take pictures on this , edit on that. I shoot children, weddings, scenics, natural patterns. This is great camera for these purposes. Prints well to 11x14 or better, but you know that. File sizes are reasonable, good contrast and color, great Canon full frame lenses. I shot Canon film cameras for many years, have legacy lenses, work great with 5D. Would give 5DII five stars, afraid to try out 5DIII. JWK",
        "Just got the 5D..traded in my 20D...the 5D is a more solid camera with a full frame sensor...pictures are great and it is easy to use if you are familiar with the Canon system...a little pricey, but worth it!! You'll use it for years!",
        "The camera's condition was excellent and exceeded my expectations. There were no signs of wear. It feels brand new compared to other 5D's I have used.",
        "I love my 5d, thank you to my seller for being quick and friendly. Can't wait to adventure through life with this babe.",
        "A great camera for a great price. I just switched from a Nikon d5200, I am not bashing on crop sensors or Nikon, but this full frame is FREAKIN SWEET! Its a must have.",
        "Great image quality, feels pro like and came pretty fast",
        "Good functionality. A little on the heavy side. For an amateur photographer, it's nice. The other camera I have is a Nikon D40, and I'm not gonna lie, I like that one better.",
        "I bought this camera thinking I was getting an outstanding camera due to the fact it was the first of the L Series. I wasn't too excited and was bummed that I didn't opt for the 7D mostly because the Lenses are so much more money and the 7D has more options. If you're looking for Full Frame for little cost then this is the camera to start with.",
        "I noticed NO wear & tear on the camera body & takes great pictures however I cannot use user manual so have no idea of how to use the settings as the manual is in EVRY LANGUAGE BUT ENGLISH and this was NOT notated in the items details before purchase...besides that I am pleased!",
        "This was a Christmas gift for my daughter and she is a little disappointed. It doesn't even have the CT card. ???? Can we return it?",
        "Purchased camera brand new to serve as a backup camera for my wedding photography business. Used for two days without a problem. On the third day, the camera was dead. I tried a new battery-still dead. Trouble shooted issue with Canon-it was determined that the camera was defective and had to be returned."
    ]
}