{
    "entity": "DSLR Cameras",
    "text": [
        "Another item I purchased \"used\" through Amazon. This is a great, albeit outdated camera. The price was great and it came with a full array of accessories. The door for the film card didn't work but was quickly fixed with a bit of velcro and some superglue. I have taken hundreds of pictures with this camera since it arrived. I am very happy with it.",
        "The E-300 is so intuitive and easy to use. Physically it feels so much better than the Rebel or the comparative Nikon. The rubber-coated aluminum chasis and smooth-working controls make it hard to put down. I recommend buying several 1Gig cards for it though. This weekend I took some autumn portraits of my cousin and his wife at the park. Using .tif and no compression, I only got 34 pics! I had to field delete some. I love it. I am planning the next session already.",
        "I received the Olympus E-300 (EVOLT) for Christmas and I am extremely happy with the camera's performance. The look, the feel, handling, image quality and the many, many features are just what I was looking for in a DSLR. The focal plane dust removal system is unmatched by Canon and Nikon. The imager chip used is the Kodak KAF8300CE, a high performance CCD. Since one of my intended applications is astrophotography, I am interested in the ultimate in performance from my DSLR. I would recommend this DSLR to anyone interested in having the best! The purchase was from Adorama by way of Amazon.",
        "I was very exctied to receive this item, as it was a valentines day gift for my wife, until she tried to use it, so far its been in twice for repair for the same problem, the lenses will not focus. I'm not sure if this is the fault of the manufaturer or not, but I am giving the store the benefit of the doubt and giving them 5 stars, this is for price of this item, and the quickness in which I received it.",
        "Excellent camera. Easy to learn and operate. Excellent picture quality. Purchased the Olympus name because of previous experience with Olympus cameras (OM10 SLR)and was not disappointed.",
        "I was disappointed that the camera does not takes clear, crisp photos everytime. I like the camera, but the unprectibility is frustrating. Will return and try another series of Olympus.",
        "When I decided to go fully digital I read every review I could find. Not having $6-7000 to spend I kept it under $2500. This is the best camera out there in this price range. It is sharper than any of the others. There are minor complaints about color acuracy, but that is a lot easier to fix than lack of sharpness. Very powerful flash. Amazing for its size. Nice weight and balance. If you want a DSLR this is really the best you can get for under $1000 and that is with 2 lenses.",
        "I love this camera, it photographs great, it has great lenses. Now the great thing about this camera is that you can pick the types of photographic scenes you'll be taking in automatic setup or you can customize scene exposures and other photography features like in the oldschool 35mm cameras did such as so you can get streak in lights and other effects that the old film cameras were able to do. The pictures come out superbly. The only negetive I have to say is, the manual could use a little improvement and their is a sound when you photograph that's it. If you can live with those two faults, then its an awesome camera to get. Merry x-mas",
        "New to the digital SLR world, even a novice like me has figured out what all the little buttons & doo-dads are for. I have uploaded our pictures from our vacation & was amazed at the quality and how beautiful they came out. The little screen on the camera has great quality & detail for the size. Can't wait to become a pro with this little pint-sized powerhouse!",
        "This is a great camera for someone who is getting used to a dSLR. It has a ton of features and excellent image quality without having to spend lots of money. I have bought several accessories and have been very happy with the quality of Olympus. I have taken many great pictures and got rid of my old canon after this.",
        "From 2004 till 2007 it was my basic camera, and it was rather good for me.",
        "This is a fantastic camera, especially for the money. I've just been getting into photography recently, and I don't regret shelling out the money that I have. It is the best priced 8mp digital slr you can find.",
        "This is a solid camera. Feels great in the hands and takes pretty pictures. The viewfinder is a little dim and focusing can be tricky at times with the included lenses. The menus are easy to navigate and the buttons are layed out very well. It is a good camera for novice and pros alike.",
        "I hate this camera. It's finicky and very difficult to get it to focus. If the lighting isn' perfect you're out of luck. I thought perhaps it was just me, but when I passed it over to a more experienced SLR camera user they had similar problems. I really wish I got a different camera. Every time I try to use this it just ends up being a headache. Putting the settings on automatic doesn't help either. It results in horribly lit and blurry pictures as well.",
        "Before, I bought the E-300,I looked at the other SLR camera's and was impressed by some of them. But, not as impressed by the E-300. The E-300 caught my eye by it's looks and it's functions. Also, all things it can do! Plus it was easy to use! When I first started using the camera I was \"VERY\" impressed by how well the pictures were coming out. I am pretty impressed with the E-300! I am \"GLAD\" I choose this camera and I would not trade it in for anythings else.",
        "It has been about 2 weeks that I have received my camera. I am a novice, this camera takes great pictures,very easy to use, it is built very tough and feels great holding it. I will highly recommend it.",
        "Nice pictures, good price, bring me total different feeling comparing with my other digi cameras.",
        "It's got a lot going for it, but no one has seen pictures from a production model yet. See full preview here - [...]"
    ]
}