{
    "entity": "DSLR Cameras",
    "text": [
        "replacing the d300 i had to sell a couple years after it was released; this camera does what I need it to do. Really, it has about the same capabilities as today's cell phones in regards to harsh lighting conditions from what I've seen. That and it has the heft I need to take sharp photos at a tenth of a second. Its been a LONG time since I've had a digital camera and picked this mint one up for $50. Definitely wish I found a D300 for that price but its all I need right now.",
        "Takes me back to using film days. There is 6mp and then there's \"6MP\". This has a APS C sensor so it's probably the the best 6MP. Works with all my lens, old film af lens and manual lens. Read up to see if yours will work. With older non AF lens you have to go manual but the focus indicator still works (set ap with lens ring and shutter speed with right front wheel). I have a photo app on my iPhone that acts as a light meter and recommends settings. This has been working for me. AF lens can go auto , etc ,of course. I love the feel and weight of it. I'm very satisfied.",
        "Great price. Color capture sensor seems spot on. Great match to the fuji frontier printer. These cameras do have an issue with the CF card holder, which I've been told is ceramic and can crack. That's why I down load images through the USB cord. and I don;t remove the card. Great battery life also.",
        "Can't recommend this camera enough. Best battery life of any of the DSLRS I've ever tried-- battery seems to last for weeks. I've been using it almost daily since 2006 and it works as good as new. The body is incredibly solid. Heavy, utilitarian, and highly functional. NO bells or whistles, no video, just a very good value.",
        "Nice. I love the D70S. There are newer, higher MP cameras, but this is an easy to use DSLR with a lot of features, and it take almost all Nikon lenses. Seller did right by me as well. They are getting old, and everyone wants the \"new stuff\", but I love the D70S camera. Cureently up to 63,000 shutter count and still trekking on.",
        "the Nikon D70s at ISO 200, the noise is practically non-existent, because the photosensors that make up the sensor are bigger, and It synchronizes to 1/500 sec in flash mode with my external Nikon flash SB-600. The image quality that this camera provides is incredibly crisp and clear. Here is a picture by Sunny day, noticing the sharpness of the trees and the fidelity of the color of the blue sky.",
        "Works great. Have taken a bit of shots already. Enjoying it like no other. Shoots amazing pics even for how old it is.",
        "I would give 5 stars but it's not as easy to figure out like my D5000. So much for that...The pictures from this camera are amazing...I am a professional photographer and my 2nd 1st set of pictures landed one of my clients two commercial roles.",
        "For a used Nikon Body you get what you paid for. Needed to be cleaned up.",
        "I'm new to digital photography so the choice of options this camera gives me is excellent for me to learn how to shift gears. The manual wasn't very hard to get an idea of how I wanted the settings, and pictures have so far turned out great.",
        "Great entry level DSLR. Worked perfectly. Bought for a friend that wanted something better than a point n shoot.",
        "well I first got it had no clue how to use it but now after 2yrs... I love it and it has been sucha good camera for me and It is very easy to use. I love it so much it will complement my new addition nicely. SO if your looking for a good starter camera from nikon its good.. If you don't belive me on the pictures this camera can take...Please feel free to take a gander at the photos it has taken [...]",
        "Perfectly satisfactory and it meets my need for a camera body that I can use with Nikon AI lenses.It arrived in good condition and exactly as described. R. Maier",
        "I bought this Nikon D70S to replace my broken D70. My D70 was a workhorse that I had used for about 6 years. It had about 15,000 shutter actuations. I like the D70S better because it gives me all of the features I had on my D70 + a larger screen on the back. Excellent picture quality for this price range.",
        "Wanted to see if my wife would be interested in going digital, She always took 35mm pictures with a film camera and since both film and developement was getting tougher to find I decided to purchase this camera. She now has a new T5i and this on is her backup",
        "Excellent purchase. Though this may be an older model, it is still in great shape and has done amazing. I had the opportunity to take action and stills during a Youth Regional Soccer tournament a few weeks back and all of the pictures taken were great quality. Probably the best product I've invested in, in a long while.",
        "Camera and lens arrived in well protected packaging. Equipment performance was as if they were bought new. No scratches on the lens, no scuff marks or other problems with camera body. Hardware and software worked as described in manual. Two memory cards, rechargeable battery, camera strap, camera and lens cap all provided with camera plus lens deal. Great value for money and saved 100's dollars if bought new. I would not hesitate to purchase from this seller again. The only disappointment was that no tracking info was provided when requested, this made it difficult to determine precise delivery day/time.",
        "It was sold as a D70's but it was a D70.",
        "Love it! Just what i was looking for and in pristine condition also...having manual is a blessing! Thank you!",
        "Bought this camera for my 11 year old grandson since it looks like he wants to follow me as a professional photographer. This is his first \"real\" digital camera (I have one as a back up camera because of its ability to take flash photos at 1/500 shutter speed) and he really likes it. It's a dependable camera and well made. He'll outgrow it soon but it's a good beginning.",
        "The Nikon D70S is a very good beginner to intermediate digi slr. Easy to use but also has a lot of options and manual settings. Battery life is amazing. Taken at least 500+ photos in raw format and still have half battery. Well built, strong body. 6.1MP is decent. Everyone now a days thinks more is better more is better however 6.1 is plenty for me. It all comes down to the photographer anyways. Good for people who are beginning digital photography, def. worth the extra money over the D40.",
        "What can I say - it's a Nikon! I've been using the coolpix series for the past few years but miss the ability to zoom and focus the lens myself by twisting the lens barrel. This camera has more rave revues than others I looked at and, so far, has lived up to all of them.",
        "Far better than I even expected. The only thing that would make this better is a bigger screen. Absolutely amazing! =)",
        "Very happy with what I got. The kit had all the contents mentioned. I would gladly recommend the camera to a amateur photographer.",
        "Awesome product, fast shipping would buy again... thanks so much!",
        "The camera is a used product but seems a new camera. It is working perfectly and make pictures like a new camera.",
        "This was my first DSLR and learned everything I know now on it. I took it everywhere and practised every technique I could. I have since moved on to a larger camera.",
        "The D 70 S was a replacement; I was familiar with its operation. The camera was properly/safely packed. The condition was excellent ( as represented ). Amazon is a quality operation. Mike Thal",
        "Love the camera! It goes well with the 80-400mm lens I bought it to go with. It also goes well with the D70 I already had.",
        "Camera body was in great condition...battery was bad but after we got the replacement it was good to go. Got a brand new charger with it too.",
        "Product was as described. Perfect condition and fast shipping. Thanks again!",
        "great product, just received it and so far everything is good! LOVE IT!!! :)))",
        "the camera come has described, very good conditiom, like new, is a nice and cool camera",
        "Had to return this item. Although it was listed as being in good condition, it wasn't. I checked a couple of functions and they didn't work. I tried the flash and it didn't work.",
        "better to buy a point and shoot, photo quality is just as good with Cannon A540, even when enlarging prints up to 36X24inches.",
        "I'm just angry, it said it would work! I haven't been able to see no one pic' I can check the menu but not the images :(",
        "Im not from USA. My brother bought me the camara in a trip three months ago and it is not working!! It has serious conection problems in the body that I cant fix in my country. I lost 1000 US$"
    ]
}