{
    "entity": "DSLR Cameras",
    "text": [
        "Purchased this used for $450 and am VERY impressed with it. It only has 4.2MP which is fine because if I ever need images above 2464 x 1648 I can just use interpolation. This is a very solid body, I love the 8fps, and for a 10 year old camera this still blows away the Canon rebel series. I also own a T2i which is great for the video, high iso, & high MP but the build quality of the 1D is far superior as well as the fps, & af points. I highly recommend this, or if you have some extra cash then get the mark ii",
        "I own an EOS 50D and I bought the EOS-1D as a backup for it. While the 50D has many features not incorporated into the 1D, its solid body and ruggedness make it purfect as a backup. The newer EF-S lenses will not work with the 1D, however, the rest do. It's speed alone make it a great for a backup! Great Camera!",
        "OK so its low in Piks,but for general and close up,I find this camera unbeatable,it also adds to my Canon collection,next will be the 1d-MK111 (Yes I am a BIG Canon fan)",
        "great camera and price a lot of stuf came with it",
        "Good camera, but too low resolution. No, excelent camera, but too low resolution. Need more words for review to take: Good camera, but too low resolution.",
        "It's disappointed to find an \"error 99\" when I try this equipment,how should I do?by the way,it's difficult to find the accessories",
        "I bought Canon EOS-1D 4.15MP Digital SLR Camera (Body Only) . but That's Item too old. so I hate it",
        "Any one that would give this camera a two, obviously has never had one, I have a canon G9 and no way that this very great point and shoot begins to compare with my 1D, well maybe in ease of carrying. Is it worth $1,500 probably not, but then I paid $450 for my G9. This is one awesome camera and you need to experience it to know how great it is. I have taken photos at 1600 ISO that were very usable with this old technology.",
        "I know it has only 4 MP sensor, but pro autofocus, 8.3 FPS, pro body with weather sealing, built in hand grip. Put a fast lens on it and I seriously doubt any of today's camera will focus any faster. Just a touch on the shutter button and 45 points come into action and in AI SERVO MODE it is impossible to loose your subject. A regular camera you just fun with, but this one you have fun but times 5.",
        "I see where this camera is selling used for $2000. Lets face it. This was a great camera 6 years ago but $2000?, no way. Time has passed it by. I realize it's built like a tank and has a fast burst rate but in every other way a new $600 DSLR is superior. In my opinion if you pay more than $500 you're wasting your money, unless you're a collector maybe. The IQ can be matched in most ways by a new P&S camera."
    ]
}