{
    "entity": "DSLR Cameras",
    "text": [
        "UMy wife upgraded from her D50 so I had it converted to an infrared-only camera. I like that very much, but now that I am interested in astrophotography, my D700 is just too heavy to wiork well on a smaller refractor. So I bought this refurboshed D50 and I am thrilled with it.",
        "I bought this for my son to get him interested in something other than video games. It's easy enough to use but full featured. The picture quality is great, it is just a lower megapixel than new cameras, so you can't print them poster sized. Small prints are great. The lenses are interchangable with most f-mount nikons, so there are lots of options. The only downside is that you will have to order memory cards because it is compatible with 2gb or smaller sd cards only.",
        "Wow! IF you're looking for a great deal, the D50 just might suit you. 4 stars for the slightly lacking feature set, but I probably wouldn't use them anyways. Get a telephoto lens, some filters (esp. circular polarizers), a good case, another battery, a flash (I'm happy with the SB-600), rechargeable AAs for the flash, and at least 2 gigabytes (read Sandisk Ultra II) and you'll be set for life. You'll probably want a card reader for your computer, too. It's faster than the camera's transfer mode is, doesn't waste battery power, and is WAY faster than the reader built into your laptop.",
        "I ordered this camera from Amazon, got it and started snapping away right off the bat. It's a great camera but when I went to recharge the battery I found that the cord wasn't a domestic US cord. I emailed Amazon, they said call Nikon. I called Nikon and they said it's a grey market camera and they may not be able to support it. They have suggested I send them the cable and they will look into replacing it but made no promises. I know the cable is easy to replace on my own but now I'm worried that if the camera itself has problems down the line Nikon will refuse to support it.",
        "I love this camera. I happened to have an old Nikon N2020 SLR with a half dozen, almost new in the box, Nikkor AF lenses, (circa 1986).Every one of them work great with my D50 body. I know it's not a camera a pro would want, but you can do a sight more with it than point and shoot. The manual is a tome but after you try and read it buy Nikon D50 Digital Field Guide (Paperback) by David D. Busch, which helped me a lot as I haven't used an SLR in a long time and need to be retrained. Unless you need to print posters the 6.1MP D50 works for me.",
        "I've owned this used camera now for a couple months now and was very pleased with the purchase. It's a old camera and it's used but this a perfect camera for learning about dslr. The camera was better than described and I would do buisness with this company again.",
        "The Nikon D50 is no longer in production, but you can find them used online. This is a great camera. They say it's a beginner camera, but it has almost every feature someone that's been shooting for a while would need. Specifically, a dedicated button for ISO and White Balance give you easy access to two thing I commonly use. Only thing I wish it had was a Black and White mode and an illuminated display on top. Other than that, a great great camera.",
        "After deciding to get into the DSLRs, I spent about 6 months researching and learning all I could about them. After finding that the D40 was on the horizon, I decided to wait and see. The D40 didn't seem to be near the camera the D50 was. FINALLY, i took the dive. I could not be happier as this camera is, in my opinion, the best entry-level DSLR still on the market... but not for long. In retrospect, I'd buy this camera again... only sooner.",
        "Been in photography over 50 years, with about all formats. When I decided to go digital SLR, read every review of every camera by major makers. This one came through better than all the rest, on paper. I bought it. Performs flawlessly, great pictures, (main thing-that's what cameras are for!) easy for the beginner to use, and allows the user to grow into it. In the meantime you get super images. Seriously, 6 mp is all you need when produced by this jewel. It is a fine camera. Highly recommend.",
        "The flash didn't work. This should have been expressly stated. It also didn't come with any battery, which is ok, since it was a \"body only\" but I was expecting a camera that was testable out of the box... again, I feel that a responsible seller would have expressly stated such things.",
        "For the insanely cheap price of almost pocket change, You can get your a great nikon that does the job and takes great pictures. Would highly suggest buying if you want a nikon for cheap that comes from a reliable service. When i got mine it was like a dream come true.",
        "Product was as described. Works great vendor shipped on time. Awesome job!",
        "I bought this used....it looks and works like brand new! i am very pleased.",
        "Well the price was great, but I have to take two pictures each time because one is always underexposed and almost black. If there is a fix for it I'm not aware of it. I'm getting used to taking two pictures.",
        "Can’t get the external flash that came with it to work. Tried new batteries and everything. The camera itself it good though.",
        "Outstanding handling and service by the seller. Product is in perfect condition. Awesome. Thank you",
        "The camera is awesome. Better than the old one it replaced. Thanks",
        "Great Camera!! Get this for a beginner at a low price and you can't go wrong.",
        "Bought it to replace one I had that was broken.. It worked wonderful!",
        "This was exactly the camera I was looking for as a new photographer. I love it!",
        "Bought this for a Gift. Very nice camera. Shipped very fast.",
        "I just ordered a Nikon d50 used camera. When I go to insert a memory card it says \"You can not use this memory card\" can anyone help me? Should I get a new memory card? I am not sure how to contact the seller either",
        "The product is what I have order and expected and was not disappointed. Would recommend to my friend without hesitation.",
        "Very high quality camera, I ordered it about a year ago and it still works like a charm. The auto focus setting isn't perfect but for the price it is very worth it. Note that this doesn't come with an sd card or a camera strap.",
        "The camera is great. Need to clean the sensors / get them cleaned. Otherwise the camera seems to be in tip top shape.",
        "Great clarity, speed, ease of use, and picture quality. I don't ever want to use my point and shoot anymore unless I'm out and about and can't carry the Nikon with me. Buy this camera and you will not be sorry.",
        "this camera stopped working after a month of using it, after i paid more than 100 dollars. I am so disappointed",
        "she is beautiful condition, very happy with my purchase. delivery was speedy, all parts included, well packaged. exactly what I wanted and at unbeatable price",
        "Great pictures, and easy to use, including the menu. Can just point and shoot, plus much additional customization. I added a Patriot 4 Gbyte high speed SD memory chip and can take 2200+ jpeg quality pictures, although the battery will require charging before running out of memory.",
        "I bought this camera as an entry level DSLR and it has exceeded all expectations. Very simple to use. Easy to adjust aperture and shutter priority to get the photos you want.",
        "the seller sold me exactly what he advertised. the camera was just like new and even though the clock wheel didnt work like he stated i found a way to adjust the setting from the clock wheel by using camera control pro which enabled me to control the settings anyway. overall i think i got a excellent camera for a budget price.",
        "I felt the price was very competitive and it was received within the time frame the seller told me it would be. The camera is very easy to handle and has so far taken wonderful shots. It was just what I was hoping it would be.",
        "I miss this camera! I made the silly mistake of thinking I needed a newer model. Basically, I feel like the husband in every Rom-Com that realizes they shouldn't have tried to trade up their wives. I have not had a camera since that I loved using as much.",
        "Takes great pictures. NEVER SHIP THROUGH USPS though.. Took forever!!! The camera body and lens perfect condition along with the bag. Thanks!!",
        "The D50 has everything a beginner could want: autofocus, aparture setting, shutter speed, etc.. I feel that when I leave the beginner stage, it will be able to accomodate my skills for a very long time.",
        "This camera is similar to the one my fiance had a few years back. She loves it. It came in the mail promptly, and was exactly as described from the seller. A great started SLR camera. I have used it many times myself and not being experienced it is very user friendly.",
        "I'm not happy with this purchase. I had high expectations because it has raving good reviews here and on other sites.",
        "I had a Nikon D50 for many years until I flat wore it out. I bought a new Nikon D3100 which I did not like at all after using the D50 for so many years. I returned the D3100 camera and got my money back, then searched until I found a used D50. Now I am happy again!!!",
        "It did not work. It would not read any current type of memory card.",
        "This camera was purchased for my 18 year old daughter and has been a great asset to her. Its easy to use and takes great pictures. I would highly recommend it. It also came in time for Christmas and was delivered in good shape.",
        "Purchase this item and i am very happy with it thank you John ps i am still in Rome Italy using it!",
        "If you want take pictures like a prof, dont thik about it, buy the Nikon D50 and enjoy the moments....! There is only an observation: you can use the display to focus the objective, of course this allow save battery....",
        "The seller sold me a lemon camera; it stopped working after one use and when I brought it to a repair shop, I was told the aperture mechanism was broken and it would cost more than I paid for the camera to fix it. They told me that it does not break overnight, and I was sold a camera with a loose mechanism that broke after it entered my care. I also purchased a Nikon lens to go with it; I was sent a quantaray lens instead. It's a wonderful camera from what I was able to see but unfortunately I have not been able to use it at all.",
        "IT HAD PINK IN MY PICTURES WHEN I TRIED TO TAKE THEM BUT THEY DID RESOLVE MY ISSSUE ANG GAVE ME MY MONEY BACK"
    ]
}