{
    "entity": "DSLR Cameras",
    "text": [
        "I can't say enough good about this camera. It arrived on time and in perfect condition. In my opinion I got a great deal for what I paid. This D2xs will serve me well for many years to come.",
        "It is literally just the camera body. The hand strap would have been nice to have but for the price I paid I wont complain too much. It is a great back up system for me to use as a second camera or for second shooter when I need two photographers.",
        "Nikon D2xs is like new and works flawlessly! For an older pro body, this unit performs very well! Very happy with purchase.",
        "This camera was a great camera for me. It was my first Nikon camera and I liked it. I moved on to another Nikon camera. And I got a great deal from Amazon.",
        "The camera is fine, but I have to learn quite a bit about the operation of it as I am used to shooting in an auto mode.",
        "The D2Xs is ridiculously strong and will last without issues. You can do anything you want to do, if you learn how to use it. I'll be using mine for the rest of my life. I've had it about 5 years....very tough, very reliable, very sharp if you put a good leans on it. I'm getting sharp 16x24 prints, and could go bigger if I needed.",
        "I know how to get good deals on the D2x and D2xs. I will not sell it. This will soon be my back up camera when I get a D3 or D3x. I had a D60 then D80 and then D2x and now for a year now, the D2xs. D2x and D2xs are about 90% the same. It is a top of the line camera and also the last of the professional DX cameras (maybe for now). You can not go wrong with this investment. You can get a D3 for 4 or 5k so if you are buy a D2x or D2xs above 3k, you are crazy.",
        "I have been a professional photographer for more than 42 years and a photography teacher for 38 years. This is simply, the best camera I have ever owned. This is the first audio focus camera that focuses faster than me, its a bit heavy, but I'm a bit older. Couple this camera with a fast lens, (f1.4D, f1.8D, f2.0D, f2.8D), and if the pictures are not good, then its you. With the new Nikon D3 coming out in November 2007, this camera will be available used as well as new, get one you will not be disappointed. :-)",
        "I've owned the D2x for several years. It is still a great performer, albeit more limited now since the advent of the D300, D700, and D3s (all of which I own also). I will never get rid of my D2x as it is, as I said, a great performer...workhorse build, excellent low iso performance, overall still produces outstanding images. What confuses me though is that Amazon is still selling it new for @$5,800. What's up with that. You can find a pristine copy on ebay for probably under $1,500. That, in my opinion, would be the best bet for anyone interested in this Nikon gem.",
        "I bought this one in gray market. the picture quality is not good as D300. review screen is small.",
        "Why on earth would anyone spend 4k on this when you could spend the SAME 4k and get D3.....which is superior in EVERY way?????? Please tell me? If you have 4k and are in the market for DSL, get the D3."
    ]
}