{
    "entity": "DSLR Cameras",
    "text": [
        "I needed a camera for take some photos and couldn't justify purchasing a brand new model so I went with the A100. Although the megapixels were nearly the same as my cell phone (iphone 11), equipped with a decent lens this camera did the job.",
        "I have many older Minolta lense's which this camera's lens mount accepts my older lense's a prime concern for me.The camera is relatively easy to use,the controls are fairly obvious,and the results can be immidiately reviewed, and erased !,if needed, I enjoy using this camera very much,it was bought to be a backup for the exact same camera should it fail,which it never has,Both cameras have been very relaible,with surprisingly long battery life. I really like this model,Sony has come out with other version's, based on this one, which are slightly better,however,if you have one of these,or want to buy a used one don't hesitate,it is an excellent camera for all around basic photography",
        "I bought this camera because of the fact that it was the old Konica/Minolta Maxxum 5D. I have spent money on Maxxum AF lenses and did not want to throw them away or collect dust. They work fine even the 50mm stock lense that came with the Maxxum 7000 that I started with. I have shot some photos using the old lenses and the new one that came with the camera (18-70mm). I like the camera very much and it fits really nice in my hands. I have not had the chance to really push the limits of the camera but I really don't do that anyway...so the camera fits my needs.",
        "I went from Sony to Cannon and back to Sony again when this camera became available. And worried about it the whole time. BUT, I am so glad I did. Ultimately the anti shake in the camera sold me as the lenses are so much cheaper. I do not notice exceptional noise as I read some folks experiencing. Chalk me up as a very satisfied customer.",
        "This camera provides the acuracy, symplicity and beauty of a film SLR with the conveniance, economy and savy of a digital point and shoot. It easily takes wonderful pictures. I justified the need for a DSLR because of the slow reponse time of the 3 point & shooters that I have tried. The response time of the a100k seems instantanious. And in continious mode at 3 frame per second it seems like I have the motor drive that I wished for back in the film SLR days. I chose the Sony because the compatability with Minolta lenses, but I was amazed by the value and features provided.",
        "It missed the CF card, and the usb cable doesn’t match the camera, so it can not be connected to computer now.",
        "I received my camera and have been using it for a few months now. I am by no way a professional photographer, however I do enjoy taking pictures as a hobby. This camera is so easy, so simple, so wonderful to use I wish I would have bought it before I purchased my other big camera. The pictures turn out remarkable with little to no editing needed. When people give my photo taking skills credit, I always say it's the camera and people that make them what they are. I just look through the view finder and push the button.",
        "Have been using for almost 3 years now and it is a great performer, especially for landscape/nature photography. Anti-shake is wonderful and makes up for the not top of the line iso handling. One other plus is the compatibility with all the minolta gear, including both lenses and flashes.",
        "I was so impressed that this camera was mailed out the same day that I ordered it. I had it within three days, Yeah! It was exactly as described.",
        "I bought this camera used and it arrived in great condition. The photos are wonderful for the price. Just what I was looking for.",
        "Amazing piece of technology. Easy to operate, excellent results, and I am absolutely delighted that I bought this product from Sony. Now I am a lifelong fan!",
        "it was missing the CF card. I had to purchase-- other than that this is a great camera!",
        "I really like this camera. I had started with Nikon in the digital SLRs and then went to Minolta for the anti shake feature in the body. This feature remains in this Sony and the controls are easy to use, but powerful.",
        "A professional photographer friend recomended this camera, after I explained to her what it was I was looking for. It does everything she promised and then some ! Features so advanced and great capabilites for experimenting outside the bounds of regular photography!",
        "I LOVE THIS CAMERA!!! THE PICTURES ARE GREAT, EVEN IN LOW LIGHT. BUY THIS CAMERA YOU WILL NOT BE DISAPPOINTED...",
        "Picture quality is as expected since my new smartphone is more capable than this camera is. The camera itself won't take pictures in certain conditions, such as wind, for some odd reason. It does take stunning close-up shots though. Would only recommend using the camera on the RAW image setting. Overall Pros: Great for close ups, or if you aren't looking for something very expensive Cons: Picture quality is not the best, the camera is very finnicky and stubborn at times, only looks good in RAW setting",
        "An excellent camera and well matched with the 18 to 70mm lens that Sony has made to go with it. Lot's of controls to learn to use, but worth the effort.",
        "Having owned a Nikon F4a snd a Hasselblad C-500, I love this camera! Plenty of options, or program to point-and-shoot option--it's your choice. Excellent photos either way.",
        "Excellent camera. Vivid colors and terrific clarity. High performance in a compact, easy to handle body. It is a serious upgrade for anyone who is interested in moving on from small, compact, point and shoot cameras.",
        "First, let me say I love the camera itself, and I REALLY, REALLY wish it was part of a system that a pro could use. But...SONY has dropped the ball. As of this writing, there is NO sync cord available to use the camera with a Stroboframe, etc. - and, even worse, it uses a proprietary hot shoe that is compatible with pretty much zilch. Sadly, it will remain a limited-use camera for me, or simply be replaced with something that is part of a full system. Too bad.",
        "This camera came as it said. However, I'd like if they'd also include a compact flash adaptor. Just my preference. :/",
        "The camera has lived up to what I expected and was worth the price.",
        "I owned this camera and liked it a lot. The convenience of properly located controls, easy of use, traditional Sony's menus... If you own one of Sony's little cameras and think about stepping into DSLR it is the camera to get as you will find very familiar interface and it will facilitate the transition. You can get this camera with lenses very inexpensively and 10m is more than enough for all my needs. In fact I rarely shoot on 10 as it makes big files and as they accumulate they eat storage of PC. I used this cam any time of the year and never run into any problems. The battery timing is exceptional.",
        "I have a complete suite of Milolta Maxxum I have collected over the years and wanted to move up to quality digital but the cost of upgrading my suite of lenses was daunting. Then Sony buys Minolta photo and improves on it. I LOVE THIS CAMERA. It takes great pictures and uses all of my old minolta lenses without a hiccup or shudder. The Anti shake makes hand holding the camera and still getting perfectly focused and sharp pictures. Amazing...",
        "I've owned this camera for 5 months and highly recommend it. It's being discontinued but if you can buy it cheap get it. The camera replacing it (A200) seems to have sightly better performance at iso1600 but gives up some advanced features like mirror lockup, and the control wheel button method access to several important settings. I've seen it available quite cheap. Grab one if you can.",
        "I bought the camera in Feb. and just charged twice since then. I charged the battery before my 10 days vacation in Europe, and took over 1,000 pictures (very beautiful) and the battery now is still 3/4 full! Another advantage of this camera is the anti-shake function. I could take pictures with very low shutter speed (1-2 seconds) and the pictures are still sharp.",
        "This is definitely the BEST camera!!! The SteadyShot is the feature I am so grateful for! I suffer from familial tremor and had mostly blurred shots from other high-priced digital cameras of the top selling brands. This one feature has enabled me to take crystal clear photos with ease! It is definitely worth the price! I wish I could give it more than 5 stars - it is that good!",
        "Easy to use & takes great pictures, even in low light. In fact, in my experience, pictures come out better in low light (not dark) without the flash. Great price from Amazon. I saved enough on sales tax alone to get an additonal battery. Added bonus for me...my old 300mm Minolta Maxxum lens from 1988 works on this camera. Highly recommended!",
        "This kit was a good deal. I was able to get this kit which included a spare battery and a 2 gb compact flash card, case, tripod (kinda flimsy), and some other little odds and ends, for $130 less then the camera alone costs at Best Buy or Circuit City. I am an amateur at photography, but this camera makes me look like a pro. Takes outstanding pictures!!! Shipping from Ace was very fast. Would recommend them.",
        "The Sony Alpha A100K is the best camera I have ever owned. The images are nothing short of spectacular. The lens mount allows you to use telephoto lenses from other camera's. I have an expensive telephoto lens that was on my old 35mm Minolta and it fit this Sony digital perfectly. You will notice a lot of Minolta features on this Sony since Minolta has left the camera business. The image stabilization feature makes it real hard to mess up a shot. If you are a beginner or a pro, this camera is easy to use for perfect pictures every time.",
        "Takes good pictures, can't spot the difference to the Canon Rebel 400 Xti, which a co-worker got same time. My last SLR was a Nikon 35mm 10 years ago. and have used compact digital cameras since. They are just not comparable. Pros for me: plenty of lenses available second hand. anti-shake in the body, not the lens takes common sony batteries, same as my sony camcorder usb mass storage and pict bridge support Cons for me: sony specific flash fitting usb connection is behind memory door, not behind a rubber cover. non standard power supply required, or put battery in supplied charger. no worldwide warranty option",
        "I have this camera and I really like it. It is my first DSLR and I am impressed by the functionality along with its value. It has many controls right at your fingertips so that you can adjust to your surroundings immediately. The anti-shake is good. It has a full sized CCD so that you can use any Sony or Konico-Minolta lens. The only downside that I see is that it has a Sony specific hot shoe for the flash and sony specific remote trigger. You can only use sony flashes or triggers. Other than that, this is a great value DSLR.",
        "The A100 is discontinued and has been replaced by the A200 / A300. But it's still a solid entry-level camera. At one time you could land one at Best Buy in the $250 range. Definitely don't pay full price for one of these. Check eBay or Craigslist.",
        "I really got to use the camera yesterday and loved the feel. The photos on the CF card were great. The next issue to resolve is software that is compatible with Vista! Sony has not developed a Vista compatible program for downloads and for some reason I cannot see the photos when using the CF drive on our computer. I know there will be a \"workaround\" but wished that Sony would have been prepared. As other reviewers have stated, there are so many features! It will take a while to sort thru them all.",
        "This is my first real digital camera. All I can pompare it with is the many 35mm film SLRs I have owned. First thing I noticed is that the colors are very true. Nice! Many functions are in the menu. Not quite as easy to get to as the old SLRs but many more of them. The camera is well made and I have had no problems. And it has been kind of fun using some of my old long 35mm glass on it. I am glad I bought it.",
        "I love the way it feels in my hand. I looked for weeks for a DSLR nd for the price and what I read this was it. Im thinking of upgrading the body I have 5 lenes and I like the a350 but I am also looking into the 700. But for a starter SLR you can't beat the a100.",
        "Great camera I like the simple that its to operate. This camera met all my expectations. the features in this camera stands besides any other brand of camera.Sony did a good job manufacturing this camera. The option of using minoltas lenses is super also.",
        "I am a hobby level photographer and love this camera. I had a minolta maxxum 7K and many lenses. All of these lenses fit on to this camera. Sony made a great choice when they purchased minolta's photo division. If you have old minolta lenses, even one, I would recommend this camera!",
        "I love the camera. It has a little of everything. The camera is loaded with all the manual controls you could desire. The picture quality is great. I really enjoy using this camera, especially since I don't feel like I have to protect it with my life. At the price I paid, it just can't be beat. That's all folks!",
        "Great camera, no wonder it was named \"Camera of the Year\". Fast, clear and accurate describe the camera and the photos it produces. I have had the camera for a month and it has been all I expected. The super steady feature truly gives two f stops. The kit lens is useful and quite a bargin. I use it more than I thought I would. I truly get the same feel and results that I did with my old Maxxium SLR.",
        "This works great for a spare when shooting lots of pictures charge does not last as long a Sonys but is acceptable considering the price.",
        "About the Sony A100k We'll make this short and sweet. I took 200 pix and tried 80-1600 ISO and somehow I have missed the noise everyone is talking about. I got my camera about 1st of Aug 06. Works very well at 1600 in low light!!!!! With The anti shake I have took pix at 4 and 6 and they came out fine on auto.[picks ISO] Love it Ronnie Lankford",
        "As a keen admirer of sony i`d say if you are planning to purchase a digital slr go for alpha. Definitely a great product with great pics. I have a nikon as well. These two products are way better than the rest. If i`d choose i would go for sony.",
        "I've had experience with other DLSR's but this is the the first one I've owned myself.. and so far it's great.. with a good highspeed C card I can take pics all day on one battery.. I've got it dialed down to 5MPs and the quality is still great.. the availability of other brand accessories is still a little light but I trust the Sony name will soon encorage more companies to develop products for the A100 camera.. the internal image stabiliser is pretty cool but I dont have enough photogrhpy experience to know how good this camera really is.. but overall I like it and that's what counts.",
        "First time purchasing a DSLR. I think it was a great investment. I am only a beginner but the pictures are great quality.",
        "I love my new camera, it's so great. I really like the burst mode on it for taking the kind of pictures u had in mind. It's just an over all great camera for starters like me.",
        "Excellent camera and lens. Terrific value and good service from supplier. Disappointed that there was an additional customs bill of £71! Could you warn customers of this charge, in future. Despite this, at a total cost of £330, it was still a real bargain",
        "After 2 months of use I can find nothing wrong with this camera.I have found the color and the detail of my pictures from this camera matches exactly the picture my mind had formed when I was taking it. As I said in the heading I LOVE IT!",
        "Delivery was quick and easy. Camera takes great pictures. Very happy with this camera and I'm still learning to use the other functions. All in all a worthwhile purchase.",
        "Well I dont think my money got wasted!! Cool one shooting great pictures, auto focus is good. Have a 2 GB card and start shooting memories... Recommended!!!",
        "There was a lot of good information about the camera which told me i could take pictures of things that other camera could not.If one does not look good , delete it change some setting and take it again.Or just take a few shots and chage setting to get it set up for in invierment you are taking pictures in..",
        "Great product with several innovative features. Chose this item over the Canon XTi.",
        "Does what it purports to do. Have not checked out the noise factor, because I shoot only at ISO 100.",
        "This is a super product. Sony has cutting edge technology in this camera I'd buy it again, nuf said. Ray.",
        "I am quite happy with the camera. I see that when taking pictures with white background, the objects come out slightly dark inspite of the flash. May be the built in flash is not bright enough or the white balance is not set right.",
        "I like this camera, which expend my understanding in photography. Easy to handle, perform well.",
        "I have had the Sony DSLR since July 23rd. I took over 700 pix at the WSOP in Las Vegas, and several hundred since. I do have the Sony flash, and the SAL-18200 lens. I was a little leary about going from \"point and shoot\" to DSLR. It took some time to read the manual, study, and practice but I have had many compliments on the pix I have taken and printed. If you want to take the next step up in quality photography, get this camera.",
        "Sony has done it again....the need for a Digital....GET MY FEET WET Camera...the more i looked WOW....Like a beautiful woman....Stands out in the crowd....She has the look Confidents....etc April 5, i ordered: Sony SAL-85mmF14Z 85mm f1.4 Carl Zeiss Planar T Coated Telephoto Lens I Predict this lens will be HOT....LET the Magic Continue...Quimbyproductions since 1960",
        "This is an excellent digital camera. It's 10.2 mega pixel capability give beautiful sharp photos even at large sizes. It has been easy to use too.",
        "Great camera just in time for the hollidays.. Takes great pictures and easy to use.",
        "I have this camera. Only because I had a 35mm Minolta and was able to use the same lenses. I wanted to go digital. The shutter speed on the Sony Alpha is terrible. The range of the flash is horrible. You will need an external flash to compare to the range of an average normal dsl camera, let along you will not have an automatic flash. You will always have to open the flash compartment!",
        "Amazon.com has in what I consider the worst ordering system on the internet. If an order goes astray and if you are able to contact their sales personel you will probably be told that they cannot give you any information and that the item or items will be handled by a secret organization within their company and no one has access to them or their phone number. Think Im kidding, try it. In my opinion this company is in a moronic state and of course run by morons. The camera is very good, and I had to pay more money as a result of their incompetance.",
        "Body is good and light. It is better for the beginner.",
        "This camera has not timelapse recording!!! (Cameras with a time lapse feature can be programmed to automatically shoot a number of frames over a period of time or with a certain time interval between each frame. For instance, a camera on a tripod in time lapse mode could be set up to shoot frames of a flower opening or a bird building a nest.)"
    ]
}