{
    "entity": "DSLR Cameras",
    "text": [
        "I used SLRs 30+ years ago. My Canon (not digital) finally was destroyed from beach pictures. (Sand in casing) I abandoned \"real\" photography in place of digital...camers..iphones...ipads... But i did miss the fun of an SLR. Since this is just hobby stuff for a retired lady, there was no reason to indulge in a thousand dollar set-up. Maybe some day, but not until I see if I stick the course. So thanks for the used SLR. Pentax was the choice of the military photographers whom I knew decades ago. This camera is small enough to travel in a large purse and yet gives so much more control than digital devices. Love my iStuff...but this is also cool.",
        "This camera is performing flawlessly and provides much higher quality results than the Kodak P850 it replaced. The built-in anti-shake was a must have feature, which limits the DSLR field dramatically. I see no reason to buy expensive anti-shake lenses such as Nikon and Canon want you to get. In camera anti-shake is for 99% of users the superior solution. I was concerned about battery life with the AA solution, but using the Sanyo eneloop rechargeables has worked out great. These batteries don't have the high self-discharge rate which is normally associated with NIMH batteries, so you can leave the camera sitting for a few weeks and still be ready to go.",
        "Great camera base, works with a lot of my old K lenses (make sure the older lenses have the electronic dots on the inside ring and they will work in this) . Good price for this, wanted a K100D for a few years now. I am a huge Pentax fan been shooting with Pentax film cams for years, Love how I can use older lenses and shoot close to film style with this. The instruction book is like reading the first few chapters of war and Peace. This actually came new in a sealed box for me. Was surprised being a warehouse deal and all.",
        "This is a wonderful camera. I have the 35mm ME Super with a selection of additional lenses. The best feature for me is the backwards compatibility for all of my lenses. They work perfectly except for the fact they are not auot-focus. Not what I wanted anyway. I moved up from a Kodak point and shoot. The end result ...an excellent level of picture quality the Kodak will never attain. The features are comparable to that of Nikon and Canon at a fraction of the cost. I don't see the need to pay for those names. I use the diffence in cost to help me justify buying another lense.",
        "This was my my first DLSR. Pentax made the transition clean and effortless with the K100D. It has enough auto features and modes to make things easy for one coming from P&S's plus all the Control an exerienced Photgrapher could want. All this and it can take ANY K mount lens and work in Manual mode with any of them plus it can work fully auto with the AF ones. The 18-55mm kit lens was a big surprise, lotta quality for very little cash!",
        "This camera has lasted so many years and taken so many beautiful pictures. It's easy to use and sturdy and even now, 7 years later, it still works perfectly.",
        "For new users, this camera is a great start for those who want to get into photography.",
        "6mp is small by todays standard but for those looking to get into a DSLR on the cheap I think this camera used is one of the best values out there. Plus it's compatible with existing Pentax lenses.",
        "THIS IS A BASIC SLR DIGITAL CAMERA THAT IS VERY GOOD QUALITY. IT WILL SERVE ME WELL FOR WHAT I WANT TO DO.",
        "Had some dead pixels. I should have tested it and sent it back right away.",
        "Worth every penny. Outdoor results are outstanding. Indoor results are very good. Use the rebate and purchase the 50-200MM lens at the same time, making the extra lens basically free. You will not be disappointed with this camera. It is extremely user friendly.",
        "Very pleased with camera and seller. Would recommend both. Jim The requirement for a headline and minimum count on words seems a little over done for a quick report on how happy we are. Suggest just a lithe easing of requirements.",
        "Excelent option, great photos, easy to use, the shake reduction really help. I used it with my old Pentax lenses and they work fine.",
        "Nice camera and produces some great pics. Also I just bought a telephoto to go with it. Its a keeper.",
        "I've had it a few weeks and it is doing well. I bought 2 inexpensive Tamron lenses that provide great pictures. I wanted a low cost dSLR that would be a step up from my P&S Cannon SD1000. The Pentax works as I expected for this purpose.",
        "Actually this is not a good camera for anyone. It takes bad photos even with good lenses. I guess the matrix is just hopelessly old fashioned and not sensitive to color, values or detail. Under certain conditions (good lighting) can be used to photograph art work.",
        "Wow - picked this up about a month ago, and have nothing but good things to say: Pictures - As advertised, takes great pictures off the shelf with the lens supplied with this kit. Plenty of control if you want it, but a great \"automatic\" mode, too, when you just want to shoot. Lens - I'm no pro, but this lens works fine. There's next to no distortion at the corners like i'm used to with my point-and-shoot. Durability - Surprisingly tough. Mine took a dive onto pavement while I was shooting at the Hartford Marathon, and kept working like a champ.",
        "Did a lot of research and I feel this camera is the best value for an entry level DSLR. Keep in mind that you most likely will have to spent an additional $[...] for a memory card and rechargable batteries. My only complaint is that the shutter seems to be very loud. As well, I have a problem when using the menu and Fn features that the LCD screen displays will just go dark before I'm finished with changing the features. I've emailed Pentax to see if this is a common problem. Overall, very happy with this camera.",
        "My first camera was a Pentax K 1000- manual and unbreakable. Pentax tried to recreate that camera with this one and the did wonders. Superb camera, with great speed and utilizes all pentax lences. They could have done a bit better of a job with the sound insulation- it sounds a bit plastic wheen you take a picture (if you compare it to a Nikon 200) but the price is very attractive and all in all a great package that it earns a five star rating",
        "I received my Pentax today, and so far it's been very easy to use. The shake reduction feature works great. The camera doesn't come with a SD memory card though, so be sure to order one! That was fine with me since the small storage on the SD cards that come with most new cameras is not enough. Luckily I ordered a 2 GB SD card with the camera. It's built very well; very high quality. The K100D should be at the top of your list if you're looking to get into the DSLR world.",
        "This is my third Pentax SLR. The first was stolen, the second was 35mm and thus now obsolete. As a backpacker and hammer-handed klutz, I am hard on cameras. I have dropped all three of my Pentax cameras with no harm whatsoever. Most recently, I dropped this K100D onto an asphalt road, lens first. I cracked the lens shade, but the camera works fine.",
        "The Amazon price is steep for this camera that is two generations old, but if you can find on Ebay or somewhere else at a lower price, this is a great buy. I use it as a backup to my K10D. It is a simple dSLR to use, and the shake reduction is an awesome feature since few other entry level dSLRs have it. With the shake reduction built in, your investment in lenses is going to be less since it works with all K-mount lenses.",
        "i really love this camera, had it for over a year now and it's still going. AA batteries are great for convenience. if i were to buy it again i'd probably opt for the slightly cheaper (at the time) k110 without the \"stabilization\" feature. i keep the \"stabilization\" on when i'm shooting but i wouldn't say it makes much of a difference. also i recommend not buying the default lens with the camera, i went with a sigma 28-300 and it was a great compromise for wide angle and telephoto.",
        "Got this camera for myself for my birthday... sad I know... but what a great camera it is. It shipped with a 18mm-55mm lens which is ample for taking great photos out of the box. I recommend rechargable batteries. I bought 8 so I always have a set - takes 4 AAs. It has a very good image stablization feature you can turn on and off easily. The Auto Focus is fast and the variety of shooting modes means you can get just about any photo, quickly, once you learn how to work with them. This camera is a great value and provides all the functionality needed to take excellent photographs.",
        "Having grown up using Pentax SLR Cameras and Lenses I was very intrigued by the K100D and the ability to reuse some of my K mount lenses. I am extremely impressed so far with image quality, the built-in flash (no red eye problems so far) and the almost instantaneous shutter of the camera. Having been oppressed for so long by the compact digital cameras I have reinvigorated my love of photography and can't wait to explore the many features of the K100D. The auto-focus has been very good so far with just one occasion where it didn't seem to adjust properly, but that also could have been operator error.",
        "Bombproof construction, takes rechargeable AA's, compatible with a bazillion K-mount and M42 screw mount lenses made over the years. The optical quality of Pentax's lenses is legendary, and they are plentiful and inexpensive on the used market. I mostly use my K100D with a 40-year-old Super-Takumar 50mm f/1.4 screw mount lens, and the lens' optical quality and build quality blow away just about any modern lens...best of all they run about $[...]. I'd like to see you do that with a Canon or Nikon DSLR.",
        "I have had this camera for 6 months now and love it! It takes great shots and is easy to use. I love the compatibility with old lenses and the shake reduction built into the body. Ultimately, that gives you the chance to upgrade lenses - the most important part in a camera! The two limitations I've found with it are: 1) indoors, the white balance does require some adjustment and 2) the buffer size is limited -- you can't take a huge succession of shots. The former was pretty easy to get used to (you use the custom white balance adjustments.) The latter isn't important to me.",
        "Finally a semi-affordable digital slr. One that I can use all of my Lenses and filters which have been sitting in storage. I find it easy to use, easy to change between auto and manual focus, the photos look great (I am picky about this) and so far have had no problems. My main complaint was that it did not come with a memory card. (nothing is more frustrating than having a new toy you can't try out because one of the main pieces is not included) The description and packaging should mention this so that an appropriate card can be ordered with the product. Fortunately I had one that would fit from my pda.",
        "This camera has an awesome image stabilization feature, and I have been very impressed by most of the features; good color fidelity, great in low light etc. And it's cheap. However, recently the camera stopped recognizing the battery. Sent it to Pentax who can repair it (new circuit board) for $250, which in my view is not worth it. Things happen to technology, but I'm wondering if this is a weakness with the brand as I have never experienced such a glitch.",
        "LIKES,,,Great camera, it takes great pictures even in low light without the flash, the auto focus takes a bit of getting us too,,if you move after viewing a subject a little bit it wants to refocus.DISLIKES,,The only thing that I found that I didn't like was the camera had a hard time focusing on things skyward,,I think because of clouds being in view along with the subject, the camera has a hard time trying to figure out what you are taking a picture of,,,maual focus took care of that.",
        "Hands down, the best dSLR your going to find for the money! Anti-Shake feature is a life-saver when not using the flash indoors. Image quality is stunning and far superior than that of equal or higher priced P&S cameras. Look no further for a starter dSLR.",
        "I am surprised more people are not dealing with battery issues. I bought the camera and contacted customer service at Pentax because it would only take one or two pictures before killing standard AA batteries, and NiMh rechargables that I had didn't work at all. I was told NiMh rechargables have to be at least 2300 mAh or higher to work. I purchased some and a charger (less than $20) and the camera now works fine. It's a good camera, but be sure you have the right batteries from the start.",
        "I wanted a digital SLR because the marginal cost of \"film\" is zero. An SLR has the advantage of WYSIWYG, in other words, you can see that the best focus is on the subject of your picture and not something else. I also have an old Pentax 35mm camera and a complement of lenses and polarizing filters and so forth, and I liked the compatibility with those items. It takes good pictures, the colors are accurate and it has a sensitivity up to ISO 3200. I am not anyway an expert or even competent photographer, but it's a good choice if you want to reuse Pentax lenses and not spend a fortune.",
        "I got the camera via Fedex within five working days after ordering. The camera and lens were factory fresh with a US warranty. I'm still trying to learn all of the features since this is my first digital SLR, but so far, it's taken good pictures. I would order from this company again.",
        "I am in love with this camera. The shutterspeed is awesome, the quality of pictures is awesome, and the shake reduction feature is awesome!! I would recommend this camera to anyone looking for a great camera!!",
        "Easy to use. Very sharp pictures. Nice feel to the camera. Quality construction, nothing cheap in the way it is made. Excellent quality for a great price!",
        "I bought it because of the price but had to return it. pros: price is cheap(paid $279) cons: battery life. most NH batteries won't power it. very hard to use manual lens",
        "I am disappointed with this camera, but most of it is my fault for not adequately researching it. First, the 18-55 lens is not a good choice. One should have some wide angle (the 18) for indoor close shots. However, having no telephoto (the 55) borders on stupid. I understood that I could use my older Pentax lens, a 35-70 and a 50-200, but I did not understand that they would not work with the auto focus feature. I most likely will have to buy a 18-200 auto focus Tamron lens to be satisfied with my needs, because Pentax does not have an equivalent. I think the camera, itself, is o.k. llb"
    ]
}