{
    "entity": "DSLR Cameras",
    "text": [
        "Good camera...I noticed over time the lens has some spots that show up on the pictures.. Looks to me to be inside the lens. I have clients who have sent me photos and I noticed similar spots on their images. Should replace. I had issues with the flash not popping up, just click,click sounds - after a good cleaning it seems to fix. Camera body has a good feel. Battery last long - but I also purchased a second battery. This camera is almost 10 years old now. Still produces great picture.",
        "This is my 5th digital camera. Previously had used my trust EOS-1N and just accepted that my pictures were going to be a lot worse and (because of > 1 second latencies) never in the thick of the action. The 20D is my first digital camera experience that brings me back to the EOS-1N experience. Wonderful. Latency is subsecond and enough to catch my kids in full unposed action and the photographs are looking good again. As this is an SLR I had to give up my habit of using the LCD to frame the shot. Also realized that this camera does not take video (another newer habit from the other digital cameras).",
        "I feel like Peter Parker of the daily bugle or Jimmy Olsen of the daily planet, the camera is awesome the algorithms in the controls are very advanced technology, it is worth ten times more than what I paid for it. I have a shutter remote and I am ready to take pictures.",
        "Camera was in great shape. Use it for photos ...",
        "Amazing photos!! We went to an island in Brazil for vacation and I wanted to take nice shots. This camera did the job, it is pretty great. You can't go wrong with a Cannon, from Japan at a price tag under 300.00! Awesomeness!!",
        "Love using this camera. Ease of use allows photographer to spend more time actually creating the photo than fiddling with menus and buttons. Low noise performance is above average for my usage ISO1600 is useable. Things I would have liked to see are permanent ISO display in viewfinder, Antireflective LCD, extended EC settings(+-5) and being able to chose focus point when using \"basic zone\".",
        "I've shot Canon exclusively for years. This camera does everything I need without all the bells and whistles. Dependable and durable. I finally had to retire one a few months ago after 6 years of almost exclusively shooting on the beach. IE weddings, family portraits and models. I would highly recommend this camera to anyone wants a high quality image, and a camera that lasts a very long time.",
        "What an awesome camera! I would classify myself as a novice photographer, with the heart and vision of a pro! With the help of this Canon 20D I was able to make what I pictured in my mind and saw with my eyes, really come to life. If you are looking for an easy to comprehend DSLR with the capabilities of the pros, then look no further. This camera has everything you need!",
        "I've had 4 digital cameras,after 15 years of amateur film photography. This is my first DSLR (4th digicam, 2 SLR). I bought this camera about 4 months from amazon. It is a certainly remarkable camera. Be warned though: the quality of the images this camera takes depend highly on which lenses you use, so if you want crystal clear, sharp, contrasty images, be prepared to spend mucho cash on good lenses.",
        "Great camera, shoots great surfing photos with the fast motor drive. We love Canon cameras!",
        "Already I fall in love with new my hobby camera digital! Serious!",
        "I bought this camera my tool for learning about digital photography. It has been very easy to use and a great learning tool. As with any camera, the lens makes a big difference in the photographs you take. The lens this comes with is okay for a generic starter, but you will quickly want to invest in a more high-end one based upon the type of photography you want to do. It is compatiable with the older Canon lenses, so that has been a plus.",
        "I received this camera a few weeks ago. Since then, I have taken a hundreds of shots and it's by far the best camera I have ever owned. The shots are crisp and clean and the flash works great even though I have not purchased an external flash yet. The speed of the shutter amazes me along with a beautiful captured shot. There are many accessories available, though not inexpensive, well worth the price. Price-wise: A lot of camera for a little price.",
        "Very solid camera. I've had it for 8 years and it still takes outstanding pictures.",
        "I received two batteries with this camera. One is okay, and the other dies within a half hour, even if it's charging for days before I use it. Also, the cord port to plug the camera into a laptop to get the pictures on it, is broken. We've tried four laptops with my camera, and none will work. Although the camera is good and I'm overall happy with it, VERY disappointed about the battery and the port. Looks like I'll have to spend MORE money on a CF card slot that plugs into my laptop.",
        "I like this body and this lens even though it is not the latest tech. It has just the right weight and feel and seems like it is less fragile than other cameras. The rapid shooting feature is what I was looking for most. I try to catch birds flying overhead and with my old camera, the auto-focus was not up to it. If this gets it done then next I'll need a better lens. This lens is good for general purpose shooting and even not too bad on closeups of flowers. Getting the ret hot lava coming out of Fuego is going to be a challenge. It is a challenge for any camera.",
        "The camera arrived witin the time period estimated by the shipper and unpacked for inspection. The canon EOS 20D is a great camera with only one flaw. The switch the turns the camera on is in a awkward place. All the other controls are placed very well and operate all the camera functions easily.",
        "Another good camera by Canon, has so many features it would be hard to give all the details here. Recommended to all.",
        "This is the best camera I've tested. Of course this is NOT the cheapest camera, but if you really love photography this is the product for you !",
        "Because I ordered a canon 20 d and I get a canon rebel xl wtf but I needed a camera asap so oh well just keeping it and bought battery for the Canon 20 d and now I got battery's that don't fit my camera",
        "We purchased the Canon 20D and it broke after only 4 months. The pictures were great. The camera just stopped working one day for no apparent reason (no power). We sent it to Canon and they want $800 to repair it. We actually bought another Canon as a backup and it broke also (the lense mechanism jammed). So not only are both Canon's broken for different reasons, Canon is very uncooperative about fixing them. Canon's warranty is not very good. End result: We are missing pictures of our just born baby girl, and Canon is requesting $800. So we're doubly penalized, despite having a backup plan.",
        "This is perfect for someone wanting to step up from a point and shoot on a budget. This camera will do pretty much everything that the newer ones that cost 5 times as much can do. I wish the preview screen was a little bit bigger, but that's a very minor complaint. The kit lens somewhat limits you in certain situations, but it's a great starting point. Since it's so cheap to get this body and lens, you'll easily be able to save up and get more lenses. I'm sure I'll get something newer eventually, but I hope to keep this as a backup for years!",
        "Two years ago when I bought the 20D body, Nikon couldn't come close to its specs. It truly is an excellent camera: ultra fast & feature packed. I have a few of the better zoom \"L\" series lens but no prime lens yet: thus, I really can't tell how good this camera and lens combo can really get. But for the zooms I have (about $2000 worth), just don't seem to equal the pictures of my older Nikons. That aside, because of the blazing speed of the 20D camera, I got pics that I could have never gotten with what Nikon had to offer at the time. Therefore, I love this camera.",
        "Impressive feature list wih affordable price, for the serious ameteur. i've been using the 20D with 18-55, 50mm 1.8, 35-80, 80-200 and 500/1000mm lenses. i am not disappointed. i am planning to upgrade to the L series lenses but slowly. i do not mean to be over entusiastic about canon, but i am yet to see a Nikon camera with the same specs at the same or ever a near equal price. i've got the FM10 for film photography. i love both my cameras. Impressive features include: Mirror lockup ISO 3200 with noise reduction 18 custom functions accepts the entire series of canon lens. heavy metal body (no cheap plastic feel)",
        "Even with all the new cameras out there in the market, I still love my Canon EOS 20D. Unless I accidentally drop it and break it, it is still the camera of choice for me. But if you are buying one for the first time, shop around, there are some nicer cameras, for less than what I paid for this one, that work just a good if not better.",
        "This is how an SLR should feel--solid and sturdy without being overbearingly heavy and clumsy. It fits naturually into your hands and feels balanced with a range of lenses attached. The autofocus on this camera is unbelievably fast and accurate. It has become a favorite of photojournalists, and it's easy to see why.",
        "This camera has many benefits that just blow the competition away and makes it a great \"prosumer\" digital camera. The 8 megapixel resolution allows for pictures to be printed up to 11 x 14 at 300 dpi (larger if you use 72 dpi). And the boot up time is almost instanteous! Unfortunately it does pain me to mention that the camera does lack true spot metering and also it has a rather loud mirror slap (not something I would like to use in quiet settings). The lens bundled with it is quite adaquate, but I would seriously urge you to consider the 17-85mm EFS IS lens for a larger degree of flexibility.",
        "Basically the 2 biggest SLR manufacturers in this category are Nikon and Canon. While both are great cameras, I ultimately chose the Canon because of the a wider array of lenses. I found that reading camera reviews on Amazon were not as useful looking at sites that were dedicated to digital photography.",
        "This camera is excellent....bottom line. Even though the 30D is out I do not need to bother only due to the fact that Canon makes such dependable SLRs. I have impressed myself and my friends with the pictures the Canon 20D has allowed me to take.",
        "I have been shooting for many years and have purchased many cameras from 35mm to digital. This Canon 20d is the Best yet. I have played around with it and still have yet to experience all of the features and capabilities. I shot a wedding and was truly surprised at the outcome of those photos. I have way too many great shots to pick from, for my clients. I shot a self portrait with it and it was so much detail you can see the hairs coming out of the pores on my face. This is a great camera and I recommend it to anyone who wants true professional looking photos.",
        "I could notice the better quality immediately when I started using it. It allows for much more creativity than my previous camera, a Nikon Coolpix 5000. It is relatively easy to use and still fully automatic for those times you need to snap a quick picture and don't want to worry about exposure and all that. I have a canon eos 35mm and I found the digital SLR to handle much the same. It is a tad heavy which makes it difficult to take night shots without a tripod, but I still think it was the best option for the money. I find it to be a great learning tool for experimenting with the more creative aspects of photography.",
        "Well there is so much written about the 20D who could add to that? I will say that the battery life is truely amazing! The only real big drawback I have found to the camera is the Battery compartment door.... The catch is to flimsy for my taste. I somehow managed to break the tiny (and I mean tiny) catch on the compartment door. I still dont know how it broke since I have babied this thing since I bought it three months ago but alas it broke. Anyway Cannon would not replace the derned thing under warranty so there goes $15 for a new door with catch. Besides that this is a awesome camera.",
        "My first 20d had a problem with flash exposure in auto mode. I returned camera and the replacement worked fine in auto mode. (with flash) Good for that quick picture, and helps out greatly while I'm learning all the many features. The lens for me was great for that extra $100. Later I can get the 17 to 85. Also I must add, after learning how to use the built in flash, it does everything I want it to. Very happy with my purchase.",
        "This is my first DSLR, and it's doing everything I need and then some. Solid build, great grip. I bought it used from a friend who's been a photog for many years. It's served him well for over 2.5 years; the stuff he's take on it is simply amazing. Solid camera!",
        "I received this for Christmas, 2005. It takes excellent pictures. It is pricey, but well worth it. I am very impressed, with the quality of the photos and the quality of the camera. You do not have to wait between pictures, it can take multiply picture at a time. I have several Sony digital cameras and 2 Minolta film cameras and this is the best of the lot.",
        "I've had this camera for a few years now and love it. Hawaii, Thailand, Alaska, and all over the US- this camera has done a great job. I am not careful with my equipment (no lens caps, no camera bags, etc) and it still does a great job. Enjoy, Chris [...]",
        "Great camera. If you don't have the money to get a 5D, go for this one.",
        "My kids are in competitive Tae Kwon Do. I have now used the camera my wife gave me one year ago at several tournaments. It is able to stop action and take great shots even in low lighting. Now, we tried it when we went skiing and it also worked great in the glare conditions of the snow. I bought a monopod that worked real well to stabalize and I use software called PhotoFinale to crop and share the photos. One year into the usage I am still looking forward to each chance I get to play with this \"toy\". Next options: battery grip, flash diffuser, extra remote flash...",
        "Excellent camera, but STAY AWAY from Adorama. Terrible customer service, rude, and completely disorganized. Use another vendor and you'll be very happy with this camera!",
        "Love everything about this camera. Have had it for a few years and its durability and reliability stands the test. Newer models such as the 40D feel great and have larger viewing screens. My next upgrade will be to a 5D.",
        "I purchased this camera after using the EOS 10D and was very pleased with the price and value for money, it was shipped promptly as advised by Amazon. I have used the camera professionaly and it has met or exceeded my needs and expectations on all occassions. [...] It can be very easy to use in the fully automatic mode, and my son uses same to take pictures also, with great results. I would recommend this camera without reservation, well done Canon.",
        "This camera is a dream come true. It has a fairly thorough user manual that comes with it--thorough for being a free user manual anyway. You can do everything manually, but it also has a pretty sufficient all-automatic function. It is well worth the clams.",
        "For what ever reason Canon doesn't have a way to change the file prefix - and worse it is the same as some of their other cameras - so it is quite possible to overwrite pictures with the same name! A sane file name would allow the user to put a prefix - like ones initials and then add date and GMT time when the file is moved off of the FAT files system ie (kps20060201-175317 for Feb 1st 5:53Pm + 17seconds)",
        "Excellent Camera although a little dated now. If you are in the market for a Digital SLR Camera. Consider upgrading to the Canon EOS 40D.",
        "This is a great and easy camera, I take many action photos, like surfing and the results are amazing.",
        "The camera is everything I expected it to be and more. Give me a year or so and I may be up to speed on all of it. Everything has been splendid.",
        "This is great. I was surprised no lens caps or that I needed software to download pics. This would have been more helpful.",
        "Very nice camera, after a few days of shooting and reading the manual a couple times you'll feel comfortable with the layout and use of the buttons. This is my first digital SLR I have a couple 35mm SLR's. I am very pleased with quality of the camera and photos",
        "Excellent Camera with high end capabilities. Easy to use and intuitive system controls.",
        "This is the greatest camera. The pictures are unbelievably awesome. The flexibility is unparalleled. Words escape me. I used to shoot with a Powershot G2, and had a lot of fun, took a lot of great pictures. However, with this new camera, I simply can't put it down. I look for excuses to use it. I'm totally addicted.",
        "I ordered the camera from Beach Camera. My package was sent no signature required. They set my new 20d on the porch and left. What would have happened if my neighbor had not been the one to pick it up!!!!!!",
        "I can't believe they still don't have support for 64 bit operational systems. I can't use my EOS20D with any of the newer computers that have Vista 64 or Windows 7, and it is been years since they came out. Terrrible support.",
        "This camera has an extremely good quality, and it's so easy to use, that it's so much fun to \"play\" with.",
        "Best deal about the camera, go and buy Canon EOS 20D 8.2MP Digital SLR Camera with EF-S 18-55mm f/3.5-5.6 Lens. You can add flash memory to increase its memory and can record a good amount of video clips as well.",
        "Personally I don't have this camera, but I know the 20D succesor might be announced at the annual PMA in February 20 or so, and that's when Canon will make their announcement with their new lineup of Digital SLR and lens. So I would wait if I were you for this camera's succesor, and there's a good chance it's due out!",
        "I've used several digital point and clicks... I've also use an Olympus C5050. I've been wanting to upgrade to a Digital SLR and believed the great reviews. I've been terribly disappointed with the pictures... all seem far to dark and dull. Doesn't seem to mater which lens or what type of lighting. I'm checking with Canon to see if maybe there is a problem with the camera... if not, I would say this is an awful investment. If you have time to work in the advanced modes, maybe you can find a setting that takes clear, crisp picture; but if you are using in any of the basic modes, you have no control over the results."
    ]
}