{
    "entity": "DSLR Cameras",
    "text": [
        "This review is not about the model, this review is about the seller....Th product is great...now this particular item I bought failed, because the description of the item did not match the actual item. The strap is did not come with the item. The camera is NOT the one in the photo, in fact I call it false advertisement! The item is in bad condition, it works, but the settings indicator is missing, and the side cover is missing too. Do not buy from this seller. eBay has better etics and reputation because they force sellers to accurately describe each item.",
        "Bought this for my 13 year old grand daughter to learn photography. She is delighted with it. I felt this would be a good starting point to learn photography with out spending a lot of money. The manual is on line at Canon and so is the editing software for free that works with Windows 10.. The camera was clean and free of dust as well as the kit lenses. Everything operates as it should. Everything came that was in the description. It takes a really nice picture. With addition of a few other used canon lenses useful for a beginner, she has a nice gear set that she can grow with. Lot less expensive than a new game system.",
        "I bought this camera for my daughter as her first DSLR camera. She loves it! I added a thrift-store-purchased lens and she was ready to rock and roll for less than $70! It takes great pictures and works very well. It is easy to use and the manual was very easy to locate online. There are a variety of settings that make this a great starter camera for any future photographer.",
        "Inexpensive High Quality DSLR. Takes incredible shots, and is fully adjustable.",
        "Better than expected it's like a new camera, comes with everything you need. I'm so excited",
        "I just unboxed this camera which I bought used from a seller on Amazon. The camera was as described and I appreciated the fact that the seller included an extra battery and memory card so that I did not have to pick them up separately. I am a beginner, so I may come back on here later for an updated review, but it seems pretty good so far. Note that I did buy this used, but this particular seller described the camera perfectly and I did not notice any wear/tear, no scratches, etc. on the camera - looked new. Updated: Took the camera out today to see how it does so I could add some pics to this review.",
        "Wanted a replacement for my pocket camera, this worked out great, and you can add a lot of things to it. I bought a remote switch and a additional lens for it after I had it for a few months. Now a telephoto lenses is the next item....sure would like to have a Wi-Fi connection though, using the interface cable is a bummer. Make sure you have the right settings when you install the software though....",
        "I purchase this camera for my sister, it came in a regular white box not original box also it never states in the item description that this item is USED or REFURVISHED ... which it was clear that it was I am returning because camera is of course used it even came dirty and it did not come with the extra items it stated by the pictures or description.. It only came with 2 batteries and 2 battery chargers (which no where in the description says that it comes with 2 batteries and 2 battery chargers) also only had 1 USB cable and a cover for the lens that was it. very disappointed in the items received",
        "Receive the camera about 3 days early.The camera appears to be in good condition and all the parts came in the box. I will need to download the manual for this model. Time will tell how good a deal I got!",
        "I am really satisfy with the purchase. The price was on line with the quality of the product I receive. The delivery was on point. The product is exactly like was Shown In the description and pictures",
        "This camera is perfect! Yes, this is my first serious camera, so it took me a few tries - and a good number of YouTube tutorials - to get the hang of it, but once you learn, you'll never go back! The camera is so versatile, I purchased multiple lenses for it, and the pictures always come out beautiful! If you're not a photographer, there is an automatic mode you can set on it, and just point and shoot. I'm very, very pleased with this!",
        "I needed an inexpensive camera to use for listing homes. I have been a Buyer's Agent for 17 years and have not done much with listings. This camera works very nicely for what I need and was not a huge investment. I have since this purchase added a flash and am going to get a wider lens soon. I had many questions for the company prior to my order and since and they have been very helpful with quick responses. The qualify of the photos is very good and the camera is easy to use. That's a plus for me since I'm not very good with stuff like this.",
        "Horrible. Does not like anything like photos. I understand refurbished, but I would have hoped that meant the pins and actual casing for the SD card would be there. For 10 months have tried to reach seller. So basically I bought a lens. If you can't put a memory card in it it's useless. And no it's not user error.",
        "Could not ask for a better camera at this price. It is like new and takes fantastic photos. I received everything the seller promised. I will visit this seller again in the future.",
        "Says it comes with a charger. It did not. I can't even tell if it works because it won't turn on. Mayve the battery is dead, maybe I was sold a lemon. No connection cables, no book. Beat up and dirty camera.",
        "My granddaughter needed this camera for photography. She has been learning about it and how to use it properly in her class and is enjoying all the features. This camera was highly recommended by her teacher.",
        "Has been a great camera for beginning photography, but have had a few issues with focus, the flash and a constant busy signal. Will have to take it in to hopefully be repaired once I can afford it,",
        "We had hopes but the camera is extremely Defective. The Battery is just about shot and only holds a charge for 2 Minutes. The Sync to Computer portal is defective as every computer we synced did not recognize the camera there we could not get the images out of the flash Card resulting in more steps like taking the flash card to staples to retrieve images the process has been an epic fail and we still need a Camera for sure",
        "I bought this camera a couple years ago and it is amazing. I'm impressed with every photo taken, the quality is amazing. And it's pretty much idiot proof on using it. I'm by no means a professional photographer and I barely do photos as a hobby. Yet the camera isn't so complicated that an extreme amature is able to figure it out. On another note my sister who is a professional photographer started out with the same camera for her hobby photos and she still owns this camera to this day and uses it often.",
        "Clear pictures, was able to use lenses from an older film style Rebel, so that was great~! Love being able to delete what I don't care for or what did not capture what i hoped for in the shot, rather than developing film and paying a fair amount of money for disappointments.",
        "For the most part a good camera but have had to take it to camera repair 3 times for issues relating to download to computer .Rather frustrating",
        "As expected due to age of item. Good replacement for my second camera. Nice one to teach a youngster with.",
        "No manual and camera does not have picture in view finder ability for taking pictures",
        "... with the constant advances in technology, however, the latest camera you buy will tend to be the best ever. This is one great camera for the price. i tried the Nikon D50, Olympus E500, Pentax *ist, and went for the Rebel XT. They all had features that I liked but the Canon stood above the rest. If you like shooting in available light, Canon is head and shoulders above the competition. The speed of the camera is very impressive as well. I'm not going to get into all the specs of the camera since they have already been covered. You can't go wrong with the Rebel XT.",
        "Great camera! Product as advertised and delivered ahead of schedule! We trust this seller!",
        "The product I recieved wasn't what was on the website. I recieved a torn equipment bag, the camera is scratched and I was supposed to receive cd to store the pictures, I didn't get that either. My daughter was very upset and disappointed.",
        "I am an amateur photographer so my opinion is not based on more technical aspects. This camera is so great compared to my non slr digital camera. I have a one year old child who is never still. This camera allows me to catch those moments that the other digital would miss. It's so easy to use. The automatic mode has captured some pretty amazing photos. There are creative modes that allow me to choose how much control I want - great for a beginner like me. It's so much lighter than the other digital slr cameras that I was considering. I can take it everywhere without much trouble. I highly recommend it!",
        "This was purchased as a gift to my daughter who is taking photography in college. Very good product exactly as described.",
        "It is the Older Model but to me that doesn't make any difference . It is like it is Brand New and not a Blemish on it . It is a Little Heavy but to me that's a sign of Quality and that's important to me . I am very well Pleased and it will last me for a Long time. Money well Spent. Merle",
        "Review in April 2006 I upgraded from Powershot G2 and very happy with the results. This is my first SLR camera so I have a lot to learn on using different features this camera offers but the so far the family pictures taken indoors are excellent. I can see a big difference in quality over G2. I read a lot of user reviews about this camera and I chose not to get the kit lens as suggested by many reviews at various sites. I got 50MM and 28-135 IS lenses to go with it and planning to get a 100-300 IS in the future to complete the set. Very Happy!",
        "It worked only two times before it gave an error reading and no longer will function.",
        "I really LOVE this camera, even though this is my first dslr camera that I have owned. I have been searching for a long time trying to find a camera that would work for me and one that wouldn't break the bank as I am an unemployed graphic design student that needs high res. photos for my portfolio work. I have two hybrids that have great zooms but they do not have the snap speed for taking photos as this Canon does.I had my eyes set on a Nikon, but somehow I came back to Canon!!",
        "Both of our previous digital cameras (not SLRs) had a delay when taking pictures. This camera is the opposite of that. It takes pictures so fast that we no longer lose that special moment when trying to take a picture. The picture quality is superb and transferring images from the camera to our Mac is a mindless and fast operation. We're not great photographers, but this camera helps us make up for it. It's incredibly easy to use and the auto-focus works perfectly. The battery life is excellent too.",
        "They did not send the complete order it was missing memory card,USB cord,and directions on CD so we can't even use the camera false advertisement they didn't even clean the camera it has white blotches of what looks like paint on it",
        "This is my first DSLR, but not my first SLR. I've owned the Prowershot Pro70 and the G3, and the Rebel XT is a great value in the DSLR range of products. The basic lens that comes in the kit is adequate and will suit most beginners, but I suggest getting the body and spending some extra money on a decent lens for those who are familiar with SLR's. Great camera, and I'm sure it will last me for a couple of years while I brush up on my photography skills.",
        "I'm a complete amateur, but I love this camera. It's relatively easy to use and the manual is WAY easier to understand than the one that came with my Powershot S2IS. The only problem I have with it--which I admit could be owner malfunction--is the battery life. It says that it uses relatively little power when the camera goes to sleep but it seems like my battery drains super fast. I use it for 10-15 minutes and then turn it off. I can do that 2-4 times before the battery shows that it's almost gone. Am I doing something wrong? I'm ready to get a spare battery, but I'd love to know if there's a way to conserve battery power.",
        "I've had this for quite some time so this review is overdue but well-considered. Canon products aren't what the once were. The auto-focus struggles with alarming frequency. The display is minute and of poor resolution. The manual adjustments are somewhat non-intuitive. The build quality is a bit weak and questionably arranged. All things considered (after several years' consideration), I should have gotten the comparable Nikon.",
        "I must admit, I was sceptical about my purchase and a little afraid the cannon camera would be in bad condition. Suprisingly the camera works great, I'm really happy with my purchase.",
        "Fantastic. I bought this for my wife and she loves it. The seller was speedy and took extra care with the packaging. Thanks.",
        "My Rebel XT was stolen in December, and I've upgraded to the Canon 5D. But I purchased another XT to replace my wife's camera, which was a Canon 570. For the difference in price (about $200) the XT is vastly superior, and my wife is delighted with its performance and picture quality. Canon has reduced the construction quality somewhat - more plastic - but for the price, this is a great machine. I paid Can $ 1100 for my XT body in May of 2005, and now you can buy it with 18-55 lens for $450! Great value. Buying it from Amazon was really easy. It came in days.",
        "I have to say that as a fledgling photographer i was very unsure of what camera to buy, but after reading a lot of reviews and talking to a lot of pros i was directed to the Canon Rebel as a phenominal camer ato start with. Easy to use, simplistic design, sturdy, reliable, and still produces professional quality pictures. I must admit that the options and settings that are available are a bit much for me but the cameras auto selection takes excellent pics until you figure it all out. I HIGHLY recommend this camera to anyone that is looking to get started in photography.",
        "I absolutely LOVE this camera. First experience with DSLR but so far, extremely satisfied and picture quality is great.",
        "This is a great camera with some very excellent features. I am disappointed that after taking a photo it does not display the photo until I go into review mode.",
        "I bought this camera as a retirement present for my dad. After about 400+ pictures, I have to say this is one of the best digital cameras I've ever handled! For starters, the default automatic settings give excellent results in most cases. Colors are vivid, white balance is spot on, and automatic ISO selection is OK. For the real enthusiast, the multitude of options gives something for nearly every situation. As with any DSLR, shot composition is done exclusively through the viewfinder. This is not a limitation once you realize the advantages of optical correctness in shot composition. The RAW output comes in handy for print use of the shots. Overall, a great buy!",
        "We bought our Rebel after seeing the output from a relative's Rebel. This is so much better than the smaller cameras, even with the higher MPs. The depth is great, as is the ability to move from auto to settings. For the amateus such as myself, it's a great introduction. Yet, a wedding photographer was using the same camera with different lense. I appreciate our relative's recommendation, and would most certainly recommend to others.",
        "I am a novice photographer, but really feel in love with the abilites that this camera has! I have owned several other digital cameras including the Sony Mavica & the Canon Sureshot. This camera is clearly a step above, and I am very happy that I purchased it! I just recently purchased a Tamrom Lense which provides me with slightly better zoom, and substantially better clarity and colors! Hope this helps - Good Luck",
        "This camera has been reviewed many, many times so I don't have much to add. The pictures are great, it's easy to use, etc. Aside from that, it did stop working on my vacation about 3 months after I purchased it. I sent my camera in to a Canon Service depot and I received it back, fixed, within a week. While I wasn't overly impressed that the camera broke in the first place, I was impressed by the quick, hassle-free service.",
        "I bought this in March 2005. I've been using this mostly for outdoor photography, here is a link to some of the pictures I took with this beauty. [...] finally after nearly 7 years, I thought I will write a review. Pros : 1) Quality of pictures is awesome 2) Highly recommend for nature photography 3) Extremely easy to use. 4) 7 years and still chugging along with no issues. Cons: 1) Pictures taken with small amounts of light are not that good. Highly recommend a flash. 2) Pictures taken at night lacks image stabilization, usually I end up taking these pics with a Tri-pod",
        "I LOVE this camera, I'm still unsure how to use the advanced features even after reading the manual and some online sites but maybe I'm just a slow learner LOL The standard photo options are great and make for great pictures, you can get quite close with the lens it comes with too. The speed at which it takes pics is fantastic, no lag time, which is great with 4 kids, cant wait for the camera to be ready! I love it",
        "[[ASIN:B000W4S0JM Canon Digital Rebel XT 8MP Digital SLR Camera (Body Only - Black)] I love my new camera, and am snapping so many more pictures than I did with my old Canon film SLR, which was too heavy to carry around with me. All the hype about the camera being difficult to hold without the battery pack just isn't true, unless maybe ]you're a guy with big hands. My hands are far from tiny, and the camera is perfectly comfy to hold. I am very happy with the quality of the pictures, even in \"point 'n shoot\" modes.",
        "I previously owned the Canon Digital Rebel so this camera was a jump up in megapixels. The camera is smaller than the first Rebel, but I added the battery grip which gave it a better feel in my hands. I bought the 70-300 zoom lens with image stabilization. I took pictures in very low lighting without a tripod with very good results. The 420 flash is also a nice add on. I use the Canon pixma I9990 printer which is pictbridge compatible for amazing 13x19 photos. Canon is the only company that I would do commercials for.",
        "Wow! Got this camera just before my Hawaii vacation. Although I still haven't finished all the instruction, I did learn enough to take fantastic pictures in all kinds of different lighting. Time exposures at night were superb. High resolution results with the SLR camera cannot compare to digital instamatics with those tiny lens aperatures. Recommend this for any enthusiast who lkie to control their on settings.",
        "I had other SLRs before, the starter machines I mean. Digital Rebel XT is the best one I had so far. It feels very professional, and it really takes very good pictures. The LCD screen is a bit smaller for my taste, but it doesn't justify the quality of the images I receive from the machine. Buy it; if you are ready to jump in SLR world, before get yourself a crazy expensive machine :)",
        "Is a really great camera absolutly love it. The only problem is its size. Now a days you can get so many great quality cameras that are smaller. We just use it for family photos and always forget it and end up just using our phone. I would only recommend getting it if you are looking to use it professional. Other wise get something small that will work great to carry around",
        "Loved that this item came with 3 batteries. Came with chargers. It looks amazing, and takes great photos. Would have been pretty awesome to have an SD card with. Over all, would definitely buy from this seller again!",
        "I just got this camera as a gift. It came in a timely fashion. I have a Canon EOS 650 so many of the features are similar. I was disappointed that there was no CF card included in the box. There is nothing in the description of the product that states the CF card is sold seperately. The manual eventually tells you the card is sold seperately but not until you get to the part about inserting the card. I have purchased other digital cameras online and they have come with a basic card. Perhaps you could make note that the CF card is sold seperately? Thanks.",
        "Wonderful camera. Very professional and in great condition. My son seems very happy with it. Takes a great and very clear photo. The camera arrived to us quickly and was shipped beautifully. Thanks so much. Very pleased!",
        "it was just what the seller said it was but more. the pictures are better then my old point and shot. I would buy another one the same has this one and I would tell others to buy this as well",
        "I bought this used and is extremely happy. It is my first DSLR camera and since I am a novice it would be a good tool to get my feet wet in the use of a professional camera. Also ordered lens so this weekend I will be trying them out because I have a cake for delivery.",
        "There's a reason Canon updated this to the new version - this is horrible! The controls are NOT intuitive, the ability to do simple things (like turn off the flash) are so archaically done that we only take this out if it's an outside shot or every other camera and smart phone is gone. For the amount we spent on this, I can only say we got ripped off. Canon makes great products, and the new version of this camera is no exception. This one, however, is barely good enough to be a backup camera.",
        "I researched the Rebel XT in depth before my purchase. I decided on the XT as opposed to the XTI due to the price. I found the very best price at Amazon however, I was a little concerned when it arrived. The camera was shipped along with a cookbook that I ordered without any additional packaging materials within a large box. The camera was in perfect condition and I began taking pictures. The best feature of this camera is that I can use the auto settings or manual settings when I want/need to get creative.",
        "I love the camera there's nothing that I don't like about it for the price how can you beat that for it to be an old model still being used in 2018!!!!!!!!",
        "This camera is great. I am by no means a photographer, but this camera makes it so easy. I want to shoot everything. Right now I am using the automatic features, but I hope to work my way up to the other features. Picture quality is great, makes it easy for anyone to take great pictures. I am so happy my Fugi point and shoot broke! I don't think I will ever buy anything other than a Canon again. It was better than I could have imagined for the price. BUY THIS CAMERA.",
        "This is just a great camera, especially at this price point. It is easy and fun to use if you are in a hurry, or if you want to be more advanced you can start digging into the features. I bought this with a 2Gig memory card and have more than enough memory. If you are thinking about a digital SLR, this one will be a great choice.",
        "Very pleased. I bought this used and it came with 2 cases. 2 lenses, filters, strap, memory card, and booklet. Very nominal wear, it is at least 4 years old. nice.I will use this for astrophotography.",
        "I love my new camera!...I'm having a hard time putting it down...I'm not a pro but I love to take pictures and have been wanting a good digital camera for a while...decided to treat myself and for the price, the quality is second to none!...I would definitely recommend it to anyone looking for good quality at a great price...",
        "Got an old camera working again. So great so far",
        "For my first camera ive gotton some great shots with this thing versatile easy to use pretty light and I got a decent deal on it the only down side is the sensor is only 8mp witch makes for a lot of extra work when editing I will be upgrading to the t series soon still a great buy",
        "This arrived on schedule and was given as a gift. My initial inspection found no issues, and cosmetically it was in perfect condition. I have heard no complaints from the person who received it as a present.",
        "When considering upgrading from my little point and shoot digital camera to a more substantial camera, I was advised by a number of people to try Canon and I would not be disappointed. This camera is as easy to use as my point and shoot with automatic features (it can be adjusted for close-ups, low light, action, etc still in automatic mode) but also offers more advanced options. The seller shipped my camera quite safely in foam shipping material. It was shipped to me quickly and came complete with everything advertised.",
        "Didn't include any accessories that were supposed to be included",
        "Had to send it to canon to have it repaired, pins missing in the flash memory bay.",
        "Easy to use and very versitile. Combines the best of both worlds.(Digital and SLR) The manual is a little overwhelming at first, but once you start working your way through the menu you'll realize that it's not as difficult as it appears to be. I've never had an auto pop-up flash, so it took a little getting used to. I love the fact that you can change the wide range of ISO settings. Light weight and durable. Dennis",
        "This camera was recommended to me by a photographer friend. I took the advice, and am so glad I did. I started to want the XTi with its 10MPs, but knew that because I am a serious hobbyist, I could spend the extra money on a new lens or accessory instead. The Rebel XT fits my lifestyle! I love this camera!",
        "This camera and its included software is all you need, really. It goes from \"point and shoot\" to all types of customized photography. If you already have Canon lenses, I strongly suggest getting the body only, and a decent memory card. Even the included flash works great. Nice job, Canon.",
        "I so love this camrea I got my baby back tks again can't wait to start doin what I do best amaze my self and my girl in my pic taken",
        "Nice camera works excellent and pictures are awesome. Has lots of features for the photographer enthusiast. Comes with canon software to edit you photos.",
        "Was very happy to have found this product but as it turned out had the same issue as my old camera. Customer service was good!",
        "Works great! Sorry I did not write the review earlier.",
        "The camera is a great camera, but we did not receive everything that was listed to come with the purchase.",
        "I got this for my son for his birthday couldn't be more happier. Fast, good condition,great price, and he loves it!!!",
        "it's a great camera. my one complaint (this can probably never be fixed, so i'm cool with it) is that the lense it comes with is standard. telescopic ones cost more, and after buying a 500 dollar camera with a 60 dollar memory card and a 100 dollar tripod, i'm kind of wiped out.",
        "I have been looking forward to getting a digital SLR for a long time. This camera was everything I expected it to be, and more. It starts up quickly and can easily take 2-3 pictures a second. I have small children who don't tend to sit still too long, so that was a big plus for me. The quality is awesome. The other aspect that I'm extremely impressed with is the battery life. There's not much more I can say that hasn't already been said. I highly recommend this camera.",
        "This camara was amazing as a gift to our son for his beginners photo shoot",
        "Perfect camera for my daughter to take to Italy for a photography class. Didn't want to invest in a camera too expensive and found this gem in the warehouse section of Amazon. A little old and she was teased about the size but she got the last laugh when she made an A in the course and came home with amazing pictures that she will treasure forever.",
        "This is my first digital SLR and its a doosie, the change from digital to SLR requires some study but the camera is so cool that the learning curve is actually fun. The quality and the modes live up to the hype. it seems to be a camera made for creating good pictures. My only complainant with this model is that the flash doesn't function at its best in some of the modes but that aside its a great camera",
        "Purchased this for my son as a 'next step' in his photography journey. So far he seems to really be enjoying it, but he is still learning how to use it.",
        "Great DSLR camera for an entry into photography and all buttons worked as stated.",
        "This is the kind of camera you can pull out of the box, pop in the memory card and battery and start taking photos. The menus and various buttons are obvious and easy to figure out. It's also sturdy (albeit heavy). I especially enjoy being able to take rapid sequence photos without an irritating lag between photos.",
        "Works like it should, have no issues with it at this time.",
        "I have been interested in getting a digital SLR for some time and decided to jump on this one. I bought the camera, 4gb of memory and purchased a zoom lens and a macro lens, still looking for the remote control. I love what this camera can do, and even though its bulky, that's to be expected. I am very pleased with its performance and learning how to use it has been very simple. The instructions included with the camera make it easy (not to mention the photography classes I took light years ago when it was not digital).",
        "I have been using this camera for years now. Love the picture quality. Although, it's not comparable to the cameras available now, it was great when I purchased and I've been very happy with it so far.",
        "Ok, I'm not a photographer by any stretch of the imagination. I don't know how to use 3/4 of the settings on the camera, but I'm learning - slowly. But for the pictures that I have taken are beautiful. It makes me look like I know what I'm doing.",
        "Was not represented correctly!! Pictures were of a kit. I got the camera only",
        "When my Canon Rebel XT broke I went to have it repaired. The person suggested that I could go on Amazon and buy a new one for $100 more than the cost of the repair. When the camera arrived there was a little note that said if I had any problems to call the vendor directly. Well when I opened the box the battery was not there. Expecting a hassel I called the number. To my surprise they said they would send me a replacement ASAP. Within 2 days not only did I receive a battery but they sent me an extra one for my inconvience. I would definately do business with these folks again",
        "Old version of a good camera for beginners. Uses compact flash instead of an SD card which is a pain sometimes but overall a decent camera.",
        "For an older model Camera it functioned very well. I have the utmost confidence in purchases from Amazon. Mal",
        "Got this camera a few years ago and didn't realize I had the option to leave feedback. It was a great camera and served our purpose well. There were no problems with the camera itself. It was however a very dusty item as if it had been sitting on the shelf for a while. This could have potentially not been good for the camera. Overall though it was a great experience.",
        "Works well, but it had little bit of dust on the lenses.",
        "product exceeded my expectations I was truly pleased with product,condition & value.I will surely order from again and know I will get a great product"
    ]
}