{
    "entity": "Thresholds",
    "text": [
        "I installed this product in about 10 minutes. It looks great and solved the problem I had. Seems more black than brown, but I am fine with that. Comes with 4 screws, not the 7 pictured . . . but you only need 4 screws, so again, not a problem.",
        "Why didn't I order this product sooner? It keeps in and everything out. Here in TX those pesky geckos try to get inside which I'm deathly afraid of. The hard rubber (or maybe its plastic) does its job and it does break or crack. Be sure to check the thresholds in your doorways and the amount of space between your door and it. Do a 'test run' by taping this unit to your door and open and close your door. This will give you an indication of whether you will need to adjust it (higher or lower) to your taste and/or liking. You might need to cut this unit to size as well using a sharp knife, saw, etc.",
        "Installed easily to inside of \"swing-in\" door about 2-3 months ago. Worked well to reduce draft when sealed up against wood threshold Draft was eliminated in all areas this covered. Additional weatherstripping is needed in corners of old door to help, but this effectively stopped all the air blowing under the door. I installed with just a small amount of \"flex\" or interference to allow the door to close without too much more force. Build quality is good, came with matched screws to install. I cut metal with a hacksaw to fit door, and poked holes (with drill) through rubber for screws before installing.",
        "Ok, so the flexible vinyl rubber part does require a tiny bit of trimming, but you can actually do that easily with a pair of scissors (it won't be as nice or clean a cut as with a knife, but it's on the floor where no one will notice). Installation into my wooden door was extremely simple and only required I screw it into place. It does the job, looks seamless, and I doubt anyone will even realize something is different about the door.",
        "Seems to be well constructed from quality materials. Needed a hacksaw (too thick for metal snips) to cut the metal to length on the both sides so that the screw holes can be centered on the door. Comes with everything (4 screws, not the 7 that are shown). Forms a good seal with metal bottom plate of my door frame. You do have to drive screws into the door to install the sweep.",
        "This is a pretty straight forward and well made door sweep. It comes with a rubber piece that is longer so you can cut it down to size. I suggest holding it in position of where you want it to be and place your drill bit through the pre done holes and drill into your door. This will allow for easy installation to your door and will insure you have it in the exact spot you want and avoid stripping the the screw heads",
        "The product looks good and does it job and was exactly what I was looking for. My only con is that the holes on the rubber are not height adjustable like the metal strip. This made the job of making height adjustments time consuming and a bit messy. THIS SEEMS LIKE AN ESAY FIX FOR THE MFG. Gary",
        "This simple to cut (to size) door seal attaches easily and quickly. I used a mitre box and saw. Placed on a garage exterior side door without a jamb, and a 3/4” to 1” space at the bottom, the seal does what we had hoped it would do — stop mice from entering the garage.",
        "Great, sturdy weatherstrip. I installed it on my basement cellar door to keep out dirt and insects. I used a dremel cutting wheel to cut mine back a few inches.",
        "ORB Finish was bubbled and peeling after 2 days in the rain",
        "I bought this to try to stifle some noise from my apartment to the adjoining hallway. Worked great! I know that is not really the intention of the product but it added a layer of insulation at the base of the door. Glad I bought it!",
        "Did not weather well at all started pealing after a few rain episodes...already attached can't send back or I would have",
        "Cut and install. Works great. The rubber sweeper seems pretty stout like it should last a long time.",
        "A couple of bucks cheaper here than Home Depot or Lowe's. Easy to installs, and good quality.",
        "Easy to trim and a brown magic marker hides the edges well. It is on an entry door and looks a lot better than I thought it would.",
        "Very nice sweep. Rubber part is just stiff enough, but also limber enough. Really like it.",
        "I put this on the outside of my apartment door to ensure that no insects or other varmints enter my apartment underneath the door. It looks great and does the trick.",
        "Much better than the big box store product but not as thick as my original. The best I could find on the market though. I would recommend it.",
        "Item arrived as described and in perfect condition. Easy to install on screen door.",
        "I used the door sweep at the bottom of an out-swinging wood screen door to keep the bugs out. It works just fine but does not completely seal the sides adjacent to the bottom.",
        "Pure junk! Paint peeling after a year. Certainly not a good product",
        "Great for my business. Priced about right. Will keep using them on new jobs and they last forever.",
        "works well, good quality strong too. delivery was fast too.",
        "Product was easy to set up and looks really clean after installed",
        "This did the trick to seal the gaping 1/2\" gap beneath our poorly-hung exterior French doors on our old house. Now the bitter cold draft and the hot summer heat no longer leaks in and out wasting electricity. It was tall enough for our project to be adjustable to seal off the whole draft and came with all hardware. You do have to drill small pilot holes. The oil rubbed bronze color was very true to our door trim and the rubber is thick but flexible. Perfect",
        "The product that was delivered was not the same as the product pictured and described. Instead of being \"bronze\" in color, it was a golden brown with a fake wood grain and the packaging indicated it was \"oak/roble.\" Unfortunately, this will not match with my door.",
        "Quality of product was good but screws were not included as stated.",
        "They are a little bigger than we thought they would be, but work good. Installed easy. Keep the rain and pests out.",
        "Did the job/a quality product. I needed some extra screws so I called the company.....got service with a smile!",
        "Easy to replace, just remove screws from old one and put his one in."
    ]
}