{
    "entity": "Thresholds",
    "text": [
        "This door sweep is the perfect size for the extra wide screen door on our gazebo. It was easy to install and the price was very reasonable.",
        "These work perfectly. The enlcosed screws willstrip out, so I suggest using hex head screws for installation. Also, you'll probably want to install an extra screw at each end to keep the ends from bending. An excellent product.",
        "You have to understand I have problems with anything that had to do with tools -- BUT My wife was shocked when I had the strips done when she got home from shopping I tolder It took me 3 hours -- BUT took me less than 15 minues for each door.",
        "Came bent to two places but box had no damage so someone didn’t care when packing.",
        "Great product. Well made. Needed to replace sweeps on all the outside doors of a 35,000 SF building. Fit the bill.",
        "Just what I need to seal the bottom of a large door thanks",
        "I am a general contractor / Architect did not like the door sweeps for LaCantina foldable doors I just installed. So I searched for a sturdy substitute and found this sweep to be tough and sturdy. I wished they had it in white and white",
        "This product was just what I needed to seal the bottom of a large, old, wooden door. I've used this product 2 times and would recommend it.",
        "works great preventing drafts coming under the door...no more towel rolled up under doors in the winter...it only took about 5 minutes to install",
        "Item was received in perfect condition and as described. I was looking for a longer sweep, and this fit the bill. Great product, thanks.",
        "I had 2 48\" doors in need of sweeps. These did the trick and matched toe existing screw holes exactly. Win/ Win.",
        "It was just what I needed. The product is what you would expect from M-D. High quality and it was easy to install on my door. It had all the screws and all you needed was a screwdriver and a man or woman behind the screwdriver.",
        "It's a good one. I couldn't find this size, 48\", at local retailer so I found it at amazon affiliated retailer and I was pleased with packaging and delivery. I got it shorten and it did the trick. I'm sure it would last several years since it has good quality.",
        "Product is as expected but I ordered 4 and they sent each one separately.",
        "I bought for my office. It is a 42\" door and my employer wouldn't buy one. I bought and installed myself! Cuts down on the cold..."
    ]
}