{
    "entity": "Thresholds",
    "text": [
        "I ordered the \"heavy duty\" sweep and was frustrated at how flimsy it was. Roughly the same thickness as a dime. But, I hesitated to try the commercial version (again) based on a crappy photo. To me, this looked like thick neoprene - which wouldn't suit my application with a textured flooring surface. Tried to capture the difference in my photo: left is \"heavy duty\", right is \"commercial\". Minus one star for crappy images, M&D. Hope this helps someone else.",
        "Trimmed to fit on exterior door (32\"). Had to add additional holes/screws to attached securely (only 4 in the OEM 36' sweep). As others have stated, the rubber sweep holes do NOT align with the predrilled holes in the aluminum bar - regardless of manipulation: The measurements between holes in both are not consistent (read that: uniformly spaced), and the rubber and metal hole spacings do not match each other. That said, the rubber is a vast improvement over the previous vinyl composition sweep: Only time will tell if it stands up to the harsh northern Minnesota sub-zero temps, moving across a concrete slab. Will revisit and revised this review as necessary, down the road...",
        "The product seems OK for it's function. I ordered this for a steel security door. It is nearly impossible to install. You need to drill and tap the hole for the screws provided. The screws come with the package is very soft material. Screw broke off easily when fastened to steel door holes. Maybe you need to make sure your attached surface is FLAT, and SOFT material (such as wood, sheet metal).",
        "Very sturdy design. Had it cut down to size and installed in under 5 minutes. I like how they include excess rubber on both sides of the metal piece, allowing to leave the rubber cut a little wider than the door and helping to seal any gaps around the door even better. The rubber piece is nice and thick and I dont see it wearing out anytime soon. Addressing the reviews complaining about the holes rubber not lining up with the predrilled holes in the metal: mine came the same way but its just rubber. Just drill a new hole through it or just push the screws through it like i did.",
        "The rubber strip is very thick at the bottom, not tapered toward the bottom as shown in the Amazon product images. I mounted this on a screen door and the rubber was so thick that pneumatic door closer would not close the door. When I raised the strip up a bit (after having to drill new holes in the metal), so that the door would self-close, the rubber strip was so high that there was a 1/4 inch gap under the door. This gap was almost the same as I had before I installed the strip. So after two hours of messing with this door sweep, I realized I should not have bought it in the first place.",
        "These sweeps really are industrial strength. Almost to the point of too heavy duty. They work well on outside doors.",
        "If you have to cut it down to size, do not buy. I am handy and had a difficult time using a Powertool and a saw to cut it. Then when I did, it was not a nice cut. Looked so awful, im not using it so I just wasted my money. And there aren't enough holes, there are better ones out there.",
        "Screws are missing!!! Got this out to install and the screws have been taken out. The wrapper is torn and there are no screws. This is really annoying since it doesn’t say what size screws needed. Now I have to figure this out on my own when they should have been in the pkg.",
        "Advertised on Amazon that it comes with screws. No screws in packaging or box when item received. I can not install without screws. I do not have those screws to install. The product is useless to me. I called there 800 number that is listed with Amazon, it is disconnected. Proceed with caution when purchasing.",
        "We used this product to seal off some doors in our house to help keep mice out of our living space. At least we think that what it is doing. So far we have not seen any mice in our house since installing this on one of the doors. So I think it is actually working. The design and make of this is VERY STURDY. It is a metal top that holds everything together along with either thick plastic or rubber that seals off the cracks.",
        "This is the 2nd time I bought this door sweep for total of 3 pieces. The quality is excellent. Unfortunately, like some other reviewers, one piece miss the installation screws. This type of mistake should not happen.... I was thinking about returning it but decide to spend 50 cents to buy some screws from local store.",
        "Built solid and easy to cut (2 min with a hacksaw, trim rubber with scissors). No need to pre-drill holes on my wood door, just lined it up where I wanted it and used a drill with a screwdriver bit. Super easy with the complete install (measure, cut and mount) taking less than 10 minutes. No brainer for the cost.",
        "This really worked well on the bottom of my Storm Door. I have a slight gap and after attaching this unit, it took care of the problem, Thanks Again for the great products you provide us folks in the West, Sincerely, JB-NV",
        "When I ordered this I wasn't quite sure if it would be hardy enough for my back door. I was afraid it might be a cheap, flimsy door sweep but it is definitely a quality piece. Since it needed to be cut down to fit my door I relied on the easy to follow instructions supplied. It was cut down and installed within 10 minutes. Well worth the money!! Gave it 5 stars even though wrong color was sent. Ordered white and received chrome.",
        "I purchased this item to reduce noice from leaving my room. This product doesn’t cover the bottom of my door completely (yes I put it as low as i can) Also, it didn’t help with noise reduction like advertised. When installed, this product made it nearly impossible to open and close my door.I would return it but I had to break pieces off to make it fit my foot. I would recommend changing the bottom of the rubber section to a different material, so it can slide easier on floors.",
        "Good bottom door seal . Measure door width !!! It would be nice if all builders could get jams right ( when I built homes ),and everybody knows pre hung doors are the only way to go but after divorce and what not I'm in an apartment that is ancient lol . this seal worked good",
        "No nonsense , sturdy and well finished product. Mounts with screws, so no messing around with adhesive backing. Allows for up and down adjustment.",
        "This was easy for me to install myself. I cut it to fit. I trimmed both sides, to keep the screw holes I needed for my doors. I installed one on the kennel door and one on the chicken coop. They work really well and have held up all winter nicely. They still look in perfect shape.",
        "The rubber band is quite stiff and it makes opening and closing the door cumbersome. We had to position it low enough to prevent critters from coming through.",
        "This door seal worked great. I was able to cut it to the size of my door and installed easily. The rubber is thick and should provide a good seal.",
        "Seems like a good product . Packaging could use a little work . Arrived bent in several places due to packaging and handling . I was able to straighten it good enough to use it where it was needed .",
        "Holes on metal are not spaced evenly. Holes in rubber also don’t match holes on metal. Basically none of the holes line up. Utterly careless manufacturing. No math was done in making this product. Such a basic thing to mess up.",
        "It is very waterproof, and it is pretty easy to install. The purchase price was Ok and I would purchase this again. It can be cut to any length you need.",
        "Replaced a glued-door sweep with this one. Our door threshold is worn down and cold air was coming through a gap. I installed this door sweep and NO cold air comes through! Installation was very easy with no fuss or mess. Very good product!",
        "Great product for the price. Comes with mounting screws. Once installed completely eliminated the draft that was coming from under our front door. Can now keep thermostat 5 degrees cooler than we used to and our place feels warmer and more cozy as a result. Unexpected bonus: No more spiders!",
        "I got this for my sisters apartment and it really is a heavy duty product. We wound up having to cut it down some since it ran off the end of the door and that was not an easy cut to make. Overall very happy with it since that stopped the drafts that were running her bill up.",
        "Works as described and very easy to install. Note: This item is for 36\" door. You may need to trim it if your door is narrower.",
        "I had to cut it to size and had to drill my own holes so it would fit low enough on my door to brush the floor, but I think that has more to do with who installed the door. I am happy.",
        "Works great. Used for side garage door. Keeps out cold draft & any critters that might want to enter under door. Gave 4 Star just because we had to cut to size 32” (comes in 36”) which is not really a big deal. Great price & 2 day delivery with Prime.",
        "We needed this to keep creepy crawly bugs out. Measured to our door, cut and drilled with no problems. Now no more bugs can get into our home. Thank you",
        "The door sweeps are very study and well made! Easy install with a philips head screwdriver. I did have to cut off about 1/2 of an inch to fit my door. Used a small hand saw to cut and took about 5 min to cut thru it.",
        "Good product, it was easy to cut to the size I required (34\") with tin snips and easy to drill my own holes through. It has a good seal and looks nice. Only not giving 5 starts because it did not include the hardware the instructions said it did.",
        "Worked well for sealing the gaps under my exterior doors. Winter is almost here, so I'll see how well they really work. Great so far, but I'll update if they don't perform like I'm hoping in the cold weather. The metal part holds paint well enough to blend it with the door.",
        "These are longer than needed so I cut them down with a hacksaw on the metal part and scissors for the rubber. Super easy installation.",
        "I needed this for my garage and laundry room doors. They were very easy to install and easy to cut. I have industrial scissors used to cut metal, wires...I just used those and a razor to cut the rubber. Turned out great.",
        "Blocked the north wind on our storm door. What a great difference it made. Remember, if you have a wide door this may not cover the entire width.",
        "This sweep was a simple and easy way to stop the cold airing flowing into my house in the winter. And when you live in a part of this country that can often drop below zero at night that's a good thing.",
        "It's easy to cut to fit any size door. Just use a hacksaw and put it on the door. Took about 10 minutes total. Item is robust and durable. Rubber sweep is thick and not flimsey.",
        "No more draft from under the door. Worked a lot better than the old one.",
        "It worked well for us. It is very sturdy, nice product.",
        "This product is a quality product but it is listed as 36\" wide when it is actually 42\" wide. This requires extra work to correct",
        "Worked great, easy to cut with a saw or grinder. Rubber is flexible enough to have it drag slightly to seal well and not keep the door from closing",
        "Great product! I oversee Operations for a large school district and these are commercial grade in every facet. Easy install and they last. Great for cold and windy Michigan days.",
        "This is a quality product.easy to install if you don't mind drilling a few holes.",
        "This worked extremely well! Used it on the bottom of one of the screened doors on our deck after enclosing it in vinyl. Is blocking the breeze from the warping of the wood perfectly, thank you! It was extremely simple to install, I trimmed some of the rubber on the bottom (wood decking isn't perfectly flat, so it dragged some).",
        "Just what i needed to complete the job on my door.....",
        "Installed in minutes, easy to cut down to size. Heavy duty, works like a charm.",
        "Installed East and did exactly what we needed it to",
        "It was what I needed, but it was stuffed in the box and bent! Needless to say I'm sending it back!",
        "Nice quality item. Better than what I've seen at Home Depot.",
        "finally got around to installing this on my new shop door. Keeps the draft out.",
        "Had to trim to fit. Should make these in popular sizes so they go right on.",
        "It's very hard to cut down with a hacksaw, but with an electric saw and metal cutting blade it's a snap.",
        "Works great, no breeze coming through anymore, easy to instal, screws weren't complete junk like some of the others. Good job M-D Building products",
        "Worked great. Fixed our draft from bottom of the door with minimal handyman skills.",
        "Great product. Had to drill new holes to fit my door, but no big deal. Hoping it keeps rodents out of my business warehouse.",
        "If its tight enough to keep air out, its to tight to open and close thë door",
        "Had to cutoff and inch with a hacksaw, to fit the door. The door is a standard size.",
        "Just what I needed and the co. sent it out to me with out delay. Thank you.",
        "Worked exactly as expected. Does not leave black marks or smudges on my kitchen tile.",
        "Good for filling the gap with this price. I am pretty happy with it.",
        "My front door had a heavy draft. Very chilly in the winter. Once I installed this the draft went away completely.",
        "Works great, stoped drafts notably. Easily adjusted with a fine hack saw.",
        "I installed this on a metal storm door to replace the existing sweep that had worn out. Installation was quick and easy and hopefully the rubber sweep contacting the concrete threshold will not quickly wear.",
        "Don’t waste your money! The holes in the runber and the metal part don’t match, not a big deal unless you need to adjust it up or down like me.",
        "I received mine today and I already see that the holes in the rubber does not align with the holes in the metal. Overall this contraption seems sturdy. However, how can I install it with this issue? Will be returning/exchanging.",
        "Worked well. Easy to cut and install. Blocked considerable sound from my washer and dryer area",
        "Not a standard size. Why make this so long and not a length of standard door size?",
        "Good fit. I put this on the outside and it looks like it will keep the bugs out.",
        "This worked perfectly for my screened porch door. There was a gap at the bottom and I needed something to keep out both rain and snakes and it seems to work great!",
        "This has made a difference in whether air can be felt leaking in. Easy to install and trim if necessary.",
        "Great product that closes gap at the bottom of kitchen screen door to keep out insects and/or critters! Easy install (with handy husband).",
        "Well made. Includes screws to install. Easy to trim for perfect fit.",
        "Great product. Including the mounting screws is always a plus. Measure, cut, drill, screw - DONE. A 20 minute job that ended my wife's complaints about our door.",
        "Fantastic. Easy install. Easy to cut to size. Great price",
        "great product and I can feel a difference without the North wind coming out from under the doors.",
        "Worked perfect to cover a big gap under a door we had going into the garage. The kerf portion was FUBAR so this was the best option.",
        "Went on easy and is doing the job. Quality seems to be good.",
        "Perfect product for easy, fast replacement for existing screen door sweeps. Highly recommend this product.",
        "Pretty good. For the price, can't really argue with what you get.",
        "This is an amazing simple product that prevents drafts at the base of your doors.. highly recommend!!",
        "Working as it should, can't ask any thing more than that.",
        "A quality product that's made of aluminum, has a heavy duty adjustable rubber sweep and is easy to install!",
        "Easy to install and it really works! Great product and better than I was expecting. Covers our entire door and no drafts are getting through.",
        "Excelent door sweeps. Bought these for our shurch doors and they are perfect. Made very durable",
        "I like this product I used it for my front steel apartment door. It’s very sturdy and it seems like it will last long.",
        "quality and heavy duty. used it to help soundproof a door.",
        "Nice quality and the price was very good. We purchase several and replaced all of our old ones with these.",
        "It came as described, but was too long for my doors. I cut to fit and works great.",
        "Yes, it has screws, but take the time...the sweep is perfect flexibility ... great product",
        "great product but requires drill bit and screws for metal door",
        "Really worked great on my French doors to eliminate the draft.",
        "No problem to cut down to fit and the rubber sweep is heavy duty.",
        "Great threshold and well priced. Need to have right tools (hacksaw) to cut to size. Looks great.",
        "Given the cost of them well worth the money. I had to cut this down to fit my front door. no problem doing that and the rubber band provides a good seal on my hardwood hallway floors. It is a little on the tall size so not sure it is the prettiest thing in the world at the bottom of your door but it does do the job and here in new england that is what is key.",
        "Great product, easy to install - No more mice in our garage!",
        "Easy to install and it does what it suppose to.",
        "Worked as described. However thought that the costlier EPDM sweep might be something better. Time will tell.",
        "Easy to install. Definitely great quality. Thick rubber and very easy to install. Using it to reduce noise and draft which it seems to do the job. I did install it a little too low which doesn't work well as it would curl under the door and only allows the door to open a certain distance before it gets stuck. It was easy to adjust-simply user error on my part.",
        "It suits the purpose. I didn't notice that the holes are in the middle, though, so it almost didn't fit the location even though I measured the distance because I was limited by a metal band on my door. It just about made it. I'm removing one star because I didn't notice that measurement when purchasing, the distance from the bottom to the hole."
    ]
}