{
    "entity": "Garlic Presses",
    "text": [
        "So disappointed, this broke after only 3 uses. Update: the manufacturer sent me a new one. Comparing the two, I definitely received a fake initially, even though it was fulfilled by Amazon prime. The real one does NOT have the Swiss flag on the front and DOES have ridges to keep the bar in place when crushing garlic. Comparison photos included.",
        "I own an authentic Kuhn Rikon and was hoping to give this one as a gift. The authentic one is fabulous and has seen years of use without issue. This one is fake. Riveting, mechanism, quality of finish, label, and weight are all off. The fake weighs 286 grams. The authentic is 319 g. I read in a newspaper that Amazon is commingling third party product with their own stock, so fakes are now a problem even when purchased directly from Amazon. Sigh.",
        "The manufacturer web site would have you believe their products are manufactured in Switzerland. In this day of so much Chinese crap flooding the market I was willing to spend 3x the price of similar appearing products made in China on this \"Swiss made\" garlic press figuring you get what you pay for. That and I simply avoid anything made in China whenever possible. Imagine my surprise when I opened the plastic bag the thing came in to find that it was made in China! It was immediately returned unused. If I want Chinese crap - I'll make that decision on my own and not have it slipped by me.",
        "Overall quality is excellent. I much prefer open-hopper garlic presses for ease of cleaning, and this is great. As some have complained, there is a bit too much space between the hopper sides and the perforated plate, so some larger bits of garlic squeeze out the sides. I don't know why the tolerances cannot be made closer by the manufacturer, given the overall quality of the unit. I put mine in a bench vise and squeezed the hopper sides in a bit until there is no space to the sides of the perforated plate, and it works better, now. The leverage of the handles and pressure plate is really wonderful, and makes squeezing garlic a breeze compared to standard units.",
        "my wife hated it when i was happy. i mean, HATED IT. which explains a large portion of why we are no longer married. oddly we made it 23 years before i told her i was leaving tighter than a bull's butt at fly time... i've spent so much time searching for things that make me happy since then, but this little sucker is a hit. turns garlic into your servant. easy to clean. ...and the neighbor chick digs it. she comes over pretty often just to borrow it.",
        "I really like the way this press works, for the most part. It has large smooth handles that allow you to execute the press easily. There is still \"leakage\" of smashed garlic around the piston edges and out the edge of the screen. As will all garlic presses that I have ever used it is a bit of a pain to clean. The good news is that everything opens up but the bad news is that there are lots of places for bits to get stuck that you have to pay attention to. Overall I really like it and am happy to use it but it is not perfect.",
        "I had my garlic press for over a year and it works great! Still looks brand new, however the pins came out of the sides. They snap back in but they are more prone now to coming out so i called the company and left a voicemail asking if they sell the pins that go with their product. I got a call back the very next business day and they ended up sending me a new garlic press for free! Best customer service! It is definitely worth the investment!",
        "I have had this garlic press for over 2 years and until recently there were no issues. I recently began cooking at home more, and therefore using this more, and suddenly it broke! The problem I have Is the same as others have described/pictured - the pin popped out and the whole thing collapsed on itself. After further investigation I have come to realize I was sold a fake by amazon >:( very unhappy.",
        "I wanted to like this press for the price, but it wasn't worth the price because now I have to buy the steel one. This thing is plastic that flexes when you squeeze down on the garlic. Also, the pin in the handle pivot is not secured. You can just push out the pin with a pencil, it's loose. Not threaded or riveted WTH? I pressed 4 garlics and the pin backed out a little and the handle popped up. Sure, I can put it back together, and shove the pin back in, BUT I SHOULDN'T HAVE TO. Do not buy a plastic garlic press.",
        "I was hoping that for the high price this would be a high quality item that would last me a good long time but after receipt I'm not so sure it will. VERY sadly disappointing in this. The pins for the handle and levers have a LOT of slop in them which not only gives the device a cheap feel when using it WILL create for excess early wear and eventually failure. My old Kitchen Aid even though it had plastic handles (which failed) felt better to use and minced the garlic much better!",
        "If you cook with garlic regularly, and want to \"rice\" it with ease, this is the garlic press for you. Don't buy a knock-off! And don't be annoyed (as some here are) by having to use that spine/dull edge of a knife to clear the membrane between cloves. It'd happen with poorly designed presses, also. That is no reason to bag on this substantial hunk of steel. The design is lovely, and the materials and workmanship are uncommonly good for a \"Made in China\" product. It's a breeze to clean. And, perhaps most importantly, garlic stands no chance against the Kuhn Rikon Epicurean Garlic Press.",
        "Best garlic press ever. I bought this after America's Test Kitchen recommended it (love them!) and I'm super happy with it. No, you don't have to peel the garlic and yes, it is super easy to clean. Was not cheap, granted, but I would have to say that mine came in perfect shape and is very sturdy, all metal, no plastic. I saw a few review that weren't great but I took a chance and am very glad that I did as it's a nice quality product that I've been using for a few months (hummus and pesto mainly) and I think it will last quite a few years.",
        "I am so glad I bought this. I was tired of throwing out less expensive garlic presses as the coating failed and exposed the base metal underneath. This stainless steel press has no coating to fail. I will not need to replace this one. It is sturdy and easy to use for those with average or large hands. It is possible to pinch a finger, and I soon learned where to put my fingers. Large capacity, easy to clean, a keeper",
        "I feel almost silly about how happy this garlic press makes me! Each time I use it, I marvel at its design and engineering. (If yours does not seem well made, you may be one of the Amazon buyers who got a fake. Return it!) I have given two of these as gifts to people who use garlic as often as I do -- if not more! Consider buying a \"Used\" one from Amazon Marketplace for a discount. Mine have been in perfect condition, with damage to the packaging only. Enjoy!",
        "The chamber is not as big as the Kitchen aid, or the OXO but by far this is the easiest to crush garlic and to clean, the other brands you have to scrape out the garlic from the bottom of the chamber garlic always gets stuck in the holes. The Reckon just cleans easily with you finger and some running water quickly.",
        "Searched high & low for a non-China product. We were under the impression we found it in our VERY expensive Kuhn Rikon Swiss option - in the specs and description it led you to believe it was Swiss made. Arrived today after waiting over a month only to have a tag on it MADE IN CHINA. Sending it back.",
        "Outstanding build quality with hefty gauge stainless steel construction throughout. Clever hinge lever design that requires less force and is extremely easy to clean compared to Zyliss Susi Deluxe with its detachable hole cleaner (which I lost after about 3 uses). The \"almost\" part: I have experienced pinching on my hand when using this press. Twice it's nipped the soft area between thumb and forefinger. I'll chalk it up to familiarization issues on my part for now, but will wait to see if I can learn the \"proper\" way to use it. Also, my adult daughter did not think the force required to use it was substantially less than other garlic presses, but I did (with my giant meathooks).",
        "Ok. This is my 3rd or 4th garlic press. I keep buying expensive ones thinking they will be the perfect press. They were all disappointing. This one!!! Is great. Yes, you should buy this. It’s great to clean, squish garlic, and it looks good on top of that. It hasn’t started rusting like some of my others. It’s sturdy. Forget trying a bunch of others. If this one gets broke, I’ll just be buying another one exactly like it.",
        "This garlic press is the easiest to clean of all the ones I have recently examined (6 in total). It works beautifully but is a bit oversized and harder to use in my small hands with my aging grip.",
        "Would have given this higher marks but for the difficulty in cleaning it and that it broke on me 2 weeks after the warranty expired. Won’t buy another thru Amazon",
        "Mine has worked flawlessly for a few months now. It was sold by Amazon.com, and I believe it is genuine. Perhaps other sellers may be less reputable, so I'd beware of those, or buy if there's a good return policy.",
        "This garlic press is perfect - very reasonably priced, lightweight, and ergonomic. Can squish multiple cloves at once. Most importantly, it is a total breeze to clean! Plenty of people feel that a garlic press is an extraneous kitchen tool and I tended to agree due to the difficulty of actually getting the press clean. Then I read about this one and decided to give it a try. I use it several times a week and it’s one of my favorite cooking implements! Highly recommend.",
        "Bought this at the recommendation of America's Test Kitchen, and I love it. It's definitely a splurge, but I use a lot of garlic. It's easy to clean, as promised, and has a lot of power. As warned, it is possible to pinch your hand- you have to learn how to hold it. Overall, I'm very happy with it.",
        "This product is well designed, works well, and is easy to clean but after a year and two months of home use, the rivet on the side broke making it unusable. At this price and with such good reviews, I expected this to last much longer. I am very disappointed. This is the only product recommended by America’s Test Kitchen that has ever failed me.",
        "Worth every penny! I know it’s expensive, but I don’t regret forking up the money. I can literally taste the difference; two cloves of garlic seem so much more flavorful than before!",
        "Really don't like this press. It does OK, although as others have noted it tends to squeeze garlic around the edges quite a bit. Having the plate swing free does make it easier to clean. But the one flaw I really, really dislike is how often it pinches my hand as I squeeze it shut. If you look at the (very poor) handle design, you can see how easy that is to do.",
        "The price is a bit much but I figured that I’ve spent at least that much over the years on garlic presses that fell apart or were hard to clean. This garlic is very sturdy, easy to clean and works like a charm. The hopper is large so it can accommodate more than one clove at a time. I expect that my kids will inherit this garlic press it is so well made.",
        "Great!... but careful of your fingers! This is an excellent quality garlic press, however because of the handle curvature and overlap when closed you can easily pinch/crush your finger (which I've done several times).... sounds like an unlikely accident, just use a little caution when rapidly pressing a lots of garlic.",
        "HANDS-DOWN the best iteration of a garlic press ever created! You've come this far, I promise you, this is the garlic press you've been waiting for. Easy to clean, toss it in the dishwasher, rinse it off in the sink; there's no cavernous recesses that resist cleansing with this genius device, which is widely recommended, and my wife and I now know why - it's the best garlic press money can buy, period. DO IT.",
        "There's definitely a quality issue with this product. Upon receiving the order, the product broke within a week. We asked for a replacement, which was delivered soon enough. The replacement has lasted more than a year. We may be biased because we've been extra careful with it after the first one broke. One major drawback is that the cavity is very small. You can only press one garlic clove at a time. If a certain garlic clove gets too big, you will have to cut it in halves....",
        "This garlic press is just fabulous. The hardest part is getting the paper off of the cloves before you use the press. Put the cloves in the press, squeeze and you have perfectly minced garlic. You do have to clean the screen between each clove press but that is a small price to pay for the speed of mincing French garlic.",
        "it is not as heavy as i thought it might be, but it is well constructed, solid. what i like most about it is that it presses the garlic with the least amount of pressure and hand strain of any press ive ever used; incl oxo. i also appreciate that it opens up for cleaning, and i don't have to use my finger to dig garlic out.",
        "Pressing a garlic clove this weekend and the weld that holds the handle onto the base at the pivot point broke. Sure, the garlic clove was a bit stale but seemed odd that it would break so soon. Until it broke, we were happy with it. Sadly for the price I'd have a hard time recommending this option.",
        "I’m not sure about the negative reviews on this product, but I couldn’t recommend it any higher. I have gone through countless inferior presses. Oxo lasted the longest, about 3 years before it failed and I purchased this one. If this lasts twice as long, it will still be worth the added expense as it makes quick work on even some of the largest cloves. Better yet the garlic comes out almost minced as opposed to the paste most presses produce. One of my favorite culinary purchases.",
        "I'm really surprised that everyone's giving this such high reviews. I bought this press based on a Cooks Illustrated review. I find that much of the garlic extrudes backwards along the sides of the plunger instead of going through the die. My old press, that pressed and sliced, was far superior in my opinion. I had it for years but must have tossed it out with the garbage. I had the old one for ten years. I'll update my review once I get a new slice and press version.",
        "This press died on me a month after the 2 year warrant expired. Before that it was starting to fall apart and most of the garlic was coming out of the sides. Not worth the money, I'm going back to OXO.",
        "Finally a garlic press that's both sturdy and easy to clean. I've laughed, I've cried, it changed my life.",
        "I have a bit of arthritis in my right hand and this tool helps me have more control. It is the best yet. A bit pricey but worth it.",
        "This is by far the best garlic press we've ever owned. If you are buying a genuine Kuhn Rikon garlic press you will not be disappointed. You can easily press unpeeled cloves as well. Press screen pivots away from body for easy cleaning.",
        "I love this and use all the time. The hinges are a little flimsy so be careful. An easy tip is to smash the garlic with your chopping knife. This does two things. First it makes it easier to remove the outer shell and it also goes thru the screen easier.",
        "Works well, no need to peel the garlic. The skin won't go through the grater.",
        "Garlic presses aren't always the most rational purchase -- the \"right\" way to produce minced garlic doesn't require anything but a chef's knife. Many times, they're terrible to clean out and thus end up messier and messier until they're abandoned. This one is different - the press flips out easily and can be cleaned with a single swipe of the finger. The metal hinge is extremely durable, and the whole device fits perfectly in the hand. There's a small risk for people with very large hands of pinching one's hand but after some use it's easily to avoid this with safe hand positioning. If you need to produce larger amounts of garlic, this is your tool.",
        "Ok. I really hesitated to buy this because it was like 3x the price of other presses. But the first time I cleaned it, I knew it was worth the extra money. Plus they got all the rest of it right. Ergonomics, looks, ease of use sturdiness, etc. it recently repeated as America’s test Kitchen winner in this category and I can see why. And no I wasn’t paid to write this.",
        "Amazing product. Everything I hated about previous garlic presses (hard to clean, pain in the hand, no leverage, sprays out lots of clove chunks) have been resolved with this product. It has a levered press plate that multiplies the force making to run like butter. The dia fits tightly in the housing making it hard for unpress clove to make it out intact. And the way the pressure plate moves allows for easy cleaning. I had given up on garlic presses until now, this recommendation from America's Test Kitchen, and they were spot on.",
        "A good cleaver is easier. It's one of those gadgets that seems like a good idea but in practice isn't all that great. If you want to crush a lot of garlic, the garlic can get stuck in the gaps, clean up can be a pain when the skin gets stuck in the holes... it's ok, just not all that great.",
        "I've had a couple garlic presses before and this one by far is the best. but I was expecting it to be considering the price. I use it so often it was worth the expence. I love this garlic press and I'm expecting it to last a long long time",
        "Press is very easy to use and clean. Garlic comes out with little effort. Ergonomic design is great for pressing small to large quantity of garlic. Hand washing is fast for clean up.",
        "Like many of the other dissatisfied customers, my KUHN Rikon garlic press broke after owning it for a little of three years! When you pay nearly 50.00 for a garlic press you would expect it to last a lifetime! Like many other dissatisfied buyers, the rivet popped off the end of pin that holds the unit together! What a joke!",
        "I really do like this garlic press. It is large enough to crush several cloves of garlic at once. The shape makes it easy to do so as well. Cleaning it is easy, as it opens up wide so the you can get to everything. It is also dishwasher safe, unlike many others that I have owned. After hearing the recommendations from America's Test Kitchen, I went to go check this out. I'll admit, the price made me think a bit before purchasing this. In the end, I realized that I could either make my way through several barely passable presses, or I could just get one great press that should last the rest of my life.",
        "I have an older model of the Kuhn product, and this one is even better...the curve makes it easier to use, and the press itself on my old one has never wavered or broken...this is the best garlic press I've ever purchased",
        "As someone who has used one garlic press extensively for years until it wore out and needed replacing, I was totally shocked to purchase one that didn't even work. The garlic just built up in the press without any viable pressed garlic emerging. My fault for not taking the time to return it, so it's in the trash.",
        "Purchased in December 2016. We use this once a month or thereabouts. This morning, it broke and the pin popped out. Not happy at all, which is too bad because this thing crushes garlic like nobody's business. At this price point, I would expect more than a few dozen uses.",
        "Because the model recommended by America's Test Kitchen got so-so reviews on Amazon, I went with this one, which one of those reviewers recommended. (That reviewer said the ATK recommended press broke.) Well, okay. It hasn't broken; indeed it's sturdy enough to easily press through 2 cloves at a time! However, I find it awkward to use, as the extruding \"plate\" is hinged and flops around. And cleaning is no easier than other presses of similar design. I don't think it's worth the price. My next press will be of the kind that has a completely separate extruding plate that is more easy to clean.",
        "been using a 3 piece Italian Garlic press for 40 years. It works well but requires my superman hand grip. My wife has been complaining about the strength required, so I tried this one. It is beautiful y built and uses mechanical advantage well. It is easy to use and easy to clean. Because it is more complicated than my 40 year old, it is also slower, If I was a line chef, I would use my 40 year old for speed. At home, the KREGP is the choice, because it is easy to use and easy to clean, and I usually have the time. I suppose the only upgrade would be to a small food processor.",
        "I have owned a lot of garlic presses and to be honest, this one is a little pricer than most. However, here are so many pluses it outweighs the additional cost. The press is not flimsy - it has a solid build that will last years. The press is easy to use after you figure out the balance act of the opening. The garlic comes out finely pressed which beats my hand chopping and melts seamlessly into any dish you are making. No skin passes through this press and it is easily cleaned with a swipe of your finger, a rinse and air dry. Love it.",
        "I don't mind paying more if i get better result However this garlic press still gives you a smushed garlic paste that oozes from the sides just like the inexpensive ones, but unlike the cheap 1 I already have this is easier to clean and feel better built. However, i could not justify the price and returned it.",
        "I have owned at least 5 garlic presses and have problems or things I didn't like about all them. I finally decided to get the best one as a gift for our son. It would last a lifetime and is highly recommended by Cooks Illustrated. After using his, I was sold. I had an adequate press from Cutco, but was annoyed that it did an incomplete squeeze. This is so easy to clean. It presses the garlic completely. I don't need to peel the garlic to use it. I am so delighted with the functionality of this product and the sturdiness. It is not cheap, but is worth the money.",
        "This is perfect. A wonderful example of really thoughtful design. It feels substantial, is easy to grip, has a kind of heavy block that comes down on the garlic, and the screen lifts up to clean.",
        "This is the best garlic press, by far. Recommended by Americas Test Kitchen and it is very easy to use and while you still have to scope the \"skin\" when cleaning, the fact that the piece hinges out, allows for ease of cleaning and getting all the small bits of garlic. Pricey but worth it and you can put it into the dishwasher.",
        "Due to limited strength in my hands I have purchased several garlic presses over the years. Using the Kuhn Rikon Epicurean Garlic Press was effortless and so efficient! I wish I could give it 10 stars. A wonderful tool as a gift for anyone who cooks.",
        "Yes its expensive for a garlic press but after seeing what it can do and the ease to clean it after use i would buy it again. Highly recommended",
        "I have used many different garlic presses over the years, and none can compare to this wonderful product. It is so easy to use! Even though the instructions say you don't need to even peel the clove, I always do it anyway. The amount of crushed garlic that gets pushed though the grate is more than I've ever gotten before from all the other garlic presses, as it pushes all the available garlic out. And, it is SO easy to clean (by hand or via the top shelf of the dish washer). It is well worth the higher price and I highly recommend this item to any one who loves garlic. It is the handiest kitchen gadget I ownf!",
        "This design of this garlic press is very well conceived. It requires less work to press. I am also using less garlic to produce same amount of the minced garlic that I need. Cleaning is a breeze since the sieve hinges out. Couple things that might bother some people. One is since the sieve hinges out, you will need to make sure the sieve stay in place before you put garlic cloves inside. The other point is that larger clove of garlic won't fit, you will need to cut to half before put into the presser.",
        "I don't know what took me so long to upgrade to this. It's great and saves so much time. Also, it's stainless steel so no rusting. Easy to clean, easy to use. The handles are great and fit into my hand. I believe any hand strength would be able to use it. Highly recommend it. Don't know why some reviewers would say it's difficult to clean. You just flip it open and let the water run over it. The holes never get clogged. If one happens to be a little difficult, you just help it a little with the tip of a knife. DW safe. I love it.",
        "visited with our son & family for the holidays. They have a Kuhn Rikon European garlic press which I used and loved it. I use lots of garlic and was so impressed I bought this one......same as theirs. IT is the best garlic press I have ever used.",
        "Great design. Poor manufacturing. When I first bought this I thought it was the best designed garlic press I've ever had and I had a Zyliss for 30 years that finally gave out. About the tenth time I used it, it popped a rivet on the handle and now it's useless, and of course it was after my return window to Amazon. Looking for a better made garlic press but might just buy another Zyliss. This thing is a good idea but not well made.",
        "Basically my favorite kitchen tool. I use it constantly and clean up is insanely easy. It’s also very heavy and sharp so you don’t have to squeeze as hard as you do with all the others. Buy this!!!!",
        "My wrists were really hurting me when I used my old garlic press. I was concerned that I may actually hurt myself. So I did a bunch of research on google and youtube and this was the best garlic press on the market according to what I found. AND IT IS!! it works awesome and my wrists don't hurt anymore, my mother in law used it at my house and loved it - so I bought her one too! she loves it! It is worth the $$",
        "This thing is a miracle. It is super easy to clean, and super easy to press. It can be used on two normal size cloves, with the peel still on. I've used other garlic presses which hurt my hands, were hard to clean, or which had such small hoppers they took twice as long to use. Yes, this is expensive. But if you deal with garlic regularly (and you should!), this is the tool for you. You won't regret it.",
        "This is a well thought out high quality press. We have had a couple different garlic presses over the years and this one is easy to squeeze and most importantly easy to clean up. The design allows the screen section to pop fully open and easily clean the press out. Best design I have seen so far and the quality is evident in every other area.",
        "Ordered this item last night and received it today, Amazon you have really stepped up your game. I bought this product after doing research at America's Test Kitchen website and my OXO Garlic press finally broke. Although I have not used this item yet after a close inspection I know I will never have to replace it unless it gets lost. I use my garlic press nearly every day so it gets a lot of use and I generally press at least a couple of cloves at a time. My OXO lasted about 6 years and for the price I have no complaints although it was too hard to clean.",
        "My last garlic press was the same brand but they changed the design a little and that plastic wedge us SUPER hard to get to smash all the way down. Had my young, athletic son try as well and he couldn't get the garlic to press all the way through either. Disappointing!",
        "This garlic press is wonderful. Easy on the hands, it will take a large (not elephant garlic) clove with no problem. You can press cloves with or without skin. The size and consistency of the pressed garlic is great. As America's Test Kitchen reports, because of the size of the pressings and the preservation of oils from the clove used with this press, you get a much fresher garlic taste when cooking or when press directly into salads. The clean up is a breeze with the flip-out stainless steel basket. This is a pleasure to use and you will not be disappointed. Definitely worth the extra money if you like garlic.",
        "For a $45 press, I expect some longevity. Pin broke after a year, rendering this thing useless. I'm very disappointed. Obviously this is a common problem, and I'm very unhappy that Kuhn Rikon does not stand behind their product. Design Fail!!",
        "Expensive, but, it's nice. The pressing is smooth, and the flip out cleaning is great... Worth the investment, IMO",
        "Easy to use, treat construction, and the wife says the result looks and taste better than her other garlic press that just squished the garlic vice guiding it into the holes. A little big so it's not he most ergonomic for small hands.",
        "We had some old non stainless steel presses that leave black/grey gunk all over the garlic and were difficult to clean. I am really happy to have stainless steel. Now I do not worry about not getting 10,000% of my RDA of aluminum and zinc :-(. This is easy to clean too. Very happy with the purchase. I little too expensive to have two so I can have one in the dishwasher.",
        "Never seen any garlic press like this one. I was steptical when reviews states it will crush garlic UNPEELED, but it does and it does well and with ease! I'm having a grand old time, using garlic in so many receipes! SO easy to clean and it \"flips\" open and all the parts are exposed for easy soap and rinse. Very please with the quality of workmanship! Solid state, stainless, will provide (hopefully) years of use. I'm learning... to just buy a much better kitchen tool, whether an egg slicer or cheese slicer, just read reviews and invest a bit more, it saves in the long run.",
        "This thing is awesome, any negative reviews has to be from manufacturers defects, which is normal. But this thing is durable and made of heavy gave stainless steel and fits great in the hand, hands down best garlic press.",
        "This changed life for the better. If you believe in the pursuit of happiness, buy this tool. It will make you happy every time you use it.",
        "This has to be the BEST garlic press made! I can press garlic without peeling it if I'm in a hurry. When I do peel it, I get all of the garlic, not smashed cloves. I have two other homes and each one has this press even though it is pricey, it's totally worth it! I have spent $10-$15 on many presses before that did a terrible job so I figured I would never have to buy another one with this one! I love it! I always hand wash and dry it to make sure it stays new looking. What little leftover garlic remains can be easily lifted out for washing.",
        "My chef loves it! A success in the kitchen. This garlic press is sooo easy to clean. Up date : This has become my go to gift for hostess and housewarmings.",
        "not easy cleaning-- garlic squeezes out a little bit around the edges, so you need to get in there with a knife point n edge to get all the nooks n crannies free of garlic bits. easiest cleaning i found is to dunk it after use in water for awhile then to swoosh the thing around. other than that, marvelous on crushing garlic. built of truly corrosive-free high-quality stainless steel unlike most 'stainless steel' in today's products. really solid n heavy-gauge. built to withstand anything: like being DRIVEN over, seriously. Will outlast several generations.",
        "I have to say, I really didn't like it. It says it's made of silicone, but it really felt more like rubber. Specifically, it wasn't sticky like silicone usually is, so the garlic skin didn't tend to peel. I had to do it over and over again, and then just ended up removing the last bits by hand. I was disappointed as someone had recommended this to me. Trying the Oxo version out.",
        "I have been using this garlic press for the past month and so far I am very happy with it. Solidly built, easy clean-up, little watse and requires very little pressure. I bought this press to replace my old Zyliss press and this is definitely an improvement. The stainless steel construction should prevent the peeling and oxidization of the Zyliss. I have not yet tried it with ginger root, but am sure I will soon as it is advertized to work well pressing ginger. The only small quibble is that the basket sometines pops up when loading garlic, but this is the feature that also makes for easy cleaning.",
        "I got tired of how my Oxo press left so much of each clove in the basket instead of pressing it through, and started hunting for a replacement. I balked a little at the cost of this one, but since I use a lot of garlic and the reviews were so good, I decided it could be worth it. I LOVE THIS PRESS! Because of the comments on getting pinched, I just make sure I avoid that, and haven't been nipped so far. This press is easy to squeeze (and I have small hands with some aging issues), does a thorough job and is a breeze to clean. What more can you ask?",
        "Garlic pressing now is much better. Only small complaint is that because the part with the little holes moves, it can be hard to hold it still to put cloves in it.",
        "Seriously, I thought I had a fairly decent garlic press before but I was fooling myself. I had to apply a lot of pressure for very little results. Finally, I had to admit that the somewhat pricey garlic press I had purchased just plain sucked. After perusing Amazon and reading a lot of reviews I decided on the Kuhn Rikon Epicurean Garlic Press. Holy crushed garlic! This baby presses the garlic and leaves little but the papery skin behind. Added bonuses, it takes little effort to use and, due to it's design, it's very easy to clean.",
        "kind of expensive but it does the job and does it well. i didnt see the oxo brand one before buying this, or i would have tried that because of the lower price and similar good reviews. with that said i am very happy with my kuhn rikon. it is easy to use and pretty easy to clean it you have a dish brush or a strong jet of water. there is minimal waste and pretty much only the good part of the garlic will make it thru the press if you dont fully peel them.",
        "I bought this for my mother for christmas and she says its the best garlic press shes ever used. Very effective at pressing though most of the garlic and many traditional presses leave a lot behind. I just wish it wasn't made in china... I would pay double for improved working condition and environmental standards. But oh well, one can only hope Kuhn runs their facilities ethically. I should note that you'd be fooled in to thinking that this press was made in Europe by the quality.",
        "I was cautious when reading the less than five star reviews, but decided to purchase anyway and I’m quite satisfied with the quality, performance, ease-of-use and cleaning. I’ve owned a few other garlic presses in the past and this professional grade garlic press is no doubt the best. It’s a bit pricey but you get what you pay for. It’s very well-made, stainless steel and should last a long time.",
        "I've only used it a couple of times, so this initial enthusiasm may or may not change. It seems very sturdy. But best of all is the ease of use. My last garlic press was one of those self cleaning things. But I had to press so hard to push the garlic through. This takes so much less effort. For many recipes, I prefer the pressed garlic to garlic that is chopped by hand or in a food processor. This press makes that much easier to do. It is not as quite as easy to clean as my last one, but it is not all that hard. Over all, it makes for less work in the kitchen.",
        "I got all excited after reading the reviews and the Americas Test Kitchen recommendation. However, when this arrived and I tried it, I hate it. The garlic oozes our the sides every press, leaving whole slivers with the smashed garlic - a design flaw. And cleaning the garlic took forever without the rubber nubs I'm used to with my OXO. Not thrilled. Well built, but not well designed. Overpriced, poor results, and hard to clean. I'm returning it.",
        "This is the best press I've found. It is very sturdy - just fill the easy access chamber, close the press plate and squeeze. No chance of breaking the tool. Pressed garlic consistency is equal to or better than the others presses I've owned. Clean up is a snap since the unit flips apart to expose all the parts. Just wash off the debris and your done. If a hole plugs, just use a brush - a quick swipe and it's clean - no digging required. The downside, of course, is the price. To me, it's well worth the money since I'll probably never wear it out.",
        "Great crusher. Only issue is have is that The plastic handle flexes too much when I'm crushing garlic. I do pack a lot of garlic in to the bin, though.",
        "I love this garlic press so much I've purchased an extra for the motor home and I've purchased 2 for house warming gifts. It is so sturdy and works so well. Clean up is a breeze if you do it right after you've used it.",
        "I agree with the review that said not enough leverage. My wife could not close it to crush the garlic. I had to use two hands. It was either defective or poor design. We went back to our old press and threw it away.",
        "Could not be more happy with this press! Produces great results consistently. Also looks beautiful, the alloy truly matches the look of 18/10 flatware. The only gripe would be that there is one or two hard to reach places when cleaning, but nothing a bottle brush or similar can't solve. Overall, very pleased. Would make a great gift for any serious home chef.",
        "This is by far the best garlic press on the market. It is expensive but if you want to buy only one garlic press then this should be your choice. It is extremely well made and works with minimal effort in comparison to other presses. You can press garlic without ever peeling it if you choose. I have made multiple presses in a row without ever cleaning the press itself or peeling the cloves with no problem. It is very easy to load and clean. You will not regret spending the money on this press.",
        "Seldom do tools work as well as they claim, but this one does. I use a lot of garlic and all of it is in cloves. My wife tried this and gave it to me for Christmas. She said it worked well. I tried it as a skeptic; however, it really works! The crush is fine and very clean without peeling. However, I do recommend you use the silicone sleeve to peel it before crushing through this tool. (Read my review of the silicone sleeve peeler). Otherwise it will clog faster and frustrate you with \"Why did he say it worked so well?\"."
    ]
}