{
    "entity": "Garlic Presses",
    "text": [
        "Excellent garlic press, we have a large selection of amazon top rated garlic presses, and this one edges them all with its double leveraging action. Effortless pressing garlic press that is easy to clean. Ordering a second one just now.",
        "Works ok but a terrible design. Very hard to get pressed garlic off the press due to the curved design. Hard to clean as well. The original design is much better.",
        "This $35 garlic press broke after the 5th use. Don't waste your time with this product... just chop your garlic by hand. By the way Amazon gave my my money back ASAP. No harm no foul.",
        "Based on the reviews, I thought this would be a slam-dunk. But after using it, I have to say I wish the tolerances were tighter. Garlic still seeps out the sides if you press unpeeled. I often end up peeling the garlic to minimize this. It is built to last a lifetime, and very easy to clean. It's just not the miracle garlic press that everyone seems to think it is.",
        "I've bought a lot of cheap presses through the years . This is one that will be with you for a lifetime nice mechanics all SS engineered in Germany , it is built in China but quality control looks real good. Easy clean too",
        "It looks as though the attached blade will sweep the garlic off the press, but the blade is set too high. The pressed garlic ends up on the sides of the press or stuck between the blade and the press.",
        "This garlic press is by far the most effective I've used. I've had a nice press/slicer from Williams Sonoma for years, but it looks like it's corroding after light use and has always been terrible to clean. This Rosle is very easy to clean because the perforated piece pops up for cleaning, meaning you can peel off the remaining garlic. Additionally, it is completely capable of pressing garlic without the skin removed, probably in part due to its heft--it's fairly weighty for its size. I am confident it will not rust and know I will have this for years.",
        "This product is purported to mince large amounts, like complete garlic cloves. In fact, more garlic/onion/etc. squishes out backwards past the plunger. On the first use, the grill which is supposed to mince the product bubbled out so the flat plunger didn't even meet it. This resulted in clogging where far more garlic/onion/etc. went backwards past the plunger edges than was minced through the grill. Similar with cleaning--the flattened food on the mincing grill was terrible to clean. I have smaller mincers that work far better than this. This foolish thing is going in the garbage--where it belongs.",
        "We bought this in November, 2019. The picture shows - where the garlic sits before pressed popped right out.) Six months later, it is broken. We use this maybe once a week. The return window is one month....I wish it had broken in the first month; then we could get our money back. This is a pretty expensive press to break in six months with minimal use.",
        "I was really looking forward to receiving this, after I saw and used it in a friend's kitchen. When I held and moved the one I ordered, I was very surprised to find that the action was nothing like the one I saw before. The parts \"stick\" unpleasantly, even with nothing in the mincer. After a little research I found that these used to be made in Germany, but since 2016 they are made in China (which the label now states), and apparently they are simply not the same thing. This will probably mince garlic, but it certainly is not worth $40+. I returned it.",
        "Worked fine when it worked. We used this almost daily for about a month then it started seizing up when reopening. There is a spot weld attaching the pivot point of the scraper to the body of the press. That point broke and caused the scraper linkage to bind. Rosle has a lifetime warranty so I’ll have to find out how to rerun to them since Amazon returns are closed now.",
        "What was I thinking? I’m on a fixed income. My last garlic press was an oxo. After many years the black handles were slipping around and the metal starting to bend. There was some corrosion inside the press chamber, and from the get go it was a pain to clean. This press is more fussy and difficult to clean. The actual press box is smaller, and when you squeeze, the juice runs out of the press all over your hands, all over the place.",
        "I have had this garlic press barely 6 months. It just broke, I'm very disappointed.",
        "I make fun of myself for spending this amount of money for a garlic press. I do believe it is overpriced. That being said, I absolutely love it. It is by far the best garlic press I have ever used. The garlic cloves squish through nicely, without escaping up the side and it cleans up really well. I have small hands and, when full, the handles are a little far apart, but it isn't really a problem. I just use both hands, when necessary.",
        "I'll start with the negatives, since there are only really two of those for me: 1) The round handles are not the most comfortable ever. I like them aesthetically but they could be more comfortable. 2) It takes a bit to learn how to hold the screen bit with your thumb while you load the press. Works perfectly when you do, but non-obvious until you figure it out. Other than that: Terrific. The best press I've ever used. Goes in the dishwasher. Cleans easily by hand. Does a great job of pressing garlic.",
        "This had good reviews, had a good write up, came with a warranty. However, it broke within three months, Amazon closed out the sale and the manufacturer is not communicating. I'm stuck with a broken press and no warranty as promised. Not very pleased on this end. Manufacturer has made contact and is fulfilling the warranty. Much happier now!",
        "I was expecting it to be better. The handles are not very ergonomic and the scraping bar that scapes the pressed garlic works just so so. It leaves a lot of garlic still on the press that goes to waste. I’d prefer a press with a flat front that you can scrape on the edge of a bowl or the back of a knife. The opening screen does help with cleaning, but it not the easiest model to clean that I’ve worked with.",
        "It's a real solid tool! I was looking for the OXO garlic press but it looked like they changed the design. I like the old design better. So I decided to purchase this on even though it was pricier. Love it! It has a fold-out screen (which I accidentally discovered) for easy cleaning. You don't need a lot of force to press the garlic through. I've only used it for garlic, but will try it with ginger next time.",
        "This product is very sturdy and presses garlic well. However, I find it way too hard to remove the crushed garlic because it gets stuck on the sides of the press. It's messy and it wastes precious garlic. It's useless if you just want to crush one or two cloves as most of it ends up stuck and hard to remove. I am still looking for the perfect garlic press.",
        "Harder to clean than I expected. Probably will outlast me though.",
        "I know some chefs say garlic should not be pressed, but there are some cases, like salad dressings, where it works well. This has been fantastic. You just give the clove a whack with the side of your chefs knife, unpeel it, and put it right in. So much easier to use fresh garlic without dreading the clean up.",
        "I am amazed that I paid 40 freakin' dollars for a garlic press! After owning 4 other garlic presses, I found this one to be the best. I did my research and this press scored highly.....and I agree with the high scores. No other press I've ever used works this well......I didn't believe that it would work OK without peeling the cloves, but it does....and it does open well for cleaning, and no problem putting it in the dishwasher either. I will buy at least one more as a gift........a great way to introduce those who want to use fresh garlic into their cooking....it will spoil them as it is easy compared to other ones.",
        "I cook every day at home, as well as occasional large meals for a local veteran's charity. This garlic press works wonderfully, both for large- and small-scale cooking. I find that the cheaper ones made of pot metal or cast zinc react with the garlic over time, causing corrosion. This is all stainless steel, and even has a part that scrapes the screen to remove the crushed garlic. I love using this, and usually don't even peel the garlic first.",
        "Bought this after reading reviews of numerous garlic presses, on Amazon and other sites. Not inexpensive, however if you really use pressed garlic cloves often its worth it. My old Oxo lasted for years, then a couple pieces broke off; this is a step up the price and quality ladder - even easier to clean and very very sturdy.",
        "I was pretty disappointed with this garlic press considering the price. It's very heavy and requires a lot of force to use. It only puts about half the garlic clove through the holes and leaves the rest smashed up like a pancake on the other side. It doesn't work well with more than one clove at a time. It claims to be able to press the garlic unpeeled but when I tried that it was a total disaster with bits of peel smashed into the garlic. The only good feature is that it is easy to clean.",
        "This is an industrial style, heavy duty garlic machine. It has great leverage due to the extended handles and is a little difficult to clean, but the way it works out ways the extra work needed to clean it. Very heavy duty and well-made. I use it with peeled and unpeeled garlic alike.",
        "Its compound lever action makes this press work with less squeeze force required. It's garlic \"hopper\" is also slightly bigger than some others. Taken together, those features make crushing large amounts of garlic easier and faster. Its crushing screen also folds out for MUCH EASIER cleaning than other presses.",
        "Awesome garlic press. It doesn't just extrude the garlic, it minces and mashes it. VERY easy to clean. I wish it were cheaper but i have no regrets.",
        "This presses the garlic and cleans off the surface in one swift motion. It opens up for extremely easy cleaning. This is the best garlic press I have ever had. I have had this garlic press for about 5 years now. I liked it so much that I bought this one for my son when he started to cook and be on his own. I doubt this will ever break but if it does I will buy it again.",
        "This is not easy to clean . Garlic gets stuck in the hinge area. I miss my old self cleaning one that flipped back and pushed all the garlic out of the holes. I use garlic a lot so I will be replacing this.",
        "This is the best press I have ever found. Easy to clean, strong, multiple cloves and it looks great. So may presses get ugly/chipped after a while. I bought several of these as gifts after trying one out in my own kitchen. I have tried many types. This is my go-to",
        "Bought this several years ago and it has been the best garlic press I have ever used. It is still in the same condition as when I bought it. Reduces the time spent on mincing garlic and you can even use it without peeling the cloves. It will most definitely last a lifetime. Will be the last press you every buy. Sturdy stainless construction with excellent engineering of all parts. Like the Mercedes Benz of garlic presses. You pay more initially but because it will last forever, it's a bargain!",
        "This presser gets lots of garlic stuck to it in between various parts and garlic is wasted. It crashes garlic effectively but it is hard to get the garlic out of it. It is stainless steel of a good quality and it looks nice. It is hard to find just a simple presser made of a good material. This one is from a good material but maybe to complicated.",
        "I have tried a few other garlic presses that just smush the garlic and don't push it through the holes. This press actually works! It cleans easily also. I recommend this one.",
        "This is a good one, better than my Mitsubishi, and the Sony ones I have. It’s similar to the adidas version I have but not as smooth. It works perfect every time and cleans up nicely. It has nice curves also if you’re into that.",
        "Works well. Built well. I would by again. It seems sturdy and strong. It’s just a bit difficult to get all the garlic pieces off the thing. But I’m really being picky..",
        "I hesitated in buying such an expensive kitchen gadget. But I was breaking many cheaper presses because they were made of cheap (white?) metal and coated with chrome or some such. I'll bet I spent as much on junk ones as this one. I've used this several times now and it's worth the money. The 'gearing' makes the crush easier. I make it a point to clean it immediately after each use. The well is a little smaller than others that I purchased but the yield seems to be more. Bon appetit",
        "Had this for one month, just a few uses, before it broke. Most expensive one I've ever bought (replacing a great one I had for 15 years) and was sadly, not worth it. Not sure how to return it at this point.",
        "This garlic press is amazing. Easy to use and clean. Quality investment and upgrade. I do peel the garlic first, but that’s easy with the knife-smashing method. I think I like adding garlic to things even more than before.",
        "I think I'm just another happy owner. It's a pleasure to give my wife a hand with pressing garlic now. It beats me why there are so many moving parts - you have to hold some of them with your thumb. Maybe I do not understand the whole idea (which trained chef would do), but anyways it operates just perfect.",
        "There's garlic for us will literally do anything. It's indestructible and mashes multiple clothes of garlic at once, you don't even have to take the skins off. I also use it to mince lemongrass. Hands-down The best garlic press in the world.",
        "This was recommended online as the best garlic press ever - the nifty design makes it the easiest to clean of any I have used, although it's still kind of a pain, squished garlic is sticky! Would recommend for sure.",
        "This garlic press is great. Minces garlic with ease and the scraper helps to clear the pressed garlic from the device. Some garlic does get passed the press on the sides but not too much. Cleans up easily.",
        "Manufactured in Germany, not China as many reviews state. I just received mine on 6/17/2020. Sticker clearly states Germany. See photo.",
        "When pressing the garlic I noticed that you need to scrape off the garlic from the grate which the roller left behind. Too much time to retrieve minced garlic out of the sides, top and crevices . Returning and ordering the regular garlic press without the ginger feature.",
        "Have used this a number of times now. Very easy to insert the garlic clove and squeeze. Cleaning is OK. My previous one had an inverted flip that had little posts to punch through and loosen what was in the chamber, which pushed it right out. This one does not, but the basket does flip clear, you just have to manually pick it out with your fingers. But otherwise, it is beautiful stainless steel and does the pressing part very well!",
        "Truly amazing and life-changing garlic press. Until I bought this garlic press, I was always frustrated by the amount of force required to use the presses and by the effort required to clean them. This one seems to defy physics and requires such a minimal amount of force/squeezing compared to all other garlic presses I have tried. Also, the garlic press has a middle layer that swings outward and allows for very easy clean up. Feels very sturdy/solid and seems to be of the highest quality. This is also a much better price than I have seen in stores. Thanks for an exceptional product at a great price!",
        "I'm not sure why this is getting so many great reviews. It's easy to clean but I have a hard time getting all of the garlic to press through. If you have tendentious it's not the press for you.",
        "If you're like me, you spent years looking at this in stores and said to yourself, \"Who in the world is crazy enough to spend forty bucks on a garlic press?\" Then, after finally buying a few years ago in a moment of weakness, every time I use it I say, \"Why did I wait so long to buy this amazing tool?\" Buy it. Use it (It's so strong that you don't even need to peel the clove if you don't want to) Clean it (Wow, that was easy!) Love it. Pretty much true of all Rösle products, btw.",
        "I don't know how many garlic presses we've broken over the years. This one seems to be holding up well. Good quality.",
        "This is a very functional, very high quality product. I works really well and it's easy to clean. It feels solid i the hand. It's a pleasure to use. It doesn't love unpeeled garlic cloves, but that doesn't bother me. I would have given it 5 stars if the basket were bigger, it only holds 1 medium sized clove. Highly recommended.",
        "Very easy to use, very efficient, and very proficiently chops the garlic. We couldn't be more happy! It is extremely sturdy, with no worry that it will break. It has been a game changer for us--and we cook with garlic ALOT. Definitely highly recommended!",
        "I recently visited friends in FL and they had one of these garlic presses. I loved it and ordered one immediately on return home. The one I received is slightly different from the one I used. I put it in the back of my drawer and retrieved the Swiss Zyliss Susi I have been using for 25+ years. Ahhh, much better.",
        "This is an excellent product but came apart after only a few uses. I'm not sure how to contact the manufacturer but will update review after seeing how this issue is resolved.",
        "Love it. The little arm to clean garlic off works yet garlic still finds a way to stick on through and anywhere. My guess is that you could do without the little cleaner arm and use utensil of choose to do a better job of clearing material away. Squeezes ginger nicely too. Only ginger juice. No ginger pieces such as when you squeeze garlic.",
        "The tool works well but is a bit awkward to empty out. Outer wise good heavy tool.",
        "This does its job, but I wouldn't say it is any better than others out there. The multiple pieces that come out makes it easier to clean but kind of a pain handling it because everything can be flopping around.",
        "While this is expensive, it is the last garlic press you will ever need to buy as it is sturdy, well built, and quality exudes throughout it's design. Very happy with this purchase and in hind sight would do it again!",
        "As with the other reviews, this is the Mercedes of garlic presses. You can jam a bunch in, easy to clean, and probly wont ever break",
        "My love/hate relationship with Garlic now finally has come to an end (love to use them in food preparation, but hate to peel them), I crush them so easily now with the Rosle Garlic Press I think I might have been a little too liberal in the garlic-using department..the product has a nice weight to it, and the garlic chamber can be flipped out for easy cleaning (this is the best part, because this was an annoying issue I had with my other garlic presses).",
        "The best garlic press I've ever seen! Easy to clean. Easy to press. What more could anyone want? Worth the extra money.",
        "With the leverage action it is really easy to press even multiple in peeled cloves at the same time. I clean mine in the dishwasher.",
        "High quality garlic press would recommend to any garlic lover",
        "I was hesitant to purchase this garlic press because of the price, but it is worth every penny. I liked it so much I bought one for my daughter. The sliding mechanism design is not typical of usual garlic presses, and it is able to extract the entire clove with one pass. I liked it so much I bought one for my daughter.",
        "Very solid and all the parts stay attached during cleaning. The pieces come apart but stay attached for cleaning. very good design.Get it, you will love it!",
        "LOVE this garlic press.... So easy to work with, feels great in the hand, cleans up easily, and good quality. If you love garlic, this is a \"must have\" in your kitchen. Highly recommend it.",
        "Truly spectacular tool. Worth the price - great for a wedding gift",
        "There are garlic presses and then there is the Rosle. Renders plump, firm cloves of garlic into a juicy, pulverized mass with a satisfying crunch that could only come from the mind of an obsessed German industrial designer. As beautiful as it is functional, the stainless steel press crushes so well, there is little pulp left to clean. What remains is removed easily with a soft-bristled toothbrush and some dish soap. Expensive, but likely the last garlic press you'll ever need to buy.",
        "The Rosle garlic press works great, fits all the criteria, as do all Rosle products",
        "I got this for my mom and she can't stop talking about it. She LOVES it. Says it's the best thing ever and plans on buying another one just in case this one ever wears out.",
        "Fabulous best press we have owened Quick Easy to press Simple to clean *we do not put in dishwasher, I think you can but we do not.",
        "Put whole, unpeeled cloves in. Squeeze. Use garlic that comes out. Rinse in sink for a few seconds to remove remains. Repeat. It might be expensive, but it will last a lifetime. I've given this as a gift multiple times with great results. Everyone loves this press, including Cooks Illustrated.",
        "Heavy-duty garlic press: can put in 1 or 2 UNPEELED garlic cloves, give it a squeeze & out pops finely minced garlic! No more papery peels all over your fingers & kitchen. Also, the inside opens up for easy rinsing under the tap (but it all still stays attached so no loose parts). Will definitely be using more garlic in my cooking; this makes it so easy to use fresh garlic! Great gift for yourself and other cooks.",
        "I bought this most expensive garlic press, hoping to get years of use. However, after using it for three months, hinge pin came out and got lost. Poor design! I would not recommend.",
        "The product is heavy and cuts right through the garlic without needing the strength of a body builder.",
        "This is the best garlic press bar none. And it's 10 bucks cheaper on Amazon than in the my local kitchen store. Rosle makes good products that will last.",
        "FINALLY a garlic press that DOESN'T BREAK when I squeeze it! I have been through easily 20 garlic presses, and every damned one of them breaks if you are squeezing a reasonably sized clove of garlic. This one is smooth, easy, effective, and easy to clean!",
        "Of course I had a stroke over the idea of paying so much for a garlic press. And then I used it. Now I wish I had bought it years earlier. Can be used without peeling the garlic, and cleaning it is a breeze. No more toothpicks! It's pretty much the last garlic press you'll ever buy.",
        "Easy to clean and use, sturdy, and is aesthetically pleasing.",
        "I have tried many garlic presses - cheap models, grinding ones, one where you rotate the top and bottom pieces in opposite directions....Either they broke, were too labor intensive to clean or just didn't work. This one is solid and effective. The holed press piece flips out for easy cleaning. I've had this for 3 years of almost daily use and it's good as new.",
        "Best garlic press ever! You don’t even have to peel the garlic. I like it so much I have purchased for friends as gifts.",
        "After battling with a lot of other garlic presses we started to cut garlic with a knife. This is expensive for a kitchen gadget but worth it in terms of time saved, summation of other less effective (eventually breaking) substitutes, and no more garlic smell on your fingers. Splurge buy it and feel good about all the time you save, money you eventually save, and the way you smell",
        "Easy to use .Easy to clean. Works great. Worth every penny. Quality made.",
        "A heavy duty product that crushes garlic so easily and is so easy to clean. I had read about this on Food and Wine, and it is all that it was cracked up to be!",
        "One of the best Garlic presses I have ever owned by the simple fact that cleans so well and fast. It is a very good quality. This is the third one as I bought one for my best friend and one for my mom.",
        "Best garlic/ginger press of all time! Very sturdy, and easiest to clean ever! Highly, highly recommend!",
        "Every cooks tool in my kitchen is Rösle. Undeniable craftsmanship (but i think it should still be made in Germany...IJS) the weight and precision is great. I hope I get years worth of use with it as I have with my other tools. Highly recommend.",
        "Nice weight, doesn't feel flimsy like others. Love that the mincing head swings out for easy cleaning.",
        "Solid construction, great design. I love that it’s stainless steel as well.",
        "I have used these for years. They rinse clean and work better than Oxo or any other brand. Great gift for cooks. The extra money is worth it.",
        "While this garlic press is extremely durable and strong, it is every hard to clean. I actually looked on youtube for hints on using it. Will it last forever? Yes. Will I use it forever, I'm not sure yet.",
        "I saw the same product (manufacturing and all) in a high end cooking catalog for 25% more. For people who cook a lot with garlic this is a great kitchen tool.",
        "Ness garlic press ever. Bought this one as a gift, still using mine for over ten years.",
        "I am surprised by the positive reviews on this product. It is very heavy. It doesn't effectively crush garlic cloves with or without the skin, and it's an even bigger mess with the skin. Not enough garlic nicely chops, and there is a lot of wasted garlic and clean up after a crush.",
        "I use a lot of garlic and have tried various types of tools for it. This is by far the best. I even use unpeeled cloves and it still squeezes out the perfect amount of minced garlic. Cleaning is a breeze--no more poking toothpicks to clean out stuck pieces. Also, you don't have to be Hercules to get the most of this tool--it requires very little effort.",
        "I have been cooking for 30+ years and have probably gone through about 7-8 garlic presses. If I had this one from the start..it would have only been one. This is worth the extra money...it is by far the very best garlic press ever made. I love it so much I don't even put it away...I leave it on the counter with my wine opener where I can easily reach it!",
        "It's crazy, but you do have to spend this much for a garlic press. I make three gallons of pesto every year, and I've broken four different presses. There either aluminum, cheap pot metal, or have some terrible hinge design (Zyliss and Oxo to name a few). I give the Rosle a four star because of it's design for very large hands - not very ergonomic. Check out the Kuhn Rikon. Either way, stainless and a hinged drop out sieve is way to go for any garlic press.",
        "Out of all the Rösle kitchen utensil's I own, this is the best designed and post useful. It's easy to clean and easy to hold. This is more of a \"show piece\" for your kitchen, so leave it out for guests to look at and Oooh and Ahhhh over! ;)",
        "Very happy with the Rosle Garlic press. It replaced a garlic press I had from the early 80's. The Rosle garlic press is very nice, easy to use & clean. It has a nice look and feel to it. I would recommend it.",
        "Awesome! Been using it for a year now several times a week. Built very well and easy to clean"
    ]
}