{
    "entity": "Biscuit & Plate Joiners",
    "text": [
        "This is a great product. One of the first items I ever bought off of amazon. I have been using this for 10yrs now. I also use the Kreg pocket hole and the Festool Domino. Most people can not afford the Domino and this unit has served me well. There is still a place in my shop for this tool. I bought the 1000 assorted biscuits with this and love having the different sizes. I just bought a batch of FF size biscuits to further enhance the usefulness. Definitely recommend.",
        "Super plate joiner. I have wanted one of these for years. This model cuts multi-sized slots depending on how \"deep\" you set the blade. One thing I wish I had known...I purchased the smallest biscuits possible (size FF), which require a special 2\" blade from Porter-Cable. Those blades run $60+ a piece, so watch out for this.",
        "Firstly I’ll get this out of the way, the dust bag doesn’t work so well, I found it causes the bag to jam on the deepest cut setting. Okay complaint over. I love this biscuit joiner, it doesn’t jump like some other discount joiners when you fire it up, so it doesn’t wander off the mark. It also has an adjustable fence so you can change the height of where your cut will be, which is great for those more odd cuts that happen more often than you’d think. If it weren’t for the clogging issue this tool would get 5 stars hands down.",
        "Love it. It is so much better than the 30 year old Porter Cable I had, sent it to my son. The only problem I had was that the tool fits too tightly into the case and the Non-Slip material on the face was damaged. I altered the case to make more room and sent an email to PC telling them about the problem and they immediately got back to me and sent me a replacement part. Just PSA glue so very easy to fix.",
        "The product cuts biscuit joints well. It came with a bag for dust collection but the clamp that holds the bag to the joiner was to large. I ended up zip-tieing the bag on but shouldn’t have wasted my time. I used the joiner for dozens of cuts and NONE of the sawdust went into the bag. The saw blade shoots the dust everywhere. This is a great tool but only if you use it outdoors since there will be sawdust flying every where.",
        "The plate joiner itself is great, works great. I bought the tool because it says it will handle FF size biscuits and the product description says it comes with 2 bits which includes a 2\" bit for the FF size biscuits. The item I received did not include the 2\" bit and I could not locate any way to contact amazon to get this straightened out. I ended up having to purchase a 2\" bit separately for $70. Not what I was wanting. First time I've had the trouble with Amazon",
        "This plate joiner only lasted for 5 years with occasional use until the gears in the head stripped out effectively rendering it useless.",
        "Got this for my husband for his birthday and he was elated. As far as I understand this is a step up from using a Kreg Jig for making furniture. My husband builds as a hobby and his skill level has grown immensely so I wanted to get him something to take his building to the next level. I added the buscuits in that are an option to buy when purchasing this tool and he was very excited. As a wife who just barely understands half the tools my husband owns I hope this helps another wife/girlfriend looking to find a nice gift for someone who likes to build.",
        "Although I've owned this for a while, I've only recently put it to extensive use. Used this the join some boards for a shelf on a table I built. Much better than using dowels or Kregg joints. The Porter Cable unit is intuitive and easy to use, and the results of using this to keep edges aligned results in furniture grade layups. Wish I'd gotten it sooner, would buy again; would recommend.",
        "Very dissappointed; the item seems to be faulty because when I turn the blade manually, it scrapes the housing. I have not operated it for that teason and I am going to return it to Amazon for either a refund or replacement!",
        "This is a great joiner. This is my second joiner, my first being a small Ryobi. While the Ryobi was fine it was limited by the biscuit sizes it would cut for. I may still keep the Ryobi just to have one set up for small stuff and use this one for bigger stuff. This Porter Cable is a breeze to use. Setup is easy, but getting dead center take a little Trial and error, but no big deal. The tools settings get you reasonably close. The tool was easy to work with and I love it.",
        "The left and right plastic pivots for the Type 1 and 2 models will fail with even very light use. Because those parts have been discontinued, your $200 investment is now worthless. Porter Cable used to mean quality, but no more. Very disappointed.",
        "Used it for the first time today, bolt that holds the blade on broke.",
        "If you have not taken the biscuit plunge (pun intended) then you need to. Biscuit joinery is the fasted way to put stuff together. I now try to figure out how to make every joint a biscuit joint even if that means making the wood a bit wider than I want! The bag does not do a good job of catching the chips. I hang by shop vac hose on the outlet nozzle and that works perfectly with no chips hitting the floor so now the tool is very clean to use too. Tool is light enough to use with on hand so you can hold the work piece with the other. Cut quickly with little force required.",
        "Well made and designed. My pic shows how I set it up with my dust extractor. The Mikita Sander's dust hose fit perfectly. I just had to swap ends and jam the other end in my 3 inch hose. Absolutely no problems and no clogs. Update to answer question about set up for 2 inch board. Set to 1 inch with knob on the top and then Lock in place with knob on the side... see last 3 pics.",
        "So far so good. I had debated on it for a while, but had several pieces I was making that needed biscuits so I ordered it. It’s well made, easy to use, and accurate. I don’t think they could have done chip collection differently simply because of the size of the unit, but it seems a little restrictive. Great little machine, time will tell, but I like it.",
        "I bought the plate jointer because it had the highest reviews in Wood Magazine. I found it to work very well with many features to help making biscuit joints in many projects. I bought it specifically for a very cumbersome glueup. I needed precision lineup of my parts. It met my needs.",
        "Lots of useful features! Well made. Dust collection bag is wonderful. Bought this one because you can change the blade to the much smaller blade to allow for joining 1.5” face frame pieces. Worth having this one and another joiner with the big blade in it if you want to make a lot of face frame joints large and small.",
        "Still like this biscuit joiner, best for the money spent, love it for the smaller projects, just make sure you use a dust collection as the bag and chute tends to clog, I use a Makita 12 gal. with Makita smaller connectors, practically zero chips anywhere. Next I’ll purchase the mortising Festools Domino Joiner🧐",
        "I really like this tool. My friends and family always ask me where the nail/screws are to hold together my projects and are always surprised to see that its held together with glue and biscuits. In fact I have already talked a few people out of using nails/screws by lending them this tool. They always tell me how nice the tool is and how easy it is to use. I have no doubt this tool will last a lifetime. It is very well built.",
        "If you want to get the most bang for your buck you can’t go wrong with Porter Cable. I spent a lot of time researching the various biscuit joiners and this one was the goldi-locks; not too expensive, not too complicated, nice 135deg. feature- Just Right! (Try not to think about the fact that they’re a subsidiary of Stanley Black &Decker now - PC pioneered the portable tool market)",
        "Very good biscuit joiner. Height adjustments are easy to make and the center of a 3/4 board is marked for easy reference. It has a spacer for easily doing double biscuits for added strength. Dust collection bag clogs easyiy and must be emptied frequently.",
        "I purchased this plate joiner two months ago, expecting I would be able to use it right out of the box. I discovered the bag does not fit the discharge end of the deflector nozzle. This was reported to Porter Cable and they sent a different bag, this bag did not fit. To make a very long story short, I still do not have this issue resolved even after they sent a third bag. The plate jointer is useless if you can not capture the dust and I would like to be able to use the bag and not a vacuum. I would not buy a model 557 unless I was able to attach the bag to the deflector myself.",
        "Nice tool. But immediately dust port clogged on second biscuit. I took a shop vaccum adapter ($10 at Home Depot ) cut off the sqaure plate and first stepped size, then hose clamped it onto dust shoot, and clipped the bag on the end of that. Been working all day with no clogs. Can't seem to add more than one pic though, but here's the idea. The initial problem is the bend in the porter cable adapter to the bag.",
        "This item is clearly USED. Scuffs, and the grip tape is tatterd. C'mon, I spent 200 on a NEW product, excited to be the first to cristen it.",
        "I have been waiting for justification to buy a biscuit joiner and finally came up with one. Build a customized quilting table for the wife. This unit does exactly what it's supposed to do, cut precise depth slots for biscuits. It comes with a duct collection bag that I will probably never use as the dust port fits my shop vac just fine.",
        "Works very well with the on exception that the throat of the dust collection tube gets clogged all too often. It may work better with a vacuum connected. But the accuracy and ease of use of the machine make the machine worth it for me and my applications.",
        "I found this joiner to be easy to adjust and convenient to position and handle during the cut. The handle positions, tool weight and other relevant factors all positively contribute to the ease of use. I also like the abundance of small details that add confidence to the creation of the crisp, clean cut and assurance of it being in the correct position. I had seen other reviews complaining a bit about the noise, but based on my experience with the joiner I fundamentally do not understand them. It is certainly not loud (even my wife, who is very noise sensitive, thought it was surprisingly quiet). I am glad I bought it and recommend it highly.",
        "Started getting into custom woodworking as part of my remodeling business. First use of this was a small table top. Setup was easy (RTFM), and worked well. There is a little variation in the top-to-bottom location of the biscuit grooves but I expected to have to sand the top smooth anyway. As stated in other reviews, the dust bag is useless. It clogs up immediately. At least the dust port shoots the debris a little to the side. Second project was a 14' x 3' cherry bar top. Again, required some sanding but came out awesome. Checked back on it a year later and it was holding together very well, no signs of cracks or failed joints.",
        "Works but motor makes grinding noise. Orders another and returned this one to Porter Cable and the 2nd one also sounds bad so I am returning to amazon. Ordered the makita and it sounds and works like it should.",
        "Saw how to use one on a U-tube video. The instructor was using this particular model. I purchased the same thing. Seem to be a very good quality device. The only complaint I have is that the discharge port into the bag is too small: it clogs virtually every biscuit. Apart from that the biscuit joiner is quite nice.",
        "I bought this joiner to use ff biscuits. The description stated the unit came with two blades. Not so, only the larger blade. I needed to purchase the 2” blade separately. As to function of the joiner, it was flawless and performed very satisfactorily. Were it not for the misleading description, I would have rated the joiner at 5 stars.",
        "Never used one before. After 5 minutes on YouTube I was installing shelves. Only weird thing is the non-slip tape that was just peeling right off.",
        "Have made several good pieces with this tool from step up stools to full out custom exotic wood cabinets. Never had a problem with the tool or its use on wooden projects, have cut 45's and 22 1/2's for frames and homeade columns and never a complaint. Cut your slots, dry fit the parts, put on the titebond glue and clamp up the pieces. I sometimes put mine on a piece of 3'x3' plywood and a block on either side to hold the tool dead still and not slip to the side, this can and does provide very good accuracy if you need the extra help. Overall an excellent tool for joining wood tightly and accurately.",
        "have used for building bathroom vanity cabinet, game board and entry bench and has worked flawlessly with all projects. would absolutely buy again. Price reasonable.",
        "Very Porter-Cable in quality, as expected. The motor and jig frame are very heavy duty and I am sure it will join panels for hundreds of cabinets easily. I do have a suggestion though. Many people, and myself included, let the wheel stay in the machine way to long. Keeping a fresh sharp cutting wheel, it will perform much better.",
        "Makes accurate cuts, thanks to the all-metal guides. Don't cheap out and buy one of those with a plastic guide. Nothing more annoying than biscuit joints that don't line up properly. Makes accurate cuts and is pretty easy to adjust angle and offset.",
        "Used this to glue up a very large dining room table top made from extra thick cypress lumber. I used a double stack of biscuits to add strength. Dropping the plate so I registered from the top of the wood, I was able to make sure my glue joints were almost perfectly even. This means less sanding. For the money, I don't see how you could do any better. This saved me much headache and time. Don't know how I survived without one so long.",
        "This tool is pretty cool. Pretty easy to use. I made my first set of cabinet doors and they turned out well. Seems like a high quality tool.",
        "Great reliable tool. Used to cut extra grooves in oak flooring and saved many feet of wood I may have otherwise would have needed to dispose of. Instead had only a small 5 gallon bucket 1/3 full of loss out three bedrooms of flooring. Adjustments were accurate and tool has a high quality design. . . . . . . . . . .",
        "Bought two of these for each of my sons as a Christmas gift. They Absolutely love them and use them almost every weekend. Quality is awesome and tutorial is very detailed",
        "Very well made and functions beautifully. May be made in Mexico but the quality is still top notch compared to most power tools these days. Now if I could only solve the buyers remorse of not actually ever needing to use biscuits....",
        "Bought it to put together my first desk build. Worked great and was set up right out of the box. The storage case is nice. I love this took, wish I would have bought it before I bought a Kreg Jig. It's no Festool Domino, and I wish there was a dialing attachment or something, but has worked great for me.",
        "for a pro tool I'm not impressed. The left side of the fence has about 1/32nd inch of play which equates into a poorly cut slot. Returned and will try something else.",
        "I really like this biscuit jointer, it works great except if you try to use the bag attachment to keep the dust contained it get clogged really easy. The dust shoot is narrow and doesn't connect to a dust vacuum well.",
        "One of the best tools I've bought. Love it so far. Previously I've been using pocket screws for glue ups or just clamping laminates. This gets boards \"dead flat\" with each other. Minimal sanding required. The chip collection is an issue as others have mentioned but I got an 1 1/2\" rubber fernco fitting and a 1 1/2 to 1\" pvc adapter and I just stick the shop vac into that and no issues. Just attach the 1 1/2\" fernco to the adapter supplied.",
        "I purchased the 557 Porter-Cable biscuit joiner a few months ago, and find it very capable. I have had no problems. The power it has is very adequate. I like the fact that you place the fence on top of the work piece to make your cut, as compared to joiners that use the bench surface. This helps to insure a flush fit on the top face of your work. I also wanted to note that the earlier problem of a mis-aligned fence has been solved. I have not found any mis-alignment at 0 degree or any other degrees. I think they have solved that problem way back in 2001. Sincerely, Randy",
        "Excellent tool-head and shoulders above the competition. The case is very rugged and all the component parts of the Joiner are well made. Adjustments are very simple to make and the tool is more versatile than cheaper models. It's a great tool for a serious woodworker-you will not be disappointed!",
        "I am a Porter-Cable fan. This plate joiner did the trick on my latest project, a book shelf. I used it to attach the face frame to the cabinet. Good quality tool with a good look. The feel of the tool in my hands conveys quality and performance. You can't go wrong with Porter-Cable.",
        "I've used the plate joiner for several small projects and it has worked well. My only real complaint is that the dust collection bag does not work. If it is attached, chips get blown out of the front of the tool. Best solution is to remove the bag and point the chip deflector towards the floor and then sweep up afterwards. I bought this too instead of the DeWalt version because it had a larger angle range for the guide. (0-135 instead of 0-90).",
        "Prior to buying this P-C biscuit jointer. I had never used one before. Now I use it regularly. I love it.",
        "Read reviews of joiners before I bought one and this seemed to be the best. Tool works great so far on some simple things. Have not tested it really yet. However it turns on well (no kicks), is easy to position and the grooves are perfect. Ask me again in two months.",
        "No issues with this excellent tool. First attempt at cabinets, wall mounted and a router rolling cabinet; hopefully my skill will continue to refine!",
        "Love this tool! Hate the bag. Wear goggles and make a mess.",
        "Poor design, after using this tool for only an hour or so the bolt holding down the blade sheared out of its hole. The bolt is so short that it only has maybe 2-3 threads of bite and it's a self tapping/cleaning kind on top of that so like another 2-3mm of it has no threads at all. Very poor. It failed in the middle of a job so I had to run over to home depot and get a Makita joiner which has a WAY beefier blade hold down. Been using it for hours now, no issues. Ergonomically this tool is better than the makita, but the makita works, so this thing is an epic fail.",
        "I have used a Ryobi biscuit cutter for 7 years. Every time I had to plane the surface to get it flat or sand a lot. Just got my PC 557 and the first test was a couple 19 inch pieces with the depth set for 0 and the surface was perfectly flat! No sanding no planing. It feels solid and it is very comfortable to hold. I am so glad I upgraded. The micro height adjustment rocks! And it fits right into my shop vac system.",
        "Great tool, accurate and well built. The only gripe I have about this is that the port for wood chips/shavings clogs easily making a big mess and often leaving the biscuit hole filled with wood shavings. I've tried a few things and haven't figured out the secret to keeping this from happening yet. Overall worth the money.",
        "Unit just arrived. The clamp for the dust collector is too big to be effective, rendering dust collection via the bag useless. Rubber cushion at blade opening damaged and misaligned. Otherwise works fine.",
        "I've used this joiner several times since I purchased it and I am very satisfied with its performance. I've had several others that cost more but this PORTER-CABLE Plate Joiner Kit has outdone them all. Easy set-up and has precise adjustments. No complants.",
        "Broke about 3 weeks after I bought it. Fence is garbage. Costumer service is worse.",
        "I have been using this biscuit joiner for about a year now, and it has performed well. It's easy to set up and use. It will cut consistent and clean biscuit slots with little effort. The adjustments are easy to set up, and the operation is simple. The motor provides ample power to cut most any wood. I have used it for oak projects many times and it work very well. I would recommend this tool for any woodworker.",
        "Great quality tools are made by P-C. Easy to use, good fit and finish to the projects I have used it on",
        "This tool is light weight so it makes it easy to maneuver and hold in place. The cuts were perfect the very first time even though I’d never used a biscuit joiner before. I wish that it had also come with the smaller blade for FF biscuits. I haven’t been able to get myself to pay the $60+ for it yet.",
        "Peter Cable maintains its reputation for quality cutting tools with good motors and cutting accuracy. However, they failed miserably with the dust collector. It clogs and doesn't really work at all. I removed it and let the chips fly to clean up afterwards.",
        "haven't used it yet. going over features I will say it should be awesome. will do everything I need.",
        "As expected another first class tool from Porter-Cable, makes the other name brand unit I was using feel like a toy.",
        "This is a great biscuit joiner. It's easy to use, makes clean cuts, works quietly and doesn't throw dust all over creation. I'm glad I got this model.",
        "Works perfect. Porter Cable sets these up at the factory, no adjustments we necessary to start using immediately. very user friendly.",
        "If you're in need of biscuit joiner, and want quality, this is the one!! I just got this yesterday, and used it to join mitered corners, in plywood, with this tool it was effortless. All the markings are strait forward, no brainer. Just take your time and learn the adjustments and you too will love this tool.",
        "Very good adjustability, strong motor, accurate cuts. Does take some practice like most tools but works great.",
        "I have now used this a few times and I am very pleased with this tool. Smooth action as you plunge and nice clean cuts. As others have described, the dust chute clogged almost immediately (why I gave 4 stars) and the bag seems almost useless. Fortunately, I had the right hose to connect to my shop vac and it worked beautifully - no sawdust or chips whatsoever. Power is sufficient.",
        "Used it to join some walnut boards for a fireplace. Easy to get boards flush. Easy to setup and know where the slots will be cut. Used the template for some small pieces as well. Solid feel like all Porter-Cable products. Exactly what I needed to make up some wide panels.",
        "newly added tool to my shop. been wanting one for a while and finally had a cabinet project to justify it. Awesome fence adjustability and stable. Chip port gets clogged easily. Using the bag or vacuum doesn't seem to make a difference. Just have to cut slowly.",
        "Easy to dial in, easy to use. High quality machine.",
        "This biscuit joiner is very high quality and works as intended. Cuts quick and accurate and is easy to adjust cut settings. I would recommend this to anyone from the amateur woodworker, to the professional. A very good value for the money, and should last a lifetime if taken care of.",
        "made 24 individual shutter door for interior windows for privacy yet light filters in over the tops. no screws,just glue and biscuits,. bifold hinged. LOVE IT!!!!!",
        "I'm a big fan of Porter Cable. It's very well made. The only draw back is the dust bag, it plugs up. Just leave it in the box. What I do is put the bag attachment on without the bag and turn it away from me and let the shaving fall to floor",
        "When do you not need a plate joiner!?! There will always be something that you could use this tool on. With a little glue you can make a solid joint. The saw works great and has a lot of options. The blade depth, height, angle can all be adjusted to get the slot that you need. I am a general contractor and use this tool for projects here and there. I do love this tool and was a great addition to my garage & jobsite.",
        "I used this Porter-Cable Plate Joiner first by borrowing from a friend, and then as a recent owner (July 2005). I researched the field first, and fond this 557 to be the clear winner in the under $200 category. It is very easy to adjust (quite intuitive) and it appears to be very safe and stable to operate. I have built two nice tables using it, and the bisquit joints turned out very professionaly. It is MUCH easier than attempting to dowel precisely.",
        "Excellent piece of euipment even does 135 degrees easily without ruining sharp edges​.",
        "love it! had a dewalt and it is far superior! much more precise and pretty fail proof.",
        "Easy to use, easy to adjust. Good, quality feel to it.",
        "I bought this to use when building a table for my wife. I needed a way to properly align the boards for the table top so that the top would be level. This tool worked great.....after cutting 28 biscuit slots and glueing up the top, it is level. This tool also comes in a very nice case.",
        "The jointer works great but as others stated it does clog in the discharge dust hose connection. Also the dust bag clamp was to big to clamp on the dust port.",
        "Works great...however, the bag won't stay on no matter what I do.",
        "good quality, operates great. No problem with dust collection when attached to shop vac. excellent replacement for my 30 year old craftsman plate joiner. expect good things from this PC joiner.",
        "Nice product. Pretty easy to use but not fool proof. Practice on similar product before doing it for real",
        "Hands down the best plate joiner/ biscuit jointer on the market. The fence system is superior to the other similar units currently for sale.",
        "Was just delivered and haven't used it yet. But right out of the box I noticed the depth gauge is a tacky decal that was already lifting. Surprised they didn't have engraved markings for crucial measurement!",
        "My third and final plate joiner. It just works. The cheaper import clones work sort of but this one is a joy to use. It is worth the money.",
        "Somehow my machine is not falt at the base plate. But according to many reviews, this trouble is my own. Without some jigs, perhaps I can't use this machine. Since I am not a US resident, I can't send it back.",
        "This joiner recieved rave reviews in every compasison I could find. I have only ran 105 biscuits through it, however, it was deadly consistent and the fence was perfect right out of the box. This was my first biscuit joiner and i would without a doubt reccommend it to anyone.",
        "I have nothing bad to say about the machine it self but my issue is the cost of the 2 inch blade easy too expensive for what it is.",
        "Having never owned a plate jointer before I have nothing to compare it to, however after reading all the reviews: I pick the most powerful and best reviewed one I could find. I have not been disappointed in the least. Chews through hardwood like tissue paper, it's easy to set up and a breeze to use. I do own other Porter Cable power tools and I must say that, that weighed heavily on my decision to buy this one. It was a bit more then most of the others but I wanted the best and I got it, this is a lifetime tool! Oh, make sure you get the 7 amp model, not the 5. More amps equals greater power.",
        "Should have bought this years ago.. Great addition to the shop",
        "I previously had an older model Porter Cable which I selected over other brands. It served me well. This 557 model has many improvements which make it easier to use. Holds more securely, slides smoother, balances more evenly in use and I like the adjustments much better. Nice tool to use. Porter Cable did it again.",
        "The best biscuit jointer there is. I will however, be getting a domino in the future.",
        "It works perfectly, easy and practical. I would only improve the design of the disposal bag, the dust comes out it very easily.",
        "It cuts just slightly below the exact center on 3/4 plywood, but nonetheless is a terrific biscuit joiner.",
        "If you want the best then stop here. I have had absolutely NO problems with this tool. It is extremely accurate and very light and easy to use. As long as you take care not to abuse it I am sure that it will last a few lifetimes. From picture frames to bookcases to birdhouses it has never failed to deliver. I don't understand the negative reviews (maybe no one can measure accurately these days);-}"
    ]
}