{
    "entity": "Biscuit & Plate Joiners",
    "text": [
        "Full disclosure: I'm a DeWalt guy. Typical DeWalt tools work out of the box for me. I own a DeWalt planer, miter saw, table saw, multiple sanders), but this one didn't fit the bill. The fence is about 1/32\" out of parallel to the blade, even after adjusting the fence with the two set screws as far as they will go. This one is going back. I will try another because the tool is very easy to use, and the price is right. I hope this isn't a common theme with these joiners...",
        "See attached picture: plate cutter is not parallel to the fence. From other 1-star reviews for the DW682K, you'll find my experience is not an isolated incident.",
        "The adjustable plate was 1/16+ out of square and also milled with a radius in it. Overall alignment was just off and it had some slop in it. Very disappointed. Please look at customers pictures because this seems to be a trend.. returned it and ordered the porter cable version.",
        "I don't usually write reviews but felt I had to on this product. Very poor performance.would not cut level. Tried adjusting but found housings had to much clearance that allowed misfit issues. Sending back for refund and hopefully different brand with better results. I'm a hard core dewalt guy and very disappointed in this product.",
        "I purchased this and it arrived on time as always. Only problem is the cut is too wide for the biscuit by more than 1/32 sometimes larger depending on the biscuit and amount of operator error. There were times my joints would shift during practice glue ups to about 1/16 of an inch. For the longest time I thought I was messing something up and simply stopped using the tool. I finally removed the blade thinking I was going to shim it to make up for what is suspected was a wobble. Come to find out the blade itself is warped. Not what I expected from a $200 tool. Somewhat disappointed but hopefully the new blade with fix the problem.",
        "The picture clearly shows a hard sided case. If your buying tools on amazon, you’re probably not reading entire description because you’ve already done your research and are just looking for best price. Description does clearly state it comes with soft sided bag. Update the picture.",
        "I had this jointer for a couple of years before someone broke into my shop and stole it. I liked the DEWALT biscuit jointer a lot until after someone took it I borrowed a neighbor’s porter cable unit. The porter cable unit allows much better tracking and precision. I am usually very loyal to DEWALT but I decided to buy the PC model. As I said this is a good jointer, it is just a little more basic and requires much more care and layout.",
        "First time using a biscuit joiner. I tried it on some scrap wood and found out I needed to adjust it (hence the -1 star). Luckily I found a video on YouTube of a guy from the UK showing how to adjust the baseplate. Works great now and I’m getting better on the miter joints with practice!",
        "I had the Ryobi for a few days, then returned it due to an out-of-alignment screw that was causing all the joints to be off. Got this DW instead and glad I did. It's much nicer than the Ryobi. Here's why: the ryobi chip exhaust clogged a lot and the vertical scale is hard to read. The DW is much better. I've also tried the beadlock system (where you drill a 3-4 hole dowel in). It makes a super strong joint, but I find the plate joiner is easier to get a flush joint.",
        "Read a lot of reviews claiming a crooked slot being cut. Mine will also cut a crooked slot if I'm not holding it correctly. I got mine for $100 during a sale, and can't complain at all. It is very well built and cuts how it's suppose to.",
        "I had the same issue as another recent reviewer, the castings that make up the fence/slide mechanism were machined/cast with too much play in them, which combined with the torque of the motor to skew the angle of the cutter head during operation. I am extremely disappointed by the lack of quality control from Dewalt on this tool. I have returned it and am waiting on a replacement from a competing brand.",
        "The tool is a great addition to the shop. Have used it to join angles on a 3 cornered cabinet I am in process of making. Although a bit too soon to rate it for durability I don't expect any issues with DeWalt tools. I gave it a 4 because, as several of the reviews I read before purchasing, the exhaust port clogs easily. I may try to get adapters to hook up my Shop Vac and see if that helps. I would definately recommend this tool to anyone in the market for a good plate jointer.",
        "What a great machine! I was a beginner in wood work and this little thing has helped me so much! It is not very big but the engine is strong, it has never bog down. Also, I’ve had it for 3 years now and used it on almost every project and it is still running like new. It is easy to use and you get a good strong easy grip on it. Dewalt made a winner with this one.",
        "I'm sure it is probably operator error, but it doesn't create even joints on a glue up. Tried referencing the face and the fence, even adjusted the bottom since it comes from the factory uneven, no luck. Cutter blade and action are smooth, so could be very useful for someone with more knowledge on how to tinker with tools to get them to cut perfectly even joints.",
        "I've seen a lot of people stating that it does not cut a parallel or even slot. With every tool you purchase there is always going to be setup and tuning. Invest in a mini machine square and a small combo square. All of the perameters are adjustable, cut depth, cut height, parallel to base plate. If you are new to useing the tool do your research. Remember to check it periodically that it has stayed in tune. Honestly this is a great tool. DeWalt has always built quality.",
        "Did not like the deceiving pictures that show the hard case yet it only comes with the soft bag! Other than that the item was great.",
        "I love this tool it is so much better and faster and more precise than using wooden dowels........I like the Dewalt brand much better than the Porter Cable brand as these tools have gone down hill in he last few years so much so that I wont buy them anymore",
        "This biscuit jointer was key in getting some of my large glue-up panels all together before the glue dried. I bought some cheepo biscuits and many of them didn't fit the slots securely. Need tight fitting biscuits to make the seams really line up.",
        "Never used one before, but understand the general concept. Instructions were very clear and helpful. #20 biscuits that I got from lowes work perfectly. Joined two scrap 6x6 boards and clamped properly. Then tested to failure, VERY strong joinery method.",
        "This little device is a fantastic help when building furniture when you don’t want the hassle of making tongue and groove joints. It is quick and easy. Just be sure to check the stops first for accuracy.",
        "Mine came in a soft bag , not a hard case . I have a truck full of tools and supplies so the soft bags don t work well for me . I was expecting a hard case like the one the picture shows . Sending this one back",
        "I purchased to help make wood boxes, worked great, also added some screws for added strength. A second use was to cut edge of deck boards for hidden fastener system, I needed to adjust depth to make a wider notch but it was a great tool for the job Another great Dewalt tool",
        "I bought this to build some cutting boards to strengthen glue up and it performed almost flawlessly after making a few test cuts and simple adjustments. It lived up to all the positive reviews already submitted by others",
        "Ordered as gift, picked this one for soft case that was pictured and in description, as he wanted that over heavy, bulky case. Got heavy black case.",
        "All the settings right out of the box are spot on. No adjustments were necessary. The dust bag collected all the shavings and none were left on the ground. I was really surprised as most dust bags are virtually useless. This is a fine addition to my DeWalt tool library. The price on Amazon was less than the B&M stores and delivery was overnite with \"prime\". Always a good experience with Amazon and thats why Amazon always gets first crack at my purchases. As far as the dust bag goes, make sure you empty it frequently and Im sure you will be more than satisfied with it. Made in Mexico, not China.",
        "Awesome tool every thing works as it should. I wish it had a handle on top of the fold down plate so you could hold it against the work piece more securely and they could make it where you could put it on and take it off.",
        "Building a log home. This works perfect and after watching youtube, it was a breeze to use. Going to use on window and door trim. Will work good for picture frames too! Instructions were strange and print super small. I don't need Spanish French and Chinese.",
        "I can’t really say too much about my biscuit joiner but from the little use I’ve had with the the joiner is very easy to use and very accurate with the first couple cuts I’v done work perfect for me.",
        "Started building tables in my shop. Using this led to accuracy and level connections between boards. Use it also for picture frames and shadow box assembly.",
        "I HAVEN'T USED THIS AS I AM GOING THROUGH MEDICAL TREATMENTS THAT MAKES YOU TIRED AND I LIKE ALL MY FINGER'S WHERE THEY ARE LOL.",
        "Works great. Powerful. Hold it tight to the piece, it has torque and can pull to the side as you pull the trigger.",
        "I just found out about plate joiners and biscuits. I ended up choosing the DeWalt because of the quality of the other products I own. I love this joiner, easy and fun to use. I’m very pleased with this new tool!",
        "Item was just as described, packaged well for shipment and arrived in a timely manner.",
        "I know people are getting away from doing biscuit joints and I don't know why. This tool is easy to set up and cuts perfect slots. I use it to assemble panels and small table tops",
        "Works great. Does not come with dust collection bag, so watch where your face is the first time, I got a mouth full.",
        "This tool is everything I have come to expect from DEWALT. I am renovating an old lake house using a lot of knotty pine and raw cedar. I wish I had purchased this plate joiner a few years back when I started this project. It is easy to use. The cabinet joints, facings and all other connections I have made a biscuit joint are perfect and look great. This is my 15th power shop tool purchased in as many years 7 are DEWALTs. Three are replacements for other brands that died. I am very pleased with this tool.",
        "I used to use a $1000 Lamello biscuit joiner when I worked in a cabinet shop. The dealt works amazingly well for how much it costs. I'm not saying it's as good as the Lamello, but its hard to tell the difference. This thing is accurate, easy to use, and I love the rack and pinion adjustment.",
        "Easy to learn to use and it made accurate cuts for joining cabinet materials.",
        "This was a gift for my husband and he said it's great. The negative reviews may be from not adjusting it for the thickness of your board.",
        "I have been wanting to buy one of these tools that you only use once in awhile. This things works great. I wish it had a better dust collection port.",
        "This is simply a great biscuit router that makes any corner or attachment of materials much stronger and tighter for the long road. So simple to use and once you use it often you will think of projects you wish you had this on. Like any routing type of tool it is going to make a bunch of sawdust no matter what you do but it is worth it.",
        "This is the first time I've used a plate joiner for attaching biscuits and it works well. It's not too heavy and is easy to use.",
        "As with all of the Dewalt tools I have purchased. It worked perfect. Just finished building 4 tables.",
        "This is a very nice tool to have. The quality seems to be there. I used it for hardwood and it was amazing how easy it cut the grooves.",
        "I used this to fabricate a floating wooden fireplace hearth / outerhearth over the existing tile one. It was easy to use and the hearth (quite big actually 10' x 16\" + overhanging sides attached to it) looks great and after 2 years none of the wood has budged. Be prepared for some dust and clean the dust catcher regularly during work (if you are working inside). This tool was very easy to use and accurate!",
        "Had to spend two hours on try to figure out how to adjust it so it would cut a biscuits slot straight other than that great product",
        "The price was good (for a DeWalt product) and the shipping was relatively fast. I mean, you have to pay for quality and DeWalt makes some high quality tools for sure that not only last a very long time, but hold their value in terms of trading or selling in the future. The joiner works well and is pretty close to being 100% accurate. It's a good tool and I'm glad I have in my shop!",
        "Used it to build a Dart Board. Dust exhaust clogs! Only bad thing. Works very well.",
        "This joiner replaced one of those attachments you put on your router to do the same thing. HUGE difference. This is basically a one handed operation. With the router version I needed to clamp down the board, plunge the cutter and then slide side to side depending on the size of the disks. With this unit I don't even need to clamp it down. Make the job a lot easier and enjoyable.",
        "I doubt I'll ever dowel join again. This thing makes it so much faster to join.",
        "My husband uses this on the job daily and is just right for him.",
        "This plate joiner has worked out very well for me. I am making octagon borders for several plants and bushes. It is easy to use.",
        "Replace an older biscuit jointer with this model. Consistent and works when I need to join long boards. Glad I’d made the investment",
        "Works great and a nice addition to my tool collection. well made and very easy to use. I had to make a bunch of custom louvered doors for storage access behind the kneewalls of the upstairs of my cape cod and this was perfect for sturdy assembly and turned out a top quality product l",
        "Won’t turn on after 1 month. Dewalt wants me to pay $75. for warranty. No customer service at all.",
        "Purchased as a Christmas gift last year, boyfriend loves making furniture and this has totally gotten its use and then some. Great product for the money",
        "I love it! Should've bought it earlier in my project.",
        "Easy to use and works as expected. Would recommend for the novice wood worker.",
        "Repeatable cuts can be a bit of a challenge, but it's still a very nice tool. It will walk a bit if you press down on the handle when starting. If you are careful to not do that, it doesn't seem to walk all that much. I had to adjust it a little to since the cuts were too deep out of the box, but it was an easy adjustment.",
        "This was a gift for my son. He loves it and tells me he got perfect results on his first practice joint!",
        "I really like the precision of it and the power. Awesome product.",
        "Great product and priced well. I have used it every few months in my woodworking and finish carpentry business. I would advise you also purchase a kreg system to compliment the product and with both you can build most cabinets. I have not had a problem with this tool since I bought it in 2004, so if you buy one you should expect it will last without defect.",
        "Excellent tool. I have already used it to build a semi enclosed (Custom) cabinet with glued up top for my sons TKD studio. Everyone is happy with the final product and I am happy with the plate joiner. I can see myself using this tool on a regular basis.",
        "Dewalt nailed it again. Always satisfied with the tools I have by Dewalt. Table saw--Miter saw--Angle grinder--Nail guns and now this. If there was 6 stars I would give it a 6.",
        "Great product, easy to setup and works as it's supposed to. Plug and play",
        "easy to use, the port used to direct the sawdust seems to clog easily",
        "This is not my first one! I have used several types of biscuit joiners over the years and this is the best I have found. Safe unit too if instructions are followed Only issue is the dust collection. Scrap material coming out of exhaust flange fills the flange rapidly requiring often cleaning. I just remove the bag and clean all up after cutting is done! With that said the machine has excellent quality and good accuracy!",
        "Purchased for my son and he loves them. Uses them all the time and it works great",
        "I ended up buying two of these because I have a step son. The first unit was great. The cuts were square, and there was some scoring on the face to keep it from sliding. The second unit is useful for building a barn, if you are not picky. The bottom is not flat, and neither is the front. The scoring on the face is insufficient, and even with a jig, it wobbles because of its not being square. You may get one that is fine. I am going to buy a Porter-Cable or Makita.",
        "It show on Amazon that it comes with hard case. It's fault advertising. My came with a bag. Wow just wow.",
        "Several years ago I bought my Dad one of these for Christmas. He had it a whole week before I borrowed it. He got it back a couple of years later. I have my own now. Last week, Dad borrowed mine since he left his at this other home out of state. I do hope to see it again. :o) Great tool, durable, and quick. Make sure you wear goggles, the wood does fly out. I skip using the dust bag on larger jobs since there is a tendency for the shoot to clog. That's why I have a shop vac. Thank God for the Knowledge he gave to mankind to make so many great tools.",
        "arrived on time and as advertised. Have used only a few times but satisfied.",
        "Other than the chips shoot up into my face, the joiner works pretty good. You do have to practice as my first few tries the biscuit slot was consistently crooked (the right side higher than the left). Practice makes perfect.",
        "I used this to side cut all my deck boards when using a hidden fastener system. It worked great and I never had any problems with it. The depth settings worked great and the tightening screw held tight, so no problems with the depth changing on me. The deck I used this on was large and I used a hard brazilian wood so this received a lot of rugged use, and held up fine. I would definitely recommend for hidden fasteners. I read some reviews complaining about the cut being off a 1/32 of an inch from side to side. I didn't notice this, and with the hidden fasteners, it doesn't matter.",
        "Never owned a joiner before and read a lot of other reviews before I bought this one for a specific project. It was between this one and porter and cable model. The dewalt is easy to set up and use. I did not experience any of the negatives mentioned in other reviews. I did notice that it wanted to walk a bit when trying to plunge too quickly, but that was part of the learning curve in my opinion. I was not using large biscuits, but I didn't think the dust bag filled up quickly either. I didn't plan on using the vacuum attachment but it seems to be an odd size and doesn't fit my hoses regardless.",
        "i have used my plate joiner a few times. I realy like how you adjust it .its my first joiner so I cant compare it to another. but this one works great. i did my research and desided on this joiner.i am glad I did .its pretty heavy duty to.. and easy to use.",
        "I was doing a couple of projects around the house, and decided it was time to use a plate joiner. This was excellent. It is solid and well made. Easy to operate. It works just as smoothly on Oak as it does on pine. It was fun to work with",
        "If there is a better biscuit joiner on the market, I haven't seen it. Easy to use and easy to adjust.",
        "Dewalt does it again! Great product and will make my projects easier and more professional. Thanks.",
        "This plate joiner rocks! Fun and easy to use! Must have for wood workers!",
        "I’m remodeling my house and I building my own cabinets This tool make it do much easier",
        "must have for all wood workers. this is really well made. this is not harbor freight junk. i got this for one of our custom cabinet projects. works like a charm. already paid itself few times over with one job. highly recommend it.",
        "Have only used once but am very happy so far.",
        "Is working for me. Only issue I’ve had is that the sawdust tends to get stuck in the port going to the collection bag sometimes",
        "Solid tool, good range of adjust-ability, precise. Does have a tendency for the dust shoot to clog, when using it in a vertical position. But easy enough to unclog.",
        "Bought this for a table project of mine. works great & I'm already planning other projects now that I have it.",
        "This was a deal of the day and that says it all. I have used this tool many times and really don’t know why I waited so long to purchase it.",
        "This is a great joiner. Has positive accurate settings and is easy to use. Definitely recommend it.",
        "what a blessing - was well worth the purchase. So easy to use - no hassles.",
        "Does what it was made to do. cut slots for those awesome biscuits.",
        "you really need to connect a dust collector or it makes quite the mess",
        "A nice addition to my powered tool collection. Performed as advertised. Look forward to creating uses for it.",
        "Bought for my fiance and he is extremely happy with it!!",
        "This product makes quick work of wood joining applications and is a workhorse. The purchaser will be more then satisfied with the operational duty cycle and performance of the cut.",
        "Worked well right out of the box. Enclosed filter bag or can connect to shop vac. Very nice storage case.",
        "This is a very solid and well built plate joiner. Not really a must have for the wood shop but it comes in handy. It does what it is suppose to do with ease. Good tool to add to the collection.",
        "I build custom furniture.Quality tool. Arrived quickly. Checked fence to blade alignment with digital caliper which measures to the 1000th of inch, perfectly aligned out of box. Never have had discharge chute clog. Good price nice case.",
        "This was the perfect machine for the job intended. The shipping was fast and every thing worked as it should have. Best of all the price was better through Amazon than anywhere else. This is truley a quality built machine.",
        "Bought as a birthday gift for my son. He gives it a two thumbs up",
        "had it for a day and ive used three bags a biscuits! cant believe i waited so long!"
    ]
}