{
    "entity": "Stand Mixers",
    "text": [
        "Used twice for chocolate chip cookie dough. Motor burned out. Hamilton Beach sent replacement but its motor also started smoking and quit operating after only 2 uses..",
        "Why did I wait so long to buy a stand mixer? All my life I have been mixing by hand, what a dummy. Finally I read the great reviews for this mixer and sucked it up and bought it. Life changer (at least in the kitchen). I love being able to dump ingredients in and walk away while it is mixing. My cookies even tasted better because it will mix much longer than I could ever do by hand. The motor is powerful and quiet, too. No need to buy that more expensive mixer, this one is perfect!",
        "I purchased Hamilton Beach Electrics All Metal Stand Mixer in November 2016. Previous owner of Kitchen Aid Stand Mixer which purchased in 2004, mixer quit on me 3 weeks before Thanksgiving. Repair cost would be $140. Decided to try Hamilton Beach Eclectrics. Was so excited baked pound cake same night it arrived. Put that cake in freezer, made 3 other pound cakes during Thanksgiving. That first cake made with Hamilton Beach was the best of the cakes. I like having pouring shield for adding flour. Flat beater mixes as well as Kitchen Aid mixer. I also like having handle on bowl. I look forward to using this mixer for many years.",
        "The machine is very sturdy and very effective. It feels high quality in every way except one - the metal of the hub on the wire mixer is of extremely cheap quality. The wires themselves are fine, but the hub part of the attachment has a metal that is deteriorating excessively, leaving a fine black powder on anything it comes into contact, powder that gets worse with moisture and does not completely wipe off because it is the metal itself degrading. I don't feel safe having that kind of metal near food. We'll still use the mixer but we are looking for alternative attachments.",
        "Purchased on July 14th, used only five times and it no longer works. Called customer service for and waiting for two hours on phone however nobody answer it.",
        "I have to say, I bought this product for the three year warranty and the fact it was listed as USA. I took that to mean made in the USA. This isn't true. That being said, I am extremely happy with it. It works as well if not better than the Kitchen Aid I had. It's quiter than the KA and does as good a job. I am very pleased with it, and I would recommend. It seems to be well made, sturdy and a little smaller than the KA. I like the fact that it came with extra stuff too.",
        "Problay only used 20 times, then the mixer would jam and eventually not mix any more. Did a serach on line and found that I am not the only one who has problems of this nature. There is plastic gear in worm gear combination that fails. All of the other gears are metal... Very disapointed...... Hoping to be able to contact HB and get a replacement GEAR! Regardless if I get the gear or not... Probably will refrain from another purchase of this machine.",
        "The product is easy to move around, doesn't weigh too much. Unfortunately mine has made a grinding sound since the first day. Still works but many times it won't change speed between settings. High is same as med-low. Doesn't get very bottom of bowl mixed, wish there was a way to adjust beaters. It's still working after a couple of years but I'm ready to try a Kitchen-aid.",
        "This has been an amazing mixer. I bake a lot of heavy ketogenic concoctions and this little baby mixes, keeps on kicking and is my go-to for just about everything I make. Of late, I have arthritic thumbs, and I use this favourite appliance for mixing up large quantities of meatballs. It is a snap to use, and a snap to clean up. I have just had to replace the dough hook as the coating has begun to chip. Buy this! You won't be disappointed!",
        "We used only one time to bake a cake and we saw smoke coming out from the mixer. after that it just stopped working.",
        "Easy to assemble, easy to use.. I have used it 4 times so far (2 for dough, 1 for meatballs and 1 for cake) It is quite, made dough and cake while my kids were sleeping and didn’t even feel it.. I am extremely satisfied with the kneeding it did on the dough.. Can not compare it to any other brand cause i only have this one but it is perfect for my everyday needs. It looks exactly as the picture. The only thing I didn’t like about this is the plastic splash guard as it moves when the machine is on and doesn’t stay in place.",
        "Electric motor broke down during the third very light mixing in 10 months and item stopped working totally and completely.",
        "I debated purchasing a Kitchen Aid stand mixer for years but could never justify the cost so I took a chance on the Hamilton Beach mixer several months ago and so glad I did! From chocolate chip cookies to sourdough, it's performed like a champ and clean up is a dream. While I've noticed mild shaking when making pizza dough, it's really not a big deal. Overall, this mixer is a great product at a very reasonable price.",
        "I use my new mixer at Christmas and love it. The only problem I have is transitioning from working position to removal of the bowl and mixers. I keep forgetting where the control is located and it's a little difficult to maneuver with my short fingers. I would purchase again as it is the size I like.",
        "Really struggled with bread dough. Ended up just kneading it by hand which kinda defeats the purpose. Great with everything else so far as long as it's not too thick.",
        "NEVER, NEVER again will I buy a Hamilton Beach stand mixer!! This might be ok for mixing an occasional cake, but absolutely worthless for bread making. Started smoking while kneading dough and now will not turn on at all. Forget about it being covered if it is over a year old. Tried taking it apart, with no avail. Called the company & there is no replacement parts for the actual mixer unit; only replacement parts for the bowl & attachments. They suggested just to throw it away & purchase a new one. NO WAY! What a waste. Now I feel guilty for littering the landfill with this hunk of junk. Sadly, I guess you get what you pay for.",
        "I was very, very disappointed in this product. The \"beater\" that you use to make things like cakes does a terrible job of blending the ingredients. I had to keep stopping it and blending things with a spatula to get things to mix properly. I was not making anything extraordinary or heavy; the beater just didn't do a good job of getting to the bottom and sides of the bowl. I have several old Hamilton Beech stand mixers from mid-20th century that are real work horses. This one is worthless by comparison. I donated it to Goodwill.",
        "Love, love, love this. I had always wanted a Kitchenaid, but just couldn't seem to ever let go of that much money to get the one I wanted. I was so glad to see the reviews on this one and am so happy that I got it. For the first week I used it daily. It worked great with the bread recipes in the book and it was nice not having to knead for a long period of time. This did it for me! I am a multitasker, so this is perfect for me to be working on the next part of an ingredient while this machine is doing \"it's\" thing.",
        "The beater does not cover the bowl, so scraping is necessary; but a pain as the machine has to be stopped, the splash guard wrestled off and on, ( messy and frustrating). If one is more comfortable working with the bowl on the left, then the controls are on the wrong side. More awkward moves. Additionally; the handle is basically a flat piece of metal, which must be padded with something to keep it from painfully biting into one's palm and fingers, So far it seems to be running well enough, but feel there must be something more efficient and suitable, especially for the price.",
        "Works as advertised. On high speed, it tends to sling batter out of the bowl, unless you use the cover. A smaller hand held mixer would be better for beating eggs, frosting, and similar things. This mixer is in it's best environment when used for heavy bread and batter mixes, but will do lighter mixes if a hand mixer is not available.",
        "For so long The Missus slaved through her cookie-making with hand-held mixers that strained the wrists and required 100% attention. Now she can mix up dough for delicious cookies AND do something else when she feels the need.",
        "This is a heavy duty mixer that is able to handle large batches of dough. It has a powerful motor and looks sleek and modern on my counter. It comes with 3 different and useful attachments. I had a more expensive brand but this one performs better. The only drawback is that it is hard for me to operate the button to raise (up) the attachments away from the mixing bowl because the motor is so heavy.",
        "Wow, love this mixer, solid steel no plastic on the base at all. So much better than the old kitchen aide I replaced with this Hamilton Beach. It’s great! Love the stainless steel mixing bowl and all the hooks included",
        "This mixer made it possible for me to finally make a decent loaf of bread. The dough hook eliminates all hand kneading. The paddle blade whips up no-lump creamy mashed potatoes and the wire whip turns heavy cream into a great batch of whipped cream and more. Continue whipping that cream as the buttermilk separates and the solids collect as homemade butter---just mix in salt to taste after straining out the buttermilk for a different baking use. The 400 watt motor has all the muscle I need for 2 loaf recipes and the whole thing cleans easily, attachments and machine. The best kitchen purchase I've made since I bought new major appliances.",
        "EVERYONE wants that other famous name, but if your like most people you dream of making homemade bread and pasta, until they realize its WORK! even with fancy machines(BTDT) Fancy machine collects dust, kids get mac n cheez. Save $, get this for the 2-5 times a year you might actually make a pie for the holiday/birthday. This works well for those rare occasions",
        "I love this mixer.The attachments are all easy to use and love the bread hook,really does a great job for mixing the bread ingredients and so much easier than hand mixing.My mom had a Hamilton Beach mixer for at least 25 years.Its a product that is trustworthy",
        "This product didn’t last me more than five months. I wouldn’t use it every day, maybe once a week and now it completely stopped working. I wish I could get a replacement or money back. I wasn’t happy with it, I didn’t miss used it and always kept it clean.",
        "I have wanted a new stand mixer for awhile, but didn't want to pay the price for \"the leading brand\". This mixer has a 3 year warranty as opposed to a 1 year by the other manufacturer. I have used it mostly for bread making and it is fantastic. It is very solid, and I like the handled bowl, much easier to deal with. Clean up is a breeze. I have no negatives to give on this fine machine.",
        "This item was purchased for a stroke patient with only one functioning arm. As received, it takes two hands to lift the head - one to press the locking mechanism to release it and another to rotate the head. It was a simple effort to remove the locking mechanism. The user is now able to lift the head (Its weight holds it back.) and insert or remove the beater with one hand. The handle on the bowl is appreciated.",
        "This mixer definitely beats the more expensive brands. It's quiet, easy to use and comes with all the attachments the other brands charge extra for. It has a metal frame and is very nice in size. I am an entrepreneur and use it to make Shea butter creams. I LOVE how this works so well. I definitely recommend this product and will be purchasing 2 more.",
        "I am SO HAPPY with this mixer. For one thing, I made sure it had enough wattage to knead dough. It does!! Never used a kneading attachment before but it make my life easier, quicker and cleaner! I had a cheaper mixer, one that could be used as a hand held mixer but it wasn't strong enough for the big jobs. This is worth the price.",
        "I wish I could give it more than 5 stars!! This thing arrived and I immediately put it to use mixing up the batter for my pound cake. It turned out to be one of my best ever. And this little jewel has scarcely seen a moment’s rest since. What a workhorse! In my opinion it does everything the fancier named brands do at a fraction of the cost! Very pleased with my purchase!! Would absolutely buy again.. without hesitation!!",
        "It works well, is solidly-built, and relatively decorative. I made two cream-cheese pound cakes in the first two weeks - heavy recipes with a lot of butter, flour and sugar - and it didn't have any problem mixing them. The only \"problem\" is that the batter closest to the bowl sides doesn't get mixed in, so use a cooking spatula to push it off one time, and then mix again and it is all finished. My mom's old blender with the spinning bowls didn't have that problem, but this one is still a good value for the price - and seems as good as a Kitchen Aid.",
        "Very durable, lots of power, easy to clean and quiet to operate. I dislike that I find it difficult to reach in and scrape the sides of bowl while mixing. I find the splatter guard cumbersome and basically in the way. I wish the top of bowl was wider for easier access.",
        "I used this mixer for the first time recently and although I cannot say I am totally disappointed I feel the release button for the beaters could be in a more accessible spot. I haven't had a stand mixer before so I really don't have anything to compare it to. It certainly did the job though!",
        "Always wanted a full-stand mixer and did quite a bit of research. Based on what I found, by far the best value and not complicated to use.",
        "I've had this for several years and it works perfectly. I did not want to spend the money on a major brand and am really glad I bought this instead and saved my money.",
        "I love this mixer!!!! Beautiful color and works amazing! I usually only make icings, cakes and cookie mixes with it. It is quieter than any mixer I've owned and it hasn't rocked on the counter on high speeds like some of the other reviews have stated. Most of the ones that said that were making extremely thick doughs, so I didn't have to worry about that. It's a great product and I look forward to all the new creations I'm going to make with it! :)",
        "Works pretty well, but not as tough as my old Kitchen Aid. It seems to really struggle with cookie dough. Also bowl and attachments are sort of flimsy...aluminum maybe? They don't feel like stainless steel. Not thrilled, but I got it on sale for $125, so it will do for now.",
        "I've been searching for years for the best value for the quality I want at the price I could afford. I've even bought based on Consumer Reports reviews and returned the product because it just didn't do the job. This puppy does! It's beautiful, and the sales price I got this at made this my value find of 2015. I made gluten-free pizza dough as my first outing, and it was supreme, maybe better than any I've bought from professional GF bakers and certainly light years better than Rudi's or Udi's bought GF crusts. I will be baking a LOT more - finally!",
        "We purchased this November 23, 2014 it has been a fantastic heavy duty mixer that has gotten used regularly. I am OCD about researching before I buy things and couldn't justify the cost of a professional mixer so after looking at a bunch this is what we settled on. It is worth every penny and built like a tank. We couldn't justify a professional mixer cost but ended up with professional quality at half the price.",
        "It’s been a year and this product still working great. It is waggling a little bit but nothing to worry about too much. It’s a good quality.",
        "I reviewed alot of machines - purchased this one for $125 US and love it. A similar Kitchen Aid machine on Christmas sale was still more than $100 Cdn more. This machine is quiet and handles 8 cups of flour. 2 of the 3 attachments, splatter guard, pour shield, and bowl are all dishwasher safe. It also does not take up alot of space on my counter. Compared to the Kitchen Aid the Ecletrics 63232 wins hands down. It takes up less counter space, has more pieces for less money, great muscle, much quieter, looks great, and everything but the whisk is dishwasher safe.",
        "I made banana bread. Found it awkward as my 50 year-old old mixer was smaller and lighter. That’s not all bad, just heavy to move and then triggering the tilt feature was a bother. I’ll get used to it and like it, I’m sure. Do like the handle on the bowl.",
        "This is my second Eclectric , having had a Kitchen Aide originally. So easy to clean , and light enough to carry if necessary. First Eclectric still working, which I gave my daughter and grandkids. She loves it.. The new one is so quiet but powerful with its 400Watt motor. I make alot of bread, cookies and everything. I would buy it again.",
        "I have been using this mixer for over a year and I love it. I use it nearly every week. It does a terrific job.",
        "Just finished making a 5 cup flour bread dough and the mixer handled it perfectly. No counter walking. Ordinary motor compensation noises that you get with all stand mixers. My biggest complaint is choice of color... the black looks awesome among my ss appliances and other black counter appliances... but shows every speck of flour dust! I am 100% happy with this purchase and encourage others who do not want to make the big investment in a KA to give the HB a try. We'll see about longevity. Very solid, all metal device.",
        "For about half the price of a comparable Kitchenaid mixer, this mixer covers the basics well. If you don't need all the wacky, expensive attachments, don't waste your money on a Kitchenaid.",
        "Oh my gosh. I’m so glad I bought this mixer. Functional and pretty. It’s different than my old 1970 mixer, so there’s a bit of a learning curve. However, every time I use it I like it even more. Does a great job!",
        "Got this for my mom for Christmas. It isnt very loud, huge plus! However, the mixer piece doesn't mix everything on the bottom of the bowl. So, she has to go back and hand stir the ingredients on the bottom.",
        "the product works great. The only drawback is that when do I dough (@ speed 2) with the hook the whole machine can be a bit unstable. That's the reason why I give it 4 stars. But this is not a problem for me if I use less flour.",
        "My first ever stand mixer and I love it. I was looking at purchasing a kitchen aid but after reading all the negative reviews about gear heads made of plastic, oil leaking into the bowl and terrible customer service - not to mention kitchen aid is owned by whirlpool which also has a bad reputation for things breaking down - I decided to go with Hamilton Beach. I am so glad I did! It looks beautiful and does a great job! And I have not had any problems with batter not mixing in the bottom of the bowl.",
        "Item was defective right out of the box. Tried to use it, and instead of the mixer spinning the motor just makes a loud grinding noise and nothing happens. It is not the most expensive mixer, but I expected it to work considering the hefty price tag.",
        "Works great and has a good amount of power. A word of caution, don't put the attachments in the dishwasher. They corrode and get powdery white with black stuff that rubs off on your hand.",
        "Really easy to use and quiet mixer. No longer bumping my glass bowl along to get cookie dough mixed. Also keeps the kitchen clean. This one does not fling batter all over the place. Love it. I've made Snickerdoodles, Peppermint Mocha cookies, and Irish bread with this mixer so far.",
        "Bought for my daughter that is away at college. Didn’t want to spend money on a Kithen-aid mixer that may end up broken. Needles to say my daughter LOVES THIS Mixer! Very pleased. Worth the money!!",
        "I can not believe I was thinking of saving for a Kitchen Aid! I am in love with my mixer. I have been looking for over a year to get a stand mixer and was looking at Kitchen Aid. I really didn't want to wait to save the money, and I saw this mixer. I compared the features that I knew I would use, and decided I would order this one. I LOVE IT!!! I am so impressed with the power and it is so much quieter than my Mom's ancient mixer (that she would not give me, even though she doesn't use it). It will probably do so much more than I could ever imagine.",
        "I love this, and believe it is every bit as good as the more expensive mixers.",
        "I have been using this mixer since 2011. Today, I use it to mix my taro sweet bread. make 18 super large rolls in one batch. I luv this mixer and if I need to replace it, I will again buy the same.",
        "I love everything about this mixer. It’s sturdy, well made, nicely designed, easy to use and does a phenomenal job. So happy with my purchase, and I’m feeling that my kitchen Badassity level has gone up a few notches!",
        "Researched and compared to KA entry level mixer. This model has a more powerful motor and a 3 year manufacturer warranty. So far (2 weeks) it has exceeded expectations. The motor is quiet and it is easy to clean. The only miniscule issue, but by no means a deal breaker, is that plastic bowl guard gets in the way sometimes when tilting the head with it attached. Would definitely recommend to anyone looking to get a good quality product for a lot less that the KA.",
        "I had a Hamilton Beach 275 watt mixer for well over 15 years and was very happy with it until I stuck the bowl scraper in a beater and bent one beater and did something that caused the lower speeds not to work too well. I have lived with it this way for over 5 years and finally decided to replace it with the exact same model; however, it was not available. So, I went for the 400 watt. I got it and I think it is quite comparable to the high end mixers at half the price. I would and have recommended this to my friends.",
        "I absolutely loved this blender. Half of the price than kitchen-aid and the performance is great. No complaints at all, very please with the purchase",
        "had to replace it after less than 1 year of use. got stuck in high speed. no reset button",
        "This is a good mixer. I had a kitchen aid and this mixer is not as good. Although, unless you are using the mixer several times a week I would go with the Hamilton Beach. I use mine maybe 2 times a month and for the difference in cost the Hamilton Beach was a good choice.",
        "This has been an AMAZING mixer! I bought this after reading all the poor reviews about the Kitchenaid Mixers and my wife and I have not been disappointed! In fact, having had multiple friends who have had issues with their Kitchenaid brand of mixers we've converted them all to this Hamilton Beach mixer. Couldn't be happier with our Hamilton Beach, it has been an amazing experience having a quality mixer you can believe in.",
        "I just love this mixer! I took a long time reasearching these countertop mixers. I just could not justify the Kitchen Aid. Just too much $$$. I decided on the Hamilton Beach Eclectics all metal 12 speed in sterling. It has a sturdy and attactive look and works wonderfully. It really saves my hands when mixing cookie dough and it is very quiet when running. It comes with 3 attachments. Doesn't do anythg wierd like travelling across the counter, making loud noises, or smelling funny. I do lots of baking and am now more organized. I spent less than I expected for a great mixer and recommend it highly.",
        "It worked as expected, and mixed infinitely better than another Sunbeam mixer I had, but the item I received was defective, and the head of the mixer would jump up a cm or so, every 2-5 seconds, and it happened both on heavy dough, and very lightweight batter.",
        "So far I'm very pleased with the mixer. It performs as expected. The only drawback is there is no capacity for food attachments.",
        "I chose this mixer because I had a limited budget. For light weight mixing at lower speeds it's fine. At faster speeds the head shakes back and forth more than I think a mixer is supposed to shake. It really can't handle dough. The motor on mine burnt out within one year. If I had to do it all again I would have invested in a better machine. If all you want is the ease of a stand mixer instead of a hand held one and don't have heavy duty mixing jobs then this is a fine machine but if you need a sturdy stand mixer you might want to choose something else.",
        "Unfortunately, I wasn't able to use it much before a fire in my kitchen. I only had it about a month but I had used it to make sugar cookies for Christmas and was very pleased. The attachements were simple to install and remove and the protective shield was convenient. If I can afford to replace it, I would probably go with the same item. Only giving 4 stars because I can't say if it would've stood the test of time!",
        "It worked well for the first few times, got the dough at the bottom of the bowl (I’ve only used it to knead bread dough). But the bowl kept getting stuck on the base. Last straw was when the motor started smoking. Just returned it through amazon, no problems with that. One other thing to keep in hindsight - KA stand mixers also have more attachments that are more readily available in stores than HB. I’ll prob get one of those in the future.",
        "lots of power and easy to use. i am really enjoying it. i would say it is comparable to the KitchenAid that is almost twice as much money. it's all metal, has higher wattage and looks great. very pleased",
        "I have had this mixer for 3 months now. I was originally going to buy a KitchenAid, but after reading the reviews, and comparing the price; I decided on this one. It is very sturdy and fits nicely on the counter. I have made multiple loaves of bread, cookies, cakes, banana bread, pizza dough, and biscuits. I have had no trouble with having to stop and scrape the sides, or any \"walking\" off of the counter. This is an amazing buy.",
        "I was on the fence about buying this mixer or a kitchen aid. I choose this one since it was more powerful. So happy I choose this mixer. I love it!! I bought this back in 2014 & I've made tons of baked goods using it. I bake all year long cookies, cake, cupcakes, etc. It's still going strong after all the heavy use I've thrown it's way. Well worth the money! I will buy another when that time comes but if the past couple years are any indication of this mixers quality I don't suspect that will happen for a long time.",
        "After months of deliberation between the KA and Hamilton Beach, I went with the Hamilton Beach and am so glad I did! The performance is fantastic! It’s not too heavy nor light and it gets the job done! It made all of my holiday baking so easy and enjoyable!",
        "I'm loving my mixer! Every year for the holidays I bake about 20 batches of pumpkin/banana/apple/cranberry bread to give to my friends and family. This mixer made it a breeze. I was doing double or even 2.5 batches at once. It never hesitated, even with the thickest dough. I had to scrape the sides once at the end on a few of the thicker recipes, but that was all! I do wish the top of the bowl was a little wider, since I found that the splash guard was really more hassle than it's worth (to me anyway). This mixer cleans up easily, looks gorgeous on my counter-top, and works great. Next: pizza dough!",
        "Good all metal mixer for the price. Works well for making cakes, etc. Heavy, so would not move around when in use. My dough hook came with the enamel nicked exposing the metal beneath. Packaging is good so it was damaged in factory. Speed control can be better .....reason for 4 stars.",
        "Awesome mixer, though the pouring shield is really difficult to use. Like, super difficult. Maybe that's the same for the kitchenaid. Anyway, this is the right mixer for the price.",
        "I purchased this mixer because Amazon had an ad stating it was the most reliable. I received the mixer new in a box and used the instruction manual for setup. When I plugged the mixer into the outlet and attempted to turn it on, nothing. I proceeded to try two other outlets and nothing. So much for being most reliable. I have returned the item and purchased a KitchenAid.",
        "Good product, have used a dozen times, breads, dough, cookies, whipping cream, no issues no problems.",
        "I purchased this mixer not only from the reviews, but also the price. After being discouraged with a Kitchen Aids' performance I decided to try it. I was very pleased with its' performance when making a cake. The mixer is much quieter than a KA, and the ingredients are mixed, even at the bottom. (problem I had with the KA) I also like that it has a 3yr. warranty. I will enjoy making holiday treats with it!",
        "Works just as well as Kitchen Aid at half the cost",
        "I like everything about it. Bought and used specifically for making Christmas cookies.",
        "I love this mixer! My only complaint is I wish it would get closer to the sides. , or have an attachment you can use that has a side scraper! Other than that it’s an awesome mixer!",
        "Half the price of Kitchen Aid and Cuisinart and comes with whip, dough hook, and regular paddle, along with plastic splatter cover. Is heavy to move around but I have sitting on counter top where is easy to use without having to pick up. I wash all the parts in the dishwasher. In my house if it does not go into the dishwasher or washer it does not come in. I highly recommend this mixer.",
        "I thought this mixer was going to be great, but I don't really like it! It started out okay, but after a few months of use; it wobbles a lot at the higher speeds; requires you to constantly stop the mixer, scrape down the bowl and beaters and continue; and it cuts off or slows down sometimes for no reason! I am so disappointed, as I thought Hamilton Beach was a quality product. Unfortunately, too much time has passed to return it, but I will not buy this brand again.",
        "Great mixer. I can only find one small thing about this mixer I don't like and that is the control lever. It is just a bit stiff to move and sometimes i over move to a level I don't want. Not a big deal because everything else about this mixer I love. Its very solid and has a good feel to it. I have made bread several times and cake and cookies several times and no problems. I love that it has a three year warranty. That's two more that some pricier mixers.",
        "Love! Love my new mixer! I’ve made everything from bread to cakes to whipping up eggs. This mixer is amazing!",
        "I gave this as a house warming gift to my daughter in law and she said she loves it. She has made four cakes in just a couple weeks.",
        "I experienced a brief shutdown on the product one day. I thought maybe it overheated and the motor blew, but it worked fine the next day. That was months ago, and I still cannot explain what happened. Otherwise, the stand mixer gets used almost daily. It is easy to use, clean and delivers the desired output. Very good!",
        "First of all I bought this for my mother for christmas.......she is a big baker and had been wanting a kitchenaid for ever........I saw this one and really couldn't see any big differences..........I was right.......I think it's better. It even has a great warrenty......three years replacement....Its heavy so make sure you have a dedicated spot for it, and as far as heavy bread doughs.......it hasn't walked across the counter yet when mixing them. I have told several co workers that are cooks about it.",
        "well just used it for the first time,made my cake and frosting that I have been doing for yrs,with other mixers hand held and com. mixers and found this prod.to be the best so far I love it.next will be my French eclaires .",
        "I gave my son my Kitchen Aid that was 20 years old and like new. I ordered this mixer and although it works nicely I do miss the ease of the Kitchen Aid. Time will tell as I get used to it vs the old one.",
        "My only concern is that the metal bowl is not nearly as heavy duty as my mom's KitchenAid that she has had since the 70's. I was disappointed when I saw that. I immediately whipped some egg whites into meringue and they turned out beautifully, but I question how well this will handle a more glutinous dough. Only time will tell. I'll try liege waffle recipe this weekend and report back!",
        "I've had it for 9 years. The only mixer I've used. Banking about 5 cakes a week. Absolutely love.",
        "Makes very good dough. Nice design. Jiggles a bit at higher speeds but that's okay. Point off for difficulty in removing mixing bowl from stand....requires serious muscle.",
        "I operate a pasty business and I bought this mixer and I haven't regret it. It's over 2 yrs and it's used every day. Well made and power is excellent.",
        "The mixer performs rally well. It is very easy to use. I have a handicapped right hand, so this mixer is just what I wanted.",
        "It's good, but I wish it had two things. I wish the bowl was offset a bit so that I could get a spatula in there to scrape down the sides. Second, I wish the bowl was situated so that I could add ingredients easier without turning it off and raising the beaters. I don't really like the plastic attachment that is supposed to allow ingredients to be added while mixing. Sigh."
    ]
}