{
    "entity": "Stand Mixers",
    "text": [
        "Bought this as a gift. I'm certain after seeing it unwrapped that these have been reconditioned. The stainless bowl had a small dent in it and there were fingerprints on the mixer straight out of the sealed box. I think it is terrible that they don't advertise that they are reconditioned. There's nothing wrong with getting a reconditioned mixer, but advertise the truth and let people make the decision for themselves.",
        "Seems like it works really well, but I had to clean the bowl for 45 minutes with a baking soda solution to clean off contamination leftover from KitchenAid's polishing process (which I was directed to do by KitchenAid on their website). Since this is such an expensive product I think that they should be the ones to change their polishing process instead of having me finish their work for them or risk contaminating my food. The company knows this is an issue, I find it disappointing that they're not fixing the issue",
        "I'm not sure if KitchenAid's quality has gone downhill over the years, but just purchased this twice, with both units arriving with defects and having to be returned. The first came with a very visible gauge in the head (shipping box was fine); the second came with a wobbly, unstable head. KitchenAid's instructions online to troubleshoot the unstable head seem to apply to an earlier or later version of the mixer - they refer to a flat screw in the shaft to tighten, but this model does not have a screw following that description, just something that looks like it requires a special key or part. Super frustrating.",
        "Excellent product, but lamentable quality bowl (said Polished Stainless Steel with Comfortable Handle), and whip accessory. After 3 weeks the bowl turned up with spots of rust (see one spot on the photo) and the whip turned up into black powder after washing. I just need to replace these 2 accessories but not really planned in Amazon : you need to return the complete shipment which is a burden due of the weight of the box ! 6 month later a new and serious product occurs. There was a crack in the metal which made the head to jump up and down while spining the flour in the bowl. The quantities never exceeded 6oogr. See the photos.",
        "I’ve never had an Amazon issue but wow, this one is bad. There is goo all over the side and the machine sparks and blew my outlet fuse. This is suppose to be new so not sure why it’s disgusting.",
        "The stainless steal bowl and or other parts BLEED A GRAY -BLUE substance into the dough!! I have sent mine back to Amazon and they were very helpful in doing so. I would NOT reccommend any appliance like this one that soils my baking/ foods! A sad day that the WONDERFUL old kitchen Aids of the past are now defective .",
        "DO NOT BUY THIS. Its an unsafe product. The jar comes out while the motor is running! so disappointed with Kitchen Aid. This is the third time I gave them a chance (this was my 3rd stand mixer). The white ceramic dough hook coating chips after 4-5 uses. Please do not buy this - its so dangerous when the bowl starts to come out and the blade is still moving. Very very scary.",
        "I paid 537$ with shipping and tax but this is a refurbish one. Very disappointed with the quality. Amazon you are cheap and shame on you .I can't return this because I will only get 294$ ONLY THE PRICE FOR THE STAND MIXER. I really don't recommend anyone to buy this unless you are in the USA .then you can get the good quality. The bowl is cheap Indian made . Shame on you KITCHENAID. Very disappointed",
        "I’m so disappointed. My KitchenAid broke after less than 3 months! The front metal nob came off while I was mixing cookie dough and the nob plus some screws flew into my cookie dough. I’ve owned other KitchenAids before and usually love them. However, I’m leaving this review because I’ve had a super difficult time reaching someone in customer service to figure out plans on getting a replacement. I’ve been calling for days and been put on never-ending holds. I’m beginning to doubt the 1-year warranty claim. 🤷🏻‍♀️",
        "I bought this as a replacement for 6 years old Kitchen Aid Mixer, and I have to say the quality is not the same. There is no spring on the tool lock mechanism anymore so the tool can move around slightly. 1 spring per mixer must be a huge saving for the company! The motor is not as quiet as the old one. Considering how things would be 5-6 years from now, I think I will look for another brand if something happens to this one.",
        "I love my mixer. But I am wondering. Does anyone know if there is supposed to be a spring that helps hold the mixer paddle in place. My mixer doesn’t have that spring. When I mix the machine makes a loud noise and the mixer paddle doesn’t stay in place. Slips and shakes. Don’t know how to contact company.",
        "I'm very disappointed. I received the mixer with scratches and stains. could be more careful. I'm crying. came very spoiled",
        "Updated: Ordered mixer 3 times. First mixer had a dark mark in the finish. Second mixer had two scratches; the speed lever doesn't work properly and something rattles inside when moving the lever; it is missing the spring that holds the attachments in place. The third replacement mixer is missing the spring and the whisk attachment's finish is very poor. Very frustrating. KitchenAid should not be selling scratch and dent mixers on Amazon. I won't ever order a small appliance on Amazon again. No problems at all with Amazon.",
        "I have had an original Kitchen Aid mixer for 4 decades. Needed something to handle tough Christmas Cookie dough's and the Kitchen Aid worked perfectly. Several other mixers bit the dust. But, the head on that unit does not tilt. It is a bit inconvenient to remove the beaters. So I bought this newer 5 quart unit (the original unit is 4.5 quarts). The glass bowl accessory is nice, and the tilt head is really marvelous. The pouring shield on the original unit fits the bowl completely but the shield on this unit does not. Not a big deal. Highly recommend and the copper color is beautiful. I plan to keep them both.",
        "I bought this product and only used it roughly 10 times since Oct-26 2017. 1 year later it starts performing super inconsistent, as the mixer won't turn on sometimes, and even it does, the machine is making some terrible noise along with some spark and smell of burn coming inside from the mixer, looking like it might explode or something. Notice that the mixer is only operating at low speed and that quality is definitely not looking like a $300+ equipment. Overall I am Very disappointed and looking for a repair or refund from KitchenAid.",
        "My wife was all excited to receive her new mixer. She first made sugar cookies. It worked great. Went to make frosting and it would not turn on. Lasted a whole 4 minutes. Hope the replacement lasts longer than that. Back to the 15 year old hand mixer I guess",
        "We had an earlier model of this and loved it. That one worked for 15 years. This one never worked really well. The paddle doesn't fit the bowl so the food at the bottom is never mixed in well. The motor is louder than our previous one and just keeps getting louder. I am pretty sure it is about to die and we have only had it 3 years and only use it once a month on average. So disappointed in the low quality... I thought I was getting a nice heavy duty one. Will not buy another one.",
        "My mixer works great, but when I received it there was a problem with arm lock mechanism. I called the U.S. based customer service and spoke to a very pleasant representative who immediately sent a new unit to my home. My new mixer arrived in a few days and works perfectly. I probably wouldn't have bothered to review this product except for the fact that their customer service went above and beyond my expectations.",
        "Every batch of cookies makes the head buck up and down. The beater leaves ingredients in the very bottom of the bowl so that it needs to be manually scraped. The “stir” power setting is good, but the motor gets hot and it whines if you use the lowest setting too long. NO, I do not recommend this product.",
        "I hadn't use but a month an it started vibating so much the \"nail\" or I don't know how to call it that holds the head of the mixer begins to pop out from one of the sides. And also the bowl get loose and I have to hold it down in order to keep using it. I don't know what I'll do since I can remember where I put my waranty and all that.",
        "I was so happy with my purchase until the second use.. its started having problems, now, 5 months in i need to throw it away since it doesn't work anymore.. what a waste of money, wish they did some quality control! Need to now spend 400$ on buying a other one!",
        "I spent over $277 on this machine in July 2018 in anticipation for the holidays. I haven't used it because I haven't had a need for it before now. I just went to use it for the first time and the knob on the mixer is bent downwards. It won't budge whatsoever. Unless you use the mixer, there is no way to know that isn't the design. There is no way for me to return the product.",
        "I have owned a KitchenAid mixer for over 30 years and it is still working fine. I got this for a youth group that is learning to cook as well as a small hand mixer. We are having a lot of fun . The slow speed is great as well as the higher speeds. Have not made bread with it yet but I am pleasantly surprised that I like it as well as my old one so far. The kids come from homes that do not even have a working oven and they love this mixer.",
        "☆☆☆IF YOUR MIXER IS BOUNCING, CLUNKING, OR JUMPING ACROSS YOUR COUNTERTOP☆☆☆ There is a screw that when you lift the mixer head located in the joint, tighten or loosen it until the mixer head is level (MAKE SURE THAT YOUR COUNTER IS ALSO LEVEL) I didn't know about this until extensively researching, and being frustrated to the point of wanting to throw my mixer in the trash. After adjusting that screw to perfectly level, it works soooooooooooo smoothly. I LOVE IT!",
        "I was very disappointed in the mixing bowl, made in India. I was making cookies and put in lemon extract, the bowl turned my cookie dough black when it came in contact with the bowl.",
        "I have had this in my cart for 4 years waiting for a deal and finally found it. The item arrived yesterday and included the shield. What a piece of junk! There is no way to attach it to the mixer and it is basically useless. I have friends who have the previous version of the shield and it works great. Whatever ‘improvements’ they thought they were making by upgrading this shield, was a waste of meny and almost makes me want to send the entire thing back.",
        "I bought this 4 years ago and enjoyed it, using it solely for making the occasional batch of cookies or loaf of bread. Not a heavy user by any standard, never past the #2 setting. Never seemed that powerful but it suited my needs. Then I smell burning. Contacted customer service and between shipping it and fixing it it will cost $175. Really disappointed as I bought it on their reputation of being solid, lasting machines. If these are built to be replaced, then why not just buy a cheap mixer instead?",
        "I bought my wife one of these and within 6 months I was divorced. Twice! So, I bought one while I was single and not dating in hopes that I might bet to use it myself and next time I get married the thing won't jinx the marriage!",
        "This mixer was defective. It runs fine until you put the bowl on it then it started a thumping vibration. It damaged an extra attachment (KitchenAid KFE5T Flex Edge) I purchased new by chipping the tip of it so the mixer shaft was obviously out of round. Very disappointed. Am hoping these people will replace my extra attachment which I purchased elsewhere. It's right before Thanksgiving and I'm afraid to use it! The porcelain actually chipped off of the Flex Edge beater...I'm sure it's in a cookie somewhere. :(",
        "I registered this product on KitchenAid.com and discovered that this item was REFURBISHED, I bought the item 5/31/2020. No where in the item description does it state the product is refurbished. I expected New, especially for the price. Best to order directly from KitchenAid, prices are competitive and free shipping. With the price on Amazon + shipping it costs the same give or take a few dollars (for NEW from KitchenAid). I should have researched better before i bought this item.",
        "I did not even try out the product, because when I received it, I could tell that it had been repackaged and when I pulled it out, it had some kind of yellow dough still left on it. really disgusting!! I paid for a new one and did not expect to receive one that had been returned. So disappointing as this was to be my birthday gift.",
        "I sporadically used it for a year, then the pandemic came and I started to use it every week for mixing bread, cakes, and pasta.One of the attachments (the hook) got stuck and there is no way to remove it. I tried all they recommend, hot wet towel, oil, etc.. Nothing. So the only reason this thing lasted a year is because I was using it every now and then. As soon as I started a regular use, it broke off. Too expensive to break so soon.",
        "This is my wife's second mixer (the first lasted 25 years). Reliability is an understatement with Kitchenaid's mixers, they are great. As a baker, she puts the mixer to almost daily use. She bought the Almond colored mixer which is beautiful and matches the decor of our kitchen perfectly. The best part was Amazon's price of $291 for this 5 qt. mixer (note they appear to be priced by color). The packaging was perfect for such a heavy shipment and it arrived on time with Prime shipping. Thank you Amazon and Kitchenaid.",
        "My wife's 20 yr old Kitchenaid Mixer died 3 days before Christmas. Had a good run but poor timing on taking a crap. I immediately ordered her another one (Bordeaux) and it arrived the Sunday before Christmas. The new one worked fine on Christmas day and we did not try to use it again till New Years Eve day. Guess what?? Stopped working. So after one day of use mixing potatoes, it died. Come on Kitchen Aid!!! Get your Sh&^ together and stop producing cheap products and selling at high prices :( Obviously not the same company it was. We will be sending it back for immediate replacement",
        "I almost poison my baby . I can’t remove this steel dust from the stainless steel bowl .. it’s just keep coming.. I cooked all my pancakes and on the last one I noticed some dirty coloring in the pancakes mix. Thanks God I didn’t feed my baby with this crap. This pic I took after, I ruined my food.",
        "beautiful color! in the description or title it does not say Pink, but it is. wife loves it. adds a pop of color to our kitchen.",
        "I got this as a gift for my girlfriend and have never used it but she loves it. Im writing this review because I noticed some bad reviews left by people getting refurbs, the unit I got was brand new and came in a timely fashion. I did the steel bowl cleaning before the first use and have had no problems whatsoever. If you're gonna spend this much on a mixer kick in the extra hundred bucks and get a brand new one, you won't be disappointed.",
        "This is easily the worst purchase I’ve made based on reviews. The lock function does not work. It unlocks whether it’s on medium or low. The attachment cover wiggles loose and has fallen into my mix multiple times. To top it off, it just randomly shuts off whenever it wants. I purchased this is NEW and it is absolutely horrible. I do not recommend this. Had I not had shoulder surgery that put me out of commission for a few months, I would have used this sooner and sent it back, but now it is too late.",
        "The bowl does not stay in place and can easily become unseated. The KitchenAid instructions for the head height adjustment do not work despite being followed precisely. And the worse part is that the head moves so much that it causes the release lever to unlock, at which point the head lifts up and completely unseats the bowl and sends it crashing. I want to like it, I want to use it, but now I dread the thought of making anything that requires a mixer.",
        "Bought my KithenAid in February 2018. because i am in South Africa i had to buy an adapter because of the voltage that i needed to bring down. i used it 4 times (only on low speed) then it tripped my power supply in my house. it does not want to go on, my power fails when i switch it on. because i am in South Africa i do not have any guarantee, i can not return the product because the shipping fee too much. i always wanted a KitchenAid but is so disappointing now that i bought one.",
        "This is ok, I love the mixer but the aluminum bowl continues to leave aluminum in any kind of dough we use in it. We have tried to wash it several times and even had a new one shipped to us. Very disappointed in this brand, the quality is very bad, workmanship in the mixing bowl is very bad. I really wish we would have purchased a different brand or at least had the option of trading the aluminum bowl (LEAVES ALUMINUM RESIDUE IN YOUR FOOD) with a glass bowl instead. Stuck with a bad mixer, not recommended with the aluminum bowl!!",
        "Defective mechanism inside. The bowl also got all dark gray-ish and had stuff coming off it that completely ruined a stick of butter. Nasty. Returned it, and thank you for the refund. I think I'll stick it out and buy my next one in person and rather than online...",
        "It worked fine until it didn't. I have a 20+ year old KitchenAid Mixer that is still working and a 30+ year old KitchenAid mixer that is still working. I kept upgrading to get a more powerful motor, but I kept my older models. And thank goodness I did. You should get more than 2 years and 8 months from a mixer that says it is a workhorse. I'm sure it will cost more to diagnose and fix than it is to buy a new one. But I will no longer buy any countertop appliances from them. Be wary. They are not the KitchenAid of the past. Their products do not stand up to time.",
        "***The lid arrived warped and cracking some spots. Won’t adhere to machine while mixing.*** ***Paint is missing/dented and chipped on both spots and then some all over the machine.***",
        "I should have returned this before my return window expired. When mixing, it makes a colossal mess. It comes with a plastic cover that is supposed to keep ingredients inside the bowl but the plastic cover doesn't fit snug on the stainless bowl. The metal strip that goes around the unit is not snug on the upper part of the unit. It just seems cheap. I tried whipping cream in it and that worked great but trying to mix flour ingredients is a nightmare.",
        "I was about to use my mixer the second time and something came off -",
        "I had a KitchenAid mixer for 45 years. This one does not mix very well with the new style of beater. I even purchased the scraper beater and felt like I wasted my money. Have used it over the last six months and very disappointed in it.",
        "I love the colour, but the mixer head is a bit wobby. I watched a YouTube video of someone who had the same problem, took the head off and tightened one of the bolts - not too much but just enough, and that fixed it for a time, but as it works itself loose again I am having the same problem. May have to return.",
        "My product arrived as if it was used. It looks like it was used before. I purchased a brand new mixer. There are marks and dings all over this mixer! 300$ and this is the quality I receive. And the copper pearl looks orange. UPDATE: I actually called kitchen aid and told them what happened and they exchanged it free of charge and a different color.",
        "The manufacturer is orbital-y screwed up if they can't put the dough hook in the box prior to shipping. If Amazon forget to put dough hook in box then they should all be fired. Stupid robot dogs. This is really frustrating. The dough hook was why I purchased this counter top mixer in the first place. Now someone has to find a dough hook and order it to make fresh bread for all the children. Jeeze",
        "I like the mixer and it works fine. That said, it came with a tiny dent in the bowl and a quarter-inch scratch on the back of the mixer. For the price I paid, I expected it to be perfect when it arrived. It was not perfect. The makers need to do something about the people who pack their boxes as I am apparently not alone in this opinion. I believe they owe me, at the very least, either a partial refund OR a tiny bit of the white enamel to cover the scratch.",
        "Upon receiving the product and trying to register it online, I could not register the product. Not a good sign. I do not believe that this was a new device because the instructions say it should NEVER be stored with the beaters in place, and that is the way it is arrived. It appears to have been used. Quite disappointed in false claims.",
        "Torn between 4 and 5 stars. Its a great stand mixer, comes with all necessary accouterment, attachments are great. man does this thing take up space. anyway, trying to put it away, it rubbed against a large bowl and the scuff that it produced was so large it didn't really make sense to me. Like, the two didn't add up. little tiny tap, GIANT scuff and paint chip. well, so much for it being pretty. Still a great mixer.",
        "What can I say? Having had our kitchen aid for 25 years, I am impressed with the durability of the product. This was purchased as a Christmas gift for my son and daughter-in-law. Construction appears as solid on this one as on my 25 year old Kitchen aid. Considering how much abuse (never drop one on your toe!) ours has taken in a heavy use house hold, I wouldn't consider any other option. Pizza and bread dough is a breeze, as is pretty much anything else you throw at it. And the design still reminds me of the head of the creature in the movie 'Alien' for added coolness",
        "I just started using my mixer. I washed it and dried it before use. Now that I have added my ingredients and I am scraping the sides of the bowl with a rubber spatula, I see this black thing in my batter. Very very very disappointed that this happens. Especially now that I have a bunch of wasted ingredients. I would like to know what will be done about this? This just costed me XCD$70.00 for the ingredients. Let’s not start with the cost of the mixer.",
        "Had to send first one back as it was missing apart and the head flopped around, second one received had all its parts and needed minor adjusting. I bought it strictly for bread making. It is inadequate for anything beyond the lightest doughs. It is under powered for bread making, and wont be able to do more than one loaf at a time. I recommend getting a 600 watt professional mixer for bread.",
        "well.. it's just mixer. it's not worth it's money. assembly sucks, aluminum bend is not firmly adjusted, useless head-lock which \"just locks\" the head. why do I need to lock the head? it's so heavy so it will not lift up itself. i was really surprised that this one is the most popular mixer here. i would've sent it back, it's not worth it's money as well as it's bigger brother. but i was tired looking for something good here. Bosch MUM5/6 series would be great, but none of them are sold in US.",
        "I bought this for my husband as a Christmas gift. When he plugged it in and tried to turn it on it just makes a buzzing sound but nothing spins or moves. I think this happens to be a lemon of a product because Kitchen aid products have a fairly good reputation. What's worst there is no option to return it! Now we are stuck with a $300 dollar machine that doesn't work.:(",
        "I just got to use my KitchenAid as we have been in the process of moving and hadn't had the chance to even open the box. I plugged it in and attempted to turn it on and it threw a breaker and sparked... I moved it to another outlet and it worked but it started smoking!!! Now I have a useless piece of garbage because I'm outside is the return window... Super disappointed. I won't purchase from the seller again.",
        "After 4 months the bowl no longer stays on the stand. I can't use it to kneed dough which was the reason I bought it.",
        "If you are a foodie and don't already have a Kitchen Aid mixer, you should really consider making this investment for your kitchen. I'm glad I finally made the purchase. This mixer comes in a color for everyone. My color is green. TIP: I followed the Kitchen Aid mixer on Amazon for almost two years before I bought it. The best price can be found around Mother's Day. The highest price around Christmas.",
        "Just after the 30 day return window, my beautiful Kitchen Aid mixer is defective. I've only used it 5 times for easy mixing items! From the beginning, it had a bit of a squeak as you pushed back the gear level to low and off. Now the lever will not turn off at all. It just bounces forward. Can't use it safely if you can't turn it off! This was to replace my 20 year old Kitchen Aid that won't mix on slow speed and scatters flour or liquids all over the kitchen. I'm so very disappointed that Kitchen Aid quality is so poor it fails after 5 uses!!!!",
        "Makes bread making easy. The coating on the dough hook however has already chipped. I've had it 4 months. I'm a home cook and have used it maybe 6 times.",
        "Opened the lid of the box to see the poorly painted body of the mixer. I’m sure it’s a great mixer, but I didn’t get a chance to try it, as I taped back up the box and will send it back. I will ask for a replacement, but if the color is not to ‘scratch’, will ask for a refund the 2nd time round. For such an expensive mixer, would have thought the company would spend a bit more on quality control. Did they think (or hope) no one would notice the poor paint job?",
        "I love my new mixer. I have made bread and banana bread with it. It works well at mixing bread dough. Apparently using a mixer is better than hand kneading as there is very little extra flour needed. There is a bit of a learning curve at first. The mixing blades are on a rotating head. Not only does it mix, it rotates at the same time. Also if you find that the blades are hitting against the bowl you can adjust it. The screw directly behind the mixing blades. Just keep trying. You should get it eventually. I love this mixer.",
        "THIS WAS A REPLACEMENT FOR A MUCH USED OLD MIXER. THERE IS NO QUESTION FOR THIS BUYER THAT THIS IS A QUALITY MIXER FROM A RELIABLE KITCHEN APPLIANCE MAKER. THE MIXER IS QUITE HEAVY HOWEVER AND THE USER HAS TO HAVE HER HUSBAND MOVE THE MIXER TO ITS PLACE OF USE. ALL OTHER FEATURES AND ACCESSORIES ARE WELL MADE AND OF QUALITY",
        "my daugther and I got this for my oldest daugther 30th birthday, she has always wanted her own as she would use mine when she had heavy duty baking to do. She loves it and has not let her down, just like the other 3 units in the family. mine is about 20 years old and still going strong with heavy uses. These are the best affordable stand mixers on the market.",
        "The “clamp down” function to keep it from jumping up came pre-broke so I have to physically hold it down while hooking a bread dough or anything really.. thanks!! Expensive, broken equipment is my favorite thing to buy",
        "I was hesitant to get this because I saw some reviews saying oil leaked but once I found out how to prevent that I bought it. I washed and used it as soon as it arrived. I could not be happier with my purchase. I've been a stay at home mom for the past 9 months and found joy in baking Although I didn't mind doing everything by hand this helps a lot. It will definitely pay for itself.",
        "This mixer is so dependable, fun to use, and beautiful. Also bought separately the spatula beater and that's amazing. Setting it on 2 for kneading dough and only up to 4 for mixing is plenty fast to get everything mixed and fluffy for baking. It has power like I've never seen with any other mixer. It whips up cold butter in no time, just cut it in inch long pieces first. Hope this one lasts as long as my grandmother's lasted for her. Highly recommend the Artisan 5 quart mixer.",
        "I bought this stand mixer on Black Friday plus the glass bowl and some accessories. I love having 2 bowls. The glass one is beautiful and easy to clean. I make bread a few times per week and it works great. I should have bought one years ago. It’s so easy to make whipped cream and so many other things. I especially love the grating accesory for hard cheese like Parmigiano Regiano",
        "Be sure to clean the stainless steal bowl extremely well before first use. I cleaned it before I used mine with soap and water but halfway through baking my first batch of cookies, I noticed my dough was turning gray is places. It was the residual stainless steal sealant they use on the bowl that was coming off (normal from what I read online, but gross). If you have stainless steel cleaner, I would recommend using it as after I cleaned it with that, I had no other problems. Love the machine as a whole.",
        "I first tried one of the refurbished models with no luck. It had a terrible vibration when it tried to knead bread dough, so I returned it and bought a brand new model. It is beautiful, well packaged, but when I took it out of the box, NO SPLASH GUARD! This model was new and stated on the box that the splash guard was included. I'm disappointed but won't be returning it. I've made some wonderful bread, grated cheese, and coconut, and baked a cake all in the first week! KitchenAid definitely is the Cadillac of mixers!",
        "The old one was going bad for a while & finally went up in a cloud of smoke (after 25 years). This one is sooooo smooth in comparison. The color selection is really nice too. The old attachments still fit since the design hasn't changed over time. These mixers last a long time",
        "I bought this mixer to replace one that broke. Deliberated on colors for about a week. The color I chose was Majestic Yellow. I was expecting a bright, bold yellow. No. This is a dull, butter yellow. I'm disappointed. Definitely not what I was expecting color wise.",
        "It was a bit heart-wrenching to have to replace my original mixer because of a kitchen fire, especially after reading some none-too-stellar reviews of my beloved kitchen aid. Still went for it, and glad I did. However, the mixer needed adjusting when it was brand new - what's up with that?? The paddle was too far from the bottom of the bowl and it also didn't lock down very well. Fortunately, one adjustment solved both problems. A handy dandy video on the website showed the hidden screw and how to adjust it.",
        "It doesn't work. The first time I used it there were sparks coming out and it was making a horrible screeching sound. I called KitchenAid to get a replacement and they sent one with scratches and dings on it. Extremely disappointed.",
        "This is my third Kitchen Aide in fifty years. Needless to say, I love them. This model features a tilt head for easy removal and mixing. Anyone who has used a Kitchen Aide, will repurchase. They are solid, steady work horses with multiple features making them versatile and cost effective. If you haven’t had an opportunity to try one, do your self a favor. You will become a devotee as well.",
        "As everyone mentioned, the bowl lets off black residue even after cleaning with dish soap, baking soda paste, and dish soap again. It even smells like rusting iron. I recommend using a glass bowl if you want to keep using the machine. Also, the metal strip on the side with all the writing is loose and flimsy, as if not glued on properly. At least the motor seems to work fine, albeit quite loud. Overall, not too pleasant.",
        "This. Thing. Is. Life. Changing. If you like to cook especially bake, your life is going to change forever. I made 6 pies the other day for FUN. Who am I?!? I’m obsessed with this mixer. I’ve made pies, cakes, cookies, pasta, bread, muffins, every pastry ever basically. This thing is my most prized possession now. I love it more than I love my kids and husband. It’s heavy too so that’s good. Attachments are pricey but omg if you want to take it to the next level you need them all. So amazing",
        "The mixer came with a big and noticeable scratch at the top and it was all dirty with some heavy stains in everything (bowl, mixer & accesories). It looked like used but I read another user that got it the same way so I guess some of them come like this. The cookbook came with pages already flipped which was odd too. We got this for a present so we cant just send it back halfway through the world, pay for the shipping and wait for a couple of weeks.",
        "Biggest enhancement of my kitchen. Worth every penny. Very strong motor that could probably stir concrete. Mixes things so fast. All the attachments are great. You can throw away your clunky food processor and lots of gadgets for peeling, slicing and coring that are cluttering up a drawer. This thing does it all. The worst part about it all was trying to decide what color I wanted. LOL.",
        "Totally typical of today’s junk products. These mixers from KitchenAid only last two decades. So disappointed with my previous experience. I only used my old mixer about 2000 times before it broke. Hoping for similar results with the same model again.",
        "Bought in April and the first two speeds no longer work. Customer service has wait times between 40 min to an hour and I was going to get a replacement but just got a call the item is now on back order and will not be delivered as expected. It was working so well prior to last weekend.",
        "My wife always wanted one of these - and while they’re not cheap, you will use it often if you bake! Also good for shredding pork or chicken etc. Sturdy high quality product. We’ve been using it for 9 years and it’s still like new. Easy to clean and maintain.",
        "The attachments that came with it were already rusty when they arrived which was a surprise considering it’s made of stainless steel. We returned the product. The third-party seller was difficult to communicate with and kept sending generic messages. So frustrating.",
        "Purchased this as a Christmas gift for my wife. Her baking was incredible before she started using this but now it's even better! Trust me when I say that the mixing of your ingredients is EXTREMELY important and if you use this mixer it will taste better! There are all sorts of attachements you can get as well to do many different things. Great brand and great product!",
        "Still in its original packaging, this product arrived damaged. Clearly KitchenAid needs to improve their quality control processes. Amazon, on the other hand, made returning and exchanging the damaged mixer very easy!",
        "Didnt come with the normal shaft spring to hold on the beater. I called kitchen aid and was told they discontinued the spring due to issues. I said what issues ive had a kitchenaid for years with a spring and had no problem. She stated that people couldnt get the beater off the shaft, i said ok so now we are not going to be able to keep it on? There is nothing to keep it on firmly only the shaft with the pin. She said yeah there are less problems that way, its been tested. Buyer beware if you purchase this it may not work like it used to",
        "Left residue for the first batch even after thoroughly washing. The bowl was oozing this black gunk out of it during it's initial washing and wouldn't come clean. Washed with soap and water then wiped dry with paper towel a few times. Then first mixing and washing there was still some residue. Threw out the first cake made with it because of whatever the unknown substance was. Later batches seemed better. The finish on the standard mixer paddle was chipped a bit at the top but doesn't affect anything. Seems pretty solid so far after a week of use. Girlfriend loves the color.",
        "I don’t use it much but noticed that white coating on the attachments started to chip and fall apart which is making it unsafe cause this white coating can fall into food. When u do something heavy like dough the bowl coming off at some point and starts to ‘dance around’ so I need to hold it tight with my both hands. They should do it this way that bowl will sit tight on it’s base, I saw other people mentioned this problem also.",
        "This was a birthday gift for me. My hubby told me to get what I wanted. My old Kitchen Aid was wearing out. I purchased it 18 years ago. This was wrapped extremely well. I did not have to scour the stainless bowl at all as some had said they did. It was bright and shiny. It works great and if it lasts as long as my other, someone will get a great mixer after I leave this earth. Glad to get it cause it makes my life easier.",
        "Making dough like I usually did for the last 7 months, when the motor started smoking. Switch wouldn't turn it off. Lock down button quit the first week; used a rubber band to hold it in place. Mixes very nicely. Very handy.",
        "I had my last KitchenAid mixer since I went away to college, and it served me well, but it bit the dust after about 15 years. This was my replacement and it's a great neutral to go with stainless steel appliances.",
        "I absolutely love this machine. My husband got it for me a Christmas gift and I couldn't have asked for a better one. It works great, is easy to use, easy to clean, and I love the color. It came with all the attachments pictured and I have already used it many times to make different things. I would highly recommend this product.",
        "This mixer is exactly what i wanted. Works great, new out of the box, and easy to use/clean. People saying there are melting shavings that come off the metal bowl when using. That's because they are letting the mixer hit bowl when using. You have to adjust the mixer level to where it's not hitting the bowl. Problem solved. It has a setting where u can raise or lowel the level to your preference.",
        "Yep, less than 20 use and the bowl will just come off once it starts doing its work. Bought it on Thanksgiving 2017, be warned.",
        "Love the KitchenAid Artisan!!! Going on 5 years of purchasing this mixer it works like the day it was delivered! We've used this for desserts, doughs, icing, Masa, grounded meat with the attachment, etc. It works amazing all these years later. Super easy to clean. The dishwasher does the trick. It's a little loud the higher you put the speed. If you're speaking to someone next to you, might have to speak a little louder. Other than that it's amazing! If you're in the kitchen a lot, make your life better and get one of these mixers!",
        "Love the lavender cream color- it is exactly as pictured and couldn’t be more thrilled. Great quality and gorgeous mixer.",
        "My previous stand mixer was 19 years old, I had always wanted a KitchenAid mixer, so I bought the 5 quart Artisan mixer in Empire Red, my only regret is that I didn't get the Buttercup. I am really enjoying using this mixer, it's quieter than I expected. Apart from ease of use washing up is a breeze, my only complaint is the pouring shield it is ill- fitting so it doesn't prevent splatter."
    ]
}