{
    "entity": "Stand Mixers",
    "text": [
        "My girls got this as a present for their mom. Just opened. Using NO ICE, SOFT ice cream, and lots of milk, three milkshakes went off without a hitch. For the 4th one (which happened to be mine; adding insult to injury), the shaft just snapped right out of the cheap metal ring that holds it in the egg-shaped head. Plastic shards rained down into my milkshake. Birthday gift broke on its first use. Sad girls. Sad mom. No milkshake for dad. This thing is a cheap piece of crap.",
        "I bought this mixer to make tiki drinks. I first used it the other night to make a “three dots and a dash” drink. This is essential, because the recipe calls for flash blending. It’s very easy to use, with two speeds. I gave five stars on durability, but only time will tell how long this will last. But for the price it’s perfect for my needs. It also has a cool retro look. I noticed some other reviews saying that it makes a mess. As long as you don’t overfill the cup, it’ll be fine. I recommend this for people making tiki drinks. This is what was used back in the day before cocktail shakers!",
        "Purchased this as a replacement for the same appliance that we've had for almost 20 years. Our old one had a broken wheel/paddle on the mixing component and we ordered a replacement part, but over the past 20 years, upgrades have obviously been made to the product and the stem end was different so our old mixer would not accept it. So far, so good with the new mixer (which the replacement mixer head fits, so we have a spare!). I hope this one lasts another 20 years!",
        "Very nice looking mixer loved the style and the color. First time I used it the motor burned out after 2 uses you could literally smell it burning. Amazon replaced it quickly with no problems but the second was just as bad. This machine is not made for mixing shakes. I am very disappointed I grew up and have always purchased Hamilton Beach products. I might have to go out and buy a restaurant drink mixer.",
        "Had some strawberries from my garden, a couple of scoops of vanilla ice cream and a little milk...let it go, and in the end, all strawberries in the bottom with milk on top. I'm tossing this piece of crap and buying one of those small mixers that have blades on the bottom...this only has a small plastic little round thing on the stim. No good.",
        "This is a $40 machine. It is not a $100 or $200 professional commercial machine. Nor is it the $20 piece of crap that I purchased from the TV channel shopping network that lasted one year. I use it for Protein powder and vitamin mixes and I love it. This machine has a little more power and is definitely a step up in quality compared to my old Tv nostalgic model. I am NOT crushing ice or mixing concrete - if that is your purpose you need to use a blender or upgrade to a commercial model. thanks.",
        "I use this blender several times a week, it has saved me a ton of money on buying shakes and malts. It wont crush ice or do fancy blending like a traditional blender. But its a quick and inexpensive way to make shakes and malts. only cons are: If you set the blend setting to high all the liquid rises and spills all over so you can really use the highest settings. However on low it works good, and mixes the milk and powders really really good. If you want homemade shakes and malts this is a great little gadget.",
        "This makes TERRIBLE milkshakes. It does not mix the shake consistently, leaving big globs of ice cream at the bottom of the cup. The ice cream that is mixed is over mixed into a frothy, airy consistency- nothing like a desirable milkshake consistency. If you try to blend evenly and move the cup down, it sprays and splatters shake around. And finally- the unit looks incredibly cheap up close. It looks like metal in the photo provided- but you can tell that it is plastic instantly in actuality. Will be returning as I only bought this to make milkshakes.. and it makes terrible milkshakes.",
        "I use this mostly for whipped cream. The blending attachment is too small for ice cream shakes. It takes too much effort to break down the scoop of ice cream when it first enters the blending container, leaving the shake with lumps of ice cream.",
        "Item is plastic and the power of the motor is very weak. I doubt it's ability to make a thick shake. I returned it without any issue thanks to the always great Amazon service. Incidentally, this was the first time I experienced Amazon's new return label process. They email you a barcode that you let UPS scan. So, you pack up the item and bring it and the barcode to UPS. UPS then prints out and attaches the label for you.",
        "I have started drinking protein shakes and the powder is a bit hard to get down. That was until I got this. Shakes turn out fluffy and thick and delicious. I also mix the powder with almond milk rather than water now (full disclosure) but all I had before to mix it in was a shaker cup. This is so much better. I could taste the grit of the powder before but not anymore. Highly recommend.",
        "I worked at dairy queen for two years, so I know how to make a shake. Having said that, this product is terrible. Broke after four uses, mixing with a fair amount of milk. Please just get a better mixer with more torque, this machine is underpowered. Spend the money and avoid disappointment.",
        "Lasted 8 months with limited use (not daily). No warranty info. Cheap but not if you have to buy new one twice a year. Save the money and get a regular blender.",
        "After more experience with the device I decided to change my review to a higher rating. It does make pretty good malts. I am getting better with it.",
        "Gave this as a gift for Christmas- bought extra cups etc.. bought everything to make milkshakes for the kids and motor burned out on 2nd milkshake! literally milk and soft ice cream...brought this thing to its knees.. Very disappointed. Returning and buying a blender",
        "The mixer is definitely under-powered. If you are ok waiting for your ice cream to soften or if you are ok with a thinner consistency shake, you'll be ok using this one. Otherwise, get something with more power for blending thick shakes or right from the freezor ice cream.",
        "Wasn't a great mixer. The spindle is small and plastic and can hardly mix. You have to use very soft ice cream. It worked for probably less than 10 shakes and then the spindle fell out and slid down a bit while it was mixing and bent and broke the inside of the machine so you can no longer put the spindle in. Completely ruined already.",
        "This mixer is cheaply constructed and did not last 7 months with less-than-moderate use. It was bad enough that the machine doesn't use a standard cup and is underpowered, but the unit just completely died without warning. I wasted my money on this item.",
        "This is my second one, I wore out the first one. The grandkids love when I make them malted and that is the first thing they ask for when they visit. Reminds me of the good old days of soda fountains and soda jerks, I was one when I was in high school back in the 50s. Lots of fun and lots of memories.",
        "This is not the heavy duty mixture machine as the old fountain has. I found it does not mix ice cream and milk well. The old fountain machine you just had to slip them in and away they would go, mixing the milkshake well. This unit needs constant monitoring and moving the cup around so everything is mixed first time. This you have to babysit.",
        "I purchased this as a Father’s Day gift for my husband, who is impossible to buy for and frequently returns the gifts that I get for him. He loves this! He makes milkshakes 3-4 a week and this is so much easier and quieter than our blender. Easy clean-up too! Good price and quality-definitely recommend.",
        "this is NOT all metal. it is chrome colored plastic. the cup is stainless steel. it works but because it's cheap plastic i wonder for how long. way over priced for what it is. i would have gotten the cheaper plastic one had I known this was plastic not metal as described.",
        "We have only had for about a month. But so far it works way better then a blender, or my blender. I also use the mixing beaters from my hand mixer that is also HB. They work way better then the mixer that comes with the maker.",
        "bottom of mixing cup is almost flat and no lip to stay in place. i believe there is a quality control issue with hamilton beach. this machine is horrible to use with the factory cup. does not make thick shakes very well.",
        "Well I love the style. I like the power of it and the price. But the motor burned out after about 15 milkshakes on 3 different days. I think I just got a dud, it happens. I gave it four stars because I do like it and will exchange it for a new one.",
        "Thought it would make a milkshake better then my blender. Bout same. Only not as much cleaning",
        "even though it didn't work for what I purchased it for. I was attempting to use it for my morning milk drink mix. Milk is nowhere near heavy enough, it ended up all over the place.",
        "My parents got this milkshake maker as a wedding gift 20ish years ago and they still have it. When my blender wasn't keeping up with the thickness of milkshakes I like to make, I knew it was time to invest in a tool specifically for the job. I've already used it many times and love it. A must have for any milkshake-aholic",
        "My wife and I love using the mixer. The only problems we’ve had are that the motor gets hot surprisingly quickly and that thick drinks don’t mix well. Recommend if you’re just making quick milkshakes for at home!",
        "I've never made milkshakes before, but this machine made it a breeze. As a matter of fact, my milkshakes were so good, they brought some boys to the yard and they said they were better than yours. So this was a great purchase.",
        "I shoulda just used a regular blender. I figured it wasn't diner quality, but it might as well be at Walmart for half the price. some metal parts but mostly shiny sticker and plastic. doubt Ill use it and too much trouble to send it back from Japan. Just use a blender to make your milkshakes..",
        "This is a nice machine but the stirrer does not seat securely. Expect the stirrer to fall out three or four times while mixing a milk shakr.",
        "Having grown up in days of soda fountains and Malt shops and was Soda Jerk my self I know how to not abuse this, its cheaper made than the originals there for don't cost 300 bucks, You cant make it a blender or cop up cookies and M and M candy like its a blender, Its a Shake or Malt maker only, Most of don't know w what a Malted milk shake is,,",
        "Quick delivery. Love the mixer. Finally able to make Bulletproof coffee without hot coffee breaking another blender.",
        "I was a little hesitant to order this after reading some reviews saying that it didn't have much power. I'm glad I ordered it anyway. It's perfectly powerful for a shake maker. It's not a blender and I wouldn't count on it pureeing anything like fruits or vegetables or ice but then again it wouldn't really be safe for it to do that given how exposed the mixer part is. It's a great looking mixer and in this chrome color could fit well in a retro or a more modern kitchen. I'm really happy with this purchase",
        "My wife got me this this for my protein shakes , works fantastic, looks great. Old school one's were a bit heavier and solid ,this one works just fine and doesn't take up too much couter space 👍",
        "I purchased this drink mixer based on Martin Cate's recommendation in his Smuggler's Cove book. It's great for a home bar. I've used it to make non-tiki cocktails as well, such as whiskey sours (with egg whites) and it has never let me down.",
        "The only reason why this review is not 5 stars it that I wish it was all metal and a bit more sturdy. It works great though.",
        "I have mine, love it, and bought one for very closed friend. Her husband, children have also loved it.",
        "Bottom line is the mixer does it's job just not as well as I thought it would. softer ice cream is not so bad and you do have to follow the MFG instructions on how to blend, but harder ice creams almost always come out with little chunks. Also, be sure and not over fill the cup as when the mixer is put on speed 2 the volume will increase and you will have a mess. I got it from my kid and for him it is great. Perfect way to let him have a snack without the mess and the fuss.",
        "what can I say when I was looking for old style frappe blender like in ice cream shop I was disappointed with the quality the plastic spindle serves no purpose and the noise is extremely loud. bottom line very disappointed when attempted to make 1st Frappe have only used twice to much hassle to return Hamilton Beach should have never allowed their name on this product",
        "This was a gift For my teen son. He’s really enjoying it, and even mentioned how easy clean up is!",
        "Bought this mixer so I could flash-blend tiki drinks...It works fine for that. The housing is plastic but at this price, you shouldn't expect more than that. It's a decent entry-level mixer.",
        "If you are using this to stir chocolate milk or mix drinks, fine. If you want to make a milk shake, forget it.",
        "Used it about 5 times now and I see no problem! It’s quick and pretty powerful. I don’t see why some of the bad reviews but again I only have used ice cream. I don’t think it’s meant to make smoothies with frozen fruit.",
        "I bought this for my wife who enjoys milkshakes. This does exactly as advertised. I am very pleased with it. Some reviewer's have stated that it does not mix well. If you follow the instructions and give it up to 3 minutes it does the job. Be sure and pour in the liquids first. It is not a blender. I have been very pleased with this and would buy another one if needed!",
        "I bought this to use to froth my milk after my expensive milk frother broke right away. This is on my counter and I use it every morning for coffee.",
        "I’ve had this for about a year now. Works beautifully. I do not use it to make milkshakes. I use it to make Greek frappe and does a great job.",
        "Was looking forward to using this for shakes to try to gain weight. The beater will NOT stay in, as soon as it is turned on the beater falls off. Worth less!!",
        "Used 2 times. 2nd time the motor went out. The icecream was soft too. And i added icecream in small bits...",
        "This blender could be made with better quality pieces, such as a metal mixing piece instead of plastic so you don’t have to worry about it breaking off. Altogether though, it works fine as long as you have enough liquid in the cup.",
        "Works well, plenty of power and one of the quietest ones I've seen. Doesn't really have a slow speed, just a fast and a faster is the only drawback.",
        "It's perfect and easy. Doesn't take up much room at all.",
        "Item had clearly been used when it was supposed to be new. I’m very disappointed that I have to return it.",
        "Not as great as I thought. This thing takes forever to make a milkshake I just use my blender. But I love the way it looks and I keep it out for that purpose. I have a country 50s style kitchen and it looks good on the counter. You get what you pay for I guess.",
        "What do you give the person who has everything?...A Hamilton Beach Milkshake maker. Perfect gift. Easy to use, Easy to Clean and looks great on the kitchen counter.",
        "It's okay, and good that it's inexpensive. It doesn't work extremely well because the \"blades\" that mix the shake are extremely small. Would not recommend.",
        "I read the reviews and decided to get this for me and the girlfriend for when we are being fat and making milkshakes. This thing sucks. It barley mixed the first milkshake, literally vanilla ice cream, milk, malt mix and nesquick mix. Motor burnt out on the first cup. Returned right away. Will be going with a different brand for sure.",
        "Built solid, looks nice but i dont know how this product was made to blend... maybe eggs or something but definitely Not ice cream. Also very loud. I would not recommend this product if your looking to make malts it shakes.",
        "Was a gift for my granddaughter she loves bbn it",
        "Got this for my 14 year-old daughter for her birthday. She has been very pleased with it and enjoys making milkshakes for the entire family.",
        "My granddaughter loves milkshakes. Now she can make her own! Got it for her for Christmas...she loved it.",
        "Very flimsy, not stable not very strong stirring ice cream. Definitely not worth the price",
        "This one is nearly identical to one I bought around 35 years ago. One change, which was not an improvement, is that the mixer blade shaft does not fit as tightly as on the previous one. Sometimes it falls out when I remove the cup after mixing. This needs to be fixed. I got many years of good service from the previous mixer; the motor finally burned out. If I get even 20 years of service from the new mixer, I will then be too old to be mixing milkshakes.",
        "Great Seller. Great Product. Highly recommend this Seller. Bought four of these and grandkids love the milkshakes....",
        "This is a lot easier to use than a blender for making shakes etc. Love it. Easy to clean and takes up very little space.",
        "Gift. As long as it works as it says, it will be just what they wanted.",
        "Can't use it on very cold ice cream, motor gets weak very fast and can smell the brushes burning away.",
        "The plastic tip on the mixer rod probably won't hold up as it hits the container when mixing the ingredients.",
        "I love it !! to make scrambled eggs, mix drinks, smoothies, it works and it's cute!! it has 2 speeds, and the cup that comes with it is very handy too!! I recommend it and it doesn't take so much space, it's practical!",
        "I now can make shake the original way, like when I was a kid",
        "The plastic mixer blades do not mix the hard ice cream for milkshakes like the professional models. Also, the cord is very short.",
        "I bought this over 6 years and it's still running strong, very happy with it.",
        "I use this for cocktails and it works well. The drinks get very well mixed and very cold. Only real problem is that you can really only use it to make one cocktail at a time, but it works on a small scale.",
        "Meant literally for liquids only. No ice or anything thick like ice cream. Disappointed.",
        "Great product. It does what it's advertised to do. It's easy to clean up and has sufficient power to really whip up a drink. In fact, I found it makes a protein drink too frothy if left on more than a minute.",
        "Great product. My 11 year old uses it regularly. A great addition to our household. Just like the ice cream shop!",
        "You will find your blender is collecting dust if you start using this item. Great for malts, milkshakes and smoothies. SUPER EASY clean up. Alot safer than a blender almost any one of any age can use it.",
        "I bought this as a gift for my Dad who loves milkshakes and smoothies. He loved the retro design with the sidecar. His only comment was that this is only for a milkshake. The style of the blender set-up doesn't allow for anything else to be made with it, like a fruit smoothie. If you want a milkshake maker, this is perfect but don't expect it to work well with much else.",
        "Easy to use, Easy to clean and makes a super milk shake. I make my wife a shake and she keeps quiet for at least two hours --like an adult Baby Sitter",
        "Exactly what I was looking for. Metal cup, keeps milkshake cold.",
        "So much easier than running to the golden arches for a shake for my son. In fact, he makes his own now, love it",
        "This is the 4th Hamilton Beach one I have had. One of them has an unremovable stirrer and it does a better job of making thick milk shakes. Wish I could find another one like it. However the others are okay. Hamilton Beach is a good brand.",
        "We use this several times a month and qorks like it should!",
        "I love this product. It works great if you follow the instructions. My wife and grand kids are always asking me to make either a shake or a coke float. The only problem I have is that my ice cream budget tripled.",
        "It's easy to clean that's the good thing. Doesn't make thick shakes well needs better mixing beater it does thin shakes ok but plastic mixer isn't aggressive enough to grab and mix thick shakes.",
        "The results are great! Thick but creamy and delicious. Love it!",
        "If you're Greek and love making Fredo Espresso, you need this.",
        "Works like a champ and was well though out in design. Easy to use as well.",
        "my brother loved it. it's so easy to use and love the retro look",
        "I buy this product to make my nes cafe and i can tell you it's very powerful and awesome, it is more than i expect. And ppl please read instructions because this is not blender it's just mixer and very good one :)",
        "I was so disappointed in the quality and performance of this product. I guess I fell for the nostalgia. I should have known better by the low cost of it. I think if one wants good quality and high performance it may cost $200 - $300 to get it. Sounds crazy but I just may do it.",
        "The product is reasonably priced for a shake mixer you’d find used in ice cream shops. Easy to assemble & clean. Had a great time creating custom fountain drinks.",
        "I love to make milkshakes with this DrinkMaster. It is extremely easy to clean and makes a great milkshake.",
        "I 've used one of these for the last 15 years for mixing protein drinks. I figured it out and my old unit ran 24/7 for 27 days straight. The only reason I bought another one was because the plastic end on the stir stick became so thin over the years that it broke. (I use ice in my mixes) The old unit is still working",
        "I knew coming in that this was NOT a blender, therefore I did not expect it to do things a blender can do. That being said, I was able to make a chocolate banana shake with real ice cream and a whole banana that I mushed up a little and it blended together just fine. I didn't for a second think that this would crush ice or blend whole fruit.",
        "Very weak. Does not mix what I want it to. Wasted my money. I tried to make a shake with soft serve ice cream...it did not work.",
        "It does a great job with a softer ice cream and mix in’s. We have used it multiple times for groups and just quick single use. Easy to clean, and makes better blended shakes than a generic blender.",
        "It would not mix. Unfortunately I had it a few months before I took it out of the box and used or I would return it. I am going to have to purchase a different one.",
        "Works great for drinks, anything thicker and it just doesn't have the power... Comes up as a milkshake maker, gets hot, doesn't work well, and takes for ever! Stick to a blender!"
    ]
}