{
    "entity": "Power Strips",
    "text": [
        "Surge protector that does not protect from surges. I bought this protector to protect for my electronics. But just lost my Flat screen TV, XBOX one console and Cable Box since this could not protect it from power surge. By the way all those lights on still on giving me false hope of protection that it apparently kept giving all along. Bad product. Will never by another Belkin product.",
        "Don't buy this expecting Belkin to honor their \"Equipment Plug-in Lifetime Warranty\". They will not honor it. I had 3 surges and my desktop computer died. I sent in all the paper work as well as the piece of crap I bought. They sent it back and said \"It checked good\". \"It didn't show any signs of arcing or failure\" WELL IF IT DID, I'D STILL HAVE MY COMPUTER. IT DID NOT STOP THE SURGES.",
        "Works fine as a power strip, but that is not what I bought it for. We had a lightning strike near the house. The only items i lost were plugged into this: my big screen tv, Bose soundbar, Roku, Tivo, and my modem. Thanks for nothing, Belkin. Won't be purchasing anything from your company ever again. The items I had plugged into APC units survived, including 3 computers! From now on I'll stick with a product that actually does what it says it will.",
        "I purchased the surge protector by Belkin as it came with a $50,000 product protection warranty. After a few weeks my house had a power surge after a storm that resulted in the blow out of a new flat screen TV, a blu-ray player and cable box. As, requested, I sent the protector to the company, at my expense, and was told they could not prove that the protector was faulty. Those items were plugged directly into the protector and other appliances on other surge protectors were unharmed. I was told that my claim would not be honored. I would say BAD PRODUCT and a COMPANY THAT DOES NOT HONOR THEIR GUARANTEES. Stay away from them.",
        "I have a TV, XBox, 5.1 speaker system, twc dvr box connected to this outlet. Works great normally. Recently though i had a lightning strike very close by. It blew out my xbox, the speaker system and the dvr box, all connected to this surge protector. The surge protector didn't trip !! Isn't this supposed to protect against surges ?",
        "Arrived with a faulty plug. Would not stay connected to wall. Almost shorted all of my electronics. As I attempted to turn it on, each one sparked. The loose plug kept coming loose within seconds. Not my outlet as the previous Belkin had no issues for 4+ years with plug connectivity.",
        "I unplugged this Surge Protector once and the grounding pin broke. I know on some devices it's designed to come off, in case you have only 2 prong outlets but this one broke without any force applied to it.",
        "This Belkin Pivot-Plug Surge Protector model BP112230 doesn't have a built-in / resettable circuit breaker. Which means you have a power surge and it blows out. I regret wasting my money on this! Be smart do not buy this if you have a power surge it will burn out. Surge protector 101 you have a resettable circuit breaker. I am so upset I did not do my research before buy this. I warned you. If you buy it you will not be happy to have to throw it out with one power surge.",
        "Had this for two years ok.. Apparently a surge yesterday took out my Roku, my Tivo, two inputs on my tv, and my hdmi switch. After reading other reviews about the hassle of warranty, I'm saving myself the grief and moving on. I'll just buy new stuff and get a genuine UPS backup system which has worked well for my computer for years. I just got one for my electric piano too.",
        "Belkin is apparently incapable of making functioning on/off switches. This is the third Belkin power strip I have bought that the power switch broke (almost on first try). This one worked fine for a few days but about the 3rd or 4th time I pressed the power button, it broke. WTF? I am convinced Belkin either doesn't know how to make a proper switch or they buy faulty switches from a sub-contractor. Either way I am now convinced their surge protectors are complete junk... not because they don't work but because you can't turn them on or off without the switch breaking.",
        "I’m with all the other reviewers of this device. I have two of these Belkin 6-outlet wall mount surge protectors along with two accell surge protectors. In a recent storm, I had 7 breakers trip from some pretty bad surges. Everything behind my accell surge protectors is fine while everything behind my belkin surge protectors is fried. The green and red lights showing protection and grounded are still on. These things are junk! Belkin, you’ve lost me as a customer and you’ve made me even more sure that your competition is better!",
        "Belkin has a reputation for quality products and with this item they did not disappoint. The item I purchased was sold and shipped by Amazon. The cord and plug are heavy duty construction material. The rotating plugs allow for large items like timers to be added without having to use the short extension cords. This has plenty of outlets for my needs. The cord holders are only useful if the plugged in devices are located on the same end as the holders and are not thick cords. Constructed of quality material and Lifetime warranty. The only improvement would be if it came with a flat plug.",
        "Be advised that even though the description says WITH wall mount, wall mounting is the ONLY option. You have to install by removing the wall plate and screwing in the surge protector as replacement. If you have a double outlet as I did, you lose the second outlet. If this is ok with you, they are probably fine. But for me the loss of four plugs to gain six was not useful.",
        "Worst circuit breaker I have ever had--it had one computer plugged into it and would \"pop\" at least five times a day. I can't imagine how often it would turn off if I had used even half the sockets. Ridiculous. We use about fifteen power strip surge protectors in my business and I will never buy this brand again. I just bought this a week ago and am throwing it in the trash for being so bad.",
        "I've had this product for around 9 months. I loved it at first - the pivot allows those large plugs to be inserted. But recently, the devices I have plugged in have had power surges and, more worryingly, the red light seems to flicker randomly. I refuse to take any risk regarding potential fire safety issues, so I have unplugged it and will discard it. Other reviewers have mentioned that Belkin does not honor their warranty, so there is no recourse. I find this to be unacceptable customer service, so I will no longer purchase anything from this company.",
        "I regularly replace my surge protectors. They are taking invisible\"hits\" all of the time. And then there are the ones that we see...the power goes out, etc. Most people don't realize that the protection is decreased (or even non existent) after time. The higher \"joules\" rating, the better off you are. \"375 joules\" isn't going to protect that new LCD TV. Replace the surge protector every couple of years and DO NOT count on Belkin (or any other company) to stand behind their warranty. Just read the reviews of users who have had electronics damaged due to surges.",
        "This is one of the few surge protector that holds up what's advertised. The clamping voltage rating is truly 400, which is what we suppose to use for sensitive electronic equipment like treadmills and speakers. Many of surge protectors advertise as 400V but the product itself says 500V, very disappointed. Look at the 3rd picture of the product photo and you will see the voltage protection rating. It's not all about joules when it comes to surge protector. Yes, it looks bulky but I would get this again if I ever need a real deal when it comes to surge protection.",
        "Not sure why Belkins releases this surge protector. It is not good at all in term of plug in the power adapter and some power adapter it crosses over to the next surge protector plug in. Even I try to turn the plug down on the side and you still can not use the next big power adapter except small power plugin.",
        "Got this two months ago. Finally took it out of the box today. Doesn't work. I tried plugging it into several different outlets; it's like a rock. Nothing happens. UPDATE - Belkin has replaced the defective unit with a new, fully functioning unit.",
        "I bought this surge protector in September 2012. It is the only surge protector (out of four) that did not get fried during the power surges/outage from the big storm in March 2018, which I'm thankful for because I had my router, modem, two surveillance system DVRs and adaptors for sixteen surveillance cameras plugged into it. I not only lost those other surge protectors but some of the gadgets plugged into them, including a 40\" Samsung LCD TV and three digital lamp timers. I got another one of these surge protectors right after the storm.",
        "This product is completely unusable because of a unremovable screw sticking out next to the plug. My sockets do not have any screw holes so I can not even plug it in. Terrible design. I just needed it to plug in. It also has a piece of plastic sticking out in the same way, again making it impossible to plug it in because the protruding plastic stop it being flush against the wall. Useless.",
        "Very happy with the product. It is as described. I used it for the inside of my hardtop gazebo in my backyard, which allows me to run LED light strips, a fan and a speaker. If you want mounting options- consider Gorilla brand heavy duty double stick tape. That's what I used and am very happy. The gorilla tape is the ONLY tape I have found that will stand up to HOT temps, like we see in AZ. The metal gazebo gets HOT in the summer, but the power strip has stayed up thru the worst. Best feature of the power strip is being able to move/angle the sockets.",
        "If this unit was as reliable as it is versatile, it would be perfect. Instead, it can't even protect itself, let alone what is connected to it. I had had a brownout and the computer turned off and would not restart. I assumed the power supply (or motherboard) was fried, but it was actually the individual outlet that had died. Nothing works if plugged into that outlet. Luckily my computer was fine after a bios restore. Love the pivoting plugs that make room for all you power blocks, but a surge protector that cannot protect itself cannot protect your gear.",
        "Great for an extension cord but surge protector is not true because it fried my pc and lost 2 RAM cards because of it.",
        "I live in an area where we get allot of thunderstorms. After the last time lighting hit near the house and lost equipment I had the ground checked outside and to each outlet inside and installed three of these surge suppressors. Well just got hit again, I lost two 1 gig Network switches, a 55” tv and a Roku box. Don’t buy these if you expect them to protect your equipment.",
        "The most frustrating thing about power strips has been that the outlets are too close together to actually use all of them. Many adapter plugs are too wide or wrongly shaped to allow do use of all six plugs. By having these outlets rotate, one can finally actually use everyone of them. Finally! Finally! Finally! Someone has figured out how to make something useful.",
        "Bad investment. We bought one for home and immediately it blew with a spark and burned one of our power plugs. Amazon kindly sent a second one but the second one's USB ports died shortly after we plugged in wife's iPad and keyboard. Luckily it was within the return period and we sent it back and went to an APC surge protector.",
        "Belkin Size: 12-Outlet, Style: Phone Protection 8ft cord. 12-Outlet Pivot-Plug Power Strip Surge Protector w/ 8ft Cord. Model No. BP112230-08. Technical Specifications per the box (pictures attached) Continuous Duty Electrical Rating: 15A/120V/1800W. Maximum Energy Dissipation: 4320 Joules (H-N: 3600 Joules. H-G: 360 Joules. N-G: 360 Joules). Maximum Spike Current: 252,000A (H-N: 196,000A. H-G: 28,000A. N-G: 28,000A). UL Clamping Voltage (3-Line): UL 1449 400V. Response time: <1 Nanosecond. EMI/RFI Noise Filtration: 150kHz~100MHz up to 50 dB Reduction. Per the back of surge protector: Voltage Protection Rating: L-N: 330V, L-G: 400V, N-G: 400V. Type 3 SPD. Cord clamp at bottom is difficult to open, pull hard on the right side (it won’t break). Push hard again to close.",
        "The fact that you can pivot each receptacle to the side makes it easy to plug in items with enlarged plugs. You can stagger them so that none of them is directly above the others. Or, you can keep them all facing forwards if you desire. It's up to you. Been using mine and only have 4 things plugged in at the moment, but I do have 2 of them flipped to the side so that the cord isn't sticking straight out from the wall. (Mine is plugged in under a window, so this keeps the curtains from sticking out too!)",
        "They didn't stand by there warranty as promised and refuse to respond to our case number to resolve our problem with this Belkin 12-outlet pivot-plug power strip Surge Protector w/8ft.cord as this did not protect our 75' Samsung QLED TV",
        "Did my research and got this one. Has good energy rating Has led lights that let you know when the surge protecting ability is used up Rotating plugs are nice So far so good Some reviewers did not like that the unit only has one set of metal prongs, with the other set being plastic. Truth is, that is totally fine. Your standard double plug wall outlet is usually powered by a single drop anyway (unless one is set up as switchable), so even if this has metal in both contacts it really wouldn't change its power ability.",
        "Beware of this and other Belkin items! They are not durable. If you trip the protection circuit, it is not re-settable and you are left with a useless piece of non-recyclable landfill. Learn from my mistake; I finally have.",
        "I would have given this 5 stars, because it does what it needs to do, but the slightest tug from anything plugged into it pulls it out of the socket. I know most people must be using this as an attached piece, but I'm in an apartment where I can't go drilling holes in things and thought I could just plug this in and have the secure fit of many other 3 prong plug devices. Should have gone with a strip that lies flat on the floor, but I'm dealing with it.",
        "I have three of these extenders around my computer work space at home. Each power extender charges chords from 3 computers, multiple tablets , three lamps, a modem and a router. The one distinct feature of this extender is that the outlets are adjustable on the extender like a wheel. Several computer manufacturers are creating power chords in the design of a brick. When connecting that brick on a horizontal power extender, it can take up other port openings on the extender. Fortunately this extender allows you to adjust each power outlet, so it can fit a power brick supply chord at a different angle on the extender.",
        "I mounted this to the underside of my standing desk for WFH. I needed one where not only would all of my charging cords for the computer and my hard drives not get in each other's way, but one where heavy chargers like a MacBook block wouldn't fall out due to hanging upside down. The spaced out and rotatable outlets are everything I need, and it's got a grounding switch. Perfect!",
        "Only had three plugs in use ,lasted 6 months with no rest ,had a very flimsy circuit board inside after reading some reviews won't wast my time with the worenty.",
        "THIS SURGE IS RATHER LARGE BUT GIVES ME PLENTY OF INPUTS. MY LAST TV GOT HIT BY LIGHTING THAT EXPLODED IN A DRIVEWAY JUST A FEW HOUSES UP FROM ME. MY HOUSE IS ONLY ABOUT A FOOT LOWER THAN THEIRS. BUT THE STRIKE GOT INTO THE ELECTRICAL SYSTEM AND ALL MY NEIGHBORS LOST SOMETHING FROM MICROWAVE TO INTERNET ROUTERS. I WOULD HIGHLY RECOMMEND AT LEAST A SURGE WITH (2000)JOULES OF PROTECTION. HOWEVER, THERE IS NO WAY TO TEST THESE UNITS EASILY. SUPPOSEDLY, EVERYTIME THERE IS A NEARBY STRIKE, THESE SURGES LOSE THEIR ABILITY SO YOU ALMOST HAVE TO TEST THEM ANNUALLY IF YOU WANT TO PROTECT YOUR EXPENSIVE TOYS IF YOU LIVE IN AN AREA THAT GETS ALOT OF LIGHTNING.",
        "I needed a new surge protector as my previous one finally surrendered to its last power surge. I have several devices plugged into it, so the multiple outlets work great. There were a few where I had to really push the plug into the outlet, but once in, it is firmly held. My only \"con\" is the length of the cord. It is LONG, way longer than I personally needed. But it would be great for someone who has to have a surge protector centered between \"distant\" devices. I recommend this surge protector.",
        "I have not had any issues with it, so I cannot rate the surge protector feature, the Belkin customer service, or how well Belkin honors the warranty. I purchased these devices mainly for the design. Unlike most other wall mounts that held in place mainly by outlet plug friction, this wall mount also sports a fastening screw. This means that this wall mount unit will not come loose when trying to unplug a device. The second design feature I like is the 6 pivot plugs mechanism which allow me to plug \"brick\" size plugs without covering the other plugs.",
        "mine doesn't work. Straight out of the package, it doesn't work.",
        "I don't know what kind of chemicals they use, but after using previously owned Belkin surge protector that had an awful smell, this surge protector fell in the same category. Awful smell, god knows what this is . Returned for complete refund. My previous Belkin surge protector still has awful smell.Bought an APC from another retailer not amazon.",
        "The pivot plug feature is very useful for super humongous power adapters that easily eats up 2 adjacent power outlets because of its size. Now I can plug those gigantic monstrosity by just using one of those pivot plugs without covering up other power outlets. If you have one of those boulders of a power adapter, this is a must buy power outlet.",
        "Until I had seen this model I didnt know there were power strips with movable sockets. With the way some of the samsung plugs are you're bound to waste sockets on a power stript. With this one, the way sockets on the edge can be moved that problem is not there anymore. I got this for my office to connect my computer and other electricals. Seeing this feature I will be buying another one to replace existing power strip for my samsung tv and sound system and other connected entertainment devices. This is a perfect fit for different kinds of plug makes.",
        "This failed on me over the weekend, I only had three items plugged in at the time. I cannot recommend this because it failed just after my return window expired. There is not a reset on this either.",
        "I have had experience with cheap plug extensions. This one has a light indicating it is grounded and surge protected. It is amazing to finally have a sure connection for my cable box (I have had a bad experience just touching a plug extension and having the cable box reset!). Great product! Thanks Belkin!",
        "Have been using this device for just 4 months, today it simply stopped working. First checked circuit breaker on outlet, no problem there, unplugged and tested the plug, it worked fine too. This unit simply stopped working, no warning, the unit wasn't warm, no unusual load, no clue what went wrong. Belkin, how do I claim on warranty?",
        "I was a bit concerned that Belkin quality would drop with their acquisition, but this supply seems just as good as ever. This is the 4th purchase for the home. When you see other prices for surge protectors and the versatility of this guy, there is no doubt where you should put your money. Have one one mounted under my desk for two monitors, gaming rig, sound bar, lamp, USB charging station, PS4 controller charger and probably some other items I am forgetting and I still have ports to spare no matter how oddly shaped the power supply is. I feel like I am slumming it if I use anything else. Highly recommend!",
        "I’m still giving a 5 star review even though when my item got delivered only the box was in the package. Super weird, I enemies you buying straight from another store but wanted to put my overall experience with the item itself. Definitely a great buy, I don’t have any complaints. I can’t think of any cons. I would buy again.",
        "In short for price I would call this the best surge protector for the price. I've also noticed that when my flashes on and off in storms my other devices not connected to this devices will often shut off but devices connected to device will stay on. 5 Stars Product -Thumbs Up",
        "At first, I imagined returning this product. I had not considered that the cords being plugged into this unit are those larger rectangular plugs. When you swivel the outlets for the side entry feature, these oversized plugs will not swivel flush with the unit/wall because they are simply too large. If this unit had the outlets where the ground prong faced away from the wall when turned, it would have worked perfectly. However, since I could choose which outlet swiveled, I was happy that this product eventually worked out well. I really like the lights that show the unit is protected and grounded! Other similar units do not have that feature.",
        "This is by far my favorite power strip. It can hold 12 different power cords and it really doesn't really matter what size they are. the top 4 are for regular plugs and the outer 8 can be swiveled up and down which gives room for odd shaped power cords to fit. I've had other power cords where lets say they were 8 possible but odd shaped cords would take up 2 or even 3 outlets. Not with this bad boy though. Well made, will protect from power surges and doesn't waste space from other cords.",
        "Am so glad I discovered this outlet plug. I'm easily able to connect the main television, surround sound system, home landline phone, video surveillance system, DVD player, PlayStation and Wii game system all in one place... Finally. My favorite feature is that the plug Outlets pivot to accommodate different types of plugs. I am able to wrap up my cords and easily access all my electronic devices.",
        "My purpose for the purchase was to consolidate two extension cords that had just a couple items plugged in due to the size of the plug-in part (the converter part). The ability to turn some plugs in this power strip allowed for me to plug in everything I needed to. This is definitely not for travel, it is larger and heavier than most power strips. It is of good quality - aka feels durable and heavy in the hand. I have had no issues with it.",
        "Most surge protectors arrange their power outlets in a linear fashion, like a long stick or double row of outlets. This is fine if you're plugging in simple plugs, but many electronic devices have a bulky power adapter/plug that takes up more than one outlet. Some are vertical, others are horizontal, and others are square--they're all awful. This surge protector helps those of us looking for a) a large number of outlets and b) the ability to accommodate funky plug designs. The pivoting outlets on this unit make it possible to plug in some of these bulky plugs, making it well worth the money.",
        "Nice amount of sockets for multiple devices but in my case the switch went flakey and that was the end of it.",
        "The power strip/surge protector for my PC and peripherals was already maxed out for space when I switched out routers for one with a larger power block. It just wasn't going to fit. I found this Belkin which is big enough for my current needs with room for expansion. I like the rotating outlets that can accommodate more/larger power blocks than the same number of static outlets. The Belkin also met my needs for power and protection lights.",
        "WOW! Love love love! The ability to angle the outlets to wherever a plug fits best is an outstanding idea! Huge kudos! I have never had a need for the ability to do that, but now that I do, I'm so grateful I found this on Amazon which came right away, thank you!!! Now, to look under my desk is no longer a disastrous wiring mess! My old regular one hummed also, so this quiet one is welcomed! It's more than I wanted to spend but it was well worth every penny. Go for it!",
        "after using this one for a while it just simply stopped working I had moved it from one outlet to another section so that I could run some devices over at my kitchen table. When I went to move it back to its old outlet after having worked fine it will not light up and will not transfer power to my devices I must therefore conclude that it is dead. I have never actually had a surge protector die on me, thus I must conclude this item was either defective in which belkin will refuse to do anything about it. Or that it was never intended to last.",
        "Just what I needed. I love the fact that some of the sockets will rotate for convenience regarding your devices needing some extra space for those large plugs. It's durable, sturdy and, in my opinion...fairly priced for what you get. I do recommend this product.",
        "We love this power strip. It is a bit larger, but that means it has a lot of capacity for all your devices! It also has one of the highest Joule ratings of any power strips I've seen. There are three rows of strips, all of which are well spaced. Unlike most power strips, you can probably use every plug on this one. The middle of the strip is well spaced, and the two rows of plugs on the side can each pivot individually, allowing you to space out your plugs. If you need a power strip, this is a great option and worth the little extra you'll pay for it!",
        "I've purchased about a half dozen of these over the last couple of years because I love in an older house without many outlets. All still work like new (which I can't say about some of the other outlet expanders I've purchased). I also really love that each outlet can be rotated individually - makes it much easier to fit behind furniture and makes it easier to fit multiple large plugs into the outlets.",
        "Alright I have a blue ray player, PS4, mini PC, Nintendo Switch, and digital antenna all with our family room TV. I needed something to fit all the plugs, especially since some take up two slots. I mean the mic was dropped, this outlet crushed it. It works great and isn't so bulky where I don't know where to put it. Good job, Belkin! This thing is so awesome it could probably withstand the the Koolaid Man doing a cannon ball onto it. OHHH YEAH!",
        "I bought 2 of these outlet strips a couple years back to mount under my entertainment unit. One of the things most entertainment units lack is the understanding of cable and power management. I needed to run the cables under the cabinet and have enough outlets to handle the 6-8 products that needed power. Bottom line this a fantastic product. Easy to mount with the screws holes on the back, and when dealing with almost a dozen plugs varrying in shape and orientation, the rotating outlets are a huge plus. I really don't think there's another outlet strip on the market that could do what I needed it to do.",
        "While I purchased this item in April, I only recently hooked it up to use for my theater room to protect some of our electronics. Not only did it break within the first month of use, it also broke the mini refrigerator I had hooked up to it as well. Thought I was getting a good deal on a surge protector but ended up costing me more than a simple one bought at the store.",
        "I use it to protect my tv and home theatre equipment. I had a noticeably loud surge go thru my entire house and none of my equipment was damaged. However, there was damage to the power company equipment outside and they spent the entire day making repairs. This surge protector saved the day for me! I also like the spacing of the outlets, as it accommodates larger plugs. The slim design is great too, reducing the amount of space needed behind my entertainment center. I'll buy again, if needed.",
        "Plugged in and it works well. Can’t really tell if it’s going to work until their is a surge. May plug into CFGI. Going to use for plugging in numerous items for a marine aquarium. Kind of buying some things as I go. But will be plugging in a return pump, UV sterilizer, wave maker, protein skimmer, heater, lighting, fluidized sand, etc. Will hang on wall to establish a drip loop, so no water gets into surge protector.",
        "I bought the 12 outlet model because it was flat like I'm used to, but I'm wondering if the smaller one wouldn't have worked as well. I love the swivel outlets though which allow me to get all my (stupidly made) plugs on it, plus this power strip is very sturdy with a longer cord. I don't know if the product description says this, but it has a connection for coax cable, something I've never seen before. Although it's a bit more than I actually needed, it would have been great for our old desktop setup (with its many plugs) that we replaced with a laptop. It is heavy, which means it stays where I put it, which I like.",
        "I bought this to replace an old surge protector outlet that was failing. I was shocked at how large this one is. It is rather bulky and industrial looking while I was anticipating something about half the size. It seems to work well, though. It looks rather ungainly, so I have hidden it under an end table by my chair. I use it mostly for my two laptops.",
        "Did not protect $1500 worth of computer parts/ electronic devices or a $900 tv 10 months in due to a power surge. Don't get it for the protection.",
        "We just installed our surge protector. The first thing my husband commented on was the rotating outlets, he thinks it’s a great thing. Makes it easier to plug things in. BUT, he then said they make this great surge protector to organize all those cords and then make the surge protectors plug the kind that sticks out of the wall socket 4 inches when it’s plugged in. They should have the plug that goes in and the cord is at 90 degrees and goes straight down the wall. You know what I mean, like the way our kitchen appliances are plugged in, so you can move everything close to the wall. I hope the manufacturer reads this!",
        "Just like my retired (end-of-life) model but with a handy cord-management feature. Y'all are aware that surge-protectors for small computer equipment wear out after about five years and need replacement. Just accept that and you'll be happier. It's too bulky for travel. And anyway, for international travel, you need both surge protection and voltage stabilization.",
        "Love this thing! I bought 2, however I may have to buy one for every room. These are a million times better than any other surge protector I have seen or purchased and they are decently priced. The outlets swivel so you can use all of them unlike any other surge protector I have seen, this is exactly what I was looking for, and I have only found something like this here on amazon.",
        "The design is amazing, i had issues with all the different kind of plugs and sizes that made it difficult to fit all my plugs. This design allows you to adjust the angle of the plugs for 8 of them and it makes it very easy to accommodate all plug shapes and sizes. I definitely recommend it if you want something with a small footprint and adaptability.",
        "Shipped quickly, works great, especially for all of my electronics that have different sized plugs. Really helps to accommodate these with the shifting outlets. Cord is just the right length for my needs.",
        "Excellent functionality for the price! This device has 12 outlets in total, with 8 that pivot. The pivot feature for me is very useful as it help prevent outlets from being blocked by larger plugs. The power strip is well-built, feels solid, and easily wall mountable. The cord is a heavy gauge and is long enough, approximately 6ft, to be able to plug at a farther outlet. I would prefer if the plug were flat, instead of a standard 3-prong plug, but it’s not a major issue or deal breaker for me. Ultimately, this is power strip is an excellent buy, especially with the numerous outlets and functionality.",
        "I don’t buy any other power strips. I have 4 on my smallish home with another on the way. I don’t usually get hyped over a power strip 😂. But these really are great. A little pricey, but worth it.",
        "Absolutely perfect for sensitive equipment, VERY high quality, feels super heavy duty. I have 2 iMacs and 2 MacBooks plugged into this thing all the time, as well as a iPad and a iPhone regularly. I could not be worried less about them with this monster of a power strip.",
        "There's somethng very wrong with this power strip - although the outer holes work, 1/3 of the holes won't accept plugs - its as if they're fake holes. I've had a belkin power strip before - I don't know if this is a fake one, or if somethng went wrong in the factory, but it's basically useless. Unfortunately, I was tied up in COVID things and didn't notice this til recently, or I would have returned it.",
        "Arrived on time, was perfect for my computer & all of its add-one. Very helpful to have \"tilted\" outlets for some of the larger plugs. Have used Belkin before & have had my tv saved more than once by their products. Do note, eventually some of the outlets die (on any surge protectors), something I had not known previously. They can only take so many surges before they succumb to the stress, but I have had long lives from this brand. Do a little research before buying, if you're not savvy about them so you will understand the differences. It will save you from possibly choosing the wrong power settings offered.",
        "I love these things. Belkin charges absurd amounts of money for them and I still gladly pay it. These are so versatile, so reliable, so exceptionally useful that without one in any cluttered setup it feels wrong. I'm going to start keeping a reserve stockpile in my closet so I always have one wherever a dozen cords and wall-warts all compete for space.",
        "This particular surge protector has become my \"Standard\" for home use for a long time. Whenever I set up a new computer or entertainment system, I buy one of these. I've only had one fail (the on-off button) after years of use. I figure a new one is cheap protection for any new purchase of substance. Then I just keep the old one as a back up or use as a regular power strip.",
        "I needed a power strip surge protector with a lot of outlets for my electronics in my living room. I was interested in this one because of the rotating positions because sometimes there are wasted outlets due to the shape of some plugs, plus it's sitting behind my media center. I have my tv, xbox one & 360, cable box, and sound bar all plugged in, with one left over for when I bring my Apple tv or Fire stick into that room. I'm happy with it.",
        "I love this thing. I bought this on an amazon deal and now I’m wishing I would’ve purchased power strips like these a long time ago. I stuck this in my music studio and it’s fantastic. With all the adjustable outlets and options, this strip has no issue whatsoever dealing with plugs from all sizes and directions. And you know some devices have bulky plugs or plugs that angle down blocking another outlet. With this power strip it’s a nonissue. Feels solid and sturdy and I think it will last a long time. Would definitely recommend.",
        "I bought two of these. I love that it pivots which is great as I can plug in more bulky things than one usually could. However, one of the two of them is NOISY. As in as soon as I have it plugged in, whether or not anything else is plugged into it, it makes an extremely high pitched noise. Not an alarm or anything like that. It isn't exactly constant, but close to. It's like a buzzing, whirring, electrical sound. Enough that I think it's triggering extra migraines for me.",
        "Bought this because I have a lot of instruments/recording/sound gear in my basement and I needed a safer way to hook it all up and play. Thankfully there hasn't been any problems that would cause me to need this unit to sacrifice itself for my gear but it does work extremely well for running all my gear with 0 problems. It produces no heat/noise/etc and all lights are easy to read/understand. For anyone wondering the warranty is voided if this unit is used in conjunction with an extension chord. So make sure you're working close enough to an outlet that you don't need one.",
        "I bought this for my sister and after 2 years, the power strip stopped working. She'll turn on the strip and the light would flicker before turning off. This happens without anything plugged in too. Very disappointed.",
        "If you are looking for a surge protector that has 12 outlets, look no further. This is the one! The cord is very thick and is unlike what you would get from the cheap power strips. The 12 outlets allow you to pretty much charge everything you could possibly want. 8 of the outlets actually rotate so that comes in handy when some of your plugs are angled weirdly and take up 2 outlet spaces. Overall, I definitely am satisfied with this and find it to be money well spent!",
        "I bought this for my kitchen and works great. The product is bulky and protrudes out where I placed the product in the kitchen but outweighs the cons due to how useful it is to have it there. Overall, great product and stays in place thanks to the center screw just a little bulky but performance is great.",
        "This thing really is a beast. Not sure why any of us need this many outlets but, when in Rome I guess. Got this since 2015 and haven't had one issue with it. My only suggestion is that they should get rid of the phone/fax ports and replace them with USB ports instead. Because who still fax or landline??",
        "This outlet is great. Love the moveable plug-ins on each side to fit multiple size plugs. Just what I needed for wife's home office. Got so annoyed w the standard straight power strip. I am happy w Belkin",
        "The surge protector was purchase to protect and provide clean power to my amplifier and cd player. It works as intended and looks great doing so. This is an audiophile recommendation of a carefully selected component to provide safety and maximum voltage as required. There were other benefits worth mentioning for those who have in door/outdoor antennas. Using the in and out antenna connections of the surge protector your signal will improve dramatically.",
        "Before I started using these outlet protectors I had several TV's burn up because of lightning strikes even though I had a surge protector in use. I switched to these and after several lightning strikes I had nothing connected to these fail. The fact that it cleans up the power from RFI/EMI is a plus. Every piece of electronics I own goes through these surge protector / outlets. I have 6 and some are years old with no failure. The pivot plugs work really well when using an AC/DC adapter as well. Highly recommended.",
        "I love these power strips. I now have 3 of them. They are great for places that have big adapters and cords running from different directions. The positional outlets make it so you can plug anything in and not worry about another plug being in the way. I have had one for over 7 years and have had no problems with it. I highly recommend to anyone.",
        "From Belkin, a reliable company of long standing, a high-quality power strip with swiveling sockets so that power blocks don’t get in the way of each other. Heavy duty and well-made. UL listed, so unlikely to cause a fire. Nothing like the ubiquitous cheap garbage from the no-name Chinese companies that I would not trust in my house.",
        "Unit was dead on arrival. Plugged it in and turned it on and nothing. Maybe what I got was a lemon, but I can't trust a product that doesn't work. Will be purchasing another surge protector but not a Belkin brand.",
        "My old USP was blinking out randomly and I had already replaced the battery once so I got this Belkin surge protector to replace it. Because of its very flexible design (swing-out side receptacles) I was able to get everything at my desk plugged into it, even the shredder, and I still have some open receptacles!. Plus it protects the cable and phone wires from voltage spikes too.",
        "look if I ever have a surge is the only way I can tell if this works. in my 50 plus years on this planet, I never had a surge issue. but I bought this to protect my electronics tv and stereo units from events. as these items can cost a pretty dollar to replace. so why take that small chance of a surge happening.",
        "I have a TV, a few gaming consoles, and a home assistant constantly plugged into this baby during those terrible Florida thunderstorms with zero incidents! Power surges? No issue here! I love the fact the plug outlets themselves can be moved and positions so I don't have to sit right next to it to charge my phone from the other side of the room. Definitely a winner in my book!",
        "If I’d paid more attention to the listing I’d have noticed in the photo of the unit’s underside that it has protrusions preventing it from being plugged directly into a wall. What do people do, cut these off?? Anyhow, I wanted something to plug into a wall and this isn’t that. But for all I know otherwise it works well.",
        "- Very sturdy unit and well designed. I like the fact that you can swivel some plugged units out of the way (flat with the wall). - You can also secure this unit to the existing outlet via provided screw...this makes it very stable. - My only drawback is that it does NOT come with USB ports."
    ]
}