{
    "entity": "Power Strips",
    "text": [
        "Had a breaker trip after moron ex boyfriend plugged in a frayed extension cord outside. My high end gaming PC, assembled by my hand and at great expense, was a goner. Mobo and proc fried. Not an expert but I would think 3390 joules should have protected it.",
        "Piece of JUNK! I live in a suuuper old house, like predating the Civil War old, so I bought this power strip for the Belkin name and the fact that it cost more than your run of the mill $8 ones you pick up at the store and may fair better with my old faulty wiring. You'd think for double the money it would be better right? WRONG! After only three months I just found this thing with a melted hole in the back and a big black spot on my wall where it exploded. I've had power strips from 1988 that've held up longer!",
        "The dual powered USB ports don't offer 2.4 AMP/12 W as advertised. The unit I received gives 1 AMP/5W for both USB ports combined and I verified it using Battery Pro app. When a device is being powered from one USB port, the 2nd USB port does not offer any current due to the low wattage on this unit. This is either false advertising or I received an outdated equipment. The second minor issue I have with this equipment is the power sockets are too close to each other, so any wider power adapter will cover the adjacent socket.",
        "USB outputs are not what is advertised here and the outlets are very close to each other so if your plugs are wide they don't fit together. However mounting is easy, the quality looks fine but the false advertisement about the USB outputs is very disappointing. Belkin sometimes makes good products likethis definitely is NOT one of them. I got myselfwhich is cheaper, has better USB output and the plugs are separated from each other.",
        "Mine came with an angled plug which is visible in one but not all of the product photos. This means that you can plug it into the top of a traditional two outlet receptacle and not block the bottom outlet.",
        "A snow storm two days ago led to a power pole catching on fire next to my home. The resulting surge fried my stove and several sockets around the house. However this surge protector took the full brunt in my tv room. Today I’m ordering it’s replacement for thirty bucks instead of the two thousand dollars of equipment attached to that port. I’d highly recommend this product and am so grateful that I don’t have to replace everything in my home now.",
        "AMAZON if you don't step up and verify the safety of the product selling on your website, you won't be around much longer!!! I followed instruction step by step and installed this item into the wall outlet. Within a few second I smelt something burning. Then, I saw smoke coming out of it. Luckily I still have the screw driver handy so that I could removed this POS out of the wall before it burns down my house. The stuff was burning hot! I DEMAND AN APOLOGY !",
        "It caught on fire and burned my carpet, but it didn't burn the whole house down since I was sitting right next to it.",
        "Disappointed that this offers little to no protection...only plus is 8 outlets on a switch. The one i have allow numerous plugs to melt into it without shutting off....",
        "Didn’t protect during lightning in Miami. I had a close lightning strike a year ago & bought this hoping it would help. Bought in August , had a strike 2 days ago & once again att router & desktop nic card burned out!!! I now have to troubleshoot (so time wasted ) & hope it’s just the nic card which I also have to replace. I’m going to try to submit a claim to belkin ... forget that it’s almost impossible to figure out how to submit a claim. I guess I’ll need to buy something more substantial to replace this useless device.",
        "It works fine but when you plug something into the usb it starts making a high pitched noise. It might not bother people for occasionall use to charge devices but the noise is very annoying.",
        "Worked as intended for about a month and all of a sudden one of the USB ports stopped working. Kind of disappointment for us from such a large company like Belkin. Hope they can make it right.",
        "I was really looking forward to this product because I got a new computer, however I didn't have enough outlets in the corner and wanted to put it in. so I got this product however it short circuit in 10 minutes of use shutting my computer off while I was using it. I tired to plug it in different plugs and the extension cord doesn't even work anymore neither does the lights turn on. Very disappointed in the product",
        "Last night I thought our power blew and realized that this stupid thing just broke. It does not work anymore. I guess that is what happens in a power surge. I have 2 more and I’m pissed. Now I’m just waiting for when those break because I’m certain now that they will. Five thumbs down",
        "I've purchased and loved these in the past. They were NEW and are still in excellent working order. However, my last two purchases of this product have not only been very used and missing protective slides on outlets and entire outlets don't work all together. It's almost like someone used these for years and returned them. No big deal I thought, return the item. But even then, the \"new\" one sent to me was in similar condition, broken pieces with outlets not working. DO NOT BUY THIS ITEM HERE. Plenty of other places on the internet to buy an actual new condition one. I love Amazon but this item is not new and does not work as advertised.",
        "Sadly, the one feature I bought this gizmo for sucks. Sure the design of the product is helpful, but certainly not original. There are plenty of like-products on the market. But I bought it because it has not one, but two USB ports. It might as well have none since it can take up to three times longer to charge phones and tablets. (Actually, much longer for tablets.) I actually measured the time it takes to charge my Android Galaxy s7. In a regular wall outlet it took one hour and seven minutes. With this doohickey it took nearly three-and-a-half hours. In all fairness, though, as a multi-prong charger is works as expected.",
        "I'm so disappointed in this wall mount. I bought it for our second TV, which doesn't get much use but still needed a surge protector for. I removed the surge protector from the packaging a month after purchase and realized too late that the third prong won't fit into a single outlet in our house, rendering it unusable! I went back and reviewed the specs for this on the Amazon page, and nowhere does it say that it has a larger third prong. Now I don't know what to do with it but throw it away. I can't return as it's past the return period. Thanks!!!!",
        "I have previously bought a Berlin 8 outlet power strip on Amazon with zero issue and loved it. Unfortunately, this one arrived damaged and appeared to be used and/or handled roughly with fingerprints all over it and little scratches. I returned it for another one but experienced the same issue only worse with even deeper scratches. I'm not sure if it's some sort of packaging or shipping issue but I was really surprised considering (as I previously mentioned) I've bought this same exact one from Amazon previously with none of these issues (In fact, I still have that one and it still works great and looks good as new--nothing like this most recent purchase).",
        "Stopped working. This is the second Belkin lus 6 outlet Wall mount surge protector to fail. Belkin does not stand behind warranty. Sent pictures, receipt and several emails when first one failed and Belkin did not replace unit or respond. I will never buy a Belkin product again.",
        "These arrived and looked as if they were refurbished. Had what looked like cracks around the outlets and on the bottom. STRONG SMELL LIKE IT HAD BEEN SHORTED OUT - Read the One Star reviews, these are not quality anymore. What happened to Belkin? They used to produce quality stuff - NO MORE. Returned these and got the AmazonBasic 12-outlet and they are really quality and I recommend getting those instead of this Belkin garbage.",
        "The 6-outlet plug was exactly what I was looking for to place by my nightstand. The outlets are close together as others have mentioned, but I wasn't plugging anything crazy by my bed - just a nightstand an a couple of smart displays/devices. I wanted to use the USB option to be able to easily change the plugs for devices I need to charge overnight, but anytime I plug something into the USB port, this surge protector makes a high pitched noise. This might not bother some people, but it's generally quiet in my room when I'm trying to sleep and the buzzing is enough to give me a minor headache.",
        "The prong slots on this are somehow too large to hold the prongs of the plugs securely. We are constantly having WiFi go out because the connection spontaneously comes loose, and our phones will be dead in the morning because the charger wasn't making contact. This is not because anything bumps the cables, just that the contact somehow gets lost and is only restored when the plug is wiggled and fits \"just right.\" Wish I could return, but we've had it a while.",
        "Honestly, I have a lot of tech and two wall outlets aint gunna cut it. I put this one next to my bed in the bedroom. I've tried maxing it out and the darn thing works like a charm. At one time I pluged in my phone, massage pillow, Alexa, charged my headphones, charged my smart watch, and laptop and it worked great! esp, if you worried about rolling outages or surges, make sure to get one like this with a surge protector. I wouldn't recomend plugging in too many high voltage stuff like laptop, heaitng blanket and AC in it all at once but it looked like it could handle a good amount of stuff pretty well. VERY pleased!",
        "I have several. They are not for travelling. You don't want a device like this with a long cord if you have multiple things plugged in. The orientation of the receptacles are such that you can choose the one you want so it doesn't obstruct an adjacent receptacle which might happen if all the receptacles were in a straight line",
        "Did not do it's job at all. Lost everything plugged into it when lightning hit power line near house. Allowed surge to destroy everything that was ugged into it. I have other surge protectors that worked and performed like they should have and protected the devices but this strip did not stop a surge from destroying the items attached. Belkins warranty on connected devices seems somewhat difficult to accomplish. So if you purchase this device be ready for a fight with Belkin to get anything replaced that their advertised product claims to protect.",
        "DO NOT BUY!! I had this for almost two years. We had a storm the other day and it failed. It still shows the green light as protected and still functions. There are no burn marks or smells that happened. A tv, modem, router and Xbox were all fried while plugged into this product. I had the router and modem plugged into one surge protector in the bedroom and one in the living room with the Xbox and TV plugged into it. All 4 are completely dead. There wasn’t even a popping noise or lights dimming, just a regular storm and then dead electronics. The only things in the house affected were those plugged into the belkin surge protectors.",
        "Complete piece of garbage. Had a power surge in my house and this surge protector fried my TV, PS4, switch, cable box and modem. Sent it in to Belkin for their “$300,000 warranty for protected products” and they told me product worked as expected lol. When I called the cable company to get a new cable box and modem they said there were a lot of surges in my area at the time and they were replacing a lot of boxes due to surges. This thing is a worthless. I had old surge protectors from 5-6 years ago that worked completely as expected. DO NOT BUY",
        "Bummed a little because of a missing safety slider on one of the plugins for this BELKIN strip cord. For me it’s not worth returning, but it makes one wonder about BELKIN’s QA process? Other than that this is exactly what I needed. Note the long 12’ cord and the sideways power plug. It’s perfect to put behind my grandson’s gaming console so as to slide it right up against the wall. I would buy again as long as I see no more QA issues written about it.",
        "This strip burned out without tripping my breaker with only my daughter home. Called 911 and returned home to my neighbors spectating, two fire trucks, an ambulance and various first responders blocking the road to my house. Not exaggerating!",
        "Bought the product new but received it slightly used! Did a quick power test and it works. Good price and fast delivery. Good length for the cord. Depends on what your set up is like. Give yourself some wiggle room. I don't like seeing the wires so I rather have it shorter. This one is longer than what i need. I cancelled the return because of two things. 1. I didn't want to take risks being outside 2. It was going to take 2 weeks for the \"new\" one to come in. Slightly disappointing but i understand the delays under current circumstances. Best of luck to all.",
        "I purchased this product in September 2017. On Friday night it blew a circuit or something, didn't trigger the circuit breaker but it did kill every single item that was plugged into this power strip. Thanks Belkin! Never going to buy another one of your @h!t products, thank god it wasn't the Belkin power strip with my TV in it. But I now have to buy a new window AC unit, box fan, etc.",
        "This power chord arrived with scratches where people had plugged into the sockets, was not wrapped in plastic and was clearly someone else's refurbished trash. Also arrived a day late to top things off.",
        "I bought this surge protector in April 2018 for my modem, Smart TV, cable box, outside antennae and WII. It stopped working on July 26, 2018. I tried the surge protector in another outlet but no go. Have no idea why it stopped working. The amount of energy and time to identify the problem was exhausting. One expects Belkin products to work for a long time. I will not purchase another Belkin product.",
        "This may be a 4- or 5-star product for some customers but I knocked off a star due to misleading product information and the inconvenience of having to return it. The product description misled us to believe that the electrical cord was 8 feet but instead it was only 7-1/2 feet. It didn't quite reach our electrical outlet so we ordered the Belkin 8-outlet, 12-foot cord model which serves our needs better. I would recommend this model as long as you know the cord is really only 7-1/2 feet and that you make sure it will reach your outlet.",
        "I purchased this product foremost because I have always trusted Belkin's products and have never been let-down and also because I needed large surge-protector power strip to accommodate the many heating elements and lamps I have for my 9 reptile enclosures. This power strip is sturdy, designed ergonomically and has a longer cord than most larger power strips. It allows you to plug-in 12 individual structures to it. So far I have not had a single issue, and will be purchasing one for my entertainment center in my living room as well as my computer area.",
        "Overall they're great, however some of the people that create plugs need to be shot for not respecting typical outlets space - you know exactly what I mean. This will fill your needs of an entertainment system catch-all or any regular 2-prong devices easily, it's when you get to the weird shaped, chinese devices that have a 2\"x2\" plug that you might lose a place to plug them in, but the sides of this thing will allow you to plug in 6 average big-block devices on the sides. I've never had any issue with these and I've been pluging/unpluging things from them daily for years. I've got 3 and will order more of these if I ever need one.",
        "Plugged a flat screen TV, cable box, Fire Stick and Blu-Ray player into this Belkin Surge protector. After a local heat wave and possible power surge, all four products are DEAD. Have been trying to get Belkin to address the situation for weeks per their warranty, but it's like running into a brick wall. Don't waste your time - or your money - on them.",
        "I really like Belkin's products, however I was surprised by this power strip's (12-Outlet white with USB). power button. It really makes it feel cheap, and it feels like it's just sitting on top and not attached/very, very loose. I thought I had received one with a manufacturing defect, and requested a replacement from Amazon. It arrived, and it's the exact same thing. I like the strip, but I am very disappointed in the quality of the button.",
        "One of the items I need to plug in has those boxy square plugs... how do I explain it? it's like a big cube on the end of the cord, and the plug is on one side of it. We all have them, it's not odd. Anyway, there is one i have that when plugged in, no matter which plug I use, blocks at least one other plug, so for me this is not a 12-outlet, but an 11. I bought it so I\"d have more spots to use, but alas.... darn. Otherwise it seems really nice.",
        "I ordered one to replace my APC strip that died after 10+ years of use that finally died. This strip maybe lasted 8-10 hours total before it started making chirping, buzzing and popping noises that would only go away after remove the strip itself from power. Needless to say, I don't trust something like that to protect $3k+ worth of electronics and computers. I have returned this product for a refund and ordered an APC strip instead.",
        "The cord length is a little short. But this cord saved my computer, we had a leak during the rain that wet my power cord luckily I had bought this amazing surge protector which of course is unusable due to water damage, it was alot of water, but my expensive computer is perfectly fine. I bought I new one to replace the water damaged one. I love the little indicator that tells you whether or not the outlet is grounded.",
        "Received this product this morning, and it worked for about 5 minutes until I had 5 items plugged in. I have flipped the switch several times and the “Grounded” light will not come on, and the power does not go to the five devices plugged in. The switch itself seems flimsy- something in the button itself may be faulty. Will be returning and looking for a replacement. Might buy two instead of looking for one because the placement of these plugs isn’t great either. You will end up covering one because of the size of the plugs plugging into the outlets. I’ll take pictures after I’m done working- need internet until the end of the day.",
        "I bought 6 of these and put them in every room of my house. Makes it so much easier to plug in a lamp, iPhone & iPad charger, and still have room for FIVE other low-draw devices. It's the 21st century: even 4-outlet jacks are insufficient. No complaints in the 6 months I've used them. Charges my iPad and iPhone easily.",
        "I really like this design and whenever I need an outlet strip/surge protector, I investigate what's available and gravitate back to this one. It's flat with a lot of room between outlets so you can easily fit adapters, the cable guides are big and easy to manage, the mounting wholes hold the strip to the wall or back of a desk well, and there's an option for a 12' cord. Also, I'm not sure why Amazon has \"For traveling\" and \"Ergonomic\" as features to rate for this item as they don't really apply, maybe a few employees had some drinks on the job that day. :-)",
        "Bought two of those a few months ago, and waited a while before writing a review. It works properly and had no issues with it. The way I know it’s working is that I have a table lamp on my office desk that I keep on when I work at night. A few weeks ago a strong storm hit my neighborhood, I started seeing the ceiling lights flickering while the table lamp did not. At the instant of flickering, I can hear “clicking” sounds coming from the surge protector. I don’t understand the physics of it all, but my observation shows that its working for me. The other one I bought covers the TV area.",
        "Use this same one at work and bought one for home. Good and evenly spaced while still allowing a lot of plugs. It could have had better mounting. I did use the two holes it provided and it worked, but it is not very solid. The thing is huge and needs the extra mounting. Would just need to make a couple more holes. Really?? The cable could have been longer. I bought the 10' cable version, which is nice, but I could have used a couple extra feet in my case. No one makes longer cables and I somewhat get why. Oh well.",
        "I own like three of these because they work so well. I love how many plugs this thing has and how they're positioned/spaced out which allows for many different kinds of bulky plugs being able to fit alongside each other. The little clip at the top is a nice touch for cable management. The surge protection has worked problem free for me; after about 4 years of usage and many power outages from blown fuses, thunder storms, etc nothing plugged into these has ever taken a hit. I would recommend getting the longest cord length version so that you don't have to go out and buy a new one if your setup layout changes.",
        "Great quality product. The on/off button is not so obvious, so I fumble little bit when installing this one. Product have great cord length, very good if your computer workspace is little bit far from the outlets. It handles all of the outlets perfectly, creating enough space between cords and outlets thus creating a more neat working space. It could handle lots of cords, more than enough for usual use. Product works great, though whether the surge protector works or not could not be tested by me.",
        "I've been using this surge protector for a few months now, and it's great! I have my HTC Vive, PC, two monitors, and sound system plugged in, so this can handle quite a bit of power no problem. It has a convenient indicator light letting you know that your electronics are safe from a power surge. The different horizontal and vertical outlets are VERY convenient, especially if you're like me and have different sized plugs. There is also a cord organizer that would be helpful if I needed better cable management. Also there's slots on the back if you want to mount it to the wall or bottom of your desk. Solid purchase.",
        "I have had this not even 2 months and on Sunday one of my circuit breakers shut off (the one this was plugged into). I didn't associate it to this product right away. But throughout the rest of the day and the next day various different breakers in the whole were shutting off as well. I had no idea what it could be as our home is brand new. I decided to unplug this unit first after some research (since this was the first breaker to go down) and voila, everything back to normal. Do not buy this, not even 60 days of usage, garbage.",
        "Lost everything connected during a storm . Belkin made it very difficult to file a claim. Just filed through insurance company",
        "Ive had this for a few years and nothing has blown up. It also looks nice and feels like a good quality surge protector. I’ve had no issues or complaints at all.",
        "As the title states this is the only surge protector I will only buy. A few reasons for this: 1. It's very slick and has tons of outlets. You'll never have to worry about this thing not having enough outlets and if you do, just buy another one! It takes up only one wall socket and has incredible length. Yo can be creative with this and attach it underneath tables and you would hardly notice it! I've taken this on the go and does not take up a crazy amount of space either. You have a group of friends studying? Bring this and none of you will have to worry about having enough outlets.",
        "This product is trash. After I turned the switch to on position the power strip started smelling like burned plastic and power went off. AI had only a floor lamp and an external hard drive plugged in and turned on, my desktop and monitor were both plugged in but not turned on. Can't believe Belkin declined in quality so much. Cheap and dangerous to use.",
        "I have 2 of these now, I use 1 in the living room, and one in my office. The different orientations of the outlets make it easy for the larger block style plugs. The on and off switch is in the recessed on end so no accidentally turning it off. Solid unit from a well known and respected company. The cord is long and a heavy gauge. This is good for most residential 15amp outlets. Travel is possible, but it is wider than most power strips so it would take upmsome space, bit it's definitely possible. Would definitely recommend to anyone who needs a solid, well built functional power center for a multiplug area.",
        "What can I say...it's a surge protector. It has plenty of slots to plug in all of my equipment along with internet connection cables, all of which are currently providing me with power and connectivity. The flat design, I'm guessing appeals to those with limited space, may provide more flexibility in where to place it but unless all of your cords are flat top, flexibility is minimal. It did have a slight plastic/electrical smell upon opening the package, it dissipated after a about a week. I'll edit my review should I ever experience an event that puts the surge protector to work, but for now it is working well as a power strip.",
        "I have had this power strip for about a year and 3 of the 12 outlets have stopped working. I really wanted to like this product, as the layout of the plugs is quite convenient for my home office. Unfortunately the quality leaves much to be desired. All I have plugged into the strip are standard home office electronics. A computer, a monitor, some speakers, a WiFi router, a small lamp, etc. There is no reason that these low power devices should cause this power strip to fail. It is low quality, plain and simple.",
        "Newer homes are built with better grounding, but to be safe, I like putting my devices on a surge protector. Belkin is known for the quality of their products, which is why I went with this one after doing my research. It's really not one for travel due to size.",
        "Twelve (12) outlets for all your computing needs. I used to run a power strip with just 8 outlets, and let me tell you that with the amount of peripherals, I ran out of plugs fast. After all, I have to power a 15-year-old router, a LED lamp, a Google Nest device, and a scanner. All these block-head plugs suck up all the real estate on my power strip. Which means on the old one, I'm constantly a-playing wack-a-mole, find a new hole for my poles. With 2 additional plugs for a total of 6-accommodations it's easier than ever to jack in and power up.",
        "Look, you know what this thing is for. It does the job well. It's able to have 8 devices plugged into it without any issue. The best part of this thing is the cord obviously. If you need a surge protector with 8 outlets and need to run the cable 12 feet, welp, go with this one. Cut and dry. Belkin is a good brand that I'm willing to trust to protect my TV, Apple TV, Xbox, soundbar, router, and modem and I think you'll be happy with this as well.",
        "I have TWO DEAD Samsung TVs after using these Belkin strips as surge protectors on my electronics in 2 separate bedrooms - due to a power surge in an electrical storm. I would like to know how I can have my TVs replace or get financially compensated. Supposedly, these have up to $300,000 in insurance for damaged items.",
        "I purchased 2 Belkin 12 outlet power strips. Attempted to hookup my landline and was unsuccessful. There are 3 receptacles for a telephone line. The instructions said plug the line from the wall into the input and use others for output to phone. Problem nothing is labeled input that I can see and I used magnifying glasses. The only thing I could see was on tje outside receptacle which had the #2. Didn't matter no combination worked on any of the 3 receptacles. I tried the other Belkin same result. I tested both telephone lines and the were good. The on/off swith was on and working. So I can only assume that this product is defective for phone protection.",
        "Originally daisy chained 3 old surge protectors because the big AC adapters took up too much space. Thankfully never had a problem but it was time to get something safe! I even went overboard and covered the open outlets with baby plugs and tab covers on one of them. If you use baby plugs keep in mind they may not always fit perfectly... I just made sure that the AC adapters were plugged in all the way so there was no issue. This layout was the best for my set up and I recommend it.",
        "This has a great cord length so you don't have to worry about extended plugs and I really like that they warranty the devices that are plugged into the surge protector if they become damaged from a surge. Another thing that I love about this product is the distance between each outlet, there's more than enough room for an oversized plug and you don't lose out on using other devices with larger plugs. It's also nice that they have the lights on the surge protector to let you know whether there's an issue with it or not and whether everything is protected or not.",
        "This is my second power strip. The current one I have now is taking care of the network. I chose this model because you can connect up to six oversized plugs with 3 on each side. The one feature that all surge protectors need is a master outlet that will turn off every item that is plugged into the outlets. This model doesn't offer that. option. I like this surge protector and I would recommend this at the current price. If you fill the outlets up to the max, It may be (for some hands) to be a bit hard to remove each item plugged into it.",
        "Ever tried to hook up 13 game consoles and a computer spanning 29 years of electronics and different A/V formats from 3 different continental regions to the same television the same time? Well, if I want to Clark Grisswald up your entertain center a la Christmas vacation, you NEED this bad boy right here. Can you believe they still make ac power chords with the transformer box ON the plug in this day and age? Fools, I say. Because of their poor design choices and your desire to create a firehazard, you NEED this product. 10/10",
        "Really needed a larger power strip but was disappointed by this product. The outlets are too close together so although they have the side outlets turned the 90 degrees some of my slightly larger plugs pushed against the ones on the middle which i did not feel comfortable with or still took up too much space which meant i couldn't actually use all 12 outlets. once i plugged it in my unit had no green light and as I read in the directions that is vital for indicating your unit is being protected as well as needed for the warranty. Boxed it right back up and will be returning it.",
        "When all the chargers I plugged in to our old power strip hand burned out, I decided to invest in a good Belkin to see if I can stop the destruction. Thus far, it's worked just fine, but only time will tell if I've solved the problem. This surge suppressor has vertical plugs that are spaced out along the sides to allow for larger chargers and adapters, and closer, horizontal plugs down the center for regular corded plugs. All the outlets are three-pronged and grounded. It also has line in/line out for a phone jack, co-ax, and Ethernet plugs as well.",
        "I build custom PCs so I have a need for electrical protection while working on 4000$ computer systems. Had a number of these over the years and they work great. A bit large but ample room for wall-wart plugs and various size adapters. With a lifetime warranty payback protection of your electronics why wouldn't you get it. I even had one that had an entire glass of wine dumped directly into the top of it with over 6000$ worth of equipment plugged in and it didn't damage the equipment at all. In fact after cleaning out the Belkin it still worked fine but I didn't want to risk it so I got a new one.",
        "I thought this was a good deal but was very disappointed with what I got. When I opened the package there was a piece already broken off, it wasn't a vital part so I tested the powerstrip. It didn't work. Not sure if I got the bad one of the lot, but I'm not going to try again with this product.",
        "I bought this because the types of equipment I use has large power adapters. The spacing on the outlets is enough that I can fit all the adapters. On normal surge protectors the outlets are too close together so you end up not being able to use a lot of the outlet due to them being covered by the larger adapters.",
        "I really hate exchanging the products because it came damaged. I waited for two days and now I need to return it and wait for it again. The pin of the plug came bent almost touching each other. There's a gap between the pin and overmold. Can I straighten it and use it to save time? Maybe I can but why do I have to fix it when I just paid for a new item? Is it even safe? Online shopping is sometimes convenient but recently, the products I've received from Amazon simply didn't work right.",
        "My power went off and this thing caught fire and burned and blew out my lights and things. I never expected that to happen. I'm glad I was home. I shutter to think what would have happened had I not been home. Never will I buy this product or Belkin products again!!! Wish I had read the reviews before I purchased this!!",
        "have been looking for one like this. Best Buy wanted almost $60 for theirs. Have umpteen things to plug in by my computer. Thanks.",
        "I'm a game collector and have a ton of consoles that are now hooked up on one TV stand. This power strip was perfect for that. Not only does it have a ton of outlets, but I love how it has plenty of space to hook up those large bricks of AC adapters that some older consoles have (cough cough...Sega consoles) without taking up two or three other outlets. Put the big ones on the outside and the small ones down the middle. Works great! The added surge protection is a useful benefit also.",
        "Ordered this around April and have been using it since. I really liked the fact that the cord was so long and it could reach the wall plug on the other side of the room. Unfortunately, it just stopped working overnight; not exactly sure what happened, there were no power surges, storms etc.; it was working yesterday all day now today it's not. **Changed from a 3 star cause it started working again, not sure what the problem was but it's not an issue now.**",
        "Sold and shipped by Amazon. Not clearly labeled as a used product. Only a small disclaimer at the end of the manufacturers description of the product. Shame on you Amazon shame on you. This will impact the number of purchases I make drastically. It functions, so far. I would be terrified if it had much load on it.",
        "I haven't needed to use this for anything other than a surge protector, but I've been happy with it so far. The design makes it easier to plug up various oddly shaped plugs, and the plugs themselves are closed when not in use. I like the piece that guides the cords down to the bottom of the bar. Unfortunately, I can't speak as to some of the other features, but that should tell you something of the value... I purchased this one when I only needed a power strip because the price was comparable. It's been very helpful in my older home that has nowhere near the amount of plugs needed these days.",
        "Outlets are spaced well for maximum utilization with odd shaped plugin devices. USB Outlets all work and provide sufficient power for the operation of all the devices that I have plugged in. This appears to be meant for use laying on the floor. There are two sets of two mounting holes on the back of the device. Both sets mount in opposite direction. So, only two of them can be used. I would have easily given this device 5 stars if the wall mount design wasn't so haphazard",
        "One week after purchasing the product we were in a bad thunderstorm which resulted in a power surge. I lost my 55\" TV, Cisco devices, PS4 console, Firestick and ISP router. All in all this \"Surge Protector\" is costing me nearly $1,000 dollars to replace my devices. Be sure to read the fine print. The $300,000 warranty only applies when this product is purchased through the Belkin site.",
        "I am a loyal fan of products that work. And I will always continue buying from brands that have not let me down. This surge protector is just amazing. I have 3 of them that have lasted me well over 5 years with no problems ever. I needed another one now that I added more monitors and a 3rd computer. It works with no problems what so ever. I highly highly highly recommend this surge protector to anyone who is looking for one that will be lasting a very long time.",
        "Great for when your home entertainment system has tons of small wattage items that all need to be plugged in. There are also many times when you have a lot of power cubes that need plugged in plus other items. I can think of computer station needs and also if you are a electric guitar playing who needs to plug in peddles, amps, etc.. Don't forget about it's much needed surge protection too. So yes, I bought more than one of these and just love them.",
        "Old power strip tripped about once a month and this one hasn't yet and it has been 4 months. I currently have 6 things plugged it, including a pc, and it handles them fine. Pro: works like it is supposed to Con: no usb ports to charge devices without the adapter",
        "We ordered quite a few of these for a new office we were furnishing.. Unfortunately the outlets in said office did not have the center screw hold to secure these firmly in place. Without the center screw in place these hang very loosely from the outlet and tend to fall out on their own. Even with adhesive to stick them against the outlet the amount of force needed to unplug devices is great enough that these tend to come loose from the wall more often than not.",
        "This unit (BE108200-6) failed to protect my new Sony 4k TV from a lightning surge close to my house. All four HDMI inputs were damaged. TV is under warranty, but I won't trust Belkin again. Called Belkin to see about a replacement surge protector, left a message, the recording said I would be called back. So far no call back. I can't recommend this product and I am returning another like unit that I ordered for other equipment.",
        "I bought this specifically because it had the USB ports, which then gave me 8 outlets, as I didn't need the 3 prong outlets for my phone and iPad. However, within 1 year, the USB ports stopped working. The other outlets are spaced too close together for most electronics plugs, so now I only have 4 plugs I can use.",
        "Haven't had any power surges so far but I hope it protects as well as claimed. It appears to be well made",
        "I bought this surge protector for work to protect my personal equipment that I work on, just in case. It has more than enough outlets to plug equipment into, and they are arranged so that you can fit different types of devices into it. It also has two USB charging ports, that I really don’t need, so that’s an added bonus. There are two indicator lights that let you know if you’re surge protected, or if the outlet you’re plugged into is grounded (found this out when the ground light didn’t turn on!). Found another outlet, and it comes on just fine!",
        "At least one dead outlet on arrival, every single outlet is so faulty and sensitive that so much as blowing on a cable that's plugged in is enough to make it lose power for a second. That's not an exaggeration. Even if this thing was usable, I wouldn't trust it not to burn my house down. Stay away from this product, it obviously has zero testing done.",
        "This powerstrip/surge protector is a very fine product, as it offers plenty of plug-in spots, as well as two USB power/charge stations. It's held up for 8 to 10 months, and it provides fantastic surge protection for delicate devices like TVs, DVD/Blu-Ray players, and tablets/smartphones (charging). It was cost effective for the price I purchased it for, but I got it on sale when I bought it. Even for the current price, it is a pretty decent deal. Overall, I'm rating as 5 Stars out of 5!!!!!",
        "I needed a good surge protector to plug into the wall behind a bed. The surge protector I was using had a big plug and a cord that stuck out and I was concerned about safety with the bed/bedspread being up against that, so I needed a new solution. After searching, I found this surge protector that has a flat, angled plug and a wall-hugging cord. It was just what I needed! It has plenty of outlets. I like the option to hang it on the wall. I would buy it again.",
        "Obviously, the true test is when my house is struck by lightning or a poltergeist uses electrical wires to enter my television or Xbox, but, so far, I am extremely happy with this product. Choice of cord length and outlets, so you don’t have to get a 12 outlet, 8 foot cord to put on your bedside table for alarm clock and phone charging (if those aren’t the same), but you can get those features for your entertainment center. Coax and Ethernet plugs are also available to add protection through those avenues of destruction. Cutoff switch is small and out of the way to prevent accidental switching, which is definitely a plus.",
        "We have six of these around the house and at the office. They were purchased between 2007 and 2017, and we keep coming back for more when the need arises. The angled plug is great for sitting flat against the wall without blocking the other outlet. One time back in 2009 we had a surge that killed a computer's motherboard. It was plugged into the strip, but the strip clearly indicated that there was a ground fault (in a garage to bedroom conversion). I take the blame for that circumstance and fixed the grounding issue afterward. Outside of our own misuse all of them have worked flawlessly.",
        "Only had it for one day before one of our outlets burned out. This protected the devices that were plugged in and prevented a fire as the outlet was a little charred while nothing else past the surge protector saw any damage! Overall this does exactly what its suppose too and I would definitely buy another.",
        "this is far and beyond a much better multi-outlet strip then what I had previously. we have not had any problems with it. if there was any surges (like during storms) we have not noticed at all. I have a 55 inch tv, a sound bar, a STB (cable box), the internet modem, a PS4, a separate dual controller charger, an Amazon Firestick, a clock and a window fan plugged into this and it doesn't even blink! how could I complain?",
        "This is one of the best surge suppressors for power supplies because there is a lot of room around the 6 outer outlets. Unless the power supply is gigantic, it is possible to put a power supply in all 6 outer outlets. Then there are the outlets in the center for regular plugs. The surge suppressor has never blown, so I can't say how will that functions. I have about 5 of these so I think it is obvious that I would recommend them to anyone with lots of power supplies to plug in.",
        "Dead, ordered replacement. Hopefully better results. **UPDATE** The replacement was dead-on-arrival too. BELKIN u s e d to have a great reputation and products. But that was over 40 years ago before the factories were closed in the US & moved to where?",
        "I purchased this surge protector on Black Friday in 2011. It had no issues powering a large screen television, a PS4, XBOX 360, several other older consoles, and a lamp. It protected ALL of our electronics over the years, including during multiple power outages. It's so great that when we broke up, my ex decided to ignore the fact that I bought this surge protector and keep it for himself! I'm here to buy the replacement. 🤷🏼‍♀️",
        "Customer service with belkin is terrible. Asked me to cut the cord when troubleshoot shooting it and I asked if I should unplug it before I do so. And they said just go ahead and cut it -.- Lol. Obviously I didn’t but. The stupidity lol",
        "This is a very good product. We needed something to place behind a piece of furniture so the location of the USB ports had to be on the top of the unit rather than the front, as many are built. This fits our needs perfectly as we're able to push the cabinet much closer to the wall due to the USB ports being on the top. It functions perfectly Very pleased with this."
    ]
}