{
    "entity": "Steak Sets",
    "text": [
        "Cut my finger on the first use which I guess means they work perfectly! Non serrated so it doesn’t tear up the meat as your cutting. Slices fingers quite smoothly",
        "After years of using old, serrated-edge steak knives, these are fabulous! Sharp, solid, nice looking and they really slice through whatever you happen to be cutting...no more \"sawing\" with a dull edged serrated knife. You can feel the quality of this product in your hand as you use this knife. I would not hesitate to recommend these to anyone wanting a better knife than what they have. In fact, I am so happy with these knives I intend to look into what else Chicago Cutlery has to offer! Cheers! p_rod",
        "Get 4 knives. Not the sharpest knives (like my cooking knives) but they were sharp except one. One had a much more pronounced bent over edge. All had a slight bent over edge which can be felt with the edge of the thumbnail but one was very pronounced. Took a standard inexpensive knife sharpener, honing rod, and about 10 minutes and had a nice edge to the knives to make them the nicest every day use knives I have had. They were worth the money.",
        "I purchased this knife set based on America's Test Kitchen's recommendation. I'm not sure what I was supposed to get, but these knives are serrated and the pictures shown were smooth. The serrated edges rip into the meat and shred it. This has got to be the worst set of knives I ever had! I'm keeping them only because I don't feel like sending them back. My $5 Farberware paying knife cuts better than this junk!",
        "Take a edge ok seem to hold it well. Wood handles are a bit sharp on the hand...like the angle of the blade to handle it seems very natural.. must be hand washed as the wood will suffer if put in a dishwasher...... After which.... one may need sand and refinish the handles as the wife will be quick to point out one's error......love the ergonomics...and it has motivated us to have grilled steak more than ever.. Sea salt, pepper spray with oil and let the steak come to room temp ....make sure the grill is hot....enjoy the cutting with these guys...",
        "The quality of these knives has changed. They are not the same as the original Chicago cutlery knives. I called Chicago cutlery and they admitted the change. The picture does with gold Rivets are the old style of knife. This product was cheaply made and I returned it .",
        "I bought my wife a set of steak knives for Christmas (I bought her something else nice so shut up!). I won't say which brand they were but they cost about $80 and right off the bat, we thought they were cheap and flimsy. We looked around and settled on these and we love them. We have an old set of Chicago Cutlery knives and these seem to be about the same quality as those. They are sharp and look like they will last a while if you take care of them.",
        "I bought these to add to 4 that I've had for years. These new ones are made in China, but not much different from the originals..... much better than most steak knives. Stay sharp with an 0cassional touch of the steel and good handle. So much better than the big clunky serrated junk found in most restaurants.",
        "If you're looking for knives that have small handles and are very light, these might be just what you're looking for. If you're looking for something more substantial, keep looking.",
        "My original set of 6 knives (from maybe 15 years ago) had a couple that were chipped or bent and a couple that were lost along the way. These are really close to the same handle profile, but not quite as rounded over on the corners. Still, great knives.",
        "I purchased these knives on the recommendation of America’s Test Kitchen. I’ve had them for a year. They were dull right out of the box, can barely cut through a sandwich, and reduce a tomato to sauces instead of slices. I never use them anymore, just taking up space on the counter.",
        "Chicago Cutlery is top quality, this is my fourth set in 5 years and I am very happy. The only thing I did not like is that the tip of the knife is curving upwards and not straight like the older models.",
        "Really incredible knife set for the price. Was really skeptical about the price, I’ve never owned cheap knives that were high quality. These are an outlier. Extremely sharp, and very good looking. Would purchase again.",
        "The blade continues on through the handle of these steak knives....problem is, the wood handle does not protect your hands and fingers from the sharp edge that ever so slightly sticks up away from the supposedly protective wooden handle. We will not be using these...............",
        "The best fine bladed cheap steak knives on the market. The cutting angle is a little weird but you get use to that. The handles need some oil applied. But its worth the little time it takes to do it because the blades are and stay sharp. Would be 5 star if the handles were finished better.",
        "Got these because of their high rating on Cook’s Illustrated. I don’t find they cut any better than the cheap knives I bought from a TV ad 20 years ago that I wanted to replace. Pretty average knife plus you have to hand wash them. For a superior knife, that additional labor would be well worth it but not for these.",
        "I just received the steak knives - I cannot attest to the durability just yet - I will say they are comfortable, nicely balanced and very sharp. I’ve used them several times already In mixed company and have gotten many compliments as to ease and comfort from both men and women. I will be ordering more very soon, great sharp non-serrated knife !!",
        "I imagine the wood will eventually wear out, but that's charm of wood. The interface between the wood and steel will get funky over time. It easy to hold to me, but maybe not for small lady hands. I'm overall pleased with the quality of the American craftsmanship.",
        "The knives are good and certainly reasonably priced. They aren't of the quality of the much more expensive steak knives one can purchase but they do the job they are intended to do.",
        "Cant say enough about these. I first got a set as a wedding gift over 30 years ago and they are still in use so I bought some for my son and he loves them too. This is not just a steak knife for me, it is my go-to knife for everything from steak to sandwiches to veggies and fruit. I use it everyday.",
        "These were the steak knives my family had as a kid growing up, and I remeber them working great even after 20 years of tough use. I ended up losing my knife block set in a break up and bought these to augment my new a la carte knife block, and they are a great value.",
        "Very nice and reasonably priced. I got a set when I got married many years ago and used them until they just wouldn't hold an edge any longer. I know you can buy fancier but this is good for every day. It's difficult to find steak knives without serrated edges, which my husband prefers.",
        "These knives definitely are not pretty for use at your holiday parties if you like to put out your best. They are very utilitarian in nature .... not a sleek design and the wood handle is not polished to a super shine finish. They are just plain .... but when it comes to your everyday cutting needs, they would be very hard to beat. They slice through everything .... making quick work of pizza and meats of any kind. If you are looking for something to meet your everyday needs, I would recommend this knife hands down.",
        "These have been great (made in China ) replacements for the original (made in America) ones. They match. Plus we prefer non-serrated knives like these because they double as paring knives---the most used type of knife in our kitchen.",
        "These knives are rated by Cook's Illustrated as a best buy, just below some knives costing almost $200. They are super sharp! Love them!",
        "They don't look pretty but they're cheap, have a nice up curve, and fit nicely in the hand. If i had company over, i would be fancy and use my expensive japanese knives and carve at the table for my guests. For every day and home use these are perfect.",
        "We received our first set as a wedding gift. Now, decades later, we have lost a few so I ordered another set. These knives have stayed sharp and attractive for many years. I wash them in the dishwasher and they look fine.",
        "These knives are starting to fall apart after 3 uses. I will not purchase again. They do cut meat well but the handle and riveting is subpar workmanship. I have been unable to get information about warranty.",
        "These knives cut great. After having bad steak knives for years these are a breath of fresh air. We were going going to get serrated knives, but these are much better. My only wish is that the wood didn't feel so rough.",
        "I have a set of Chicago cutlery, was kind of sceptical about ordering after some reviews I read. I have a set exactly like these for 25 years. The new ones seem as nice as the old ones. For the price they work for me just fine.",
        "These are a whole lot nicer than I expected for the price. Really sharp and well made set of knives",
        "Super sharp, very nice feel in the hand. Only down side would be the handles don't have much of a finish on them and feel like a raw wood. Overall for a home set of steak knives they are great!",
        "Have used this mfgs. product for years. Made to do what it is designed to do.",
        "These are the best steak knives we have ever owned and we highly recommend them. They match our much older Chicago cutlery knives. The edges stay sharp and are easy to maintain. Delivery time was as specified.",
        "I bought these a second time. Perfect size. Good price.",
        "Great knives for the money, sharpen up nicely. Liked them so much I bought another set and retired my crappy serrated knives. Got the second set, now I heave enough for a streak cook out.",
        "I have an older set made in USA, but lost a couple and wanted to replace them. These knives are made in China, cheaply made. They don't have the heft or feel of the older knives made by Chicago Cuterly. The tip of one knife was bent almost 180 degrees. Poorly made and even poorer quality control. BUYER BEWARE!",
        "They're not crazy sharp out of the box, but most knives aren't. Worth sharpening once you get them. Their edges have held up pretty well so far and they look / feel nice. No surprises, the pictures are accurate.",
        "Have always loved Chicago knives. Great addition to my kitchen. Would recommend as a gift or addition to anyone’s kitchen.",
        "I really love these, however after a few months of use and wash, the handles have taken on a rough texture. The wood is not happy that it's been wet. I hope that they hold up, I really do love the brand, and the blade is great!",
        "I have had some of these knives and they last for a long time. I found these as I was looking for a replacement for the first time in about 10 years - I still have my original set and I wanted more. Good quality item.",
        "The knives cut nicely but the handles started to splinter the first time I washed them- and I didn't put them in the dishwasher. Would not recommend.",
        "The knives are sharp but the wood handle is rough after it gets wet...don’t like the feel",
        "These are the most excellent steak knives. I've had the originals for at least 40 years and was glad to be able to still buy the knives. I will purchase again because my husband tends to take one for a task every now and then, and it doesn't get back into my cupboard. These are great steak knives.",
        "Good quality steak knives. Not the best but you're not paying for the best. If you know how to hone and sharpen a blade, you will enjoy the knives",
        "The knives were disappointing as they were not very sharp",
        "I bought these as i did not want serrated knives. I sharpened them with a honing rod as soon as they arrived. Very nice and the handles are of very good quality. These are not built cheap.",
        "Did not live up to reviews. Very sharp to begin with but began to dull after just a few washes. Wood grain raised after first washing, needed to oil to smooth down grain of the wooden handle.",
        "Beautiful, sharp steak knives. I've been looking for affordable, quality steak knives for a long time. They do a great job of cutting steak and I love the way they feel in my hands.",
        "I have owned other items by Chicago Cutlery that was far superier",
        "These knives have been around for awhile, but their quality can't be beat, we have had a set of Chicago cutlery knives for more than 30 years, and with an occasional sharpening, they'll probably last another 30 or more!",
        "The knives are alright. They're very easy to sharpen, but the wood handles aren't finished and have splintered in spots, and we've only had then a couple months (and they don't get washed in the dishwasher).",
        "Wonderful knives so glad I finally found a good set. Thank you",
        "We were looking for non-serrated steak knives and these are great quality for a fantastic price. we are very satisfied with this purchase and would recommend if you want some good knives without spending a lot of money. You might get better quality by going with a higher end name brand if you're willing to spend the money. No complaints!",
        "Just be aware it's raw wood. Don't get it wet, or have it sealed. The knives are wonderful!!!!!",
        "Based upon Cooks Country reviews...I tried these...not the best...they really need some serration as well.",
        "These are nice steak knives. They are sharp and easy to clean. A good addition to my knife set. You can't through them in the dishwasher, but knives shouldn't go in the washer anyway. These are good knives.",
        "These are a perfect addition to my other Chicago Cutlery knives. I prefer the natural walnut color to other brands' black handles. These appear well made. I'm glad to have been able to buy 2 sets which fit perfectly in my butcher block. I personally prefer Chicago Cutlery to the other brands.",
        "the very best steak knives for the price. i suggest not testing their sharpness except with food.",
        "These were a top pick from \"Chefs\" magazine so my expectations were high. The reality is that they were not especially sharp when they arrived and they are good not great knives. They are not a bad value but not special.",
        "Very happy with finally finding a non-serrated set of knives. Wish I had ordered 8 instead of only 4.",
        "I was given a set of these knives as a wedding gift back in 1976. I had one left after all these years, the one knife I go to when I cut my fruits and veggies, and sad that the handle was about to rot off. Something about the angle and size of the blade is perfect. I was elated to discover I could still purchase these knives on Amazon",
        "The wood portion of the handles are loose on all of the knives. I have purchased older blades by the same company and they are great. the newly made ones are cheap.",
        "Excellent knife. I own a few of this brand and have been very pleased. These were the first I purchased without seeing them first. However, they are as good as the older ones I own. They sharpen well and are very strong. They also have a good feel in the hand.",
        "Great price. Feel really good in your hand. Nice and sharp. What more could you ask for?",
        "these are a great deal stay sharp and cut very well made of a good steel easy to clean well made",
        "Love it. Perfect size to cut into a Bone-In steak.",
        "Wanted a non serrated edge knife and I have an old set of made in the USA Chicago Cutlery so these match. They are now made in China no surprise there. Nice knives wish the handles were a bit larger but not really an issue. Will probably buy another set so that we have 8",
        "I bought two sets of these knives because of America's Test Kitchen and once again ATK has been spot on in their recommendations. The blades are elegant and even after repeated uses over 2 years without any additional sharpening, they sliced through my New York steak dinner tonight like it was butter.",
        "Nice cutlery, glad I bought 2 sets Just be sure to protect the handles with mineral oil. Makes them look good and protects the wood.",
        "They were different than what I had bought previously but they are a fine quality and I will enjoy them for years to come.",
        "I bought this to add to an existing set of Chicago Cutlery steak knives I have so I can accommodate more people during a meal. They've always held up well. Just require a bit of mineral oil to keep the wooden handles looking nice. I like that these are less expensive than higher end brands; however, they do require more frequent sharpening to maintain that razor edge.",
        "High quality but too small to be a steak knife, which stinks, as it is very hard to find an economical straight edged knife.",
        "These are not like they used to be. I still love my 25-year old knives, but these were disappointing- the handles were rough and the blades dulled quickly.",
        "I think I was sent fake ones. The rivets were loose.",
        "Product write up alludes to being European manufactured. But they are made in China. They still appear to be fairly high quality, but I doubt they will last the 20 years that my last set did.",
        "Excellent value but I wish that the wood handles had some sort of finish on them.",
        "I love these knives. I use them as utility knives rather than steak knives. Easy chopping and peeling. Great product and have been for more than 30 years.",
        "Ok for the price. Wish they were still made in America as other reviewers commented. Some quality control issues with wood handle on one of the knifes.",
        "Great sharp, easy to handle steak knives. We've been hand washing our set and they are holding up very well.",
        "I ordered two sets of these knives. In both packages there was one knife that had a loose handle - it had not been properly attached and so the metal blade was wiggling around in the handle.",
        "perfect steak knife. Nice feel in the handle and keeps a sharp edge",
        "I've read the complaints and dismiss them. They are good, sharp and a great price.",
        "Very nice knives - I have several older ones just like them. Very sharp out of the package. I've always had very good luck with chicago cutlery knives.",
        "wirecutter rec so i got them and they are all that and a bag of chips",
        "cuts thru cleanly does not tear or shred meat like a serrated knife does",
        "These are solid knives. I've been using them for nearly five years. One has gone missing, so I'm about to order another set.",
        "My favorite everyday kitchen knife. Inexpensive compared to \"status\" knives. What more does one need than a blade that holds an edge, is easily sharpened, and a well-made handle that is good to the touch? It's a knife; how much can one write?",
        "Excellent. Top rated by American Test Kitchen and I agree. You can sharpen these when they get dull, although I haven't had to yet as they're keeping a nice sharp edge.",
        "I have already tried cutting my steaks with great success over the serrated bladed knives. They look great and can be sharpened which I like. The price is good for the quality of the knives.",
        "Unbelievably good quality knives that slice through steaks like butter!",
        "Need to rub the handles with mineral oil and sand them done (unfinished).",
        "The knives work very well. I wanted wood handled knives and these fit the bill exactly. They are well balanced and cut easily.",
        "nice quality for the price & matches my Chicago Cutlery kitchen knives ...",
        "Best ever!!! Recommended by America's Test Kitchen as 'Best Value'. Bought two sets. Highly recommend these to individuals that like sharp knives.",
        "I love Chicago knives and I use them for everything. They are so easy to self sharpen because they have straight edges! I had mine set for over 20 years and 5 years ago added 8 more!",
        "Well made and more than adequatel sharp. I would highly recommend them.",
        "America's Test Kitchen rated these their best value and we can see why - the wife and I have suffered for years from horrible, cheap steak knives and just thought that was the norm. We were ready to spend $80 on a set of 4 German ones, but these were given a high review by the Test Kitchen (who we trust and has steered us to some great products over the years.) They cut beautifully and work great. True, they don't look as neat as the more expensive brands, but we don't care - the money we saved on these allowed us to get a lot of nice steaks to cut and eat :)",
        "Recommended byAmericas Test Kitchen, came in 2nd after a $160 set!....Absolutely worth double the price!",
        "knives are almost impossible to sharpen. they arrive very dull"
    ]
}