{
    "entity": "Steak Sets",
    "text": [
        "I want to like these knives. I bought them after numerous google searches. I’m disappointed because after all the research, I still ended up buying something that is made in China.",
        "Sad that I didn't open it to check before gifting. Loved the knives and the box looked great, but upon opening, discovered the break. Disappointed from a quality perspective in that. Luckily, mother-in-law doesn't need the box for storage, but still. I expected better.",
        "Match with the Ikon large Knife set and block--not only are they much cheaper than the Ikon Steak Knives, but they are the more stylish item, in my opinion",
        "Purchased as a gift. The knives are smaller than expected but still nice. They are a good quality. The storage case was a feature that I liked. However, the knives rest in slots in the case but will fall out if you inadvertently turn the box over. I would still recommend these knives.",
        "Beautiful and sharp! Modern looking. Don’t go with my kitchen decor, so the stay in the drawer. But I bought them because I wanted stainless steel! And the price was awesome!",
        "Overall, I am pleased with the knife set. The blades are sharp, the design is simple, making it easy to match to an existing holiday flatware set. I only use these knives several times a year, for holiday dinners. My only disappointment is that the hinges on the case broke, one hinge fell out, despite the few times I have used the set. I like the box, but now it is useless.",
        "These are great!! I like meat. I like to cut it easily. I don’t like spending too much money but appreciate quality. Win. Win. Win.",
        "I bought this as a Christmas gift for my daughter who wanted a set of \"one piece\" steak knives. When reading the comments, many people were disappointed with the box the knives came in which seemed strange. I was more concerned with the quality of the knives than the box. As it turns out, that was what my daughter cared about as well. Actually, she even liked the box because it will give her a dedicated place to store them - but it certainly wasn't the focal point of the item. These knives are comfortable to use and the one-piece design means they will last with no worries of them loosening or coming apart.",
        "These knives are not only beaytiful but they cut through steak like butter and they are sold at a great price.",
        "I like that they feel substantial in ones hand. They are not flimsy and have some weight to them when held in ones hand . they are also delicate and easy to maneuver. They are pretty sharp in looks and function.",
        "I recently purchased these knives because the company has a good reputation however, they didnt perform well as in they cut the meat but with quite a bit of effort. I still have some cheap steak knives from 15 years ago and they cut better than the Wusthof . I ordered the Bellemain stek knives and wow , they are far superior .",
        "Comes in a beautiful cherry mahogany box that looks great on the table for a special event. Sharp and comfortable in the hand, the non serrated edge is easy to resharpen. Recommended if your entertaining guests and would love to show off fine German steal craftsmanship.",
        "Shame on me for not reading the reviews. Being a wusthof knife owner I was expecting high quality German knives. I am really disappointed. Read read read read. I wish I would have read. If you are looking for wusthof, don't buy this. If you're looking for a high quality streak knife, this is not the one! Cheap glued on logo on box. Serrated edge knife. My fault, I didn't read enough. Made in CHINA, NOT GERMAN wusthof!!",
        "Gorgeous knives. Love the box and they work so, so well. I love that they're a solid piece of metal instead of a handle/blade situation so there's no room for rusting. Just replaced some terrible old steak knives with these - we probably eat steak at home once a week - and I will never go back! They have an awesome weight to them as well.",
        "The gift box was delivered broken, very upsetting. I expected better quality, the box appeared cheaply made, the wood is not quality which when you gift a personal keepsake you expect the product to be quality. Very disappointed. I can say the knives are pretty decent.",
        "Beautifully boxed. Sharp and meats are easily sliced. Love that these knives can be used with a casual or formal place setting.",
        "These are nice knives that look and cut great. The presentation box is cheap, glued together crap. The box arrived with 4 of the knife slots loose in the box because the glue didn't hold them in place. I had to super glue them back into place. The knives are great though. I would think twice about the box if this was for a gift.",
        "Love these knives! I first used this brand at my sisters’s home. They received them as a gift. Before I traveled back home I had ordered them. We use them all the time. Nice storage case...",
        "Nice set! I hand wash the knives and store them in the box. Not totally necessary, but I love how nice they look. They are beautiful and feel good in your hand. I was happy to replace my crappy, dull knives with these!",
        "We love these. They look great, are very sharp, and have a nice weight to them. I don't put them in the dishwasher but it looks like you can.",
        "The knife set is beautiful and high quality stainless steel, very happy so far. The only \"complaint\" is that the handles are not a brushed or satin finish (shinny or polished), they seem to show finger prints.....",
        "The package looks so nice! We’ve used them a few times now and they’re really sharp and feel sufficiently “heavy”. They also had excellent Customer service! I had an issue with my order and they addressed it right away.",
        "I love it! Heavy and fancy steak knifes. Looks gorgeous on the table..",
        "Beautiful finish and good heft. Many steak knives look and feel clunky. I knew they would be good quality but they are also good design.",
        "These are great and they can also be a great gift ! They look really expensive, definitely would recommend!",
        "Good name, fancy box, but not more than that, nothing better in these knifes over any other simple stake knifes, I’ve seen much better quality and lower priced. I would return but 30 days past :(",
        "This was a shower gift and the bride loves them",
        "best set of knives for the price! Matches my silverware!",
        "I bought these to replace knives my husband and I bought 6 years ago when we got married. These knives are wonderfully sharp and look great with our silverware. They work for a nice dinner with our china or an everyday dinner. The only slight drawback is that they are only serrated on one side and are designed for right handed people. My husband and I are both left handed. Even so, we are still able to cut well with these knives.",
        "Bought a couple sets as we were having 20 people over for Thanksgiving and I wanted cutlery to match. These were fine. Looked nice enough. Not very heavy. Unsure if I would choose these with unlimited budget.",
        "Beautiful set of quality knives that I gave as a gift. They were perfect in including storage box that I got one also.",
        "I took a chance as a gift for my wife. I just wanted something that would cut well. I like wood handled knives, but know she thinks washing them causes problems with the wood. That is why I figured she would prefer metal handles. The knives were a big hit! Pat me on the back...",
        "Love these I’ve been wanting them for a while and finally picked up a set when they went on sale. I’ve had no issues washing in dishwasher.",
        "I love these knives. They are super sharp and very good looking. I also like the box they came in. It protects the knives and keeps them from getting scratched or knocked about in the kitchen drawer. I think they are well worth the money.",
        "Great looking and very sharp.Ideal for steaks. Very happy with purchase. Bought second one as a gift",
        "Love these! The case they come in is perfect for keeping them nice.",
        "Beautiful knives, sharp as they can be, and in a very nice presentation box. They do fingerprint easily, but go in the dishwasher with no issues. They were my wedding present to my husband, and they are working out great.",
        "Well balanced knives. Perfect for gifting in lovely sturdy box. Great value for price. Remember to hand wash.",
        "These are great- I have 18 of them. They cut nicely and they're pretty plain-- so they look good with my regular utensil set.",
        "The serrated part is so far down on the knife that it’s annoying to cut meat because you feel like you have to cut with the tip of the knife and not the main middle part.",
        "We’ve only used it once so far but was really impressed with the box, knives and price!",
        "This was a gift to my granddaughter and I was so pleased with the beautiful, quality product. She loves them!",
        "I was hesitant to get these at first since I don't like serrated edges because they can't be sharpened. The price of these was too attractive and I just went for it. They are attractive looking even with the slim handles and they do a fine job cutting through my steak, so they suit my needs. The box is poorly made as others have noted... but I keep mine on a magnetic strip in my kitchen closet.",
        "Got these for my mom who really needed new steak knives. They are sturdy but look really nice and are a good size. She liked them so much I ended up buying another set.",
        "Good knives, not great. They look like typical dinnerware, which is nice. I don't care for huge, steakhouse style knives, so these work well. They are pretty sharp, and have a nice weight to them. I would buy them again.",
        "This set was a gift to our daughter and son-in-law. It complemented their modern china and flatware well. When we used them for Christmas dinner, they handled easily, were well-balanced, and rested well on the plate. From a reputable firm such as Wusthof, I know they will give many years of service. I was pleased with our gift. The box is attractive enough to go on top of a buffet or on a shelf in a china cabinet.",
        "Great as a gift. Only complaint is when the knife is in the box, it can still shift around and the point of the knife can dent the box. This item would be perfect if there is some sort of material to protect the box at the point side.",
        "Knifes cut very well and look forward to using them alot.",
        "Very very nice and well made Steak knife set. Cuts like butter. Well balanced. Highly recommend them.",
        "Exceptional quality for the price. Very visually pleasing, sleek in style. Also, great utility---cuts with ease. Nice medium weight, too.",
        "Wusthof is the only knife brand we buy because of the superior quality, beauty and reputation. I've been buying Wusthof knives for over 45 years. These knives are bright and shiny, but smaller than I expected. They're not much larger than the normal dinner knife, however, they are very sharp and balanced to use for steaks, etc.",
        "We used these at Christmas for our prime rib dinner. They are wonderfully sharp and look beautiful on the table. I love the storage box they come in as well.",
        "Beautiful steak knife set. Nice and sharp. Very minimalist design that matches well with our silverware.",
        "These are substantial to hold and quality design - they look great at a formal table too!",
        "Very good product at a great value! Came well packaged and free from any damages. A fine gift for any steak lover.",
        "Amazing! sharp and cut through everything from meat to vegetables. They look great on a nicely set table. Highly recommend this product.",
        "I bought this set to replace the random doll not working steak knives I have in my drawer. These are pretty and sharp and they do the job",
        "Excellent knife set. I’ve had them for about 6 months and the set has held up wonderfully.",
        "Good hand feel, nice balance. The knives are holding up well, no complaints.",
        "These are Wonderful. There Are made well and built to last very very high quality they will probably Last me a lifetime. You can't go wrong with this Purchase.",
        "Product received as expected. This set makes a great gift. I like to give for Weddings!",
        "They look so nice and complement my knive set! Highly recommend!",
        "a gift,so I really can't comment on how well they are working out, but I know the recipient was delighted to receive them.",
        "I bought this set for myself last year. I liked them so much I gifted a set to my son and his wife this year.",
        "These are \"formal dinner steak knives\" that will match almost any 18/10 stainless steel flatware. Not as sharp as Chikara Ginsu steak knives or as sharp as Victorinox steak knives, they are nevertheless certainly sharp enough for the job they're supposed to carry out. And they are much nicer looking in the company of standard SS flatware.",
        "Product was purchased as a gift. However ... upon checking it out prior to wrapping it, I should have ordered one for myself!",
        "Knives feel great in the hand, solid but not too heavy. Cut very well and look sharp. A great set. Would buy again for sure.",
        "could be sharper, but the quality is nice, and they are very beautiful so 4 stars",
        "We gave these as a gift for everyday use and we are told they love the knives, they have kept a edge and clean up very well",
        "These are beautiful knives and appear very well made. I bought these for my formal dinners and am very pleased. I have not placed mine in the dishwasher so I can't say how they hold up. I would definitely recommend these both for personal use and as gift-giving.",
        "This is a great deal on high quality knives. Beautiful, and come in a lovely presentation box.",
        "Bought as a shower gift. Loved how it came in it’s own cutlery box",
        "This is a nice set of quality steak knives that come in a gift box. We still use the a set we received over 30 years ago on a daily basis. This is a gift that will not just be put away but constantly used. Each time I use ours I remember the friends that gave them to us.",
        "A little disappointed in the box. I thought it showed a very nice wooden box.",
        "These were a gift for my carnivorous partner. Practical and pretty.",
        "these are wonderful steak knives with a good weight, balance, and sharpness- plus they are elegant.",
        "Very sharp, presentable. They match my normal silverware nicely. Love the storage case. Dishwasher safe without any rust spots. I'm very happy!",
        "Very nice set. Nice looking. Nice sharp knives to cut thru steak effectlessly. Very happy with the set",
        "Love these knives, bought sets for my adult children as well. They accompany well many different dinnerware designs. They are sharp without being dangerous for kids. I reserve them for special occasions.",
        "I purchased as a gift. I thought the set was beautiful and unique. I cannot speak to performance, however, as I did not try them out.",
        "Great product but water spots with every wash unless dried immediately.",
        "They look great and cut chicken and sausages well. Have not tried them on beef.",
        "Love these guest love the comfortable in your hand and very sharp",
        "Nice knife set but not the quality of the cooking knives.",
        "Have used for months now and they are still cutting well. Got as a gift - great price for the brand.",
        "Replaced an old set of knives we had had for decades. Used them for Christmas dinner of prime rib and they were great.",
        "Excellent knives, would buy again and recommend everyone should but this product, if you want your steak knives to have a metal handle, of you prefer wood handles you should try another brand.",
        "Very good knives! We are very happy with our purchase.",
        "Bought as a gift and they are nicer than expected.",
        "These are a great buy - well designed, sharp - very happy",
        "Perfect. They are made in China but still carry the brand name and quality. I would not get bogged down by where the came from - they’re great and reasonable.",
        "I gave these to my family and bought 2 sets for me. Hope the stainless wears well without scratching handles because it’s so shiny now. Very sharp.",
        "Gave this to my sister for Christmas a couple years back. She loves them and has no complaints. High quality blade steel, good balance, and a tang that goes far into the handle. I judge knives by how good an edge they retain, the ability to cut thinner things like tomatoes, and the overall balance or feel in the hand. They're great on meat, and so-so on tomatoes, but they are steak knives, afterall. :-) They're Wusthof! Excellent wedding gift too.",
        "Both the box and knives are Made in China, not Germany. I should not have assumed Wusthof equals Made in Germany. The box is of no value, but the knives work great.",
        "Just as described! I was looking for a second set of these (I already have one) -- there are several on the market that are similar, but I needed a set that exactly matched the one I had. This was perfect. Thanks for the great service.",
        "These knives are wonderful and work great! The only reason I did not give it 5 stars is because one of the wooden inserts that holds the knives in place was unglued when it arrived. We used wood glue and fixed it at home rather than sending it back for a replacement.",
        "These are really pretty, very sharp & sturdy. We bought the as a gift & they love them!",
        "Wusthof is the ultimate in quality and durability. These will be handed down to future generations.",
        "I purchased 2 sets due to big family & the knifes are great!!! The box isn't the sturdiest but happy with the most important reason for my order. The knifes are great & could use for just about any dinner setting.",
        "Bought this for my mom, she loves it! Cuts steak very well and they are really nice looking!"
    ]
}