{
    "entity": "Pipe Wrenches",
    "text": [
        "Irwin usually makes nice products, and this one is no different. Solid with great aesthetics and feel. So far it's a pipe wrench, but one that should last. Nothing else to say.",
        "I bought it just to unscrew a single plumbing fixture because I refuse to hire a \"professional\" for anything so simple, but I'm sure I'll use it more because I had frequent issues with needing a bigger wrench before I bought this one and my landlord is terribly negligent.",
        "Built well and Irwin is a good choice in my book after dealing with them personally they honor their lifetime warranty and shipped me a free replacement for another type of pipe wrench at not cost.",
        "This has been a handy little sucker. This is the right size pipe wrench for around the house. I've used it for several projects. It's not to small or overly large and heavy like a lot of pipe wrenches are. Would recommend for around the house. Good quality made as well.",
        "Very different from the picture and the packaging was bizarrely underwhelming. It's definitely a pipe wrench though, and it works so it gets 4 stars from me. I'd recommend it. P.S.- It's not different enough to suspect it is counterfeit.",
        "Quality tool, just what I expected. Have used it several times, easy to use one handed & doesn't slip like a cheaper wrench.",
        "Work fine, well made, a welcome addition to my growing collection of hand tools.",
        "This wrench is exactly what I wanted. It is heavy, but the jaws operate smoothly. You can feel the weight of the unit as soon as you use it. Would buy again.",
        "Great looking and feeling tool. Oh, and does a great job.",
        "Saved me a lot of money by not needing a plumber. This thing is a beast and will move almost anything!! thank you other reviewers for letting me give it a shot!",
        "high quality and work just as good as they did 3 years ago when i purchased them.",
        "this is what my handy husband wanted for working on our house and was just what he expected, great price",
        "Can't go wrong with this one. Heavy cast iron and virtually nothing that can break. Teeth have sharp grip and have worked flawlessly so far.",
        "nice wrench, I am just a homeowner but I needed to get a few pipe wrenches when tackling some plumbing jobs. Settled on this one and a 10 inch one as well. The wrench has good power and appears to be sturdy, hopefully I'll be handing this thing off to my children one day.",
        "I don't own many tools but ever since I bought this wrench I've felt the itch and have wanted to buy more tools. It's very solid and seems like it will last a lifetime.",
        "The Irwin 274102 pipe wrench is well made and offers a great value. Does the job it was designed to do very well.",
        "A fist rate tool. Dies sharp and handle clean of burs. Well made product I would buy again. But owning tools like this I doubt anyone would need to purchase again. Thanks!",
        "Great quality. Very happy. I am a small woman, however I had no problem using this pipe wrench. It is heavy, however I liked the extra weight so I did not have to work harder! :)",
        "Does the job very well, but holy hell does this thing make your hands smell like cancer. Seriously, just touching it for a second means you will need to scrub your hands for two minutes to feel clean again.",
        "I've used and abused this wrench and it can take it. It has the best feel to it than any other wrench has. Other plumbers have used this wrench and ran out and got one right away because nothing else compares to it. I switched completely form Rigid to Irwin and I have been much happier."
    ]
}