{
    "entity": "Pipe Wrenches",
    "text": [
        "DO NOT BUY THE 10 INCH UNLESS YOU ACTUALLY NEED A 10 INCH Great tool , tough as nails, easy to adjust, well built BUY THE 8 INCH FOR EVERYDAY OR EVEN EVERY JOB USE The ten inch is simply too big for the hand",
        "If I was a plumber or a professional tradesman and I used this wrench everyday, I might have ponied up the extra cash and got the aluminum one. Or maybe not, It's only a 10\" wrench and not all that heavy. But that's the only other option I would have considered, because the fact is you can't really find a better pipe wrench than these wrenches from Rigid. They're made in the USA and they're no more expensive than any other quality pipe wrench. Pretty much a no brainer, BUY this wrench if you need one, you won't be disappointed.",
        "This thing has a super solid build, was super easy to use, and got the job done! I was struggling to take the barrel nut off of my AR-15, and had all but given up when I decided to give this a go. Man, am I glad I did. It didn't slip, didnt strip the teeth on the nut, and didn't take another set of hands to make it work. I would recommend this product in a heartbeat!",
        "This is a solid pipe wrench. It will last you a lifetime. It has a replaceable lower jaw, but you won't need it unless you are a professional plumber and us it every day for years. Great quality and made in the US. It isn't the least expensive, but you will never need another one.",
        "It is smaller than I expected but that is probably on me for not truly considering the measurements. It will work perfectly for small household jobs. Very sturdy and well built.",
        "This pipe wrench is built to handle all jobs around the house and garage! Highly recommend!",
        "Was trying to replace the showerhead but the arm was stuck and I was worried I'd have to call a plumber. With this wrench it came off in about a minute and I was enjoying my new shower in no time. I haven't had it long enough to test the durability but the build seems fine for the price",
        "Life time warranty you can't complain. The tool does seem a bit loose, but I've never used a pipe wrench that didn't jiggle around so I don't think it's due to faulty craftsmanship. The tool is hefty for sure, but it's made out of solid steel, so you can always use it to bang on stuff as well.",
        "What can I say about this product. As a proud union pipefitter, I've seen these wrenches on every job abused or not and still works. From the very smallest 10 inch to the largest 48 inch I've seen this pipe wrench from Ridgid is made in the U.S.A. enough said. Lifetime warranty!!!!!!!!!!!!!!!!!!!!!!",
        "Broke while trying to undo a gass pipe. I usually expect more from Ridged.",
        "Made in USA! Had mine stolen, In a pinch I bought imported knock offs painted red and blue(teeth to soft, constantly adjusting, misaligned jaws, and bloodied knuckles) I bit the bullet and replaced my set...don't waste your money on the wannabees... just buy one Ridgid use it for a day you'll be back for the other sizes.",
        "it have a great bite ,and easy to clamp down , especially on small parts long handle to keep balance great tool",
        "Must have in every tool box. Will last a lifetime. American Made.",
        "Most pipe wrenches my brother managed to break. Rigid Pipe wrenches were the only pipe wrenches my brother could use without breaking the pipe wrench in the process. This is why I chose the rigid 10 inch pipe wrench over all other brands.",
        "The only pipe wrenches worth buying Got this for a gift.",
        "These guys make a great quality tool. No Harbor Freight shortcuts here. This is a good tool that will last!!!",
        "Grips fantastic. My Lennox stuff was pure trash. Ridgid is the only way to go.",
        "Wrench is as exactly as described and was received within the specified shipping time frame.Overall,I'm very happy with the product and highly recommend this seller to anyone.",
        "Working as intended. Couldn't get the job done with channel locks, the grip on this removed a shower head on a loose pipe with ease.",
        "Exactly what you would espect from ridgid. A quality wrench.",
        "heavy, sturdy as usual as Rigid is, there is a warranty also, they challenge you if handle broken a free one will be sent....wow this is amazing",
        "This Ridgid 10\" inch pipe wrench works great in our Pipefitter's tool boxes, being that it is made in the USA is a super plus.....Always shop for tools made in USA.",
        "If it says Rigid on it , its a keeper ..",
        "There are pipe wrenches and then there are the best pipe wrenches and that is what Ridgid is. Best Pipe Wrenches",
        "Not impressed at all. Used it just one time, dropped it from maybe 1 foot and the exterior paint coating chipped. Now it's razor sharp and will easily cut my hand. Worse of all this paint chipping occurred at the handle. So every time I go to use it I have to be careful not to get cut. So much for being American made. I expect better quality from a made in America product.",
        "Bought this for my father. He is happy with the product.",
        "10-inch pipe wrench is so versatile, you will wish you had this on your tool belt. Rigid RKO’s the competition. Breaking their teeth out, while Rigid’s teeth will stay sharp and able to bite into thick wall pipe well into its 90’s."
    ]
}