{
    "entity": "Pipe Wrenches",
    "text": [
        "Industry standard. No sense in being cheap and buying anything else. Personally own an 18\", 24\", and 36\" aluminum. I don't care what the difference in price is get your biggest pipe wrenches in aluminum. You could get them cheaper in another brand, I get that but you'll end up replacing them in Ridgid anyways. Buy quality tools once or you'll regret it.",
        "This Ridgid pipe wrench is built to last. Lightweight is my new thing because carrying a whole bunch of tools and being in certain positions it was a no brainer. Pay the extra cash to have extra energy for your day because those heavy ones are heavy.",
        "What can I say, they are Ridgid brand and very good quality, never buy a cheap pipe wrench. I am just using these for home use, but have some of the same Ridgid pipe wrenches that I use at work. And if you are deciding between Aluminum and steel, no question go with the Aluminum.",
        "I am not a plumber but appreciate a good tool. This pipe wrench is beasts that will allow you to get sufficient grip to apply an ungodly amount of torque. Good size. You need two. There is a sticker on them saying Ridgid will replace them if they wear out. I like it.",
        "You can't beat Ridgid pipe wrenches. As a Steamfitter pipe wrenches are a daily part of my job. I have used plenty of other brands, but the Ridgids are still the best. The aluminum version is lighter and still just as strong. I have yet to have an issue with the aluminum ones and they don't get babied. Worth the money if you have to carry/use them all day.",
        "This 18\" aluminum pipe wrench arrived quickly (I ordered a Wednesday afternoon & it arrived by the following Monday afternoon) and in great condition. It was packaged fairly well and recieved no damage in transit. This was one of the best deals for this tool that I found in my online searching. Very happy it arrived quickly as we're in a production environment & have a constant need for these types of tools, but are always looking to save some money. The pipe wrench is in great working order - works as expected & described!",
        "Don't waste your money on anything less if you use these often. This brand will not let you down. Quality tool for quality work.",
        "Ridge Tool Co. still makes their products in the USA. Yeah you pay a little more but you can't beat the quality or the lifetime guarantee! Buy one pf these instead of some Chinese piece of junk and you'll never have to buy another.",
        "Your plumber would agree with that title wholeheartedly. Let's look at the pro's first; Made In USA! Yes, you read that right. Made right here. This pipe wrench also comes with a lifetime warranty, and the lightweight aluminum handle is much easier to use than it's steel counter part. Con's; This is the best pipe wrench you can buy, but it is also probably the most costly. If you are price sensitive, and will not use your pipe wrench very often, you might want a cheap steel pipe wrench made in China instead.",
        "This 14\" Aluminum Pipe Wrench arrived quickly (I ordered a Wednesday afternoon & it arrived by the following Monday afternoon) and in great condition. It was packaged fairly well and recieved no damage in transit. This was one of the best deals for this tool that I found in my online searching. Very happy it arrived quickly as we're in a production environment & have a constant need for these types of tools, but are always looking to save some money. The wrench is in great working order - works as expected & described!",
        "I have used Rigid tools and products over the years in my line of work several times. They are rugged and dependable. These aluminum pipe wrenches are a lil' pricy, but....they will do the job and be around for many years. Plus....aluminum makes them a lot easier to handle ....as far as weight is concerned.",
        "Absolutely the best pipe wrench I own. So much easier to use to tighten black iron gas pipes that I'm installing in my home. I could not do this project without this wrench!",
        "I own a lot of Ridged wrenches and they are quality that is worth the price.",
        "RIDGID the name says it all - quality, value that will last a lifetime. The only way to go in my book!",
        "Although my brother was gifted the standard Heavy-duty 24-inch Pipe Wrench, I took a chance on the lightweight Aluminum 18-inch wrench....trading \"heavy duty for heavy-duty light\" HE LOVED IT...WISHED I HAD SENT BOTH SIZES IN THE LIGHTWEIGHT. As we age, our need to lighten our load is always prevelent.... Durable & light",
        "Not much to say about this Ridgid pipe wrench. My guy is a gas and oil technician and will no longer buy anything other than Ridgid pipe wrenches. They are just far superior to other brands. No more buying the cheaper brands and then being disappointed at how crappy they are.",
        "Got these for my husband, who is a plumber, and he was astonished with the difference in weight from the old iron pipe wrenches. So far they have worked just as well and are easier to use.",
        "I absolutely love the Rigid aluminum pipe wrenches. Nice sharp jaws and a sturdy frame to hold it all together. Best pipe wrench for the money.",
        "What's to say if you work with wrenches daily like I do you need a quality light weight wrench. Rigid is the best, Reed is a close second then you move down to Lenox and store brands. You can count on a Rigid aluminum wrench to last for years of daily abuse. Normally if I'm buying a new wrench I've misplaced my old one.",
        "These grip and hold, ... and release like the quality tool they are.",
        "Deserves its high reviews. The reviewers were right. Good tool. Looks durable enough to last for a long time.",
        "Great pipewrench, strong and light. Use them at work almost every day. Hard to beat a ridgid.",
        "Best in the business. The price might be a little higher but these tools are investments.",
        "Top of the line as far as performance. Great bite, doesn't slip like the other brands.... Kobalt.",
        "Ridgid Quality (Very Good), Once you go Aluminum, you won't go back to cast iron. Very satisfied.",
        "I use this wrench every day at work and have not had a single issue.",
        "Great tool, light, solid, and adjusts well. If you use a Stillson style wrench, get this.",
        "Works great. I use this tool every day all day and its hard to find something that holds up. I haven't had any issues with these yet and I think they will last quite a while!",
        "Ridgid makes the best pipe wrenches. Never had to use their warranty yet, but I'm sure they stand behind their tools.",
        "Bought this for my husband for his birthday, he requested any ridgid tools. This was shipped quickly and he absolutely loves his new wrench, uses it all the time. Would suggest this to anyone!",
        "Ridgid pipe wrenches are the industry standard for pipe wrenches, and this one lives up to that standard. It's lightweight yet solid feeling. Worth the extra cost to get a high quality USA made tool that will last you a life time.",
        "I’ve always been satisfied with Rigid tools. Lightweight and will grip just about anything that will fit on the jaws.",
        "Great wrenches, easier on the arms for all day use than similar sized steel wrenches. The offset wrench helps get in tight spots.",
        "Aluminum Ridgid pipe wreches are my favorite. I use them every day for work and wouldn't use another brand. They grip great and hold up the best!",
        "There's no need to say much about Ridgid's pipe wrenches...the best you can buy!",
        "Top of the line! They are light, strong, and have an unbeatable bight.",
        "I work with these wrenches for a living. They are built to last a lifetime of use by someone using them day in day out.",
        "I treat it like it’s my child. It’s the most amazing wrench ever I love it. Super convenient and light.",
        "You can never go wrong with American Made tools. Enough said",
        "great tool to use. At first I was skeptical, using only the steel version, but it is just as effective in aluminum and so much lighter.",
        "I've used these wrenches since 1974 in jobs all over the world; they have no equal. For my money, these are the very best pipe wrench ever made.",
        "Typical Ridgid quality. The aluminum handle is as storng as the steel and quite a bit lighter. The weight savings makes a difference when carrying it in a tool box with bunch of other tools.",
        "I just like that I could get them within a day... There is no substitute for Ridgid Tools",
        "Amazing the difference in weight compared to the heavy duty versions.",
        "When someone has a pipe wrench that slips I get these. The teeth are hardened and grip.",
        "This is an excellent tool. The bite and angles are just right. Makes the job easy. I bought another one.",
        "Bought three pipe wrenches like that they are lighter than steel wrenches.",
        "You can't beat the name, just need to find it for the right price. Nothing else compares to this wrench, I've used many.",
        "Great tool, happy with it. Same day shipping was awesome.",
        "Good light-duty, lightweight Pipe Wrench. I use them for spinning antenna masts into place once they are mount to the tower or building. So my use may be a little more forgiving that a plumber. But for what I do, it is a great tool that can easily be lashed to my harness and carried.",
        "If you want the best, buy the best. Worth the money",
        "Sturdy, well balabced and light weight - nobody beats a RIDGID! The only brand name pipe wrench worth my money.",
        "My husband has been asking for these for his job for a long time...he loves them its the only tools that last.",
        "This is a light weight pipe wrench with excellent bite. It is easy to use and handle. I bought another one.",
        "I have been a commercial plumber for fifteen years. Ridgid tools are my go to tools. There IS a reason they cost more. Tools by Reed are ok in my book as well. It is the same reason most electricians will go for Klein tools.",
        "when you buy the best there's nothing more to say. It's a rigid for pity's sake!",
        "It's a pipe wrench. Don't know what else to say, it's lightweight and sturdy and a good addition to our tool collection.",
        "Excellent ! It's a Ridgid, what else can we say ?",
        "Great weight. Very positive feel to the jaws. So far nothing to dislike at all. From all that I have read, if I treat it well it should last forever and my good opinion should not waver. Fingers crossed.",
        "I am a pipe fitter and use wrenches every day. Rigid aluminum wrenches are the best, hands down. Unless you are tightening fittings on a machine in which case you would want a steel wrench.",
        "He lives them just as they said they was and at a very good price.",
        "Well pump installer guy here, these get the job done. Last pair lasted 10 years before we managed to break the handle and wear the teeth out.",
        "It was on time and I'm a fitter fire Sprinkler.",
        "Light weight! Easier to work with than carbon steel wrenches. Good change up!",
        "Love these they are so light they don't pull my pants off when I put them in my back pocket. Top of the Line quality!!!",
        "Best pipe wrenches in the world. I've been fitting pipe for 15 yrs wouldn't use anything else.",
        "I got this wrench for my dad for Christmas and he can't stop talking about it. He says it is great quality and not too heavy. He loves it and uses it all the time on his farm. Great purchase!",
        "Only the best for a working man's hands. I love these wrenches and work with pipe everyday. I beat on them and have never had any issues with it not performing. Easy to adjust and is made in the USA.",
        "ridgid is the only wrench to use. very happy with my purchase and the purchase process.",
        "What can I say, they are Ridgid brand and very good quality, never buy a cheap pipe wrench. I am just using these for home use, but have some of the same Ridgid pipe wrenches that I use at work. And if you are deciding between Aluminum and steel, no question go with the Aluminum.",
        "I have every size aluminum wrench up to and including 48\".this one and the ten inch see the most abuse however. Wicked strong, and very good quality. If you use pipe wrenches, don't buy any other brand!!",
        "Cannot say anything more than the name. First Class company and products as usual. Shouls have bought the aluminum units a long time ago and saved the iron ones for home use.",
        "I work with these wrenches for a living. They are built to last a lifetime of use by someone using them day in day out.",
        "What can it say - IT's a Ridgid! - Aluminum is that way to go!",
        "The same as the 24 not at all like the picture and 100% displeased with purchased I just wasn't going to complain.. but then I got this so I figured what the heck..",
        "Great pipe wrench from a great company broke an old one I picked up used had a new one delivered to my house in three days worth every penny",
        "was a little bit bigger(width of the wrench) than he would have liked but other wise ok.",
        "Great pipe wrench, I believe the tech I got it for will use it as a hammer. The item arrived within the time frame allotted. Thank you!",
        "Have wrenches. They are fine but since this Is the only thing I have ever ordered from Amazon I wonder how my credit card has been hacked for Amazon",
        "This wrench is a,complete piece of s*** there is so much play in it u have to reset it every time u turn the pipe I'll never buy it again from u guys"
    ]
}