{
    "entity": "External Hard Drives",
    "text": [
        "Works great. I had a friend whose drive died and needed to get the data from the old drives. It worked and I was able to transfer the data to current storage technology (USB drives)",
        "I had priced external zip disk drives (750) and was not ready to spend that much (my search results showed prices ranging from $80-$200) - but needed to restore lost files from zip disks. After ordering the drive - I was pleasantly surprised when it arrived only a few days later, it is in excellent condition and works great. Thank you for the affordability, efficiency and accurate description of condition.",
        "This is one very fine removable disk drive. It records files at a terrifying rate. My only gripe with it is the documentation. I know I am an old coot who stopped learning a lot about computers when it became unnecessary to wrestle with DOS and BASIC, and I still like the comfort of a manual that can be read to settle one's nerves while putting a new toy to work. The instructions accompanying this fine piece of equipment is something Iomega should be mightily ashamed of.",
        "I had Zip disks and this item is one way I could view my files. Great external hard drive for your Zip disks/",
        "This product has served me well for years, providing automatic backup of key files designated by me. It's been a life saver after a couple of unexpected crashes. Just plug it in and it's ready to go. No special software required.It uses disks with a 750mb capacity. That works fine for me but might not be so appropriate for someone with a need to back up huge files like movies and games. The one recently purchased through Amazon.com is a replacement.",
        "I know this is old technology, but I had a lot of old files stored on Zip disks that I had to retrieve. The unit worked great with Windows 7. I was rather surprised.",
        "This works well in reading my old backed up emails that I stored years ago. Now I don't have to take up a bay to read these old files.",
        "Worked to recover old ZIP100 data. Replacement now functions fine.",
        "I bought one of these when they first came out for 100 MB disks. As soon as they put out the 750 MB version aaaaaaa9in the late 1990s or early 2000) I upgraded. I used my 705 MB zip drive every day for well over 13 years until the little connection that goes to the USB port stopped working. It outlasted a whole bunch of computers! It's fast and very dependable. I've yet to have a disc go bad.",
        "Ran okay for several weeks and then it died. Have purchased a replacement from another seller.",
        "I appreciate this zip drive due to its USB cord instead of another connector. It is a quick way to retrieve old or archived data for transfer to better more recent media.",
        "This product no longer has web support from the iomega company because it's out of production. The item works very well. I needed it to read old zip disks. I think the iomega company should be more considerate of customers who have invested in disks for storage.",
        "It works as well as my dead one did. I have quite a few 750 MB and 100 MB disks and I hope I can save them all on CD's as a precaution against loosing them forever.",
        "Works as advertized, so, no need to discard all my 250 & 750MB disks, which work great for Back up.",
        "I paid for a new one and the one I received was used and did not work properly, and it did not come with the original packaging. Very disappointed and return item.",
        "This is a great item for storage of shorter-sized documents, such as letters, memos, etc. As desired, the documents can be deleted or changed unlike a CD or DVD. The 750mb zip drive isn't horribly fast, but it is more than fast enough to do the trick."
    ]
}