{
    "entity": "External Hard Drives",
    "text": [
        "It worked fine for a while but like most electronics it was not too long before it lack sufficient capacity as hard drives got bigger.",
        "Setup was a snap, file copy was adequate and ran a full Norton Ghost backup (about 150G) without a hitch. Copied the files to the device from a Vista machine, extracted them from an XP machine. There was something that sounded like a little screw rattling around inside the casing. It arrived that way and I'm going to assume that it didn't shake loose during shipment, but was the result of an inadequate QA process. I returned it and will probably look for a completely different brand since I don't trust SimpleTech now -- as a company.",
        "I needed to get an external HD since I was running out of space on my current laptop. The deal was pretty good. Although, I could have gotten a TB but I didn't think I needed that much space. Maybe later on I will pick up a TB when they are more on sale. No issues with this. Very simple out of the box and plug it in then transfer your files. Exactly what I was looking for. Some people complain about it taking a power supply, but seriously it doesn't take that much effort to find a power outlet for it. Very pleased with this product.",
        "I formally had a Iomega that crashed within two months. After talking with a tech at their site they sent me a second one which worked for 2 minutes. I gave it to my son-in-law to see if it was my imac that was not compatible,he is still trying to get it to mount to his windows XP. He has a SimpleTech at work and recommended it to me. Very simple to mount and so far no problems with backing up my imac. Hope this one works longer than the Iomega.",
        "The \"SimpleTech 500 GB USB 2.0 External HD\" has performed well for me over the past 6 months or so, with no issues or problems at all. Overall, I am very pleased with it and can make the following observations: * Fairly small, good looking case * Very quite * Fairly inexpensive * Has power switch * Is fairly fast We bought this drive to replace a defective WD MyBook (not recommended). Recommended!",
        "I purchased this product last year. I loved it at first, but soon started getting errors and notices the drive was corrupt. I put in a service request with SimpleTech, but have NEVER been contacted by them. I have tons of files and photographs on this drive that I am unsure I'll ever get off. I purchased this drive because I had used SimpleTech memory for years with great results. However, I will never purchase anything they make again.",
        "Being a tech guy, I'm usually wary of products without great brand names attached, but the price of this 500 GB external was too good to pass up, so I took the plunge. I am very happy I did. This is a great drive that runs quietly and doesn't get very warm at all. The flashing blue lights on the top add to the coolness, and it was only a plus that it matched with the LEDs in my computer. Remember that this drive uses a separate power supply so you will need an extra socket to be able to use it.",
        "The Good: Sleek design, nice one touch backup, fast response time and reliable . The bad: Bulky If you need a reliable back up device, then the SimpleTech SimpleDrive is for you. Out of the box I was a little disappointed about the size, but once I plugged it in and started using it, I became more and more in love with this drive. The drive was easy to set-up and in less than a minute I was up and running. The price was very reasonable as well. Bottom line, if you need a good back up system or another drive, then get the SimpleTech SimpleDrive.",
        "$265 for something that's dead out of the box? Decidedly not cool. Admittedly, it only took three emails to SimpleTech's tech support to get an RMA. Now I can look forward to the adventure of getting it replaced in some reasonable time frame. Given the other 18 (so far) one star reviews, I should have spent my money on another manufacturer's offering.",
        "Had to replace the first one after six months - couldn't get my money back, after being assured by the tech department that they hardly ever replaced these or \"they wouldn't still be in business.\" From the look of reviews, they won't be for long. My replacement lasted two years and died today with no warning. SimpleTech - more like SimpleSuck.",
        "I purchased 2 of these hard drives, a U35/500 and a UF35/500 (which has the Firewire connection), since they seemed to be good value for money. I have only had them a few months, but so far no problems. They installed easily on my computers (Windows XP) and the included software seems pretty straightforward. Initially, I thought there was a problem with the UF35/500 model, because when I switched it on nothing happened and there was no red light from the on/off switch. However, after about 10 seconds, the light came on and the drive spun into life. There is always a similar delay when I switch that machine on.",
        "The drive performed very well for first 3 month. When I had about 150GB worth of data, it suddently died. I dont know if it is the adapter that failed or the drive but it wouldn't powerup anymore. This basically means that all your backups are gone and you have no way to recover that. Overall performance of this drive is poor.",
        "I Bought it by mistake, also it bring a external AC Input cable, not recommended as a portable device. Also I had this hard drive only for 3 month because in my house we had a electrical issue, so the disk was shocked trough the AC Input cable. From that moment I decided never to buy a Hard drive with AC Input cable.",
        "I purchased this Simpletec hard drive to upgrade from a 80 gig Simpletec that worked beautifully but was running out of space for my back ups. It was smaller and required no external power except usb. This one does requires a transformer and this is the only negative I can find with this drive. It works well for the month that I have used it.",
        "It has been working fine for years. Could not get the built in software to work, so I just use it as an extra drive to backup my PCs.",
        "I have not had the drive for long, but it does the job that I want fast and easy. I wanted it for a large number of photo backups. I'm a professional photographer, and I shoot large numbers of photos during a wedding. This makes it simpe to unload all the photos on this drive and not use my main hard drive. Why wear out my main drive when I can can dump everything on this inexpensive, and replacabale drive? Great price, super speed. I love it.",
        "I have had difficulty getting this to work properly ever since I got it - year or two ago - even with the assistance of their technical support group",
        "This is a very quite HD something I need since I have an iMac. The backup software that came with it works just great. To date this is the best hard drive I have ever purchased and I own 10 hard drives. This is a good buy. The delivery from Amazon was super fast.",
        "I bought this a week ago and finally got around to setting it up to back up an old PC of mine. I tried using the software that was included to back up the drive, but found that when I went to actually run it, it just didn't work. It seemed like it had some neat features, but it gave me lot's of error messages. I went o my old stand-by Back2Zip to use as the software backup and it worked beautifully! The drive is a little bigger than I thought it would be, but it works great - now.",
        "I had to return this almost as soon as it arrived as the drive stopped working within the first plug in to the USB port. When I contacted the seller, they mentioned this specific model was having that issue frequently. Will not order a SimpleDrive again.",
        "the order process was good, the drive works fine, installation of the drive and the software was easy, the backup software that comes with the drive is awkward to use and not very configurable, in the end I sacrificed the 1-button function for a more configurable backup software",
        "I purchased a SimpleTech external drive in 2009. I only use it to store pictures, some music, and few movies. I only used about 48 GB of the 500GB storage space. I usually just leave it on my desk and use it as backup. The drive doesn't get moved around much. I have dropped it once on a carpeted floor from my desk (2ft maybe). The last time I turned it on to store some pictures, it turned on, the blue light came on, made a few clicking noises and went silent. Tried restarting many times. Nothing. I'm not sure what to do next to retrieve my data. I mean what do you do when your backup fails?",
        "I bought this drive mainly to collect data from employees computers that were laid off this fall. I was delighted with the ease of operation and the shear amount of data that I was able to get on this thing. I am very happy and satisfied with it's performance. Recommend highly.",
        "I bought two, one for myself, the other for my son. We like it very much, you can put it on the desk, easy to put any place, don't take a lot of space, another good thing is: it has switch to turn on and off, that's wonderful.",
        "This was a good investment 5 years ago. But now it is out of date .. a relic... they have smaller wallet size exterior hard drive with 4 terabytes of space, that do not need and outlet for power just a USB port... This is Not a good buy.",
        "This External Hard Drive is great for backing up my computer. It holds all of my pictures, music, etc. and there is still plenty of room left. This is a great buy for the price, and it works great!",
        "Very good product. Working great. Recomended to buy. In-expensive for 500 GB. Easy to operate, just plug and use it. Has a software to create DVD or CD. If you buy, you will love it.",
        "this is the 2nd one that I own the first one 250gb died after one yr of use.I do like the size being so small,compact in size. Hopefully this one will last longer.",
        "I bought this external hard drive a couple months ago. As advertised, I plugged it in, and it picked right up and installed in Windows XP. The transfer rate was very FAST. The ONLY reason why I did not rate this a 5, was it is NOT USB powered. A power adapter was included. I still find this to be a good product. It's quite and fast. Well worth the money I spent.",
        "this product is an outstanding one, it held up all my movies, music, and pictures. it also backs my files up incase my laptop craches, in that case I have no fear cause I can just plug it to another computer and voulla, my files are still there",
        "I returned this the 2nd day I had it. it is properly named \"Simple\". It felt like a tin box and didn't work at all.",
        "This product does all that it is advertised to do. It does it quickly and is user friendly. The backup software included is user friendly and intuitive. The whole package is \"idiot proof\" and I am very pleased with my perchase!",
        "Economical, but a bit bigger than I expected. Will serve me right as a desktop device.",
        "I ordered the 320 gb drive and received a defective piece of hardware. I asked for a replacement and received a second one that did not work either ... I called the manufacturer ... no one answered their phones. I called twice and both times waited 20 minutes. Finally I e-mailed their Support group, after several e-mails back and forth they determined that the second unit was defective and I should return it. How can you store your (precious) data on a storage medium that is poorly manufactured. I can understand one defective device, but two is really a bad sign.",
        "Mine works like a charm. It was simple to install and I like the design. Some hard drives don't have an on and off switch. This one does. It's lightweight, travels well and looks good too. One you can count on right out of the box.",
        "exelent drive, no problems so far, i got it for use with dish network vip622",
        "I have 5 external hard drive with different brands.This is the last. I connect more than one on a laptop.Every time it beats the others.it is very speedy and silent.I love it.",
        "Easy setup. Larger (physical) than I thought it would be, so I set it up as an added external drive at home and bought a Maxtor 250 \"one touch\" for travel backups. Great price for 500 GB of external storage.",
        "This is a very good and fast USB 2.0 hard drive. I would recommend this drive to a friend.",
        "The title says it all. It's a lot of storage space for not a lot of money. The only negative is that you have to plug it in for power...you can't run it just off of the USB cable. Other than that it's been working great as my external back-up hard drive. And, it looks totally cool. But what else would you expect from a designer of Italian sports cars?",
        "Lots of space for a great price! Easy to set up - just plug and go!",
        "I have had the drive now for a few months and it has performed flawlessly. I would highly recommend this drive for its simplicity of use and reliability for the price.",
        "Buying this gave me goosebumps! 1T of storage...yippee!!! This is a great deal for external storage and compact. I use it to store all my MP3's and photo's. It is a excellent buy.",
        "Item came without power AC adapter, haven't been able to use. Wrote seller asking for adapter. Seller wrote back that I should have read fine print, that it did not have an adapter. Seller also suggested I go to electronics store and buy AC adapter for a few bucks. I have not been able to find an adapter to fit and they do not cost a few bucks but $20 to $70. Tried to contact SimpleTech, they do not answer E-mails or telephone. My suggestion is to do what I have always done and buy from a reputable dealer and to buy complete in original box with stated return policy and guarantee. My first purchase on Amazon.com and my last.",
        "I purchased this as a backup for my data hard drives. It is great, quiet and everything a backup drive should be.",
        "this is the more compatible drive you can use for sonicview satellite box, also as a backup drive for any DATA. very stable and look nice too.",
        "Very stylish, quiet and fast. However it doesn't have a Kensington lock slot, needed in most corporate environments. If physical security is not a concern for you, it is a good choice. The activity LED is tricky but I think it is a design inheritance.",
        "I bought this drive about one month ago. I do not use it hard, about 3 or 4 times a week to backup \"My Documents\" file. Plenty of storage space to keep several Generations. I usually keep three. (Son, Father, Grandfather) Hey! \"Stuff\" happens. You never know! I have Not had any problems.",
        "We love being able to keep important documents safe on this little unit! So glad we bought it!",
        "the information in the description is wrong, this is not a portable Hard drive, needs and external power, if you review the other model with same description not. I can't return the product because I order ot my mail box in USA. I am in UAE and I am really disapointyed with the product. Andres Sandoval 971 55 910 8469",
        "I am really sad because when arrived this drive and turned it on, simply didn't work, and I cann't return it because I'm not from USA and I have a POBOX to receive it. I don't recommend it.",
        "Mounting the hard drive is very brief. Two screws fix the hard drive, not very realistic to maintain equipment which in 5400 revolutions per minute. Too many game between the disc and support fixing. I do not think it's Pininfarina."
    ]
}