{
    "entity": "External Hard Drives",
    "text": [
        "This is a perfect product - very easy to use, simply insert the 2 USB cords and you're ready to go. Transfer between the External hard drive and computer is super fast and the product works with both Vista and W-XP. The Seagate is very light and slender for easy travel yet is also well made. Having owned the unit and used it extensively for over 1 month, there has not been any problems. Highly recommend.",
        "At first I was thrilled by the price and size since 120GB hard drives are difficult to come by but upon delivery, boy was I dissappointed. First off the product had several scrapes and dents which is something a hard drive, as sensative as it is, should not have. Then upon connection to several computers, Macs and one PS3 all consoles failed to detect it while making an annoying beeping noise. And lastly the connection itself, on the hard drive side, was very loose and had to be held manually just to get power into the hard drive.... very frustrating!!",
        "still have it after many years, works great for file storage, have all old files on it, too small for back up of newer PCs, but good for storage.",
        "This is a great little item. Size is small but what it can hold is great. I like that it doesn't leave anything behind on the computer. I'm storing photos, documents, and all my stuff for my masters. It's great.",
        "I ordered this product and it arrived very quickly. I've been using for about a month now and haven't had any problems. I use it mainly to transfer data from one computer to another. The only problem I had with it was one time it would not disconnect from my laptop, but it was a problem with Vista and not the unit itself. Overall, I'm very, very pleased with it.",
        "I had to reformat the drive to get rid of the pre-installed software (not a fan) but it's been working great since. The unit is smaller and lighter than i expected.",
        "The software may not work but that just means you can wipe it clean and use all that free space how ever you want, you will just have to do the file update manually.",
        "Nice compact drive. I had trouble getting the bundled backup software to recognize documents from all user profiles on the laptop. I downloaded a third party backup program and it works perfectly. Its great to finally have the peace of mind that our pictures and music are safe from a hard drive failure.",
        "My experience with this product is positive because it is easy to setup and use it. This product is very friendly to use.",
        "Totally Worthless. The Seagate FreeAgent GO 120 GB drive, that I bought, has been replaced twice, and the third one is unreliable too. It also uses two usb ports. If you unplug one of the usb cables the drive beeps. Windows reports write errors to the disk almost constantly. My MacBook cannot read the drive at all, unlike other external drives. Stay away from this drive, it is not worth the hassle.",
        "I used this device alot for the firt year i had it and its kinda sat secured in a bag for a few more years. I since used it and it failed all the way and I lost everything I had on it. I would never buy something from seagate If I had to.",
        "I've only been using this product for one day, but so far it's worked great. Copied about 60 GB of data in about 1.5 hours. The software that comes with it is for Windows, and it's formated for Windows. I'm using it with a Linux machine, so I haven't tried the software, and I needed to reformat it, but that was easy. I think the same goes if you want to use it with a Mac. Also, I don't know why this is, but it has 2 USB plugs, so make sure you have enough USB inputs. Style-wise, it's also cool. It's light and sleek, and has a nice glowing orange light.",
        "I've read other reviews for the other GB models for the Seagage FreeAgent Go about how flimsy it is, etc. Maybe the 120GB is constructed differently, because the 120GB sure ain't flmsy. I would not put an elephant on top of it, but I am not afraid to carry it in my laptop bag or grab it. As the instructions state, very easy to plug in and go. Very portable and lightweight. Highly recommended.",
        "Great products don't need reviews, but I made an exception this time. I could have gotten more drive space for my money, but not with the piece of mind that buying a Seagate gives you. Drive has run flawlessly. Plus Seagate has the best warranties in the industry, 5 years Although, I do not use the software, I just let windows/Linux detect the drive as normal.",
        "it works right out of the box. Software is installed in the product. Simply put, it is a real plug and play. I was impressed. It worked first time and every time. Only negative: I saw the price at Fry's a week later was $10 or $15 lower. If you need backup, buy Seagate.",
        "I have backed up my hard drive with this external drive twice now and find it easy to use. I've not had any problems and for data backup - not hard drive back up - it works great.",
        "I bought it to save all my music as I was running out of room on the internal hard drive. I have not used any of the software that came with it nor am I intending to. I just save music and it does it fast and flawlessly.",
        "Item received promptly. Instructions clear. Downloaded easily. Icons understandable. Whether material loaded is there will only be known if needed to access if computer fails!!!",
        "You have to buy their special software to put your programs on it. This is curiously left out of their statements on the package. Even with this software, it is a 50/50 chance the application will run correctly. Basically, it is an external hard drive cluttered with the remnants of a failed attempt at a portable desktop application. Very disappointing."
    ]
}