{
    "entity": "External Hard Drives",
    "text": [
        "Had an old one of these with data that I needed to get off the disk. Took this one apart and used the interface board on my old disk and was able to retrieve all the data that I needed. For that, it was perfect!",
        "I did quite a bit of research before choosing this drive. I read where people did not like the on/off switch. I have had no problems with it at all. Most drives don't have on/off switches. I use the eSATA connection and it is extreamly fast. I have used it to move 200+ GB of data from my computer as well as a complete back up from my 320GB drive without a problem. It looks great and is very reliable. I highly reccommend this drive....",
        "I needed it for spare parts. I bought 2 while serving in Iraq but both of the data connection ports failed. Thankfully this design is interchangeable. I've waited years and purchased many adaptors online only to be disappointed. Thank you for reconnecting me with my lost data.",
        "eSATA connector doesn't work with 2 out of 3 chipsets I've tried. Unit turns itself on and off while it's in use. Runs very hot while on. Base is very hot even when off unless you unplug it. I managed to get my data off of it and get warranty replacement but it is doing the same thing. Don't waste your money like I did.",
        "I've only had it for a month, but so far it works fine. I'm just using it as a backup drive in conjunction with Norton Save & Restore. Thus, I'm not pushing it to its limits or using it as an Internet accessible drive. I just plugged it in and it works. For what it's worth.",
        "I had to return this item because it was running hot and seemed to cause my system to have problems.",
        "While an older product, I have had great success with my first one of these and was glad I could find a second one. Perfect out of the box!",
        "I bought this drive as a way to have more storage space on my HR20. It only comes with a 300 GB drive, so replacing it with this 750 GB drive offers much more room. It seems to work great. The only thing I wish I could do is turn the orange line of light (you can see this in the picture) off to remove a light source distraction while I watch HDTV.",
        "Even though Seagate says the drive can be reformatted to Mac OS, it failed no matter what I tried. I talked to Seagate support and they said the drive failed and needs to be replaced. I have had the most success with Maxtor drives and that is what I will be replacing the FreeAgent Pro with!",
        "This is a great external HD. Easy to install, small footpring, attractive looks, excellent performance.",
        "product is very fast, works perfect with XP. I use seagate on all my systems.",
        "Great buy very quiet i use it for Time Machine on my mac wich i could turn off the light thogh.",
        "This is a very quiet and efficient product. Meets or exceeds every advertised statement. Had it installed and working within 7 minutes after unpacking. Not 1 bit of trouble. Highly recommended product. Dr. Douglas N. Cairns, Ph.D. Aerospace Engineer",
        "Absolutely the worst drive... ever. The \"on/off\" switch is just a touch sensitive area on the case. As it takes some time for it to actually power up, there's no indication if it recognized your finger pressing that area. Once it finally powers up... it may or may not be recognized by your computer. If it does get recognized, it usually takes a break after copying about 400mb of data... it might continue after it rests for a while... and it might power down. And - as another reviewer noted - it does get VERY hot. All in all, there is nothing good I can say about this drive.",
        "Simply one of the worst piece of electronics that I dealt with, comapring to my WD 500 GB drive. It works on and off, doing better with my Mac than my Windows PC. Take a look at this blog to see a multitude of issues. [...] The write speed is also worse than the WD 500 gb, not sure if it has to do with the extra size. Though it claims 750 gb, there is really 650 gb free space; ditto with WD. These specs games are a sham in this industry. This HDD runs very hot, vis-a-vis the WD. BTW, WD also has its issues with their other stuff, like the Live HD media box, but not their HDD.",
        "I have to wonder what Seagate is paying Amazon to keep the really bad reviews from making it here (this is my second attempt at a review). And for those who don't know the meaning of my title, the first two words are \"piece of\". This POS failed on me 4 months after I bought it. I thought Seagate was the leader in drive builders...NOT! Never again will I buy a Seagate product. This drive could spell the end for Seagate, because there's too many other good drives out there that WORKand don't cost as much!",
        "This drive is a quick and easy way to boost capacity of DirecTv's HR20-700 DVR, the DVR comes with around 30 hours of HD recording capacity, this drive appears to boost that to around 100 hours. One thing missing is the eSata cable, so if you purchase this, be aware that you need to purchase an eSata cable (not Sata cable)in order to connect to the DVR. Beyond that, you just turn off the DVR, plug in the Free Agent and power it up, wait a minute or two, then turn the DVR back on. Note: the new drive replaces the internal, it does not supplement, so you will have to start from scratch with all programming of shows.",
        "I bought this hard drive and notice that it was very temperamental. If I touched it while it was in use it would freeze the hard drive and my computer. After several weeks the hard drive died, I sent it back to Seagate. I figured it was just a bad drive. Although when I got my replacement it was dead on a arrival, so I had to call up Seagate for yet another replacement. My third hard drive worked, but showed the same problems as the first one. Customer service was extremely helpful and in the end I received a $50 credit towards a new hard drive.",
        "I got this drive specifically for the eSATA connection which is much faster than USB. I hooked it up to my Dell and...waited...and waited...and the computer wouldn't boot! Others have had this issue but I found the solution so I thought I'd share: For some reason, on my Dell Precision 390 (and maybe all Dells), the FreeAgent drive inserted itself in the boot sequence ahead of my main drive (which got disabled for some reason). Once I went into the BIOS and removed the FreeAgent drive from the boot sequence and enabled my main Windows drive again, it worked perfectly. Other than that initial \"hiccup\", the drive seems fantastic.",
        "The Seagate FreeAgent is the last external harddrive I would store my precious data on. I bought this drive and it was bad out of the box. I contacted Seagate support. We ran through formating, restoring the drive, trying on a different computer, etc. I can appreciate that something can be defective, but Seagate \"policy\" is to replace it with a refurbished drive. I have only had this drive for a week!!! If you bought a new car and had to take it back for service and the dealerships response was \"We will swap it out with used car\", you would be furious. Beware of their warranty policy!!!!",
        "I bought this drive over a year ago. It worked fine for awhile but then had multiple errors on it and became unusable and unrecognized on certain computers. I recently ordered an advanced replacement from Seagate, since it was still under warranty, but that drive immediately showed errors during my 1st transfer of files. I have read multiple stories like this online. I also had an internal Seagate Barracuda fail on my recently. My faith in Seagate is gone.",
        "I bought this unit since it was the only 750 available here on base in Iraq. I'm satisfied and the Amber glow gets your attention. The only thing I would like too see is a seperate light that shows data read/write access, Otherwise, its great!",
        "I have a Dish 622 HD DVR receiver, and was looking for a way to backup some of my recorded shows so that I could free up some space on my DVR's hard drive. I bought this external hard drive, hooked it up via the USB cable, let the DVR format it and reboot, and I was able to copy my recorded programs to the drive. I used the Seagate software to disable the sleep mode as some people suggested here. I never had any issue with it, though I admit I have only used it a couple of times so far.",
        "In response to Carol's posting, who wrote: \"You get only a short trial period, then the only utility that you can use is the diagnostic utility. \" Actually, the activation code for the software is included with the FreeAgent Pro, so it's the full software. It's in the startup manual that came with the drive.",
        "Exceptions prove the rule unless your cheating the rules........No product will be 1000% perfect, the issue is only, are the faults solveable? Most negatives were the result of a lemon which a free replacement would solve. I've had the hard drive for months and use it to backup a 5 year old computer,another old external hard drive 180 GB, 4,000 pictures @ 4.0 MB -5.5 MB , plus a new computer. It has worked perfectly without incident or effort. The less than perfect review scores scared me into reading the negatives and writting this review. Nothing is perfect including the complainers",
        "The FreeAgent Pro hard drives appear to have poor eSATA interface implementations. Seagate has released a firmware update with fixes some of the problems, but people still seem to have problems even after applying it. There is a link to the firmware update on the page where I blogged about this topic here: [...] Hope that's of help to some people.",
        "Yes, it works as an external HD for DirecTV's Hi-Def DVR. It will replace your internal drive. Simply unplug the DVR, start the hard drive up for a couple of minutes, then connect it via an eSata cable (not included), and fire up the DVR. This was an excellent purchase, well worth the extra storage.",
        "The first problem was turning this thing on, the second is turning it off- both require a lot of patience. The power button is awful, terrible, horrible. The unit seems to decide when and if it wants to function. We threw it in the garbage after less than two months.",
        "The USB interface works great. However, if I use the eSATA interface it will completely lock up my system. It locks it up so badly that I can't even Ctl+Alt+Delete. When I unplug it, it immediately fixes the system freeze up. In Googling this, it seems to be a rather wide spread problem. Unfortunately, Seagate just doesn't seem to care. They are consistently removing postings on their own forums when people complain about this issue.",
        "It's a very good product from Seagate, the software within is excellent and grant a lot of secure for your data",
        "For some reason, the Seagate drive is not seen on my computer. The light comes on and stays on regardless if the computer is on or off, but that's about it. When I plug in the power source, I hear it and feel it working, but after that, it just stops.",
        "Great drive, very reliable. Sleeps well with Mac OS X, USB 2.0 is still a bit slow for me as I am used to Firewire 800. A great drive for the money. I love the orange glow!!",
        "If you like \"Delayed Write Failure\" to crash the drive every time you try to open or use a large file then this outdated drive is for you. In simple words, every time the drive over heats every 15 min it crashes and loses your files.",
        "Combined with a ESATA cable, this 750 GB HDD effectively replaces the DirecTV HD DVR's internal HDD (250 GB) in terms of memory usage. Triples the original recording capacity on my DVR; can't beat that.",
        "HD crashed after 6 months of use. Same issues as others have reported. I only hope I can get the data back. Wish me luck...but in the mean time don't buy this HD!",
        "The hard drive performs very well on my mac. The only issue I have is the on/off button is not very comfortable.",
        "Bought new from Fry's. Set it up, connected it to 3 different computers and the piece of **** won't even turn on. Stay away from this product.",
        "This drive has an insane amount of storage space, however it also has a 2mb freeware program on it too, but that can be zipped to an easy 1.5!!!",
        "I've had the Seagate Pro 750 GB external drive for 4 months now and I'm satisfied. I do not use the software included though.",
        "so far, the product is great. But i guess i need more time to see what it is really capable of.",
        "This unit failed my company in the field when needed most for an important project. The chassis failed to pull power from the cheap Chinese-made 12v power supply, and when the chassis is dead, the unit does not work. Cheap ingredients in this chassis made for a failure experience for our limited budget. I do not and cannot recommend Seagate any longer due to a bad experience with this product.",
        "Dont beleive Amazon when they say this is in stock. I ordered 2 of them over a week ago and they said they would send today. Today get an Email that they dont have it and it will be six more weeks do I want to cancel. You Bet! Go Buy your stuff from somewhere other than Amazon. They wasted my time and Im sure they would like to waste yours. I actually needed the drives, not the lie that they had it in stock."
    ]
}