{
    "entity": "External Hard Drives",
    "text": [
        "I've used a 40G Smart disk with Firewire for several years and it works great. I needed a larger drive for my music collection and since I only have one FW port on my Mac G4 laptop I got this USB model. It just spins and chirps because it doesn't have enough power through the USB port. It would probably work great on any desktop or a more recent Mac laptop. The product is great and I recommend it otherwise. Also, their return policy is fast, easy and done online. UPS picked up the package the next day without question.",
        "I purchased this product in order have a backup for some major accouting information and personal records. The storage capacity is the same as my desktop computer and was just what I needed. It is quick, efficient easy to use. As far as Im concerned it is just the perfect tool for me and the price was right!",
        "I own a few Smartdisk HD's. I bought this drive expecting it to have a firwire port like all firewire HD's. It doesn't. Other than that it is a great HD with only a USB 2 port and a great deal that is hard to beat.",
        "I received this drive about a month ago, and have been pleased with the results. I got it to store photos and large documents, and it has worked great!",
        "Great for backing up pictures and music files. That's all I use it for. No issues on Windows XP with a Dell Inspiron 600m.",
        "Very easy to use. Item arrived on time and in great condition!",
        "bought my first one a year ago, ordering another now -- nuff said! portable, reliable, simple, fast.............",
        "I bought this external drive in late 2005 or early 2006, and have used it on two XP laptops, leaving it plugged in the majority of the time, and it still works fine. My oldest laptop occasionally won't recognize it, but I tend to think that's a problem with it being an old and worn out windows machine, and not the harddrive. From what I've read about other, cheaper external harddrives, I think I got a great deal and a winner. I transfer and delete everything from large .avi files to pictures, and it still works great.",
        "I've had my Firelite for over 3 years now. I got it back when I got my Macbook Pro on sale for $75 and it is an awesome purchase! It has dents and scrapes and bulges but still works like new. I need to upgrade a larger size external hard drive with firewire, but I'll be hanging onto this as an additional backup option. The speed was never a problem. I think the longest its taken was an hour to transfer around 50gb of files.",
        "i got two of these inexpensive drives. they are cheap!!! both of those work on and off on an ibm laptop. never worked on an imac (2007). bought those for a friend and my daughter so they back-up their data/photos/songs ... big mistake, both (both! what are the odds?) are terribly unreliable. what a waste of time and money. NEVER again.",
        "This drive is very fast and comes with free backup software that I use all the time. I am very happy with it. In fact, I'm so happy with it that I bought 2 more of the new 120GB version of this drive. It's small size and light weight make it ideal for consultants like me who travel from site to site.",
        "Bought mine for one thing and one thing only. Backup! I have about 70gig of video, music, pictures, etc. that I absolutely have to get backed up. Bought this drive today and copied about 6 gig so far in LESS than 60 mins on a USB 2.0 connection across a network! Small, light and requires no external power! A great buy!!",
        "I love it! Although my laptop's usb 1.1 port was not sufficient to power this hard drive, when used in conjunction with the provided ps/2 cable, it worked great. I do wish it came with a cover, though. Otherwise awesome and a good price!",
        "As others have written, the entire SmartDisk USB line doesn't work properly with Mac laptops. I got one and it works fine with my wife's PC laptops, but won't even boot on my PowerBook G4. SmartDisk's tech support told me that the silver PowerBook line can't push enough juice through the USB cable to power the unit. So basically I have a silver paperweight -- nice. Avoid this product line at all costs.",
        "Nice looking, easily detected, worked without any problem for a month so far, and fast. Two thing I wished it has; 1) A short USB cable together with the long one for easy mobility. 2) Indicator light is red or green instead of light blue which is very difficult to see, I like to see it blinking while I am using the drive.",
        "I researched hard drives and portable hard drives for two months. This is the only on that had no bad reviews. It died two days after I completed my Itunes transfer. Lost 22gb of Itunes. I was told by MFG that some electronic devices just quit. I did get a full refund from Amazon.",
        "Received Firelite portable as a gift and while it worked on my Mac G5 desktop it didn't work on either a Toshiba notebook or Apple Powerbook. This has to be more then a coincedence since a similar drive by CMS works perfectly on all three machines without the need for an adaptor. The support offered by the Smartdisk site did not resolve the problem.",
        "Beware those of you who try to use this device with a Mac Powerbook G4. It doesn't work. Mine didn't work , and SmartDisk customer support told me the device would not work with any Powerbook G4! Grrr",
        "mINE JAMED SO I SENT IT BACK AND RECEIVED A REFERBISHED ONE WHICH JAMS PERIODICALY. EACH TIME I LOSE ALL THE INFORMATION AND THEY CHARGE A RIDICULOUS AMOUNT OF MONEY TO RETREIVE IT"
    ]
}