{
    "entity": "External Hard Drives",
    "text": [
        "This drive is working great as a backup device on my 64 bit Windows server. It's so quiet I don't even know it's there other than seeing it and the blue light on the front. At first it wouldn't find the drive, but I broke out the instructions that came with it and you first have to plug it in via a USB port, then once recognized you can plug it in via the Firewire port. Like any other external drive I have used, there's nothing to install. Just plug it in and you have a new hard drive ready to use, though I did have to format mine before I could use it.",
        "This Western Digital My Book seemed to have the most memory for the money. After taking My Book out of the box, plugging into power, and plugging in the firewire cable, I began backing up my MacBook and transferring other backup files from an older Western Digital HD. I took a quick look at Western Digital's backup software but wasn't too impressed. I used my own system for backing up my files. I like the small size of My Book. It's also very quiet. I can recommend My Book as an easy to use and very reasonably priced Hard Drive.",
        "I'm really pleased with this external hdd, I got it from amazon at an excellent price, the shipping and delivery time was ok. I bought this external hdd looking for extra space, to backup my pictures, music and movies.So far my extra space needs are accomplished and I'm happy with this hdd. PROs: a. it have a stylish and modern look (it's terrific in my desk) b. plenty room, 500 gb it's enough space for my needs c. quiet hdd d. It comes with WD backup software. I haven't try it, cause I have another backup software, but if you don't have it, it's a good plus. CONs: It's pre formatted with FAT32, it's necessary to format it with NTFS",
        "Please don't tell Al Gore how much power this thing uses just to illuminate the fancy blue circles on the front of the drive. I've had no problems at all (aside from falling asleep with the bright blue glow filling my room). Of course, I immediately removed the pre-installed software and reformatted to NTFS. You might want to buy some sort of rubber isolation pad to put under the drive if you intend to place it on your desk or work table. It vibrates noticeably.",
        "I attached this little thing to my G5 Mac using FireWire and it came up immediately on my desktop. No need for any additional software or anything else. I got it in July and so far it has been working pretty well. It is very silent and though at times when I rendering video files directly to it, it does get a little too warm to touch. other than that i think this is a great investment and i am buying a couple more of these babies. P.S. They also look great on the shelf. I am getting the white ones just because. :)",
        "Worked well for a few years and then the disc got irrecoverably corrupted; causing me to lose my data/pictures/ and years of archieved docs. Now I bought another external hard drive (different company) though and create another external backup on DVDs.",
        "There are some really long write ups, so I will keep mine short and sweet. I bought this to back up my iTunes and iPhotos via firewire. Since my older Mac doesn't support USB 2.0 firewire was a must. If I backed up my music and photos via USB 1.0 it would take over 24 hours. I have owned this over a year. It has been reliable. It does heat up and makes some high speed spinning sounds at times, but nothing too unusual. You should be able to buy with confidence. So far, so good.",
        "This 500Gb external drive is great for the person that has never replaced a hard drive before. It's easy to hook up and can work with any computer with a 2.0 USB port or firewire connection. The one thing I have found is it upsets or makes the shutdown of Windows XP hang and sometimes not shutdown completely requiring a hard reboot to get it to shut down. I would say this happens 1 out of 25 shutdowns so I can live with having this problem and gaining the large 500Gb drive. If you have the know how to install an internal drive, I say do that. For ease of use, this is very much for the novice.",
        "After a year of use, My Book Premium failed to complete backups. It failed to be reformatted, it failed the diagnostics program which came with the drive. Western Digital support failed to give useful advice. I would never buy another WD product, and in fact just purchased a one TB drive from Seagate for $149 - the purchased of which was based on the extended warranty the company offers and ratings I found on line.",
        "This is the second of these drives I've bought. I picked up the first one six months ago, and it has worked flawlessly since then. No issues whatsoever. Runs quietly. The LED on the front is handy to let you know when the drive is being accessed. Double interface and simple exterior design. Used for artwork and lossless music files, in combination with a music server. Recommended.",
        "Simple and reliable harddrive. Can be used w/firewire, which is great with mac users. Comes with programs for both win os and mac osx for easy push button back-up on files that you choose through the backup wizard. A little bulky and uses a separate power source, so it's not easy for mobility.",
        "I purchased the WD 500 GB drive 2 months ago to use primarily for photo and video storage to free up space from my PC. Was easily able to reformat the disk to handle NTFS file system. But, that wiped out the pre-installed software. So, had to download that from the WD website, which wasn't that big of a nuisance. Experienced no problems loading all of my photos, etc on the device. Have had no problems and really like the design. Would certainly buy again.",
        "Great drive that is very quite. I originally purchased this hard drive to hook up to Apple Airport Extreme for Time Machine, however now that they came out with Time Capsule I would have purchased that instead. Live and learn, but this is a great external hard drive. No complaints thus far. (2+ months)",
        "I bought this product to use with Leopards built in backup software Time Machine. So far it has worked as expected. I did not use the supplied software that it came with so I can't speak to that but if you want a good backup drive for a great price I would definitely recommend it. It has been very easy to use... just plug in the supplied Firewire cable and Time Machine does the rest.",
        "I had this drive about 8 months before it randomly crashed. All of a sudden one day, it wouldn't boot up and would make a click noise. Now I have tons of files and picture stuck on it that I can't get off. Even when I first got it, it seemed to have booting up issues, would sometimes not connect with the computer, and sometimes wouldn't sleep as it was supposed to. The button on the front of the device did absolutely nothing. I've used plenty of other drives for my business, and this is by far the most unreliable one I've ever used.",
        "Bought the drive in 2008 as primary backup for music and data files prior to moving to new computer. Worked great out of the box initially, however 6 months later it started to behave erratically. Could not power down with button in front, could not un-mount from Windows. Finally determined that the drive overheats very quickly and becomes erratic with extended use. Works fine if you take the cover off and put a cooling blanket (ice pack in plastic bag) on top of actual drive. Just make sure there are no holes! Won't buy WD external again.",
        "What's not to like? On 3 different systems, two with XP Pro and one with XP home, it plug-and-played like a dream. The backup software included with the drive is fast and uncomplicated to use, with a minimum of user intervention required. The drive is compact, quiet, and it even color-coordinates with my matte-black ( vendor name dell-eted ) desktop.",
        "I highly recommend any WD external that has firewire capability. I have even backed up my wife's laptop over the LAN network to this drive. I also like the ease of the backup program that can be downloaded for it.",
        "this product is a Great addition to anyones computer! you may not realize just how important it is to have a back up of your music, photos and other files until your unit crashes. this unit can save you a lot grief if you use it to keep your stuff backed up. think of it as insurance. it is also easy to take with you and share files with family or friends.",
        "I was very disappointed with this hard drive when I received it. It has a huge amount of storage space but the seek time is very slow. I have an off-brand hard drive which has a much faster seek time but not as reliable. Overall the WD hard drive is reliable, but there are definitely better choices out there.",
        "It's an excellent hard drive. I have four of these and continue to buy more as needed. I don't like the triple interface and returned that one, but the dual interface seem to work great. They seem fast and reliable. Occasionally they're slow to register on my computer when i reboot, but it's a small inconvenicne.",
        "Pros WD Dependability, price Cons In todays environment I feel it should come preformatted to NTFS instead of FAT32. When you reformat you must goto WD site and re-d/l the data pack of tools which I am not a fan of anyway.",
        "Attractive \"book\" like hard drive fits nicely amongst other parts of the desk or office. Simple to set up and manage files. Handles both PC and Mac interchangeably LED circle in the front tells you that the hard drive is spinning Though not terribly loud, the lack of a cooling fan won't rattle your desk ****Update***** After a year working it just died with the click of death. No way to recovery, all of my files were lost",
        "Even in light use (no video, etc.) in a safe, well-ventilated installation spot, this drive failed in very short order. AVOID. Spend more - buy better drives.",
        "Item shipped fast and arrived in perfect conditions, it has been suitable to my needs and I have nothing negative in response.",
        "Totaly exeeded my expectations. At first I thought it would be just like moving files from one drive to another, but with the backup software included and with the FireWire interface things became a lot easier. Yet it looks great on the top of my desk and is very well built and quiet. I love it...",
        "I use this drive as a backup on my Mac. Periodically I take it out of the closet and attach it to my Mac through the Firewire port. I copy everything from my Mac hard drive to the WD 500, then I turn it off and put it away. BTW, I reformatted it for the Macintosh to improve speed and reliability. No Problems. No Muss. No Fuss. Works exactly as expected.",
        "This thing is great but I just wish it came with some back up software. I ended up using Ghost which works fine, but for the price it works great.",
        "and it does what an external drive is supposed to do. I've had it about a month, and it works great for my weekly backups. It's nice to have both USB and Firewire functionality. I haven't bothered with setting up the drive to do automatic backups; I prefer to do my thing manually, but I suppose that's a nice feature if you aren't into keeping tabs on your data. It's a great price for the space, what more can you say?",
        "Be VERY aware that this comes formatted was FAT32; if you're planning on storing files larges than 4G you'll need to reformat to NTFS. Other than that little annoyance, the product is great.",
        "Excellent results. Easy install, good performance, massive capacity. I suggest you put a cloth under it if you have it on a wood table -- the table amplifies the sound of the drive motor. With a cloth under it, the drive is very quiet.",
        "This was the most bang for the buck model available with Firewire. It works great. No problems. I would recommend this drive.",
        "Man this baby is smooth...I will never buy another type of external harddrive....quiet...nice size....artsy...I can move it from my Mac to PC and I didn't have to install software....this product is very sweet...",
        "Completely unreliable & unstable. Bought this to use as a backup drive to save family photos, videos, etc. Drive decides when and if it wants to turn on, when/if it gets recognized by my comp, etc. Have tried this thing with multiple PCs with the same poor results. Remarkably undependable product.",
        "I had this 500GB MyBook up and running about 60 seconds out of the box. Took me longer to push the plug into my UPS than the computer took to mount it as a drive! For compatibility reasons the drives all come formatted in FAT32. To use for video editing, which is why I bought it, I had to re-format it to NTSF. the reformat that took only a minute or two and I was off and running. Great drive, brainlessly simple to install and use. Sorry I can't comment on the backup software but I only use this for Video and photo and I have an NAS for all backup.",
        "Great deal, used carbon copy 3.1 to back up 7 macs and 1 pc. Backed up and restored with no problems.",
        "I really like this external hard drive. It looks like a book on my shelve! Its small with dual interface and its fast. It makes a little noise while in use, and the blue leds in the front at night are very brigth and might be anoying. It works with a mac and pc. And it has automatic sleep when not in use. I do recomend this product for an external hard drive.",
        "We have used this product for several years. Have only had a problem with the USB cable connection getting loose. Drive itself is fine. Others I have bought recently have falen in price by 1/2!",
        "So far so good. It is quite and fast. I'm using it with a Mac Book Pro. Not so sure I like the built in software as much as Apple`s backup software. Good value for the money. Looks good - not obtrusive.",
        "500 GB of storage that's fast and easy to use. And for almost 50 cents per Gigabyte? What's not to like about that? I like the fact that it givves you BOTH a firewire and USB cable too!",
        "I have been using this product for about a month now, and until I received an email requesting feedback from Amazon I completely forgot that I was using it. It operates perfectly quite, and the access speeds are great.",
        "I like the My Book, but I am having problems with it shutting down automatically when turning off my computer. Other than that I like the product.",
        "I have two of these. Both installed in my Gateway XP Pro system without any problems. I don't use them heavily, but, so far so good ...",
        "The hard drive was a simple installation, plug and play, except on my desktop computer. Customer service has been working on the problem, however, to date it is serving another computer. If it is eventually installed on my computer the rating would be 5 stars. Otherwise....1 star!",
        "UNSTABLE AT BEST AT THE BEGINNING, NEVER WORKED WELL, DIED AFTER 2 MONTHS, DATA UNRECOVERABLE BY BEST TECHNICIANS, LOST ALL.",
        "I've been using WD 300 GB drive for a couple of months now, and hope this one will do as fine. so far I have nothing to complain about. I noticed that a bunch of problems described below came from unawareness of the product's of one's PC features and abilities. Never had any, so I highly recommend this product.",
        "this is a great device. Lotsa storage for the price and very easy to setup and use. Buy it!",
        "Overall this is a great hard drive. The dual interface is a nice feature. Sometimes, however, the drive refuses to turn off via it's built in button on the front.",
        "I now have two of these(1 250g & 1 500g) and they are great!! if you want to add space to your computer without hassle, get one of these!!! **update** 5 years later and these drives are still going strong!!",
        "Yes, is a Good Option, but I think is very slow tranfer rate. Maybe in the feature, this device be most faster.. Transfer some data to this ebook is very slow. I never tested another one, but the smaller External Hard Disk are very faster..",
        "I love this hard drive. I use it everyday like my regular hard drive and the double ring of light look awesome. If you are thinking of getting a external hard drive get this one cause it has both firewire and usb2. I also use it to back up everything I have so incase the computer ever needs formating, I have everything backed up.",
        "This is an excelent product, very fast, a lot of comunications options. Very quiet, low temperature, but the software!, it realy does not work, because you can only compile the backups, and the format compiled you can not recover it with out the software. Is better to use Genie Backyup manager, because you have a lot of option for the backup and you can access and recover all files with any maching having or not the backp software. Than's for that i gave it only 4 starts. good lcuk",
        "Perhaps it's just me, but this product is not exactly what I thougth it would be... I thought I could move programs and such on to it while I clean up my computers hard drive etc. Oh by the way I have a Mac so maybe this only happens on Mac's...any how I go to move things and this drive suddenly tells me... you can't move this as file name is to long or file name can't be used. OK??? As for the unit it's self it's sort of loud and slow at wake up when it goes to sleep. Perhaps I just expcet too much?",
        "It crashed the first time while loading some data and never worked again. I had to send back. It has been a few weeks and I have not received a working one yet.",
        "i advice you to buy this product if you need a huge storage. Thanks"
    ]
}