{
    "entity": "Pizza Pans & Stones",
    "text": [
        "Do you always long for those crispy dosas... Well here is what you must get for those restaurant quality dosas. The heavy gauge retains and distributes heat well to give that perfect consistency in a dosa. I tried many skillets, but none of them come close to this. I must admit it was lot of work to seasoning this skillet. But was all worth it.",
        "Not good for conduction or flat glass stove or cook tops - the bottom is not perfectly flat and so the pan will rock back and forth on a small contact point which results in a very uneven heat distribution. Plus, the manufacturer doesn't accept returns. You'll need to go direct through Amazon.",
        "I bought it for a father’s day gift. Turns out my husband wanted a traditional cast iron pan, not this flat style. Surprised it’s not eligible for return even though it’s on amazon prime. I thought a 30 day return window was part of the prime policy. Apparently there are exceptions. I’m disappointed this information was not noted anywhere on the product page or during the order process.",
        "What a piece of junk (made in America). After 4 times of use on the medium high heat on the stove (run-of the mill glass cook top, nothing industrial), the 5th one required high heat to sizzle some fajita trimmings. This is when the pan warped into a major convex shape. No-- it was not dropped or exposed to extreme temperatures. Yes, it is possible just a defected item, and when I have a better experience, I will update my rating. For now it is a solid 1 star.",
        "Terrible. It curved up as soon as heated. Now apparently u can't even return it. It's an outrage. Horrible item. Waste of money.",
        "I grew up with Lodge cast iron pans, and I own 3 of my own. I thought to get this one for pizzas, but as soon as I opened the box I noticed this chip. I never had a problem with Lodge cast iron pans before. This makes me wonder if this one is a knock off.",
        "I bought this pan reading all the great reviews, however I received a defective product and only after 2 weeks they will not allow me to return it. We oil prepped the pan exactly according to directions and the pan our dough still was stuck to pan and heat will not distribute evenly throughout the pan. Waste of money and terrible service for not allowing returns within 30 day period",
        "Looks well made but too large for my need. As an Amazon Choice item, I did not even consider that I might not be able to return it since it isn't in one of the usual categories of non-returnable items. The \"This item is not returnable\" verbiage is very small in the listing. I looked at multiple reviews before ordering and did not see any that mentioned you can not return it.",
        "I must have a lemon. I've tried four different types of dough recepies. I've tried six different types of preparation. All of them end up terrible. Pale, underbaked crust that is full of oily crust or pale, underbaked crust that stucks to the stone. I'm literally done wasting precious yeast and flour on this thing. I've NEVER had issues using your run-of-the-mill aluminum pizza pan.",
        "Whats not to love about ANYTHING cast iron. Absolutely love this product. I alternate between this and my stainless pizza pan for heating up chicken nuggets, cooking biscuits, baking cookies, you name it. I just wipe with wet paper towel after while it's still warm and then give it a quick swipe with oiled rag and toss back in the oven for storage. This sucker is HEAVY and worth it's weight in gold. I would totally recommend. Also love the handles built in, no fumbling to get your thumb up under the pan in the oven. (but don't forget those handles get hot too! I did the first time and WOW, hot, lol).",
        "Well worth the cost alone! This 14\" cast iron pizza pan has been great to my family. First bought by my mom and now used by my own family, this has been a kitchen essential. Besides pizza, my wife's favorite use is for biscuits. (Southern!) This pan heats well and cooks evenly. The handles are a great feature but don't forget to wear protection. Once I put the hot pan down, I'll leave the mitts laying on top of the handles. Just in case someone goes by and doesn't realize it's warm. Another great product by Pro-Logic!",
        "You can make restaurant style dosais. The first few dosais will require extra oil. Before first use wash it with warm water - no soap. let it dry. Heat it on a stove and add oil upto 4-5 tsp to evenly spread out. You may start making dosas at this time but be prepared to toss the first 2-3 dosas as those will stick to the stone (kindify in tanglish!) again add enough oil and spread on the surface evenly. Now start making dosais again. For the first few dosais add extra oil than normal. After that you will get Saravana Bhavan style crisp dosais, providing batter is made properly.",
        "I've had this cast iron pan for 5 years now. It's one of my most important discoveries in my life-long quest for a homemade pizza that's on par with pizzeria pizza. I think steel and a hot oven is crucial and this is as close as you'll get in your kitchen. I almost always use a pizza peel (throw corn meal under the pizza for \"slidability\") but you can make your pizza in a pan and just set it on the cast iron pan. It's all about heat transfer, a big dump of it, right into the dough.Try it. Plus, you'll have it for the rest of your life. An heirloom!",
        "I ordered this product looking at the positive reviews. But deeply disappointed. It gets rust stains very easily. Heat distribution is not even. And takes a long time to heat up.",
        "I have never been disappointed by any of my Lodge Cast Iron pieces! Made in the USA and great quality! I purchased this Pizza Pan to make my artisan bread and boy is it great! Lovely crusty outside and moist airy inside! The cast iron, unlike baking stones which tend to crack or break, can be used in the high heat with a pan of water on the shelf under it without breaking and conducts heat beautifully. It always cooks evenly and so delicious!",
        "My wife loves cast iron pans and we have a very large collection of them, all of them from Lodge. Great value for a great product every time. My wife regularly makes her own pizza (dough and sauce that is) and she swears by these pans. We used to have cooking stones but eventually they cracked. Not likely to happen with a Lodge cast iron pan! By the way, occasionally we will buy Di Giorno frozen pizzas (when you need a cheap meal in a hurry) and these cast iron pans also work wonders cooking frozen pizzas on, to get a nice evenly cooked pizza with a crisp / crusty bottom. Wholeheartedly recommend this product.",
        "I got this pan to do pizza on my grill. I have used it twice. The first time I heated the pan to over 600 degrees thinking to do a quick pizza at that temperature; didn’t turn out...burnt crust. Next pizza Was at a lower temperature at longer time...this worked out better. I’m still experimenting. I have also done cookies that worked well using parchment paper. Like I mentioned was done on a Weber grill. Lodge cast iron products are the best.",
        "I've recently started in sourdough (due to great yeast shortage of 2020) and it's been quite the learning adventure. I have seen a lot of potential in my pizza crust attempts because the flavor has always been phenomenal but far too dense. Changing nothing else but the pan and I have finally done it. I finally achieved the fluffy, bubbly sourdough crust of my dreams. And the center is no longer floppy?!? This pan has taken my relationship with pizza to the next level and I didn't know that was possible.",
        "I bought this as a gift for my brother-in-law who is hard to buy for because he is able to buy whatever he wants or needs. He loves Papa Murphy's cook-at-home pizza so I thought about getting him a pizza stone but so many reviews talk about them breaking (eventually). Then I saw this!!! I am a huge fan of cast iron and just knew that this would be the PERFECT GIFT for him. LOVES it!! I also bought him a pizza cutter like the restaurants use and it was the perfect combo.",
        "Im not sure if its a life changer but it makes frozen pizza and homemade pizza seem a bit fancier with this. The challenge is pre-heating it, and then trying to transfer the unbaked pizza onto the iron pizza pan when its like 400 degrees, especially because theres a little lip on the pan, which makes it harder to slide on to. When Im not using it, it sits in the very bottom of my oven so I dont touch it otherwsie, and its not a hassle when Im cooking other things in the ovenn.",
        "I’m not getting the awesome taste I expect from using cast iron and this thing is a pain to lift, clean and carry. If this thing falls on your foot, you’re going to be in a world of pain. I honestly tried using this thing on multiple occasions. I wanted to believe cast iron was worth it but I haven’t good luck with them. We went back to silver pans you find in pizzarierias to cook our pizzas.",
        "I have been using the pan to grill outside fish ( seabass, salmon,trout) , burger patties ( meat or veggie) and pizza. I get great results. Pan is easy to clean.",
        "Whenever I make pizza, I use this pan and all my lodge cast iron bread pans (equivalent of mini pizzas so the kids can make their own). Tonight I made an extra one so we'd have more leftovers in a 9x13 stainless steel pan. I can't believe the difference in the crust between the 2 pans. Even though the Lodge pan is bigger, it was more evenly cooked.. This pan just does something different to the crust - gives it something extra. So much so that I'm ordering a 2nd one. We live out of the country and it's so good, I'm giving it a valuable 10 lbs. out of my suitcase. You won't regret buying this pan.",
        "What a fantastic cast iron piece! After reading other reviews, I definitely wanted to go with this one as I have begun baking bread at home to save a little money and to feed it to 2 growing kids. The weight as you can imagine is very good/heavy and I found no manufacturing defects at all in the way the product is made. I tried making some homemade wheat bread that was multi grain and the bread cooked evenly and was fantastic. I love that this comes already pre-treated and was ready to use out of the box! Overall, a fantastic buy and a wonderful price. I can't wait to try it on pizza next!",
        "I've used lodge cast iron skillets for years and absolutely love them. When I was looking for a good pizza stone I found that lodge makes a pizza pan! I immediately ordered one. I preheat the pan in the oven at 400 while I make the dough and toppings. Once I roll out the crust I precook the crust for about 10 min. Pull it out, dress the pizza and cook for about 12 min more. Then I broil the top to get the cheese nice and bubbly brown. Perfect pizza!",
        "Over the years we only used the stoneware type pizza stones. We've gone through 2 in the past few years. Both broke because they are brittle. I finally decided to get a new pizza stone and try again but with cast iron. I wish I would have bought this cast iron pizza stone sooner! We preheat it in the oven then put the food on it to cook. It really helps to make crisp pizza crust. I made homemade croutons and they came out great also. I let it cool down completely then I just wipe it off. I like that it came preseasoned. Last time I tried to season cast iron I almost killed myself with smoke inhalation.",
        "First cast iron pan I bought. Debated for several months whether it will work or not. Finally bought it and I regret not owning it all these days. The reviews on Amazon helped a lot with the decision making. The key is to properly season the pan before and after use. Every time I use the pan first I put it on medium to low flame, spray oil, clean it with bounty and then use it. When done clean it with wet (oil or water) bounty and store it. Never clean it with soap and water. The handles can get VERY how so be careful while handling.",
        "I'm obsessed with cast iron anything 😄 I was looking to get a nice pizza stone, but most of the reviews for them say that they have smell like chemicals when heating up, which is definitely not what I want. For cast iron pan very little percentage of reviewers say that it brakes, but I definitely prefer to have a broken pan (hopefully that won't happen), than pizza with chemicals in it. I made pizza in it 2 times already and it turns out so good. Even though I used parchment paper on it (didnt want to risk sticking, since it's not non stick yet), and the crust came out so good.",
        "Wow. We bought this to replace a two week old pizza stone that cracked in multiple directions. I figured cast iron, no more cracks right? Right. Then I saw the hundred other ways to use this. We have three different sized pans from Lodge and they are great, but this can be used for everything we do in pans, in the oven, on the burner tops, outdoors you name it. Cleans like a dream, hot water and a nylon brush (no soap!). Then just heat it on a flame for two minutes and coat lightly with vegetable shortening. By the way, it DOES function as a fantastic pizza stone too! Perfect crusts, zero sticking.",
        "I use this pan to make homemade Pizza's, perfect everytime. Brown's the bottom of the pizza crust just like the pizzeria. Preheat the pan first before baking the pizza and \"wallah\" perfect brown crust everytime. I love it and can't say enough. Can be used for many other things like pancakes & tortillas on top of the stove, you can grill seafood & veggies on the grill just to name a few. If your a fan of Pizza's and or cast iron pans, this is a keeper. Worth every penny..❤",
        "We needed a new pizza stone because ours cracked right up the middle. We have always used cast iron skillets but using one for pizza was a risk because we used the stone for so many years. We decided to go ahead and get it- and it is AMAZING! It gets hotter than a stone, has even heat distribution and definitely wont crack after years of use. Even better, we can take it camping and use it for pizza and other things. It is absolutely great (and made in USA!!)- highly, highly recommend!",
        "I managed to mess up my last pizza stone, so I opted to get this cast iron one instead. I've been using cast iron for years, so we know how to maintain it. Used it twice so far. The first time I made pizza with ready made crust and today I tried frozen pizza on it. I didn't preheat it as long as I usually do with the frozen one because I wasn't sure how the pan would react but, just like some reviews said, it cooked them just fine. Dunno if it makes a difference that it was thin crust pizza.",
        "Most Lodge products are top of the line. I guess this one is too. The pan is big and heavy and I bought it for things other than pizza and when it gets really hot it is difficult to handle. It burned two pot holders. I tried hash brown potatoes and they were a failure. I guess it's pizza or nothing.",
        "My wife and I used this to make a pizza on the grill and it was absolutely perfect. My advice is to heat the baking sheet/pizza pan on the grill or in the oven. Of course, be careful cause it's hot. We rolled out the dough and it started cooking while we were building the pizza. Get it out on the grill (or in the oven) and let the dough finish cooking and the cheese melting, and oh perfection has been achieved. Yes, the crust is crisp and no floppy pizza. I hate floppy pizza.",
        "Tired of purchasing many low end pizza pans over the years, we splurged on the Lodge cast iron pizza pan. The item came quickly via Amazon Prime shipping and we couldn't be more pleased. Upon removing the pan from the box, I coated the pan with vegetable oil and left it in the oven to heat for a couple of hours. We have have used it many times over the past few months (more than I care to admit!) and it works like a charm. It is a bit more expensive than most pizza pans but I have I doubt this pan will last a lifetime. Well worth the price for the quality. Would recommend!",
        "This is my go to oven baking tool. I leave it in the oven and use it many days per week to make hot baked sandwiches. When baking pizza, I preheat the oven and the Lodge pizza pan at 425°s. Then i roll out the pizza and place it on a piece of parchment that I cut to fit the pan. Once the pizza is fully decorated with sauce, cheese and toppings, I transfer the parchment to the hot pan and bake for 20 minutes at 400°s for a perfectly browned pizza. Just prepare a small plate with olive oil and spices for dipping the crust and enjoy the fruits of your labor.",
        "The thickness seems to be consistent throughout the pan. I heated this up to 550o on my Weber, pulled the Tri-Tip off the smoker & reverse seared it on this pan with butter, 3 minutes on both sides. It heated evenly and the Tri-Tip was wonderful. My friend convinced me to get the Pizza Pan over the skillet because there was more area to work with if I wanted to do burgers or even pizza on the grill. Plus Lodge products are made in the USA. It comes pre-seasoned, but I still heated it up pretty good with some fresh oil before I put food on it. I then re-seasoned it after use.",
        "If you like crispy pizza you need to get this. I got this to make personal pizzas for myself and it seems to work better than my pizza stone. I cut a store bought pizza dough in half and stretched a decent size white pizza. I coated the iron with some vegetable oil and heated it up on the stove before I placed it in the oven @ 500 degrees. It was so crispy I literally picked the whole thing up with two fingers. Must have!",
        "I love this pizza pan. I’m a Lodge lover and cook with cast iron pretty much every night. I usually make pizza in a cast iron 12” skillet. But got tired of wrestling with tall sides. I’ve used this for pizza and baking rolls so far. Terrific results and large cooking service. I suggest that you precook the dough for 5 mins and then add the toppings. It helps with not getting to soggy of a crust. Cost and taste makes it superior to delivery pizza!",
        "My pan arrived with a broken handle (how on earth can that happen to cast iron? There must've been a flaw.) Regardless, I've tried to contact Lodge for support multiple times with no support. Disappointing, to say the least since it is not returnable. Caveat emptor.",
        "I am so happy that I finally get my 14\" Lodge Pizza pan. It is in near perfect condition. It is beautiful as the picture, smooth surface and evenly pre-season. I can tolerate few holes on the pan and few rough spots on one of the handle. I think I completed my collection of Lodge cast iron pans and dutch oven. Don't let the negative reviews delay your purchases. Lodge is Lodge, American made!!!!!!!!! It last forever!!!!",
        "It's a Lodge cast iron product, so you know it will be a high quality item. I use mine as comal (or tortilla griddle) and it fits over two burners on the stove and can fit 4 to 6 tortillas depending on the size of the tortilla and if you care if they overlap. When receiving it, I hand washed it then immediately put it on a low flame on the stove to completely dry it. I haven't had the need to season it while using it as a comal. I highly recommend any Lodge cast iron product, this is my second item from them.",
        "Decided to go cast iron for a pizza pan instead of a traditional stone based on a friend's recommendation. This pan is incredible; first night making pizza and it went out of the park. Throw it in the oven when you first turn it on (or the grill) and when you take it out of the oven (or open the grill top) just build the pizza right on it. Pizza slid off very easily, the handles were an important feature (not found on all traditional pizza stones). Not only that, but the crust was perfectly chewy and crispy. If you're looking for a pizza pan/stone this is the one you have to buy.",
        "I love this pan. It's everything I had expected it to be and more. It's easy to take care of and if you do take care of it, I can see where it could potentially last forever. There's nothing like cast iron. The last pizza I made using it tasted better than any pizza I've ever had in my life. (I know that probably had just as much to do with my recipe as it did with the pan, but I can't emphasize how important even cooking can be, especially with a pizza diameter of 14 inches. My compliments to Lodge.",
        "THIS LODGE 14” pizza pan is great size for the pizzas and the bread baking . It can be used on the stove, in the 30” oven as well. I have been baking pizzas, breads for many years on the sheet pan and it was really good. But cast iron pizza pan will be much better; I also bought the 5 quart Lodge Dutch oven for bread making because some recipes are even better when baked in deep cast iron Dutch oven because it provides extra oven rise. I highly recommend that you get both of them if you are frequently baking pizzas and breads. I",
        "It's solid and good build quality. I only point out a few downsides because of my application. I have an electric heat range and it's only 12\" diameter which cannot heat the whole pan, then I find out the edges are not at the same temperature. The pan also doesn't sit flat on the electrical range top, so better use a gas one. I can still handle it, but would prefer to a smaller size considering my electrical range top.",
        "very heavy duty. I use a lot of cast iron and lodge is without a doubt the best out there. I'm quite sure that all my cast cook wear will be given to my children after i'm gone and the can pass it on to there children some day. As long as it's cared for properly it doesn't were out. Following the instructions for use and clean up are necessary to get the cast to work properly and continue to always be your favorette pots and pans.",
        "I use mine for pizza, for baking cookies in the oven and for pot pies. For on top of the stove I use it for making tortillas and cooking bacon, pork chops, hamburgers, and any other meats... for making pancakes and French toast. It's a tad heavy but hey.... it's cast iron. The handles make it very easy to lift and move... use pot holders because they are hot when in use.",
        "This is the perfect solution to baking great home-made pizza in my convection oven; be sure to preheat the pan in the oven while assembling the raw pizza on parchment paper. Slide your masterpiece, parchment and all, onto the hot pan and set your timer for a delicious experience. It browned and crisped the crust beautifully. I just got it a few days ago but look forward to using it with tortillas and all sorts of other things. I love that it's unbreakable and versatile enough to also use on a stovetop, BBQ grill or campfire; well worth the cost difference above a pizza stone.",
        "I have other lodge pans but this has turned into my go to pan. For some reason It's easier to maintain clean than the others. It also fits more food. I can fit 2 porter house steaks + veggies! The size is perfect for my oklahoma joe smoker and weber 22' kettle. Gives of more heat than my pizza stone as well so i don't use as much fuel. Love it. Cast iron is heavy though.",
        "Absolutely horrible product! It got rust stains on it and we've only had it for a week. We are infuriated. We cleaned it exactly as the manufacturer instructed and it still rusted. And worst of all, we chose this product after doing a ton of research and looking at the reviews We want our money back! Do NOT buy this!",
        "This cast iron pizza pan is just amazing. I love everything about it. It makes pizza with a perfect crisp crust. This is versatile too. It can be used as a grill for pancakes, grilled cheese sandwiches et. Just put it on a grill that has been heated to 450-500. Get your pizza ready on the pan and put it on the grill for 10-12 minutes. Perfection!!",
        "I don't know why I waited so long to make this purchase. This is one of the best kitchen purchases I have made in a long time. You can use it on the stove top or in the oven, makes excellent size pizzas, great for roasting and cooking tortillas. Super easy to clean and cuts down on using foil or parchment, that my other sheet pans needed. Its a little on the heavy size but absolutely worth it. I really like there are handles on both sides too.",
        "This pan can take the heat and has so many uses. I've used it on top of my gas stove for grilled cheese sandwiches. It gets hot very quickly so you need to be right there watching or the food will burn. I have made pizza on it at 500* (don't need a pizza stone with this). Nothing sticks as long as you follow the directions that comes with it. if you love cooking with cast iron then this is a must have pan. It is very BIG.",
        "Absolutely love the pan. It give my dough a perfect crust.. but I mainly bought this so I can use it to make Roti/Paratha its hugh and love the coverage and the heat that it holds to make my Roti/Paratha My dislike its so darn heavy but I can appreciate the durability because its perfect cast iron pan I have owned.",
        "My Pan was delivered with one of the handles totally broken off. Then I found out the pan is not eligible for a return. Ridiculous.",
        "Second bullet-point in the product description claims this pan is pre-seasoned. However, basing my experience with the pan's heat distribution in the initial few times, ended up ruining my batter and appetite for a meal. I've seen this work like a charm at my sister's so my only hunch is, that the product is not seasoned enough to be of any use straight out of the box. For that deceit in marketing, this product deserves a 3 stars albeit its future usability.",
        "I needed a good pan for making crispy dosas. This is the best I got . First few attempts did not go well. You need to oil the pan generously in the beginning and in a few tries, the dosas started coming out perfect You can use any utensil on it since the surface wont get scratched. Great buy .. it will last me many many years like my other cast iron pans",
        "I agonized over Cast iron or pizza stone. The cast iron won because it's so versatile you can use it on or in your oven it can be used with induction and on a camp fire. Pizza results were fanastic. Remember to first heat the cast iron I put it on the lowest rack in the oven and put oven on 400 then after it's hot slide your dough on it ( I build my pizza on the hot iron then put it back in the oven). No wimpy crust here. I have little storage in my kitchen so the versatility sold me is it better than a stone??? Maybe, maybe not. But still a great buy.",
        "I use this as a pizza stone. I like it for that purpose because it is large in diameter and it has handles which makes it easy to Remove from the oven. I preheat this on the stove top rather than preheating it in the oven for an hour. The problem with this approach is that being cast iron, the distribution of the heat is not great (compared to a multi clad pan) unless than pan is smoking hot which is hot than I want for pizza. That’s not the pan’s fault but rather an issue for the way I want to use the pan.",
        "So far so good. I use many different Lodge Cast iron products for indoor cooking and outdoor cooking. This one has been a great addition that could be used for either. The edge lip really helps with Pizza crust formation and shape retention. The handles are nice for easy lifting (this is heavy just like all cast iron....2 hands are needed to lift). You can cook just about anything on here....pizza, bacon, bread, strombolis, calzones, etc. Buy a pizza cutter to go with it and just slice it right in the pan! After you've finished cooking just wipe clean with warm water, dry, and apply some oil or cisco, wipe excess off, and store for next use.",
        "With all the advantages of a good cast iron pan. Very heavy but that is no surprise.",
        "I had been using a flimsy baking sheet for my pizzas and decided to upgrade to this as I'm getting better with pizza making. Worked great! It really made a nice crunchy crust which I struggled with before, and even made the crust puff up a bit which I was also pleased about. Defenetly recommend this!",
        "I bought this to make big dosa which requires a uniformly hot surface, and this seems to be a good answer. I use an IR thermometer to make sure it is ready before I put on the oil and add the batter. Works great for the intended purpose.",
        "Bought this to use as a griddle. I sanded it slightly after which it works really well for that. I use it on a smooth surface stove on a dual burner and though the outside edges aren't quite as hot as the center the entire pan still is plenty hot for cooking. I highly recommend this pan and would buy it again.",
        "I LOVE THIS PAN. IT'S NOT SO EASY TO USE FOR PANCAKES BECAUSE I HAVE A GLASS-TOP RANGE AND THEY DON'T COOK EVENLY, BUT IT'S WONDERFUL TO USE FOR OTHER THINGS IF YOU CAN GET IT SEASONED WELL- WHICH IT'SNOT AT FIRST. TRUST ME, YOU WILL WANT TO PROPERLY SEASON IT!",
        "Lodge is good quality cast iron. Works well in the oven or on the grill. Good for pizza and flat breads. Easy to clean if you follow usual cast iron methods. Rule of thumb, never put anything in or on (the cooking surface) your cast iron you wouldn't eat. Hot water and a scraping, if necessary.",
        "So cast iron won't rust if wet for a couple of hours. I now know this because the post office left the box on the porch during a rain storm. Had the post office employee made that one extra step to the door I would never had known. All this time I thought they were a bunch of slackers at the p.o. but they are helping consumers test the durability of the products they purchase. The pan is fine. The same quality I have come to expect from Lodge.",
        "A solid cast Iron skillet; hefty, accurate size, and quick delivery. I have used this for everything; reheating foods, roomy enough for two ribeye's, warming up flour tortillas and making a quick breakfast...its uses are endless. It is also easy to clean; wipe it down with oil and place it in the oven...done! Caution; it warms up quickly and throughout the entire surface. The price is worth it. It will last for years to come.",
        "This is by far the best thing to use to make pizza. Not only pizza but eggs, bacon, burgers, you name it! Every time I use this my pizza's come out crispy (never soggy). LOVE THIS PAN. I use it at least 3x a week because it's so universal. Can't wait to try other products from them.",
        "We love cooking with cast iron, and enameled cast iron for the even heat distribution, heat retention, and ease of caring (not: not ease of carrying - these things are heavy!). This pan has been fantastic for making pizza on the grill and in the oven, heating tortillas, making pancakes, grilled cheese sandwiches, and so much more. Super versatile, great quality (we love Lodge!), and a good value.",
        "Loved the first one so bought another one. It will stick a little initially but as u keep using it will get better and better ( black patina).",
        "Lodge did it again with a great piece of cookware. Pizza night was a hot thanks to the uniform cooking and great taste. Follow the seasoning guide at the Lodge website and you are on your way to cooking adventures. The product is built extremely well and should last decades. It can be used for many situations and meals including stove-top, oven and grill.",
        "Typical high quality Lodge cast iron. Treat it right and it it will last a lifetime. Follow the Lodge crust recipe that comes with the pan for your first couple of pies. Then with what you've learned, use your favorite crust recipe. Better than a stone. Use it on the gas grill or use it on the charcoal grill for that extra added flavor. Use it in the oven if you would like. You won't be disappointed. Of course, you can use this as a griddle or anything else that a cast iron pan can be used for. It is big and it is heavy. Just treat it right, the way Lodge recommends",
        "If you're looking to make pizza in the oven, this might be perfect for you, but not for the grill. The cast iron conducts heat so well it burns the crust really badly when used in a space like the grill where the heat source is directly below the food. I've heard these work really well in an oven where you can use the broiler for heat but it's a bust on the grill. Get a pizza stone for the grill, they work like a charm. Also, read this listing very carefully apparently returns are not allowed so be absolutely sure it will work for you before purchasing.",
        "This cooks the best pizza! I've been putting this in my oven, turning it on to 425, and then preparing pizzas on squares of parchment paper. The pizza comes out with a nice, brown, crisp crust. So good! Everyone in the family agrees, best pizza we've ever made from scratch!",
        "I bought this so I can do smash burgers on my kamado grill. It fits nicely and when it does up to about 400F i start smashing. I also cooked bacon, sautéed onions and toasted the burger buns on it before the burgers, works great and with a chain scrubber it cleans up easily.",
        "This is one of the handiest baking pans I've used. Baked potatoes, pizza (even after its cooked it keeps the pizza hot), cookies, meatloaf, pancakes, and hash browns (because of the low sides it's easy to flip them) to name a few. Keep in mind it gets hot and hold that heat. Its made by Lodge here in the USA and lets face it they don't make junk.",
        "Bought this after my oven temperature was messed up and broke my stone from high heat. This is a great substitute I use it for everything, pizzas, cookies, bread. Super durable and can withstand anything. Great investment must have! Love the handles makes it so easy to remove.",
        "This is the best pizza pan in the business! I have used stone dishes for over 25 years now, and this cast iron is clearly far superior in every way- from heat distribution to the ease in cleaning it after. Once it is curred- it is perfectly stick proof! Love it!",
        "I love pizza. I love cast iron. This is match made in heaven. Very much like to make my own pizza from scratch. We've gone through several of the stones (round and square) with lackluster results and a final disappointment of the stone breaking after only a half dozen or so uses. Bring in the Lodge Cast Iron Pizza Pan. I don't know why I didn't get one of these before. I've only used it a couple of times for pizza, in the oven (gas) and it has worked out really well. I've also used on the charcoal grill as a roasting pan for some potatoes. I can't wait to use it more and more.",
        "I did not like this product- it did not meet my expectations",
        "For anyone wondering, DO NOT BUY THE AMAZON BASICS BRAND CAST IRON PLATE! That cookware feels like sandpaper and has sharp edges on the handles. This plate, however, is smooth like a table-top and very sturdy with all the benefits of cast iron you expect.",
        "What can i say? Its a cast iron pizza pan made by lodge. This thing kicks ass! Ive made cast iron pizza before. But i was using an 8 inch skillet. And im a big dude! An 8 inch pie wasnt working for me bro. Saw this bad boy and i had to get it. I bake my pizza at 500 degrees for 7-8 mins. Then hit that pizza with a slow broil to finish her off. This product works great. Ive really stepped up my pizza game with this. Im sure u could use it for other things as well. You could probably cook 5 lbs of breakfast potatoes on it lol. Its pretty big lol.",
        "I use this for making pizza on our outdoor gas grill. I've been making pizza this way for years and I can tell you the NO OTHER PAN works as well as this one. It's worth every cent and the results are delicious! PLUS it's made in the USA so you don't have to worry about one of the (many) knockoffs from CHINA slowly poisoning you from iffy materials leeching into your food.",
        "Rusted after using it twice and now can’t get my money back. Not even coconut oil saved it",
        "I can talk all day about this amazing pan! I use to bake pizza, biscuits, taco shells, and more! It’s so durable and easy to clean!!! I will be buying another one soon so I can start making two pizza’s at once! I’m in love with it!!! Best baking pan ever!!!",
        "I wanted a griddle that would fit on my Kamado Joe classic and this fit the bill perfectly. It easily fits inside with the door closed. The low sides make this easy to use as a griddle while making smash burgers. I have been leaving it outside in the kamado for days at a time with no signs of rust. The pre-seasoning is clearly doing its job. If you need a griddle for your Kamado grill this is perfect.",
        "I have been making homemade pizza for many years but was never satisfied with the crust. I used this cast iron pizza pan on my Weber gas grill and I made the best pizza have ever made. I love this pizza pan and highly recommend that you use it on your gas grill for the perfect pizza crust!I",
        "Perfection! Cooks pizza evenly. Perfect crust! Put a little olive oil on it before pizza so it didn't stick. Broiled 3 inch thick toppings on high (2nd rack down) for 12 minutes. Then turned to 450 bake and placed on lower rack for 8 minutes. This was money well spent. Highly recommend! THE BEST PIZZA!",
        "It’s simply not good. Maybe I just don’t use it correctly. The baked pizza is soft using the same time as the previous pan that I got for free. No improvement over the free pan",
        "Great for Pizza in the oven, cracked my pizza stone and trying out the cast iron and it works just as good with even cooking and so far no cracking. yes, the cast iron can crack as well but so far no problems. Like the handles, makes for easy lifting to get it out of the oven. Maxed out the temperature on my home oven (Frigidaire Gallery Series) kitchen range at 550 degrees with no problems.",
        "Even though it says pizza pan, it does not stop there. There are hundreds of uses for it, and it is up to your unlimited imagination and needs. I use it for grilling fish, cooking tortillas, searing steaks, making dosa, paper dosa, masala dosa, flatbread omelet, and so on.",
        "Found a large 14 inch round baking pan to be quite nice heavy but not too heavy with large handle so it's easy to remove from a hot oven but yet big enough to bake quite a few cookies on really like it would highly recommend easy to take care of I use Crisco to keep it seasoned",
        "I bought this on a whim when I realized I no longer had a pizza stone, and opted for cast iron because I figured it would be easier to clean and more durable than stone. Glad I did, because once it got here I realized I'll get more use out of this thing as a breakfast griddle -- it's perfect for frying up bacon, eggs, pancakes, and probably a bunch of other stuff. It's sturdy, good quality, and delivered quickly. Great value when compared against more expensive \"non-stick\" pans that crap out after a few months.",
        "Had a few pizza stones which after time, would crack. My son suggested cast iron pizza pan. It heats up very well. I use it for both the store frozen pizza and my homemade tortilla margherita pizza for myself and tortilla pepperoni for husband. We love it. Will be trying other recipes for the cast iron pizza pan.",
        "This is one of my favorite cast iron pieces. I love it for making keto cheese crackers. Very large surface and heavy weight iron. Easy to clean, with proper maintenance. I purchased two. The second was a part of a pizza themed gift. It came in a nice box.",
        "I purchased this specifically for making smash burgers on my Kamado Joe Classic. I can confirm that it is a perfect fit for a KJ Classic and presumably any other similarly sized kamado grill. The burgers were the best I've ever had. I look forward to trying a reverse seared steak on it as well!",
        "Seasoned pan. Still had pizza stick to it. Seasoned it again. Pizza still stuck to it. Not a good pizza pan.",
        "We cook mostly all cuisines at home. I made street tacos on this pan, made naan, roasted roti, some pan- seared cajun chicken, and pizza! Yes - this pan can handle it! Season it everytime you cook & it will last a lifetime."
    ]
}