{
    "entity": "Pizza Pans & Stones",
    "text": [
        "Been going through bake (pizza) pans a lot in the last few years trying to find a good one. This model's a keeper. After a about 30 uses and 31 runs through the dishwasher, the coating's still intact, it stays clean, and the only rust is just a tiny bit from under the rim. Sadly, none of the other pans I've tried so far can make *any* of those claims. This pan has also remained smoke free. The perforations make for crisper crusts and firmer doughs. Just need a flat sheet under the whole thing if drippings are a concern. Since this pan has 3 \"feet\", it stays above the flat sheet so air can still circulate.",
        "Update: I am having issues with this pizza pan warping. It twists almost 1/2 of an inch after baking. This says the metal may be too thin. It was NOT bent when I first started using it. Still works but I shouldn't have to worry about it warping. Wanted this size in the calphalon brand but they didnt have this size. Purchased this with fingers crossed. If you need a smaller size pizza pan this works. Cooks perfect and super easy to clean. Food slides right off without sticking",
        "I've had the pizza pan for a few months.... It has worked wonderful, but I can no longer get the Crisco spray residue off even after I've soaked it for a lengthy amount of time in hot soapy water. I use a plastic pizza cutter and you can see every swipe I've made on the metal pan. Kinda thought it would have held up a bit longer as I only use it about twice a month.",
        "I love this pan for making Pizza in my RV. I needed Airbake because the RV ovens do not cool properly. Airbake makes it all better, but especially when adding a pizza stone into the oven. I love this pan for its ease of use, easy to clean, and non-stick qualities. I would highly recommend this pizza pan, especially if you like a bit of a crunchy crust on your pizza. :-)",
        "This is a great pan for pizzas. I used to use a cookie sheet, but that left a gooey crust. This pizza pan gives a crust that is just right (when I take it out of the oven at the right time...) The only thing I gave it only 4 stars for is the mess that can be made because of the holes. I still need to figure out where to place it after taking it out of the oven without allowing melted cheese or flakes of crust to fall onto the counter, stove top, or table. Overall, it does the job and I recommend it.",
        "For such a low price, it gave us instant crispy pizza crust. We’ve just started experimenting with pizza making, and didn’t want to spend a lot, but wanted to try a pan with holes. It worked! Nice crispy crust! Perfect. Highly recommend it.",
        "This AirBake pizza pan works just as I needed it to. The typical store-bought pizza that I get from the freezer section, fits this pan very well. I go with Home Run Inn pizza. I'd definitely recommend this product to family and friends. Have a great day.",
        "Great for Digorno pizzas that want me to put the pizza on the open over rack, but my wife gets mad when cheese falls to the over floor. Now we are both happy. The pizza crust gets toasted, there is no clean up on the pan nor the oven. I do spray the pan with Pam non stick stray and I cut the pizza on the Digorno box as not to scratch this. I would buy again!",
        "The pizza comes out nice & it's a breeze to clean it. I would highly recommend it. I use it for heating frozen pizza",
        "Love this pizza pan very sturdy cleans easy. Not only can you cook pizza also cookies.",
        "This is literally the best pizza pan ever!!!! The only reason I am giving it 4 stars is because it came with a scratch on it. The original one of these I’ve owned since the 90’s and it’s still good. These air bake products added amazing!!!! Absolutely AMAZING!!!",
        "Used mostly to hold 10\" bamboo steamer over large pot. Its the perfect size to fit over large stock pots and the holes are the perfect diameter to fit within a 10\" steamer. Very pleased with it!",
        "I really like this pan, it is extremely easy to clean, I would not cut the pizza on it for fear of scratching the pan...pizza cooks up great!!! No soggy crust!!",
        "Bought this pan to use in our travel trailer. It's fantastic. We got it yesterday and cooked a pizza and then tonight some French fries. Both turned out wonderful. We can now look forward to a more varied and tasty menu. Could not be happier.",
        "easy to clean, use and store. i think it does great job cooking a simple pizza. we're pleased w/ the product.",
        "Excellent product. One thing though. It says it’s dishwasher safe. Then it says dishwasher detergent will cause discoloration. Otherwise it’s fine.",
        "Easy to clean and sturdy. Even Tastes great! The pizzas aren’t all that bad either!",
        "We love it. Heats evenly and no gucky cheese clean up. Really good for heating rolls and other baked goods. Sent a larger one to our son and he hates the holes. Go figure. If the holes are a problem, just put down a piece of foil, but we got this for pizza and it is just great.",
        "Bought this sort of by mistake, I thought it was the bigger pan, this is a smaller pan which is fine for making a smaller size pizza. Great non-stick surface and easy to clean. The bigger pan is better though.",
        "Love this. Have been cooking pizzas on the grill, but always had burned crusts. Not any more—they're now perfect!",
        "This pan is wonderful. It's strong and has the holes in it to make the pizza crisp.",
        "i lovet ,i have quilty pizza when i use theairbake",
        "Best pans for anything in oven that won't drip through. The perfectly crisped crust on pizza!",
        "I bought this for a single friend so she can cook smaller pizzas. She loves it. It is a little difficult to clean since it has holes in it, but it allows smaller pizzas to cook more evenly.",
        "Hi, I recently purchased this product, received it with a slight bend from one side. Overall product is good.",
        "I've used this once and the non-stick surface is already pealing off the pan and starting to rust. Don't bother with it.",
        "Pan was bent upon arrival and wouldn't lay flat. I bent it to reshape it the best that I could. Not worth sending it back.",
        "Must-have for properly baking or heating up pizza (and other foods) in a toaster oven.",
        "This is just like the large pizza pan. Great for frozen and raw pizza cooking. Easy clean-up.",
        "its really nice but rather too expensive the shipping charge",
        "Can't wait to get the large size now. What quality!",
        "I spray it with a little olive oil and haven't had any problems with dough sticking to the pan.",
        "Non-stick surface I great. Pan makes a nice crispy crust. The only drawback is that if you cut the pizza on the pan, like I have done with every other pan I've owned, the holes in the pan make a mess on the counter. It's really not a big deal. Otherwise it seems like a good pan.",
        "I liked, can't wait to use it ... would recommend. Seems to be made really well",
        "This pan has a good weight, a great finish and makes a great pizza. Very easy to clean. Highly reci",
        "The frozen pizza directions said to place the frozen pizza directly on the oven rack. What a mess! With this pan, the oven is clean and you follow the same times that come with the pizza. The pan is non-stick, so you slide the pizza onto a cutting board and use your favorite cutter. I like adding my own toppings to stuffed crust cheese pizza. Turkey pepperoni or sausage is the best. A quick wipe with a damp cloth cleans the pan.",
        "I make my own yeasted pizza dough, and while holes seem like a good idea to crisp the crust, I've found that the dough gets pushed through to the underside of the pan when I place the dough into the pan. This makes for a bit of a mess during baking, but the baked pizza still comes out okay. Maybe if you use commercial dough this would not be a problem.",
        "In addition to pizzas, I have used this pan to bake meat, cookies, fish and appetizers. Everything came out the same as it had on a typical baking sheet. There was no sticking and clean up with a sponge was very easy. This is a great pan, but the 12\" dia. may be a limitation.",
        "Had two in the lighter metal. Not sure I would like the darker one. LOVE IT. Immediately ordered a second one. One thing, do not cut the pizza on it. Scratched it up pretty badly. Will move to a cutting board next time. Crispy crust and slid right off the pan, even the pieces of mozzarella that were melted on it.",
        "This pan has small \"feet\" on the bottom. These make it impossible to turn the pan on the oven rack. Otherwise, the pan is a nice non-stick surface",
        "Needed a smaller size for our new fifth wheel convection oven. This works great! Made pizza crispy on the bottom 🍕",
        "Our toaster oven pizzas have come out more even and easier to pick up and to clean. Very happy.",
        "Bought it in March, 9 months ago. Today it is rusted out. Don't buy.",
        "Works good but the bigger size is better for papa Murphy's pizza. I like it for tater tots and fish like the air holes",
        "This is a very good pan. I don’t bake directly on it because I use aluminum foil. It really makes things cook faster, and I would definitely buy again.",
        "Perfect size, the smooth curved up sides are perfect for sliding pizza off onto a cutting board",
        "If your are tired of \"white bottom\" pizza here is your solution - This is a crisper that works - Performs not only great on pizza but we also use it on french fries and frozen fish sticks .... if you have to eat frozen food this adds great crisp texture",
        "This was a gift to a friend. I'm told it works great and he loves it.",
        "Great Pan for Rv convection microwave oven. Food now comes out crisp...like frozen pizza. A bit on the high side for price...but well worth it.",
        "Just as described. Love how it makes our homemade pizza turn out.",
        "Perfect pan for two people baking time was quick. Package directions say 30 minutes pizza was done in 15 minutes.",
        "Arrived in great condition. This product should make some super tasting pizzas hot out of the oven",
        "This works well on my AirBake pizza pan--no scratching at all! It does exactly what I wanted it to do. It even cut through a very thin, crispy pre-made crust. I am delighted with it!",
        "This is the second pan I have purchased. I had one and another plain pizza pan and the perforated pan bakes much better so decided to purchase another one. Also the finish on this pan is really nice and the pizza doesn't stick like it does on my other pan. I would highly recommend this product!",
        "Love this pan in my toaster oven ... provides a perfectly browned pizza crust.",
        "Looks good. Good price. I didn't like that the cardboard was ripped off by someone and returned and sold back to me. The price eases my anger a little though. It looks brand new.",
        "I love it! The pizza cooks fast, even and fine..The pan prevents the sticky cheese from \"sticking\". No need to add spray or oil.",
        "Excellent size for my extra large toaster oven, and superior quality in the oven and dishwasher. No spotting or wear.",
        "Great pan! Pizzas bake evenly and the pan cleans up very easily.",
        "Nice pan. We needed the smaller size and have already used it with success.",
        "I am impressed with how evenly this bakes my pizzas and I experimented and used it underneath pies I was baking. They came out evenly baked too-no burning! Clean up is fast!",
        "Crisps pizza up great! Had it for about 3 months and it works like a charm. The nonstick and the perforations are fantastic, and I'm looking forward to making more pizzas with this bad boy.",
        "Great for non-stick, but this size is a little too small for standard frozen pizzas.",
        "Performed as stated but does not appear to be the laminated type but just a heavy pan with holes in it!!!",
        "This works well. You do have to adjust the oven temp for the darker pan. I was worried about using non non-stick tools on it, but it did not scratch.",
        "Amazing!!! I wasn't sure about buying this but now I won't ever use anything else!!! This pan cooked the pizza evenly and to perfection! It also cooked the pizza in even less time than it normally takes!"
    ]
}