{
    "entity": "Over-Ear Headphones",
    "text": [
        "I originally liked these enough I bought a total of four. Three have broken apart (meaning that one ear muff is no longer connected to the rest of the head phones). The covering on the last one is now completely flaking off. I am not hard on my things. I am pretty gentle with everything I buy but these are not worth my money. I will never buy another set.",
        "I got my first set of HD201s over 2 years ago. However, they are worn, and some of the sound quality is fading. So I ordered a new set from Amazon. I could instantly tell that the 2 versions were different. Either Sennheiser's quality has gone downhill in 2 years, or the ones I received were fake. The band was smaller, the plastic was borderline delicate, and the sound randomly shorted in and out when I plugged them into my PC for an hour. Not what I expect from Sennheiser. I'm just ordering replacement pads for my 'old' 201s, which are about 3x sturdier than what I received. Buyer beware, I guess.",
        "I have purchased a good number of Sennheiser Headphones through the years..,when I had the money for quality...it's been awhile. So I decided to buy these because I was disappointed in the 'cheap' ones I've been using...I am very disappointed to say this, but these Sennheisers are the WORST headphones I've ever tried!! I honestly cannot believe Sennheiser puts their name on them. Sure, they were inexpensive, but I never imagined they would be this horrible. I see another one star review, making a similer complaint, so ?i know it isn't just me. Buy these at your own risk!",
        "Better than Beats and 1/10 of the price. The bass may not be as deep or full, but the high and mid-range are sooooo much clearer and crisper. They sound great amped up and pretty damn good just connected to my iPhone. Very pleased with my purchase. These wires are suspect, though. I just don't trust them. In the time I have used them, they seem okay, but they just look like a nightmare in terms of being destroyed under normal wear conditions. For the price this is a non-issue. I could pickup 5 of these for what it may cost to find something comparable.",
        "I used these headphones gently, every day, for meditation. the wiring at the terminal of the lightweight plastic jack has apparently given out; now I only hear in mono. Can understand why this flawed model has been discontinued and wish I could get my money back. Black mark on the Sennheiser brand for sure—normally known for good construction and audio quality.",
        "Sound and fit is fine for the price. It is hard to find over the ear wired headphones in the stores so these were a find. Only problem is that the cable is so blasted long. It is at least 6 feet long so if you want to use it at the gym to muffle the obnoxious YMCA muzak you have loops of cable hanging around your feet. So far I haven't found a really handy cable management doodad that will suck up the excess wire without being awkward to wear.",
        "For the price these headphones are spectacular. The sound quality they put out for $21 is absolutely unbelievable. I'm a bit of an audiofile, and these headphones balance bass and treble very well without having to adjust any equalizer settings. They aren't quite noise canceling, and are not advertised as such, but they might as well be. They can very easily drown out the world around you while you enjoy your favorite music with great quality sound.",
        "Good, clear sound. I like the equalization better than the Sony headphones I own -- which seem to go overboard bass-heavy. Very clear sound reproduction on a variety of musical genres, including classical music. The over-the-ear headphone configuration is MUCH more comfortable to me than on-the-ear. I would recommend these Sennheiser 201 headphones to any but the most-demanding audiophile.",
        "These are my favorite headphones. I love the long cord that I can plug into my computer and not feel trapped. The sound quality is fantastic for the price. These are my second pair. The only thing I would change about them is that they don't fold. That's how my other ones got broken. I was carting them back and forth to school for a year before they finally gave up and one of the ear phones broke off. I could have glued it but I decided that I just needed a folding pair of headphones for trips to and from school. I love these for music, linguistic transcribing, listening to videos.",
        "These are solid tracking headphones IMO. They isolate well, they're light, comfortable, and the sound quality is such that your musician will be able to focus on they're performance without being distracted by their \"sound\". Good stuff for the price. I'd even go so far as to say they sound more \"usual\" than the AKG K52 headphones.",
        "The left headphone did not work (brand new, out of the box). If I spent time jiggling the wire, I could sometimes get it to turn on, but then it turned off again. I have had this issue with two separate HD-201 units that I owned. It's a shame, because the sound quality is actually really nice, but it's not worth it if both headphones don't work.",
        "The Sennheiser HD201 headphones are a great value- especially when on sale for $15. They are lightweight, comfortable and sound quite good. The only negative aspect is, unfortunately, something I originally thought would be a positive- the \"over sized\" ear cushions fit around the ear instead of on the ear. While this is probably great for most, I find that since the cushion sits on the arms of my glasses and squeaks against the plastic. It squeaks with the slightest movement- even just breathing. After these die- because for $15 they won't last forever- I might go back to headphones that sit on the ear. Those never squeaked against the glasses.",
        "These are NOT a $200 pair of DJ quality cans. The mid-low base is not terribly good, but these aren't studio quality Sennheisers: These are best for watching web videos, or audio books. The voice range treble is excellent for the price. These particular headphones also have a SIX FOOT cable, which is why I bought them. 3 1/2 stars on quality ( I rate most Beats 4 1/2) and a solid 5 stars on price.",
        "I note other reviews comments on the limited bass response and while there are some times when I would like a little more bass it's not so bad that it ruins the listening experience. I have owned a pair of Sennheiser head phones before so I had no worries or reservations about buying these. One thing I did notice is the sound clarity. I heard things that were there that I never noticed before. They also fit nice and are comfortable. Overall I am very happy with them.",
        "I have had these headphones for 3 years now and they are still working (seriously, they are still working after I have used them everyday since I got them back in the summer of 2014). I don't think they will deliver high-quality sounds (like background noises in games. I sometimes cannot pick up what others hear but hey, I might just be deaf). It is cheap and nice to use if you don't care about hearing every detail of sounds. The padding is starting to fall apart as of this year so I am going to probably save up money for another pair of headphones, but they still work after all this time. These headphones were pretty awesome.",
        "I purchased these headphones in May and it's now July and only one side works. I've had Sennheiser before, albeit the $150 model, and they lasted YEARS. The sound quality is nice, the comfort is nice, but again, they broke in 2 months and I'm by no means hard on my headphones. I use them exclusively for my PC so they're always just sitting on my desk when not in use. Very disappointing. Would definitely recommend buying the more expensive ones because the brand is still good with their higher priced models.",
        "I think the Sennheiser HD 201 Lightweight Over Ear Headphones are a really good pair of headphones. It's more of studio headphones with minimum bass than regular headphones with a lot of bass. The sound is great and crystal clear when it comes to music with all kinds of intricate sounds and instruments. The fit is nice on the head and on the ears. The leather on the cups fit nicely and is comfortable. The only problem I had with the headphones was the plug broke within a few days. So I had to bend it back in place to get it to work decently. Overall theses are some nice headphones for a affordable price.",
        "This is an OK product for the money, but why is the cord so short under the chin? It's more like wearing a bonnet than headphones. My head may be a little bigger than most people's, but the cord cuts into my skin at my chin. Are these headphones designed for children? A complete disaster for a big headed person. I've bought several pairs of headphones in my life but never one that made me feel like my head was as big as this. Disappointing.",
        "I wanted a new set of headphones and did some checking. I found a few deals that looked promising, but then I saw these. I'd never heard of Sennheiser so I looked them up. After reading product reviews, I decided to give these a chance. I have never had such a good pair of headphones. The sound canceling quality is wonderful. I don't hear the sibilants on the female vocals, and I listen to a lot of stuff with female singers. No real problem with the bass on any of my music at the levels I find comfortable. They're very lightweight and the cups fit well over my ears. They're a little snug but not uncomfortably so.",
        "I had purchased a more expensive pair of over the ear headphones and wanted to have a cheap pair to do the grunt work. I have to say, these have been good enough that I rarely even look at the other pair. For the price, they have great sound, at least much better than I expected. Nothing is perfect, and I am sure if you check one of the audiophile reviews here you will get technical analysis that might be more helpful, but all I can say is that they were a great buy for the price to me, and I would not hesitate to buy them again or give them as a gift.",
        "I bought these due to their price and other online reviews saying they were the best in their price range. I've owned then for several years now. The sound is nice for this price. That comes with sacrifices though. They are not very comfortable and can make your ears sore over time. The vinyl used on the strap cushion and ear cups will crack and peel. I've replaced the ear cup cushions with a set from hd598s successfully. The cord on these is about 3 miles long(probably closer to 10ft), so they aren't really for walking around with. I've had mine for years, but the left and right wires have separated.",
        "I had expected more after reading the reviews. I am not an audiophile. These are now the nicest headphones I own, but they didn't overwhelm me with comfort and incredible sound like I have experienced with other headphones. Don't get me wrong. I'm not saying the sound is bad, they are definitely better than my ear buds. But I couldn't tell you that I LOVE them. They are okay. And for the price, I'd even say I like them. The cord is LOOOONG! Which is nice sometimes, but inconvenient at other times.",
        "These are great headphones, especially for the price. I used them for most of the year to watch Netflix on my Fire tablet on my lunch breaks, and my ears were never tired of wearing them after an hour. Not sure how they'd do for longer periods of time, but I bet they'd stand up pretty well. I did finally upgrade to a pair of wireless bluetooth headphones since I was tired of the long cord always getting tangled around me at my desk... but I plan to keep these and take them along any time I'm flying, or otherwise can't use something wireless.",
        "Unremarkable because I don't even remember buying this. I remember buying other headphones but this clearly left no impression on me at all. Thats not to say they were bad headphones, if they were terrible you would think I would remember that.",
        "I'm officially a devotee of the over ear phones. Even without being advertised as noise-canceling, these do a great job of mitigating environmental noise, and give perfectly good audio whether I'm listening to video or music. I'm particularly happy with the length of the cord, as this allows me to plug in at my computer desk at work without need for an extension cable.",
        "My regular headphones finally broke, and I wanted an over-ear replacement without breaking the bank. These probably aren't going to be for any audio editing, but the sound quality is serviceable for the price. The ear cups are a bit stiff and just a little small for my ears. The clamping pressure is nice and light, which is a plus. Comes with a 1/4\" audio jack, too.",
        "These are amazing! No, they are not noise cancelling, but I knew that going in. I saw these posted on a website for great inexpensive headphones and they did not disappoint. I needed a good pair of headphones for travel, but didn't want to spend a lot because I probably won't use them on the regular. These got the job done and are so worth the money. If you use headphones a lot, you may want to spend a little more for a more high tech pair, but if you just need a good, comfortable pair of headphones, these will not let you down!",
        "The cost is low and that is the reason I purchased it. The sound quality is decent for the cost (I am NOT an audiophile). However, the fit is uncomfortable and more so if you wear glasses. It gets quite painful with glasses within 15 minutes of using it. The wire gets in the way a lot and needs some sort of cable management.",
        "My Headsets arrived and would not stay plugged into any of my devices. Customer service was excellent and handled the problem.",
        "These are still relatively new, just a few months old, and they have lost sound on one side. I had a previous pair of these same ones that lasted for YEARS. I have reached out to the seller and am hoping they can give me a replacement. I will update.",
        "These blow away any of those cheap $40-$50 units with all those fancy lights and whatnot. Covers your entire ear making everything studio quiet. Between the conmfort and the extremely deep sound quality I cant recommened these highly enough.",
        "These headphones were awesome while they lasted! They drown out what I don't want to hear. The audio is clear, crispy, and loud enough. They are comfortable as heck. Unfortunately, I'm losing audio in one side. Possibly a short in the cord? However, for $23 and 11 months I can say I got my money worth. I'll give a different brand a try next time but don't let my experience deter you. Try them out for yourself!",
        "Very disappointed with these headphones. After reading some great reviews, I decided to purchase these, mainly because of the way they look. I use headphones while playing live music. (keyboards) I have a pair of Sennheiser HD 202's, and they are outstanding. The 201's volume is very low compared to the 202's at the same setting, and the clarity of the sound is much better with the 202's. I'm returning the 201s.",
        "I would rather give $20 to Sennheiser than, say Skull Candy. I just needed cheap headphones to listen to things while at work. I like the following features: - It makes sound - Better construction than most headphones at this price - The really long cable is great. I have to plug in to the front of the computer, go behind my desk and over the top, then reach my chair. I have plenty of room for that. - Decent comfort, but I don't wear them for very long. Maybe a half hour at most before taking them off. I am not asking for much when a headphone costs twenty bucks.",
        "I am pretty impressed with these headphones for the month or so that I've used them. This $20 set of cans sounds almost as good as a pair of $100 Audio Technica that I own. Build quality is pretty impressive too, again considering the modest price, and they are quite comfortable as well. The only flaw that I can see is the cord, which is very thin, and I suspect, without proper care, will result in one of the headphones going out after a time. So you do need be careful with them. Other than, an absolute bargain at $20!",
        "Nice product and a great price. These things are great for blocking out background noise and allowing you to hear what's playing without interference. They aren't a high end professional type but they do a great job, I use them for around the house when I want to see a movie on my laptop and my wife has her favorite TV shows on.",
        "For the price I was not expecting much more than an average pair of headphones that would simply \"get the job done\", but the more I use them the more I realize how great these are. I needed a more comfortable and over-ear replacement for my Apple Earpods for almost daily use. I mostly watch movies and tv shows on my laptop, and the sound is great. The bass is enough and voices are crystal clear. So far no \"hissing\" sound that some reviewers mentioned. Although the headphones itself do not feel physically as sturdy as some other higher-end models, for the price you can easliy afford to purchase a replacement if needed. Overall I'd say a great buy.",
        "I was underwhelmed, until I ordered some replacement pads made for HD 485s. They're the same shape and are held on the same way, so they go on with little difficulty. Once I'd replaced the cheap pads, they sound better but not spectacular. All in all they sound great but it's a little fiddly to get them to seat on my ears properly; otherwise, they sound anemic. The new pads helped, but aren't a total fix. Having said all that, for the price they're a good set of headphones.",
        "These are a nice pair of headphones and work great for video editing and audio splicing. They are light weight and the cord is very long which is a big plus! They are comfortable to wear for long periods. I've worn them for about 2 and a half hours and didn't experience fatigue. They didn't make my ears sweat either another plus! The price was in the range I would expect to pay for a pair of headphones of this quality. The Sound quality is also very good they seem to be very well balanced between the highs, mids, and lows. Overall a great pair of headphones!",
        "not bad for the price. Not very loud but usable. They don't seal out noise as well as I'd hoped. It feels like they are slightly warped, like twisted, I'm not sure if they came that way though or if it happened over time (I keep them hanging on my monitor when not in use, and never took them anywhere so I don't know how they would twist just sitting there unless its the cheap plastic)",
        "Easily the best long use headphones there is. Super comfortable and light, sounds great and has a super long wire. Basically the only headphones I've ever used where I could wear them for 8+ hours and sometimes forget they are on my head. If you need headphones for long term use, these are the ones.",
        "Excellent sound quality and comfort for the price. These are JUST large enough to cover the ear. Not like studio headphones that are super cushioned and large, no. This pair is cushioned JUST enough to be comfortable. So, I would not expect these to stay comfortable for years of heavy use. But the clarity and sound quality are quite high! Just as good as my studio headphones. They do NOT block out sound, so you'll still here grandma fart. But, that said, they are remarkably able to keep sound IN, so your songs don't get muddy. The cord long, like Stairway to Heaven, to listening anywhere is made real easy. BUY THEM.",
        "So incredibly comfortable and lightweight. These headphones have incredible sound for an incredible price. EDM sounds especially good in these puppies, with a great bass system. 10/10 would purchase again. Sennheiser, if you ever read this, I would gladly pay up to $15 extra to have a cord that cats/puppies cannot eat through. The thick, durable rope-style cords that companies like Mad Catz use are so durable and would take the lifespan of these headphones to the 15 year mark instead of the \"whenever the boyfriend leaves them out of their case for the cats to eat the cord\" year mark. Truly a great product though!",
        "I bought these headphones back in 2011 and they still work so that is worth noting. Other than that everything else I have is somewhat negative. Let's start out with build quality, its fine, ok minus the MASSIVE cord and the uncomfortable feel in long listening sessions. The sound performance is what you would expect from cheap headphones but not from sennheiser, music is flat with almost no bass but an alright mid level range. So to sum my review up these things will last you for a long time but you may wish they didn't due to the 10 foot cord and lackluster sound.",
        "They're comfy. Sound fine. Cheap. There's only one caveat - you won't get much volume from these coming off you iPhone or basic laptop. I don't listen loud so it works for me, but after 2 years I'm still surprised how much gain these require.",
        "Bought these 4 years ago, just before starting college. After daily use for hours on end, these have turned out to be pretty great. Respectable sound quality and comfortable cushioning. After 4 years, the outer layer covering the cushioning has flaked off almost entirely and the left headphone is almost completely unresponsive (silent unless I jiggle the jack for a long while). But it's served beautifully since then. Good purchase if you need something reliable that'll last long enough for you to forget exactly when you purchased it.",
        "I've used a pair for over ten years because I found them very comfortable. When they finally gave in, I decided to buy the exact same pair for me because of how good they feel. I also own a pair of QC35's which have much better sound, and the noise cancelling feature is fantastic. However, I can't wear the QC35's for more than 2 hours at a time, whereas I can wear the HD-201s for 10 hours with no problems.",
        "I was very disappointed with these phones. The volume was quite low and some audio was difficult to clearly hear without pushing the ear covers into my ears. Sennheiser is a respected name for microphones and other audio equipment but I would not look to them for head phones after this. I returned them. No problems on return.",
        "Seinnheiser makes great head phone, some of the best really. I didn't expect much from a $30 headphone. But, the are very good, like all seinnheiser products. I have the HD 600 for my main system ($300.00) and they are fantastic and will keep up with the big boys who's prices go into the thousands.",
        "20!? amazing quality for 20$ would be 99/100 times. Great sound and extremely comfortable. only thing I don't like is the wire. It was extremely long I think around 10 feet which COULD be useful, however they get tangled and are hard to work with. Otherwise amazing. However I tragically lost these because someone stepped on them :(.... I would have ordered another pair but someone gave me a new pair of headphones as a gift. (They were worth 60$ but I still liked the Sennheiser better)",
        "These headphones are very comfortable and the sound is really excellent. I do not like tight headphones, so I took the advice of another reviewer and purchased the Sennheiser HD 201 headphones instead of the HD 202. These fit nicely over my entire ear, attenuating outside noises while delivered an excellent dynamic range of sound. Music sounds great and voices are very clear. My ambient speakers and amplifier are a Klipsch/THX system, so yup, I'm spoiled when it comes to sound. In comparison, these still sound great.",
        "Overall a great pair of headphones for the price. Sound isolation is decent. When I'm listening at a normal volume no one can hear my music. It doesn't do a great job keeping background noise out though, so if that's a concern you may want to invest more money and get a pair of noise cancelling headphones. My only complaint with these is that the base volume is low - so for example when I plug them into my phone, in order to listen at a reasonable volume I have to turn the volume up so high the phone warns me that I'm listening at a dangerous volume. Really it's just a minor annoyance.",
        "Bought these because they stopped making the HD-202's, which I still like better. These are decent headphones for the money, nothing remarkable. Hard to wear for long periods of time.",
        "I bought these headphones for 3 reasons: - Sennheiser makes good stuff - the price was TERRIFIC - I listen to ASMR and meditation videos and you NEED a binaural headphone to get the most out of those recordings I immediately threw on some binaural ASMR videos to test these bad boys out. I was NOT disappointed! INSTANT Tingles! If you don't do ASMR then you won't know what I'm talking about but TRUST me these things are worth every penny. The clarity is astounding. I can't believe I only paid $20 for these. I feel like I robbed somebody LOL! If you get a chance, pick, up a pair. They really are incredible.",
        "Sennheiser's HD201 over-ear headphones have excellent sound. They are incredibly lightweight and I particularly like them because they are over the ear, blocking out a lot of outside noises. They are plastic and can creek a little bit if laying down, but not to the point of annoyance. For better or worse, they come with a long cord. Rediculously long. Like ten feet. I ended up having to wrap up some of the cord with a twisttie. There are also no inline controls, which isn't uncommon with over the ear headphones. Rating: 4 out of 5. Recommended: Yes. For the price and sound quality, hard to beat for over the ear headphones.",
        "These are best headphones for an inexpensive price that I have found. They last a lengthy time. They are comfortable, with the ear covers going over the ears and fitting comfortably. They also have a nice long cord. I have bought these 4 times now. 2 times for a family members and twice for myself. The only reason I purchased new ones was because the one speaker started acting up, after about 3 or 4 years of standard use.",
        "Love to listen to music at night, before bed. Cord is plenty long to connect to the CD player on the night stand.",
        "Bought these in 2011 and they're still working great. I don't use headphones often, or for long periods of time. So they may or may not be comfortable for hours of use. But if you just need a cheap pair of headphones to use every now and then, these are great. Comfortable, lightweight. They were a little too tight when I got them but I just stretched the headband out over a couple of nights (apparently a basketball is the perfect size for my head) and they were fine.",
        "the headphones were for my husband who is on dialysis...he liked them just fine while they worked...unfortunately, the jack broke off in the tv after just over a year of use...granted, we travel with these in a duffle bag 3 days a week which is probably hard on them, but i was disappointed with the longevity...he said the sound was good, and the head piece was comfortable...",
        "Impressions: Great value and would be perfect, but the left ear cup is uncomfortable no after what I do. Pros: -great value under 20 dollars. -very long cord for ease of movement. Cons: -the left ear cup is uncomfortable no matter how I adjust it. I have attached photos to show the measurements inside the ear cups. Never had a problem with other over the ear headphones. These are the first to have an issue for me. Consider it if your ears are not on the small side.",
        "Sound quality is fine. Cord sould be shorter, keeps getting tangled up in stuff but the head set works just fine. Very pleased.",
        "I was hoping I got a pair of good quality headphones. I'm very satisfied. Not familiar with this brand, not being able to afford a high priced set with controls on the ear pieces etc. I read most of the reviews and took a chance. They are comfortable, completely cover my ears and actually do block out almost all outside sound. The quality of the sound is very good too. I simply can't stand stat-icky sound, tinny or too heavy bass. I'd rather not listen to anything than put up with that. The stereo sound is well balanced on each side and I am totally pleased. I may get another set soon so hubby will leave my set alone.",
        "These are nice headphone for the price. They are perfect for those looking for a lower price point over ear set up. The cord is a little fragile but the sound is great and the ear cups are very comfortable. We got these for my 6 year old and they work great. She kept complaining that about the car noise but these really cut that down because of the sound isolation. Good bas but not overpowering. I use them sometimes because the sound is very crisp and articulate. Great setup and recommended.",
        "These \"cans\" are better than expected. I use them for my internet radio show, and I hear every nuance. Also, even though it's not advertised as \"Noise Cancelling\" Headphones, they sure do block out about 90% of noise around you when wearing them. I also hooked them up to my TV to test the bass/treble balance and was pleasantly surprised. Now I use these while my roommate is sleeping without the fear of being told to turn it down. Im not bothered that there is NO VOLUME CONTROL on these headphones. For $20, I got what I wanted. The rest is just white noise.",
        "I had read about these in an online review. And had been looking at them ever since. Thought they would make a nice gift for myself. I get tired of using the earbuds after awhile so wanted the full over the ear style. Been playing with them ever since they came in and they sound awesome. Just exactly what I wanted, nice bass sound but not overwhelming. Perfect for my gaming, I like to sneak and these phones proved to be excellent letting me hear every breath, every footstep. I am extremely pleased.",
        "The poorly designed union between the 3.5 mm, and 0.25 inch headphone jack. Rather than screw in for snug fit, the 3.5 mm jack is pushed, clicked, snapped into the hole of the 0.25 inch jack. The 3.5 loosely moves about inside the opening, causing loss of signal path. I Mix in Mono; therefore, constant loss of one or the other audio paths, L/R, occurs. Stereo: The entire connection is lost! REALLY! (And) these idiotic products actually are sold to the public?! APPARENTLY: SELLING GARBAGE TO CUSTOMERS MATTERS LESS THAN 'YOUR' PROFITS!\" NEVER (!) will I purchase your products, again!",
        "The sound with these headphones is HORRIBLE! Particularly on dance tracks with lots of bass. Even at max volume, I still can't seem to get them loud enough. And, I know that it's not me, because I've got some earbuds that sound great. These are, however, pretty good at blocking noises when listening to music. For the purpose of drowning out noisy neighbors- they just about do the trick, but I still wouldn't recommend them. While not a music snob, I DO know what music should sound like.. and these headphones just don't cut it. I wish I had read the reviews BEFORE buying them.. live and learn. While I agree that they are inexpensive, the quality could've been better.",
        "If you're looking for great, inexpensive headphones, these will serve you well. If you're an audiophile who can't settle for anything less than the best, keep looking. These deliver clear, well-balanced sound, but won't compare well to headphones in the $300-$400 range. When it comes to technology, you often get what you pay for. That being said, these are the best sub-$30 headphones I've used. I bought six pairs for live monitoring during a recording project and they were comfortable, clear, and none of the musicians had any complaints. Great purchase on a budget.",
        "BUY IF: You want an excellent set of headphones and have ears that are extremely close to your head. PROS: Great sound, Lightweight, excellent noise-isolation, and no noise leak. CONS : Unbearably shallow ear cups! There is about a centimeter of depth to the ear cups and causes the outer most part of my ears to be pressed upon by the mesh covering the speaker (not the ear cup) and ache after about using them for an hour or so. I am a software developer, so I wear headphones about 80% of my day, so you see why I have an issue with this.",
        "I bought these for the girlfriend to use at Starbucks when studying. She is not a fan of ear buds. A warning though, be advised that the cord is real long. We found a little thing online that allowed her to wind up a portion of the cord to allow it to be more manageable. She said the sound is great, and she listens mostly to Naturescapes while studying.",
        "Most comfortable pair of headphones I have owned. The sound quality is great. Big over-ear headphones always sound better then smaller ones and much better then in-ear ones. These sound a lot better then earbuds I have which cost close to $200. Of course, they are probably not ideal for listening on the go inconspicuously but they are great for watching movies, listening to music, or playing games late at night without getting sound complaints from your neighbors.",
        "I have a good track record with Sennheiser headphones having owned several pairs in the past. I enjoy listening to many different types of music and I gave this Model a good work out. I mainly use them with mi ipod and overall they sound pretty good for the price. My only complaint would be how the bass sounds. At times the bottom end sounds a little boxy and is not as clear as I would want. Other than that they seem to do a good job. If you are looking for something in the way of a low cost headphone you could do worse as I have tried several other manufacturers.",
        "For $25 these are a great pair of headphones. PROS: - Comfortable to wear for long periods of time - Cancels outside noise well (mostly) - Audio quality is good enough to have a new appreciation for games/movies/etc. CONS: - They don't really get that loud (as others have said) - Not a lot of bass. - If you don't take very good care of the cord, it twists in on itself easily THINGS TO NOTE: - The cord is very long - Cord for each headphone (v-shape) Overall a great pair of quality headphones for anyone who's tired of earbuds and wants something a little more substantial.",
        "For the price, this is a pretty good set of headphones. First, they're comfortable. I have a pretty big head (no ego jokes, please) but they fit well and unlike other over-ear sets that I've tried, they don't make my head sweat. For those of us that are casual listeners (i.e. We don't need to or want to go into depth on how a particular gender's voice sounds when uttering a particular consonant ), the sound is perfectly respectable and clear. Again for the price, they provide everything that I was looking for or expecting, and they do it well.",
        "After reading all the reviews here I guess I was expecting something amazing. What arrived was something that was just....okay. The sound seems 'far away' and they're slightly too large for my head. They're quite comfortable however, but I can't get over the lack of deep sound or bass. I switched my settings several different ways to help achieve a perfect sound, but alas, this was futile.",
        "Lightweight, comfortable and with very good Sennheiser quality sound. They do a decent job of keeping outside noise out and the cord is a good length. Not in the product description is the fact that they were designed with the iPod in mind, that's a bonus for me as that's exactly the use I bought them for. And be advised, there is a newer model of these available for a lower price, I spent 15 bucks more than I needed to:",
        "These headphones are very inexpensive, and with that, they are freaking amazing. If you really love music hook these up to a headphone amplifier and that deep end will come through and the mids and highs are amazing. They are not the most efficient headphones and require alot of power, but once you give them some to work with, wow! I am listening to them right now and I am using them as budget studio headphones and they sound incredible, truly. Give them some juice and watch that low end come through and truly dynamic rich sound.",
        "Lightweight, comfortable, blocks noise, great sound, economical, durable. I use this every day at work in our open design office. It's so comfortable that I lug it around with me when I need to work in a noisy cafe. It's more comfortable and delivers better sound than my wireless in ear buds. I bought this headset four years ago, and it's holding up great.",
        "The best cheap headphones out there, in my opinion. I've bought these a few times now. I love the sound quality and they feel pretty sturdy for home use. Of course there's better headphones out there, costing much more and with much higher fidelity I'm sure... but these are perfect for a klutz like me that tends to routinely break headphones by dropping them, stepping on them, or forgetting they're around my neck and ripping the wires from the jack when I go to walk away! At this price, buy a few pairs (if you're at all like me)...",
        "These headphones work well for quiet practicing connected to my bass guitar amp. They are not loud headphones and require the volume to be raised a bit when I use them with my iPhone. They also have a flat response; definitely not pushing bass tones, nor very bright in the treble, which seems to work well for me adjusting the settings on my amp and effect pedals and getting very close to the same tone when I play through my speaker cab.",
        "For the past 2 years, I've bought these exact headphones. My last pair lasted over a year. When it finally went out on one side, I just came on and bought another set! I would say, for the casual listener who wants comfortable, cushioned headphones, these are the way to go. Affordable, very long cord, comfortable over-the-ear cups, decent quality sound, and I really like the padded top. When needed, I can wear these for hours at a time without any head or ear pain. If this particular model were to be discontinued, I'd go find a pair as similar to these as possible.",
        "Pros: Good sound, never tried Beats, but much better then others I have had. Cons: The cord split down the middle, were you think you will only have one line of cord, but it still works. That might not be that bad, but the cord is really long and having twice the amount of long cord can get things tangled easily.",
        "Good for the price. I bought them because when I searched comfortable headphones these were the first item to pop up and the reviews. Although they are not plush and do not completely wrap around my ear they are the best out of four headsets I the house. My ears do still start to bother me after 30 to 45 minutes of wearing them. They meet my needs for the most part by now but if I could do it over again I would continue to search an maybe pay a little more for more comfort.",
        "Good inexpensive headphone. Hi frequency is around 18khz. The plug can get damaged a bit easily, so I had to put on a Neutrik one. For everyday use and even music, video, TV, computer, it is my go to headphone. Except when I like to do pro audio stuff then I use the Sennheiser HD380. I bought another one for my kids also. Frequency response is actually very good. This is not a Da Bass kind of headphones, but quite clear for a wide variety of listening situations and it is comfortable to use for extended periods.",
        "I bought two sets of these headphones for my kids for Christmas. They are both broken and have had to be electric taped together to keep the flimsy bad together. Avoid unless you are extremely careful.",
        "I'm not a huge sound critic (My usual earbud headphones cost around $5 - $10), but these seem great. I've used them for about a month now. Songs come out nicely, and they have a bit of noise cancelling. The over-ear fits fine on my head and I can wear them comfortably for hours and hours, which was my main desire when buying these. As a college student I study on my computer and play games for long periods of time, and these also fit perfectly into a college student budget. They seem sturdy so far and have withstood a little bit of abuse already from backpacks etc.",
        "These are really nice headphones. They're really good for music and can be really good for gaming as well because of how great it works in portraying noise from a certain direction. For how much they are, you shouldn't expect top tier comfort or sound, but they sound pretty quality and feel nice. Just make sure to adjust the left and right side to fit to your head correctly. 4/5, pretty good.",
        "My husband loved them and used them while working out. They have a super long cord which I found to be annoying when I as a last resort borrowed them for a workout. They are more of a computer set of headphones if you ask me. Great for that or school headphones and really cushiony and comfortable. They are lightweight and durable.",
        "Works for me. Cheap and I don't have to deafen myself to drown out office talk like I did with earbuds. Okay, after a few weeks, this thing is starting to get annoying. It doesn't have a long enough reach to where it's not pushing down on the top of my head in order to reach my ears. Starts to annoy after a couple hours of continuous use, and I constantly have to push it up to an uncomfortable fit on my ears in order to relieve pressure on my head. Unfortunately, the earmuffs aren't designed to fit with the frame pushed to the back of your head.",
        "I bought these on the recommendation from a friend. Pros: - excellent sound quality, easily the best pair of headphones I've ever owned - comfortable - blocks external noises Cons: - had to trash my cheap $5 earbuds after using these - don't hear people at the door until the dog falls down the stairs and starts barking, which is very startling - have about killed myself by tripping over the cord more times than I'm willing to admit",
        "I commute about 45 minutes each way on public transit to and from work. I don't know if you have ever been on the NYC Subway but there are some strange things that happen. However thankfully the rule of thumb seems to have become the bigger the head phones the more people leave you alone. Its the universal signal for \"Whatever you want the answer is no\" Additionally things can get noisy and with typical ear buds I often can't hear anything. Using these I really hear everything perfectly. The quality is excelent and it really does keep the noise out. For my needs these are great. Been using for 3 months with no issues",
        "The title of this review say's it all. I am a hard core audiofile but when I travel to places like Mexico or the Caribbean on vacation I won't be bringing along $400.00 headphones to use at the poolside or on the beach. At a price point of $20. these are really exceptional value for the money. I plugged these into my droid phone, opened-up my N7 music player and listened to a wide range of music encompassing Rock, Jazz, Pop, etc. and I am VERY VERY pleased with the quality of sound. If you are looking for a really solid set of headphones to use with a tablet or smartphone, look no further than these.",
        "Let me put it this way: I'm a guy who loves music, all kinds of music, but has to put up with an ever-complaining Wookie who brings in his ever-complaining friends every week for beer and card games. How sweet it is that I'm able to enjoy my music now and not hear a word from them. Not a peep do I get from any of those fuzzballs, thanks to this great headset. It's like they are a mile away. All I need to do now is get back the CD player the Wookie borrowed, slip in a little \"Bohemian Rhapsody,\" and I'll be cooking.",
        "I have a few of these in the studio...compared to Tascam, AKG and Sony these are them most well rounded in sound and most comfortable",
        "I am very surprised by what a quality product this is considering I got it for about $20. I can hear things in the music I've never had the pleasure of listening to before. I bought a pair of JVC noise-cancelling headphones for a lengthy international plane ride for significantly more and wish I would have known that these headphones do a much better job. When my coworkers start yacking away at stuff while I'm trying to get things done, I just slip these puppies on and there's minimal distraction and background noise. I'm impressed.",
        "For the price, these headphones have a nice sound. They cover the ear properly and are easily adjustable. The cord is quite long. Perfect for everyday use! I'm not sure why people are complaining about the sound quality, because you can't buy headphones for $24 and expect it to sound like you have a front row seat at the opera. I use them to listen to audiobooks from my computer and so far I'm very happy with what I got.",
        "Maybe this is my fault for buying these headphones for my 10 year old, but they broke no more than 20 days after Christmas. He placed them on the floor and who knows what happened after that, but they're broken. I have headphones that have a leather or vinyl band that goes across the top of the head. Because these are made of hard plastic, they could take being dropped on the floor. One of the side's snapped. So, there's only one good ear left. My son did tell me that the earphones sounded great before they broke.",
        "Picked these up for 23.95 paid like 24.69 after taxes got them in 2 days with prime, VERY good headset for the 10-30$ range. Decent boost for music or explosions in movies and games, directionality for listening for enemy movements in game, long wire. Just a great deal the price. Comfort I rate on a 7/10, not the best but still very good, over ear design keeps the ears covered comfortably, head band has a small pad on the top for comfort. I can't give the comfort a 10/10 as I have had better, but also because I have only tested them for about an hour.",
        "The Sennheiser HD201 headphones are great for the price. I have had a few sets of headphones in the same price range as the HD201s, and these easily take the win for sound quality. Now, don't get me wrong, they're not anywhere comparable to a set oforor other higher end headphones. They're over-the-ear phones, and they sit on your head rather than pinch your head so they're comfortable enough to wear for several hours. And they also isolate your ear from outside noise pretty well. They seem pretty well built (again, for their price range) and they should last a few years. The main bullet point is that in their price range, I haven't found anything better.",
        "I had a pair of these that I bought from Newegg, and I loved them. While sitting down on the bus, I accidentally caught one of the cords on a seat and ripped it out, so I picked up another pair here. The sound quality's better than anything else I've used, but my experience is limited to fairly cheap headphones. Comfortable enough I can wear them all day at work over my glasses without problem. They don't isolate sound as much as I'd really like, but I suppose that I'd need sound-cancelling for that. Always been loud enough for me, although I do notice them being quieter than my backup Sonys. Best $20 I've ever spent."
    ]
}