{
    "entity": "Over-Ear Headphones",
    "text": [
        "So I bought this 3 years ago to play ps3 games with it. I had a roomie that would sleep while I play so I had to get something like this. The overall sound and quality is awesome even the bass. While playing games I could hear the explosions and gunshots if I were there. You can even hear small sound effects you wouldnt normally hear before like footsteps creeping on up you. So it's been 3 years and the headphones and receiver works just fine. The only downside is the batteries it came with don't hold a charge anymore. But just some pop in some new rechargeable batteries and your good to go.",
        "These are good quality headphones they seem well built and have decent sound. One thing to remember is these are not RF headphones they work off Inferred sight similar to most remote controls. So no chance of radio interference but if you turn around and goto the bathroom they will most likely stop working. The inputs are nice you have laser, left right audio input and digital coax. The amount of stereo decoding ability's is also nice dolby, dts, ect. the surround sound seems to work well. It even comes with rechargeable battery's and a recharger built in.",
        "I love the surround sound effect you get with these phones. Line of sight to transmitter is irritating, but better than another interference-generating 2.4Ghz device in the house. My problem is obvious if I could show them to you (covered in duct tape). The joint on each side of the head piece (base of the \"Y\") snaps easily. I piece of plastic about the diameter of 4 toothpicks will easy snap if you aren't gentle. Four to five stars if they were more durable.",
        "It worked fine, audio quality was very good. I used it for home theater and to play games, a little cumbersome to set up. Expensive, get it on sale below $150, then it's worth it.",
        "These Pioneer headphones perform as described. I have been very satisfied with these headphones. They do not have any hiss nor other noises - just clear sound as they should be. Battery life (rechargeable) has been excellent and I have not needed to recharge yet. As it describes, you must be iin line of sight to receive sound. Around a corner will not work. They appear well constructed and are comfortable to wear. The muffs fit well and so does the headband. I would recommend them highly.",
        "Have this connected to my xbox 360 via the digital toslink and the digital coax to my directv. Both sound great. Volume is adjustable and strong. No static at all. I use the energizer lithium batteries and they last twice as long as the rechargeable batteries that are included, plus lithium batteries weight twice as less but you toss them when they die as they are not rechargeables. Overall great wireless headphones with good sound. I understand you can use a additional same headphone with the same base fyi.",
        "These headphones are a little pricey but they work very well and the sound quality is fantastic! It's amazing how great the surround sound experience is with headphones! I bought these because my wife often goes to bed an hour or so earlier than I do and this way I can stay up and watch a movie or a TiVo program while wearing the headphones without the sound from the TV keeping her awake. I'm very satisfied with these.",
        "The Pioneer headphones are great for short range. You have to be still to really enjoy it's fullest capabilities. I think they are a bit pricey for what they offer. But they do deliver great sound. I have it hooked up to the back of my receiver with an optical cable. This way I can watch TV and DVD. I think that the technology is near and the perfect wireless headphones will be here soon for those who are patient of course.",
        "I have purchased several headphones and have been disappointed with all of them. These headphones have great sound. They could have softer ear cushions. The worst problem is the lower ends of the headphones cannot be blocked or the sound shuts off. This a is problem when adjusting the volume. Your hand blocks the sensor and the sound goes off as you try to lower or raise the volume. If you are lying on a fluffy pillow the sensors can be blocked also. However, the sound quality is so good. no background noise, you can adjust for the drawbacks. I highly with recommend them",
        "You get what you pay for and these headphones are worth every penny. Sound quality is awesome whether listening to music or watching TV. My TV is also my PC monitor, so I can use them for TV, ITunes, while I'm online, while playing xbox live, etc...Sure they are a little larger than one might like, but the fit is comfortable, and the sound quality more than makes up for it. Also very easy to hook up. Highly recommend.",
        "Like being in the middle of the action. Takes getting used to. I kept moving my head left and right to see what was over there where I heard the sound coming from. My hearing has been diminished due to jet engine noise from flying in the USAF, poor between 2000 and 3000 cycles and almost nothing above 3000 cycles; yet, I had no problems hearing and understanding what was said, much better than in the movies or a surround sound setting.",
        "I'm very pleased with the sound quality; it's bright, clear, and strong even at low volumes. My one complaint is that my ears feel sore after a few hours because of the cushion design. But for shorter periods, these Pioneer cans are more comfortable and better balanced (weight) than my previous pair, the wireless Sennheiser RS-45. Just keep in mind that these are line-of-site headphones, so you must have a clear pathway between you and the receiver. For example, my knees can block the IR beam if I'm sitting on the floor (moving the receiver to a higher position solves the problem.)",
        "I got this product because my hearing isn't what it used to be and I wanted better sound than I could get from TV speakers. The product is outstanding on both counts. A DVD I couldn't understand was crystal clear. The sound quality is awesome on movies with \"big\" soundtracks. The range is much farther than specified.",
        "Alhough I initially had some difficulty with setting the headphones and base station up to work with my entertainment center, Pioneer was able to help me. Now that it's all set up, it's easy to use, has good sound, and does not seem to be vulnerable to interference, blocked signals, etc.",
        "Both my wife and I are hard of hearing but we love the surround sound. Problem is even with my Bose system and speakers we cant hear the words most of the time. These are amazing and you get the full effect of surround in a wireless and comfortable headset. I can wear these for the entire 2 hour movie easliy!",
        "These headphones have essentially the same quality as those that are wired (without the wire getting in the way). Good range and ideal for listening 10-15 feet away from your music or video source. Pricy but worth every penny that I paid at Amazon.com.",
        "Having spent a large amount of time searching for Dolby Digital headphones online, I was a bit disappointed with this set. The most annoying is having to remove the batteries from the head set to place them in the charger in contrast to just placing the headset in a charger. Also there is a clicking sound when the transmitted signal is interrupted or the head set is turned at extreme angles. The sound quality is excellent and the headset is comfortable.",
        "I have always favored Pioneer products because I am usually very satisfied, however unfortunately l find mysel disappointed with this product. The sound when watching a movie or music etc is without any real depth. What disappointed me most was that there was practically no bass which is, to me the most important effect especially with movies in DTS. I found myself using my old faithful stereo corded headphones and even without surround effects the deep bass and sound in general more than made up for it. I am disapointed especially with how much money l spent.",
        "Excellent Dolby sound with either conventional audio or actual 5.1 Dolby. The experience is heard to believe unless heard. Great choice for the serious movie goer who wants to hear and feel the full effects of a Dolby 5.1 movie in bed without the spouse hearing a peep!",
        "I wasn't looking for the best-sounding headphones on the market but for the best-sounding infrared headphones, and I'm pleased with them. The design and fit and finish are rough and they're not extremely comfortable, but they're better than OK in both categories. If they were eaten by the dog, I'd buy another pair. -- In 2012, these died and it seemed Pioneer might have stopped making wireless headphones. Replaced them with a Sennheiser RS170 base station and two headphones.",
        "These were purchased as a gift for my Dad and he loves them! The sound is amazing, the range is great and most importantly my Mom now gets some peace & quiet when watches his Hockey Night In Canada. LOL",
        "We purchased these headphones for my wife, who is hearing impaired. They allow her to hear the television without having to have the volume up too high for others in the house. They do the job very nicely. An added benefit for us is that their surround sound capabilities are very good. She gets all the benefits of watching movies in surround sound that the rest of the family is getting from the home theater system, but at a volume that works for her.",
        "makes my ears sore after a while. Sound etc. is great.",
        "These are my 5th headphones for the tv, and certainly the best, though not perfect. The previous headphones (900 mhz, 2.4, Sony infrared) each had irritating noise. The noise on the Sony Infrared came from my Panasonic flatscreen tv. These Panasonic headphones are very expensive, but mostly serve their purpose. My wife goes to sleep later than I do and I dont want to hear the tv sound when I sleep. The sound quality is excellent and there is no noise. However, occasionally the sounds fades away without apparent reason.",
        "These headphones are wonderful, as they were a blessing to my husband who could not hear the television clearly, until I purchased these headphones for him! Thanks so much!!",
        "Replacement batteries are always out of stock at Pioneer. They are, as another reported, $50 EACH. The proprietary batteries can be found via TigerDirect and one other source, and run about $65 EACH including shipping. A follow up commentator states that any can be used, but the manual clearly warns to only use Pioneer. Note that Pioneer is selling these headphones direct at a new MSRP that is somewhat lower than Amazon at this date. The Dolby Digital and Prologic sound on these is excellent. The Sony and Sennheiser are unacceptably noisy. [revised]",
        "The headphones are outstanding. The audio imaging is perfect. The only problem is a lack of equalization. It seems that the highs are a little bit exaggerated. It would be nice to be able to adjust it either in the headphone or in the transmitter.",
        "The only reason I did not gave this 5 stars is that it lacks a Stand for the headphones, and that you have to take out the batteries to recharge. But other than that they sound great!!!",
        "I love these ! Its like being in a movie theater ! So worth the money and pioneer always makes great products",
        "Wow....Sounds great... Feels like you are sitting in front of a wall of speakers All with dolby encoding. Super nice... Thank You",
        "I like the headphones. My only issue is they are a bit uncomfortable. The sound is great, performance is great. My ears get sore after having the unit on for more than 10 minutes.",
        "This product, in regards to the sound, is as advertised. The only problems I have observed are 1) The cup material is not the most confortable and 2) because of this, prolonged listening is not desirable.",
        "This product is for my husband. Now I can go to sleep and not have to listen to his programs when the TV is too loud. He finds the ear phones comfortable. and likes being able to control the volume if necessary.",
        "It's like listening to a true 5.1 system with the subwoofer turned off. If you DON'T like bass, these are for you. P.s. These were manufactured 13 years ago. Check it out: October of 2001. Don't buy them. They're very old.",
        "I have been using a pair of these daily for seven years. Great sound quality and durability. The thin foam sheet inside the earpiece finally fell apart after seven years. Not a big deal, not even sure I will replace it. Also you need to place the transmitter carefully to ensure line-of-sight to the receiver on the headphones.",
        "Great headset for wireless connection to watch TV or DVD. As long as you stay in front of the transmitter and don't block the signal the sound quality is great.",
        "Cheaply made junk. Worth about $50, not $500. Was notified via email ,a day after I ordered it, that it was NON-RETURNABLE.",
        "Headset is a little tight with limited adjustments. Line of sight can be disruptive. Anything in the way cuts out the sound. Even moving around in the chair can interrupt the sound. Sound itself is pretty good.",
        "Too much static, even with a change of batteries. Look for something else.",
        "I bought these for my husband who watches tv every night in bed... I LOVE THEM! He loves them too. Very good quality and volume.",
        "pretty good headphones, but has some weakness ,they are very weak where the eae muffs connect to the heak band",
        "Left earpiece swivel is prone to break. No replacement headphones available. Don't risk it, I had mine 6 months then broken...poorly engineered structurally."
    ]
}