{
    "entity": "Over-Ear Headphones",
    "text": [
        "i boutght these on impulse due to my crippling depression in hopes that something happy might come of it. My brother died last year and living is different for me now. I put these on with the amp i got and played the sound of silence and cried and cried and thought how awesome he would think it was to hear this song we both loved sounding so ridiculously awesome, i think ive found some odd form of closure in this.",
        "Tried-and-true time proven headphones. Anyone thinking of buying their first higher end headphones this is an excellent starting point and may even be your last pair of headphones you ever buy. Absolutely excellent pairing with my DarkVoice 336 SE tube amplifier and using the IFI Black Label portable DAC amp as a preamplifier into my DarkVoice amp to clean up the audio signal coming from a smart phone or laptop. When you're on the go the IFI Black Label is a portable DAC amp to power your HD 650 when you're away from home.",
        "Sounds great but cheaply made, left side started cutting out after only 6 months. Replaced the cable but it still cuts out when you wiggle it so I know it's a problem with the contact. Even worse, I contacted Sennheiser and they are refusing to replace it just because it's from Amazon even though it's a registered product with a 2 year warranty.",
        "I don't know how many things in my life I have loved without any holdbacks - my dog, my kids and sometimes my wife, but add this to the list! This is appointment listening! You will actually clear your schedule to listen to these! You have to have a proper amp to drive them and hopefully a good DAC to get the right signals, and lossless (or at least CD quality) but you won't know what you are missing until you buy these and use them with an amp....your life will change.",
        "As an audio-video fan with tinnitus (ringing in the ear) open back headphones are great as they don’t create a sealed pressure zone in your ears, and allow sufficient ambient pressure to normalize the hearing experience. Normal headphone usually increase the perception / volume of tinnitus. My tinnitus is not the result of hearing music too loud- I had had it since before the Sony Walkman was invented!- I am so glad to have found this. I take out one star- as the cables connection from each earmug is about 1 inch shorter than most and I can sometimes feel them when moving my head to the side.",
        "HD650 - Absolutely beautiful right out of the box. Plugged it into my iPhone XR with a 3.5mm dongle and she just screams! No amp needed. Nothing but the cheap dongle. Highs are there. Mids are there. Bass is reverberating nicely. The soundstage is full broad and wonderful. Classical, rock, jazz - wow. Depth and breadth of articulation is fantastic. I can hear even the scratch of a violin bow here and the clatter of flute keys over there. Day 2: since I had it, I plugged the HDs into my Pyle-Pro PHA40 4-Channel Stero switcher/amp and it can raise the volume to ear splitting levels without any distortion or flavoring at all. Great little $20 amp!",
        "Started looking for some decent headphones. I tried the Phillips Fidelio X2R, disappointed. Next, Sennheiser 598 cs, very good but still wanted more. Today Sennheiser 650's figuring twice the price twice the enjoyment. Major disappointment, very muddy vocals and flat, I'll be sending them back and keep the 598's. Running McIntosh equipment was hoping to find headphones comparable to my Dahlquist DQ10 speakers.",
        "It's extremely articulate and clean.Very natural sounding, especially for acoustic guitar sounds. Hard to find any distortion. To me, It's better for recreational listening as opposed to the HD 600, which is a bit more clinical. The HD 650 is a pleasantly warm listening experience without having too much bass. Bass is extended quite well and It adds to the articulate nature of these exceptional cans. Sound stage isn't that big, but extremely well defined and to me, that makes up for it. I jumped at it when it went to 315.00. To me this is one of the best values in headphones out there. It holds its own against many models between 500 and 700 dollars.",
        "Very good resolution. These phones are TIGHT on the head right out of the box. You will likely have to stretch them over the course of a few days. Extend the cups all the way and have them stretch out by placing books in between the cups. You can also use a small box. Might as well burn them in during that time",
        "With open back you're not exactly wanting noise cancelling. This is my first open back, high end headphone. I bought a fiio dac (k3) to work with it, since they're hard to drive. I must say, I don't even know why I hesitated thinking about buying these! Every song sounds 10x better than I've ever heard it before. I was able to tell the difference between Spotify extreme quality and tidal's HiFi. Buying the used pair saved me a nice bit of money too! Not even a scratch on the headphones!! They looked untouched.",
        "Best headphones I've ever bought. Clear, bright highs, just the right amount of bass, very comfortable too. Wonderful sound stage. You need a pretty powerful amp to drive them tho. A phone won't do it. You need a dedicated amp. I use the usual Schitt, a modi/magni combination. These were made for enjoying music, nothing else. Sit back and be carried away. Open back too, so everyone around will know how bad your taste in music is.",
        "I paired the HD 650 with the jds labs Atom and jds labs Ol Dac and the sound is superb! I’ll admit that the HD 598’s have a more “fun” sound and slightly larger soundstage, but the 650’s have more detail and warmth and will put you into a dream world of euphoric sounds. I use the 650’s as a daily driver and they will probably be endgame for me as far as mid range and hi end headphones go. Chi-fi has become a new interest for me after I purchased the Blon BL-03 iems.",
        "After moving from a house to an apartment I decided to retire my Grado SR80 headphones (an excellent bargain) in favor of these for more intimate higher-volume listening. The Grado's are now dedicated to my computer and smart phone. I'm driving the Sennheisers with the headphone amp of my Marantz CD6006 CD player--also with the headphone amp of my Cambridge Audio CXA60 amp--and loving it. They're much fuller-sounding than the Grado (to be expected at three times the price) and I'm more than happy with my purchase; they complement my excellent electronics very well and take the edge off digital sources. I can't see wanting anything better than the Sennheiser HD650.",
        "Unfortunately for me, even at 56 years old, I have ears that can hear the all subtle nuances of how music is recreated by the best speakers and headphones,which means that I'm doomed to spend about $1500 on some HD800's or Grado's of similar breed. That said, these HD650's are really quite nice. At 300 ohms, they require a pretty solid headphone amp to shine, one designed for a 300 ohm load. They start out pressuring your head fairly strongly, but relax over time. They get more and more comfortable with each use. They sound smooth, spacious, and full.",
        "For a spendy headphone it delivers on quality. These are my preferred phones for listening to music and hobby mixing. Great for gaming as well for extra comfort for lengthy sessions. Note these need a little extra juice for louder volumes so a headphone amp is needed to drive it to full potential. This is my first open back and I enjoy the breathability effect it has for a less in-your-head sound that closed back tend to trap you in. The bass range is much more clear and natural it seems as well. Great reference phones for many applications.",
        "No surprise, they sound amazing for $300. Warm sound with great extension & pleasant soundstage. Very comfortable after getting used to the increased caliper pressure. Solid build great looks. For dynamic drivers these do a very good job of imaging & definatley earn their legendary status.",
        "I use these headphones for mixing and mastering. They have phenomenal accuracy and are the most comfortable headphones I own. They are open-backed, so they neither cancel noise nor even isolate you from noise. The flip side is that bass is accurately reproduced without forming headache-forming standing waves in-ear. Do not purchase these headphones to use in a noisy environment or to record vocals where you will need to ensure a lack of bleed-over from the headphones into the mic. Instead, go pick up some closed-back Sony 7506s.",
        "The sound quality is amazing from highs to lows everything is crisp an clear. You can pick up the individual sounds or instruments. Super comfortable, I can wear them all day at work. The open back design doesn't provide really any noise cancellation, not sure why that is listed as a feature. I can hear quite a bit of ambient sound unless I turn it up super loud, when it is super loud people can hear what I am listening to. I love them and think they're great, however, if you're looking to isolate yourself in a bubble these may not be the headphones for you.",
        "I've mostly only used lower end Sony and Philips closed, on ear headphones. I love these. The sound is beautiful and clear while also being extremely comfortable to wear for extended periods. Assuming you don't sweat as much as me, you'll never want to take them off :p As a newbie to higher end audio equipment, I bought a somewhat cheap DAC/amps, the FiiO E10k. As I understand it, these headphones will scale with higher quality amps. Perhaps if your interested in the 650s, you should spend a bit more than I did on a higher quality amp. Regardless, I'm very content with these. I'm fairly certain I'll be sticking with Sennheiser headphones from now on.",
        "Wow! These things are so transparent, without at all sounding dull! Nice, spacious soundstage, and very respectable bass response, especially given their open-back design. I use Sonarworks Reference 4 to EQ my headphones and monitors to a flat sound, but I’m perfectly happy using the HD 650 with my portable player without any correction. I don’t have a perfect ear, by any stretch, but I’m pretty picky. If you want to hear your music the way it mixed in the studio, I haven’t found anything better... especially in this price range!",
        "OMG that vocals on this are amazing. The openness is good and the bass is great. I really like these phones for about any kind of music. But if you like vocals that give you goosebumps, these are the perfect headphones. They are warm and have a more natural sound. Bass is great on these, but I find the sub bass slightly lacking. I also wish the sound-stage was a little wider.",
        "I bought a Schiit Asgard AMP and Bifrost DAC at the same time and I am using Foobar2000 as my player. It took me one day to set up the Foobar tailored for my listening and this system with these headphones are just fantastic. And since they are new they will only get better after the break in period. Reminds me of my past 1974 Marantz System with my Infinity Speakers, only with headphones. For the best listening enjoyment I am using mostly .FLAC cut from Vinyl. Update: Between my many high end headphones, these are best by far, Beats any Japanese headphones and I will not even argue with you about American Headphones, these are awesome",
        "I have 2 of these (for summer/winter homes). They are indeed superb headphones. Alas, in BOTH, the right connection has become erratic and garbled, music overridden by static. The problem appears to be in the phones rather than in the connecting cable. Five stars when working, reduced to two stars for failing.",
        "Just got these. I listen to a wide range and variety of music and these are AMAZING. Every single song is a euphoric experience and almost orgasmic. So crisp and clear. You can turn it up loud and there is no blasting, if you are some one who wants to get lost in your music and absorb the sound these are for you. Super comfortable, your ears don't get sore. You could wear them for hours. The cord is VERY long and thick, just and fyi. But I don't even care. So great. Highly recommend.",
        "I am looking for reference studio headphones for my music room and open back cans will help me mix and master. The HD 650 are no doubt quality headphones, but they have a muted sound. If you are just listening to music and could adjust your highs and lows, I would think you would be very happy with this pair. They clamp tightly to the head. Very tight! listen up headphone manufacturers, the first one to allow for a more customized fit is going to have a best seller on their hands. No two heads are the same! Let us adjust the pressure on our heads! Ourselves!",
        "The sound is amazing, the comfort is great. What more could you want. I did purchase a DAC alongside these and regret buying a cheap one. If you're going to put in the money for these boss headphones, put in the money for a solid DAC. I had VMODA's before, and they just didn't fit over my ears very well. Sound quality was pretty good. Bought these and am very satisfied. Bass could be a little stronger, but the sound is super clear and I can always boost bass with programs later. I've had these for like 4 or 5 months now and intend on using them for as long as I possibly can.",
        "I thought I knew good sound until I bought the HD650s. My Bottlehead Crack OTL hasn't arrived yet, so I plugged these into my Rotel RX-1052 integrated amp and fired up some Spotify on \"extreme\" quality setting via AirPlay as a trial run. I've been laying on my living room hard wood floor for 2 hours listening to every kind of music whether I like it or not... and this is far from the best quality setup. These headphones do that to you.",
        "After months of going back and forth, I finally clicked \"check-out\" on these Sennheiser HD650s. They are truly phenomenal headphones. I can hear details in my music I have never heard before. In my opinion, the only way you're going to get better sound quality than this is by spending thousands of dollars. If you're considering them like I was, just do it. They will change the way you hear your music.",
        "Best!! You can't go wrong with these. They will bring your music to another level above any type of \"Beats\" (low rent, over priced lower quality sound). You will want to re-listen to every single song you have once you hear what these cans can do and allow you to hear. If you want to just walk around, these have a practically perfect audiophile sound so ppl outside the house should get some regular stuff. I can go into deep detail but it makes little difference to most. Perk #1... you will get to own one of the undisputedly best headphones ever made. Do some research.",
        "I have been a devout Bose headset user for many years listening mostly to classical and jazz. After upgrading to a Rotel RA-1572 Amplifier with Bowers and Wilkins 705 S2 speakers recently, I decided it was time to explore some other headset options. I'm really happy with HD650 for both sound quality and comfort. This is very high end technology which doesn't leave much room for disappointment. I was holding out for a possible upgrade to the HD660S but I have been listening on Spotify through my Roku for a few hours now and those thoughts have evaporated.",
        "Was going back and forth between these and the HD600’s. These have a slightly mellower sound on the upper end. Easier to listen to over longer periods in my opinion. The HD600’s were very bright on the upper end, wore me out.",
        "My last set of Sennheiser headphones are 30-yrs old, still work very well but don't reproduce the heavy lows of my new symphonic metal, so I bought this 650 series and am well pleased with the rich sound. I'll give the old ones to my grandson. These do not have noise cancelling, a feature I do not require, however they have open backs which keep my ears cool and resist blowing my ears out.",
        "The headphones are fantastic but the package was opened in the box and was sloppy when put back together. It looks like someone had been using it Not cool",
        "Wanted to replace my DT 880 PRO's, but there is absolutely no comparison. No presence, bass response 30% what it should be. SO disappointing. Amazing to me how personal headphones are, reviews in my opinion are useless until you try them in person.",
        "Best sound quality i've ever had in headphones. My only complaint is for $500 headphones they have a cheap and flimsy design for the cable connection to the actually headphone. I've had these headphones for nearly 3 years now and I've gone through 3 different sets of cables. They all fail. Every time I get the Sennheiser branded cable replacement specifically for these headphones.",
        "With the perfect dac/amp you’ll soon love these headphones. I ordered both HD 600/650 and i gotta say that the 650 brings out the life in the music. You’ll feel like you’re in your own world. I admit the Hd 600 brings out the vocals more but the 650 overall experience is alot more enjoyable. I listen to edm music. I do enjoy vocals myself and stilll choose the 650 over the 600. Will be returning the 600.",
        "Gaming head sets are a hype. Spend the money on a good amp n headset and hear the difference. Totally different experience from triton, turtle beach and Logitech.......my audioengine d1 dac with matrix m-amp work amazing with this headset, I do require the gain boost setting on the amp though. These headphones are no joke, they do require a good amp and I personally feel the matrix m stage barely fullfills the power requirements for these hd650s. I've started down a road of collecting different headsets. So far i have 2, hd650s and jvc livebeat imported from Japan. Looking at akg next and a higher grade amp and dac. Really once you go down this road theirs no turning back.",
        "This are for music mastering, not your high fidelity usual headphones, if you buy them to listen your playlist songs you’ll hate them, now, if you’re a producer and need the true flat line for better reference in song mastering this are a dream come true for the price.",
        "I am retired and am listening to a wide range of music. I had a cheap set of headphones, and bought these as a retirement present to myself. The sound is fantastic. I can definitely hear more aspects of the music I listen to....pure enjoyment. These are very high quality and worth what you pay....would highly recommend these! They are very very comfortable to wear.",
        "*Powered by the Schiit Magni 2/Modi 2 Pros: Mids are the best I've heard from any headphone Wide and expansive sound stage Very comfortable after breaking it in Very rich bass Dark, warm, and silky smooth sound Excellent customer support Very moddable Cons: Bass might be too powerful for some The ear cups are too shallow, your ears WILL touch the drivers \"Slow\" sound (Very relaxed sound, this can be a pro or con to some people) some people refer to this as a \"veiled\" sound",
        "These sound awesome! I definitely recommend you get a decent headphone amplifier to really drive these, otherwise you might not be happy about the volume output. If your really mainly into bass then these might not be for you. I also own a pair of the Sony xb500 big bass and that is what I would recommend for bass. That being said these headphones have a decent enough bass and amazing mids and highs. Get them now! You won't be disappointed.",
        "So far I love these headphones! Don't misunderstand, I'm sure if I spent thousands I could find better quality but for this price point they are completely worth it. The sound quality and the noise cancellation is wonderful. Since I'm in the music business I need good quality headphones not only for myself for mixing & mastering, but for those I record to be able to play there parts! Bravo!",
        "So nice sounding. They come with a very long cord, 1/4” to 1/8” adapter, and a nice box. I paired these with a Dragonfly Red dac and ifi silencer 3.0. I am using an iPhone X and sometimes iPad with Qobuz studio. Which allows up to 24bit 192khz playback with the dac. Listening to Sonic Youth in 192/24 through the HD-650’s sounds incredible.",
        "I bought these after going through two \"gaming\" headsets and I will never go back. Advertised gaming products tend to skip out on quality for looks and lights and it's just not worth it. Take care of these, and they will last 10+ years. They have shown their value. Quality of sound is also leagues ahead. Cannot go wrong with the investment.",
        "I cant describe what it was like listening to these other than absolutely sublime. I can honestly say the bass was nice and full but not over bearing the hies were as crisp ans winters breeze and the singers was vertically spiting in my face full and vibrant. They were Warm, Crisp, Flat and Sharp all at the same time. there is no other way to describe it. These are Audiophile Headphones!",
        "These headphones are my first open-back headphones and they are unbelievable. Listen to your favorite song and do an A/B between these and what you are used to listening to. You will be blown away by the difference in detail, presence, and clarity. The bass is pretty good, but if you're looking for headphones to rock your head with sub-frequencies I'd look elsewhere.",
        "Been using these cans over a year now. I push it with an Asgard2 and a D1 dac. Have done only 200 hours so far so the best is yet to come. These are definitely audiophile grade and Metal sounds amazing on these. Jaw dropping clarity. Its definitely towards the warmer side and the base is very pronounced - but not in an overpowering way. Being an open back headphone the entire sound leaks out and in my case, wife hates it. But my god these cans sound good! Even for death metal. I would recommend it - but make sure you choose the correct amp.",
        "Sounds great. Cans are too shallow. Maybe my ears stick out more than average but the cartilage of the top of my ears presses against the drums (?) of the headphone and it gets claustrophobic after a couple hours. I researched about getting some thicker pads but I read any aftermarket pads would mess with the sound too much.",
        "I bought these for my husband as a gift after doing some research. He loves them (and this is from a guy who doesn't make things up to be nice). Neither him nor I knew about open back headphones, so I did more Google research beforehand and was able to at least give a basic explanation. Thank you for still having wired headphones for us old people with stereos. :)",
        "These sound exactly like the 35$ headphones I owned. I guess I'm not an audiophile. I thought I'd splurge & buy expensive headphones for once but unfortunately they don't sound any better. A 330$ mistake. Oh well live & learn.",
        "still going strong after 8 years - still one of the best all round headphones - have replaced the ear pads & cable - a lot more selection out there now in this price range - but these Senns' are hard to beat",
        "Everyone has different needs, different budgets. I can only say this is Sennheiser - excellent sound. Really like it - it was what I wanted and what I was willing to pay. What I can say to everyone is you can wear these puppies for hours and hours and they are still really comfortable. For people shooting/editing this alone makes them worth the money.",
        "Super sound , keep in mind these are diffuse field so it will create an extra wide field which might not translate to mixes. None the less pretty flat eq response, bass a bit pronounced, highs slightly cut, mids are very nice.",
        "Wanted to buy a decent pair of open backs for the first time to use for mixing. Did a lot of research, read a lot of reviews, and all the great things stated about these were correct. They produce sound as though you are sitting in the middle of a concert hall. Every nuance in the recordings can be heard. Very comfortable to wear for hours at a time. I can see and HEAR why these are considered the standard in recording environments.",
        "They're just a bit too tight for my ears. But that's my personal issue with headphones in general. I'm sensitive to the slightest bit of pressure. But the sound is awesome. Some tracks sound muffled simply due to how they were mixed. I am happy with my purchase and believe I made the right choice.",
        "Great sound quality. But the clamp force is like what others have said...a little tight even for my skinny long head. The build quality of the unit is decent but not the best. I find that the earpieces rotate slightly as they were designed to but the torsion between the two rotating things are not consistent (one side feels looser than the other). Hard to describe in words.",
        "I bought these at the same time I bought the Ultrasone HFI-780's. My main purpose was to watch movies with them. I had imagined the Ultrasone would perform better, since it is marketed as a surround headphone. However, I'm sold on the Sennheiser. Noticably better detailed audio. It actually sounds like surround. Plus, it's phenomenal for music. Like, you hear sound details and instrument separation in incredible ways. It has made my old music sound new again.",
        "I have had these headphones for years now. They sound perfect. Perfect. I still have some old Sennheisers and I used to have Bose and Beats. These sound best of all of them. The Bose were pretty close to these, but I think the HD650s simply have better clarity and balance. An headphone amp is not necessary, but it does help.",
        "Very good value for money. I love how much more details one can hear while listening with this headphone. It has very good sound stage. Unreal imaging. It is very comfortable. Is it worth stepping up from the hd hd 598 yes as long as one has a decent amp. I would suggest getting an aftermarket cable because it is so long. It would be worth with it.",
        "I like everything about these headphones. I can't believe I procrastinated so long before I got them. I'm not going to get into the technical stuff, there enough of that on here. Just buy them before you can't. They sound better everytime I listen to them. I'm still searching for the dac/amp that really knock it out of the park for me. I own a few different amplifiers, that they sound unbelievable with, but I know there's a better one or two.",
        "Yeah these are awesome, I have no idea why they have a star rating for noise cancelation for these being they are open back headphones. That being said this is a great next step in my quest for pure tunes turns out it works for Overwatch very well also. Not great for recording though since my mic is picking them up but that was not what I was planning to used these for. Trying with a DV later to see how much we can alter the signal and also because tubes are just cool.",
        "I'm not an audiophile by any means, but these headphones are amazing. The price scared me but I took the chance anyhow based on the very positive reviews. I do not regret it! Can wear these for 2 hours at a time with them not hurting or overheating my ears. Listening to old music and hearing nuances that I didn't know were there previously. An investment that I wish I had not waited so many years to make!",
        "I have hearing in one ear only so I cannot comment on refined aspects of sound quality ; these phones sound good to my one hearing ear and I greatly appreciate the ability to hear the doorbell, etc.",
        "As noted by most reviews, great sound and detail and really needs a proper amp to get the best sound out of these. On your average un amped headphone output, these will likely sound dull and lifeless. If you already own a set, make it a goal to get a proper amp to compliment these.",
        "Seriously, if you're even slightly considering buying these, buy them. I have never had so much fun listening to music in my life. They are incredibly clear and the frequency response is phenomenal. I've been using them hours a day, almost everyday, for the last year and they show absolutely no sign of wear or degradation. They sound just as jaw-dropping when I listened to them for the first time. They are open back, so best not to wear these in public as everyone near you will hear what you're listening to. But seriously, buy these now.",
        "Did not come with display box, the plastic feels cheap, there is no Left Right indication on the headphones. This product is a joke compared to the old version.. very sad.",
        "No sealed packaging, cardboard without any foam. Not typical packaging for $400 headphones. Even if it’s real, how can you tell if it’s a returned item? It’s says sold by Sennheiser Pro Audio. I’ll likely return them. Update: I called Sennheiser and they verified the serial number as authentic. The sound is incredibly clean and distinct. I'm hearing songs I've listened to for fifty years in a whole new way. Well worth the money.",
        "Have had these for years now. When paired with a good DAC and proper PC settings this is the best headphones hands down. These are the best headphones that I have ever owned.",
        "I have had these headphones for over a month. listened to them almost every day usually up to 2 hours at a time, and i love them i wish i could get this sound in a closed back for when I'm not at home",
        "Best headphones I've ever owned. My mixes have noticibly improved. Never received more compliments on my sound design and mastering than I have since I started using these.",
        "I only use this pair of headphones to produce music now. When you produce on these, your music will sound good on all other sound systems. I still use my monitors to listen, but I dont think I can ever go back to producing on them (unless I got a sound treated room)",
        "Would have been 5 stars but my left channel produced a harsh crackling sound when playing low frequencies past a certain volume. Unfortunately had to return them because of this issue. Otherwise, these were the best headphones I have ever used. Highly recommend if you can get a properly working pair. Still deciding if I want to order another pair of these or get something else because I liked them that much.",
        "If you need to work without monitors or need to check mixes. HD650's the way to go. These headphones are great for reference mix checking. They are open, so they'd be no good to anyone needing noise cancellation. If mixes sound good in the HD650's then I'd have confidence that mix would translate to any decent playback monitoring. Since they are open there is less 'ear fatigue' over long listening periods as opposed to In-Ear monitors or closed headphones.",
        "No other headphones I've ever used have had such smooth, crystal-clear accuracy. I've been using these for a few years now, and no others have been such a joy to use. They're lightweight and no-nonsense.",
        "Love them! I had Audio Technica earphones and they broke only a month in. They were cheaply made (but NOT cheap)! I was pissed. Determined to get a different make, I did some research. I found these on a list and went for it. I am so glad I did. They are comfortable, durable, and sound great. There's no colorization and I used to have to take one phone of the ear to record vocals to stay on pitch. But I don't have to do that with these. They are really great.",
        "Was a loyal Beyerdynamic customer but after the last two pair broke inside the cable, thought I would try these. Like that they have e detachable cable. they are not as comfortable as the Beyerdynamic t90's i just replaced but sound as good. I listen to mostly vinyl on a Fluance RT82 turntable threw a Denon x3500h receiver. Sounds pretty good.",
        "Just get them! they are incredible amazing headphones. I am happy with this product.",
        "I have purchased many headphones over the years, but these are hands down the best. Not sure I'll ever take them off, and that is ok with this beautiful experience.",
        "Can't recommend this headphone enough. At $499 it was a bargain. For $315 it's an absolute steal. Using a decent amp and DAC, it rivals and often surpasses headphones double and triple it's price. The sound is smooth and balanced with incredible clarity and detail. The bass is tight and controlled. The sound stage is spacious with great imaging and instrument separation.",
        "Wow!! I got these less than an hour ago and I all I can say is I'm hearing things I've never heard with my Grado 220s or BayerDynamics DT 880 Pros. I'll update at a later time. I'm just astonished at some of the higher frequency items that I've never heard before. Much better than the AKG 701s I just returned.",
        "They say you should never mix with headphones... well, I've been working in sound for 20 years, and this is an exception. I mixed several award-winning short films, albums and commercials with these headphones. I can't imagine using anything else. Super comfortable, and able to be used for hours on end. I would NOT recommend these headphones for the street. I suggest for home/studio use only.",
        "These headphones are some of the closest to studio monitors. They do not color the sound much at all. These phones will have slightly less high and low frequencies compared to many headphones. I got them for studio mixing as the price is so good. Sound preference is very individual and often what one is accustomed to. But with mixing music, headphones should be very close to flat studio monitors. These are at a very good price.",
        "I'm completely thrilled with my purchased, after trying all three models (600/650/700) the 650s are by far my favorite. This is the sound that I was after, I like bass but I also have boom. I needed clear miss and highs with a nice Clea base. That's the 650!",
        "I have now reached the zenith of sublime sonic purity. The Sennheiser 650's are basically perfect. I've never heard music so warm and clear - not too much bass, or treble. I have them hooked up to an Audeze Deckard Amp/DAC - more than enough pure power. If you want one of the worlds best headphones ever made - buy them now. Amazing!",
        "all I can say is these have outstanding sound and feel very comfortable. Would recommend them to everyone; Sorry this is a short review but I have to go back to listening to my headphones",
        "When I put on a pair of headphones I want to get lost in dreams, be creative and disconnect from reality, the HD650’s helped me get there, thank you. To get the full potential of these headphones you will need to buy an amp.",
        "These headphones have officially blown my mind. I have them attached to a xonar stx and set the impedence to 300-600 ohms. It has truly changed the game. I upgraded from the senn 558 which had the foam mod done to improve bass response. The amount of clarity, especially in the realm of bass and drums, is dramatically improved. Listening to Hendrix, Led, the Stones and the beatles has never been this good. Individual instruments have never shined through quite so much.",
        "Really great quality and hits highs so well it will send a shiver down your spine. I love putting the headphones on after a long day of work.",
        "Good NEUTRAL ALL AROUND, headphones. These are good all rounders with an emphasis on detail. Out of all the Senn 600's these are the most balanced.",
        "These are the best phones I've ever had, and not the most expensive. I record sound and video for a living, and spend hours listening and editing. The frequency response is very even, and the midrange has the detail I need when editing. I use them strictly at my desk, since the open back design doesn't block external sound, and they leak too much for tracking. I find the cups very comfortable, even after hours of use. No break in time was needed for the sound quality I need.",
        "These are wonderful headphones with crystal clear vocals, deep bass, and they are very comfortable even for long listening sessions. I alhave these plugged into a schiit magni 2 which is a very good affordable amplifier.",
        "Not much to say, you can look up all the review on the web. These things sound great. I was looking for something that I could listen to for extended periods while I work that would not fatigue my ears and these are perfect for that purpose. The grado SR80's I had before just had way to much high end and wore me out very quickly. These are much more balanced and with a decent headphone amp they sound great.",
        "These are my favorite headphones that I've owned so far. The make me very happy.. They do need power though. Come correct and these will handle whatever amount of power you throw at them. They're just great, not much else to say.. Sound is, I guess warm, but detailed, full bodied (I'm not good at describing sound)? They're bassy when bass is called for. Treble is not bright. It's smooth, but the details are still there. It's a weird mix that just works, and well. I use these with the Jotunheim amp/dac and this has been a great pairing.",
        "One of the best headphone I've ever purchased, but you need to purchase another Amplifier to enlarge the sound. FiiO E10K USB DAC and Headphone Amplifier is enough.",
        "These headphones have been around a long time and still can hold there own. Rock, Blues, Jazz, Classical; it all works. Great headphones. You won't be disappointed.",
        "This is my first set of open ear headphones, and I absolutely enjoy them for PC gaming. The audio sound for these headphones is amazing, I purchased an external DAC and AMP as my PC was able to produce the quality of sound that these headphones can handle. I would buy this again",
        "I am a musician that studied audio engineering and worked in pro audio sales for several years. There may be other higher priced headphones that sound \"better\" out there, but these have become my daily drivers. The moment i put them on I was blown away by the instrument clarity and seperation. Great headphones!",
        "I love these head phones, I thought I would have to spend over a 1000 bucks to get the sound I like. Not so, I have very equipment to drive them. They are power hungry head phones. No these won't work on an Phone without an headphone amp. I don't use them for that just be aware.",
        "These are open air headphones. If you want noise cancelation, look elsewhere. These sound absolutely real. Boosted boomy bass? Nope. Crisp clean sound at all frequencies? Absolutely! Sennheiser are the kings of headphone sound, and these show it!",
        "I hadn't really had any nice quality audio gear before this. Picked this up along with FIIO k5 and e17k, both of which I recommend. I know this isn't the \"best\" setup you can have, you can go for tube amps, whatever, and spend thousands. But seriously coming from earbuds to this is makes listening to music a whole new experience. The headphones are tight, but comfortable. They are also opening up after a few days, the sound is warm, there is zero listening fatigue. I can't recommend them enough"
    ]
}