{
    "entity": "Over-Ear Headphones",
    "text": [
        "This was a purchase for my husband who doesn't hear everything when there are other conversations or noises in the same room. We are very pleased these headphones have solved that problem. He can also listen and mute the tv if no one else is watching. Wish we had done this years ago!",
        "This is my most regrettable amazon purchase in the past year. Really, do yourself a favor and just buy something else. The wireless technology used by these headphones is terrible for an office environment (I can only get clear audio out of the left or right channel, but not both). Worse than that though, is when all audio stops playing for 1 minute, a loud blast of static comes through the headphones, and stays on until audio starts playing. Absolutely horrible listening experience. I'd rather use apple earbuds than these. Seriously. And that's after almost a year of everyday use. Hopefully, I can still get a few bucks for this thing on Craigslist.",
        "My grandfather has a hard time hearing sometimes and would always have the tv uncomfortably loud for the house to hear. I bought these in hopes that he’d like them and wear them and I’m glad to report he loves them. Very easy operation, there’s a physical switch for power and a scroll wheel for volume, which is essential when shopping for someone who isn’t great with little buttons so big plus there. They sound pretty good, perfect for tv but wouldn’t recommend for music. When he’s done watching tv all he does is put them back on its stand and they start charging and ready for the next day. Highly recommend for anyone buying for parents/grandparents.",
        "Good sound, clear voice for TV. Was really disappointed when it stopped broadcasting after ONLY 2.5 years. The charging light works, so its not the charger. The green light indicating broadcast is out, and all I get is static. When I tried to adjust the tuning dial, still from top to bottom, all I got was static. It's a shame it quit, I'm a regular customer who bought many Sennheiser products...won't be buying these RF headphones again from them.",
        "I've had my TV volume blaring for years due to hearing loss and it was still hard to understand the words, now with the RS120 headphones I can hear TV conversations again, the sound quality is great like in a theater , just what I expected from Sennheiser. I used the RCA /single pin adapter that came with phones and plugged into back of TV. The phone volume is separate from TV volume so I can leave the sound low or muted on the TV without effecting headphone volume. Money well spent. I've had these two day's.",
        "Let me start with the only positive, the sound quality is fairly good once you get the sender unit oriented well to avoid interference. After that, it's all downhill. The headphones are so loose on your head that they can easily fall off when you look down, and I have a huge head! After they fall a couple of times, the plastic that comprises a majority of the frame is so weak at the earpiece connection that they snap off. Mine are now superglued and duct taped together. They still work, though, so they've got that going for them!",
        "Great set of wireless headphones with one annoying drawback. The sound quality is surprisingly good really considering the price, but there are annoying static pops and clicks that go along with it. I still can't believe that a company like Sennheiser would knowingly produce and sell a product with a blatantly obvious flaw like this. It's not really a deal breaker if your only intention is to watch TV or something without disturbing others, but when it comes to more serious applications such as listening to Music... well, it's not exactly a bell ringer. That is unless your listening to old scratched up 78 recordings, in which case you may or may not notice.",
        "Sounds good. Very difficult to set up on my tv. Manual instructions were difficult to follow although they were printed in 12 different languages. . Mostly information was given on an additional sheet of paper in the form of simple wordless little sketches. In order to make the headphones work, it was necessary to purchase additional equipment at a local electronics store to make the connections compatible surg my Samsung smart tv. Had I known how time consuming and confusing setting up these headphones would be, I probably would never bought them. The do sound very good, but the aggravation was not worth the $85 I paid for them.",
        "I use my new headsets every day when watching tv. I have some hearing issues and I can hear at least 95% of what is being said with the headsets. i can also listen to programs at night after my wife has gone to bed without disturbing her by having a program turned up too loud. I really enjoy my new headset. I bought a similar headset for my wife several years ago that is connected to her pc. She listens to a lot of music. She can not only listen to her music all over the house, but also all over our yard as well.",
        "Worst piece of junk I ever bought. I must have owned 20 or more pairs of earphones and this is the first that ever fell off my head every time I move.They do work electrically, but I have no idea what kind of creature they were designed to fit. I had three different people try them on and every one of them had them fall off by just looking down. They've been on the floor so often with pieces flying everywhere, that I have a better pair on order to replace them. Don't waste your money.",
        "I bought these two sets of the RS-120 to give away as presents, though I own a set myself. The reason for the review is that recently I purchased the twice as expensive Sennheiser RS 175 for myself and ended up returning them. They just didn't measure up to the older RS-120, which provided me with a longer range with no dead-spots, even through walls, up stairs, downstairs, etc. With the RS-120 I'm able to walk down the back stairs, bring in the trash cans from the sidewalk, come back to the apartment, wash my hands in the kitchen and not miss a second of the Warriors game. The RS 175 didn't even come close to this range.",
        "After purchasing other so-called hi-fidelity wireless headphones over the years, I purchased these based on the manufacturer's reputation. The sound is crystal clear - so much so that I prefer to wear these all the time when watching movies or T.V. They do require \"dialing-in\" to find the best frequency but considering the superb sound quality, that's a trivial incidental. They are very comfortable but loose fitting so not something you would wear exercising as they would fall off. There is no lag time as in other headsets. The controls are easy to adjust.",
        "I purchased it based on brand's reputation and paid premium over RCA headphone. Turned out it was a mistake. It was easy to connect and set, but sound quality was poor. It is very noisy and volume shifts up and down randomly. If I go to the different room, sound is very disturbed or I hear just noise. I don't know if it is bad design or defective headphone. It goes back.",
        "I returned them. Its wireless technology reminds me of cheap technology from the early1980s. You have to manually tune in the frequency which always drifts and is very annoying to pinpoint. The sound quality is similar to dollar store no name headphones for $2. They are SUPER uncomfortable on my normal sized head. The padding on the ear muffs are thin and the head band squeezes too hard. You would be better off just buying the cheapest no name brand because that is what these are but your paying a premium for the brand name. They do look nice and I like the charging station which is why I bought them but all is moot.",
        "We have been severely disappointed by these headphones. They do work as advertised except for one thing. The left earpiece failed on the first set we had after one year. We ordered a replacement. The left earpiece on that one failed after two weeks. We did a return and received another replacement. The left earpiece never worked on that one so I sent that back too. I know that three failures in a row is probably not statistically significant but anecdotally it strongly implies that their quality controls on their manufacturing process are terrible.",
        "When they worked they were nice i had some tinny wireless headphone from sharper image that lasted 2 yrs of daily use until the built in battery started only lasting about 30 minutes. I thought these would be an upgrade do to the brand and reviews. The sound when close to the receiver was much better than my old sharper image pair which had no weight to them. I'm disappointed these just stopped working so quickly for 115 dollars they should last more than 3 months. Also they fell off alot compared to the cheaper pair and had alot of analog static when at range. they other pair was digital like the more expensive seinheiser 175 and up.",
        "I bought two of them and it appears they simply can not be plugged into my Samsung. I GUESS I missed the part in the description that it said they dont work with modern Samsung's. It seems I may have to make my first Amazon return in 2 years. Update after purchasing  This allows the headphones to work. So far (1 day) they seem to work as advertised. However if you intend to use them for music listening. Dont waste your money, because while they are adequate for tv listening, they are far from high sound quality.",
        "I bought these because my husband likes to turn his TV up to hear what people are saying, but then the other noise in the shows come out so loud, I can't hear myself think. I have no idea how good this product is because no one wants to read the manual to figure out how to hook them up. Apparently, you need a degree. I've even asked the kids, who are more technically savvy, but no one wants to even try to figure it out. If I could just find someone brave enough to help me, I know these would be great, maybe even a marriage saver! Hahahaha!",
        "These are really great headsets - I use them for gaming and television and have two sets. excellent for keeping noise down from the gaming and great for giving me better sound when watching movies/television. They charge up quickly, batteries last a long time and they have great sound. The headsets can also move from one location to another by simply retuning the reception on the headpiece. The only negative thing about them is they come with some pretty thin earpiece covers which I immediately replaced with Sony covers, which are far more cushy and comfortable for longer periods of time.  Highly recommended - Great product - works as advertised!",
        "Good news / (Very)Bad News! Good News: These have very good sound.....WHEN THEY WORK!! Bad News: 1. Sound function is inconsistent and has a lot of static if placed too close to other electronic devices. 2. They fall off of your head if you move! 3. They do not cover your ears, They just press against them, and are quite painful after awhile, especially if you wear glasses. Result: I am looking for a better product, and regret waisting my money on these!!!",
        "I've bought these before fore my elderly parents and they worked well. As they aged the ears deteriorated as expected with all day use so I bought my elderly mother a new pair. This is no longer a good product. The batteries corroded inside and leaked out onto the foam pad of the ear. I was very surprised and thought it was the batteries so I changed them out and they corroded again, within a week. Needless to say, I bought a different pair from a different company. Very disappointing.",
        "I originally ordered the rs 175, but returned them due to WiFi interference causing severe audio drops. I am in my 60’s and find I am having difficulty hearing dialogue in movies and tv shows. These work very well and provide clear audio directly over ear and have improved my tv/movie dialogue hearing significantly. I run these through my av receiver, which allows me to use the headphones and others to listen to surround. I control my headphone volume separately.",
        "This is my second Sennheiser RS120 unit. My first, purchased approximately 15 years ago, is still going strong. I purchased a second unit so that my wife and I could both listen to the television while we exercise indoors. If installing a second unit, it is not necessary to connect the base unit to your audio/video source. You can simply use the base unit as a charging stand and tune the frequency to match the other headset. Excellent product. Excellent value.",
        "As far as noise cancellation goes, I actually want to hear surrounding noises while watching TV, so this set works fine for me. I find the volume control a bit hard to find and use when the phones are on, especially since it is very close to the tuner wheel and easily confused with it. The headphones are nice and light, fit well, and are very comfortable. I am not sophisticated when it comes to sound and I only use these for TV, so for me the sound is really, really good for the price. My last pair of these lasted 8 years.",
        "These headphones work well. Every once in a while the volume goes up or down on it's own but not often enough to return. I wish they could be adjusted to be smaller. I am a women and I guess have a small head. I cannot bend my head forward to read something with them on as they fall right off. But all that said they are good for the money.",
        "I bought these to replace a unit from a non-major brand that is no longer available and broke after 4.5 years. I never had a static issues and it didn't have a tuning necessary. I thought these would be good replacement being a major brand. I get static which is difficult to impossible to get rid of. If I turn my head, static comes back. I have loud popping sound and static at times. Every once and a while sound is replaced with extremely loud static which is actually a health hazard. I bought these to use for online meetings when working from home and not for TV due to earring loss.",
        "This was our second purchase for ear phones. The clarity of voice/sound is totally great. I bought mine a few months ago and tried to talk my husband into a pair. He finally broke down and ask me to order a pair for him. He was so happy he got them, now we both can watch our separate TV's and can hear clear voices and not a lot f back ground noise. Sometimes these show producers think the music has to be louder than peoples voices. Anyway these are a great price and they really really work good.",
        "I have used Sennheiser Headphones for over 30 years and never encountered a problem till now. I have a 5 year old identical headphone that works perfectly, so I am very surprised that this new one has a problem right out of the box. There is loud static popping sound no matter what source is used or what channel is tuned. I'm very unhappy to return this earphone and look for a substitute.",
        "I've had these for about a year now (used exclusively and daily for TV) and I am pleased with the battery life, sound quality, etc. Also a cool feature with these is that the two rechargeable AAA batteries inside can be easily replaced (have not had to yet). I have one minor gripe with these...they kind of go into a sleep mode when the sound is paused and occasionally will not re-pair with the base when the sound starts again...which means you have to unplug from the TV and plug back in. No biggie because it doesn't happen very often.",
        "These headphones worked fine for a few months, then they started cutting out for no reason that I could find. It has gotten so annoying that I am going to buy a brand from a different company. Also, if your house loses power you have to go through a 15 minute process to get the headphones paired up with the transmitter again. It seems to me to be a unnecessary hassle",
        "I bought these to connect to my guitar amp for wireless practice. The audio has no discernible latency and the sound quality is on par with bluetooth headphones. I would call the audio quality better, but there is a little white noise from the analog RF signal. So far my only issue is the base station will go into a power savings mode if I put my guitar down for a few minutes. When this happens, the headphones start blasting white noise into my ears. The base station is plugged into the wall, so this power savings mode provides my no battery savings, and just startles me.",
        "I bought three sets ( one as backup ). They worked for a month or so and then quit working, despite replacing all the batteries. I called Sennheiser on several occasions and despite their literature mentioning a two-year warranty, they never suggested I return them for a credit. They were past warranty with Amazon & after several phone calls, Amazon suggested I return all three RS-120 earphones & charging stations. I did return them & they acknowledged receiving them. In one phone conversation with Amazon, the \"rep, said she would refund me $79.95. It didn't happen.",
        "ORIGINAL 4 STAR REVIEW: Really good headphones. I would give them 5 stars but I've noticed my ear gets kinda warm when I use them for over an hour. UPDATE ON 1-13-18: I changed my rating to one star. I bought a new TV and the manufacturer said these headphones are not compatible with the new TV. The new TV is made by one of the top two manufacturers. I tried contacting Sennheiser customer support three separate times. Each time the person said I need to call a different department and leave a voicemail. I left three messages and never received a response.",
        "One big issue I have with these. Wear them for awhile and your ears (or mine at least) get too hot. Better than ear muffs. For this reason alone I give them 4 stars. Their bulkiness also might be an negative for some or for those who don't want to mess up their hair. Otherwise, these are a great way to listen to a program, at the volume you like, and not disturb those in close proximity. Walk around (within 30 ft in my case) and do things and hear your program uninterrupted.",
        "These were no good. We ordered these for my 84 year old hard of hearing father. The first pair we ordered worked but sounded tin canish and then after a week of use, quit working and only static. So we replaced them and it was a super easy box up and return process, thankfully. Another pair were sent immediately, but they came straight out of the box with the same exact promblem the first set had and we could not get them to work. So this time we are asking for full refund.",
        "I slipped the headphones over my head, and got ear pain right away. I wear glasses, the headphones pressed my ears against my eye glass arms and hard against my head. That caused pain on my ears and head under eye glass arms. There is no adjustment for width between ear phones, only up or down. I wear a 7 3/4 hat, not a thin small head. These might be ok for some people but it really hurt my ears, one ear still hurts hours later. Being there is no adjustment for width i can not wear them, If you have a small or narrow head they may be ok for you. I had to return.",
        "I have owned many wireless headsets over the years due to long time hearing loss. This is the most expensive of the the lot and I had hoped these would be a better choice. Unfortunately the frequency seems to drift and you are constantly trying to adjust it back to get the volume back. The adjustment wheel is very sensitive and a pain to operate. If the audio stops the unit times out and goes to white noise. I have used ref and infrared units some costing twenty dollars and NONE of them had these problems. Don’t ever try and tell me you get what you pay for. Life is not that simple.",
        "Purchased these for my father, helped him install them. Just make sure that whatever you are hooking them up to has some kind of audio out port. Because these go on the ear and don't cover it there is no noise cancellation, sound quality is decent, nothing special. The volume control knob might be difficult for some to use. I thought these weren't that comfortable and overall kinda overpriced, I own a wireless headset for my xbox that is miles better than this and I think I paid around $100 for it. But my dad is happy with it so that's what ultimately matters.",
        "This is the third I've bought, so obviously I'm happy with them, now all my TVs have these as an attachment. They are supplied with adapters that would cover any hook up situation I can imagine. The sound quality of most flat screen tvs is quite lousy, particularly noticeable to me with voices. Sound quality with these headphones is crisp and clear, both for music and voices. My first purchase is about five years old and I just had to replace the rechargeable batteries. Actually, I bought them, but the standard batteries just keep on going, so I've not bothered to install them.",
        "Work perfectly, exactly as described. I have had zero issues. The battery has a long charge and sound quality is excellent! I can actually wear these around the house cleaning as I listen to a talk/sermon/podcast on YouTube. Great buy! And yes, they work very nicely with a “surround sound effect and clarity” to watch a movie at night and not bother sleeping people!",
        "I am slightly hard of hearing. I find the Seenheiser ear phones very helpful because my wife complains that I turn the TV volume up too high. Plus, I have insomnia, and using the ear phones I don't wake the whole house at night. I do feel that I get a better stereophonic reproductions when compared to the regular TV. I did have a wrinkle when I bought a new TV which required digital connection instead of digital. But I found a work-around.",
        "We bought these two and a half years ago, when they were $125+tax. For the most part they've been pretty good, but they are finally starting to wear out. I thought about simply getting more of the same, but decided that I'll try a different brand this time. So I'm busy looking at the reviews for competitive models. Bottom line, it's a mixed bag: On the one hand I don't think you'll be making a mistake if you go ahead and buy these, but on the other hand I can't give an unqualified glowing recommendation.",
        "I really like the freedom being wireless gives me. My TV doesn't support Bluetooth so I needed a different solution. This product is working great. Sound quality and comfort are excellent. I had difficulty at first because I found the headset only played static when I first turned it on. However I now understand that you have to wait until sound is being played by the Transmitter. Wait for the green light to turn on before turning on the headset. All problems solved!",
        "When they work the sound quality is just okay, no bass--expected more from this company. They tune fine to our main TV but we can't get them to work with our new bedroom TV. They fall off your head with any movement. There's no cupping of the ear so you can hear them while they're on someone else's ears, even across the room. If you fall asleep and TV program shuts off there is a terrible, loud, ongoing static. We bought a separate bluetooth set and they work with both TVs, have better sound and comfort. These were a waste of money!",
        "Only two minor issues. 1) If you put your TV on pause for more than about 15-30 seconds turn your phones off. You will get loud white noise if it's not receiving signal from the TV. 2) They're not for listening to the TV while you're exercising or doing housework, because they don't stay on your head very well if you're moving around a lot. They're fine on the couch or calmly walking to the kitchen. They sound fine, the analog tuning is a bit odd, but all in all, this is worlds better than running a wire under the rug (or on top of it)! This is the perfect solution if your TV isn't bluetooth enabled.",
        "Using these wireless headphones to cut the cables from a rather complicated setup I did through the ceiling from a heaphone amplifier after people tripping on wires . This is much safer and conveinient . Pick up and listen ( easy charging via the cradle ) good signal so far . No dropouts . Easy setup .",
        "These headphones have helped save what little sanity I have left. The DH suffers some hearing loss, bless him, and he loves TV with lots of sirens, explosions, car crashes, etc. These headphones allow me to do some activity in the next room without thinking that a police car has just crashed into my living room with sirens blaring. He can turn the TV volume down and the headphone volume up as loud as he needs. I can even go to bed without having to hear some demi-god save the world from the living room. They are FABULOUS!",
        "Did the job, but not well. Biggest issues were that you have to manually adjust the frequency until you hear no static. And that dial is loose, so it never stays on the same setting- you have to adjust constantly. And I’ve never had to adjust at all on any of my previous wireless tv headphone sets. It was never even an option. Also, the headphones are bulky and don’t adjust to a decent fit. At the smallest the padded ear cups pushed on my ears so much that the posts of my earrings pinched my head. But just one smidge larger, the headphones kept falling off my head. Shop for a Bluetooth set instead.",
        "Just received my headphones. As a plus, they work (unlike the first brand I tried). The sound quality was nothing special, but I don’t even care so much about that. My issue with these headphones is that they don’t enclose your ears. The headphone speakers are flat. I am using these to watch tv in bed at night, so that I don’t disturb the wife. Kind of defeats the purpose if sound is coming out of the headphones.",
        "Usually, Sennheiser is a great name in pro audio, but these aren't great. The headset does not have a very vigorous clamp, and these will fall off your head if you're not careful. You might even get a pain in your neck like I did trying to make sure they stay in place. Next, these things operate on the ancient 900mhz band (my fault for thinking this would be acceptable); the overall sound quality is fine except for the annoying interference that pops up regularly. along with the periodic drops in volume (even when you think you have them dialed in). You're better off getting a Bluetooth headset and Bluetooth transmitter, I think, for your wireless headphone needs.",
        "This is my second pair and they are usually better than just my ears alone. I do have an issue with the charging cradle though. Seems the headset is not heavy enough to sit well enough on the cradle to make a good connection. If I don't set something (a paperback or tube of sunscreen) on them when I return them to the cradle, the next time I use them they might work for an hour or so. And in saying that....when I set them on...all lights come on like they should but they still won't work. As long as I use \"my solution\" these are a great help!",
        "Low cost ,good quality but ear pads supplied are awful and uncomfortable compared to my much more expensive Sennheiser pair.{now spouse and I have one each.]. So Amazon to the rescue when found after market ear cups that fit the new model with complete comfort.It added $25 to cost but---- Also--As we now have 2 sets to hook up could not take advantage of stereo and now experience only mono on each pair...but we control our own volume---great.",
        "May 23rd I received these headphones. I was excited to have them as I’m hard of hearing and like to watch TV in bed at night and don’t want to bother my husband. I e had nothing but problems with these headphones. Now I can only use them for about 2 hours before it sounds like I’m going through a big wind tunnel. Not pleased!",
        "I've only used this for three hours and so far I love it. It is lightweight and doesn't float around on my head and slip off. I love the wireless charging. I am 63 years old and not tech savvy, but for my purposes, watching TV while my husband is gaming, it does a great job. The sound is so much better than the headphones I was using. I hear sounds more like when I used the surround sound system watching tv without headphones. He did order me the Brainwave Memory Foam earpads to cover the earpieces and they've made them very comfortable.",
        "I have another Seenheiser set hooked to my stereo so knew ahead what I was buying. I bought this set for my desk top computer and love it. The sound quality is amazing and after trying some of the more expensive brands I don't think anyone would be disappointed with these. Everything is crystal clear and good base sound. Range is around 100 ft and good thing no batteries to worry about. Not blue tooth but just plug into computer and your set for you-tube, movies, cd's or what ever listening to the finest music",
        "Took me 2 years to figure this out. The intolerable hiss and noise and continuous slippage on RF tuning can be remedied by hours of reading the Amazon reviews, using \"hiss\" as the word of the day. Moving the base, discovering the switch at bottom of base (on front), and playing around with the tuning, will leave you with a tolerable level of hiss--not much more than what you would get from a well-worn vinyl. However: if you are looking for crystal clean digital sound, then skip the RF option completely and get wired or bluetooth headset.",
        "These have been around many years. I've had my pair for at least 3 years. While still working as good as when I bought them, I am often frustrated that tuning and volume control are on the same side, the volume above the tuner. The tuner must be carefully adjusted for a clear, static free signal. Too often, when adjusting the volume I'll brush the tuner and the static ramps up. Otherwise, good for TV watching and good for the price. Plenty of volume.",
        "Like many other people, I wear this to watch TV so my wife would not be annoyed. The power supply seems to be a problem. It stopped by itself and then recovered by itself a few times. Today it gave up again and did not recover. I tested with a multimeter and the output from the transformer was ok. So the problem may be an internal one. Another reviewer commented that this headphone fell off his head very easily, I concur. It has served the purpose for 4 years, I gave it four stars. I would consider to buy another one.",
        "Two TVs, two RS 120s, causes interference between the two headphones. A headphone in the living room can pick up transmissions /interference from the RS 120 transmitter in the bedroom. So, you may not be able to have two people watching and listening to two separate TV programs in separate rooms. The headset is not able to tune out this interference. The work around is to disable the audio input to the RS 120 that you don't want to listen to. Of course, if this is the one your Wife is currently listening to, back in the bedroom, she get kind of irritated!",
        "I purchased these to replace my old 130 model . The design is very similar and appear same as except the 120 has a smaller ear pad, and a flat surface to fit on the ear. The 130 fit around the ear, with a doughnut type pad to cushion the contact with the ear. The 120 is flat. Not made for comfort if worn for more than a few minutes. It does work with the 130 base. Pad about 1 inch too small in diameter. It literally is ON EAR.",
        "We recently needed to replace an old set of Sennheiser RS110 wireless headphones. The RS110s had finally started to wear out after giving wonderful service for many years. The Sennheiser RS120s are basically the same as the RS110s except for the addition of a cradle based charger on the base station (the RS110s had replaceable rechargeable batteries). We had briefly flirted with replacing the RS110s with a pair of Sony RF wireless headphones. But after trying the Sonys, and finding them beset with crackles and interference problems, we went right back to Sennheiser. In our environment the Sennheiser wireless headphones have been faultless, great sound and no reception or interference problems. RECOMMENDED.",
        "I really don't understand why this product is getting so many good reviews. If you like having to constantly tweek the tuning I guess they work. The charging cradle is \"iffy\". The worst problem is you have to tune them in like a radio station. There are SO MANY better products out there. Sony makes a great set of headphones that work great with no tuning necessary. Sent these back. They were for Father In-Law... way too complicated.",
        "My opinion, Very hard to get to stay on your head, may try cupped earpads and see if that helps. Have them on and bend over, they fall of for me anyway. I have a headphone set I use on X-Box, they hold just fine. They claimed its good for 100 meters, I believe, if I can get 30' I'm lucky, but I do have aluminum siding on my house. And the tuning for me is difficult, I get it locked in in the living room go to the kitchen and I have to retune, might be me??",
        "I bought these in April 2014 and they just died. So I'm ordering another set. They are lightweight and fit comfortably over my ears. If they start to \"itch\" you can move them up or down. They charge up overnight and sometimes they last all day. And I probably use them 10 hours a day (retired and a political junkie). Not too tight and I can wear them around the house and just hang them on my neck if I have to bend over. Without them I'd be blasting my husband out of the room. Several friends have bought them for spouses in the interest of their marriages :-)",
        "I have had two sets of these in prior years (over the past 15+ years) and bought these for watching TV at night and not disturbing my spouse. They have great sound, and work well. I have one small issue though - where the jack from the headphone base plugs into the TV, it is very wide, and would not plug into the receptacle on the TV. I had to scrounge up a female to male extension to make it work. Other than that? Perfect. Batteries last for many hours between charges.",
        "These headphones worked fine and were easy to set up. Then after a while all we got was static and the Signal light lit no more. If you look online this seems to be a frequent complaint. You'll see all kinds of alleged cures-- get a new power strip, have this be the only thing plugged into the power strip, open it up to find the magic transmit crystal and jiggle it a few times, even a suggestion to whack in on the side a few times. This is the SECOND RS-120 we purchased with the same disappointing result. Don't buy these.",
        "These are the most uncomfortable headphones I have ever tried! And the sound quality of the unit is terrible. AND, when you turn up the volume on the tv, it cause the headphones to have a hollow, echoing sound! ...Very disappointed in this product and I strongly recommend you do not buy it - you will end up returning it. I think you have to pay about twice as much to get a quality headphone.",
        "Packaging’s carefully done, good work, Sennheiser! I think this is the best RF headphone set out there — sturdy and efficient. It’s bulky, though, and not as comfortable as AirPods or Sony Bluetooth headphones. I can’t turn my head as I recline on my big couch! Can’t appreciate the noise cancellation too much because the cloth ear covers get in the way. But overall, better than most for its sturdiness and edficiency. I like that sound isn’t emitted from my TV at all when the headphones are plugged into the 3.5 mm jack.",
        "My son ordered the Sennheiser RS 120 II. I returned it because the headphone stand would not charge and there were no converters that fit to plug into my tv. I returned it and ordered a new one. There were the same problems. Headset holder would not charge and no way to plug in to my tv. I even waited for my son to come from Texas to get him to set it up.. HE COULD NOT MAKE ANYTHING WORK. Please take this OFF your items to buy. It’s a scam product. Ordered TWICE same defects. And I waited too long to return and can’t even get my money back now!",
        "My wife is losing her hearing and so as not to have the TV turned up so loud that everyone else in the room was blown away, I bought her a set of these. They are absolutely wonderful. She was so pleased that we bought a second set for our second family room. Connections are easy as long as the TV (in our case) has standard audio out jacks. One word of warning however. If you should purchase two for your home, be sure to put them on different channels. There are 3 settings for this and you'll need to change one so as not to get interference, even if not using both at the same time.",
        "My husband loves these headphones!. He can also get up and use the restroom or grab a beer during a game and never miss a play, God forbid, and I don't have to hear not one single word of it. LOVE LOVE LOVE!!!!!!! They have saved my marriage I tell ya and I don't have to go to prison because I was ready to stick an ice pick threw his skull if I had to tell him one more time TURN THE T.V. DOWN YOU MORON! Thanks Sennheiser!",
        "Bought these 10 years ago because I am sensitive to sound and hubby likes to watch a lot of tv with the volume up. He loves the headphones, and I like the quiet. They are life changing. The only deterioration is a thin foam layer inside the headphones. They fell a month ago and one of the headphones opened up to reveal same. I offered to buy hubby new ones but he fixed them easily and says no need.",
        "When watching a movie, speaking only for myself, I strive for uninterrupted quality sound and visual entertainment. These Sennheiser wireless headphones help assure that is provided! They are: comfortable; easy to use; quickly installed; noise-free, easily tuned - all from within my favorite recliner. If you want uninterrupted quality sound, this is the pair of over-the-ear headphones for you. They were for me!",
        "I bought these four years ago. They work OK, sound quality is acceptable, battery life is good. However I haven't used them nearly as often as I could. Problem is the on-ear design. After about 30-40-minutes these cans really start to hurt the cartilaginous parts of my ears. There's nothing anatomically remarkable about my ears; they are neither large nor prominent. But OMG these headphones are uncomfortable! I'm in the market for an over-ear model.",
        "Earlier I posted a review where I complained that I was hearing a lot of white noise (aka static) during quiet sections of audio and gave only 2 stars. Turns out that I had the volume turned up way too high on the headphones and this amplified the inherent noise that exists in many audio circuits. After turning down the headphone audio and turning up the volume on the TV the noise was all but eliminated. I now award these headphones with 5 stars.",
        "Received my head set about 3 weeks ago. I don't usually leave a review but, I LOVE THEM! I use them when I need to keep the volume down on the tv after my husband goes to bed. I don't know what I waited for. I can hear everything now. Don't have to worry when the stupid commercials get loud! It took me a little bit to figure out how to hook them up. Wasn't easy. My son came over and finished it for me. The instruction book isn't the best. Don't care I love them!!",
        "Works very well. Range is significant, extending throughout the house and into the back yard. Audio quality is very good. Audio effects such as surround sound are great. The only downside is the headset is uncomfortable to wear. The ear cups are flat so they press very heard on the ears causing some discomfort in an hour, sometimes less. The headband adjustment is not very good and the headset tends to fall off easily. Technically they are great, ergonomically they suck.",
        "I bought these from Amazon (I had been watching them for a long time) with my gift card from Mother's day. I have the wired ones and the sound is awesome. I like it as well as my Beats. I am not real impressed with the quality of these wireless as I thought I would be from this brand. They are on the ear so do not cancel out all noise. I also am not crazy about the stand or receiver they hang on. Just not what I expected from Sennheiser.",
        "I already have a set of these, bought these for my brother. His wife works from home, and her office is right next to his bedroom. He couldn't have the TV on and have that sound in the background coming through the wall into her office. These did the trick. Crystal clear sound and the convenience of just being able to set them on the charging stand each evening is really handy.",
        "These have been in use for almost one year, less a month. sound quality is rock sold Sennheiser. Signal goes in and out in some areas of the home, but good for the $$ and not a huge issue. Getting good time between charges. I use them at night. My hearing is shot thanks to rock shows in the '70s, 80s, 90, ect., so it's nice to hear details and dialog easily. I'd buy them again.",
        "LIke the fact that it is wireless and I won't disturb my neighbors or family. The signal is the only pain the neck. You adjust for the best signal, but sometimes it takes fine tuning to get the sweet spot or it's crackling or volume up and down from losing the signal when turning my head. I can be around 30 feet or so and keep the signal, but I only sit around 12 or 13' from tv and always gotta fine tune it to get it just right. Fine for the price.",
        "Had a pair from Brookstone that lasted years and finally bit the dust. Bought another, cheaper pair but after a few days, they would not charge. Returned those and bought these. Easy to charge, just hang on the stand. There is an issue with static when the headphones are on but no program is playing. She's figured out how to manage that issue and tech savvy she is not. Mom says they're comfortable and sound quality is fine. The rest of the family is glad that we don't have to listen to mom's tv shows any more. It's all good.",
        "Awesome!! Had some Philips ones, total rubbish, yo had to be 6\" away from source before there was no interference. Plugged these in, charged for not even an hour, tested it (impatient), no adjustment needed at all, can walk around room without interference. Just brilliant. Did not have to fiddle with tuning or position of transmitter. I do have them plugged into my set top box, not the TV. But my TV does not have the facility to have both earphones and TV sound. No static, no hiss, Tv sound is down low now, yay!! None of the issues anyone else reported. Of course, quality German products do make a difference. Well worth the money.",
        "Really make a difference in listening to TV shows. All the dialog is distinctly clear and the stereo sound is much better than even my surround sound system with very good speakers (Bose). Sometimes when adjusting the volume, you can accidently move the Tuning control and lose all sound completely. Just be careful. The headphone stand is a little awkward and you have to be careful to make sure that the charging LED comes on or they are not being recharged.",
        "My unit received never worked. After many hours and attempts, guides, videos, and customer service. I believe we received a dud. Base unit would never power on, nor then be able to begin to charge the headset. Disappointed as was really looking forward to this functionality with our tv.",
        "I have been really impressed with this wireless headphone set. They're extremely comfortable to wear. And the sound quality is about as close to perfect as a headset can get. The only downside to this headphone set is that it doesn't balance quite right on a person's head. If you hold your head still--no problem. But if you lean forward, you'll be grabbing the headset. The reason? Because they'll be falling off your head. Other than that, I love them and still give them a five-star rating.",
        "We bought this for my mom who wanted to listen to TV at night while we sleep. It works very well as long as you remember to shut it off and hang it up to recharge. Volume and Tuning control is on the right-hand side so if you turn up the volume you may find you instead turned the tuner, whereby losing the station. Easy to get back. Only problem we have found is the speaker connection cup came off which was an easy fix as it clips back in. THE SOUND QUALITY IS EXCELLENT!",
        "The pro's: Easy setup, works fine for getting sound from the TV to the Couch, and the battery life is pretty good too :-) The con's: Anything but sound proof; I can hear conversations in the room pretty well, and people in the room can certainly hear something is going on in my headphones as well. I primarily got these so the wife and I wouldn't disturb each other when she is working, studying, on a call etc, and I would like to watch the game or whatever. These do NOT work well for that. And the base is kind of bulky, but mine if hiding behind the TV, so that's not a big deal.",
        "Love these! As I'm getting older I can't hear the low conversations in movies and some TV shows. Especially the ones who have crazy loud background music and then talk during it. I also have a LOUD family - so if I'm trying to watch something - they always seem to know and start talking loudly in the next room. They are very comfortable to wear - easy to set up - and I'm able to make a quick pit stop instead of pausing a movie if you get my drift. Now my family asks me what someone said during the movie.",
        "A friend turned me on to these as a solution to noise from the tv disturbing someone sleeping on the opposite wall. The sound is actually better in the headset than from the tv,picking up subtle sounds I don't usually hear. Occasionally it seems like the volume will change,but it's easy enough to raise of lower on the dial. My two complaints are these: (1) These are designed for someone with a large head. Even on the smallest setting they fall off my head if I move around. (2) My ears get hot and they are a bit bulky if wearing in bed to fall asleep.",
        "I am surprised by how well these headphones perform for under $80. I didn't expect the sound quality or clearness of the wireless connection to be this good. They are easy to set up, easy to use, easy to recharge and the range is better than I expected. I recommend them for those qualities alone. My only complaint is the fit. I, by no means, have a small head but there is no way to adjust the headphones for the width of my head. They are fine if I keep my head upright but if I lean over they slide off. it's annoying as hell. Still I recommend them based on the quality of sound and ease of use.",
        "I can happily be watching a movie at a normal sound and all of the sudden there is a deafening volume increase. It also randomly will lose the channel or something and a loud static sound happens. I'm literally 10 feet from the tv and the unit so I don't know why this is happening. Also the ear covers fall off super easily. I don't think I would recommend these to anybody really.",
        "First I want to thank the customer named Bob for writing more thorough instructions in his product review post of 22 Sept. 2016. Very useful, and appreciated. Instructions included in the box are very spartan. Other than that, they were very easy to set up and use. I've been buying and using Sennheiser headphones for at least 30 years – they sound great and last forever, and this item didn't disappoint.",
        "Wear these eight-hours per-day, headsets are very-comfortable. Velcro-strap across the back is a necessity. Automatic frequency-control inferior to older units. Accountant must have gotten a bargain on band-pass capacitors. Would prefer not to have multiple-channels. Sound-quality is satisfactory for me, but my hearing stops at 5000-Hertz. Will buy them again.",
        "My husband has had two other pairs of Sennheiser headphones over a period of many years. He has always been able to wander all about the house with them, still maintaining a solid signal/sound. These just didn't perform as those others did. They were returned, and a more expensive pair of Sennheiser 175's is now doing a splendid job for him.",
        "I purchased this wireless headphones for my father who has poor hearing to use when watching TV. The headphones work very well and he can listen to the TV as loud as he needs without bothering everyone else in the house. The RF wireless means that he can roam the house or even go outside and still hear the TV. The battery lasts so long that he has never run out of charge even when watching TV for the majority of the day. The charge cradle is convenient and is also the transmitter with useful indicator lights.",
        "These headphones are very good. They provide me with the ability to watch and clearly hear TV programs while my wife is reading in the same room. The quality of the sound is outstanding. The headphones are comfortable but when I wear my glass I'm not able to adjust the tension which cause me to repeatedly move them to avoid pressure above my ears. I would buy these headphones again. Well worth the money.",
        "The most painful headphones ever, no amount of adjusting helped. Such a surprise, I last used Sennheiser many years ago, they were wonderful. It’s a rude awakening to discover not only changes in product- these seem very cheaply made in the area that makes contact with your ears- and I am sure my body has changed with age too. Pick something else, there must be something better out there.",
        "Only real negative is the foam ear piece covers. Not really comfortable, but you get used to them. A great product for TV or music. Good fidelity. Much better than TV speakers. Allows all listeners to set their own volume . . . a terrific benefit when people of different ages are in the group. We use 5 sets for family visits. Always charged and ready to go.",
        "Because of a hearing problem, I have used these wireless TV headphones for many years. This is my third purchase of Sennheiser RS120 On-Ear Wireless RF Headphones with Charging Cradle. I can watch TV without disturbing anyone else with high volume sound. The best benefit, I can listen to the news while working around the house. I can even hear a broadcast in the outside laundry room!"
    ]
}