{
    "entity": "Over-Ear Headphones",
    "text": [
        "I regularly use them to Live Stream and play games with since I don't want to disturb the household. After just five months of use the Right side speaker is completely out and they are considered brand new when I got them. So to me there is no longevity and a complete waste of money. I am the one who doesn't abuse my equipment. Now I have to look for a another pair.",
        "Headphones do not last long at all, my pair of headphones lasted only 3 months after fairly light use the wire is annoying and feels like it weighs down on your neck. The sound quality isn't anything special although. DO NOT BUY THESE HEADPHONES!!",
        "We just purchased these in June and they are already not working. Buyer beware.",
        "Hope the new models have improved the head pad - it seems to have shrunk oer the years and taht may seem like a small thing but without it - these babies are uncomfortable. The ear cups have worn in over the years and are a little uncomfortable and get a little sweaty over extended listening sessions...three or four hours. That said..audio performance is outstanding. Whatever they did to emulate noise-cancellation works...without the $300 price of certain other headsets. Many times people come up behind me at work and have to tap me on the shoulder to finally get ,my attention. If only they came with an interrupter-tasering option.",
        "I purchased these headphones and I was somewhat disappointed with the sound. I had expected better from Sennheiser. Nevertheless, I kept them because they were okay and I needed a new set of headphones. The problem was that I felt that the high notes were too muted. Add to this problem was that roughly 3-months after purchasing these headphones the left-side just quit working! I am not abusive with my headphones. I only wear them when I'm at work at my computer. I usually listen to music. This added problem has soured me on Sennheiser for any future purchases. I would have expected a lot better quality for $100!",
        "Out of my 3 pairs of studio headphones, these ones are my fav. They’re the best quality for the price in my opinion. I mean, sure you could buy a nicer pair, but do you really wanna spend $400-$500 when these are comparable? Good low end (maybe a bit much) and overall pretty dynamic range. They have a nice short cord that stretches pretty far and fits in your nose better than a booger!",
        "I bought these for electronic drumming, but I was really disappointed with the quality of the sound isolation. They supposedly attenuate up to 32 decibels.... yeah I really doubt it. These were not even as good as my old Bose QC35s with the noise cancelling turned OFF. Disappointing, because I had read so many reviews about this being a strong point of these headphones. I returned 'em.",
        "I owned these headphones (new model) for a year now and I can tell you they work just as well as when I bought them. I am not an audiophile but I do like a nice pair of headphones for two main reasons: the sound quality and is noise canceling. It excels at both. On top of that, these are very comfortable and durable. These are a great buy, invest in these rather than buying 3+ cheaper pairs that won't even come close to the quality of this product!",
        "High quality, excellent sound and cut out environment BG noise. Soft cushions on ear and top of headphones. I also connected the Sennheiser GSX 1000 Audio Amplifier -- WOW this unleashed the capabilities of sound spectrum in these headphones. Changing the presets / customizable can listen to music like if it's coming at you from the front, another preset sounds like its coming from \"speaker\" around the room. This headphone can be plugged into smartphone 3.5mm jack and have enough to power them at a lower level than having the \"phantom power\" or Sennheiser GSX 1000... but the amplifiers unlock a whole different level.",
        "I purchased these to use when playing my drums at home, as my ear canal earphones kept falling out and weren't that comfortable. These work great. Hooked directly to my Galaxy S7 results in rather shallow sound and low volume (even with EQ etc), but connecting my phone to a usb external soundcard (SoundBlaster X-Fi) has far better results -- it's louder and sounds way better and fuller. Detailed with decent bass without being overwhelming, perfect for playing along with. I don't have to turn them up loud to play along and still be able to simultaneously hear the music any my drum hits. They're comfortable to wear and the cord is super long.",
        "After light use and careful treatment, the right headphone stopped working about 8 months after purchase. The lining on the top of the headband, where there's a cushion, started cracking and flaking off immediately with light use. These are either a cheap knockoff pretending to be a real product, or just a very poorly manufactured product",
        "I work part-time at a local AM/FM radio station. I play oldies from the 50s thru the 90s (Great Rock 'N Roll). These headphones have the right amount of bass and treble. Bass doesn't blow your eardrums out and the Highs are excellent. Everything sounded great from The Eagles, Three Dog Night, Fats Domino, The Spinners, ELO, Beatles, Beach Boys and more. One of my friends has a set of BeyerDynamic phones that cost him around 150.00 to 175.00. For 80 bucks, these Sennheiser HD 280 Pros can't be beat IMHO.",
        "2 weeks of casual use on my desktop computer caused one of the speakers to stop working",
        "I had them for only six months, and now the right ear cup plays no audio. Of course they break as soon as the warranty ended. They were already a little off audio wise, but now the right ear cup is completely off. Don't buy this, it's a waste of $100 dollars.",
        "I have 5 pairs of these in my music studio. These blow Sony studio headphones out of the water. These handle a good pounding, and I would recommend these all day long. Fantastic.",
        "I use these for PC gaming. They are comfortable for hours on end and they sound great. However, they have two drawbacks... 1. The coiled cord is very heavy and awkward to manage at my desk. I'm considering chopping the cord and adding a socket so I can plug in a thinner and lighter cord instead. 2. The headband has a funny oversize shape that looks weird on a video stream. If you're not putting yourself on video this won't be an issue and they are actually very comfortable.",
        "Excellent seal around your ears, so blocks outside noise really well. It's a bit heavy but the padding is quite comfortable. Sound quality is good, as you'd expect from Sennheiser. The one downside is that the cord has been awkward. It's heavy and coiled, but it's short enough that I'm always needing to stretch it, which is uncomfortable if not problematic when I need to move around. A straight cord or a longer cord would have worked a lot better in my setup.",
        "If you need studio-quality monitoring headphones, these are by far the best I have tried. The headphones are lightweight and almost perfectly fitted to your head and ears. Very low ear fatigue on extended use. I bought a pair in 2000; it still works perfectly well, but the padding gave out after 20 years of studio use. So I got a new pair, it should last another 20 years I figure. Sennheiser makes a quality product with these headphones.",
        "I bought these in Jan '18 and used them lightly for a couple months. I took very good care of them. Then they were stored properly away until a few months ago when I started using them again on a daily basis. Again, I treated it like a baby, ensuring my setup did not put any strain on the cord at any point. Then, overnight, the left earphone stopped working. And now... I'M UPSET! $100 down the drain is disrespect.",
        "This product has outstanding sound reproduction for the price. I have the Sony MDR 7506.  The Sennheiser has more depth and better separation than the Sony product. I have owned the Audio-Technica ATH-M50x and these are close but not quite as clear as this product to my ears. I have the Symphonized Wraith 2.0 earphones. These are not near the Sennheiser product. In my view, one will have to spend around $300.00 to get a better set.",
        "I love these a lot. Especially after burning them in over night they sound great and cut out a LOT of outside noise. I got these after seeing them recommended by a lot of people for drumming and they work. they allow me to actually hear the music I'm playing along to even when I'm drumming very loud. In short - Do buy these for comfort, noise isolation, and clarity Don't buy these for an audiophile bass heavy experience.",
        "I am impressed with the build quality. The sound is crisp and has excellent bass. Cord is very thick and heavy as well as the headphones. I didn't care for the lack of long adjustment. They fit very tight on my ears. I cant even wear them correctly. I have to tilt them towards the rear of my head to release the pressure they create. My old Bose headphones are way more comfortable and lightweight. I love the sound and high build quality but the weight, stiffness, and high pressure fit makes them not suitable for hours of listening.",
        "If you need some decent speakers for gaming or some speakers that will drown out SOME of the surrounding sounds, then look no further. These look nice, they feel soft and supple on your ears and they sound terrific. I aint gonna lie, they DO cost a little more than other headsets, but Senheiser has not only been around a long time, they are ALSO not some cheap China knockoff brand that is trying to make a name for themselves. Choose these over unfamiliar brands and be glad you did. They sound great playing PUBG, CSGO and EGS.",
        "I bought to play my e-drums, but I do have to say... The coiled cable is annoying as it can be, at least for e-drums. You feel like it is pulling your drum brain, or your headphones. The coiled cable will be on your way (Snare, Hihat Area). I was SO frustrated, was going to return them. The pads aren't as comfortable as my Beyerdynamic DT-990. But once I got a straight cable extension 15ft, it was a game changer. Now cable doesn't pull my module. Cable goes under drum rug, and just hangs on my back. Really good for drumming.",
        "Generally not a fan of the closed-style headphones due to the weight of the ear pieces, but these are not too bad - except for the cord. It's a bit on the short side and it's one of those old-fashioned coiled types like you would find on an old telephone handset (for those of you old enough to remember corded telephone headsets). I use them for recording and the short length combined with the sheer weight of that coiled cord is extremely unpleasant as it always seems to be tugging and getting in the way. Otherwise, the sound is fine.",
        "I take good care of my equipment, I have to as I don't have much money but I need quality, good value gear that lasts. This is not that. Without ever leaving my desk, being dropped, or getting blown out, the right ear just completely stopped working. No matter what they are plugged into, the left ear is the only one to produce any sound at all. They are busted.",
        "Had it since August and today the left ear just went out the second i put it on my head. I take greate care of these and always have them on a hanger out of harms way. No reason they should just randomly stop working when i paid 100 dollars for them. Buy Oneodio headphones they'll last longer at least",
        "I've had the 2016 model for 2.5+ years now and can vouch that these stand up well over time, better than most other headphones I've owned, even though I use them for workouts. On one workout I did manage to damage the connection of the wire to the headphones, but Sennheiser replaced it readily under the generous 2-year warranty. I was looking for a set that fits comfortably on a large head and has good noise isolation for treadmill use. I found it--I'm very pleased with this purchase. The sound is quite good for general (not audiophile) use. The price at less than $100 was reasonable for the quality, the relative durability (compared to many headphones), and the 2-year warranty.",
        "If you are an actual musician or sound engineer you need some affordable headphones with sonic accuracy and a relatively flat EQ response. Nothing at this price point competes with the HD 280 Pros. I use them in my project studio, I use them on stage, I take them to every session (except for the big studios which give me Beyerdynamics, very good but also very pricey $$$). I don't like consumer grade audio, and I don't need headphones that look like they came with Barbie's dreamhouse, I stick with these and I have heard them all. HD 280 Pros in my gig bag every time.",
        "These are great for the money. No, they're not a $500 set of Grado's, but they're not junk either. I'm using them when I need to block some ambient sound and get a good feel for a mix. They're pleasantly accurate, no boomy bass but nice reach down low. The upper range is not overly crisp like Sony 7506's so I've started using these when I want a more accurate sound. If you want something ACCURATE you'll like these. They are! If you want something boomy (Beats) or overly crisp on the highs (Sony 7506s), don't buy these.",
        "These are really good headphones with 1 fatal flaw. The heavy, short, stupid curly cord. I hate it. None of the pictures show the cord and that's probably why. I would not have bought these if I knew they had this sucky curly cord, but was not able to return them bacause of traveling. Bottom line: Sennheiser makes great headphones and these don't disappoint sound wise, but the old fashioned curly cord ruins them. There's a reason most headphones don't have these curly cords anymore. They suck!",
        "I purchased these headphones in 2008 and have had a couple other headphones throughout the years as well. For the current price (under $100) these are a STEAL! Obviously they aren't going to be as nice as a $200+ high end set, but for 95% of \"normal users\" these are going to be more than enough. After 6 years, these are still my go to headphones. Pros: Comfortable earpads, long cable, great noise cancellation, and folds to a manageable size. Con: Earpads get pretty warm with extended use (probably depends on how much heat your head emits...), I guess on a cold day that's not a really CON...",
        "Sound is great and cancel most outside noises - or buffers them enough that you don't pay attention. I love the fit and very comfortable. I have a small head, and these actually fit me on the smallest setting. I wear a hearing aid and it doesn't squeal when I'm wearing these. If you're going from cheap to mid priced headphones, these will amaze you.",
        "I truly hate the spiral cable - it's too heavy and tangles easily and there is literally no point to it. Every time I pick these things up I have to untangle the cable. The leather-like parts started disintegrating after a few months. And even after two years these headphones are so tight that it hurts my ears lobes. Only reason why I've used this for so long is because the sound is good. But I'm now just so tired of untangling the cable and having my earlobes crushed.",
        "I've had these headphones for 5 months now. They are the best sounding listening setup I have ever owned, my first step towards audiophile cans from previously using desktop speakers or cheap earbuds. They are extremely comfortable and I have no issues wearing them for long periods of time. I chose these over open cans because I wanted to drown out some noise that is always present in my home office and so I could wear them in shared work spaces without disturbing my peers / coworkers.",
        "I do sound work for film. I used to use Sony MDR-7510's for post production mixing and editing (I prefer to use those for production work still because they are smaller and lighter and still give great sound) but I got these for post production mixing after a recommendation from a producer. The difference is remarkable! Compared to the MDR-7510's, I can hear the different layers of sound independently instead of being blended together into one layer of sound. The music, sound effects, dialogue, etc, all sound independent from each other and make for an incredible listening experience. I use these on my MacBook Pro for editing and for watching movies. I think they're worth every penny.",
        "First pair lasted about a year before sound went out on one speaker. Next pair lasted about two months before I lost sound in one speaker. These have been used on a smart tv so as to not bother family so there is no abuse. The sound is super but durability sucks! $100 is way to expensive for great sound for such a short period of time. I am more disgusted than I will mention here!!!",
        "For the price, they are quite nice. Purchased for my GF to use while gaming. I've also used them that, and they work well. Clamping pressure isn't too much, and they fit nicely for her small noggin and my big one. Sound profile is pretty neutral, which is expected from monitors. I'll likely swap out the cable for a detachable straight cable, but there isn't anything wrong with the regular cable...just personal preference.",
        "This is a review for the NEW model. As an owner of the Old model, the NEW model blows those away. I was really impressed with the sound staging quality of these headphones. They've definitely improved the quality. Great clean sound, good noise isolation, the bass is not that pronounce but you can distinguish it clearly. Only negative is the are a bit tight, but it helps with the noise isolation. For the price, I might buy a few more.",
        "pros: sounds great, feels great cons: the material that the ear padding's is made from is pretty much guaranteed to fail. I had an older set of these with the same material and it deteriorated. Keep it clean I guess. The cord is super duper bungie. I plug this directly into my pc and the cord spiral is so taut that it kinda pulls on them for 80 bucks? I dont know if you're gonna get something that sounds much better",
        "I have always liked this brand, but it shorted out in one ear in a couple of weeks. Got a replacement set, same thing happened with it. Poor design or build, but it definitely was not up to the name quality i was used to. Sounded excellent, just not durable at all",
        "The right ear speaker stopped working after 1 year and 2 months of ownership. They still look and feel like new just one ear no longer works. I paid $108 for these thinking they would be better quality and last longer. So far they didn't last any longer than other cheaper headphones. Always careful with them. They go on a stand. Never dropped or tossed. For the money I would rather buy a cheap $35 to $40 and replace them every year or so when they also have a planned obsolescence failure. 3 stars because it lasted 2 months past 1 year.",
        "These are GREAT! and SO versatile! Lightweight and comfortable around the head and ears, the headset fits well on all but the largest of crania. The closed back design shuts out the world pretty well and lets all the subtle nuances of your audio come through clearly. I use them for reference mixing and they DEFINITELY accurately represent a stereo sound field. Great for focus, and those detail oriented tasks like hunting down clicks. Not so good if you want to hear the doorbell or the phone ringing...but isn't that the point? You will not be disappointed. STRONG BUY",
        "i'm a musician who purchased this product as a gift for adult family member. comfortable design and good quality for this price point. noise attenuation is surprisingly effective. while recipient listened to jazz (at a volume level appropriate to a 50-year-old), four other adults took the opportunity to air grievances - and just have some profane fun - at the expense of said recipient who was within arm's reach. we were only busted when we simply couldn't hold in the laughter and our victim removed these headphones to see what was so funny. highly recommend for both listening and pranking purposes.",
        "Great headset just as advertised. I use them on my keyboard when practicing, and also with the Aviom sound system we use for the band. The sound tech liked mine so much that I ordered a second set for him. The price is less expensive then some other headsets that I was considering and they don't require a battery. Although noise cancellation is not advertised for this headset, I find that they do help to cancel outside sound when you have them in use. I was looking at a set of Beats however I am really happy with these.",
        "I play bass guitar with a church praise team; I have used these headphones for a number of months now. I prefer over-ear headphones to the in-ear monitors, namely because of enhanced bass frequencies, and also comfort. These headphones deliver very well for both sound and comfort. They are on the larger side, but if your primary concern is sonic quality, these are a very good choice. They fold up easily to fit in a case. I plan to hold on this pair for a long time.",
        "I am extremely disappointed in this item’s performance. I have the old model and the pads are crumbling so I wanted to replace them but these sound nothing like them. It was a huge mistake to be lazy about returning them. I suggest getting the industry standard Sony 7506 headphones. They aren’t the most accurate but they have been a staple for recording monitoring jn a studio especially for guitar players for decades.",
        "Sound quality is ok for a $100 can. But it's way too much pressure in my own opinion. I thought I gave it a few weeks to break in. But it's still way too tight that give me a headache, and I don't have a big head. I had a Sony MDRV6 and a Philips SHP9500S(open end) in the past. They're in the same price range, but they're more comfortable, even after years of services.",
        "My second Sennheiser product, which is even more amazing than my first (Sennheiser HD 599 SE Around Ear Open Back Headphone). Noise cancellation: I can't hear my own mouse clicks and barely hear keyboard (suppressed mechanical Ducky) presses. Sound quality: Listening to Canon Rock by Jerry C I can pick up each individual e standard note in addition to the perfect registration of vibrato. Bass quality: Rich like the movie theater sound systems. I have a size 7.5 head and the headphones cup my ear for a minor \"sea shell\" sound. My ears aren't hot and they don't ache after wearing for several hours.",
        "This is an amazing headset for the price. The high low and mids come in crystal clear like much more expensive headphones. Although it has mini phono plug the cable is heavy and coiled and not made for portable but sounds excellent on my Opus #3 DSD player. I wish cable was thinner and lighter but if you're not moving around it is ok. Good fit and comfortable also.",
        "right side went out after 4 months of occasional use. seems like this is a common issue. buyer beware.",
        "Got these for Christmas 2018 and they just stopped working on the right side. Looked it up and apparently it's a common issue. I just missed my return deadline by a few days. Would be cool to get a replacement, i like the sound and fit a lot. I am very careful with all my electronics (i work from home at my desk) and i think it's very sad they barely lasted me a month. No wire kinks or breaks, i even bought a USB to AUX extender. After it stopped working, I tried it on all my other devices and the issue remains. Please help.",
        "This is the second pair of the HD280PRO headphones that I have owned, the first ones lasted me about 10 years and multiple trips but I think the wear and tear on them stressed the plastic and they finally broke. This new pair feels way cheaper than the last one. The plastic used feels lighter and the padding feels really cheap compared to older models. They feel significantly less comfortable to wear than the older designed models. I would get an older pair if you can or buy something else. The new model doesn't even block out sound as well so it kinda missed the mark on all counts for me.",
        "I used them to listen to music, game, and limited sound editing/instrumental recording. they did their job well until they broke, losing all audio in my left ear. I was shipped a new pair for free, then 3 months later they broke too, the exact same way, never dropped them, no abuse, i was particularly careful the second time around. I could probably get another free pair but im done with Sennheiser now. they also got really uncomfortable after long periods of use.",
        "Okay, I have to start off with one of the review options, “bass quality” is a tricky option. I gave it 5 stars because the sound quality is perfect. You shouldn’t expect bass with headphones like these. You want neutral, “as is” sound when using headphones like these, and that’s exactly what you get. The comfort is great. You shouldn’t expect to wear these hours on end. Wear them for 30-45 minutes, record what you need to and take a break, then do it again. These are as comfortable as headphones get. Totally a great buy and worth way more than the marked price.",
        "Great sound with the over the ears fit. I had these headphones, the old version, and wore them out. I am glad to have ordered these because the sound is fantastic. Now I had to return the first pair that I ordered due to the sound cutting out on the left side, but the replacement set was perfect. The price was nice for such high quality a product. Would recommend this item.",
        "My main issue with these was comfort. They made my ears hot and squeezed my head rendering them useless for prolonged use. Also I found the sound more mid to high pitched oriented with bass lacking. Overall I was really disappointed for the price.",
        "Great sound at a great price, i've been using these for about half a year or more and they still sound great and the padding is still in perfect shape. Would definitely recommend. Way better than buying some cheaper 40-50 dollar headphones that dont have as good of sound quality and will probably tear up way sooner than these will. I'm not extremely hard on my headphones, I drop them in the carpeted floor sometimes or sleep with them on occasionally, but i've tried cheaper headphones like logitechs and they couldnt stand up to this, they would usually tear up or break within a year.",
        "I actually said \"wow\" as the first bars of In a gadda da vida came thru. they are THAT much better than my Hyper X's. Been using them about 2-5 hours at a time. fit well, block external sounds very well.[ a thunder storm snuck up on me]. only complaint is that the cord rubbing at my shoulder transmits that rubbing noise quite well. The bass response at quiet passages really is astonishing to me.",
        "now i’m comparing these to several great in ear buds, bose noise cancelling bus, and cheaper full size headsets, but this sound blows them away. i use them for backing music when i’m playing my electronic drums. the cancelling of the stick hits, the mix of drums and music is perfect. also, i hear instruments and details in these i’ve never heard before.",
        "Headphones definitely have a lot of clamping force, but not so much that they are \"painful\" as others have stated (and I have a somewhat large head). I used the Wicked Cushions made for my ATH-M50X'S on here and it made them WAY more comfortable than the stock cushions. Highly recommend those pads. These headphones have a nice flat sound, and listening to them on my Fiio X1 with EQ off they sound fantastic. Very happy with this purchase, can't wait for them to be broken in.",
        "Writing the review mostly to warn those that work in warm and humid countries- the ear pads will fall apart in about 3 months, and the foam will come undone from the plastic, and you'll be buying replacement ear pads a few times per year. Aside from that, these are great headphones that provide decent isolation and good frequency response.",
        "Very sturdy product with excellent noise cancelling over ear cups. I have used for a couple of years. No sign of wear. I can't hear external noise when I have them on. Sound is excellent. Very natural sound. I don't find base or treble emphasized. They are comfortable and I can wear for hours. This does not mean that they are small or light weight. These are just a good solid piece of equipment.",
        "These are reasonably priced superior headphones. Do NOT want noise cancellation because these are for voiceover and podcast work. I want to hear all the noise so I can edit it out of the finished product.",
        "Just received these for VO work. I immediately noticed how tight these fit, very uncomfortable (and I have a narrow head). Yes, they block out room noise very well, but I work in a sound booth, so that feature is unimportant to me. There seems to be a lot of roll-off, compared to an older set of Sennheiser that I was trying to replace. I sounded like I was speaking in a tin can. These are going back today.",
        "I consider myself a purist in my listening ! I was in the car audio business for over 25 yrs after I burned in my new headphones they sounded awesome! The highs were crisp and clear, The mids were smooth and clear, the bass was tight and accurate , they fit tight on my head but feel very comfortable! I would give these headphones a 5 star rating!",
        "Really disappointed in the noise reduction. I have Peltors with an NRR of 31 and I expected this would be somewhere near that since they claim noise reduction of up to 32 dB. This is nowhere near 31 so it is not enough noise reduction for me to play drums with these on which is what I purchased them for. I haven't ruined my hearing yet (and don't plan to) so I need something more protective that can also allow me to pipe some music in to play along to.",
        "Just recently I returned a pair of Sony Pro headsets that were in a nutshell, horrible. Before I got those I was deciding between them and these. Well, after returning the Sonys I ordered these Sennheisers and OMG the difference is night and day! I am so please with he full, rich sound and the ease of use! Thank you, Sennheiser, for helping me to hear music as it was meant to be heard <3",
        "I’m a drummer and I bought these to protect my hearing from the loudness of my own drums while critically listening to recordings that I’m playing along with. The quality of the sound is great. The noise reduction is incredible. In fact it’s too good because I can hardly hear my drums and cymbals. They sound like they are a hundred yards away.",
        "If you're like me and you're used to earbuds or just cheap cans, these are whole new experience. The difference is immediately noticeable. I'm a drummer and I use these to practice with, and they're just excellent. I'm not an expert in this area by any means, but these are by far the best headphones I've personally ever encountered.",
        "Absolutely killer cans!!!!Zeos is right on the money on this one. A/B them against my Fidelios using my Cowon P2 dap surprisingly close. Excellent improvements here. Check out Zeos review. Only con is my head is big, so clamping force abit tight.",
        "These headphones are studio monitors, so they have a very flat response. I like them for home use, I can add any \"sweetening\" to the sound myself. Although they are not noise suppressing as such, the degree of isolation is very impressive. They are very lightweight but still sturdy. My last Sennheisers lasted 40 years, I think these will do the same.",
        "In short, these headphones sounds great and offer good noise isolation, but they have a very strong \"grip\" with no way to make any more loose. after an hour or so, my ears start to get sore from how tight these headphones are. Also, after a couple years, the faux leather pad on the top of the headphones is beginning to deteriorate.",
        "Very comfortable and great sound quality. When I first put it on, the clamping effect was way too strong. Thankfully, I read the experiences of others who said that the intial clamping shock wears off quickly and they were right. This is a great over the ear wired headphone that you can use while doing your programming or other work for hours at a time.",
        "These are great, quality headphones at a solid price point. My only real hangup is how quickly the material can come apart on the headband, and that over roughly 6 months of use how the material in the can over the left ear began to separate as well. This is not an uncommon issue, as I deal with a number of these headphones at my school studio. Sennheiser should likely address this in future models of this product. However, the headphones have great sound quality, they feel comfortable over my ears, they do cancel noise, and very effectively, and these will likely last me for years to come.",
        "Great sound for the money but they are heavy and that probably comes with the territory to get such good sound. I had to stretch them with a book between overnight as the company said. My wife did not find the phones uncomfortable but i felt it was tight and my head is small to med mens. I won't buy a different choice cause the sound is so good. The cord is way stronger than the 202s old ones i loved that broke cords a lot.",
        "Excellent headphones. These headphones are not electronically amplified or controlled. I was surprised how well the noise cancelling effect worked with these. Though large, they were still co.fortable and I can see that people with large ears should find these comfortable too. My only complaint is that the bass response is not as good as on my Bose QC headphones. However, the Bose are almost twice the cost as the Sennheisers. The bass response difference however is miniam and for all the positives, this makes the Sennehiers a good value, in my opinion.",
        "I'm no saying these are bad headphones (other than the horrible plastic construction that is bearable), but these definitely don't belong in a recording studio (pro or home). If you want to use them as earmuffs with sound they're very ok, they are a bit warm. Sound is not horrible, lacks crisps high, mids are ok and bass are plain. Noise cancellation terrible. I can't cancel my girlfriend snoring and the noise spills so that when I'm recording the metronome is caught by an AKG C214. If you're not an audiophile, sound engineer or recording artist; these are good headphones. But I don't think they belong as Sennheiser Pro. Sennheiser consumer audio yes, Pro no.",
        "On my freelance recording projects I need a reliable high quality monitoring device and these headphones are just the ticket. The sound is excellent and the construction is of very high quality. Will be making another purchase very soon for my assistant. Highly recommended product.",
        "Good bass response, and made me go \"wow!\" when I first plugged them in. used with my Roland V-Drum kit, patched with itunes library. Too bad you need to cover the entire ear for noise isolation. A lighter weight version might be more comfortable for extended wear, but can't knock Sennheiser, it's solid quality and sounds great.",
        "The \"new\" model of these rival some of my headphones costing 2 and 3 times as much. I don't have any issue driving them off of an iPhone or MacBook, but they definitely come to life with a good amp. The noise attenuation is insane despite just being passive! The clamp was a little too stiff for my liking at first, but they really do seem to have loosened up slightly after a little use, I can easily wear them for several hours with minor re-adjusts during listening sessions. High can be a bit rolled off to my ear, but this is what I prefer, so sound quality for me on these is great.",
        "amazon got me a old model instead of new model. very disappointment. customer service is lame. 1st lady dodged my help when i said I got the wrong model. 2nd guy was confused between new model and old model. 10 mins later, silence moments and doesnt give me another options. I had to lied to him \" never mind it's the new model \" so i dont have to wasted their my time. I'm planning to buy a new model in the future. hopefully, dont end up with the same problem again.",
        "I really loved these headphones and the way they made my Roland fp-30 sound. They really punched up the weak headphone signal this DP puts out better than any other headphones I've tried. As much as I tried though, I couldn't get past the annoying weight of the coiled cord flopping over my left arm. Since the coils begin immediately out of the phones, even adding an line extension wouldn't help. Too bad. It may sound trivial, but even while using my $15 headphones, I can reach that state where I'm not aware of having headphones on during hours of practice. This impossible with the heavy coiled cord of the HD280. Would gladly buy if it had a straight cord.",
        "These headphones came highly recommended. My son loved them and used them daily whilst playing his electric guitar. The problem is, less than 2.5 months after receiving them (they were a Christmas gift), the right ear bud stopped functioning. For the price and reputation, I’m surprised and disappointed.",
        "I love these headphones and use them almost daily but when I put them on yesterday the sound had stopped working on one side. I've had them for just under 11 months. Not worth the money if they don't last! I will be researching another brand to buy and recommend to all of my gamer friends.",
        "Great sound. Good noise cancellation. They feel rugged and long-lasting. I'm glad I purchased them. My only problem is comfort. The top of the headphones, though well padded, is too low and very flat. Even with the earpieces extended, they place uneven pressure on the top of my head. I'm a professional video producer, so I spend extended periods of time with these on, which causes increasing discomfort and eventually a headache. I'll save them mostly for sound-checking and recording in the field - not for extensive editing sessions. Maybe my head is bigger than average (it actually is) but I'm bummed that I'll only use these periodically.",
        "I travel a bit and I was looking for something that would help isolate the plane noise but I wasn't ready to go all in on an active noise cancelling pair of headphones. Great sound reproduction at the price point and it really did help knock down the overall sound levels appreciably. I could still tell when there were announcements, but I no longer could hear every conversation within 5 rows of my seat.",
        "I bought this for temporary use before I buy Sennheiser open-back model therefore I didn't want to spend much money and this model fit that purpose. The 1st 5 minutes into my classic/Jazz mix playlist, I was simply shocked with awe and ah. Sound quality is totally, completely beyond my expectation. I can only say Thank You Sennheiser. It is the best $80 spent in my life ever!",
        "Have had my first pair for 16-17 years. They are mangled and old but still work. Bought this pair for my son, they only lasted 30 months. As others have said, right ear goes out. He stood up one day and set them down, put them back on and right ear dead. I pulled them all apart and test with meter, the left side circuit is outputting to the right, but it's dead by the time it gets to the right side indicating broken wire somewhere in the headband. Guess I need to start looking at another brand now that I no longer trust these. 6 months out of warranty.",
        "I have several of these for recording. So far these seem to have the best combination of festures for the price. Be aware that ones ears tend to get a bit sweaty using them. Otherwise good sound quality, better theb the similarly priced competitors I've tried so far for sound isolation.",
        "This is perfect. The sound is phenomenal. You hear everything, not just mostly bass like the other headphones. These remind me of the old school headphones. This is the best heptagone I’ve owned since 1998 (old Sony). Once they’re on, you forget the world. Can’t hear nutt’n going on outside of your ears. 🤣. Buy them and you won’t regret it. Happy listening!!!",
        "I was very impressed with the sound quality of these monitor headphones. It really gets you into the spectrum and they are light and comfortable w/hours of use. It is made of a rather cheap feeling, flimsy plastic which was a bummer at this price, but I am just gonna have to be careful with them as I feel they will break very easily. Other than that, I love them.",
        "The over the ear design is snug but very comfortable. Noise isolation is excellent because of the tight fit, but it may not be for everyone. Sonic details are great for the price range, but deep bass is a bit lacking compared to higher priced models. If intended for computer or phone use I would recommend purchasing a separate portable amp to drive them, and they sound pretty lifeless through a typical sound card. So really they are a $200 set of phones if you count the purchase of an outboard amp/DAC. But even with the extra cost of an amp to properly drive them I believe they are a steal at the price point. Highly recommended.",
        "Strong word of advice; Be careful with these! I am somewhat careless with my headphones, and one day, while swinging at a fly, I knocked these off of my head and onto my desk. This broke the left ear speaker, sadly. It was a sharp impact, but still soft enough to give me the impression that these are fragile headphones. I give these 5 stars nonetheless; my carelessness aside, they are fantastic headphones. Excellent audio, powerful bass, comfortable fit. I am strongly considering buying a second set as replacement.",
        "I have had these for a year and a half and I am still enjoying them. The sound quality is great and the sound isolation is impressive considering how affordable they are. I use these when I am stationary. I gave them a try on the treadmill but the cord is heavy enough to be a nuisance. Boy did they block out the squeaky treadmill noise though! I can see how some might find these a bit snug but I feel as if that snugness is a crucial contributor to the sound isolation.",
        "I've had professional headphones for as long as I can remember. This is not as expansive - but then again I just paid a hundred bucks for it. For that price, I highly doubt anything comes close to the sound quality - especially as a headphone and not as a monitor. The Sony mdr headphones might be better monitors, but in no way are they better headphones.",
        "I wanted headphones that didn't leak any sound so I could record myself playing drums and not get the sound of the headphone mix on the recording. These work well. I can crank the music track (and a click track) and nothing ends up in the overheads.As far as mixing goes, these are fine. They don't accentuate the bass or treble - a pretty honest sound.",
        "These are not noise canceling headphones. They block the ambient noise, but do not have any active noise canceling feature. I found that they aren't very comfortable. The headband puts too much pressure on the cups and squeezes my head too firmly, giving me a headache after an hour or so.",
        "These headphones have too much treble. The sound is too tinny. I had my treble turned down to -6 and the bass at +2. They seemed fairly comfortable, but I could tell immediately that they were not satisfactory so I did not wear them long before deciding to return them, which I did.",
        "I dont want to use too many words right now, the amazing crisp, clear, undistorted sound is activating the right side of my brain too much for that. Sleeplessness just swooped down and said “hello”! These are great for audio design. Buy these things."
    ]
}