{
    "entity": "Over-Ear Headphones",
    "text": [
        "In 1999 I bought them from Amazon. Over the years I bought various speakers, headphones, buds, Bluetooth headphones, noise canceling ones, etc., etc., -- many thousands of dollars. These artifacts were buried with old cables in a box for a long, long time. I pulled them out a couple years ago, bought new pads for them, and was utterly blown away by how shitty every single musical experience I have had, has been, compared to these. I really feel like I have been unknowingly partially deaf for 20 years listening to other devices. This is real--it gives me the most real musical experience, the way music is supposed to be.",
        "These headphones have been an industry standard for a very long time, and for good reason. They have a very balanced, clean and clear sound. They will deliver whatever they are fed with little coloration. Compared to my Audio Technica ATH-M50s, these don't have the bump in the bass that makes the Audio Technicas sound full, but the upper frequencies and voices are more detailed and sweeter on the Sonys. The Sonys are capable of very deep bass, but if you want more than is present in the recording, you'll have to EQ it in. I use mine with a FiiO A3 amp with the bass boost on, and the sound is spectacular.",
        "STILL the best sounding headphones for the price! First time that I had these were over 20 years ago and they still sound as good then as they do now even though most of the music is now this digital crap. Yes, the MDRV6's are that old! And running analog through these still sound awesome! Most headphones that are out now are colored more towards the lower frequencies. That great if you like to hear bass that sounds unnatural or a whale. I like to have my listening gear sound flat when i get it and then I can change the characteristics of the music through an EQ if I need to have it changed.",
        "Arrived well packaged including a plug adapter and carrying bag. Cord is well made and sturdy. Nice aluminzied plug goes into my aux port. VERY comfortable; always have issues with phone fitting well. These have a great adjustment system. Phones fit comfortably over my ears and do not feel too tight but offer a nice sound barrier to exterior noises. The sound is incredible for the cost. I always look for phones that can offer the lowest bass response and these don't disappoint. Launched Focus - Hocus Pocus and the phones just kept up with every high and low. Super value, Sony knows how to make headphones. For the money, you can't go wrong.",
        "I've owned several pairs of MDR V6 headphones over the years and they've always been top notch. A friend wanted some headphones for Christmas so I bought another pair. They looked the same in the package, but when he opened them on Christmas, they looked and sounded like a pair of 20 dollar headphones. Very cheap material and the sound just wasn't there.",
        "If you see these for over $100, you are being ripped off. Don't pay more than that. For $100, these are a steal. I've seen these being sold for over $300. What's happened to Amazon. I'm sure they know that price is outrageous. There are far better headphones for that price that would kick the crap out of these. Be aware.",
        "I owned the 7506, a similar model, for 10 years, very durable. So I bought v6 for a second pair and functionally they're the same. Now I have two extremely durable sets of headphones. The stock earcups go in a year, beyerdynamic has very plushy durable replacement cups, the brainwavs memory foam cups are less durable. Great sound, real workhorse, I wear these 8 hrs a day programming, year after year. I can walk away from my desk, wearing the headphones, as the coiled cord stretches out surprisingly long",
        "Best headphones for the money in my experience. Terrific sound quality, are comfortably snug on my head without being too tight - I have a medium-large head, but I think the headband quality means these will fit a broad range of head sizes. - the foldup mechanism improves the portability. These aren't as portable as Beats, but I'm also not a shill. I would go for this model over the \"for digital\" ones because the cord on these is an appropriate length, whereas the cord on the other model is pretty absurd. Use: today I have studied for 13 hours so far. They feel fine, sound great.",
        "These replaced some Sony studio phones I bought in 1999. I loved those old phones, but the cord end finally gave out. The new phones have better sound quality, but the actual speaker element has a tiny wire connected to one side. This tiny wire can get caught on stuff so you have to be careful. I loved the old design with the two headphone \"springs\" conducting the audio from one side to the other.",
        "They're okay and definitely considerable at their price level. However I still prefer more flatness and controlled sound from my ATH-MX40 at this price level. But then again to each it's own, sound is subjective to each of us; and I still use them regularly with no gripes. Although not really tops in \"comfort\" level with their ear pads, but not bad either. Also don't care too much for they're molded (not detachable) cord. But then again, I knew that ahead of time. I would recommend these to others, I'll update if something changes. So far they've been good for the last 1/2 year.",
        "Had these for a week or so and can't comment on the durability, but I'm expecting an issue with the Earp ads eventually and perhaps one of the channels. What I wI'll say is that these are NOT true over the ear headphones...unless your ears are the size of quarters. With that said, THEY HURT over time from the pressure on your outer ear. Wish this wasn't the case because I have wanted the for a long time. The price was certainly right.",
        "I'm still using these headphone daily 8 years later, and I haven't been gentle with them. maintenance: Every year I buy new ear cover fabric. I accidentally ripped the cord out of the headphones and had to solder the wire back in. Multiple times, I've stood up while the cord was wrapped around my chair and they have been violently ripped off my head and onto the floor. I've traveled the world with these in my backpack, and they always snap back together after being crushed apart. The sound quality and physical headphone structure seem indestructible.",
        "These headphones have a very sturdy build, they can fold up very nicely. Very lightweight, comfortable on your ears, and the cord is extra long of course. The screw on adapter does come with it, so you can plug it into the amp/peddle/switch/board jack. Nice for their price, though when you extend the headband, so it fits a larger head, the metal, and the wires that feed into it, look and feel like they could break at any moment, makes me question the life of these, though I will try to be extra careful, I'm skeptical, a good 4/5 though so far.",
        "I have both sets of headphones from Sony in this class - the Digital Set and the Professional Set. I think they are exactly the same headphones, in their look, their size, quality of sound - everything. Both sets perform very well and do exactly what I need them to do. I really like the coiled cable, as it doesn't get tangled and it won't pull the headphones off your head if you accidentally exceed the length of the cable.",
        "I needed a reasonably priced set of headphones and a sound engineer friend said \"most pros use The Sony MDRV6 Studio Monitor headphones,\" I have had them for 2 months, so they are nicely broken in - and WOW! I have a Woo Audio WA6 tube headphone amp and that with the Sony's is excellent. Strong, slamming bass, clean highs and an articulate midrange. Even the detail and soundstage is impressive. No wonder the \"industry\" uses them. Definitely give them an audition. Recommended A+++",
        "Upon opening the package, everything is how it should be - however, instead of the vinyl/leather storage bag it had come with the nylon one. Now, I've done a little bit of research and that usually indicates that these aren't actually the authentic set. However, I've also been seeing people saying that the nylon bag is a new thing and that these headphones are indeed legit. I have no way of confirming that however, but they sound good. I'd imagine that a counterfeit one wouldn't, but these ones do. Still unsure, though.",
        "This is the second pair of MDR v6's I purchased in the past 20 years. However, the build quality seems to be different than the originals i bought many years back. Plus, the volume seemed lower on one side. But most importantly, the packaging box, as well as the included case was different (nylon vs vinyl). All in all, I don't know if Sony changed their manufacturing, or if I was sent a counterfeit.",
        "My first experience with these was at the local low power FM station where I was a volunteer DJ. These 'cans', as they call them, are excellent. They have a very flat response, which is excellent for applications like radio stations, but also very nice for casual listening. If you're not a bass junkie, these are excellent.",
        "This is my third set of these headphones. My previous 2 were the 7506 model but I hear they are exactly the same. I kept selling them in am attempt to upgrade to a more expensive model but I keep coming back to these. They sound so clear without the sibilance that has driven me crazy with a lot of other pricier headphones. The bass is strong and right without being excessive or muddy and the overall sound is very balanced and never tiring. I can’t recommend these enough",
        "These things are simply amazing. The frequency response is great, the volume can go high enough to physically hurt without any distortion, and the folding and bag for portability is a nice plus. I've put hundreds of hours into these things, between my job, mixing my music, gaming, or just listening to music. They work great in any situation. They feel like premium headphones, unlike most gaming headsets and cheaper over ear headphones. I would definitely purchase these again and I would recommend them to anyone in need of sub-$100 headphones.",
        "After a horrific experience with a Sony computer, I stayed away from Sony products for years. But, OMG, these headphones. Go into any radio station, or any music studio, and you'll see Sony MDRV6 Studio Monitor Headphones. And there is a reason. They are just that good. Lightweight, comfortable and incredible sound. Parts available so you can repair them if needed. Absolutely better sound than anything I have ever used. If you are using anything else, you are simply wrong. These are the industry standard, and for a good reason.",
        "I'm not an audiophile but I like my monitors. Very rugged, too. I just throw this in my computer bag. It's been 8 years and it still works like a champ. I've only had to replace the original earpads with aftermarket ones because the original ones fell apart after 2 years",
        "It's amazing to think I bought my first pair of these headphones back in 1988. After the right earpiece went out after 25 years of use, I went searching for a replacement. They are tough to beat in the ~$60 price range and I've been very happy with them. I did find a comparable option - the, which I bought for my son last year on sale for $35 (directly from B&H Photo), which are normally $50. I compared the two back and forth and they are VERY similar on sound and comfort. The MDR-V6 appear to be made in Thailand now instead of Japan, but build quality appears to be the same.",
        "Sounds great! The earpads are cheap. I tried replacing with some other pleather pads I had, but it overemphasized the bass. We shall see if velour is worth what all those people online say. Other parts look/feel cheap and I wish it had a detachable cable. I should say it came with a nylon bag, but other signs say this is a genuine article. Most importantly, how it sounds.",
        "Lightweight as compared to Sennheiser HD280's, the sound is accurate, crisp and clear. I wear them for hours comfortably. Hardly any ambient sound isolation, as is common with designs of this era. Very sensitive, doesn't need any additional amplification if playing from a mobile device. However, if you DO add extra juice via a headphone amp, I have yet to get any distortion even at max volume. Comes with a handy carrying bag with a SONY logo. Based on build quality, I'll probably be enjoying these for many years.",
        "The headphones are very well made and the sound is crisp and clear. I can wear them for hours with no problems, although my ears will sweat a little bit because of the fake leather ear pads. The worst part about these cans is that the ear pads WILL break apart, so you will have to replace them after a few months. Fortunately, this is a very easy process that anyone can do in just a few minutes.",
        "For the MSRP of $60, these are great headphones. I bought my pair directly from amazon a few years ago at this price. I thought amazon had rules against price fixing and unreasonable markups? Not sure how these have been allowed to be listed at over $300.",
        "Nothing better for the price and blows away most priced above IMHO. I've had one pair for over 30 years and they still make them. Why change what is already a great thing? Great for mixing and listening. Very close to flat with the perfect amount slight color. Not overly boosted bass but has a nice strong bass response. Very clean sound. No muddy sound. Can hear all ranges clearly and keeps a good amount of noise out without sucking on your ears. Comfortable. Be sure to rest your ears often as it's easy to get lost listening for hours. They are a fantastic pair of headphones! Enjoy!",
        "Glad I found these to replace my 13 year old Sennheiser HD 280's. I'm able to hear notes I didn't know existed in some recordings. The adjusty parts have a satisfying click, and they feature numbered notches so you can measure how crooked your ears are. Build quality feels at least as good as other 'phones in this price range. These haven't really changed since the 80's, and now I understand why. I might pick up a pair of 7506's just to see what's the difference sounds like. Also for a backup pair, since now that I love them Sony will probably discontinue the things...",
        "I have purchased multiple pairs of these headphones over the years and each time I have been satisfied. The price has gone up a bit recently and I can only assume this is due to the recent discovery of these cans by a new community of audio enthusiasts. Only quality issue I've ever experienced is damage to the cable near the 3.5mm jack from nearly a decade of use (and abuse). Definitely recommend these to someone looking for solid headphones for less than $100. One of the best products Sony has ever made. I did notice that the packaging has undergone some minor design changes since the last time I purchased a pair.",
        "I've been using MDR-V6 headphones for over twenty-five years, and they're still my favorite. They aren't exaggerated and I really like the transparent sound, no boomy bass or strident highs. The only problem are that the ear cushions are somewhat fragile and they don't last as long as I'd like.",
        "This is a great headset, especially for the price. They sound really good and are very sturdy. We are thinking about buying a few more sets for our studio. That are not noise canceling which is exactly what we want for a more true sound.",
        "I'm not a picky audiophile, but I do enjoy listening to music almost all day long. These things sound great. They FEEL sturdy and well-built. I also bought some replacement ear pads (the velvet ones) that feel so comfortable. I wear them for hours every day. My one disappointment is the cord. It's coiled, and WAY too long for me. It usually just ends up in a coiled mess in my lap or on my desk or something. I understand they want it to be hardwired into the headset to avoid any \"signal loss\" from the plug connection, but it does make this less portable. I guess that's why they're \"Studio\" monitors!",
        "I RARELY write reviews, but I'm gonna just throw in my appreciation to Sony for designing and producing extremely well made headphones at the best price for the quality. The sound is top notch, nothing I've listened to has beat it except some VERY expensive speakers. Don't plan to use these for talking online or talking while using them, they are slightly noise isolating so you will have a little bit of trouble hearing yourself and others. Other than that, they are fantastic general purpose high fidelity headphones. Cord can be annoying if you're close to your device, but if you need length it's great.",
        "I have had these for 7 years and these are fantastic headphones for the price. Two notes on replacements you will need if you decide to own these. 1. The ear cushions will flake and fall apart in a couple years. When this happens buy \"Beyerdynamic EDT250V Headphone Ear Pads Black\" and these are much better than stock and will last forever. 2. The plug breaks too after a while. You can solder this one in place \"Rean NYS231G 3.5mm Stereo Plug Nickel Housing Gold Plug\".",
        "All headphones have their own sonic characteristics. These are fine for me. They are clear and distinct and I feel comfortable listening to music with them. The long coil cord is a definite plus. Good product for the money.",
        "Very good sounding headphones. The build quality is great. Not really for walking around in due to the long chord and bulky jack. These are great for my desk at work. They block out all office noise. The jack is so large that it sticks out of my pocket and the chord is so heavy, it dangles at my knees. Minor gripe: the chord came slightly deformed from the packaging.",
        "Perfect Studio Monitors, even response across spectrum, crisp clean highs, snappy mids, and supurb bass. Far more than could be expected at this price range... I use them for listening to music from a Denon AV unit, from my Android phone, and practicing guitar connected directly to my Marshall amplifier (sound reproduction is accurate)... Solid build quality.",
        "They're not *active* noise cancelling, which is good because you don't want that for production. As a monitor, the headset is A-grade. For entertainment purposes, it is phenomenal. Be careful that you actually get any work done. I caught myself listening to Beethoven and Black Sabbath for over two hours before I made a single recording. I use them for VO/narrating.",
        "I've owned a pair of these for at least the last twenty years and have never found another pair which I liked better. Sony hit a home run with this headphone. When Amazon came out with a \"giveaway\" price I just couldn't resist buying another pair \"just in case!\" The only thing I've ever had to do with my original pair is to replace the ear pads and they were not expensive at all. As I recall, I bought a pair for under $10. Every one of my Audiophile friends is always surprised at the natural sound they produce. These are my lifetime phones.",
        "I've had a pair of the SONY MDR-V6 cans for about 12 years when the right side went dead. Found the problem was a defective connecting wire, but repairing would be as expensive as a new pair! So I bought another pair. These headphones are comfortable for wearing several hours at a time, with sound quality that more than satisfies my needs.",
        "I would give it a 5 but not sure how well Sony can disinfect or sanitize the interior reaches. Anyway, the cans sound wonderful. The refurb did not require much if anything, and the appearance was as clean as possible. The padded earmuffs are comfortable. The unit was repackaged in sealed polyethelene bags, within a sturdy box. I like pipe organ music. Should I say more? The headphones reproduce as well as anything I have listened through.",
        "I bought 2 pair during a Prime sale because I had a pair from a few years ago & knew the sound quality to be excellent. To reduce possible hearing loss, it's important to me that my two teenagers reduce earbud usage as much as possible. These headphones cover the ear completely, making them more comfortable for longer periods of listening. The sound is excellent and accurate without all that forced fake bass. My kids are very particular and both are very happy!",
        "I bought my first pair of MDRV6s in the late 1980's, and they are still going strong. I bought this new pair for my daughter because she kept taking mine! I was pleased to see that the packaging was the same as I remembered from back in the day, and the quality seems the same as well. Wonderful to see a product that stands the test of time and is still being produced!",
        "Over all these are just Awesome ! Neutral sound , I mix live and these are just perfect for me . Blocks outside noises and delivers detailed sound .",
        "Got these in the mail and they blew my mind, I'm by no means an audiophile but I've completely fallen in love with these headphones. The sound is super neutral and using the equalizer your phone you can tune it to your liking, personally the bass is just punchy enough and it sounds really good in the mids 5/5 would recommend to anyone who wants great headphones at a relatively low price. My only complaint is the wire is suuuper long and can be a pain to transport but it's not that big of a deal",
        "I bought this pair of cans on sale for about $50. A steal! I bought these to use for mixing and monitoring music. If you want to buy a pair of headphones for listening to streaming or compressed music, you might want to look elsewhere. These are cold and clinical. You will hear ever compression artifact, especially cymbals and sibilance. To my ear, they are quite balanced across the spectrum, not emphasizing any particular band. They are comfortable enough to wear for hours at a time with no noticeable fatigue, only a bit of sweating perhaps. The included bag is very convenient for traveling with.",
        "I had a pair of these in the 90s which had a stellar build, excellent audio quality, and lasted for years and years with hard use. I purchased this pair in 2014. The audio quality is good. Unfortunately, the build quality is not great. I've given this pair moderate use, and the black ear cup lining is falling off -- exposing loose foam that won't last.",
        "BEATS the you-know-what out of other super-trendy overpriced over-priced headphones. These are the real deal sonically - no artificially boosted bass and treble. Folds up small in a nice bag that is included. I have been using them (and gifting them) for 25 years. So glad they don't change this model. All the top musicians and recording studios use them - I guess thats why they have been around so long. The leatherette ear pieces are soft and comfortable but decompose after a few years. Sony sells replacement pads but it's not worth it considering these go on special for half a Jackson once in a while and that is the time to grab another pair.",
        "At this price point, these are a great value comparatively. I am not accustomed to the sparsity of tones and flatness required of studio headphones versus consumer headphones. They are for the studio alone. Working very well with my Yamaha MG06X mixer with -20 db and xlr cable inputs into a Zoom H4N. It's a fantastic podcast studio setup.",
        "These had unbalanced audio. Left ear dropped sound and started buzzing. Tried with multiple sources (studio sound board, computer, media player) Tried to exchange and was told had to return.",
        "Bought this to replace my last pair of the same which lasted 20 years. Only had to replace it because it fell onto concrete and landed just the right way to break the plastic part that holds the earcup on. It still works though but I bought the new one so I would have one that still stays on my head comfortably. I was still using the broken one for a month.",
        "3 stars for being a great product for the price, but questionable if It st ill has Brand support, explanation below. I just got off the phone with a Sony Support from eSupport. I was informed that, it is impossible to buy these new MDR-V6 from the warehouse. (unless it's old stock really old stock). and anything that is sold these days is most likely refurbished, and resold as new(?). I only called to ask about Nylon/ Vinyl bag.. Which apparently is not a factor of authenticity any more of the headphones, according to some threads online. Either Sony hasn't updated their product profile or it's true.",
        "Bought my first pair in 1991 and they still work after going through 4 though years of grad school and then being at work since then on a daily basis. Great headphones. Block out most outside noise but are not noise canceling at all. Great quality sound, very comfortable as I have worn them for 10 or more hours straight multiple nights back in school.",
        "Sounds great. I wish they would make a new version with a removable aux cord and better ear pads. The ear pads on my broken Turtle Beach Recon 50 fit these perfectly and are much more comfortable than the original. I also tried the 1/4-inch adapter with my old record player and it sounded great. I could really hear every microscopic scratch on my old Hotel California record.",
        "I have two pairs of these for drumming. One is hooked up to my Vdrum module and they work great both at shielding the outside sound and in the dynamic range of the samples they are able to reproduce. The other pair I use to play music over my phone while playing on my accoustic drums and they let just enough sound in that I can hear my drums over the music I'm playing to. Great headphones.",
        "I bought another pair after my last one broke. I had my last one for 12 years. So of course I had to buy another one. These are quality headphones. The only downside is after a free months the black ear muff pieces start flaking off. But if you buy a better replacement one for a few dollars then it's an easy fix. That's what I did. I loved my headphones. Only one I ever use.",
        "Fantastic range, excellent cord and supremely clear at loud volume. Do yourself a favor and get these or the MDR-7506s right away. The 1/4 adaptor is great because it’s a screw on not just plugin. The way they collapse is a thing of genius. Size allows for full coverage of the ear so you can wear for hours without discomfort. Replaceable ear pads mean these should last you decades...unless you’re one of those people who don’t respect cords. I got these on recommendation from The Detroit Cast Podcast and they couldn’t have been more spot on.",
        "Love these headphones. Like others have mentioned the cord is long. I deal with it. A couple of Velcro tires and it's under control for me. Just keep that in mind. If you're looking for a quick portable pair you may think twice. But If great sound is the priority these are excellent for the price point. I would certainly buy them again if the need arises. They are comfortable to wear. I would like to try the replacement velour ear pads I've seen for sale. But the stock pads are holding up great so that may be a while. A+",
        "I started recording guitar & vocal at home and made the newbie mistake of mixing down with a pair of good quality headphones but NOT studio headphones. After spending a fair amount of time tweaking & EQing that first mix I played it back on monitors. All the rich mid-range sound I heard on my headphones wasn't there! I've since learned to use this type of headphones, flat response out so you're not fooling yourself as to what actually got recorded in your mix.",
        "Professional grade unit. I have used these earphones for dj for 12 years and they still sound as good as many of the top of the line earphones coming out these days. These are studio standard. You just can't go wrong with these.",
        "This is my third pair since the late eighties. I use them in conjunction with my studio monitors to mix music. They have great flat response across the whole audio spectrum with very little coloration from the housings in my opinion, and good isolation from outside noise. Best sounding headphones I have ever heard.",
        "These are not bad at all. Fuller spectrum & decent build. 'Bout time. Got sick of trying out brands & not loving much about them. Cannot afford more so these are great. Solid lows feel more than any other set so far, with a chance of them lasting more than a few months like cheapos. Worth it, especially if you find covers you like to extend them & comfort. Somewhat tight & don't have a big head. Just stretch em out.",
        "What more to say? The sound quality, for me, is outstanding. As some reviewers said, I now hear things in music, on TV and in my video games I hadn't heard before. I'm sure there's a con somewhere if I were nitpicking, but great sound is what I was after; great sound is what I got.",
        "I was pretty disgusted when my headphones broke after about 14 months of intermittent, casual use. The plastic part that attaches headband to cup broke and rendered the headphones useless. Sony studio headphones used to be great and long-lasting. No more. Whatever plastic they're using now is a disgrace.",
        "I’ve had these for a few years now, and am perfectly happy with them. They deliver rich, clean sound, are comfortable, and are a lot less expensive than most of their competitors. Please note that they are designed preserve the characteristics of the source, and as such, while they can deliver notable bass, rich vocals and clean highs, are not bass heavy, or otherwise artificially enhanced. If you enjoy the nuances of “pure” music, you’ll like these.",
        "These are our go-to headphones around the house. I also keep a pair at work. True that they are big, and perhaps not fashionable, but who cares?! They produce a great sound at low volume levels (which is difficult to do) and are comfortable to wear for hours on end. It's perfect because I can keep them down fairly low and if someone walks up to my desk I can still hear them and slide them off. Occasionally you'll see them on sale here and they represent an exceptional value, but even at full price they are a great choice.",
        "I'll start with this disclaimer: I'm not an audiophile, but I do like music. That being said, these headphones are fantastic. I bought them because I wanted something more comfortable than earbuds to listen to music while working at my desk in a lab. The headphones themselves have great sound quality, are comfortable for long periods, and are relatively cheap. Additionally, the sound is very well contained, so they're very nice when you don't want to bother people near you with your music. As a bonus, they come with a nice carrying bag and fold down for easy transport.",
        "These are amazing headphones - just don’t expect to hear a lot of bass. The sound response and clarity is outstanding - especially in the vocal range. I had to listen to all of my music over again, because these headphones allow you to hear things you didn’t know were part of the music. The drivers are beefy and can take a lot of manipulation. I plugged mine into my desktop computer and added more bass. They can take a whole lot more bass than they naturally emit. Maybe an amplifier would help. Very comfortable, and I love that they more or less cancel out all the sound around you.",
        "So far these are amazing just like the reviews say. They do get a little warm after hours of wear and the coiled cable is a real pain. Since I have these plugged in to my computer the coiled cable is right under my forearm and because it doesn't lay flat it's pretty annoying. It think a long cord is unnecessary, but I'm sure this way done for the studio so that you can work around the board with more freedom. But it does create excessive weight too. Overall they are a great product and a great price!!",
        "Exactly what I expected from a Premium head set compared to the $20.00 $40.00 dollar sets I been using for years . I can crank up volume with tearing up my ears . Clarity wat hinges YouTube concerts sounds like I right there . Dont care who rights any negative, thus are flat out great listening head set",
        "+ Great natural, warm, spacious,detailed and clean sound + Very well-balanced for all genres of music (classical, rock, electronic, trance, rap) + Comfortable for mobile use + Decent noise isolation - Non-replaceable coiled heavy cable In summary I can say, that Sony MDRV6 are best headphones for all media in smartphones. You can not find better headphones under $120",
        "As a Sony fan and owner of the Bose NC Quietcomfort 15 headphones, I can attest that these Sony MDRV6 sound outstanding! The full frequency range is very apparent (using ALAC lossless + the Teac HA-P50 Digital Audio Amplifier) the Sony MDR provides beautiful full range sound. The headphones also provide excellent sound directly from my IPhone 6+ with no strain on the amplifier. Note that these are not noise cancelling...but best used in a more quiet indoor or outdoor environment. The Bose QuietComfort 15 are best used in noisy locations and a must for airplane travel. Reasonably priced and worth the money!",
        "I love my MDR-7506 headphones, and they’re still going strong after about 15 years except for the cushions, which seem to rot after about 5 years. I purchase the MDR-V6 as a spare. It’s virtually identical except for using chrome instead of gold on some of the metal parts and a slightly less bright EQ. The MDR-7506 has just a bit more “sizzle,” as if you were sitting a little closer to the band. I like them both.",
        "These headphones are a near-perfect marriage of clean, accurate frequency reproduction and total comfort. Highs are bright but don't shatter. Bass frequencies are deep and restrained. I especially appreciate the uncolored midrange. The earcups conform nicely without pinching and the overall fit is comfortably snug. Recommended.",
        "Great studio headphones at a good price. THey just don’t fit as snug over my ears as I would like, I can’t get the right setting so that they both stay tight over my ears, one always has to lift off at the bottom of my ear. Does that make sense? As far as sound quality, though, they’re good.",
        "Best headphones I've ever owned. Very comfortable, light over-the-ear headphones. The sound is very crisp, and I definitely hear things in my music that I hadn't heard before. These are great value for the price, and are definitely higher quality than more expensive headphones I've owned (e.g. Bose). I wear glasses, and these are surprisingly comfortable even with my glasses. They're also very comfortable for long periods of time (an entire work day), unlike many on-ear head phones and in-ear earphones. Would recommend and purchase again.",
        "At this late date I don't have much to add to many of the great preceding reviews. I have a set of Bose headphones with which I listen mostly to music when working at my desk/computer and a Sony MDRV6 (mainly for when I am watching TV) that I have had for nearly 7 years and it is still going strong; that is why I purchased this second set - and the price was too attractive to ignore. Throughout the years I could not tell any difference in sound quality or clarity; and since rap music is not to my musical taste, I have no issue with the \"bass\" notes as stated by other reviewers.",
        "The third pair of these I have purchased over the past 27 years. First ones I bought at the PX when I was stationed in Germany. Loved them, until I lent them to a friend and he blew the left speaker. Would have cost more to have them repaired at the time, but bought another pair from Fry's several years later. Still have those and have only needed to replace the earpads once. Handed them down to my daughter after recently buying a new pair. Deep bass and crisp highs. Great all around headphones!",
        "I've been a long time user of the MDR-7506. I have four sets of them between my office and home. So I decided to try their very close cousin. First off, the two sound different from one another. The V6 is more consumer friendly. A bit more forward in midrange whereas the 7506 is more accurate as far as my ears are concerned. The build quality of the V6 appears to be exactly the same as the 7506. That is, they are both really sturdy and built to last a long time. I still prefer the 7506 but have no issue at all using the V6. Great set of cans.",
        "These are the best headphones out bar none. Wired headsets rules and these sound like a $10,000 speaker setup. No interference from anything, no batteries to die on you and need constant recharging. These are the ones professionals and DJ's use. If you wear a large hat, these will fit your head, it's not the kiddy gamer sized ones. I had my last pair for like 16 years and got these since the replacement pads for the old one was almost as much as this new one.",
        "Great imagining, definition, presence and clarity, with a natural and immersive sound stage. There are reasons why this set of cans has been in production for decades. They are that good and an exceptional value.",
        "As an independent/hobbyist producer/artist, I owned a pair of these several years ago. They were lost during a move, and I really missed them. I bought a different pair of headphones a couple years ago and they sound great - or so I thought. I finally ordered the MDR-V6's again, and what a difference! It blew that \"other\" pair out of the water; I forgot these sounded so great. They fit perfectly and comfortably. The sound is very clean. The only thing I don't like, and it doesn't affect the performance, is the coiled cord - a straight cord is just my personal preference. I would definitely recommend them.",
        "Best headphones I've used. I recommend them to any one who plans on wearing headphones for a long period of time and is looking for something in this price range. I wear headphones for up to 4-8 hrs a day at work, and sometimes more and I've been using these for years. They sound excellent and are super comfortable. The metal head band is sturdy but can be bent to ease or stiffen the ear pressure and the cable is outrageously long but coils up to a few feet.",
        "Outstanding quality sound. My preferred way to listen to music and movies.",
        "It's years later and I'm finally reviewing these headphones. For their price, they provide excellent sound. Their range is superb. I get properly-bassy bass and just-right tinny treble. Absolutely recommended for those wishing to save some money on headphones but would like good value. The extra long cord is a bit of a nuisance and a bit of a convenience. Depending on your setup, it can get caught in between other wires or underneath your chair, but at the same time you can cross quite a large distance with your headphones still one to grab something and still be listening to music or a skype conversation.",
        "When I first used these headphones, I thought I had a counterfeit one because the sound was horrible. Then I used my old portable amplifier for it and it was AMAZING. Overall 4.5 stars. The .5 is because it emphasizes more on instrumentals than vocals. I'd rather have balanced headphones.",
        "Had these for almost 5 years before they finally broke on me. These headphones are perfect for just about everything-amazing sound, great bass. love the feel. Heafy but not too big. They finally gave way after everyday use (and multiple flights) last week when the metal plug got bent and one of the rings on the plug got loose. The only design recommendation I would make is that the small wires above the ears have a poor plastic coding, after 2 years they finally split apart and had to be duct taped to be secure. For the next pair, I'll be doing that ahead of time. But for $80 bucks for 5 years? Can't go wrong here.",
        "They feel overly delicate and the sound quality is \"just OK\" in my opinion. Also the coiled cord is curiously heavy and the connector seems like it isn't seating properly as the left channel constantly produces a lot of crackling if you nudge the connector or pull on the cord at all. Never had that problem before. Sound and build quality of the Audio Technica ATH-M50 is certainly worth the extra cost. They are reasonably comfortable, but every time I pull them out I feel like I'm going to accidentally destroy them as I fidget with getting the ear cups out from their folded position.",
        "Great sounding headphones for the money! If you're familiar with Sony audio products you know that they're pretty much junk but the headphones are an exception to the rule. These can easily beat much more expensive headphones and beats or bose can't even come close, much less in the $50-100 range. Minus one star for the pads being pretty uncomfortable, I added a pair of Brainwavz angled memory foam pads for $25 to turn them into a great pair of headphones.",
        "These are one of the best sounding headphones I have ever heard. These things have crisp, clean audio, and good bass. The soundstage/immersion is also really good as well. These headphones fold up and include a carrying case which also make them perfect for travel, although the cord is a bit long (but is better then having a cord that is too short however), since the cord is coiled it can stretch really far. You definitely cannot go wrong with these headphones.",
        "These are excellent headphones for the price. I've had a pair for a decade and a half, and they still work perfectly and sound great. They're durable and excellent for traveling. Their sound reproduction is very accurate, which is what I bought them for. Because of this, they're very versatile.",
        "Great sounding headphones. Very clear. With an equalizer you can get bass and the bass is nice and bouncy, not muddy or washed out. Comfortable but YMMV Don't get these if you're just listening to bass heavy music on a device that does not have an equalizer. They are flat for a reason and they won't sound good right out of the box. They're perfect for me as I'm working on music production so I need it to be flat and then later tweak the levels correctly. I am pretty happy with the purchase. Gave it four stars because shipping was late and not everything is perfect but for headphones these are great.",
        "The sound that these headphones reproduces is simply amazing. Right away I was astonished by the vast details, crisp vocals and all the little details that was intended to be heard by the artist! For under $100, this is one of the best in that price range, it even sounds better than some higher priced headphones! This definitely sounds better than my Beats, and Bose headphones! These headphones are also very comfortable, feels much more durable than Beats and Bose. Based on other reviews, it seems that these headphones will last a long time! Buy it, don't hesitate, you won't regret it! :)",
        "I used to have a set of Sony headphones like this in the 80s. Those lasted 20 years. The quality has gone down quite a bit. I don't expect these to last that long. For this price point they are decent quality. I use them with my home guitar rig. Not great sound quality but they get the job done.",
        "Everything it is said to be. After a couple weeks of burn in these headphones were a dream (at this price point or even double the price). These are the first headphones I've felt that I could wear for an entire day without pause. Fit and comfort are top notch, except for the flimsy thin foam cover. Doesn't matter -- let it flake off -- it's a badge of honor ;-) Nothing is over-emphasized in these headphones. You hear a wide range without fatigue and never once is your attention interrupted by a nasty drop-off or overly aggressive attack. If I could find a comparable IEM I would be very happy.",
        "The best headphones I have ever bought. It's for indoor use only, comes with a bag, has no mic. The sound quality is over the top, especially the stereo sound.",
        "Basically the cheaper version of the 7506. Works great for basic monitoring.",
        "I am not in the music industry but when I'm listening to music, I appreciate the lyrics more than the rhythm. I suppose I like storytelling. I purchased these because of the high reviews. I am tired of replacing headphones and have never spent more than $30 for a pair. I feel like the lightbulb was turned on. I'm currently listening to Bob Marley and I can hear all of the nuances of the whole recording. Listening to music has a new meaning with these headphones. I am one happy customer.",
        "Can't believe the detail I can hear in the sound with the MDRV6 headphones. Excellent reproduction, separation & overall clarity. I'm hearing subtleties I didn't know existed in mixes. This is my first foray into studio level headphones, and I am very satisfied with this purchase. Equipment used for testing: Scarlett 2i2. I tried a blind comparison with the iPhone 6 & found the Scarlett clearly blew it out of the water (the iPhone had less clarity/was more muffled & also L/R crossover i.e. the soudstage was clearly smaller)."
    ]
}