{
    "entity": "Over-Ear Headphones",
    "text": [
        "Nice quality headphones. You know when the game is on or a movie you really want to turn up the sound but the person that lives in the same house is trying to sleep well here is the solution. I researched several sites and found the Sennheiser HD555 to be the best fit for my needs. Pros Great sound Good construction Very comfortable fit Not the least expensive on the market but not the most expensive either. I'd recommend to anyone.",
        "I use these headphone ALL THE TIME. I use them when listening to music on my laptop, I use them when I want to be in quiet mode through my guitar amp, when I'm chillin' in the hammock outside, ALL. THE. TIME. They leak some sound being open ear, but not an insane amount. That being said, not the best headphones if you're working in a cube or riding the bus/subway. For the price, these puppies cannot be beat in my opinion. I have owned many-a-pair of headphones, a couple in the same price range, and these are my favorites out of the bunch. They are comfortable on the head and sound fantastic.",
        "Got these in Jan 2010. My favorite headphones since. Modded them(can search online. Essentially removing the foam tape behind the ear cup allowing more air to be pulled in by the driver, resulting in better bass). Attached an Antlion modmic. Replaced the earpads, which I bought from ebay. I'm still using these. Very comfortable. Doesn't get too warm unless the the day is humid and hot. Though, I also got the 598SE during the xmas lightning deals. Not a huge difference. Just newer model. Update 3/17/2017: still working. I have 3-string braided the long cable to about half its original length.",
        "great pair of headphones! well balanced for the price. Very comfortable. it does not have boomy bass if that is what you are looking for. The Sennheiser Momentum on ear and over the ear both have greater bass output if you are searching for that in your headphones. the 555s have clean sound. Mine developed small cracks where the headband adjusts but they have remained durable since then for at least 4 years. If you can find these at a good price, you cant go wrong.",
        "I've owned these since 2008, and they have been perfect besides the plastic cracking a bit on the silver plastic slider bit above the right cup during a recent move. Super comfortable and they stayed sounding amazing, especially after removing the bit of foam from inside the cups (opens the bass up a little, small free upgrade). If they weren't discontinued I'd buy another few pairs just in case! I can't believe they've lasted this long, and I'm still using them! I just upgraded to the 598Cs and we'll see what those are like, hopefully quality hasn't diminished in the almost decade I've been using these.",
        "These headphones are truly amazing. they sound phenomenal for highs,mids, and lows. I have used them for gaming, music, and movies and i love them for all of them. The headphones are a little heavy after prolonged use but they are still more comfortable than most. The ear cups are deep enough so that my ears did not touch. The ear cups are also not to snug on my head. The cable is very long so use at the computer means that i have to wrap up the excess.",
        "I love these headphones. While I don't know how all the fancy specs factor into the sound quality, I can say that it is crisp and clear. These handle bass with ease and sound as if you are in the room with the artist. From classical to hip hop, these headphones deliver excellent sound. Something to remember is that these are stereo style headphones, meaning others close to you can hear the music while you use them. For that reason I wouldn't recommend using them on a plane, but for everyday use I highly recommend these headphones.",
        "Bought this to replace a set of Bose headphones left behind on a plane. Read reviews on Amazon and several others, selected the HD555 headphones as a good price/performance point. I am amazed. Never much of an audiophile, I have rediscovered my music collection listening with these headphones. The sound is richer, every note more distinct, every minor adjustment on the equilizer clearly audible through the headphones. They are so good, I cannot use them to listen to ambient music while working--becase the music will grab my attention in ways it never did before. For the price (~$90 when I purchased), these headphones cannot be matched.",
        "Through the trials and tribulation of my past headset purchases, I've finally found what I've been looking for. The Sennheiser HD-555 Audiophile headphones are not only the most comfortable headphone I've ever felt, but the most incredible sounding as well. Clean, separate acoustics with a wonderful crisp bass. The cups are large and fit way around my ears, with soft yet firm enough padding. I wear glasses and even after 2 hrs. of wear, I still hardly know I'm wearing them. I know there's already been many great reviews of these headphones. Listening to Porcupine Tree's amazing dvd 'Arriving Somewhere' with these ear jewels inspired me and I had to gush. Highly recommended",
        "I've had these for a couple of years now, using them for music and video games. The sound is great for the price, especially if you perform the \"595 mod\" (removing some foam on the inside of the vents). As others have mentioned, my headphones have also developed two small cracks that run down from where the headband is attached, but they seem cosmetic and have not affected the stability of the headphones when wearing them.",
        "....one who enjoys high fidelity audio... I believe that most reviewers I read here and on other sites perceive an audiophile as one who listens to music more with their wallet than ears. I also believe that most \"audiophiles\" can't remember replacing tubes in their stereo amps, calibrating turntables or perhaps even enjoying vinyl. But I digress...I'm an audiophile who loves good music, loud but full and for the money, you can't beat these headphones. Comfortable, works well with an MP3 player but are even better combined with a headphone amp. Great range when listening to a DVD at night. Break them in for a few hours and enjoy!! REMEMBER...it's what YOU like!!!",
        "Just realized I purchased these back in 2007 and decided I had no choice but to write a short review. These are a great buy at the price, comfortable, and have lasted me SEVEN YEARS. That's seven years of being dropped, put on and taken off, listened to, and traveled with on multiple occasions. I absolutely recommend these if you're looking for a vented pair of quality headphones. Hopefully the new model is just as awesome.",
        "I bought these when my Sony MDR-XD200 headphones broke (my fault, not the manufacturer). I thought they were about the same (though the Sony's were only $20) but it turns out my work computer has poor audio output. Listened to these on a personal computer and could hear every detail. Definitely worth it if you are listening to something with above average output but won't blow you away if the source doesn't allow. These are great headphones (comfortable, clear sound, good bass) but if you're in my situation, go with the MDR-XD200 instead. You won't notice the difference. If you have something with good outputs, these are worth the upgrade.",
        "When I first opened the packaging, I thought that these are \"very large\" headphone; but once I put them on, they are extremely comfortable to wear and listen to music. Only drawback is it needs an adapter plug (3.5 mm) to use with my Blackberry, making it stick out significantly on the side of the Blackberry. But to Sennheiser's credit, the HD555 does come with the adapter plug. I've been using the headphones for the past two days, and I totally recommend them. It also didn't hurt that I got them as part of a \"lighting deal\" on Amazon, for $69.99 (and they are currently $95.99 -- four days after I ordered them).",
        "My first \"real\" pair of headphones, and what a difference they make in sound. Having these at the same volume level of stereo/5.1 speaker setups is like a night and day difference in sound quality. You'll be amazed at what you've been missing. Everything is crisp; you'll discover highs and even mids that you never knew were in your music, and the bass is better than expected. It's not as powerful as what comes out of a sub of course, but it's definitely there. Some tweaking with your media player/receiver's settings might be needed to accommodate the new input, and you'll soon be thanking yourself for picking a pair of these up.",
        "I bought these 7 years ago and had them shipped to me in Afghanistan. Survived that bs and have only got better with age.",
        "I wear these on a daily basis for gaming and music. 9'8\" cord is sometimes a bother and sometimes a godsend. An example of them being comfortable is I sometimes forget i'm wearing them and when i walk out of the room they pull off and drop to the ground, this has happened often enough for me to break the cord(which you can purchase replacements for and they are really easy to install). In the 3 years i have them of me being pretty rough with them i've got one superficial crack in the side by the words sennheiser and one of my metal grills is dented. Neither effect the sound quality.",
        "There is soundstage with these for miles. Especially with the foam mod. Used these for over a year, THE most comfortable headphones I've every owned. They lose a bit of their spring after a few years( i bought mine used). But still great comfort compared to AKG K7XX, Beyerdynamic DT series, HyperX Clouds.",
        "There's really no need for me to write any more than what has already been said in other positive reviews for these headphones, every good thing you'll read about them is 100% true. Great sound quality, light-weight, comfortable, other headphones tend to get hot on your ears after several hours of use but I haven't noticed that with these. The only down side to them is that they leak quite a bit of noise on higher volumes which is good for when you want your friends to hear what your listening to but bad when you're in a library and wanna jam out.",
        "Nice set of headphones for less then $100. I use them for watching TV through a Denon 5.1 receiver and the sound is very good. Seem to be very sensitive since I don't need to turn the sound up very high for adequate vol. Appear to be well made and are comfortable for movie lenght. I considered other brands but took a chance with these, based on good reviews, and I have not been disappointed. I considered wireless because I would prefer not having a cord but I have not been impressed with any I tried. They really can't reproduce surround sound but are very good for times when my wife doesn't want to listen to the program I'm watching.",
        "After my $600 Sennheisers broke (one of the ears completely gave out, even with new cables), I \"downgraded\" to the HD-555s. While the sound balancing is \"colored\" on these, many people actually prefer these. The bass is enhanced, although not to \"Beats\" level. These are comfortable for long listening sessions, sound great, and fit larger heads (I am the sad guy who never wears hats because they never fit). These are worth every penny. I use for music, video, gaming, and listen-only audio calls. A great piece!",
        "these sennheiser headphones really live up to their reputation. the sound quality is excellent and the comfort cant be beat. these are sort of vented so you can still hear whats going on in the room but when the sound / game / music comes on, they are crisp and deliver a great balance of bass to treble. they are the most comfortable pair of headphones ive owned and are great if you wear glasses. my only concern is that the earpads may get dirty over time but other than that these are awesome headphones for the price.",
        "These headphones are in my opinion the best set of cans at this price point. The sound field is amazing. I could ask for a bit more bass, because I like it, but what these cans give you is clean sound without exaggeration, if that makes sense. I could use them all day everyday. They do squeeze my head just a bit too tight, but that has happened with every set of phones I have had that didn't fall off my head. If you are willing to spend this amount for headphones, these are a great choice.",
        "Bought them years ago, still one of my favorite sets of headphones due to the open system format, but careful listening too loud in public, everyone else can hear your music/podcasts too",
        "I absolutely love everything about these headphones. I do voice over work and my only complaint is that they are so clean and crisp, that it makes me super anal about audio that would be totally passable on any other pair of headphones. They pick up the most amazingly finite sounds. They are also very comfortable. I've worn them for an entire day repeatedly and they haven't bothered me at all. I've tried bose headphones and monster headphones and while the sound quality may be close, the comfort can't be beat. I love these headphones and their price!",
        "I bought these for my son. After a year of almost daily use, he had the same trouble as some of the other reviewer's. The plastic arm cracked and broke off. He went on Sennheiser's website, downloaded the return form, filled it out and sent the headphones, along with the invoice, to the company. In about 2 weeks, he got an e-mail that they were sending him a new pair of headphones, which he received a couple of months ago. So yes, there's an issue with durability, but Sennheiser does stand behind their products.",
        "I like these head phones a lot. They're very comfortable around your ears and doesn't heat up as much. Longest I had on was around 3-4 hrs before I started feeling hot around my ears. Sound Quality isn't the best, but it is the best in it's price range. Quality of it, surperb since I had it over for 2 years and it's still working.",
        "good sound quality and light. After many years of use small cracks formed on the fittings that lock onto the headband. Still works and not planning to fix or replace until they stop working or fail.",
        "My first purchase of a 'real' set of headphones. The earpieces and headband are covered in felt and feel great. They fit comfortably even over a pair of glasses. It should be noted these are open cans, meaning they do not isolate you completely. Sound does leak, so someone sitting in the room with you will be able to hear what you are listening to. This is by design. Not a big deal, but definitely a consideration depending on where you want to use these. Sound quality is excellent even at higher volumes. Overall, a great deal for the budding audiophile.",
        "Purchased the Senn's has needed a replacement for 30 year old AKG's. Researched the brands, and although loved the AKG's, decided to take chance on Senn's based on positive user reviews found. So far have not been disappointed! For both vinyl and cd, sound quality seems well balanced. They are a little 'clunkier' then my old AKG's, however they are still pretty light, and comfortable. I would prefer a little longer cord, but this just based on distance between my receiver, and couch where listen from. Delivery as usual was quick and efficient by Amazon. Have had for about 5 months, highly recommend so far!",
        "Purchased these 5 years ago and they are still going strong. Very comfortable to wear for long periods of time. Cord is long enough to walk around my room while still being connected to my TV or computer. Sound leak for other people is on the higher side but these are not for isolation, but for quality sound reproduction.",
        "These are very very good quality headphones. I am not a professional musician or anything like that. I got these with the main purpose to use them to do transcriptions, and the difference with the old headphones I had used for over a year before that is significant. These are very comfortable on the ears. They provide very good quality sound even though the recordings I listen to often are less than perfect. A very good product and a brand I did not know about, but I am going to trust and recommend from now on.",
        "Open element phones are not great for an office environment but if you keep the volume level down it woks okay. If you have difficult coworkers they miht object to the sound bleed. I like that removing the foam inside maks them pretty much the same as the 595's. I also like that I can hear people talking to me and listen to music at the same time if I keep the volume low enough. My favorite aspect of them is the comfort for 8 hour m-f workday listening.",
        "purchased these used as they no longer sell them, as they have been superceded by a newer model. in my opinion these are very good phones, and if you buy them used but in good shape, you stand to save a good chunk of money. think that's important to most of us who don't have anywhere near a steady supply of cash that we can use to fund good things but not necessarily life and death essential things.",
        "I bought this item for my father who shopped endlessly for headphones. The specific purpose was for an Ipod. The fit was somewhat snug at first which was disappointing as that is one of the deciding factors in buying these specific Sennheisers. After a couple of weeks however, they're broken in and he loves them. He'd even tried on more expensive Bose and was happier with these. I would definitely stick with Sennheisers for all of my headphone requirements in the future.",
        "Update after almost 4 years. After regular use of these headphones for the past 4 years, these headphones are still alive and well. The sound quality has not degraded and I feel that the price I paid was worth it, which was 89usd at the time. If I was looking to buy new headphones, I would gladly pay the price these are currently at. As far as wear and tear, the padding on the headband has frayed a bit, but not an extreme amount. In closing, if you take good care of these things, they will last you many many years.",
        "The sound quality is amazing, you will hear far more detail in your music that you didn't know was there. Cons: Heavy, bulky, ears can get hot, cord is very long, mini plug adapter is perfectly flat, any devices with a recessed mini-plug will require use of an aftermarket plug adapter. -------------- Cracked at the swivel on both sides. They replaced them with refurbished 558 headphones, which are far better.",
        "HD 555 is very comfortable and of high quality. I received excellent customer service from amazon. The bass is decent and sound is crystal clear. After getting this set of headphones I could no longer listen to mp3s anymore - because I need to listen to lossless musics so that the potential of these headphones can be fully explored and experienced. The only thing that isnt very perfect is that it is not closed-designed. The sound tends to leak out of the cups, which makes the sound not very \"shocking\" compared to that of the closed-designed HD280 I have. Overall ,the sound quality is great, definitely recommended.",
        "Having been a Sennheiser headphone fan for years, these do not disappoint in the slightest. Deep bass, good mid, and nice treble all in this package. The headphones fit well against the ears, even if you have bigger ears or a big head. These can be worn for hours without any discomfort. Only the most discerning audiophile would notice a difference in these and the more expensive headphones.",
        "Not the best quality out there, but great for it's price",
        "This was my first audiophile headphone that I've gotten. Even after long hours of watching movies with this, my ears don't feel as \"plugged up\" with the sounds. Also it's got such a length that I can lazy around on the couch to watch something. I've used this on the keyboard that I have, and the piano sounds absolutely clear. It's just useful to have such a headphone. But make sure that if you're looking for a headphone to be used outside of your home, this isn't the one. :)",
        "Awesome sound, people complain about how they can hear it more than I can. Co-workers are just having some sort of envy compared to their Sony or Sennheiser HD-515's. This isn't a great review, but it's a cheaper version of the 650's and it's very comfortable with long term usage. I hate the pleather Sony headphones, the cloth ear pieces are awesome. If you're browsing for a Sennheiser, you know the quality you're getting.",
        "UPDATE 3/10/2018 - Things are still running strong 8 years later. I've had these headphones for over 3 years and they are still going strong. Ran over the cable countless times with my chair and its still holding up. Cable is really long! Overall, this headphones are very solid.",
        "I performed the sound mod first thing. This provided amazingly crisp bass tones. Almost too crisp as I'm used to all bass notes sounding alike. The good: I researched at length trying to found the best sound quality to price ratio, and these were unmatchable even without the mod. The bad: Plastic construction and a massive frame. I can picture these breaking a lot quicker than my old Grados SR60s. Plus these are huge. That said, they are still the most comfortable circumaural headphones I have ever worn with glasses.",
        "So I have these pared up for use on my PC. The soundcard I'm running is the Asus Xonar STX, and while yes, it may be overpowered for the cans, it still puts out beautiful music. I removed the foam pad to open them up some more. To be honest, I can't tell much of a difference as my ears are sonically inferior to most audiophiles, but I enjoy all the sounds enough.",
        "I am not an audiophile, but a Classical music listener for years. Over time I have had a number of headsets and these are very nice by that standard. I was impressed by the light weight and open backs of which I've owned a couple before this. The sound to me seems balanced and the bass is not over powering. I would say that the headphones are neutral to the sound. The pluses are that you can listen for hours on end without them becoming uncomfortable.",
        "The Good: Good sound quality. Design The bad: Can't keep up with lound bass (when you play them max LOUD) and they start cranking. Ears staring to sweat after you have them on for a while. Skin erritates because they headphones made of Velour. Overall: can't say that I'm not happy. I like them and I very satisfied with overal performance and sound. But they could substitute Velour to leather,",
        "These headphones are the most comfortable I've ever worn. These don't squeeze my head too tight, and the velvet material on the part over your ears is great. They're pretty pricey, but if you can catch these on a gold box deal, grab them up. My only minor complaint is that the cord is super long, kind of cumbersome if using it for an mp3 player or a laptop. Connected to the back of a desktop PC though, they're great. Also note, they're not noise cancelling.",
        "Decided to get into high-quality audio listening and saw that these were a good choice for entry-level. Bought them, and can definitely tell the difference between these and my old $10 koss headphones. Also bought a sound card for my computer and started recording music in FLAC. (free lossless audio codec/supposedly much better than mp3) I can't really tell FLAC>mp3, but can easily tell between these and any other headphones I've had on. Good fit. If they're too tight, you can have them stretched out on a chair arm or something. I didn't have to do this and have a good sized head and wear glasses.",
        "Best $100 headphones I've listened to. I believe for most, these should be all that you will ever need. Spend any more and you might not be able to discern the sound improvements. Spend less and you probably will - or have uncomfortable ears. Sound is excellent, stereo is stereo, and they fit very comfortable over my glasses-supporting-ears during long listening sessions. 3 meter cord was a tad short for reaching my stereo-to-couch and chair, so I purchased a Grado extension cable. You should too.",
        "I got a great deal on these....and they sound excellent. Music sounds crisp, especially with a headphone amp. Also works well with movies and games. The cushioning around the ear is very comfortable, and doesn't sweat after extended use. The fit is also not overly tight like the HD280s.",
        "First class Stennheiser sound at a decent price. My one complaint is the plastic side arms. The left side cracked shortly after receipt and has had to be held together with a binding of scotch tape In future I will not be buying any plastic headphones My moan that the cord is fixed and can not be replaced with an improved cord, or external processor for example the VERO from MIT.",
        "you are in a relatively quiet environment as they are not going to keep you in your shell protected from the outside world. Also, if your head is of a 30lbs pumpkin size they might feel a bit tight. However, if you do not stand in the middle of an intersection and your head is average one, what a sound! They need time to break in so they are just getting better and better like a good red Bordeaux. They just give you everything even what is subtle or otherwise hidden. I do not listen to heavy metal or heavy rock. Then, I guess you would not mind the outside noise anyway. I would recommend without any doubts.",
        "I'm new at exploring music with high quality headphones. I have bought many headphones in the past. Normally all in the 20-$30 range. I first started noticing the vast quality differences after experiencing a different set of less expensive Sennheiser headphones. If those sounded so good I dreamed what the more sophisticated headphones would sound like. So I bought these \"entry level\" audiophile headphones and am blow away. Well worth the cost.",
        "I've wasted much of my life by not buying these sooner. The hours spent listening to music, but not truly hearing it were all a waste. To put it simply if you use headphones for even a couple hours a day, do not waste any more time with something cheap. I don't know how these compare to other expensive headphones, but I do know how these compare to 20$ headphones from department stores. These are hundreds of times better than anything I've ever used before.",
        "I got these on sale for not even hundred bucks and I have to say that I love them. Awesome base.and treble, music just sounds amazing. The only thing that I don't like about them is the adapter. It makes the plug way too big and easy to.snap. because of adapter they look very silly when plugged to the phone or iPod and wire.is a bit too long. Also on both sides they cracked even though I didn't experiment their solidness before. I think its just a material failure. These ar.the only thing that I don't about them but besides I li e them. Music is like heaven and they are.super comfortable, the most comfortable I have ever worn before.",
        "The HD555 work for my needs, have a very large head 8 3/8 hat size, a BIG head. can where the head phones for hours an do, the sound is GREAT, am a HAM radio operator and the voice recantations is wonderful, music is wonderful, have some hearing loss am 72 an these baby's work for all my hearing needs and then some *****............walter",
        "These headphones are extremely comfortable for casual and extended listening. The overall sound quality is excellent, the articulation is precise and the HD-555's offer respectable, natural bass response. The only drawback is that the sound quality is so good, the difference between compressed audio formats (mp3 & AAC) and uncompressed audio (CDs) will become more apparent to you. You'll want to reload your CDs to your digital music library at the highest possible quality. It's also likely that after a few days of listening you'll be looking beyond CD quality to a higher fidelity format such as SACD or DVD-A to see what these headphones can really do :-D",
        "A good set of headphones with a sound that will lull you to sleep before your music or movie ends. A bit heavy and uncomfortable up top, but that could also be because I have a shaved head. Not too overwhelming on bass, which appreciably affords more listening pleasure and less headaches after your listening is done. All in all, a good set of headphones for the money.",
        "Pro's: Incredible sound in games and music on my PC. Very comfortable and I love the large area surroundingthe entire ear. I can still hear people talking, so the outside sound is not 100% shut-off. Huge difference from my old Senn 180 headset. Wearing glassess with this headset doesn't hurt or pinch one bit. Did I mention the incredible sound quality? Cons: The velour padding tends to be a little squeaky with my glasses, but I mostly wear contacts.",
        "I really like how comfortable these headphones are. It takes close to a full day of wearing them before they start becoming slightly uncomfortable. I'm no headphone aficionado but the sound on these headphones are clearly the best I've ever experienced. My only complaint with these headphones is that I unfortunately can't really use them at work. I like listening to music a bit on the loud side and sound unfortunately escapes from these headphones. Otherwise, they work great for home use.",
        "The sound quality is excellent. The only issues I have with it are that you are required to put an adapter onto the old school auxiliary input if you want to use it in a 3.5 input. Also, they do a poor job of keeping the sound within the headphones (everyone around you can hear them).",
        "I was kind of skeptical about the benefits of open headphones, I thought the surrounding noise would drown out the music. I was wrong, I could still distinguish each sound, the quality is excellent. I wear glasses and the over the ear made wearing glasses much more comfortable when listening to music. It also runs pretty well through an ipod, not needing an amplifier which is a plus for me. Overall a nice, comfortable product. Great for entry into the world of nice headphones.",
        "Love these headphones! After 5 years, they still work great and have such a nice sound to them. Just he warned, they are not to be used for quiet areas. They have an open cup do everyone can hear what you hear.",
        "These phones sound awesome, but they also really show the deficiencies of lower bitrate mp3's. Now I'm on a quest to re-encode my cd's with higher bitrate AAC. I also purchased a Grado 1/4\" female to 1/8\" male flexible stereo adapter to replace the included adapter. The included adapter puts a lot of strain on the mp3 player connector because it's not flexible.",
        "Purchased these for my twenty-something year old son's birthday. He goes through a new set of headphones every year! He absolutely loves them!! When you consider how much money I've wasted on other brands every year, these don't seem that expensive for the quality. I'd recommend them highly; couldn't find them at any discount stores -- luv Amazon!!",
        "There's a reason everyone recommends these. I've been using them for years and the quality is impeccable. And recently I got a job that involves extensive use of headphones. Guess what pair of headphones are used for all employees? Yep. Sennheiser. They're a staple for anyone that cares about quality while appreciating affordability.",
        "I am no audiophile. I just wanted comfortable headphones for use at work (office cube layout). These fit the bill completely. I can hear for the door, I can hear for someone calling for me, and I can hear the most perfect sound coming out of these. It's heaven, and it makes work less....work. Highly recommended.",
        "basically, if you want to pay over 4 to 5 hundred then you can get better headphones. So if you are a DJ or some super freak you can't go better than these...at the time i purchased them",
        "I have bought these after long search,they are so musicly correct,mid and high are the best in price class,bass is very correct,tighten,enough volume,but these are audiophile headphone,firstable for home listening,with dynamic driver for so realistic sound,sound channeling is great,U can improve sound with headphone amp,quallity is very high and they are very light,you can carry them for hours and dont have headache and no pressure in yours ears but they will worm yours ears,I'm very happy for having them,very nice,manufacturer should give some carrying case for them,I have listened all kind of music from jazz,blues,rock,metal,house,ambient and they are great with every kind of music,just put them on yours head and listen the music how it should must be!",
        "I picked these up in early 2011 from Amazon direct for 84.95. They have been really good, so good that my three teenage sons are constantly borrowing them. I figured I would buy 3 more of them for Christmas presents for the boys but when I checked today they are $129.95. I hope they come back down to 84.95 again in time for Christmas.",
        "I picked these up to complete my first set of DJ equipment because they were on sale and I'd had a pair of Sennheiser's previously. These are probably the most comfortable headphones I've ever had. There's no noise cancellation, which isn't a problem for me, but may be for some. The sound quality is great to my ears, but you can't turn up the volume too loud without noise bleeding out and disturbing those around you. Again not much of an issue for me. Bottom line? Good for DJ'ing or private use, Less Good for air travel.",
        "They're simply amazing, great sound, and what I like most about them is how comfortable they are. I can use them for hours, and even fell asleep with them on and slept through the night like that :) If I had one thing to complain about, that's that you can hear the sound coming from them if someone else is using them, so don't expect them to use them at the office or other places where you can bother people.",
        "I've had these 555s for a little over a year. They sound most excellent. The reviews that address their sound quality are spot-on. It's just... they broke. The left earpiece just snapped plumb off. A couple of months ago I noticed cracks forming, and last week I had two headphones. Not as good as a pair of headphones. Not good at all. Ok... is it unreasonable to fall asleep wearing headphones? That's all I did. I'm not a violent sleeper. Honest. Maybe I snore a bit, but quality headphones should be able to handle snoring, yes? So... love the sound, but bummed about the durability. Just saying.",
        "These really are great sounding headphones, but there are cracks in the plastic that are creeping further into the frame. It looks like it will eventually break. And of course, it would have been nice to have a 1/8\" jack with a slim 1/4\" adapter. I would even buy the adapter separately. Sennheiser, are you listening???!!!",
        "These headphones are amazing, and the price makes it a no-brainer. I now own two pairs (office+home), and use them for many different types of music. And they just perform! I wear them for hours and hours and almost forget they are there. And the music that comes out? Oh, my god. So, believe all the rave reviews and just buy them! Niels PS I also tried the 202 because of the great price. Don't. They are SO far from these, and gave me headaches because of the bad fit. So they are now collecting dust on a shelve in the garage.",
        "These are some nice sounding headphones. My wife was sick of me playing my video games through my speakers keeping everyone up at night, so I got these and they're great. Keep in mind, they are 'open' headphones so if you plan on using them with an MP3 player at work or in any otherwise quiet environment everyone around you will hear them. I just use them in my basement at night or while I'm on the computer so I don't disturb the rest of my family while they're upstairs sleeping or doing other things. These are superb headphones. Oh, and I did the 'mod.' Super easy.",
        "Previously owned Sennheiser hd212 pro dj headphones, used it primarily for Steinberg's Cubase & some Reason4.0: $70 back in 2008, still love them but ever since i received my new hd555's i havent had the urge to go back. These headphones are perfect for nearly every source of sound and purpose. Sick design and delivery of crisps highs-mids.",
        "I bought these headphones because of prior experience with the HD-595 model at work. The HD-555 live up to the great reputation Sennheiser has in the TV industry. Sound quality is amazing, at the present time I am re-discovering a lot of music that sounds brand new with these headphones. At this price they are a great buy!",
        "Nicely made pair of headphones and very comfortable earpads which are made of velour like material. Even though they sound tonally accurate the bass is lacking and I ended up upgrading these. Spend a little more and get the HD600s is what I recommend.",
        "very comfy and great sound quality the con is that the gray part (where the headphones attach to the headband) cracks easily, cracked just after 2 months but not completely broken yet cause i've been taking great care of them, have had them for like 2 years",
        "Best set of headphones I have ever used. Major step up from those dinky in ear ones I use to use. Sennheiser really does awesome quality. However, the craftsmanship is iffy. The plastic will crack. It will come slowly, but believe me if you do a little google-fu and look around you'll see it is a very common problem. If you can live with the inevitability of it breaking down, then you're golden. Get these.",
        "I am no audiophile. The headphones are great, I don't think the sound leak is that a problem until you keep the volume in proportion -- however, not meant for office use. Comfy, can put on for hours and your ears will never hurt. If you are an audiophile and are comparing between the Grado and this one, I think you should go ahead and buy this one -- it can't get any better.",
        "They are very comfortable and I am very pleased with the sound quality. Don't forget to look for the video on YouTube explaining how to turn these into the \"better\" HD595 in 5 minutes! My only minus is that if you work in a quite noisy environment, they don't block outside noise (after a certain level) very well.",
        "As an admission up front: I've never had a nice pair of headphones...I had never spent more than $30 on a pair before I bought these. Having said that, I don't know how I could ever go back after hearing this...I am literally finding random music just to listen to how amazing it sounds. Incredible.",
        "Look on youtube for the instructional video. Tear the earcups off and you can remove a piece of sticky foam tape. This will improve air flow, reduce distortion and give you the same quality as the $350 senny's",
        "Had this for a couple of years so far. Fantastic audio reproduction. Bass is great. Super comfy, my plastic has yet to break and I have dropped it a couple of times. Cable is strong, pulled it accidentally a couple of times and have yet to damage or pop it off. Have yet to do the tape mod to it but its great. Con: the plug is not 3.5mm and needs an adapter(which is included). On a phone it just looks silly big. But this was designed for studio in mind and not mobile so its not the manufacturers fault.",
        "Reviews for these headphones have pretty much summed up everything about them. I got them refurbished for less than half of retail. They're great, I've owned a lot of expensive headphones. Amazing clarity and great thumping bass they have my seal of approval. Do keep in mind they are annoying if you aren't the one wearing them.",
        "My second set of these excellent headphones--- great for music and excellent for nighttime movie-watching. Not \"surround\" but gives a wonderful illusion of same!",
        "With the right EQ settings these headphones sound great. The only \"downside\" is that these are open-ear headphones and therefore if you're blaring something in them people can literally hear what song you're listening to. My family told me to turn down Daft Punk - Robot Rock in the car. The nerve...",
        "To be honest, I really did not need these headphones because I own 2 sets of Sony Studio Headphones purchased over 12 years ago. I am so glad I did get these because the sound quality is so much more than expected. The reviews I have read were correct. These are so much better that the $220 Sony's I have. The FULL Sound is great, the seperation is fantastic, and the fit is very comfortable. I highly recomment these to all. As a matter of fact, I just watched the Disney 'A Christmas Carol' with these HD555's on and it was like being in my own movie theatre.",
        "I use hearing aids and watching movies on TV has been a problem as when the volume is loud enough for me to hear it is too loud for my wife. I had previously purchased a cheaper set of headphones and the diaphragm cracked on higher volumes. I purchased these Headphones after reading the reviews of several manufactures and I am totally satisfied with them. They seem to increase the upper frequencies so it is easier to understand the dialog in movies. They are comfortable and the long cord reaches my amplifier comfortably. They appear to be well constructed.",
        "I got an out of box pair, so the price was especially nice. The bass is a bit lacking. The high end is nice and crisp. They're a good cheap pair of decent over ear headphones. Just don't expect them to sound like hi-fi gear. Because they don't.",
        "These heaphones surpass all my expectations, if you have a high quality soundcard-stereo you'll be amazed. They renew all my old music I can hear instruments and details I never knew existed in the old recordings, as they break in they just keep getting better. the only weakness is bass, although it is'nt loud it is by far more detailed. you can follow ever note on the bass guitar so I guess that makes up for it. Buy these! if you've never owned a high end set of headphones they will blow you away, and remember it takes 100 hours of use for them to break in.",
        "THese headphones sound great. Very detailed, good low end without being boomy, mids and highs are fine too. Comfortable. They really make the soundstage sound wide. Very pleasant to listen to. I've had them for 2 years with no probs.",
        "I got these two years ago and use them for playing on my Xbox and watching movies on my projector. The sound is amazing. I prefer these to my fancy Yamaha home stereo. The velour ear pads are so comfortable.",
        "I have no issues with these headphones - they are comfortable and I have worn them for a few hours at a time with no problems. They have a rich sound and meet all of my expectations. They were delivered promptly. Great value for money. Although they were bought used through Amazon, they were in as new condition when delivered.",
        "Listening to all my favorite records, sounds like I'm hearing them for the first time again. And they are so comfortable as well. Listen to the album Aquemini by Outkast with these, you will be blown away. That's one of the greatest albums of all time.",
        "Although I love my new sennheisers, I must admit that I was a bit disappointed at the lack of 5.1+ surround sound as I mainly use it for playing video games. (Someone would be shooting, then I turn around and don't hear them at all). Other than that, the headphones are nearly perfect. I can wear them for hours on end without them becoming uncomfortable, the sound quality is impeccable and the cord is nice and long. Definitely a great buy if you plan on simply listening to music, as these are the highest quality headphones I have ever owned (I have also owned astros, g35s).",
        "really good open phones, very natural sound, great monitors. The earpieces get a little annoying after a while, though. they are pretty big and if you wear phones for 3hrs. or more a day (like me) it can get uncomfortable (a little, although the fleece covering is very soft)."
    ]
}