{
    "entity": "Over-Ear Headphones",
    "text": [
        "I've been spoiled by owning the models where both wires retract. Other than saving money, the one wire retracting hasn't much going for it. A tiny nibbin in the middle of the non-retracting wire seems to make shaking the phone to untangle any issues once the phones are tugged from a pocket. But big whoop. Spend another ten bucks and buy the doubles. I bought this item because all I saw was silver headphones and a really cheap price. I didn't see what is frequently commented on by purchasers: Only One Cord Retracts.",
        "I've had these headphones for well over a year now and hands down these are the most comfortable clip on on ear headphones I've ever owned and far more comfortable than any ear buds I've used. Should go without saying that Sony puts out quality product and this is no different great sound at a great price.",
        "Use these for when i work out at the gym(i only do cardio though) I had a problem where my ears would hurt because they would get cold after my workout and these kept them warm after a run. They would stay in place and not fall off. I wouldn't wear them longer than an hour because it will start to hurt. These saved me from a lot of pain so i would recommend this to anyone else who is looking for something to cover your ears to prevent them from getting too cold during a workout.",
        "Coming from the previous version of these headphones, the sound is clearer and louder, but has very prominent treble compared to bass. In fact, the bass is exceptionally weak and I've had to re-adjust my equalizers to compensate. The clip-on attachments feel very secure and comfortable. The retractable cord is nice. The cables are thin, so I would worry about their durability over long periods of time, but so far nothing has broken.",
        "They are pretty good headphones. The sound quality is good, but the earpieces pinch if you wear them for a while. They also don't look quite as cool as they do in this picture, or as least as I imagined. I thought that they would be clear plastic and they are just white plastic. They are fine and work well enough, they just aren't amazing.",
        "These headphones worked well for two months. Then they inexplicably stopped working. I don't see anything visibly wrong with them, but when I plug the jack into a set of speakers, there is no sound in the headphones and the speakers do not get muted. I'm quite disappointed. My old pair of Sony headphones, which I gave to my daughter, are still going strong after 5 years.",
        "The chord is too short to really be useful--I had to purchase an extension separately. The headphones themselves fit well, and most of the time sound decent. About 20% of the time I listen though, I get some white noise in the background. I still haven't figured out how to adjust the headphone cord to mitigate that--it just goes away after a while. I've gotten pairs from Sony for only $20 before, sadly those were discontinued...",
        "Bought it to my wife. They look nice - as much they are look on the picture. Audio quality is nice for most people and they are also comfortable to wear.",
        "I have bought several pairs of these headphones. The cords have not failed, but eventually the place where the cord goes into the plug has, after many, many drops of my ipod, given out. The retracting mechanism has always worked. I love that I can take the earphones off and hang them around my neck when I am in a store or need to talk to someone. They are comfortable and have excellent sound quality.",
        "bought to replace Brookstone reverse earphones of my wife's. She's VERY picky and seems to like these as well as the Brookstones. The retractable mechanism (which is what caused the Brookstones to break) seems better than the last set. Time will tell, but so far so good.",
        "good. they stay on. only drawback is on long runs in hot weather, there's some chafing behind my ears.",
        "I got these for my mom, who is constantly tangling her cords on her earphones. The retractable feature is very nice. They retract smoothly and leave less chance of being able to tangle them.",
        "Headphones were purchased for my spouse. She enjoys the way they fit on her ear at her workplace. Only complaint would be the fact that they lack slightly on bass response. No other complaints.",
        "my favorite headset. Would buy again and again. So convenient.",
        "Very comfortable on my ears and I love the retractable cord.",
        "It was a gift for my mom and she loves them",
        "Bought for a Christmas gift. The cord is retractable and I've heard only good things from the recipient!",
        "The fit around the ear is too loose. Always feel like they are going to fall off and results is poor sound quality. Would have expected better from a Sony product.",
        "Expected headphones to be fully retractable, but only one wire out of two is retractable.",
        "Ok for everyday listening, but not very good if you'e planning to use while being on the Bart.",
        "I love this product. Sorry it is no longer widely avail in US. Retractable cords keep me from catching them on everything -I wear these a lot and do everything while listening.",
        "The sound in these are superb and the look is just something else, but the only problem I have with these is that each clip-on is not individually wired, they're wired together. Overall they are AWESOME!",
        "Ive used this equipment in the past and they work great but buying it from where i bought it from they came to me defected. They broke the first use. They sent me a refund, sure, but i dont have the product i want in the first place. I havent heard back from my original request which was to be sent another pair not to have a refund."
    ]
}