{
    "entity": "Over-Ear Headphones",
    "text": [
        "I've owned a pair of older Sennheiser headphones for many years but wore them out over time. I was satisfied with them but these new ones are so much better in all ways. Better sound including simulated surround, better fit, better wireless and way better battery life plus an extra battery always charged and ready to go! Way cool wifi headphones! The wife never knows I'm listening to TV late at night because there is little or no sound leakage. Love Amazon and their delivery. One click shopping, it's great!",
        "I would ditto all of the other reviews; this is a good set of wireless headphones. The only downside is that after using them for a couple of months to give a decent review, I read that I should have received a second battery that wasn't in the box (it does say it on the box, but no mention in the instructions). No big deal for a $20 battery though. It is worth noting that they use a proprietary battery vs. something you can buy at Radio Shack. I am happy with the purchase.",
        "The sound quality is fine and the range is okay, but the headphones are so poorly constructed that I have been through two pairs in 6 months. I was extremely careful with the second pair and they just broke this morning after only 3 months of use. The joints that hold the the phones are weak and plastic. DON'T DO IT! These won't last.",
        "Good sound, lightweight -- but it stopped working altogether in just about a month. Now I have to deal with repair or return. Not such a good deal after all.",
        "Great product, I have purchaced two sets of these. There are less expensive headphones out on the market, but you normally get what you pay for. I would recommend this product to anyone who enjoys a fine listening experience.",
        "I bought these phones as an upgrade to the cheap Sony's I had been using for late night viewing. There is no comparison. The RS-65s are a superior product. You have to make sure that your receiver output doesn't saturate the transmitter circuit; I had a cheapo DVD/CD player that did just that, and even Natalie Imbruglia had a Neil Young like distortion. The unit has a very good discriminator, and noise is kept to a minimum. , I can't call these one star phones. The nature of wireless is noise. There is always a tradeoff for convenience...",
        "I bought these headphones less than a year ago. Then they quit. I only used them 2 hours per night to watch TV. I had good reception (went outside with them behind my house), while they were working. I sent them back to the factory in Old Saybrook, CT. It appeared they sent me a new set. But they only worked for a few minutes and then cut out. Try another brand.",
        "We've had these headphones one year now and have encountered zero problems with them. They work great inside the home from room to room (one level home) and to various points out into the yard (1+ acre). Lightweight and comfortable. No problems with breakage or wear, they still look new. On average, they are used several times per week for about an hour or so per use - but during football season, they are used MUCH MORE! I recommended these to a co-worker whose husband is loving them so much that he bought a set as a gift for someone else.",
        "Spent considerable time researching cordless headphones! Spoke with hearing specialist about type of headphones to buy and was directed to ones that had large ear \"coverings\" to facilitate hearing aids. The RS-65 was probably the BEST Christmas present; mother-in-law now enjoys watching TV at a level that others (in the room) can also tolerate. Just wish the battery would last longer than four hours!",
        "Unfortunately I saw them after I bought the item. The material is cheap. The sound quality is so so. If you move your head around, the static noise quickly occurs. And it keeps pressing my ears although I have small ears. And it costs a fountune. Please do not buy it.",
        "I got this headphones on December 18,2004.As of March 23,2004,today,the headphones keep shutting down after a few minutes,the system just doesn't stay on.When I do get them to work(just for a few minutes) and turn my head the sound cuts out.There is a two year warranty,parts and labor but according to Amazon's customer service you have to address the manafacturer to honor the 2 year warranty ,and guess what?THE MANUFACTURER IS IN GERMANY.",
        "I just recived my headphones last week and am very pleased with the quality put into the product. I'm a audio nut and can be very hard to please. The Senneiser phones are true hifi sounding headphone. I've run them through my equalizer also and that will push the sound level to the max. I like the fact that you can still here someone talk to you with them on.---But If you have big ears you might have a problem with the fit. Amazon got them to me very fast and I'm pleased with there service. Thanks ---Jeff B.--- from:New windsor Maryland",
        "The sound quality and performance of these headphones are great, but they last about 6 months since the headset is very cheaply constructed. I had one earpiece fall off after the plastic holding it together gave way after a couple months of occasional use. I taped that side up, but then the other earpiece fell off a month after that. ...Save your money and buy another brand.",
        "Superb sound on the RS 85. But can't mow 1/2 acre square and listen while mowing because range only good for about 1/3 of this acreage, more or less a square. How the hell do you expect me to become an audio cyborg? Clean out your ears, Senny; give us more range!! Thanks!",
        "The headphones were great! But, the control volume was hard to find if you fail a sleep and wokeup to change the volume. That was the only problem with the headphones. Great headphones and the best money could buy if you look for quality and sound. This was the one! Buy it! These headphones could be a 5 star if you are looking for great sound and comfort!",
        "The clairty and reception is better in the Sennheiser brand than with the Advent brand. However, ther is still some occasional static, but it is nothing compared to the other brand. The headset has a pretty good range. Easily reaches outside the house and around the yard. Reception cuts out when the phone rings.",
        "I BOUGHT THE RS65 ... I AM NOT SATSFIED WITH THE VOLUME FOR A SYSTEM THAT COST ME $$$ AFTER DISCOUNT. ON DISPLAY AT THE SHOW THE VOLUME IS LOW AND YOU DO NOT GET THE CORRECT IMPRESSION. THE SURROUND SOUND IS TERRIFIC BUT I DID EXPECT MORE I.C.W THE VOLUME.I WOULD LIKE ...THE REP TOLD ME TO FIRST TURN UP THE VOLUME OF THE TV AND THEN THE HEADPHONES BUT IT DOES NOT WORK.",
        "They are not has clear as I thought they would be. But they do the job.",
        "It must be good because I'm giving this review while I order another one. Bought it for my father-in-law, and now he wants another one to go in another room, with a different source. He loves it."
    ]
}