{
    "entity": "Over-Ear Headphones",
    "text": [
        "It's sad. I love this style of headphone from Sony. I've had numerous models from them, starting with some of their classic egg styles in the past. The problem is that those, like these, suffer from subpar build quality. I bought two of these. Each one broke in the exact same way: the plastic pieces that hold the headphones in place broke. They both broke after 2-3 months of ownership. When they do break you see how poorly constructed they are. The plastic is very weak. Also, these are just headphones I wear at the office, while working at my desk. I'm not stuffing them into some overstuffed bag or throwing them around the house.",
        "A lot better then Bose headphones and cost $300 less . They are very comfortable(sometimes I forget I am wearing them) and the sound is so crisp and clean. The first time I bought them was back in 2005. after 5 years of wearing them they broke and but I am buying a another pair.",
        "The headphones were made for a child. The cord is so short that I can not move around at my desk. My previous Sony headphones were perfect. I should have measured everything before ordering. Barely fits over the ears.",
        "I've been bamboozled into using ear bud headphones the past 4 years, including the wonderful, which were great headphones. These Sony cans have rejuvenated my listening to really immersing myself in the music, which, to warn you, has also inspired me to pump up the volume of my music as well (simply for enjoyment purposes). Haven't used them on a plane or train, but for sitting at home and at the office, they're great for blocking out what's going on in the outside world. I can't imagine getting a better pair of headphones for <$60, and these were only $30!",
        "Awesome headphones! I got these on sale for a ridiculous prices and I have to say they were the best purchase I've ever made. I would have paid twice what I paid for these! They are balanced in the high and mid section as well and best of all: no crappy noise cancelling white noise (at least that I can hear). The lows are decent. In most pop/rock songs the lows are more than adequate, however, are lacking in most hip-hop songs. I know there are better, more expensive headphones out there, but these are a great budget audiophile set of headphones.",
        "I thought I would upgrade to HD headphones from a pair of SENNHEISER HD280's, BOY WAS THAT A MISTAKE! The extra hi frequency range and lower response was what attracted me to the flame, and it burned! Worst feature: -There's no kick in the bass, and if I tried to max it out, it just distorted the track. -It's got SCREAMING hi's and very weak lows. Not what I was hoping for AT ALL! Best feature: they're cheap (U get what u pay for!) Soooo, I just bought a pair of Sennheiser HD-555's a sec ago. Hope they sound better than the 280's(from what I've read they do)",
        "I bought these headphones yesterday from a store, and I am not very impressed. I actually paid $100, and I thought for the price they would be great headphones. I was surprised when I first put them on at how small the ear holes are. There is barely enough room for my whole ear to fit inside, but the edges of the padding are pressed against my ear, and it is uncomfortable. And I don't even have big ears. The ambient sound switch is retarded, it does nothing. Sound is good, but I want a more comfortable pair.",
        "Quick Review Pros: Good clean quality Portable, look cool Only $30-$40 on amazon cons: Bright sound Hard clamp on the head, can become uncomfortable and even cause headaches after 20-30 minutes. So-so build quality, may break easily. Definitely worth $30, probably not more than $60, due to the discomfort. The triports sound slightly better and are much more comfy.",
        "If you are looking for headphones that relatively inexpensive, comfortable and has good quality sound, these are the one. I use them quite frequently and they are great.",
        "these headphones are a complete waste of money. the headband is connected to the earphones by plastic and within two weeks both sides completely snapped and wiring started to come out from the ear phones. on the plus side though, the sound is really good it's not worth it though and now i need new headphones. don't buy these",
        "Wife has some bose headphones. I thought I would save a few bucks and try these. Yes, they are a great deal, they sound fine but they are no comparison to her bose. So if you looking for something that is fine but not worry about them getting broken or stolen. They will do.",
        "it's actually better than my laptop's speaker, well of course what do u expect from a laptop's speaker. anyway, it has a good and clear sound and a bass sound, too. it's a descent headphones, so it's not that very good like other major brand headphones, but it's worth it, especialy from amazon. i myself feel satisfy enough for this headphones.",
        "The sound quality is ok. The bass is a bit weak. But the plastic broke inside of 6 months and then one side went dead. Not worth it.",
        "Like most of the other users have commented, this headphone is a waste of money. Though the sound quality was really good, mine broke within 4 months of usage. First, the Y connector broke, and I managed with tapes.. then the connection to the headphone where the wire goes through also broke, and now its beyond repair. All this after paying a whopping $150. So dont even consider buyinh this!",
        "people rate them so low. IMO these are good headphones for the portable use. Yes they are no grados RS1 or akgs K701. But they are very comfortable and have good sound. btw: i have grado rs1 and akg k 701 ..",
        "I've had many headphones, at all kinds of prices, and these are as good if not better than any of them. I love um!! Buy um!!",
        "I put a 2 star review for these phones up. It was published for a while, and now it's been removed. The better reviews have not been removed. Why?"
    ]
}