{
    "entity": "Over-Ear Headphones",
    "text": [
        "Sound quality isn’t the greatest but it works well. You need to have NO obstructions in between you and the base or you will have static and poor reception. The battery life is excellent and it’s made well . The BIGGEST problem is putting the headphones on the base to be charged, it’s very tricky and frustrating. You need to place the headphones perfectly on the base or they will not charge. It takes a little getting used to.",
        "This system is well worth the investment if you have a room with terrible acoustics like I do. They not sound great but are so comfortable that you forget they are on. The only thing I would improve is the tricky part of landing the recharging contacts on the built in recharger. It is not easy to hit the mark so that they begin charging. Another improvement to consider would be to put another optical jack to enable you to connect from a second source like a DVD player. Mine is connected to the cable box. Otherwise this is one sweet setup and the 5.1 optical input is really clean. A great product and listening experience and affordably priced.",
        "I've had these headphones for at least two years and I still love them. I use them to listen to TV and find that the battery lasts a fairly long time before needing to be recharged. They're also extremely comfortable. You can't wander very far away from the base at all without them cutting out, but if you know that ahead of time and this fits your needs, they're great. Although I'm not uber particular when it comes to sound quality, these headphones are certainly LOTS better than the TV speakers (I had a 32\" Samsung HDTV) - movies sound terrific with these babies on. All in all, this is one of the best purchases I've ever made.",
        "I am very satisfied \"using\" these headphones. Sound quality is excellent and the fit is snug and comfortable. The problem is with the charging dock that you must place them in when not using. It is annoying as all heck(bordering on impossible) to get them seated properly . Also the volume control is very difficult to find and use. Very poorly designed item. But they were the only ones I could find to use with my bedroom 26\" Panasonic Viera w/digital audio output. It was either these or my wife would divorce me. And now they don't work! Shorting out one side. DOH!",
        "if you need a wireless headset that connects via fiber optics this is for you. Some TV sets (such as mine) have only fiber optics for sound out. This limits what you connect and these are great headsets for listening while others sleep in the house. As with all IR headsets there is a little background hiss and occasionally they get out of phase and have to be placed back on the charger to restart and go again. I would buy again",
        "I originally had the \"receiver\" sitting on my satellite box and behind my LCD TV. The sound kept cutting out, so I moved it to the top of the TV. Since then, the sound has been great. No static or interference. Just crisp, clean sound. The volume level can also be kept much lower than my old wireless headphones (I use them while on the treadmill). My only complaint is that the headband doesn't have a snug feel to it, although that really hasn't been an issue.",
        "Performs VERY WELL with no hiss or static. Battery life was less than expected, but overnight charge and we're good to go. Remember, if you are using optical cable for sound, to order \"splitters\" because you will need to split the signal between the input to your Home Theater system and these headphones, as most HT systems do NOT have an \"output\" for optical cable - - - only multiple INPUTs.",
        "I have a very expensive built-in surround sound system in our home. While the sound from the six Klipsch in-ceiling speakers, Yamaha RX V861 receiver with Sony 52'' Bravia TV is great, the set-up sound cannot compare to the lush, discrete element sound of these headphones, which also solve the problem of my not being able to watch TV, listen to music when my wife is sleeping or on the telephone. I am better able to \"get\" conversation with the headphones solving a hearing problem I have. I'm really happy with this purchase.",
        "We ordered the Sony MDR-DS3000 headphones because they were one of the few wireless headphones that will work with our new television's digital optical output. After charging the batteries and testing the headphones, the sound quality was exceptionally good up to 15-feet from the processor. After 15-feet, there were noticeable popping and crackling. Unfortunately our viewing distance was 18-feet. Therefore we are returning the unit. Amazon was great and offered a full refund! We will never hesitate to order from Amazon in the future.",
        "Used these approx 2 hrs. before sending them back. Setting them in the cradle for recharging was very \"location specific\". The audio quality was less than anticipated especially given the digital (fiber optic) input. Sony's surround process was unusable. I will state the ear cushions were more comfortable than the Sennheiser's that I bought as an alternative.",
        "I hooked up the optical cable to my plasma tv. There was quite a bit of interference. I moved the unit away from the tv but this did not solve the problem. I then decided to look in troubleshooting and found the answer to my problem. The troubleshooting guide says you may experience interference from a plasma tv. So I returned the unit to Amazon",
        "I connected these Sony surround headphones to the back of my cable box using the supplied fiber optic (Toslink) cable then plugged the unit into a nearby electrical outlet. That's it for the setup. Never bothered to open the instructions and I now get Dolby 5.1 surround sound coming in from the high def stations. The surround experience is incredible and I no longer get disapproving glares from the wife. (Many wives just don't understand the need to experience theater sound in the living room.) Good price for this class of wireless headphones.",
        "Everything we hoped, these headphones have been super for both the wearer and the non-wearer. My husband is hard of hearing (too much loud machinery) and there were days when I could not stay in the same room with him to watch TV, as he needed it to be so loud to hear it. We got two headsets and one charger/send unit. since we live near a busy road. The headset sound is wonderful, filtering road noise and allowing us to hear all the nuances in movies. The only negative is that when one set is charging, the other can't be used.",
        "Easy to install, great digital sound,comfortable headphones,this product delivers what the description promises. I would highly recommend it. Another great feature is that you can choose to keep the volume up on the TV at the same time, making it possible for others to listen at a moderate level. Ideal for an elderly person who wants to share TV time with others.",
        "This is one of the best electronics purchases I've made in several years. I use them almost every night and am still on the original batteries.",
        "Using these with a PS3 using optical output they sound awesome and are comfortable. Recharging cradle is simple and works easily, no problems. What more can you ask? I sit 10-12ft. away from transmitter with no interference or noise, does not conflict with other remotes. Above all, they must sound good, and these deliver---with a digital optical signal they are great.",
        "Awesome purchase. ..my husband can watch tv while i sleep soundly!",
        "The headphones has a good design but has a background hiss. Lots of reviews mention this but some are more distint than others. It could be attributed to interference from other electrical devices. I guess the best thing you could do is try it to see if you like it.",
        "We purchased a new TV but my hubby's old headset would not work with the new one. What to do?? Hubby is very hearing impared and in able for him to enjoy the TV I needed to get him something to accomodate his weakness. I purchased the new Sony MDR-DS3000 infrared Wireless Digital Surround Headphones from Amazon. Thanks to Amazon he now can enjoy all of the programs on TV.",
        "We are very happy with this product. We highly recommend it. It is a bit pricey but it is worth it.",
        "The sound quality is good, but the volume control could be easier to move. Also when charging the phones, you have to do a lot of fussing around to get contact with the base, and then one side is hanging off the unit at an angle.",
        "It's ok.You have to not move around much though as it will lose the signal.",
        "These headphones are complete trash. The reason is simply because the range is bad and keeps dropping a signal even when you are near the receiver. Battery life is below the advertised promise and you can hear a strong static build-up over time, as batter life diminishes. Thank goodness amazon.com takes care of its customers with easy return. Dont buy!!!",
        "These are great for people who live in apartments but still want to watch tv and movies or play video games at night. The surround effect actually works for thx/dts movies with the supplied optical cable.",
        "There IS background hiss of significant and distracting levels from the cheap amp on these headphones. Compared to the Pioneer wireless these are junk. Further, the implementation of the dolby functions, including virtual surround, is very poor. Again, hear the Pioneer which are amazing in comparison. There is little bass, and the treble is distractingly bright. Verdict: Fail. For an equally compromised set of headphones, but with long range, See the Sennheiser R130.",
        "I read and followed the directions but got only hiss, crack and pop with these headphones. I tried plugging into the optical port on the TV but couldn't get it to work. I returned the headphones but had to pay shipping and a restocking charge. Never got refund from vendor, Etronics. Buying electronics and software is risky and best done locally. I had a Sony TV with built-in infrared headphones and they were great. Now I can't find anything that works.",
        "Sound quality is good but short range. They are sort of loose on the head!",
        "I needed cordless head phones. I like Sony products. I read the reviews. They were good. I bought them. They didn't work. I tried everything and even recruited help. I sent them back. Maybe someday I'll get something that works so my wife doesn't have to listen to the TV late at night.",
        "Don't work. No info on what might be wrong. Unfortunatly, can't return. Bummer, a $200 piece of plastic waste.",
        "The Ni-MH batteries included with this set cannot be recharged anymore. The died after only about 15 hours of use.",
        "Easy to set up and use. got these for my wife and she loves them.",
        "Will not work Either defective or not compatable I have returned the product with a rma # and asked for a refund",
        "Not easy to use. whats the use of wireless if you have to stay in front of the transmitter, for it to work."
    ]
}