{
    "entity": "Over-Ear Headphones",
    "text": [
        "Keep a pair in my IPad travel bag to take them along where ever I go. Use them while waiting in the doctors or dentist office, if I’m a passenger in the car on long trips, flying, or anywhere I want to listen to my audio books or listen to my music. Very comfortable and NO PROBLEM USING THEM OVER HEARING AIDS.",
        "Not uncomfortable but not as comfortable as my Bose. These Koss UR29 don’t seal around my ears as well either. The sound isn’t hi fidelity but works great for my purposes, listening to interviews. Sound is clear and good quality not spectacular. They are a good deal for the money. I would buy again for my purpose. I would not buy to enjoy music. I’m spoiled by my Sennheisser and Bose over-ear sets. Ultimately it’s a financial decision. If this set is your price range, go for it.",
        "I bought these thinking the audio would be an improvement over my old UR-20 headphones. Nope, it was the complete opposite. The audio from these is extremely muddy and muffled, and it's the first time I've ever had to change the equalizer settings on my PC to fix the sound. They are also extremely uncomfortable to wear for long periods of time, causing both pain from being too tight and making the skin around my ears sweat from getting too warm.",
        "Received the Koss UR 29 today. The ad says it is 16 ohms, but the package says it is 100 ohms. These cans need an amp to bring out their full flavor. Good highs, miid and bass after using the FIO amp at 160 ohms. Comfortable to wear and the in-line works well. Good price at $23.00. Buy them if you don't mind the amp. Great go to headphone.",
        "I've used this model for years. Great sound cancellation and comfort. When my old ones broke due to my wife pulling them away from my head I ordered new ones. After several years' use, my old ones began to \"flake\" heavily by which I mean that the plastic covering the foam around the ear pieces and headband degraded and came off of the headphones entirely. It was a small annoyance compared to the years of great use I got from them. (Weirdo that I am, I kept the magnet inside of one of the earpieces of my old set for use as a fridge magnet.)",
        "They do have good sound quality and are comfortable to wear, but they feel rather cheap and brittle and very quickly one channel stopped working.",
        "These headphones have okay quality. They aren't very sturdy. This is like the third pair I have had to buy, and if these break, I will probably not buy these again. I only use these for practicing on my piano keyboard. If you don't use these for a computer or an instrument, I do not suggest purchasing them. If you want great high quality headphones for other purposes such as listening to music, then I highly recommend the Beats Studio 2.0 Wireless headphones.",
        "Koss makes pretty good cheap phones. These were for my wife, and she seems to be pleased with them. I have a 10 year old set of Bose noise cancelling ones that take a AAA battery, which is a huge pain in the ass. My next set will definitely NOT use batteries.",
        "I like the headphones and I bought them because of the Koss reputation, however the instructions were misleading so I called Koss and ended up sending them an email with a copy of the instructions. The instructions mention to fold the headphones in the direction of the arrows on the headphones. Guess what, no arrows on the headphones. Small problem and most people could probably figure out how to fold the headphones, but the instructions should be correct. These headphones were made in China (surprise, surprise) so I guess there was some discrepancy between the manufacturing process and the instruction writing process.",
        "These headphones are great. I had a set for probably 5 years and they just finally broke from shorting out a couple weeks ago. The new ones showed up two days later, and did not disappoint. Great quality for the price of them.",
        "I love these headphones, these are the only ones I order from Amazon. Back when my kids were younger a pair would only last 6 months before the sound would begin to go out. I'm expecting these to go a little longer. These are worth every penny. Comfortable around the ear and volume control is awesome, also if you taking the padding off the volume is even louder but that's only if you DON'T NEED the padding. The cord is extremely long 5/6 ft which is great if you're moving around 5/6ft it can at times be an inconvenience..tripping over it etc etc.",
        "this is the second set i have ordered. they are comfortable and the sound is good.",
        "I HAVE A PREVIOUS PAIR THAT I WORE OUT THE EAR PADS AND WAS PLEASED TO FIND THE SAME HEADPHONES TO REPLACE THEM WITH. VERY NICE SOUND.",
        "I love these headphones!!! Great sound quality. Nice long cord. It doesn't cancel out other sounds in the room completely, but I LOVE the volume control. When I go from device to device it is so helpful. If I am in the same room with someone else watching TV or videos I can just turn my volume up. You can't do that with other headphones.",
        "The UR29 has heavy, bulky design with \"Ok\" slightly muffled sound quality at best. Koss UR40 by comparison are light weight with clearer highs, lows and midrange. The UR29 has the advantage of a long (although thick) cord compared to the relatively short cord of the UR40. Overall there's not a lot to recommend about the UR29 when there are other headphone options with a better combination of sound quality and lighter weight design.",
        "My husband asked for these as a gift. The main attraction was being able to adjust the sound level on the headphones without having to adjust the computer setting. He is really pleased with them. Good quality sound and great feature.",
        "Searched high and low. Trial and error. Hands down, for price, best quality that ive found. No heavy bass but good mids and excellent treble. The 8 ft chord with the volume adjuster are nice bonuses. Youd have to pay 60 - 80$ range to beat em.",
        "The 8 foot cord is wonderful. Sounds like it should cost much more",
        "Good sound, the cord is on the long side but it works well.",
        "I, without reservation, would recommend the Koss UR29 to anyone who appreciates a value-priced product that lasts and produces great sound. These are very long-lasting headphones. They let very little sound outside of the earcups so you get to enjoy all of the sound. The earcups are large enough to cover my not so little ears with my glasses very comfortably. A 'drawback' (if you want to call it that) is they limit external sounds, but not entirely. My experiences with Amazon.com have been nothing but enjoyable. The product was received on the date and in the condition promised.",
        "I bought these for my father who is in a nursing home. They do filter out lots of noise. The quality of the sound is very good. Also, the cord is longer so he can manuver throughout his room without removing them. This is actually the second pair he's had. The first pair he broke accidentally. I then bought him a pair that wasn't Koss and he complained about them so much, I logged on to Amazon to look for another pair to purchase like the first pair.",
        "Terribly uncomfortable. Made my ears and side of my head hurt after a few minutes of wear. I wish I could return them but Amazon requires them to be in the packaging. Of course there's no way to know how uncomfortable they are without removing them from the packaging.",
        "My son loves these so much that I bought spares since they are hard to find now. He prefers the way these fit over his ears and around his head. They have a better \"flex\" when taking them back off, and they last a good couple or few years before he ends up snapping them.",
        "This is what I needed to replace an earlier Koss product that I purchased years ago. I am more comfortable with large ear pieces and yet also have the ability to collapse for easy transport. This fits the bill exactly.",
        "I've been using these in the office for several months now and they work fine. Decent sound quality, chord is long enough so it's not yanking on me when I plug it into the radio. I've taken them on several flights now, they work ok for hearing a movie / mp3 while in flight, but they definitely are not noise cancelling. Collapsable enables you to toss into the laptop bag while moving around and not be in the way. All in all, I'm happy with the ~$20 I spent on them.",
        "like these a lot. They fold up nicely to fit in a carry bag and the volume control works great. You can turn up the volume on the device as far as it will go the adjust it on the headphones. Great for drowning out outside noise Great purchase",
        "9 months and volume isnt working very disappointed.... had other head phones for 10 years and worked fine..... i want my money back",
        "the head phones are exactly as i expected. i own a previous pair and the new pair are exactly like the older pair so i am pleased.",
        "Great headphones, wonderful sound. But the price wasn't right. If they were $300 more I could justify them. So I got those beats to be cool.",
        "I am a little hard of hearing and had another pair of these that after a year were broken by kids roughhousing and I ordered another pair because of how much i love these",
        "This is my third pair of these - comfortable on my large head and perfect for my computer needs.",
        "I got these for my husband so he can watch TV and I can sleep. He is quite happy with them",
        "Sound great, and a great price. Took other reviewers advice and will not collapse them around the hinge rivets that others identified as weak.",
        "decent quality sound but they don't isolate outside noises very well.",
        "Koss makes a superior product and I'm glad I bought this set of headphones. Price was right, shipping free and right on time. They work great and look good",
        "Still works after months stuffed in my bag every day. Folds up to fit. Good sound. Noise reducing. I now see why people are going back to big headphones",
        "These headphones, though inexpensive, are rather high quality, very comfortable, and do an excellent job of keeping the sound inside the headphones, so as not to disturb others in the house with whatever music you listen to, games you play, or stuff you watch.",
        "I got these headphones for my boyfriend and he loves them! They have good bass. And when you have them on you can't hear anything else. They are also comfortable. And are resonably priced.",
        "Good sound quality, but the cord on these headphones broke after only two and a half months of use. I treated the headphones well.",
        "I use these both at home and at work, and enjoy the clear sound of them. I recommend these to anyone wanting a good deal.",
        "BEST HEADSET FOR THE MONEY! I ORDERED SAME MODEL I HAD BEFORE...LIGHT, SOFT TO THE EARS, CLEAR SOUND AND THE BEST FOR THE MONEY! 5 STAR LEVEL. THANK YOU!",
        "These are Great if you just don't like those earbuds. Perfect for taking with you on flights because of the Collapsible feature.",
        "My son received these headphones for a Christmas present and loved the features and sound quality. They were a great buy for the money.",
        "Those headphone sound amazing! I only listen to music for fun but I really like the sound of it. I compare my headphones to two pair of beats by Dr. Dre, the studio and the solo model and I can barely see the difference. The only drawback of those headphone is that they are ugly. But it's not a problem for me.",
        "One of the cans stopped working after a few months and with regular usage.",
        "Too heavy and too tight. Very uncomfortable because they press on the ears and temple with too much pressure.",
        "Decent cans for the price. Would prefer 1/4\" jacks for use with my studio equip, but it's not hard slapping on a 1/8\" to 1/4\" adapter.",
        "would be good to see a replacement that have those buttons to raise and lower the volume, came early too there new comes in a little packet fit perfectly to my sol republic",
        "These Headphones are light, adjustability is excellent. The earpads are large and have a great cushion. The cord is long and the volume control works excellent",
        "For the same mediocre result, it's cheaper and more comfortable to use noise-blocking ear buds. Wear these and you will hear people nearby or ambient noises. :-(",
        "Very good head set for the money. Very comfortable to wear for long periods. I use them on my amateur radio transceiver.",
        "A great value!!!! Sounds great for the price! You can not beat the sound quality for the low price!!!! Good deal!",
        "I love these headphones had another brand of koss while i was deployed and they were great these ones feel different but work just as good.",
        "The quality of headset meets and exceeds my expectations and the sound quality is awesome. Thanks again!",
        "Headphones are nice - comfortable fit and good sound quality for the price. The only problem so far is that the headphone jack that connects to the music source is heavy and does not fit tightly into my mp3 player. It falls out of the mp3 player a lot, which is very annoying.",
        "This is my second set of this model and both perform excellant! High quality sound for a lower priced set of headphones. I've used Koss headphones since 1970!",
        "A replacement for one that a son broke. I like the way it fits over my ears. Love the volume control. would highly recommend at this price.",
        "This is my third UR29 over a period of about eight years, and if its still available in 2017 and a replacement is required I will do it all over again. Neville",
        "Too tight for my head (not that big) Sound average for a $30 dollar headphone. A lot smaller and less comfortable then the predecessor UR30 Hinge Broke after 3 months of use. Dont bother.",
        "Well made. Good sound reproduction. A great replacement for my ageing UR30 headphones but doesn't quite cover the ears as fully..",
        "GREAT HAPPY GOOD PHONE BEST KOSS UR 29 BEST PHONE HEAD PHONE BASS LOSS LESS VERY GOOD O MY GOD",
        "Bought them in March 06, they just died today and have been experiencing poor connectivity for about a year (had to consistently adjust the plug to get sound on both sides). Not a fan of the straight plug either, l-shaped is more durable, as the part that broke was due to stress on the straight plug. buying something else. also a little tight on my head, which is not large. I would pass on these. I did love them when they worked properly, but that was only for the first 6 months."
    ]
}