{
    "entity": "Canister Vacuums",
    "text": [
        "For years I've been trying to get along with the tornado-style canister vacuums, and for years I've hated them. They have little suction, they make a cloud of dust when you empty them, and they die within a year. Finally, I gave up and went back to the old tried and true Mighty Mite. It is so much more powerful than the best reviewed tornado-style vacs and emptying it is clean and easy. Highly recommend this over any of the newer designs.",
        "I use this for general cleaning of all sorts, cement floors, dust under furniture, couches, rugs, quick pick-up of dry spills in the kitchen, cobwebs, etc. A very versatile vacuum. It lasts a long time also. The first version of this I am now using in the garage; it was purchased around 1990 or so, and is still running! Make sure you change the bag when you need to, or you may not have enough suction for some jobs. When using on stairs, make sure it doesn't fall down the stairs, or it could break. Overall, very pleased. This is my third, and all are still working, except the one I broke on the stairs!",
        "The product arrived packaged in a way that bent the hose. This caused a weakness in it which over time very problematic, first and only time I have used it was already an issue. It keeps bending like a flaccid appendage. I just want a new un weakened hose and I will amend my review.",
        "I had the previous model for decades. This one has better suction, although it's a bit loud, so don't vacuum at 3 AM or the neighbors may complain. Extremely expensive models are fashionable right now, but my dirt disappears for much less. It's light enough to tote around or take up a ladder for dust in high places. For some reason (decor matching?) the yellow model was even cheaper than the dignified black/blue/red. But it hides in the closet when not in use. And when I'm using it, it says \"get out of may way, I'm doing housework!\" A fine tool for a boring chore.",
        "Love this! Works great! Light weight and easy to assemble. Also, I have a lot hair that sheds and gets on my carpet this has no bristle brush on the vacuum and it's easy to clean.",
        "I bought this after reading so many great reviews. I also read the poor reviews and against my better judgement I bought this machine. The noise is very loud, and suction is poor. I bought a new hardwood floor brush to vacuum my hardwood floor but after vacuuming, lots of little particles are still left. I had to clean it with my dustbuster which picked up everything. The hose is stiff and is often kinked, stopping all suction. It happens so often, it really is irrtating. What should I do with a vacuum that doesn't suck up dirt? Now I believe poor reviews more than great reviews.",
        "This Vac is a just a piece of plastic garbage. Opening a new business my partner and I bought 2 different vacuum cleaners. He purchased this one and I purchased a Eureka Airspeed Exact Pet. The Airspeed ( which was cheaper) runs circles around the canister vac. Years ago I bought my son a toy bissell vac. Needless to say it worked better than the canister one. Please hold out to Black Friday and get a vac. You wont be disappointed!",
        "I bought this mainly for the blower but needed a vacuum as well. I thought this would have worked for me; however, the suction on my outdoor rug and concrete was almost nonexistent and the blower didn't work at all. I found a product that has a blower and mulcher on it for the same price. I haven't purchased it yet but I do believe that it will work better and maybe this is more conducive to my needs.",
        "Wow! Just got it, used it, and it's fantastic! I also bought the \"frequently bought together\" items (specifically the Eureka Generic Fits: All Floor Brush, Metal Curved Swivel Elbow, horsehair bristles, 1 1/4\" fitting, 10\" wide, color white) which I feel is a MUST. The brush has shorter bristles in the front so the floor stuff has room to be sucked up, not pushing the stuff around or trying to tilt the brush up. Small, light weight, powerful. I have laminate and linoleum floors. There is not beater, this is not for wall to wall carpeting. Appreciated the snap together assembly, no tools required. Also, it came with a bag already in it!!",
        "Crap. Bought a different vaccum. Will use this one for the car. Cheaply made. Feels like it too.",
        "Although the description says it is a \"pet\" version, it isn't. It is the standard classic Mighty Mite. No pet features.",
        "1. I did read the reviews prior to my purchase and saw that the extension tubes would disconnect. I used painter's blue tape to the ends of the extension tubes so they would grip better. Success! And really like the extension tubes are long to reach areas like under beds. Note to turn the floor attachment swivel to it's side for easy gliding under beds and sofas. 2. The suction power is excellent! I have hardwood and vinyl flooring. 3. The attachments easily store. 4. The hose seems a tad thin and might crack but with use it becomes more flexible and less fragile. 5. And the pricing is great!",
        "I use this vacuum almost every day for light vacuuming on the floor. Suckions is good . Easy and convenient to use, no complain until it dies in less 3 months. Eureka is good brand I just got the bad motor sucks good but didn't last. It is still looking good the vacuum itself. Ramir B.",
        "This little workhorse exceeded my expectations. It lives up to the high rating. That being said, be sure to notice that the high praise is NOT earned for its ability to clean carpets. That is the domain of a vacuum with a power head. The claim to fame for THIS vacuum is based on its ability to clean non-carpeted floors exceedingly well and efficiently. It's also very good at dusting, cleaning ceiling fan blades and window blinds, vacuuming out the car, etc. Just keep in mind the purpose it was designed for and you won't be disappointed.",
        "We had been using my husband’s mother’s 50 year old vacuum since we got married. It must weigh 50 pounds. It finally gave out and we decided that it was time for a new vacuum. I had an old Mighty Mite (the red one) back in the 80s, and it lasted for me over 20 years, so this choice was easy. I LOVE the light weight, the powerful suction, and the bright cheery color. It is a bit noisy, but that is due to it’s powerful motor in it’s light weight body. All in all a GREAT investment.",
        "This is a great machine all except for the hose which will need tender care as not to kink or bend it to a breaking point. I used it after arrival and found it to be highly effective as compared to the same one I bought ten years ago that still works fine. The suction power of the new on is much better than the old one. Its just the hose has been downgraded to the point of being cheaply constructed. But with a little care and not to much tugging on it you should be fine.",
        "Not too small, not too large meaning some niceties had to be omitted. Suction seems strong, but since I wasn't impressed very much with the machine itself, I never gave it a tryout. I have decided to return the item unused and get a more expensive one with a powerhead for carpets. Also, I didn't like the combination brush tool either. Pros: 8-foot hose (others have only 6-foot hoses) Large bags Compact size Cons: No automatic cord winder (retractable cord) No variable speed Wheels not rubber-coated Combo brush attachment",
        "This vacuum is cheap and not worth even the low price. Don't waste your money. The handles come apart while vacuuming, the suction is not consistent and the carpet setting doesn't work well. The only good thing about it is it is light weight and has a very long reach. But it's going back and I'm going to spend more to get quality.",
        "We decided to purchase this Eureka Mighty Mite canister vac because our entire house has hardwood flooring. Well, it came in and my wife decided to try it out, while I was napping. I was woken suddenly by my wife informing me she wants a divorce and that she is in love with this vacuum. She claims it works harder and does more work than I do. Apparently my sweeping was really lacking yet this vacuum found and cleaned things up that have been lurking in the darkness. She absolutely loves this vacuum. I should not have agreed to buy it.",
        "I like this little vacuum a lot. Pros: strong suction , long hose and cord. Cons: hose connectors sometimes fall off. Cord is very long but has no place to easily wind around and makes it messy to put away. If this vacuum had an auto hose winder it would be almost perfect for hard surfaces and getting in corners and walls. It is not great on carpet only because it does not have a true carpet attachment that will spin.",
        "Read all the reviews before buying. Now I need to add my two cents. Pros: Excellent suction. Especially good for hardwood floors. Cons: As others have noted, the hose is very flimsy. Hold it wrong and it twists, causing loss of suction and a loud sound. Normal operation is very loud. The wand is extra long, making it awkward to use. The whole thing feels cheap. You get what you pay for. I suspect we will be buying a new vacuum within a year. I would NOT recommend to anyone.",
        "I bought this four months ago and use once every other week. The switch/button to turn it on just stopped working today. Does anyone have any suggestions for this?",
        "Been through idk how many types/styles/brands of vacuums in the 5 years that I've been in business but it is easily over 10 of varying types. I've tried every brand and style. This vacuum is DURABLE, STRONG AS HECK and does EXACTLY what you want it to do. Suction is awesome and I easily transition from bare floor, to carpet, to rubber and then to turf (i own a gym). This thing is so dependable, I bought one for my home as well. Seller sends promptly and I have not had any issues. TOP WASTING MONEY ON PRICIER, LESS EFFICIENT UNITS! I PROMISE YOU'LL BE HAPPY WITH THIS!",
        "This is the second Mighty mite Eureka vacuum that I have purchased from Amazon. The first one still works great but I don’t want to get stuck if it ever gives out so I bought a second one. The second one is a little different than the one I bought many years ago. The differences are not that important to its function. I clean homes and depend on my canister for cleaning floors. Vacuum is lightweight, powerful suction and attachments that are very useful. The price is great also. It’s not a quiet vacuum but that doesn’t bother me because it performs well. So happy with my purchase! Thank you to everyone and everything that made this possible🙏🏼",
        "Unless technology gets us to the point where I can buy a legitimate reliable robot to vacuum every surface and corner of my house, I will never get another vacuum that isn't this one. This vacuum is so lightweight and easy to pull around and can be used on EVERYTHING. I have tile, carpets, and wood floors and this thing is a dream come true. I used to hate vacuuming, I would be in a sweat by the time I was done pushing the big thing around. But not anymore. The suction power on this is GREAT too. And it's versatile!",
        "Stopped working. Cannot turn on. I have owned a mighty might for years and never had one break. After mine was drowned in flood waters I purchased this one. The switch was always a bit difficult to operate but now will not work. Very disappointed in this item.",
        "Had high hopes for it but they were crushed! Thought it would be perfect for a 1 bedroom apt. But in 10 minutes of vacuuming I had to reattach parts ( nozzle and wand) 6 times! Nothing clicks together so it keeps coming off. I’ve seen toys with better plastic quality than this, it is bad! And came poorly packaged, with a kink on the hose, so it kept folding unless I squeezed it the whole time. Received yesterday, and us already packed to be returned.",
        "I found an older model in an abandoned apartment in the early 90s . It looked a little worn then. It lasted me over 25 years before it bit the dust. I got this new model and it's more powerful that the old one. Even, when the bag is full it still keeps on sucking. The only gripe I have is the plastic tube wand seems a bit flimsy. Great buy , especially for getting in tight areas. I use it indoors and out , in my car, my shed. Sucks better than a shop vac. When I say shop vac don't use it on wet surfaces.",
        "I had a Eureka vacuum for about 15 years and I loved it. I gave it to my son when he moved out, it is been 2 years now and it finally gave out. I decided to get a similar one and I am very disappointed. this one is very noisy for its power, the suction is not strong, even using the extra floor brush that I got. The suction cord is so thin that it folds all the time, holds the air and makes a wizzing noise. It looks tip and does not do the work. I can not attest for the Durability, I am returning it. Thank you Amazon, delivery was perfect !",
        "I purchased this vac because the one I had for many years was so great. This one was obviously made much cheaper. I doubt that iot will hold up as well as my older one did.",
        "This was my second Mighty Mite after using and loving the first on hard floors for 5 years. I shouldn't have wondered why the price dropped - you get what you pay for - maybe!! The entire piece is noticeably cheap compared to the one I bought in 2014. The wand is so flimsy it bends just moving back & forth gently on hard floors, and falls apart where extensions are joined at least 6 times in an hour of use. Maddening! So disappointed! Still good power & suction, but not as good as the old one. Eureka - I would happily pay another $20-$50 for a better-made machine.",
        "Purchased this vacuum to clean out pews in our sanctuary. Works like a charm! The custodian is thrilled that her life is made easier, which is a good thing. Thank you!",
        "The attachments come apart easily, which is a pro and a con. If the lever gets caught on something it comes apart, however, switching from using the floor attachment to crevice tool is very quick and easy. It has really good suction to start. It doesn't seem to kick up too much dust. The cord is pretty long before I have to switch. The length of the hose is good as well. I do wish there was an option for a better (uncrushable) hose as this one will probably crack over time, but for the price it does really well. I hope it lasts a while. I am hoping it will help my allergies at work.",
        "After lightly using the machine for a month, it broke. Not only that, it killed two surge protectors. Other issue: The floor attachment does not work on carpet. I have short, packed carpet. Yet the floor attachment cannot roll over, and I have to continuously lift the attachment to initiate new strokes. Even worse, the floor attachment reduces the suction a lot. Pro: (1) It is light weight. (2) The suction is decent while it worked. Do not use any attachment so you basically vacuum a dollar coin size area at a time.",
        "I have owned Eureka Mighty Mites over probably a 20 year period. I use it daily to vacuum tile, laminate and carpeted stairs. It has awesome suction power! This one is the best so far, because one complaint was always that the plastic hoses kinked ALOT. On this one they have really corrected that and I rarely get a kink. The switch is smooth and it seems quieter as well. It is lightweight to carry from place to place, especially when doing all my stairs. They last years! I usually only get one when my husband needs a new one in his garage.",
        "I bought the eureka mighty mite in yellow. So far highly disappointed please read carefully. It comes with tubes to connect to the hose. They do not lock together. So there’s a chance if you have to really pull back they’re gonna disconnect. The head of the vacuum is just plastic with no rolling brushes. But wait! They let you buy two other attachments if you want to add to. One of them is the more appropriate head with brushes on it. So do you think you’re getting a good deal but then you have to order extra.",
        "Quick delivery - thank you !! Right out of the box the suction was great for the first use, but towards the end of my first vacuuming \"session\" the suction was less strong - average amount of household dirt vacuumed. This is my second Eureka Mighty Might (3671A yellow). The first one (3670G orange), not purchased from Eureka, only lasted 10 months, but I received a full refund. Hope this one from Eureka lasts much longer :) All attachments, hose, floor nozzle & canister look great; operate properly for the most part.",
        "I have owned this model for awhile, but the case, hinges, start button are now broken to the point it needs replacing. The new Eureka Mighty Mite 3670H just received appears to work as described, except for one very annoying problem. On the old unit the crevice tool slides into the handle of the vacuum, and pressure holds it in place. Has never fallen out. On the new one, there is no pressure, the tool just sits loosely in the handle, then falls out when the unit moves. So, this storage feature is useless. I called Eureka Customer Service, they said that it is not a covered issue. They will not repair or replace the vacuum.",
        "It is the best vacuum. I previously bought Hoover and it was horrible but this one is very powerful and light weight. If you want more power, you can turn the bar that is on the handle on top. When you close that small square thing, it gives more power to the vacuum. I discovered it by accident :))",
        "Reviews looked good so we tried. It’s cumbersome, no place or way to put it away without the long hose falling on everything. Have to stop and empty often and bags have to be bought/replaced. Cleaning around guina pig cage and continues to get the fallen hay stuck in the tubbing clogging the machine. It’s not used much now, it’s more of a bother. Got another stand up with a detachable handle/chamber for stairs, works much better and no clogging issues.",
        "What suction? This vac doesn’t suck up anything. It barely sucks up hair. I manually picked up a coffee bean that the hose failed to suck up and put it in the hose... only for it to fall back out! It’s strange it feels like it has suction when you put your hand over it, but then it doesn’t suck anything up while in use. Despite the rave reviews, it felt a bit cheaply made. I don’t know if I got a bad one or what, but this vac was basically garbage right out of the box.",
        "I owned a Mighty Mite years ago and was excited to find it again on Amazon. We purchased an older home that required a significant amount of cleaning, so the vacuum has been used a lot. It is the perfect size and weight to carry up and down stairs and the suction power is excellent. I wish the attachment for floors worked better on carpet, but it does and excellent job on our wood floors. It does clean the carpet, it just doesn't roll like a typical carpet vacuum; however, this is a small issue given how well it works otherwise. I've used it to clean floors, ceilings, walls, and furniture. Very versatile vacuum. Highly recommend this vacuum.",
        "This is exactly what I was looking for. It is a nice, light vacuum that is easy for me to use. It is excellent on bare floors and with a small adjustment to the suction, I can easily vacuum area rugs. I have back and hip issues that makes using a heavier vacuum painful. This is easy to carry, if needed and small enough to store in my closet. I also love the bags since I hated cleaning out the canister in my bag less machine. I would rather just throw away the bag and start fresh!",
        "The nozzle and stem come apart too easy when simply running it across the carpet. Ot does not have good reach for getting the middle part under the bed due to the bend of the piping near nozzle. I am very disappointed with this product and will purchase another vacuum soon as I see one, probably not from amazon since I think I must have mostly been paying for shipping on this purchase. I was excited about this vacuum after reading the Good Housekeeping review but this must surely be another model because it is the worst vacuum I’ve ever used in my life ... not exaggerating.",
        "I have two very hairy dogs. Vacuum graveyard at my house! I have been using a garage shop vac to clean and ergh is it bad on my back. Got this little guy and omg! I love it! As for the floor scratches, the only way I can see is if debris got stuck in the wheel. The plastic front doesn’t really hit the floor due to a center wheel. I can see if you got some debris in the middle wheel I.e gravel from shoes it could scratch but not the vacuum itself.",
        "My first one lasted 26 years. Love the new color of this one and it is a lot more powerful than even my first one, if that's possible. This thing keeps going and going. This is the reason I purchased it again after 26 yrs. Great suction power for carpet too!",
        "It broke the second time I used it. Just 3 days after the return guarantee date.",
        "It claims it also doubles as a leaf blower but there is not nearly enough power to do that. It also takes bags which I don't care for. I tried it once and it's been in the closet ever since. It really was not worth the money I spent on it. I would not recommend this product.",
        "Wow oh wow is this a great item. With back issues dragging around my vacuum was getting difficult. I initially bought because of the size but now that I have it I wished I would have found this years ago. It has great suction power, long to reach above tall items and a long cord and light enough to do steps with ease. My new brand and if I ever need another one -- I will buy this marvelous product!!",
        "I have my own house cleaning company and I was in need of a new floor vacuum. I've repurchased this particular vacuum for years now because it's so good! It definitely last a long time and has great suction power, 10/10 would recommend!!!",
        "I absolutely love this vacuum, the suction power is great! I clean houses for a living and we love it you can even vaccum a few thin carpets with it as well. It's pretty light weight, just know that you have to learn to control the suction on the top of the stick by opening or closing the little sleve. The only thing that it has a hard time with is dried leaves, as all my vacs without a rolling brush. The only thing I would change would be a longer cord!",
        "Had a Dirt Devil can vac for 33 years that worked great but loud - a sucking, rolling jet engine. Needed a replacement and this little guy fit the bill. It works wonderfully - lightweight, easy to drag around and it's not so bloody loud. Hardwood floors and four large furry dogs and this thing gets it all cleaned up quickly. Attachments are held in place just fine. And it's a great price point too. Bonus was getting five bags.",
        "I’m still trying this VC but definitely it’s too noisy and produces a funny, burning smell as if the engine is ready to burn out! The suction is very powerful but I wished it had a cord retractor as it is too long and annoying to keep gathering it!",
        "I have owned several Eureka, that's why I bought this one ... they are great little machines. I prefer a canister vacuum Because I have arthritis and they are easier for me to handle. I wouldn't hesitate to buy another one!",
        "I'm guessing this model is a replacement for the older, even smaller, sweeper, which I had for several years. It does have good suction but is much more clumsy to use. The older model had an automatic cord rewind feature which was so nice. The cord on this one gets wrapped and stored on the bottom of the sweeper...just seems inconvenient and requires more time to return to my closet. Given what I know now, I probably would not have ordered it.",
        "Oh wow! Ok, this lightweight, little yellow canister vacuum is seriously powerful! Perfect for a once-over on carpeted stairs, never had to worry if it was getting the job done! Make sure nothing is on the floor you don't want sucked up, because it was grabbing things an two inches away from the suction tube. It's great on carpets, just don't use the brush and pull it toward you as you go. It's not quiet, but it's standard noise. Sad that the cord's not retractable, but it works great!",
        "I'm in love with this vacuum. I have 100% hard surface floors in my home AND a German Shedder. Let me tell you, this vacuum is amazing on the floors (wood and tile). As others have reviewed, the suction power is superb. The only downside is I do wish the vacuum had a retractable cord. That would make it perfect. Nonetheless, I still love this vacuum and the long handle means no more bending down.",
        "Cheap plastic hose that folds over itself and cuts off suction very easily. It’s hard to change directions without moving the body of the vacuum first because the hose folds over and cuts off suction. Not up to previous models.",
        "I had several of these in the past. All of them lasted more than two years of heavy use. This one is a piece of junk. Got it July 10. The plastic around the wheel cracked and therefore, the suction power sucks (no pun intended). I fixed it with tape, but the plastic keeps cracking. I do not know if this one is made in another country, but is obvious that the quality is really bad. Very dissapointed. Would not buy again. And You shouldn't .",
        "Suction power is great but the vacuum is very noisy - I wear ear plugs to avoid damaging my hearing. This vacuum is good for hard wood floors and tile but those with carpets should probably invest in a more expensive vacuum with a spinning brush and better sound insulation. My expensive vacuum broke and I'm glad I was able to save money at this point in my life, but I look forward to the day I can replace it with a quieter sounding vacuum. It gets 5 stars for getting the job done at a low price.",
        "The Eureka mighty mite is the best vacuum cleaner I ever owned, bar none. You can order the bags from Amazon at a great price too. I use this mighty mite everyday on every kind of surface and the suction is always superior, it has never clogged and my previous ones have lasted many years. The fact that Eureka can make this mighty mite model and sell it for under $100.00 proves that all other vacuum makers are ripping off their customers.",
        "This Eureka Mighty Mite showed the power to over take those other vacuums that cannot even fit to go under my bed. The up-right canister vacuums are all too bulky to fit. That was my reason for searching for this particular item to purchase....to find a vacuum that could get under my bed. This \"Mighty Mite\" has the best suction of any others I have used. Also, it does not have wheels for all the accumulated cat fur that has been building up for a while to get wrapped around them. It's all in the suction. I say, \"Eureka\"! I love my new vacuum! I would recommend for anyone to buy one of these....and I would buy it again.",
        "Just got this as an alternative to a vacuum. I have 6 dogs and have broken twice that in vacuums. This is all plastic, hard to maneuver on carpets, very clumsy, but it has a powerful suction. It would work better on hard floors...I have carpeting in one area - where the dogs all gather. Until it gets ripped out, this is my only option. A much less expensive alternative to high priced vacuums. I've ruined 2 Dysons, and countless others. Never again! It does get hot after some use, but i gave it a good working out, even in a smaller room.",
        "There may be a use for this vac but overall it really is a cheap product. The hose is cheap plastic that arrived bent and couldn’t be straightened out. Connections were also cheap. I returned the product as it was not useable.",
        "The vacuum cleaner doesn't suck that well and The pipe is leaking air. My old $29 vacuum cleaner is more better than this vacuum. I have to find another vacuum cleaner.",
        "This is a great lil vacuum for spot cleaning, however, I wish it had an attachment for doing the floors. I got it because I own 4 cats and a parrot, and thus needed something with a lot of power that is simple to take apart in case of clogs. It works well, just wish I had a powered head attachment. It eats seed shells, clumps of fur, and general dirt very well.",
        "Bought this to replace a worn out 20 year old Mighty Mite. I think too much stuff had gone through the impeller, just wouldn't suck hard enough anymore. Was concerned buying the same brand but this baby does the job, really sucks, and they've improved the design in several ways like the larger wheels. Good set of accessores. Great value. All I can say is,,, \"This thing sucks --- I Love it!\"",
        "Beats all expectations! Light weight, small, powerful and a beautiful bright yellow! The suction is very powerful for such a small machine. The only drawback is the bags are smaller and have to be changed more frequently. I love this mighty mite!",
        "Here's the thing I ran it one night and vacuumed the 12 x 12 room the next day I vacuumed the room again and all I could smell was an electrical ozone type smell. I've had many of these Vacuums in the past. This will be the first one I called Junk I usually don't review things until I've have them a few months but when you got a problem the second time you use something I don't know. I shouldn't be smelling the electric motor after its ran for less than 10 minutes.",
        "I have owned Mighty Mite vacuums for decades and loved them. This vacuum is cheap, flimsy, and suction is not adequate. Returned immediately.",
        "The only problem I have is the extender tubes should have a locking latch sometimes they randomly come apart. Great to go between hard wood and rugs and carpet. The suction adjusting cover thing is great to easily adjust suctions on surfaces. Works great getting under couches. Lightweight for carrying around house, cord storage is good and clean, bags easy to install and change.",
        "Hose broke within a month. So did the power button. I need to continually hold the button down for it to work.",
        "This was a replacement for another Mighty Mite purchased in the early 1990’s. The first thing I noticed was that this one was much lighter in weight. The other thing I noticed is that the brushes don’t stay on the end of the hose very well—irritating. Suction is okay on my tile floor, but not so hot on carpet, especially with the brush constantly falling off. I’m disappointed with this purchase.",
        "Light weight and good suction. Great for elderly or other persons who can't handle a heavy weight vacuum but still want a canister style. In addition to the vacuum canister itself being light, the plastic hose, wand and attachments are light weight, although they feel cheap -- but that makes the vacuum easier to use. Was purchased to replace an old Mighty-Mite that finally wore out after a lot of use and so far it has been great.",
        "Greetings, This little guy is amazing. The suction power is hard to believe. I had to replace my old one and the attachments and ease of use was so good, that I ended up getting one for my Aunt. She needed a new one and has a cat and she was really impressed with how good it cleaned cat fur off her furniture. Be well, Roy",
        "I’ve had this little power house before, but got rid of it after our apartment remodel. We had to get another one now we have the house. It is a small, powerful mini “shop vac”. We use it for anything you’d use a shop vac for, except for water. It is powerful, lightweight and durable. It has a decent length hose, and vacuum attachments.",
        "At $65, this vacuum EXCEDES our expectations! We have , in the past, purchased more expensive name brand machines of inferior quality!! SERIOUSLY, unless you are one of those great folks who LOVE cleaning, ANY vacuum is going to be, at times, clumsy and uncooperative. This one is as easy to use as it gets! Great suction, rolls well, yet light enough to carry for overhead work. Lots of bag capacity too! At age 60, and at one time a pro house keeper, this is THE BEST I've used!!!! It even does well on our 5x7 area rug! THANKS EUREKA!! Harriet Crockett",
        "It's light weight, can maneuver around well. Dust bunnies no problem. I started using them on my job sites back in the late 80's around the walls, and window sill's for dust and minor clean up. It beats dragging out a big shop vac or the upright. It's a good idea to get the reusable bag saves some money. I use it in my 5th wheel as the uprights are a pain. The only difference I see from what I used and had before is the wand extensions are a little thinner plastic",
        "I researched a lot of vacuums and this one seems to be a well liked name that’s been around for years. I don’t love that the cord doesn’t retract & the poles & head feel a bit flimsy but for what you pay it does the job. I also have a small area of carpet & a rug that it cleans without coming apart. It’s really all I need for my small space.",
        "A question should have been included about attachments. They are OK, but small-size. Overall it is very good quality. It works well on rather thin carpet (hospital-type) and wooden floors; but if you have thicker carpet or rugs, you apparently have to order another piece and they don't seem to inform you of it. On thicker carpet it grabs ahold of it SO MUCH that you cannot move it at all. I don't believe it states this in the description.",
        "We were out of town and very specifically choose for the delivery on our Amazon delivery day on Tuesday so we would be back in town. The package was delivered on Monday, labor day, the day before our chosen date. This was in the middle of a rain and hail storm. This is an electronic device left NOT on the covered porch as instructed, and NOT on the day we expected it. I am not sure I want to open the package or just return it.",
        "Other than the cord not being as long as Id like, I love it. It was inexpensive, does a great job. Easy to use. And I love the blower function. Its not very strong but strong enough to blow dust bunnies or dog hair out from under furniture I cant move to vacuum under. As far as the suction, its great. Works better than the expensive brand I also have.",
        "This is the 3rd eureka mighty mite we have purchased. One for our main home, one at summer home and gave one away. Recommended it to our house cleaner. Great for tile, hardwood floors cleaning up messes, auto cleaning, baseboards, etc. It's not good for doing carpet. We have a separate vacuum cleaner for carpet. Lightweight easy to maneuver, very reliable and priced very affordable.",
        "My friend has this vacuum and it’s over 20 years old! I was so impressed I just had to have one and was so pleased to see that Eureka still makes it and it has 2 more amps than hers. One more thing I have a high end vacuum I paid over $300 for and I am giving it to my Grand Daughter because I prefer the Mighty Mite! I use it for everything, hardwood, slate, carpet, vinyl and my ceiling fans. I have 4 long hair cats...need I say more.",
        "I used my last one for over 10 years; used it till the wheels fell off. It's light enough for this senior to carry around, goes under the bed and cleans the fan. Sucks up cat hair and dust and I can tell how well it works by how full the bags get and they are cheap enough to switch out as needed. I gave away my upright vac and this MightyMite is all I need. Seriously love it. In fact, my older sister gave me my first one, I bought my second one and my neighbor wanted one so I bought one for her too.",
        "This isn't a fancy vacuum cleaner, but if you want a cheap workhorse, this is it. I have the eureka brushroll clean upright for my carpets since we have an annoying constantly shedding golden retriever. That vacuum is amazing for that, but you can't get into crevices unless you use the tools, which I find aggravating. So I bought this one for utility purposes, corners, hard floors, kitchen, bathroom, etc. I grew up using this vacuum, my parents still own one. If you have an animal and carpets, you'll need something with rotating brushes as well.",
        "This is the Mighty Mite of my youth. Love the swivel head, switches you can use with your feet, and the reverse blower. Tired of vacuums that suction is so extreme I can't push it. This has a super long nozzle and cord. I'm tall and don't have to hunch over to use this. Use the reverse blower on outdoor patio and porch. Terrific price and product.",
        "I have owned an earlier version of this model for 20 years and it was a great little vac until the wheels broke and parts were not available to repair. I had hoped the new version would be as good but was totally disappointed when I opened the box and saw how poorly made it was compared to my old unit. Packed it up and returned it! I would have been happy to spend twice as much for a quality product.",
        "I've been using Eureka vacuums for decades, but this one that I bought for my daughter's birthday turned out to be a real disappointment. The switch broke in the sixth month of use and we don't see a way to fix it. We want to return it.",
        "Love the Eureka canister vac! Is very powerful and compact! The long nose attachment and brush attachment fit on the vac body which is very convenient. The bag is extremely easy to change! The only disappointment is the 2 long tubes for the carpet attachment. They are plastic and very flimsy which makes vacuuming carpet very difficult! However, I didn't buy the vac for carpets. I bought it for dusting with the brush attachment and vacuuming dry spills with the long nose attachment.",
        "This Eureka canister vacuum is durable, but its larger and seems more clumsy than the old Boss Eureka I had previously. The wands are longer and come apart tooo easily. It does have great suction. Time will tell if the flexible hose will hold up as long as my \"old Boss Eureka\" did. It just seems harder to move about and not at all crazy about the floor brush.",
        "Purchased this to replace my 15 year old Eureka Sanitaire canister vac. It looks exactly like my old one and I LOVE it! Great suction power to pick up debris off my hardwood floor. I did not use the plastic head that came with it as it did not have the full set of bristle brush and I felt it might scratch my hardwoods. The bristle brush attachment (which you can purchase online for about $10) is a must in my opinion if you want to use this for hardwoods. The canister is lightweight and easy to maneuver. Hope this lasts as long as my other one where the cord plug became faulty. Would buy again",
        "This is my second review of this vacuum. In the first review I gave it 4 stars because it doesn't do that well on carpet, but is great on hardwood floors. Then my wife told me she only bought it for hardwood floors. I don't even know if it's supposed to work on carpet, but it does great on hardwood. My bad. So I've changed my rating to 5 stars.",
        "I was excited to buy because my client has a older one and I wanted one. I loved cleaning with their older one. I put the vacuum together the day it came. I have mainly hardwood floors so this vacuum would be great... I thought. The hose is so flimsy. When you push down to vacuum on the hose it’s not sturdy AT ALL!! I do not like that! If the company had made the hose a harder plastic. Also it needs suction power. I almost like return because of the hose. Next time I will not buy without watching some review videos.",
        "I like the eureka mighty mite 3670G bcuz it has great vacing performance; however it doesnt blow exhaust air thru the hose (when connected onto blower port) The vac also gets very hot when running & takes a while to cool down. I purchased 5 seperate tools—a genuine eureka horsehair dusting brush, a genuine eureka upholstery tool; a generic horsehair bristle floor brush, a telescoping wand & a generic rug tool & the vac works much better with upgraded tools. I also use generic eureka style MM hepa bags so vac runs with clean exhaust & no dirt leaks past the bag So i waited nearly 5 yrs 2 write this review",
        "I just received the vac last evening, and we noticed a piece of black plastic in the bottom of the box. When we checked the vac we discovered the top black handle was broken. There is a chip broken out of the handle and it is cracked. We are going to put tape around the handle to prevent cuts on the very sharp plastic. I am very pleased with the suction power, and how light the vac is.",
        "Great vacuum for wood, laminate, or linoleum floors. I’ve used it on my low pile rug in my living room and it works moderately well for that. I do prefer an upright for rugs and carpet but I got this b/c my home is primarily laminate flooring. The disposable bags pop in and out very easily and this vacuum is lightweight. Overall I’m very pleased!",
        "We owned this machine before and loved it. We had the last one for approximately 16 years when the motor conked out ... lol ... but we thought we got our use out of it. The new one arrived looking and performing like our old one. The hose comments are true, you have to be careful the hose doesn't crimp when using it. If it does, re-adjust it and keep cleaning. :)",
        "Great powerful suction does a great job of cleaning we really like the vacuum for the price. I bought this for my wife so we could get chores done around the house and keep the car clean. It has a lot of suction the vacuum is very powerful and does a great job we like the bags and how clean the air output is from the vacuum.",
        "I like everything about this vacuum. I looked for pet vacuum and I found it finally. Great suction! My daughter has long hair and all 4 vacuums that I had before were broken after the first week because long hair were tightly rolled in the roller brush. This vacuum doesn’t have roller brush and just suck it all in. I also like it because it is not bagless it keeps all dust and pets hair in. The bags are not expensive I bought ten bags for $16.00 that is only $1.60 per bag. It is affordable. My friend has the same vacuum for 25 years and it is still in working condition. The price is right!"
    ]
}