{
    "entity": "Canister Vacuums",
    "text": [
        "This is a replacement vac. Lost my original in a divorce and have been absolutely lost without it. I have wood floors now in addition to lots of stairs. Soooo critical to have this vac for stairs! Its lightweight and easy to carry up and down. The new swivel wand is a new feature from my old vac and makes cleaning the wood floors easier. I also bought another upright Oreck for the carpet upstairs. No other brand for me - Orecks are dependable and are genuine workhorses. Great quality, easily bag replacement with zero mess, thoughtful design in all their products, and they last!!",
        "It was exactly what I ordered except for the Floor & wall attachment. It's the worst thing I've ever seen for floor & walls.....hard scratchy bristles, a metal plate & 2 exposed screws.....imagine running that across your hardwoods or walls! Lots of damage.....I'm keeping it & ordered the horsehair floor brush attachment but it cost me an additional $26 so if you are looking for a solution to walls & hardwood floors.....this is not it!",
        "This vacuum has 2 terrible features. First, if you actually hang it on your shoulder from the strap, the exhaust air from the back end will blow any piece of paper (or other light object) you may have on a shelf or table all around the room. Second, The hose is too short and inflexible. Moving the pipe around on the floor makes the whole vacuum swing wildly. I am reduced to putting the vacuum on the floor, removing one of the two pipes,then cleaning on my hands and knees while holding down the vacuum with my other hand..",
        "This is just a FANTASTIC little vacuum. Keep it out of the way of your drapes. LOL I have a Dyson Animal vacuum and it's GREAT for the floors, but if you have a lot of dust and cobwebs in your area, THIS IS the vacuum you need. Great for corners and hard to reach spots with a more than ample amount of suction, a really nice tool holder mounted right ON the unit , easy to change bags and it's lightweight ! I would not even shop around if you are in the market for a small vacuum for your home and/or car. Happy cleaning !",
        "I bought this vacuum 2 years ago and I have always liked the Oreck canister but this one, the hose that came with it was very short and never did stretch out. It was hard to use because of that and the hose ended up tearing recently. It seemed like it didn't have as good as suction as my old one either. Like a lot of products, they don't make them like they used to.",
        "Too Bad I couldn't give this item 10 stars. We use to live on a farm and rescued 6 cats and 4 small dogs. We just recently retired and moved to a home with a lot of ceramic tiles Nothing worse than ceramic tiles and loose cat litter. This vacuum sucks it right up and it is so easy to handle. The second worse thing is upholstery with dog and cat fur. Zip Zip it comes right off with this vacuum. The vacuum is so light to carry and so much easier than dragging around a canister or an upright vacuum. Can't say enough for how much I like this vacuum.",
        "perfect stand alone for a small house or just as a spot vacuum . has everything you need. however, amazon had to adjust for a missing computer cleaning tool set. just what we needed. some people complained in their reviews about the flat floor attachment. there is a button to flip the head higher on bristles so the screws won't touch the floor. I found a good site that sold bags 20 at a time. just what I wanted",
        "I have used one of these before and knew it was a quality product. Great suction, even as replaceable bag fills up. I have two long haired cats, and rugs on hard wood floor, and it picks up all that cat hair beautifully. I consciously chose the older model of this because I had experience using one before and knew the suction was excellent. One thing to be aware of is that not all buying options include all the attachments, I missed that and will be ordering one that mine didn't come with. Not the sellers fault, mine for not reading the description closely.",
        "My new Oreck is barely O.K. I am disappointed that there are no wheels like on my \"old\" Oreck. The tubing is too short and the machine seems heavy. Maybe the weight increase awareness is due to the lack of wheels and I am having to lug it around. The assembly instructions are also lame and the diagrams that accompany the instructions are difficult to follow. I put the hose attachment plate on backwards (couldn't see picture clearly) and it just about took Godzilla to get it off and correct the situation. This machine does not measure up to my \"old\" model as far as being user friendly.",
        "The suction power was terrific compared to another carry canister vac I tried. Also it is super light weight. However, it blows out the back so strongly that it blew papers off a table, blew socks off a chair, whenever I turned around it blew around stuff behind me. There is no option to alter this issue. I read this in another review but didn't realize what a flaw it is.",
        "This little vacuum was just the right size for cleaning our 5th wheel travel trailer. Compact, powerful and light weight. Unfortunately, it didn’t even last one year. It took a tumble down one step in the bedroom of our rv and stopped operating. Like I hit the off switch. I checked it over. All looked ok. Not over-heated, filter clean. Bag had been replaced last cleaning. Made sure I didn’t trigger a power breaker in our trailer. Nothing. I may contact Orek to see if they will honor a replacement due to not even having the vacuum one year.",
        "I had an old Oreck which was still doing a good job but opted to get the newer version because my son needed a vacuum for his apartment. This does not disappoint. It actually is better than the old one and I like all the new features it comes with. 5 stars. A bit spendy but if it lasts like the other one it is a good investment.",
        "Had Oreck before and it lost its suction, but it was over 10 years old. This one is really nice and does well, except the extension pole is cracked and its not that old. Not happy with Plastic Parts.",
        "I'd had the same earlier model for 15 years or so. Decided to give it away when we relocated for retirement. At my husband's urging, lived without it for a few months. So glad I bought the new model. It's as good as I remembered and should last me the rest of my life.",
        "The brush attachment is the best for dusting simultaneously -- a way to clean manually a stubborn surface with a brush head and vacuum it up -- great for corners, stairs, bookshelves, etc. This will change how you do housework.",
        "My old Oreck finally stopped working so I bought this new one and am happy with it. It is heavier than my old one but has way more suction power. I hope it lasts as long as my old one, about 20 years.",
        "Blower is unshielded and blower will flow things around as you vacuum. The suction is great (probably why the blower is too). I do not care for the hose. It is short, but will (with effort) stretch a little. Best to use it with the extension. It occurred to me that while I vacuum I'm actually blowing dust all around. Make sure that everything is tied down or it will also get blown off tables, etc. Also, since the blower is unshielded, you also can't use a HEPA filter with it. I'm going to look for a replacement.",
        "I ordered this compact vacuum for cleaning out my car. It’s small but has great power. It’s much easier to use than my full-sized vacuum. I’m very happy with my purchase!",
        "Granted this is lightweight and does a decent job for the price. It just seems a little Fisher-Price to me. One reason because I can't keep the poles connected to one another. Right in the middle of a clean, the bottom attachment or the long pole will just become unattached. It is annoying but I keep on reattaching and muddling on. I think it would be an amazing upgrade to this product if you screwed the poles to one another and each attachment as you used it, then they wouldn't just pull apart. Just one little notch to hold in place would make me a much happier cleaner with this Oreck.",
        "Giving 3 stars on maneuverability. Oreck has improved the secure connection of the hose to the vacuum. However, they neglected to do the same for the connection of the hose to whatever attachment you want to use, especially the extension wand.",
        "The attachments split easily at the connecting points. Bag clogs super quick. For light cleaning on hardwood floors, it worked ok for me. Powerful enough to pick up sand tracked in from the beach. Would be better if it came with some sort of carrying case for the vacuum and its attachments. Instead I have it all thrown into a cardboard box during storage.",
        "Got my original Oreck canister free when I purchased my upright about 15 years ago. That canister's hose started to wear out (duct tape fix) so I retired it to basement duty, and bought this new version for upstairs. Wow! Better than the original. Great suction, quieter, and it feels very sturdy. I like the new select switch between bare floor and carpet. And the built-in cord bracket is a nice feature too. Buy this.",
        "I bought this to clean out the car, and vacuum the tile floors in the house. There are numerous attachments to use- which I like. It has enough power for me to do all my chores. Occasionally, the attachment you are using will detach. Too bad it doesn't have push button attachments. It is easy to open to change the bag and or filter. Overall, I really like this vacuum.",
        "Wow, when it worked it was great, good suction, got in tight places. Lasted 2 1/2 months until the plug caused the outlet to spark and trip 3 circuit breakers. Cord cut off and thrown in the garbage. This was a replacement for the one that worked well for over 10 years. Would not recommend, waste of money.",
        "I liked is that it picks up dirt, hair,cob webs, spiders and bugs usually the first time. .",
        "Apparently, these are timed to work for only a short amount of time. My second try. Could not return. Won't use Orek again.",
        "I had a Canister Vacuum like the one I just bought. I loved my little Oreck canister, which was free with an upright that I bought years ago. It just gave up about a month ago so I started searching for a replacement. Amazon seems to have everything! I was so happy when I found these Oreck XL Vacuums again. I love it so far and hope it lasts as good as my first one!! They are great for upholstered furniture and almost any other household task. Of course they are small and only for light household jobs as far as I can see, especially if you expect them to last. A great product!",
        "The machine is great in all aspects of cleaning. Great suction, easy to work with, and I strongly recommend this item.",
        "This vacuum had great sucking power. However, the strap clip/clasp broke the first time I used it. For such a well designed vacuum function, this is ridiculous. The vacuum is rendered virtually useless without the strap being held properly in place--it is not feasible to drag it up and down steps!",
        "Wife loves the machine. This is her second so that she does not even have to carry it within the house, i.e., one for downstairs and one for upstairs. Does a great job on our wood stairs.",
        "The vacuum overheated so the sensor kicked in so No power. Once the vacuum cooled down, the power came back on. Thanks for your support because we thought it was dead. :-)",
        "this is an great vacum and would recommend it 100%. this unit and a upright Oreck is the perfect combo for any type of work, especially if you clean houses cause of its lightweight.I dont clean houses but if i did this unit along with a Oreck upright is what i would use. This also has the feature that allows you to connect the hose to the exhaust and use it as a blower.",
        "I was very happy to find this lightweight, super convenient vac with a bag in it...my experience with other hand-held vacs had been less than satisfactory. The suction is strong, the attachments are very convenient, and I appreciate the ease with which I can hang it over my shoulder and move from place to place without a struggle.Good service! It came in a short time after it was ordered. I told my neighbor about it, and the next week she ordered the same one and was excited about it.Thanks!",
        "Can't say that I'm happy with this purchase. I ended up buying a stick vacuum for my floors because the floor attachment did not work well for me. It kept coming out of the nozzle end and did not provide good suction. I will use it as a car vacuum I guess. I've had Oreck's before and loved them.",
        "would not purchase again-sorry. It just has no suction at all to speak of-sucks up very little I was so excited about getting this-",
        "My wife and I are getting older and needed alternatives to the clunky/heavy vacs that we have had for years. We bought an Oreck Magnesium for the floors and this compact for walls, upholstery, etc. This has been a godsend for us. The compact is so light and powerful that we are routinely vacuuming curtains, walls, ceilings. Very strong suction for such a lightweight unit.",
        "The Vacuum stopped working after 4 uses. And it has only 30 day return policy.",
        "Really handy and easy to use. I bought some extensions to reach cobwebs on my high ceilings. It works great.",
        "Love it - bought my first one in 1997 and it still works. Use it in the garage and for car cleaning - the crevice tool is great! Wanted a new one for the house (baseboard, under beds, windows, etc.) It's not blasting loud, bags are readily available and easy to change - the long cord is definitely a plus!",
        "So light and easy to handle which is very helpful for those who have arthritis, like me. Simple to set-up and use. Did a great job on my carpet and rugs !",
        "I've had and used an Oreck compact for many years and it lasted. I loved that one so I ordered this one and it is also wonderful. Suction on these is awesome and it's easy to use on the shoulder! I would recommend this vacuum cleaner to all people!",
        "I bought this to replace an old Hoover SH 10000 CA. The old Hoover was clearly better made than this Oreck. As far as performance, the Oreck seems about the same. The flexible hose is a little short. Noise level about the same.",
        "This little vacuum is the best! I had another one for 25 years, maybe more. It was still working but I wanted a new one. The large Oreck wore out many years before the compact. Not for wall to wall but great for everything else - bare floors, small rugs, corners, furniture, fans, ceilings, cobwebs, pet fur, lots of attachments, etc. Light as a feather. I've had lots of vacuum cleaners but this one in my opinion is the best and at a very reasonable price!",
        "Does a great job cleaning, fairly light weight, and made by Oreck.",
        "I had an Oreck canister vacuum for about 10 years and it broke. This model does not have the roller wheels like my other other one, so you have to carry it. It also seems a bit smaller. I do , however, this like the lightness and efficiency of this small vacuum for hard to get places.",
        "Suction is very good; size is perfect. However, I am missing the wheels on the cannister as were on my last one ==is lightweight enough to carry around but difficult for an older person to carry and use it at the same time -- everything gets twisted!!",
        "Wife and I are pleased with the Vac., Hose could be longer though.",
        "I bought this vac a number of years ago and have used it on my cars as well as touch up jobs in the house. It works well for both. Recently my Significant Other borrowed it and loved it. I bought her one and she's delighted.",
        "It is a pretty solid performer for a small handheld canister vac. I bought it mainly for use on the carpeted stairs, which does a decent job. It is great to have the option to vacuum out my car.",
        "I love this product for it's ease in reaching hard to get places whether it is a spiderweb high in the corner or under the lowest of furniture. My last one lasted 15+ years.",
        "I love the suction power, I love that it is a bag canister (allergies), I prefer the original design. I ended up putting a Dirt devil head with little wheels on mine. Now I like it better at least.",
        "I love this vacuum. This is my second Oreck Compact Canister Vacuum. I had my first one for about 20 years and recently gave it to my daughter which is why I purchased another one. It is great for all non carpet areas and also hard to reach ceiling corners. The shoulder strap this vacuum comes with makes it a hands free for cleaning.",
        "I still hope to order another one of these, however it arrived damaged. I'm assuming because of plastic parts and very cold temperatures.",
        "This is the 3rd one we have owned and the first two lasted for a number of years, seeing some heavy-duty pick-up detail along the way. Hoping this one also lasts for a long time. I use it to access those places where my larger upright vacuum cleaner does not reach and it does very well with scattered kitty litter pickup and anything else you can throw its way. Great little unit.",
        "I have used and abused this Oreck for a few months now, and let me tell you, it is lightweight and it does the work. I also own an Oreck sweeper, but to get the curtains, nooks and hard to reach spaces this vacuum rocks. I use the strap that comes with it and put it around my shoulder, and off I go. The long handles also allow me to get those pesky spider webs without getting too close.",
        "This vacuum is exactly what i was expecting. My mom has had one for 10+ years and still works great! It came with a bag in it and then an extra one. The suction is awesome! It has a long cord and stores nicely.",
        "Attachments do not stay on. This is my second one of these. The first one was better.",
        "This is my 2nd Oreck canister vacuum and I'm pleased to say it continues to work great!",
        "No complaints with the vac itself. However, I must say, though it was a \"used\" purchase, it had dirty attachments and it arrived with no instructions. Shipping was timely.",
        "This was a replacement for one we bought over 16 years ago. It has great suction. Don't miss the wheels since they broke off after a few years. I would prefer a longer hose and it did come out a few times. I use it quite a bit and like it.",
        "I live in NYC where space is at a premium. I have hard wood floors and one rug in my place and this vacuum is perfect for that. When I am done with it it fits underneath my bed, it is the perfect size for my place. The hose is a bit short and you have to carry it, but if you have a small place it really doesn't matter.",
        "This is my 2nd oreck compact canister. I wore out my 1st. New model vs. Old model... new - cannot be used as blower, on wheels but tips over constantly, filters cost approximately $20+ each. Old - has blower, hand held or shoulder strap and filters cost less than $10 for 12 filters.",
        "Believe it or not this was a Christmas gift requested by my wife. She loves it and said it was even better than her old one.",
        "We tried other canister vacuums but this one is so much better than the rest. The cordless ones aren't strong enough, but this one with a cord is not too heavy and it really sucks around the house.",
        "Great machine! Such a better upgrade from the 2008 I had prior!",
        "I bought this to replace my wife's 7 year old vacuum of the same model. This is just as good as the original which cost $350.00.",
        "Everything is as advertised - only reason for 3-stars is the hose is too short to use when vacuuming floor mats in car unless you place the unit up on car seat. It literally won't reach the corners furthest from the door if it's on the ground outside and not in the car. Bad design - I would have returned it but waited to long. Hopefully can find a replacement hose that's longer.",
        "Weak suction. Swivels all over the place when trying to vacuum",
        "Bought for everyday use at home. Works wonderfully, has excellent suction with little ability to become clogged!!",
        "Very handy, well constructed small vac. Shoulder strap is an excellent idea. Suction is great and very useful with included tools to clean up after our cat. I even used it as a blower to clean our gutters.",
        "Great suction power. Perfect for hardwood floors. But very short cable length. It does feel like cheap plastic though, I already have a few in the extension wand.",
        "this vacuum is a back saver. We have 3 sets of stairs and it has always been a pain to clean them. The vacuum has a very strong suction and your back feels good after the cleaning is complete",
        "We have had these little gems for st least ten years, and I was very happy with the first two or three. Since then we have had problems with the units getting very hot and in one case almost melting. This was due to the unit running very hot because the filter clogged, an the internal fuse did not shut down the motor. We have not been happy with the short flexible hose provided, either. I think Oreck quality has slipped in recent years, and I hope they recover.",
        "I like this vaccum very much. My only comment is the hose is not very plyable and giving. You really have to bring the canister along with you as you clean.",
        "Bought one for all the kids. If you have dogs this vac is great for dog hair build up along walls. Gets the bugs in windows. Use it everyday.",
        "This little bad-boy really sucks up the dog-hair! I have limited mobility, so it's difficult for me to clean in those tight areas (corners and under things) ... No problem now...!",
        "Wish the hose was longer. Use where my vacuum doesn't reach.",
        "Like the vacuum, but needs better instructions to attach strap and tool holder.",
        "So glad I found one of these; I do not like the bagless ones. This is a true Oreck -- picks up everything and reaches in the corners where you cannot use a normal vacuum. Lot of great attachments too.",
        "Have always loved the oreck portable vacuum cleaners. Run very well and last A long time. Lots of attachments to use too. Only negative thing is it runs very hot after 5 min of use.",
        "Manufacturer has changed design on the wand hose. It is shorter and VERY much harder to work with. WIsh I had known that before I bought 2 of them.",
        "Compact size for ease of use but definitely delivers full-size results. The strap allows hands free use Attachments versatile for many uses. Quick delivery and process time!",
        "This is my second Oreck canister vacuum I had the first one just over 15 years and I am sure I will get the same service from this one. Oreck is a great produce, the suction is supper powerful, the light weight of the unit makes it so convenient and easy to manipulate. I do think this new canister is a bit heavier than my old unit but not in excess. Thanks for the great price Amazon and I did a lot of shopping for this product.",
        "I love this vacuum! I can reach anywhere. Floor, ceiling, tight spots, under furniture and it is light enough to carry on my shoulder! I feel like I can go twice as fast. My favorite tool in the house!",
        "This my 2nd vacuum named above.....I LOVE it because it is so light....I put the strap on my shoulder....easier to handle.....It picks up dirt and pet hair.....many attachments for different jobs.....cleans blinds, walls etc I recommend this highly to everyone......and you can't beat the price",
        "I was looking for something small but powerful. The previous reviews helped me in my choice. I don't have carpet but I do have dogs and boy o boy they leave a lot of hair. This compact vacuum is just the right size for picking up hair and dusting.",
        "Excellent canister vacuum, very powerful. Great for doing my stairs with rugs. The attachments are great for cleaning drapes, couch and my fans.",
        "It is smaller with great power to clean. Always have been happy with my Oreck products. Also own an upright vac.",
        "I love my canister vacuum in that it gets in all corners of the rooms I’m cleaning & easy to clean up under furniture !!",
        "I love this little vacuum... so much that this is the second one I've purchased. I keep one at home and one in our RV. It's very compact and handy, and I've never had any problems with it.",
        "This vacuum is my first choice in the house and car. Combined with the upright Oreck, I have all I need to clean up quick. My home is a 1929 Bungalow with two carpeted flights of stairs. I just place it over my shoulder with all the gadgets attached and hit the house. It allows for freedom of movement and the task at hand is quickly finished. Every spring the lady bugs bombard our attic, this clean-up job is easy with the compact canister.",
        "The Oreck Super- Deluxe Compact Canister Vacuum did not meet my expectations. I've used it several times. The suction is not that great. I'm mostly disappointed that the extension wands comes apart while in use. It is small and compact in size. It's very light to carry . I did try out the Oreck Ultimate Handheld Bagged Canister Vacuum in the Oreck Store and I wish I would've gotten it. In. My opinion it was the best.",
        "I used to have cleaning service and loved this twenty years ago, got this one because my old one was stolen.",
        "This vacuum is light enough to bring up and down stairs. It has great suction for a small canister vacuum.",
        "This little machine means business. It's amazing to me that it has this kind of power for how light weight it is.",
        "This is a great little vacuum....light weight and easy to use and has great suction....love it!",
        "Have had Oreck's for years, needed to replace this model, very satisfied",
        "The vacuum is fine, but the hose is too short. It's fine that it can hang on your shoulder but you can't easily put it on the floor if you want to. In fact if I could get a longer replacement hose I would.",
        "Good light weight machine for vacuuming stairs and small house. The only thing I wish it had was a shoulder strap to make the job easier.",
        "Easy to move around and use in hard to reach spaces."
    ]
}