{
    "entity": "Bundt Pans",
    "text": [
        "I ordered the 10-15 cup Anniversary Pan. The labeling on the pan said it is a Premier Gold Collection pan which it is clearly not if you have any familiarity with the brand. The inner surface looks painted and scratched (not Nordic Ware quality) and I'm highly concerned I received a fake pan. Also the pan is not marked the same as the one pictured. I'm returning. See pictures for concerns described.",
        "Not happy with this purchase because it has so many sharp metal edges you could cut yourself very badly. The first one I ordered was machined very smoothly. I returned the 2nd one for exchange and it is has more sharp jagged edges around the rim and handles of pan then the one returned.",
        "This product was great for the first two months of use. Then it starting sticking in several places on the side - despite handwashing after each use and spraying well with Baker's Secret. I have probably made over 35 cakes in it when it started sticking. I also allowed the recommended cooling time of 10 minutes in the pan. I am extremely disappointed and want my money back. Nodic Ware is a respected product, but I will have to find another option. I make these cakes for marketing with a health care business, and it is important for the cakes to look as good as they taste..",
        "I liked the picture of the item the most. What I did not like was never being sent the right item. These are nice pans, but I’m going to have to buy them somewhere else. The pan I’m being sent repeatedly is not even the item # listed. Also it is totally different, smaller, and cheaper pan.",
        "I have both the Pro Cast 12-cup original Bundt pan and this more expensive Platinum Collection 10 - 15 cup original Bundt pan. The Platinum one is thicker, consistently bakes more evenly, and is just better. If you are going to make a lot of Bundt cakes and can afford it, buy the Platinum one. If you want to spend less, the Pro Cast one is almost as good. It just does not bake as evenly.",
        "I decided to splurge and purchase this bundt pan a few days ago. It arrived on Wednesday and I baked in it on Friday night. I debated and glad I did. It arrived repackaged with hardly any noticeable flaws. It has a good weight and feel that I know will last a long time. It's very sizable and can hold up to 15 cups of batter but the recipe I used was 12 cups. This pan bakes very evenly and didn't take long to bake. I'm very happy with this purchase and results by the pics attached.",
        "Bakes up a beautiful cake. I purchased the 10-15 cup Anniversary pan. The benefit of this pan is no batter overflow. The edges of you cake won't burn or get crunchy because the cake rose too close to the top of the pan. It's a heavyweight pan. The little handles are a real plus when removing from oven and turning out of pan. This pan releases easily; even with a cake coming right out of the oven. No pieces of your cake left around the ring. . No need to grease and flour the pan. I used a cooking spray, but I think this pan would release easily without it. It bakes a beautiful looking cake. Worth the money",
        "Best Bundt Pan ever!! My first Bundt cake was a complete success - oil and dusted pan with flour before adding ingredients - came out like a feather - I would highly recommend-works perfectly every time - secret: crisco or oil pan well; post cooking, let cool 10 min - with knife carefully go around edges (don't scratch your pan!!) , turn upside down and tap on bottom. Falls out like a feather !!!",
        "Beautiful good quality pan. I don't see a non-stick coating, but I'm sure it's there because I've used it several times and the cakes all slip out easily. The crusts are beautiful and the cakes perfectly baked. Very easy to clean. I was hesitant to spend this much on a bundt pan, but am really glad I did. Best I've ever owned. Now I've used the pan several times (3 times) and the non-stick finish no longer works. Imagine drying to remove a cake from this pan? Takes forever and makes a mess of the cake. Started off great, but finish doesn't last. Way too expensive for a temporary pan. Ugh.",
        "Cakes come out nonstick but dark. Maybe I am not doing something right? I see a lot of 1⭐ reviews do to sticking. I am wonder what they did wrong. I have never had a cake stick on me in this pan or any other pan.I even did a pineapple upside down bunit cake, no sticking at all, just a bit dark.",
        "This pan is lovely to look at and is made of high quality materials. I have made two cakes so far and I sprayed the pan with Baker's Joy and spoon in the batter. The cake rises nicely and after you let it cool for about 20 to 30 minutes, you just turn it over and it comes out without any trouble. You do not need to run a knife around the outside. The pan is very easy to clean. I definitely recommend this to anyone looking for a bundt pan.",
        "The quality of the pan seems to be very poor, leading me to suspect that the product is not of first quality. There are divots in the interior of the pan and some of the edge around the top of the pan had rough spots that weren't smoothed. Several of the \"corners\" where the fluted design meets the top edge were not even, as if they had been shorn off at an angle. I have returned the pan",
        "This Nordic bunds pan is amazing and high quality. I do not want to use Teflon coated baking pans and this does not have Teflon coating. The baked cake literally slips out when turned over. I followed the directions of rubbing unsalted butter with a piece of waxed paper in the grooves and did not use spray oil. Nordic promptly answered my call and said only use sprays with flour if using baking spray. I am ordering another pan for my son as it is commercial quality.",
        "This is the ideal bundt pan. It's heavy duty. The light colored metal is good because it means the outside of the cake won't over-cook or over-darken. It has a non-stick coating, so cakes come out perfectly and keep their shapes (just remember to grease the pan). This can handle a 15-cup cake, but I also used it for an 8 cup cake and it was fine.",
        "This Bundt pan is awesome, just what I had been looking for tried it as soon as I got it the cake rose and browned evenly let it cool10 min in pan turned it over and it released with no sticking",
        "This is the original sized Bundt pan. Filling it with water it is a 15 cup capacity. You still should butter and flour it, but it is giving me perfect results. Releases clean, evenly bakes, nice quality.",
        "5 for sturdiness but I'm returning this. It was defective on the inside, from manufacturing. Too bad, I won't order this from Amazon next time I'm picking one myself. Those little dots you're seeing are rough and if you run your fingers across the lines they're not smooth. I don't trust that the cake won't stick and you can't put parchment paper in Bundt forms. I asked customer support to mark this return so that nobody else get this specific one.",
        "Nice heavyweight pan, medium color - not too dark. Grease and flour well. Let cake cool ONLY ten minutes. Turn upside down, and out it comes! Update: I've had this pan a year now, and I like it just as much as I did when I first received it. I've never had a problem getting the cake out of the pan. I've been using a pan spray (Bak-Klene ZT from Williams Sonoma). I leave the cake in the pan only 10-15 minutes after baking, then I bang the pan firmly on the counter on a dish towel about 3 times to loosen, turn it upside down onto a rack, and it is perfect every time!",
        "This pan is perfection. Completely smooth. Cooks thoroughly and releases cake easily. I have made a Lemon Bundt Cake and a Pound Cake - each cooked perfectly!! Highly recommend.",
        "It is a pleasure to bake in this pan. I previously had one of the cheap thin-walled Nordic Ware bundt pans, picked up before I realized how many bundt cakes I would be making and this pan is far superior. The non-stick on this pan is very slick. The pan has a little more heft, so I worry less about good heat transfer. The interior coating is darker (rather than the cream color on the old pan), so my cakes brown better. I also really like having handles, which are most helpful when removing the cake from the pan. It also came with an awesome-looking recipe for a hazelnut fudge cake. I should really make that sooner rather than later.",
        "Feels quality, thick metal. I use the method of 1T melted butter plus 1T flour mixed together and paint the pan with a pastry brush and haven’t had a cake stick. Hand wash it and don’t soak it like the package says. Same pan was $10 more at my local store. Definitely recommend!",
        "I was surprised at the poor finish on this pan. It looks great and.has a great shape and mass but when you start to handle it you can feel burrs around the edges where it was not buffed out in the finishing process. I thought this was probably a second that slipped through the cracks. I considered sending it back but I baked a cake in it and it came out great. The interior is fine so I decided to live with it.",
        "I recieved the second of two of these pans today I have previously bought 2 others as gifts The pans are very worth purchasing, although the packaging on the one that arrived today was great the one that came yesterday was terrible The pan was simply put in a to large box not in plastic or any filler It just rolled around, good thing it wasn't damaged!!",
        "After just a few uses, no matter what I put in this pan...IT STUCK!!! I called the manufacture and they informed me that I would need to wash the pan in extremely hot water and Dawn Platinum before each use. That work and nothing has stuck since. If this were the case, why did the manufacture not put a small note inside the box or instruction booklet. It caused me hours of frustration and aggravation for something so simple.",
        "We got tired of our cakes sticking to the old pans we had. We decided to try this Made in America one by the company that created these types of pans. Yes, it cost more that the others, but wow what quality. It is strong and absolutely non-stick. My wife has been so happy with cakes that slip out perfectly. No, this is not a paid ad though it may sound like it. We're just happy to have quality after having junk.",
        "Worst cake pan I’ve ever owned! Every time I use it the cake sticks,no matter what I use,crisco & flour,bakers joy, even a cake release recipe none of them work! I was so excited about this pan but let down because it sticks horribly 😩",
        "I loved the weight and size ..and how the cake came out ...but I think they sent me a factory second product...there is a bubble in side about an inch in diameter.. didn't bother the baking ..but for $31.00 it should be perfect and without flaws!!!",
        "After realizing my cheap-o bundt pan was actually too small for many of my recipes, I splurged on the Nordic Ware Anniversary Bundt Pan. This will accommodate all of my pound cake recipes, no more worries about overflow. Interior and exterior finish is super easy to clean. Cakes slide out beautifully. Very happy with this purchase and all Nordic Ware purchases. Can't beat their quality.",
        "While submitting another review I noticed that I had forgotten to write a review for this item I purchased almost 3 years ago. Well, I can safely say that it performs as well today as it did when I first purchased it and it's been used quite often. The pan heats evenly and cleans easily. The only thing I would add is that it takes a bit of a concentrated effort to grease the crevices. But the classic design is worth the extra effort.",
        "My dream cake pan. This makes beautiful Bundt cakes that pop right out and are easy to slice. This is the best Bundt pan for the money. Solid, heavy construction with nonstick interior. My first Bundt cake was a keto friendly cocoa and almond flour cake brought to perfection. You need lots of ingredients to fill the full Bundt cake pan to bake. Worth every delicious bite.",
        "Love this bundt pan! I have used it twice now and both times my cakes have turned out perfectly. I grease the pan with butter and then spray with coconut oil, let cool for 15 minutes after baking, and there is zero sticking whatsoever. Cleanup is a breeze. It has a crazy large capacity -- you could easily double a standard recipe and still have room to spare. So happy I got this just in time for all of my Holiday baking!",
        "I can't believe I waited so long to purchase a Bundt Pan!! After 31 years of marriage, I decided it was time to make a bundt cake. I love baking...so why not?? I was so hesitant to purchase yet another pan...but boy am I glad I did! This pan is fantastic!! I greased it with a mixture of equal parts of Crisco, oil, and flour (using a pastry brush). I had absolutely no sticking at all. This is truly a very high quality pan. And the cake looked and tasted wonderful!!",
        "My grandma and mother used to bake all cakes in a bundt pan. Turns out, they knew best after all. I’ve had mine for going on 7 years now. Cakes bake through as desired, it’s easy to prep, and it’s easy to clean. I always prep my pan with the Baker’s Joy non-stick spray w/ flour and the finished cake pops right out. I’m very happy with this tool in my bakeware collection.",
        "I love this pan and the brand but this makes my pound cakes so dark no matter how low I turn my oven down too. It is darker than the picture shows and darker pans don't conduct that well so your cake will turn out darker.",
        "I like this cake pan and I'm very excited to use it, but upon removing it from the plastic bag it arrived sealed in, I noticed the bag/pan were alive with the tiniest ants I have ever seen. Of course, I killed them all (sorry) and look forward to monkey bread without ants. Beware and make sure you don't invite a new infestation of ants with your bundt pan!",
        "I ordered this because I needed a larger bundt pan for recipes. I have a smaller nordic ware bavarian bundt pan which has lasted for decades. This was much lighter in weight than I was expecting and skeptical at first. However, I have used several times now on different recipes and completely satisfied. Its larger size accommodates 15 cup recipes. It has cooked everything beautifully and evenly and releases easily. The handles are a wonderful addition when flipping and cleaning is easy as well. Worth the price.",
        "If you don't want the pan to stick, rub some earth balance (similar fat) into the pan before pouring the batter. After baking, if your cake is still stuck, place the pan into a bowl of hot water for a few minutes. Loosen edges with a soft spatula (as a knife will scratch the pan) and then pop the cake out. I make berry cakes, lime poppy seed cakes, and pound cakes with no problems. And they look so fancy:)",
        "I bought this pan to make flan and it performs beautifully. heavy duty, easy to use and cooks evenly; the Nordic Ware Platinum Collection Anniversary Bundt Pan is made to last a lifetime. My flan consistently comes out perfectly, holds the shape of the pan, and gets rave reviews every time. The little handles are both a beautiful design feature and add function, a real plus when removing it from oven and turning the pan over. This pan releases easily; so cakes and flans look great. . No need to grease and flour the pan. I used a cooking spray, but I think this pan would release easily without it. It bakes a beautiful looking cake. Worth the money",
        "As with all bundt pans I have ever used ... you really need to use spam or oil and flour well ... as it protects the pan .. as much as it makes the turning out process easy ... the purchase was made on the recommendation of a cooking show on TV ... that we watch ... and we were NOT disappointed in our lovely holiday pumpkin pecan cake .. with cream cheese icing ... yum yum",
        "We make Bundt Cake bread in the nice Bundt pan. The dough is made in a dough setting on our bread machine and then made into little balls to place in the pan. After the dough rises it joins the balls and makes a great bread which is in the shape of the pan. Clean up was easy. A quality product that's heavy duty though light weight.",
        "I bought this because I wanted to start making Bundt cakes and it was even better than I I expected. It seems really well made and is a nice design with handles that are decorative and functional. It’s thick and heavy, which I like. Unlike some of my other baking pans, it feels substantial and like it will hold up for a long time without warping. My first Bundt came out perfectly and didn’t stick. Pan was easy to wash and looks brand new still. Highly recommend!",
        "MY MOTHER-IN-LAWS BUNDT PAN FINALLY WORE OUT AFTER 25 YEARS!! WE HAD NO IDEA WHAT BRAND SHE HAD BEFORE, BUT THIS ONE SOUNDED LIKE THE QUALITY SHE WAS ACCUSTOMED TO. WHEN WE GAVE IT TO HER FOR CHRISTMAS, SHE TOOK US TO THE KITCHEN TO SHOW US THE NORDIC WARE LOGO ON THE BOTTOM OF HER 25 YEAR OLD PAN. SHE WAS SO HAPPY TO START AGAIN WITH THE SAME PAN THAT HAD PROVIDED PERFECT BUNDT CAKES TO OUR FAMILY FOR 25 YEARS. THANKS FOR A GREAT GIFT AND THE UPCOMING CAKES!!!",
        "My old Bundt Pan was scratched up, and it was time to get a new one. This Nord Ware was highly rated by Cooks Illustrated. It is fantastic. Nice and heavy, but not too heavy, it helps the cakes evenly. At the end of their baking, they come smoothly and cleanly. The handles make it easy to hold. This is a fantastic Bundt Pan.",
        "AHMAGHERHD! You know how you had mom's old bundt pan, and just thought it was great? And then you buy a real one like this Nordic Ware Platinum and suddenly you realize you sort of owned a counterfeit pan? Yeah. Us too. First use was amazing compared to the weird things that used to come out of our old pan haha. *ahem* Seriously. I never thought I'd say \"quality bundt pan\" to anyone in my entire life. I'll be shopping this brand for other pans as we start to get rid of old ones (that have probably 9,000+ loaves of bread or brownies or such somehow molecularly bonded to the metal).",
        "I thought I was doing something wrong. I had 2 bundt style pans and the cakes always came out mangled looking with various amounts of cake still stuck in the pan when turned out. I decided to buy a new pan and got this traditional looking Nordic pan. I only used it once and it turns out it wasn't me but the pans I was using. The cake was perfect! Delicious and beautiful in it's simple design. Whew!",
        "I was using an old one that I thought was fine then I got my mom this one for mother's day and it was sturdy so I was already a little jealous of it then I saw her use it and the cake fell out of the pan so easy so I bought one for myself too. I can't say enough wonderful things about it, especially for the price!",
        "I read in Southern LIving that this is the bundt pan they use in the test kitchen and it releases the cake perfectly. I baked a pound cake after I received it and it was just as promised. I let the cake cool about 30 minutes, flipped the pan and it released immediately. Loved it.",
        "After 43 years my old Nordic Ware bundt pan needed to be replaced. While not the same on the outside and not as heavy as my original it holds the same amount of batter and releases beautiful cakes.",
        "I ordered 7/20/17, I have baked 6 cakes, the last 3 cakes stuck really bad. This pan replaced the exact same pan bought on ebay 7 month's earlier for the same sticking issues.",
        "My pound cake turned out perfect!!! Even I was amazed how beautiful the cake looked. TIP: After cake has cooled exactly 10 minutes, tap pan on dishcloth twice, invert onto plate and cake will slide right out. Not a crumb stuck to the Nordic Ware Platinum Collection Bundt Pan.",
        "Much sturdier than expected. Cleans well, bakes great. You can't go wrong with the best. I was excited to get this item it's been one of my wish list items for a while. Worth every penny!!! If you want to bake a Bundt, this is the pan to do it in.",
        "I'm one of those cheapos that refuses to buy expensive bakeware, but when my $10 bundt pan kept making my cakes stick, everyone pointed me in the direction of this pan. I don't regret it. All of my cakes come out without any issues, and it has handles to make getting it out of the oven and unmolding it easier. Do yourself a favor and spend the extra to get a quality pan, so that you never have to replace one again.",
        "It's a beautiful pan and cakes release like a dream. It's also very thick and heavy which is good. My only concern and why I gave 4 stars instead of 5 for cleaning is that if you use Baker's Joy or any other type of baking spray, it gets on the top lip and handles and once it goes in the oven it bakes on. And I certainly don't want to use a brillo pad on my beautiful pan.",
        "I was having a terrible time getting my pound cakes to come out of the relatively new pan that I had purchased. This Nordic Ware pan is perfect!! My 7-Up Pound Cake for our church picnic came out beautifully last week. The pan is very sturdy and also easy to clean.",
        "Love it. This was my first and last oval baking pan purchase. My cake came out without any issues and so beautiful. The texture was perfect. I baked a pineapple zucchini cake from a FB recipe for a family reunion. It was voted for best dessert there. Win Win.",
        "It's really heavy and an excellent color. I have another bundt pan that's a darker color and my cakes get too done on the outside before they're fully baked. This pan is perfect! I greased it well and the cake came out with the lovely definition.",
        "This is a big capacity bundt cake pan. It is sturdy, beautiful and releases well.. I strongly recommend!",
        "I love the volume and the look of the baked product, but it started sticking after a couple of uses, no matter how I prepared it. I love this brand, but I am very disappointed with this product!!!",
        "Love this pan.Easy to clean and my cake falls right out.Built like a tank.Should last a lifetime.",
        "After researching America's Test Kitchen, I bought this bundt cake pan to replace an ancient pan bought decades ago. What a difference - - clean crisp lines on the cake which easily dropped out in one, complete piece. I especially like the handles on each side.",
        "I've only used this once but after previous bundt cake pans that were impossible to remove the cakes, this was an absolute joy! I'm very delighted with the sturdiness of this pan and can't wait to use it again (it's summer and too hot to bake currently). Well worth the price!",
        "Needed a large bundt pan and this is perfect! Releases really well even if you don't butter it thoroughly/slather with butter. The cake itself looked gorgeous right out of the pan with no icing. It has a premium feel to it given its heft.",
        "This bundt cake pan bakes beautifully, releases the cake without sticking when properly prepped (use Baker's Joy), and easy to clean. You can feel the quality and easy to see why America's Test Kitchen highly recommends it. I'd purchase again.",
        "I gave this 4 stars because of inaccurate description. I returned the first order for the correct color. I still received the same color, which is champagne.. I wanted platinum/silver to match what I already have. As far as for baking, I am very satisfied.",
        "I was hesitant to buy a bundt pan because they seem bulky and take up space for something I might make once or twice a year. But this size is manageable and I was very pleased with the release of the cake the first time I used it. I just used Pam baking spray with flour in it and the cake popped out without any problem. Glad I finally got a bundt pan and trusted this brand.",
        "So I bought this to make a specific cake then, when I went to a box store I got another one (I am apparently impatient). I brought home the other one, which is the same brand the cake stuck to the pan. I returned that one because the next day this on was delivered and it released perfectly. It also had a prettier design on the top. Definitely recommend.",
        "Love, love, love this pan! My pound cakes come out evenly browned and beautiful. The size of the pan (15 cups) allows for my cakes to rise without bubbling over. Cakes release easily from the pan and it is super easy to clean. It is a heavier weight pan. I replaced 2 pans with this one and am not disappointed.",
        "I bought this as a replacement for my 45+ yrs. old Bundt pan. I particularly needed something that would hold 12 cups of batter, and a lot of the newer ones (thought they are beautiful) only hold 10 cups. I love the fact that it is so heavy, and nothing ever burns or overcooks, plus the easy-release factor, so I don't have to struggle getting cakes out of the pan. I would highly recommend it. (Especially for carrot cake!)",
        "Absolutely love this Bundt pan. It has a bit of weight to it and is very sturdy. I spray it lightly with a baking spray and my cakes always come out nice and clean. I love the large size of it which is perfect for some of my bigger Bundt cake recipes. It's also very easy to clean.",
        "Thought I didn't need another bundt pan, au contraire . The handles make inversion so much easier & the interior is like no other Nordic ware bundt I have. I made a hummingbird cake in it the day it arrived and it came out perfectly. The pan is very easy to clean.",
        "What a difference this pan makes with my baking proves. It bakes evenly and faster. It is the best pan that I have for baking. Can't do without it! My takes look prettier when I bake in this pan. It is a lifesaver as far as I am concern. I think the weight of the pan makes the difference.",
        "I was looking for a new Bundt pan, my old one was cheap and the coating was starting to chip. When looking for a Bundt pan be aware of a couple things. 1 They come in two sizes 6 cup and 12 2 The coating makes a huge difference getting a good release and can help with clean up as well. 3 Pans that are cast iron tend to bake more even. $24 isn't cheap for a pan, but you won't regret it. This is built well and you will never need to replace it. It bakes very even and if you use a little bit of cooking spray will never get stuck.",
        "This is a great pan. It has a pretty big capacity and the nonstick coating is terrific, everything slides right out. It's a thick aluminum pan so everything cooks evenly. The little handles make it easy to take in and out of the oven, even using potholders.",
        "Awesome bundt pan little pricey but the best one I've ever had",
        "Very sturdy, excellent quality. I used it for that recipe where you cover the post in the middle with foil and then put veggies in the bottom and the whole chicken standing up on the post. The chicken turned out so moist, I was afraid I hadn't cooked it long enough! I am going to make a sponge cake for it later and give that a try.",
        "This is a wonderful pan. No need to worry about your cakes running over in the oven. I noticed that it takes longer to cool your cake as it is heavier construction compared to run of the mill burnt pans. Every baker should have this pan.",
        "You cannot beat the quality of Nordic Ware bake ware! I have made many a cake in this bundt pan and as long as you are using a baking spray with flour your cakes will come out very easily. I would highly recommend this pan.",
        "If you grease & flour or spray correctly, the cakes all release easily. Considering to purchase a couple more, like them that much. Also they are very well made & should last a lifetime.",
        "This was a pricey pan but I have had several lesser expensive ones, ALL of which I threw out! This pan does exactly what is promised....It bakes beautifully even, and the cake pops right out as easy as pie! Just followed the buttering and flouring instructions with the pan...it's such good quality it will last many years and I'll pass it on to my next generation of bakers!!!",
        "We bought the mini-bundt muffin pans for this same brand and loved the way they cook and clean up. Made of wonderful material. It always makes for perfect dish. I am so very happy I found the same in the regular size bundt pan. LOVE IT! Considering buying for Christmas gift for cooking girlfriends.",
        "Great bundt tin with thick walls and easy to use handles. Very easy to remove the cake from! Product has a bit more weight then some other pans I've had, but I think that has to do with the quality of it.",
        "Love this bundt pan. Perfect release every time. Sturdy weight, cake always looks beautiful. Roomy holds more batter than regular size bundt pans, you don’t have to worry about overflowing batter during baking.",
        "Love the sturdiness of this pan, well made. However, it made the outside of my cake too brown. I went back to my old Bundt cake pan with a white inside.",
        "The shapes are so defined! Our old bundt pan must have been inherited from one of our great-grandparents it was so worn. It produced a round cake with no discernible features. This sturdy pan with awesome handles is so nice. We love it so much! Thank you!",
        "this was a gift for my wife who finally retired an old sheet metal aluminum bunt pan. The results were spectacular, she says the cake almost literately popped out of the pan compared to the older pan, no effort needed to remove the cake. The crust perfectly intact. They are well worth the price if you have a favorite cake recipe that requires a bunt pan.",
        "Bakes a better cake! Deep sculpting makes the finished cake better defined in shape. Deeper pan makes it easy to fill properly. The coatings and materials make it distribute heat for even cooking. It just bakes a better cake!",
        "This is, of course, a great pan. It is, after all, Nordic Ware. It produced a perfect bundt cake and came with a great recipe. I purchased the gold colored version, and the gold scratches off easily. This is not a problem with the standard silver version, so though the gold is beautiful, the silver may be the better choice.",
        "I ordered this bundt pan after reading others reviews. I was making a chocolate flan for Superbowl Sunday that required a LARGE bundt pan that would hold 15 cups. This pan worked remarkably well, held all the cake it should and when it was time to turn it onto a plate, it came out beautifully. I had 3 other bundt pans tossed two and kept one smaller bundt pan and this Nordic Ware Platinum Collection pan.",
        "BUY THIS!!! I had some legacy recipes for bundt cakes and this works great without my having to reduce the recipe or pour off excess batter. I am so happy I bought this as the quality is like the old school nordic ware.",
        "After reading the posted reviews I decided to bite the bullet and make this purchase and boy am I glad I did. I usually use my bundt pan plus 3 mini tubes for my cake but with this pan all of the batter fit except enough for one of the mini pans.The cake baked beautifully and turned out of the pan perfectly. No regrets about this purchase.",
        "I needed a larger volume Bundt pan and this one met my needs. It’s a good quality pan that cleans up easily.",
        "I purchased this in 2013 and have used it quite a bit. It is a great heavy duty 15 cup bundt pan. I had a new pound cake recipe that ran over my standard 10 cup bundt cake pan and all over my oven! That frustrating experience prompted this purchase, I wasn't aware that they made a larger bundt pan. This pan is very well made and I would recommend it to anyone!!!",
        "Nice pan, good size for pound cake recipes I’ve been trying. Used twice, baked evenly and turned out easily both times.",
        "I needed a new bundt pan and after comparing many, I decided to go for the Nordic Ware Original Platinum Collection Bundt Pan. Why 5 stars? It is heavy cast aluminum so it bakes evenly and produces a nice crust. I made my favorite Apricot Brandy Pound Cake in it and it has never looked or tasted so good. It was moist and tender. This pan has a lovely, golden nonstick interior that is smooth, even silky. The inner sculpting is sharp and gives the finished cake very clean lines. And clean-up's a breeze! I'm very pleased with this bundt pan and readily recommend it to others.",
        "I have a cheap quality, thin aluminum bundt pan and every time I tried to bake in it, it burned... This pan is the absolute end all for traditional shaped bundt cakes. The cake cooked evenly and all the way through, no rotation required, and I can not recommend this pan highly enough. No more burnt bundts. Coat the pan gently with butter; sprinkle evenly with flour; when done, leave the cake and pan to cool(approx. twenty minutes) and the cake will fall out without any hesitation. Also, this is the BEST deal I have come across. Hope you have as many pleasant experiences as I have with Nordic Ware pans. Enjoy!",
        "Excellent bundt pan follow the directions and the cake won’t stick. Came out perfect and the size is excellent! I would recommend it to anyone......the quality is very good. I will be ordering another one.",
        "Purchased for Pound Cakes. Noticed a bit of sticking around the center area. Next time will pay special attention to that area when lubricationg pan.",
        "A very high quality pan. My favorite bundt recipe sticks like mad, but not in this pan. Even cooking. Easy to clean.",
        "By far..The Best cake pan ever used!!! This family has cake pans locked, stocked, and on the top. Beautiful cakes that slide right out. This pan will make you throw all your other ones away!! Well, except for your grandma’s that you inherited!! Wish I had bought this 20 years ago!!!",
        "AMAZING PAN!!!! I use it to make my chocoflan cake. I am able to put an entire cake mix in it with all the flan! This is great because my previous pan I had to dump some of the flan out :( AND there is still room in the top."
    ]
}