{
    "entity": "Waffle Irons",
    "text": [
        "Made great waffles quickly. I had been worried because of other reviews which showed ripped waffles sticking to the plates. I think I know why: the indicator light (which is supposed to turn green when your waffle is ready) is in accurate. Your waffle will stick if the surface is not cooked enough and the indicator light consistently says your waffle is ready too early. The trick is to very gently try to open the waffle iron for a few seconds. If you meet resistance, your waffle is not ready and will rip if you force it open. If the waffle iron opens with a second or two of gentle force, you're good to go.",
        "That sound you hear is the Angel choir when I finally sat down to golden crisp waffles. I had been craving them for months - not the thick Belgium ones, but the old-fashioned, round, thin crispy ones. Easy to use, makes delicious waffles. I used a setting between 3-4, and they came out perfect. Later, I made corn waffles with a box of Jiffy mix. I will never make cornbread any other way again. The corn muffin waffles were crisp on the outside and perfectly moist (the only time you can use that word) on the inside. I did use non-stick spray, and resprayed after about 3 uses. I am so looking forward to many more waffle-shaped goodies.",
        "STOP!,,,,,,,,, do not I repeat DO NOT buy this waffle maker, big mistake, this is not Cuisinart quality, Made In China, junk. The top dosent fit perfectly over the bottom half, hard to clean, batter, even a small amount pushes out the side, not a very good side lip so the batter just continues to come out, very poor workmanship on this product, shame on cuisinart this is a black eye for them. I tried to return it and it costs about as much as it’s worth to get a replacement. JUNK, spend more and get a better make, sorry cuisinart ,",
        "If you follow the instructions, it overflows and leaves batter everywhere. The side catch troughs are simply useless. Followed the seasoning instructions, but waffles always stick. Heat setting is a really lame slider. Every use has resulted in some sort of mess, and it's really hard to clean. I wouldn't give a quarter for it at a garage sale. Threw it in the garbage.",
        "I bought this for my boyfriend for X-Mas 2017 and we have been using it consistently since. You don’t get super huge Belgian-sized waffles with this iron, however. It’s more like medium-sized waffles that are bigger than frozen waffles. You can change how cooked you want your waffles and there’s a green light that goes on when your waffle is ready. My only complaint is that I wish it also made a noise when the waffle was done. But otherwise, solid, cheap waffle maker!",
        "I received this product in great condition. When I first used the waffle iron I smelled burning plastic. I fumigated the iron was new and maybe it was because it was the first use. Then I made waffles twice after that and it still smelled like burning plastic. The 4th time I made waffles, while the iron was heating up, I lifted the lid and the handle cane right off. Looking at the handle, it looks like the smell of burning plastic was probably the handle. It looked like the screw holes were starting to melt which cause the handle to come off. Definitely returning the product and requesting a refund.",
        "Very disappointed in this product. We had the same make and model for many years and it cranked out golden, evenly cooked waffles with no problems until it finally died of old age. Since we had such a good experience with this model we decided to order another. After we made a couple of batches of waffles it became evident that Cuisinart has \"redesigned\" the product and put in much thinner waffle plates. These new improved plates do not conduct the heat evenly even after allowing it to pre-heat for 20 minutes and you get a brown ring in the middle of the waffle with under cooked edges. Not appetizing at all. We returned for a refund.",
        "Twenty years ago I gave away my last waffle maker. I was never happy with the waffles. They cooked fine but I just didn’t know, back then, that pancake mix is not waffle mix. my kids grew up with junk waffles 😟) Perfect, from the very first waffle that came out! And since I used an actual waffle batter, they tasted so good. (I collected four recipes to try, from Alton’s to the least complicated. Of course, I started with the least complicated and it’s a good recipe so that’s the one I’ll keep.) Just right crunchy on the outside, soft inside. This waffle maker isn’t going anywhere. It will be used often, even if only for grandpa and me!",
        "Why is it so tough to find a NON-Belgian waffle maker these days? This one is very well made and works just fine. I like the green light (not just the lack of a red light) that's a positive indication that it's time to pull the waffle. I LOVE the plug slots that keep the cord neatly wrapped...and keep the lid closed for storage - it's a tiny but really user-friendly feature. One small gripe is that this 7-1/2\" iron only makes 6-1/2\" waffles; the cooking area is reduced size. That's OK for one or fewer kids, but with a larger family, I can't keep up with the demand the way I could with my old 60's-vintage 8\" waffle iron.",
        "We bought this waffle maker about 7 months ago. We use it 1-2 times per week. It has never burned a waffle. They come out crispy on the outside and soft on the inside. It’s perfect! We did do as another reviewer wrote and cured the waffle maker on the first waffle. We added extra oil to the waffle mix and then cooked it much longer than needed. Since then, we don’t even spray or grease it at all.",
        "I purchased the waffle iron in June, 2016. I was very happy with it for a while. The last two months the waffles have been sticking to the top and bottom. I use oil with my waffle iron and spray before each use. I am switching to another waffle iron. Very disappointed since I thought Cuisinart was a reliable brand.",
        "This is a nice littlw waffle iron that does a nice job. However, the steam shoots out right under the handle causeing it to get very hot and wet. Using your fingers to open it with out a pot holder is a littl e risky.",
        "Purchased this to replace my Cuisinart I had for almost 20 years. Flimsy, not made at all like previous Cuisinart products. Came scratched and the black plastic part looked like it was gouged at the factory. Disappointment.",
        "I really like this inexpensive little classic waffle iron. It is NOT a Belgian waffle iron. It may be the only iron currently on the market that isn’t. It is easy to store on its side like a book. It works well. I know this because it is my second iron. I have a great recipe and I love waffles. I decided that if I had 2 both my husband and I could eat breakfast together instead of relays. It tells you when it is hot enough and again when the waffle is done. It is not difficult to clean up either. Heartily recommended.",
        "I will say this arrived in a timely manner. The first one I received had a really jiggly hinge so I called Cuisinart. They didn't say that this was normal, but they didn't say it wasn't either. They just had me call Amazon because that is where I ordered it. Amazon replaced it immediately which was great. However, when the second one arrived it had the same issue. I decided to keep it because I really needed it for an event. It works fine, it just feels like it's about to break.",
        "After only a few uses the handle is wiggling. Based on this I do not expect the product will hold up long. Very surprised as cuisinart usually has great products. Maybe I got a lemon.",
        "This waffle iron was VERY flimsy and came to me broken. The hinge on the waffle maker was very loose. The top of the unit was moving back and forth. It came with broken pieces in the bag it came in. Again, I do not know how Amazon and Consumer's Report gave this product good reviews. I do not know who manufactured this. Is there no pride in quality?",
        "I have had 5 waffle irons over a period of 30 plus years. Hated each of them for one reason or another. I was looking for a waffle iron with a small footprint, simple, easy to use and clean, and that turned out great waffles time after time.I found all of that in this Cuisinart Waffle Maker! Also got a good recipe for waffles (with a few additions) from the enclosed booklet. Clean up is a breeze! I love coconut waffles, and nothing sticks! Perfect waffle iron for me! And the price is right!",
        "I hemmed and hawed over selecting a waffle maker (I've lived without for many years) and poured over reviews. Almost went with a very expensive model but then decided to give this one a try. So glad I did. I followed another users suggestion of making the very first waffle a \"throwaway waffle\" by letting it overcook at the highest setting. Every waffle has come out perfectly. I make vegan waffles and these are especially tricky sometimes so I am so happy to have a maker that works!!",
        "Like most small waffle makers, it takes some experimentation to figure out how much better to pour (it will overflow messily if you pour too much) and which temperature setting works best for your recipe and preferences (I currently have it one step below highest). And it does help to periodically hit the grids with some cooking spray to keep waffles from sticking. The maker says they've weighted the lid to help expanding batter fliw into all areas of the grid. I say more weight would help. It makes waffles, and it's cheap. Certainly worth what I paid for it, but paying more will indeed get you a more sophisticated machine.",
        "I've made waffles, muffins, blueberry and cornmeal, and hash-browns in this wonderful waffle maker in the 1 1/2 days I've had this product. All came out perfect! I added shredded cheese to the cornmeal muffins and still they didn't stick. If you read and follow instructions it's great. If you don't - well that's on you. I love it and would recommend it to everyone who wants to make things without heating up the whole kitchen. And without a sink full of dirty pans to wash. Next I'm going to try biscuits in a tube and then on to tater tots. Lots of ideas and recipes to play with.",
        "It says in the packaging that the non-stick coating on the iron may give off an unpleasant smell when first used. Well, I've been using it off and on for over a month and it still makes that smell. It is unpleasant and the worst thing is it affects the flavor of the waffles. Yeah, it cooks them all right but I'm not happy with the outgassing from the non-stick coating. I would not buy this product again.",
        "The manual had a recipe for cornbread waffles. Sounded interesting so decided to make that our first \"cook.\" Followed directions and used a setting of \"3.\" No oil, just plopped the mixture (1/2 cup) on the griddle and waited to see what would happen. Absolutely no sticking and a more-than-acceptable result. I would prefer the waffles to be slightly more brown and crispy, but I will change the setting to 3.5 next time--that should do it. Very, very happy with this purchase. And what an improvement over our old iron!",
        "Do NOT purchase this waffle maker! Purchased in March. It is now June. Lasted less than 3 months. Look at the photos. The plastic hinge tab on the upper lid broke - so the upper and lower lids no longer come together appropriately. More disturbing - it looks like the ground post broke off and the screw holding it in came out. The unit crackles and sparks now. For the 5 or 6 times we used it, it made waffles just fine. Now though it is just a broken, waffle sized fire hazard. Complete waste of money.",
        "I actually like this cuisinart waffle maker. I don’t love it but it does its job. This is great for making one waffle. But if you are wanting to make more than one at a time, this ain’t it. This great for an individual but not for a huge family. This is great for its price as well & easy to clean. It is also space savvy. Even w/ its minor set backs of not having removable plates, it is a great buy. overall, I would give this product 5🌟 outta 5🌟! Great for individuals but not great for a family",
        "It is incredibly hard to find a round waffle maker that has \"shallow\" pockets (vs the more standard Belgium round waffle makers). This was the only one we could find and luckily it's also a good waffle maker. The non-stick works very well without spray even now after a couple months of weekly use. The quality of construction is good. The temperature control (1-5) is a bit \"wiggly\" such that 2 could really be 1-3, but will still get you in the ballpark of desired doneness. The main downside of this item is the cost compared to other comparable items, but it was worth it to get our family favorite round standard/classic depth waffles.",
        "My wife wanted a traditional waffle maker and the pickin’s are slim. They are either $10 or $80 with few in between. All get about the same reviews so I chose this one. The only fault I really see is the temp selector. It feels loose and unattached and I basically have to guess. My girl likes well done waffles so it’s pretty much perfect, ya know? I’m much happier w this priced model doing it than if I’d bought an $80 one and it did the same thing, which kinda seemed the theme in comments. Overall, it’s worked just fine.",
        "The bright side? Does a nice job cooking waffles fast and crisp. Down side: Temp control arm feels very very cheap and you kinda have to play with it to get it to the setting that you will remember. Upon first use the temp. selector knob popped off and flew across the room. I reinstalled and it popped off again. Instead of going thru the hassle of returning and all that I took it apart and glued the knob on. Dissappointed overall but you get what you pay for. It's a cheap one but it does cook nicely.",
        "I bought this waffle iron exactly 30 days ago. I would not say I went on a waffle palooza but after what I have to assume are normal waffle binges for a single person I am sad to say that the handle on the top has already detached. It's attached with screws that originate inside the upper plate so it is not possible to simply reattach. Without the handle it's not usable unless you happen to have asbestos gloves are are willing to use up all of your wooden skewers to insert into the screw holes and rescue your waffle before it burns.",
        "We used to have a larger Cuisinart classic waffle maker, that made 4 square waffles. The depth of the waffle grid was just right, this one is terrible. The thickness of the indentations is just not right and we've never cared for the waffles from this iron. It just went in the trash today after several years of occasional use, the waffles always seem to come out hard -- not crispy on the outside and light and fluffy on the inside like they do on our other Belgian waffle maker.",
        "After 20 years of flawless service from our old waffle iron, I had the brilliant idea to try to make waffles with some coconut flour added to the usual mix. Big mistake! Ruined the old iron so we bought this one as a replacement. Works great as one would expect and the readiness light is a really nice feature! The only thing that may make a difference to some users is the grilling plate cannot be flipped. Our old iron had a waffle face plus a flat face for grilling. This one is waffle only.",
        "I replaced my 25 year old waffle maker only because it couldn’t be cleaned after so many years. This unit was okay but after 10 months the top portion blew out sparks and all. I believe the two wires on top should NOT have been crossed. I will let Cuisinart view this picture Note: Cuisinart offered to replace but I already threw The burnt up unit away.",
        "People dont by this seriously its a piece of crap . So many reviews stated the hinge was kind of \"loose.\" They also wrote how sloppy the temperature control knob was. Surely the one I ordered couldn't be that bad right? \"Loose?\" Mine arrived without a hinge pin on one side! And the side that did have a hinge pin in place has got to be near the breaking point. The temperature slide control? I have three other older (over 5 years) Cuisinart small appliances -- either this is some type of knock off or their quality has taken a nose dive. I hope for the former.",
        "I have been looking for a simple waffle maker that is easy to clean if I try a recipe that makes a mess instead of a waffle. But I sure missed something in the description when I ordered this! You can't remove the plates (that the batter goes on) to clean them... who would make that?!?! I was very surprised when I opened the box and discovered that problem. Being as inexpensive as the item was - no way would I return it and pay postage. So I guess the 2nd hand store will have it now, and I will have to try again to find a decent simple waffle maker :/",
        "Straight out of the box and the green \"ready\" light does not work. But, thankfully, it did cook the waffle. More junk from China, and hardly worth a trip to UPS to return, especially in this time of the plague. Hopefully, it will continue to work without the green light. I'm hoping there is no underlying electrical problem.",
        "I like this waffle maker a lot and have gotten a lot of use out of it. I mainly make waffles but I've also made grilled cheese on it too. I wish that it was easier to clean. It would be great if I could detach the cord or something so I could give it a more thorough cleaning. Wiping it clean doesn't really cut it when I spray it with pam and it gets all oily. But it does make perfect waffles super quickly!",
        "I've owned several different types of waffle makers over the years, and this one is by far my favorite. The temperature settings and indicator lights make it so much easier and accurate to use. I can have a waffle cook to my preferred doneness by setting it on 4 each time. It's easy to clean and small in size, so easy to store away.",
        "I gave it a 4/5 on easy to use ONLY because I wish it had a small bell or noise to alert the user when the waffle was done cooking. Instead you have to watch the little red light tutn green which is difficult at times especially when busy/cooking other items as well. However, I'm very pleased with this product and it's quality. Ridiculously easy to clean! Even when you get creative and make chocolate chip waffles, everything swipes right off with a damp washcloth. I would recommend this waffle maker for anybody. It's really pretty nice for only having 1 waffle made at a time! I use it at least 2x a week.",
        "This is our favorite waffle maker. We repurchased this one after our old one, same model, quit working on us after 10+ years of heavy use. We make waffles at least once a week, so this appliance is a well loved small kitchen appliance in our house. I have been lured into trying flashy waffle makers that flip around and do exciting things, but always come back to this one because it just makes a good, crisp waffle... I can stand a soggy waffle! It’s simple to use and never sticks. I highly recommend!",
        "So disappointed in this waffle maker. I like brown crispy waffles & even on the highest setting, waffles were soft & flimsy. And talk about flimsy, the top wobbles like it’s defected. Going back to my old one I’ve had for many years because it’s much better. I thought upgrading to a new one would be better. I was so wrong, what a waste of money.",
        "It is not easy to clean without getting theelectrical components wet. It's not water proof. The iron often overflows with too mu h batter since there is NO LIP to the end of the iron. You can only make thin waffles which are delicious but no option to make thicker, fluffy waffles due to the size and thickness of the iron.",
        "For the price - this is great. I bought one of the trendy ones with several plates that change out and they smelled like chemicals every time in use and the non stick started peeling. This one has held up very well. I make waffles about 1 week and have been using it for months. I would love a real Belgium one - but who has the space. This is small and compact - perfect for price and size IMO.",
        "Love this waffle iron!!! I am very picky when it comes to my waffles. Enough so that my coworkers make fun of me for it I do not like Belgium waffles due to the deep holes. It's very hard to find a non Belgium waffle maker anymore. This one was a steal! The only complaint I have is that the joint of the lid is flimsey and I feel like it can fall apart at anytime. Not sure if I have a defective one but it is concerning. All and all I do love this product and I continue to use it on a constant basis.",
        "I love that this makes classic rather than Belgium waffles. I had a waffle-maker that I received as a gift back in the early 1990s that lasted until about 2018 with moderately frequent use. I do not expect this waffle-maker to have that kind of longevity. The timer is not accurate, and does not have an audible alert anyway. I set the timer on my phone for a minute and a half to two minutes and they come out perfect. As long as you time it independently it works great.",
        "This waffle iron stinks...and I mean stinks !! the smell it gives off is terrible and it lasts for hours in the house...we have only used 3 times and cannot get past the smell...You also have to turn the dial to 5 to get a brown waffle...for the money I would get something else, probably will return it",
        "At the ripe old age of 60 I have learned the difference between Belgian waffles and regular waffles.This Cuisinart round classic waffle maker makes the \"classic\" thinner regular size waffle. Other waffle makers make the \"Belgian\" waffles which are big, thick, cake like waffles. We prefer the classic old school waffles and this Cuisinart classic waffle maker fits the bill for us. It is simple to use with a heating light and a ready light to let you know when the waffle is done to perfection. The waffles never sticks to the plates and the waffle maker cleans up by simply wiping it off with a paper towel.",
        "This waffle iron is seriously goof-proof. It makes the perfect waffle every time, crispy outside and fluffy and steamed on the inside. Awesome non-stick surface doesn't even need any non-stick spray. The variable temperature dial makes a big difference. Super happy with this purchase.",
        "When my Cuisinart waffle maker died after 16 years of faithful service, I was overjoyed to see they were still making the same model. After reading a number of bad reviews indicating that the quality had declined, I was worried, but decided to go ahead and order it anyway. I am happy to report it is working just as beautifully as the old one did. Perfect waffles every time. It's true that the hinge is a little loose. The hinge on the old one was also a little loose, but it doesn't make any difference as far as i can see. I don't know if it will last sixteen years, but I'm very happy so far.",
        "We already had one of these waffle irons in our kitchen. Now we have two. We enjoyed it so much that we bought a second one. It’s nice to be able to cook two waffles at the same time. It’s very easy to use and heats up quickly. It makes delicious waffles. It’s easy to clean too. This waffle iron is every bit as nice as one I was given for high school graduation many years ago. It is durable. The price was reasonable. We are very pleased.",
        "This waffle maker works Beautifully! And the non-stick truly IS non-stick! I don't cook with added oils, so when someone gave me a recipe (if you could even call it that) for oil free \"FRIED\" potato waffles this is the waffle maker I purchased for the job. Given that \"I\" use no oil when cooking, which means no PAM or cooking spray is used when I prepare foods! So, I just took my potato, placed it in my waffle maker, closed the lid and 7 minutes later, a gorgeous, crunchy/crispy potato waffle with NO sticking of any kind!",
        "Went through 2 of these babies hoping for great regular waffles. They turned out great on the bottom but this is so poorly constructed the top does not heat enough and top of waffle comes out white (no matter how long you leave it in). With the first one I thought it was a quirk with that unit. But can't find many regular waffle irons. So gulible me ordered a 2nd one but it did the same thing. If you want good regular waffles don't purchase this unit it sucks. Model #WMR-CA",
        "Wanted a classic style waffle maker but it does not deliver. Leaves it cooked uneven and just doesn’t deliver the same quality. The waffle becomes soggy within seconds and usually one side sticks so you have two pieces. Our old one that was from my fiancé’s grandma just recently quit so we are familiar with the true classic style, this does not compare.",
        "I was a bit hesitant to buy this at first because I have had nightmares with other waffle makes (not from cuisinart). It was on a the pricey end but I'm glad I bought it when I saw it on sale. Now, it is my favorite small kitchen appliance. Easy to use and the non stick surface is easy to clean. It heats up fast and makes waffles within 2 minutes. The red/green light makes sure that the waffles were properly cooked and don't burn. The only thing I didn't like is the sliding button that adjusts the level of doneness. It is a bit flimsy but still works though.",
        "Best features: this waffle maker is fast! It cooks evenly on both sides and has an adjustable temperature control. Draw back: the waffle depth is not as deep as you would want it for true Belgium waffles. I did not truly appreciate my Cuisinart waffle maker until I received another waffle maker as a gift. We currently use both b/c we are a gluten & gluten free household. The other waffle maker (Presto flip side) is slow, cooks 1 side faster than the other and only has 1 heat setting (must be low). The Cuisinart is far better, for reasons already stated.",
        "Exactly what I was looking for! I don't care for the Belgium Waffles. This is much like the one we had as a kid. The green light comes on when it's pre-heated or when the waffle is done. I always leave the waffle in until the steam stops coming out. Waffles are always great! True, it may not be a heavy or the same quality as 10 - 15 yrs ago, but then again, what is? Have you driven a new truck compared to a 10 -15 year old one? Just not the same.",
        "After buying too many regular waffle makers I have finally found one that works great. The coating on the grills is solid and doesn't flake off like the Black & Decker models that are now the worst quality appliances I have ever bought. Didn't have any sticking issues as stated with other reviews. Just use a brush and apply vegetable oil to the surface and dispose of the VERY FIRST waffle. No issues what so ever with this waffle maker.",
        "I love waffles but I'm not a huge fan of Belgium waffles - they are too thick. This classic waffle maker has changed my life! It's portable, easy to use and easy to clean. Makes the perfect waffle every time. I keep the setting on 4 because I like my waffles to be a little brown but not too crunchy. Whenever we go to friends or family for breakfast/brunch, I make sure I bring this little gadget with me. I highly recommend it.",
        "I was impressed with the quality of this affordably priced appliance. It cooks quickly and evenly, and it really doesn't stick. The waffles produced are beautiful. They are nice and have the perfect texture, and they do not tear apart or stick to the appliance. In the past I rarely used waffle irons because I hated the amount of time it took to clean them. This appliance cleans easily. I've used it more in one month than I did past ones in a year. I'm very happy and satisfied with my purchase.",
        "These days it's nearly impossible to find a classic waffle maker while there's an abundance of Belgian waffle makers in store and online.I have NO complaints with this one! It's very self-explanatory and makes delicious golden waffles every time! You choose how light or dark you want your waffle by simply sliding the knob to the setting you desire! Heats up quickly! ** Double the recipe and freeze the extra waffles! Once cool place wax paper between each waffle, put in ziplock bag and freeze!! Dislikes: None!",
        "I had this waffle maker from years ago until it finally broke after 6 years of frequent use. The waffles are thinner, so they can get crispy as I like them, and they fit in my toaster. I make a big batch and freeze, then it's a quick breakfast in the morning. I had a Belgian waffle maker, but I never liked the quality of waffles that came from it, so I replaced it with this. I'm very happy with this waffle maker.",
        "But, it turned out otherwise to work very well, too. The design is simple and using it is as well. I needed something with smallest possible footprint and storage needs for my small studio. Truthfully, I can't really say about the material quality and durability, because I haven't had it long enough to really know. But, it's simply and straightforward and operates like a waffle iron should, so I gave it the stars.",
        "I like that the waffles are thin - that is how my kids prefer them. The item is easy to use and easy to clean. I have used it about 8 times and it works well. I can't speak to the durability of the item because we haven't had it that long, but it doesn't seem super high quality. I'll be happy if we get a couple of years out of it.",
        "Pros: awesome price, stainless exterior, excellent plates and browning, quick cook times. Cons: hinge does seem loose and fragile, it leans back unstable when fully opened, and flimsy control button snapped off on first use when cleaning it with a wet paper towel (!). Glued back on, but it's as if two separate companies designed and built it: an excellent one for the round part and a sloppy one for the actual controls and assembly. Still, anyone looking for an affordable non-Belgian wafflemaker has limited choices.",
        "Wife likes waffles; I'm neither for nor against...but she spotted this at a store and we checked pricing and it was cheaper by a good margin on Amazon. Arrived; tested, her basic complaint was that it didn't brown/crisp up the edges on them enough even on the highest setting. Solution was to take them from the waffle iron to the toaster and finish them off once cooked.",
        "Bought to replace 50 year old waffle maker. Cuisinart produces waffles with odor and flavor that my grandson will not eat (maybe that would go away in time but hasn’t happened after 3 batches). The color is uneven, not the nice golden of my old waffle maker. Also this round waffle maker with a round dollop of batter manages to produce a square waffle. Will be donating to Goodwill for someone else to try, as I ordered it at beginning of summer and didn’t try it out until school started and it was too late to return. Have gone back to my 50 year old waffle maker.",
        "While this waffle iron works very well, the top either needs a hinge in the back OR be slightly heavier. The batter tends to move forward and ooze out of the front. If there was a hinge in the rear, that would rise too and the distribution would be better with a more consistent outcome. Overall, really like the new waffle maker and the price was very low compared to others. Waffles were consistent and turned out fast.",
        "An excellent basic Waffle Maker. This exact Cuisinart Waffle Maker has been around a long time, why change it. This is my second purchase of this model. The first one lasted about 11 years before the Teflon coating went bad. I bought several Waffle Makers made by other companies, I didn't like them and gave them away to friends.",
        "I used a boxed pancake/waffle mix for the first trial with this classic waffle iron. Was really, really pleased that the waffles came out perfectly and were done in just a few minutes. Easy to clean up afterwards, too. I'm gifting my Belgian waffle maker/grill/panini maker to a friend -- won't need that anymore. Really do not like thick Belgian waffles at all!",
        "Perfect! I searched forever for a waffle iron that would 1. Cook quick 2. Make crispy, thin, light, waffles 3. durable 4. easy to store 5. ease of waffle removal It is all of these! I make homemade waffles every Sunday morning, we all look forward to this tradition! This iron makes it easy and delicious! We set in on level 4 and it also cooks them quick, with 6 people you still want to get to eat together, but also eat it right off of the iron- and this allows us to do it. For a while we had two, so we could keep up. We only need one now, and they are really crunchy!",
        "this product is ok if you don't use it a lot. The first time I pushed down on the handle to press what I was cooking, the handle screws stripped and pulled out from the lid. The screws are inside the top so there was no way to fix it. now the handle just flops up and down. There is too much play in the temperature control, so it's hard to know what it's set on.",
        "I already have this waffle maker and it’s a great basic classic waffle maker, so I bought it for my parents for Christmas. It has great non stick plates and I have found setting 3-4 to create a nice golden waffle. However, this one arrived used and dirty. It has crumbs, dried batter, and no interior packaging or instructions. I assume it was a mistake and the wrong one shipped to me. Fingers crossed my exchanged one is truly new and ready for gifting!",
        "The cooked ready indicator is helping, it turned green within 2 mins and the waffle was not even cooked. The browning control is unless too, there’s no difference between 3 or 5. I ended up have to keep trying to see how much time it takes to make a waffle. I guess it is not powerful enough to heat up a waffle and it takes about 15 mins with the browning setting at 5. It will take me an hour to make 4 for me and my partner! That is ridiculous. I would have flipped over 50 pancakes in an hour.",
        "The hinge broke on this after 6 months. We used it maybe 6 times. So dissapointed in the quality, I expect more from cuisinart. Go for a waffle maker that costs a bit more if you want one that lasts! We probably won’t be buying anymore cuisinart products after this.",
        "I bought this waffle maker to make keto waffles. Even with using just a 1/2 cup of mix it seems to always overflow. To make matters worse it overflows onto the temperature control making it difficult to clean. It never seems to cook the keto waffles all the way through to the center while burning on the outside. maybe it's okay with regular waffle recipes, I don't know.",
        "I love waffles but my wife doesn't really care to make them all that much - I found this waffle maker to suit me just fine - I buy Snoqualmie Falls pancake and waffle mix, add a bit of water and enjoy a satisfying breakfast - I've even used a mix for Swedish pancakes which come out fine - the waffles are light and, on the #3 setting, come out perfect - and.with Adams peanut butter and Costco maple service I can enjoy them two or more times each week",
        "The first four times I used this waffle iron, it was great! Great temperature control and easy to clean. I loved it. However, the fifth time I used it, the plastic handle broke off. Perhaps mine was defective and others won't have that problem, but if you do, be advised that the replacement policy is not great. There is a $10 shipping and processing fee plus you have to ship the power cord back at your expense using a traceable insured delivery service. It would cost more than half the price of the waffle iron in the first place to replace it. I also wish it beeped or something when it was done, in addition to the light turning green.",
        "Good purchase for the money. Wanted a round Waffle Iron; however, I would say to upgrade to more controls. For basic waffle iron it is OK. However, as the saying goes you get what you pay for. If I had viewed this waffle iron in person I would have picked one with more controls. And probably paid more. OH WELL.... Live & Learn.",
        "Pros * Easy to use * 1/2 cup of batter consistently produces a full waffle, without messy drips * Easy to clean * Quick cooking time * Good value for money Cons * Needs a lock, so it doesn't fall open when stored in standing/upright/vertical position * Push bar/front handle partially loosened from screws, when I pressed down too hard on it (while trying to make a pressed sandwich) This is a compact workhorse (we use it twice a weekend) that consistently turns out round, crispy waffles.",
        "We bought this waffle iron around 2004, and after many years of use, it started to not heat up quite right. We had a good run with it, and it made really crispy waffles, so we bought the exact one to replace it. What a decline in quality. The original is much more heavy and sturdy. The new one was also defective so we had to return. The waffles didn't cook all the way even on the highest heat setting, only producing blonde soggy waffles. The temperature dial appears to be broken. Very frustrating!",
        "I had a cuisinart classic waffle maker that lasted over 20 years and made perfect waffles until the day it died. So I naturally decided to buy the same waffle maker. Obviously they are not made the same today as they were 20 years ago. The materials are cheaper, the construction is cheaper and the heat distribution it horrible. Every waffle comes out looking like a bullseye. If I leave it in longer it just burns a ring around the center. I wish I would have kept my old one and had it repaired, the new one is very disappointing",
        "I bought this to replace a very very old waffle maker and the standard size is a little harder to find. Evidently everyone likes the Belgum waffles. This was just what I was looking for and works great. It has a temperature control which I like. I have been using it for some months now and it is really nice.",
        "Saw this recommended on a blog I follow ([...]) as a kitchen item she loves, or rather, her daughters love! Much easier to make waffles with this waffle maker than to make pancakes. It takes some trial and error to figure out how much batter you should pour onto the griddle but you'll figure it out. For me, I pour about 1/3c worth of waffle batter and that works great for me. I would say the only downfall of this waffle maker is that it doesn't have a little beeper to tell you when the waffle is done, the light just switches from red to green. Other than that, I love it!",
        "very disappointed!! Was so happy to buy this I bought Two! I love the classic thinner waffle. I’ve used it maybe six times, daughter used hers even less and now they are not holding a steady heat so the waffles are not cooking properly. Would if liked to just message seller but don’t see where. Very disappointed:(",
        "I use this every couple of weeks to make waffles for my daughter to eat before school. Used about 5 times to make about 15 waffles each time, works well! I followed directions, I sprayed it a little the first time I used it. For cleaning I just wipe it down with a washcloth gently. Makes great waffles, I typically set about 4-5 because we like them crispier, and use 1/2 of batter.",
        "I've owned like six waffle makers in my life, because I love waffles more than pancakes. A lot of them out there suck, to be quite honest. This one though, does not disappoint! It heats up quickly, cooks evenly across and top/bottom, and does a fantastic job. It's super easy to wipe down compared to other ones I've owned. Highly recommend this! You won't be disappointed!",
        "Great kitchen appliance at a great price! I love the fact that it doesn't take up much space in the cabinet--much less that the old spinning waffle maker that we used to have (which fell apart and was not worth the price). This handy little waffle maker makes crispy, yummy waffles really fast! Once it is preheated, you can make one about every two minutes...maybe less! It is easy to control the browning to your personal taste by using the sliding lever on the front. I love to make cornbread waffles and banana bread waffles using one of those inexpensive jiffy mixes--great quick snacks and sandwiches!!!",
        "Considering the price, this waffle iron really delivers! We have used it several times now, and haven't had any problems with sticking. We did spray it before the first use, as we weren't sure what to expect, but we haven't sprayed it since. I wouldn't hesitate at all to recommend this to a friend :)",
        "We have had this product for over 5 years. The lining started to come off so we decided to order a new one. The first time using it the knob that adjust the heat broke off. On top of that the light indicator never turns green even on a 1 setting until the waffle is burnt and inedible. I dont know what changes cuisinart made, but I am highly disappointed in the way their never version is made. Lacks quality!",
        "My kids have the Breville, which of course is the top of the line waffle maker. I want to make waffles, but don't want to use up that kind of room or spend that much money. This little guy pretty much does the job. The waffles really aren't quite as good, and the quality is spotty. But for the money... it does the job.",
        "I used this item 6 times. Now it won't turn on. I tried to return this defective item but found that the return window past by 6 days. It may have been a fluke but I can not recommend this product. It would be different if they allowed replacement for defective products.",
        "This waffle maker heats up quickly, has an adjustable range of doneness, and makes medium-sized waffles in a few minutes. It has a red/green light to signal doneness or that it's heated to proper temperature to add the batter. But they're not well placed to be visible so my nose is more a guide than the light. An audible tone would make this a 5-star waffle maker. It's difficult to find non-Belgian waffle makers and this one does an excellent job for the waffles our family loves.",
        "I ordered this waffle iron to replace a similar Cuisinart Waffle Iron that I had for years. When it arrived I immediately noticed the quality paled in comparison to my previous Iron. The top was not stable and when I went to increase the temperature the control broke off in my hand. The unit never completely heated sufficiently to completely cook the waffle and when attempting to remove the batter and try again, I was unable to remove the partially baked on remains from the \"NON-STICK\" coating. Once cooled, I put into a plastic grocery bag with the stuck batter, broken temp knob and instructions - tied it up and sent it back.",
        "After 2 years and 3 months with use of only 5 or6 times the top unit is not heating or of course not browning the batter. I need to have an appliance last longer than this. I'm also calling the support line number as I write this, we'll see what happens. Just spoke to customer service and will send a new unit in 7-10 days, needless to say I am greatly impressed with replacement policy, thank you!",
        "There are countless waffle makers out there with varying prices. I ordered this one as I didn't want to spend a lot of money on a appliance that may end up sitting in the back of a kitchen cabinet . So far, this has been used almost daily. For the price, this is an excellent waffle maker. It heats up quickly, cooks the waffle perfectly in just over a minute, and it's easy to wipe the grids with a paper towel. If you want a nice crisp waffle, you need to put the lever to almost 5. This is a small enough appliance to fit easily on your countertop. Very pleased with this product.",
        "We're casual waffle-makers and love whipping this little appliance out of the cupboard most Sundays. It's quick to heat up, easy to use, compact to store, and a dream to clean. It's also easy to adjust the crispy level mid-bake and the waffles come out great each time.",
        "Sunday morning breakfasts rock, thanks to this waffle maker! It’s easy to use and takes up very little counter space. My teenagers love it, so do their friends - saying this with THEY had one at their house. My fiancée also uses this to make panini sandwiches. Love it!",
        "This waffle maker is so easy to use and produces perfect classic waffles. Be sure to spray cooking surfaces with cooking spray before adding waffle batter and let the waffle cook for a short amount of time before removing waffle after the green light turns on. Do not overfill the surface but add enough batter to cover the lower side of the waffle iron. You will soon get the hang of exactly how much batter to use.",
        "I did NOT want Belgian waffle style. So I got this classic style VERY HAPPY!!! Not one waffle was burnt. The first couple kinda had a plastic taste just from it being new. The waffles were perfect!!! I only got to take a couple peices from some of them as we were making them. Before my dog knocked the plate over with them on it putting glass in them. But they tasted great and looked amazing so much so my dog had to have some. I would recommend this to anyone.",
        "The hinges on top are terrible, wabbles and looks like it will fall appart soon. works fine but made very poorly. Not Cuisinart quality,",
        "It has a terrible odor when heating up smells like toxic plastic giving off fumes that fill your house. Used twice so far and both times the smell is coming off of it. It is a classic waffle maker and I have always liked Cuisinart products but if you are concerned about toxic type odors this is probably not for you. I would not buy again."
    ]
}