{
    "entity": "Waffle Irons",
    "text": [
        "after 2-3 uses over 2 years, I tried again this year, but the plastic clasp broke off --very poor design to use plastic instead of usual metal so close to the heat. The pizzelles are very/too thick, so it's necessary to lock it down each time. I've been making pizzelles for over 45 years, but wanted to try a smaller size --big mistake to buy this!",
        "Only got the pizzell maker. The description stated that a spoon, canoli roller and recipe book was included. Well it wasn't there. Thus was bought as a gift and I just learned that t not everything was included. Very dissapointed",
        "I love it. I can make whatever flavor and have enough to share. The batter is easier than I thought to make and it is quickly done in the Chef's Choice 835 Pizzelle Pro Express. I would recommend it to everyone who loves Pizzelle Cookies.",
        "I love making these but it takes a lot of tries to figure out how much batter to put on plate. I found it better to use more than less and just trim the cookies with a sharp knife. But you have to do it while they're hot or they break. My lights that indicate when it is heating and ready are not working right but I use my judgement and it's okay. I have made these for company and added colored nonparelles to the batter. I also have tried different flavors. At the end of the day, it's fun and I'm glad I bought it.",
        "first 2 times I used it was ok. The non-stick worked well, but after that, I had to pry the lid to lift it up. The non-stick teflon came off. The green & red lights not very reliable, very disappointed. Will return item.",
        "If I worked as well as the pizzelle maker does, all would be well. I am still trying to get the amount of dough right. By the way, the recipe on Pinterest using brown sugar isn't a good idea. The cookies tasted good BUT they never crisped up. Floppy cookies...",
        "Even if you don't like specialized gadgets, this pizzelle maker is worth it, especially for the price. Small and compact, it is easy to store and comes with recipes that make delicious, nice-sized pizzelle (we made both the vanilla and the chocolate) with ease and no mess. (As with everything, I recommend doubling the vanilla.) We also rolled and filled them to make little cannoli which we took to a party, but they got slightly soft over the time they sat in the fridge. So make sure to fill them at the last minute. It does take a bit of time to bake them all, but you can eat little bits of cookie that you trim off while you're working.",
        "Like others said, it takes a little bit of trial and error to get the correct browning/crispness. But easy to use and pretty easy to clean. Recipe included in the box worked exactly as advertised. Delicious homemade cookies even if more trials needed to get sizing and doneness just right.",
        "Love this! I had always wanted to make pizelles for Christmas. It works fast! It is a little hard to get the dough centered and have the exact right amount so not to squish out the sides, but they don’t look bad at all with a bit of practice. I took kitchen scissors and easily trimmed the most lopsided ones while they were warm. Very crispy!",
        "Used this for my first attempted at pizzelle making. Works like a charm! As recommended I brushed on a thin coat of vegetable oil before starting, and the baked pizzelles slid right off their little plates with the help of a chopstick which also came in handy for separating them when I used a little too much batter. Found the 3 1/2 setting made them a little light for my taste so I cranked it up a bit and got perfectly browned pizzelles. Love that the little green light lets you know when they're done.",
        "This pizzella maker is not even, the pizzellas do not come out the same thickness and they do not cook evenly. I have the setting at 5 and they do not brown and cook completely. I would not recommend this to other shoppers. I have used it many times and always go back to my other pizzella maker.",
        "being Gluten free this pirelli maker is just what I needed. Once the routine of getting the timing down on length of cooking (the green light works well - not perfect - but enough to be helpful)- love it.",
        "All was going along well, until the lock latch broke. I guess the heat dried the plastic latch. I used it twice a year-Christmas & Easter for 2 years. I called the company for a new replacement lock latch, countless times. They never answered. The latch Is a poor design.",
        "My friends love the size of these mini-pizzelles! It took practice (about 3 times) to get the knack of how much batter to use and what bake setting to use. I used my own recipes and they came out just as expected!",
        "I am in love with this pizzelle maker. I've been using it at least once a week since I got it. It makes perfect pizzelles, and they don't stick at all.",
        "I got it as a gift to myself for Xmas. I love thin wafer-like cookies, but find any pizzelle recipies to be a bit dry to my taste. Also if you want to make rolls out of them and put a filling in, you have to be VERY quick and roll them right after you tke them off the griddle, otherwise they crumble easily. But rolling them while they are very hot is not fun, you will burn your fingrtips! The press works fine and I have no technical problems with it so far.",
        "iI used this for 2 months and it broke today. Can't recommend",
        "Absolutely GREAT! And the mini size made inter state transport easy using a cylindrical festive tin (3\" diameter) with little to no breakage 😉",
        "Handle broke almost 6 months after purchase. Useless now. I have had this pizzelle maker for almost 6 months and the handle that holds the lid down broke off. I had only used it about once a month. I loved the pizzelles and they came out great. Guess I should have gotten the extended warranty.",
        "I did learn that to follow the recipes included you will get a thick batter and the top will not close. Then you get thick, soft cookies. If you want thin, crispy ones, use a mixer!",
        "It’s small and very easy to use. Great little snack and makes a ton for school functions.",
        "I used this *almost* everyday in a professional setting for a year before it crapped out.",
        "I purchased this to make pizzelles for a friend of mine who loves them. I had never made them before. They turned out great and were easy to make. I even made varieties with different flavors, and all were great. I love the variable temp light It is a great machine. And, it makes 3, not 2 pizzelles.",
        "For a first time pizzelle baker, this iron was perfect! The cookies turn out thin and crispy, it's a nice easy clean - just wipe it with a cloth and go, and it has an easy to read dial for varying degrees of color. My only negative comment is the \"ready\" light isn't reliable.",
        "This was highly rated, so I took a chance. I have never made pizzelle's, but I felt like a pro using this Chef's Choice 835 Pizzelle Pro Express Bake! It is extremely well made and I know it will last for years to come. The recipes it comes with was a huge plus! The vanilla pizzelle's in the book are delicious! Everyone said they looked beautiful and tasted like something from an Italian bakery.",
        "I purchased a Chef's Choice 835 Pizzelle maker a year ago. It works great. I haven't had any problems with it. In fact, I liked it so much that I purchased a second one so I could make the pizzelle's faster! The whole setup and baking time for one maker is about an hour per batch. With two I can be done in less than 30 minutes!! This includes stirring up the batch of dough also. Love it! You will too!",
        "The pizzelle maker is the best one on the market, I am a Home Economist,catering etc...and found this one easy to use, cleans fast, recipes are great, anyone can make them... The control light goes on and off and the browning control by numbers is easy to use..I made vanilla, anise and chocolate ones, canoli's , and ice cream cones for the little kids....buy it and use it at your next party ....This item will be used as often as yuor mixer, blender or food processor or even more...don't hesitate, ot buy this one, the price is the best one I have found",
        "I love this! I've made three batches of these pizzelles since I purchased this, and they are my family's new favorite treat. So easy to make, and the Chef's Choice is a high quality appliance. Nothing feels flimsy, and the clean up is a breeze. It's exactly as advertised.",
        "THIS IS THE SECOND OF THESE BAKERS WE HAVE HAD. THE FIRST LASTED ABOUT 10 YEARS BEFORE THE HEATING ELEMENT FAILED. MAKES THREE SMALLER THAN GRANDMA'S PIZZELLES AT A TIME. THESE COOKIES ARE A FAVORITE WITH FAMILY AND FRIENDS. YOU CAN MAKE THEM WAY CHEAPER THAN YOU CAN BUY THEM AND THE RECIPE THAT COMES IN THE BOX IS PRETTY MUCH LIKE THE ONE MY GRANDMOTHER AND AUNTS AND MOTHER-IN-LAW USED. YOU'LL LIKE THE BAKER AND THE COOKIES.",
        "I love the hide away size and the ease of use. Also like the three griddle size!",
        "These pizelles are smaller than the regular pizelle maker. They were perfect for cookie trays and ice cream sandwiches.",
        "I love giving pizzelles away for gifts and this size is perfect for giving away. I've had the cooker that makes the larger pizzelles, for years but the smaller ones are ideal for fitting in cookie gift containers. My friends think I'm a genius cook when they receive them! I love my new machine. Also tried the cannolis with it.",
        "The Chef's Choice Pizzelle Pro Express Bake is fast, and very easy to use and clean. The measuring spoon and ready light take the guess work out of making perfect three cookies at a time. The thickness of each cookie is consistent, because of the fastener clip. I have used two other manufacturer pizzelle grills and found the Chef's Choice is far superior and reasonably priced.",
        "I have made 6 batches of pizzelles....the locking arm broke. It is a bad design. It is too easy to birn yourself and for it to have broken already is just a huge disappointment.",
        "Great price, excellent quality, making wonderful Christmas cookies in half the time in several flavors. Lemon, Almond and plain Vanilla are the favorites so far. Today we try Chocolate, and It involves a machine and flashing lights, so my husband is enjoying helping me - that's a first.",
        "My husband got to reminiscing about the anise flavored pizzelles he used to eat in PA so I started researching pizzelle makers. The [[ASIN:B00005CDPZ Chef's Choice 835 Pizzelle Pro Express Bake] fit the bill. As we try to watch the calories, the petite size of these pizzlles help control that.Have had fun introducing the pizzelles and cannolli to our new Indiana friends.",
        "The machine is great, but it came missing the cannoli pin and spoon.",
        "how easy it was to find it on your site",
        "I purchased the Chef's Choice 835 Pizzelle Pro Express Bake to make pizzelle's for my niece's wedding. I have a two-cookie pizzelle maker but the 835 has 3 smaller molds which was a perfect size for wedding cookies. The recipe included with the maker worked out just fine. It calls for 2 tsp vanilla, but I used 6 tsp anise instead. Very good. The picture looks like the maker has a white top, but it's actually silver metal (stainless steel?), which is very nice. The top does get very hot, though, which is why I gave four stars instead of five.",
        "Fun and easy to use. My package included a cannoli rolling form and spoon which were \"hidden\" in the sytrofoam bracing material -- overlooked at first.",
        "I absolutely love it!!! Need to experiment with the flavorings for a stronger taste. But it was everything I read about!!",
        "Before this one, I had this model and it was just what I was looking for. It is fantastic and the pizzelles come out great I used #5 as my setting and they come out perfect.",
        "I love it. It only took a short time to figure out the proper consistency of the batter to make the perfect pizzelle. I would highly recommend this model for anyone interested in making these wonderful Italian cookies.",
        "The only unsatisfactory thing I found about the baker is the controls don't work properly. The ready light would come on as soon as the cover was locked down, so it was kind of hit and miss to make the cookies. At first some came out too brown and others were not brown enough. Once I got the timing right, I ended up with delicious cookies.",
        "I've suddenly become obsessed with pizzelles! I wanted an inexpensive pizzelle maker to have around. This fits the bill. It works really well. Sometimes it seems as if the bake/ready lights don't work right all the time, but it's pretty easy to tell when they're done anyway!",
        "Love this , it's a memory making machine in our house. It works great",
        "As far as the size, it is great for your cookie trays. I like the smaller size. As far as the machine itself , I made six batches of pizzelles and the plastic latch broke. My husband is going to try and make one out of metal. My other pizzelle machine that I had was a rival and it was constructed a lot better. I would never buy another machine with a plastic latch.",
        "This little baby works great! We stirred up a batch of uncle John's famous pizzelle batter, and they cooked up beautifully! It makes a really nice size, clean up was super easy, and it feels like really good quality. I would highly recommend this product!",
        "The pizzelles are smaller, but I can get so many more made in the same amount of time with this maker! Love it!",
        "Love my new pizzelle maker. Have wanted one for many years. Have come up with all kinds of cookies and hors d' oeuvres to make with it. Very nice product.",
        "My husband got me this last year so I could make my grandmother's pizzelle recipe and this worked beautifully. I made them again this year and they were gone in less than a week. I love this machine",
        "Really like it. Fast heat up and recovery. Consistent results. Very happy with it, three at a time is great also, can really get a massive amount made fast. Great for making pizzelle canoli shells too.",
        "I cannot make enough of these. The recipes is great that is in the instructions. they take a minute to make. you can buy extracts to give them different flavors. it was a great buy and easy to store. not big or bulky.",
        "really like this machine works well. was packaged well and came when it was supposed to. Like that it sits on its side to store, fits into a small space. a lot easier than doing it on the stove one at a time.",
        "I love my new Pizzelle Pro Express Baker ! The cookies were so easy to make and turned out great from the very first batch. I especially like the fact that this baker makes 3 small cookies; most of the other bakers make 2 large cookies at a time. I prefer smaller cookies that fit easily on a plate with other cookies, yet these are not miniature. They're just right. I bought this on a recommendation of a friend (and good reviews here) and would not hesitate to recommend it myself.",
        "Very easy to use. No cleaning needed afterwards. I used Krusteaz waffle mix. Pizelles came out perfect!",
        "I love this little pizelle maker. Each fill makes 3 (3 1/2\") pizelles. While in Florida, I was able to make christmas gift pizelles for my friends in my RV without turning on the oven! Love the non stick coating, unlike my old pizelle maker which made 5\" cookies which I had to grease each fill - they always stuck! No problem now!",
        "This is a great little addition to my kitchen \"toys\". We made what seemed like a million little disks upon its arrival and enjoyed them for several days(the extras froze well). The machine worked according to directions and was easy to clean and store after use. I'm pleased with the product and the price was reasonable. pv",
        "I made a ton of pizzelles this past Christmas. This is easy to make, but you must constantly be standing by during the process. The vanilla recipe is yummy. These also would be good with ice cream.",
        "Still working after years of use, not even often only for holiday and special occasions but absolutely love this. Cooks very well and evenly",
        "From the first time I used it, it was great.",
        "This product is not so good, not as good as I think.",
        "When I made my first batch of pizzelles, it worked great. Every one turned out exactly the way they should even the first one. So far so good.",
        "Great pizzelle maker. Cooks much faster than our old one, makes small pizzelles that are very light and crunchy. Would definitely recommend this item.",
        "Bought as a gift. Well made with good instructions on how to use, how clean, etc. this is a specialty cooking item so best be buying it for intended purposes. Delivered on time and as promised",
        "This is a fun gadget to have. I love having exciting things to make in my kitchen, so this was great for me. It was a little hard to figure out how much batter to put in to get the pizzelles right, but after a couple batches we were fine.",
        "I went back to making Pizzelles with this cutie. No more sticking cookies.",
        "I love how easy it is to use ! They tasted amazing comes with a bunch of recipes",
        "pizzells are a hit at a party. You can eat them dry or spread any kind of creamy stuff on them",
        "I really like this pizzelle maker. I like the small size pizzelles as they are easier to handle when sprinkled with powdered sugar. The iron works so much better than my old one. Nothing sticks and clean up is very easy.",
        "Great Pizzelle maker!! I have had this for about a month and have made 12 dozen Pizzelles! Once you conquer the amount of product to put on the griddle, it makes near perfect cookies.",
        "Cookies were easy to remove, however, I personally did not like the tiny size of them. Mine were also too soft - you really need to play around with the cooking time.",
        "This is a great little pizzelle maker, making three small 3\" pizzelle's at a time. Come's with a wooden rolling form and a plastic batter spoon (no need to guess how much batter to use for each pizzelle).",
        "Used my pizzelle maker for the first time today. It's a fun little gadget! Works just as described and easy to clean up. Can't wait to make these to include in my Christmas cookie gift packages this year!",
        "This is a lot easier to,use than if thought it would be. Takes a little adjusting for amount of batter for each pizzelle but once that is accomplished it's a breeze to use and quick cooking. Clean up is simple - quick wipe with a paper towel. Makes a lot but recipe can be cut in half. Great bargain!",
        "I LOVE baking and eating Pizzelles, and I love giving them for gifts. This baker is just what I need to accomplish that.",
        "I haven't actually used this item yet, but it looks like a nice Pizzelle machine. One of the reasons I haven't used it is because the item was received without any instructions booklet or recipes as indicated in the description. Any idea how I can get these items so I can figure out how to use this machine???",
        "I bought this for the missus after she mentioned that she wanted to make pizzelles. The day it arrived, my kitchen was full of 400 cookies. Each of them delicious. This iron makes 3 cookies at a time, and is super simple to use.",
        "I guess I didn't realize there were 3 little ones instead of 1 regular size one. Have tried several times and just made a mess. Not impressed with maker but I should researched more.",
        "Made a huge batch of Christmas neighbor gifts with this yesterday. Was very easy to use. This machine is a winner!",
        "More recipes would be helpful. Each one I used they still didn't crisp enough. It cold be user error. We really liked the small size. They are super cute!",
        "HAVE HAD IT FOR SEVERAL YEARS. WORKS LIKE NEW. EASY TO USE AND CLEAN. DON'T KNOW WHAT I WOULD DO WITH OUT IT. ALWAYS USED THE IRON OVER THE GAS BURNER THAT TOOK TOO MUCH TIME TO MAKE THE COOKIES. NOW I AM FINISHED WITH FOURTEEN DOZEN FROM START TO FINISH IN TWO HOURS.",
        "I chose this rating because the Pizzelle Maker was in great condition, everything was there and I was very excited to receive it! I will be using it soon, and I hope my Pizzelles come out as good as the pictures look. They look delicious! Thank You............ A Happy Customer!!",
        "Makes the smaller pizzelles so you the so much more and saves some time making them. The clean up is a cinch",
        "Christmas gift for my wife. She loves it. Pizzelle party scheduled this weekend with Grandchildren. Sure to be fun & entertaining.",
        "works good for me ,i am using it almost every saturday to make different pizzelles and own cookies, makes three at one time it saves lots of time.",
        "Now I make my own. There smaller than most pizzelle's but still great. SImple when you match the heat setting to the brown ness of the pizzelle. Then just watch the light go from Red to Green and there you are! Then if they are great you take credit for them. If there bad, your mix probably didn't have enough something!",
        "Got my Pizzelle maker just before Christmas. Made the most delicious cookies. I love it. They are small and can be rolled into little cannolli shells. Will keep the machine out all year and when I have the urge to make pizzelles it will be handy. Also the recipes in the book that comes with it is excellant. Very easy to use. Read other reviews and that is what sold me on this. They were all correct in what they said about the maker.",
        "Smaller sized cookies, but I love them. This is a easy to use machine and my family enjoys the results.",
        "Can't believe it took me so many years to purchase the Pizzelle maker. Have enjoyed it from the first day I received it.",
        "Bought this item based on the other positive reviews I read. After just 5 minutes, I began to master the cooking time. This Pizzelle maker is easy to use and easy to clean. I tried both recipes that came in the booklet and both were easy and tasty. I love the 3 inch size pizzelle too. Packaged them into tiny gift bags and distributed them at work today in celebration of Valentine's Day. Very happy with my decision to purchase this item.",
        "Chef's Choice 835 Pizzelle Pro is a great product. Bakes accurately and quickly. Can make >100 in about an hour. Hope they have one that makes bigger pizzelles. Will definitely buy it.",
        "First one I have ever used. It was so easy & makes the perfect size cookies. I like the smaller ones & this is perfect. I also bought the Pizzelle mix & it was great as well. You can use whatever flavor you want. I did add a little extra water to make a thinner cookie.",
        "The pizelle's are a little smaller than I was thinking but I am enjoying using it. I haven't quite got the size of the scoop to place in each pizelle mold but I am working on it. They taste amazing.",
        "I BOUGHT THIS ONE FOR MY DAUGHTER. I HAVE A VILLA WEAR (I THINK THE BEST ONE MADE) THAT I BOUGHT OVER 20 YEARS AGO AND STILL WORKS BEAUTIFULLY. I TESTED THE CHEFS CHOICE OUT BEFORE I GAVE IT TO HER AND I CAN SAY THE PIZZELLE TURNED OUT WONDERFUL. I WOULD RECOMMEND IT TO EVERY ONE.",
        "First, I should mention that I own another Pizzelle Bake appliance,also,it's a 5\"size so although it is similar, it only makes 2 pizzelles at a time. I enjoy this one very much, no aerosol to spray oil/butter, no mess and simple to clean. Our friends enjoy the pizzelles dipped in chocolate and on the top of vanilla ice cream.. By the way, the appliance was delivered quickly. Try it, you and your family will love home made cookies on the cheap.",
        "It works great. Makes three pizzelle's at a time. Forget the receipt included in the package, there are better one's on-line.",
        "Item is exactly what I was looking for. Works perfectly, is very easy to use and works every time. Shipment was prompt and item was received even before forecast date. Simply great. Thanks Amazon.",
        "We have had a number of pizzelle machines in our family over many years. We are very pleased with this one and the price was competative.",
        "Product was as described. I used it as soon as I got it. Yum."
    ]
}