{
    "entity": "Waffle Irons",
    "text": [
        "Love this so much! I've never used a traditional krumkake cast iron but knew I needed something easier. This iron was perfect. It heats up quickly, and it's not hard to adjust so that the krumkake comes exactly how you want it. I did find a recipe for the cakes on pinterest that I like better than what was in the recipe book but that's just my taste. Would definite recommend!",
        "The doorbell rang I opened the box- made the batter -plugged in the machine (had a bowl of vegetable oil and a paper towel in hand ) and each time I made one of these little gems I re-applied a little more of the oil the vegetable oil on the machine!! perfect 🎉🎉🎉🎉🎉",
        "This appliance works really well! I loved having krumcake as a child and now I can make them whenever I want with ease! It's very easy to clean and makes the entire process easy.",
        "Heat turns off and on randomly (mostly not at all) because the hinge in the back where the temperature sensor is triggered is way way way too loose so the sensor never kicks in resulting in completely unpredictable results. Waste of time and money. Do NOT buy!",
        "I bought two Chef's Choice 839 KrumKake Express Krumkake Cookie Maker. Although temperature control is very good and they were easy to clean and to use, the hardwares did not withstand. On one, the latch never shuts right and after 5 uses, it broke off. On the other, the red light never come on from day 1. When I called Amazon to see if I can return them, they told me the warranty time of 30 days had passed so I am stuck with both. They do the job and the krumkakes come out good, but I would give 1 star for the durability. The parts don't seem to last well at all.",
        "the latch broke on the first time I used it and that was so frustrating. It looked like the latch had previously been glued back on which was strange. I never returned it because I was in a pinch to get my baking done so I used it and held it together while cooking.",
        "My husband’s family makes Krumkake every Christmas, and he wanted one for our family since we no longer are able to spend as many Christmases as we used to. My husband thought this one was amazing! It works great, and it’s easy to use!",
        "Super easy to use & made wonderful krumkakes. I made several batches this Christmas and gave them away to family & friends. Everyone enjoyed them.",
        "I’ve been baking Krumkake for over 55 years using many irons. This one is easy to use, clean and store. Perfect!",
        "Best electronic Krumkake iron I have used! Very easy and consistent, low burning/fire hazard, and love the color adjustment knob. I just wish the krumkake came out a little thinner. The plastic roller is not grandma's wood one, but it is the closest you can find now a days.",
        "I used to make Krumkake with my Aunt every year during the Scandinavian festival when I was a kid. I wanted to make it again to surprise her. This iron worked perfectly. The Krumkake turned out just as I remembered.",
        "Just used this iron this season. We also use 2 cast iron ones (mass production for a large family) Worked well. Easy to use and adjust temp. Can’t tell difference on finished Krumkager. Only thing missing was “traditional memories “.",
        "I had the Chef's choice 838 waffle cone model for years and loved it until the surface became non-stick and I decided to replace it with this one (839 krumkake). I had high hopes after reading all the great reviews, but this does not cook evenly like the 838 model. Maybe I got a dud, but this practically burns the outer 1.5\", while the inside stays white and soft. I have been making waffle cones for years and perfected my recipes to make crispy cones, so it's not my batter. I am returning it, and going back to the 838 waffle cone model.",
        "We made waffle bowls with this for ice cream and it was so easy and delicious. Used a small glass bowl to lay the hot krumkake over and gently molded it around the bowl to get the right shape. Cooked evenly and so easy to use.",
        "I wanted an electric iron instead of a stove top iron. This one worked really well for a beginner. Once I got a really good recipe and dialed the temp in, I was ready to make a bunch to share. Really happy with this iron.",
        "The batter does not distribute evenly despite being both in the center and also a bit above the center as the instructions suggest. Also the heat must be uneven as one side burns and the other side is pale. Very unhappy.",
        "Since I have a glass top stove I didn’t want to use the old fashioned Krum Kaka Iron of my mom’s ~ this is easy to use ~ perfect “cookie” each time ~ easy to clean & doesn’t take up much room...",
        "Great waffle maker! Checked all comment, and a bit afraid the result of some people. So our first waffle was great! We are cooking every week now. 90% is recipe and 10% is waffle maker = Tasty Waffle",
        "I've received this on Saturday and use it Sunday to make crepe style cookies. Use it for about 30 minutes. The cover for the power light indicator popped open. Keep in mind, it wasn't drop at any point and simply sitting on the counter top. Very disappointing.",
        "Love it, made my first batch with my recipe and it’s great, evenly brown, I set it almost on 3",
        "We've used this twice now with excellent results, and love the recipes included! Only drawback is the learning curve on the baking lights, but figured it out. Makes perfect Krumkake!!!! Highly recommended!!",
        "The last time I made krumkake was over 20 years ago and I am so impressed with the ease of making them with an electric maker. Perfect krumkake from the very first one. Clean up was just a quick wipe down with a damp cloth. The cone for rolling worked great. I also used a muffin tin to make cups to fill. I used a crepe turner to remove them from the iron and it worked great. The booklet that comes with the iron is written very plainly and easy to understand. I used one of the recipes in the booklet and they are great. LOVE the non-stick.",
        "Love it! Makes my krumkake quicker and just as crisp",
        "My wife loves it! So easy to use my kids can use it too. We made these to add to our Christmas goodie boxes. Big hit! Looks so fancy but easy to make.",
        "I really really like this krumkake iron. I used my daughter's which makes 2 at a time but it does not get as nice as with this one. They get very very thin and lacy. I also do not have to use a timer, I just go by the red and green lights once I got the hang of it. The teflon coating cleans up very easily and it stores away taking up very little room. I wish I had bought one of these long ago.",
        "First used one at Christmas last year, so much fun, easy & so good",
        "Real cool. Have to get acustom to temperature setting and final product.",
        "I am a Norwegian ancestry I'm missing is product let's go to try so easy to use designs was fantastic I would definitely recommend the electric model",
        "Would highly recommend. No issues here! This is my 1st krumkake iron. Making these were a breeze, made 20 of them on my own in about an hour. Used my setting at 3, came out beautifully & clean up is so easy! I also like that this machine has a lip that catches any spillage. I brought these over to my In-laws, they were in Awe, not only on how tasty these were, but how beautiful they were (They are Italian, so they have never seen/heard of them before) So glad i bought this, brings back old memories at Grandmas!",
        "Our first time making Krumkake and it worked fabulously. My husband and I had fun making these at Christmas. Would like to make another batch but when you make a batch, you eat a batch.",
        "I LOVE this machine!!! It's AMAZING!!! I wish I bought this Krumkake Express Maker years ago!!! My daughter has Food Allergies so I can't just buy anything out there for her to eat. I had to be creative with lots of recipes. I had wanted to give her something like this machine can make but couldn't, now I can with this awesome machine!!! It makes each one so quickly, you'll have to stay there the whole time which what I wanted! LOVE LOVE LOVE!!!",
        "So great. Have used it & it is simple to use, easy to follow instructions and recipes.",
        "Arrived fast, does exactly as expected super easy to clean - will buy again for gifts",
        "Meh it is ok. I mean you have to be really into crumcakes. It is quite a unitasker.",
        "Used this as soon as I got it and it worked great. Haven't had krumkake since I was a kid and my neighbor made them. Sure this appliance makes it easier. Just put the batter on the plate, close the lid and wait about a minute and you're good to go. The plastic cone worked great for rolling the krumkake.",
        "I purchased this on a whim and I'm so glad I did! I have been using the recipe included and the Krumkakes turn out wonderfully. I even made ice cream bowls for my sister's wedding and everyone raved about them. I also love being able to quickly whip up a dessert in the summer without having to turn on the oven. I love this item!",
        "A gift for my Norwegian husband, He says it works perfect.",
        "works well. Be careful top metal plate gets really hot",
        "My young girls and I love using the mold and making dessert on it. Easy to use, clean and fun overall. Design is pretty too.",
        "I was looking for a Krumkake maker. I was set on the VillaWare 3900 as my family has one and it does wonders. Since the VillaWare is discontinued I decided to purchase this after reading many reviews. This machine works with my ingredients. The cookies came out thin crispy and seems to brown evenly. Test it out for yourself.",
        "Easy to clean and cute design. It comes with several recipes that are pretty tasty. We make cones and bowls. Favorite new appliance.",
        "We moved to a home that has an electric range so we could no longer use my parents' krumkake iron. Since purchasing this krumkake maker, we can finally make krumkake again! It's also a lot less mess than the krumkake iron and very easy to clean. My Dad (an old Swede) loved using it so much, I bought one for him!",
        "I love this funny little machine! It makes crunchy desserts that are unique and delicious. And it works to make grilled cheese sandwiches, too. I use it all the time now!",
        "Perfect!!! I took a Scandinavian culture class in High School (long...time ago) and have always wanted a Krumkake oven since that time. I found this and got it. I have used it several times and my Krumkakes come out perfect. I really like this.",
        "I should have stuck with the old cast iron krumkake baker - this one bakes unevenly - middle is not cooked, edges are over-done. No amount of preheating or fiddling with the settings improved it. Not recommended.",
        "Design is not as prominent on the cookie as I would have liked. Not as pretty as the one my mother and grandmother used!",
        "I like this produced.It good I can control the temperature when I bake",
        "It cooks extremely unevenly and the pattern is hardly noticeable. I’m going to try a different recipe to see if it makes a difference but thus far, I’m unimpressed.",
        "This machine works great. I have the old cast iron traditional one but purchased this one to do a demonstration for out local heritage 'Norway Day'. Even the older women who would come along and use it thought it was great. I did regret that I didn't get the double Krumkake maker in the end however. It would have been twice the outcome with same amount of effort.",
        "Having never made krumkake before, I found that using the Chef's Choice 839 Krumkake Express made very delicious and evenly browned cookies. The pattern on the griddle is very pretty and clean up is a breeze. I have made 4 batches of cookies in 2 weeks and am very happy with the purchase.",
        "easy to use. Was a replacement for the Krumkake baker that makes 2 small ones at a time which had completely lost its nonstick property and I could no longer bake one. This one worked perfect from first try!!",
        "Fast. Easy to use. Consistent browning. Tough. Tucks into the corner cabinet. Very happy. Waaaaaaaay easier that the iron I used for years that heated up on the stove burner. What was I thinking???? Made 4 dozen cones in an evening with no fuss.",
        "Love it. It is so much easier than the old fashioned way! It includes 3 recipes and all are great",
        "It exceeds my expectations! I have cooked four batches trying the supplied recipes. OUTSTANDING!",
        "My first Krumkakes were a success! My only criticism is a minor one, in my opinion. The color (and therefore crispiness) was consistently darker towards the back of the Krumkake and lighter in the front. Other than that, I am very pleased with the product and would recommend it. I'm starting a new family tradition with the grandkids!",
        "Im glad we got this. We revived the old european tradition of krumkake in our household, my daughter loves it.",
        "I am Norwegian, & I loved the Chef's Choice 839 Krumkake Express. Krumkakene came out \" just like my mother made them in Norway\". Brings back good memories. Inger Lise [Lisa] Severine",
        "I only used it once. I'm used to the wrought iron stovetop kind, but those can't be used on a ceramic cooktop. My mom bought a similar different iron (not sure what brand but similar to this one) when she got a ceramic cooktop and it wasn't as nice. This has an effective timer system once you get the hang of it, so no more watching the clock. It's variable settings let you fine tune your level of color, from plain white, to lightly browned so the designed shows up, to dark ice cream cone brown.",
        "Dream machine! Made over 100 for cookie exchange. Every cookie perfect. Use the Norwegian recipe for lacy Krumkake. Thanks enjoy.",
        "Nice quality, big enough for ice cream cone sized krumkakes.",
        "Uneven cooking, but does what I want from it and I love it",
        "Came in very fast was very happy with the look but it was not closing all the way on one side there for one side was burning while the other was still white",
        "Perfect for the home baker. Easy to use. Quick recovery temperature control is a super nice feature.",
        "I purchase this to make fortune cookies and it turns out great. I also makes some gluten free egg rolls Asian style and it turn out perfect, not too thick or thin and my kids love it.",
        "Easy to use. Krumkake are nice and thin. No mess. Baking/ready light are not consistent but also not necessary.",
        "Love this thing. Consistent krumkake every time. The recipes in the book work well, but I've also used my husband's grandma's recipe (very Norwegian Minnesota Lutheran) and had fantastic results.",
        "Obviously light duty but well done. We have used it a couple of times and it has produced a good product",
        "It did not make the cake evenly even though it was really thin, so I have to returned the item.",
        "A very nice, easy to use krumkake baker. I used a family recipe for the same type of \"cookie\" but one that is rolled on a tube so both ends are the same. Our Norwegians call them strull. Also used a church recipe with good results. The only negative is that I could not get them as thin as we desired. With the traditional style it seems like you can squeeze the iron and make them thinner. With this iron I made 24 krumkaka and another lady made 60 with hers using the same recipe. So these are nice and big.",
        "Being 100% Norse, yet failing at the usual Krumkake iron, this was the answer to my prayers. I must have made hundreds of these over the holiday with NO issues at all! I used my own recipe and went to work. They all came out beautiful!",
        "Bought this to make Krumkake for the holidays. It works really well. It takes a little time to figure out how much dough to put on the iron. Once you figure it out, they come out just like Bestamore used to make.",
        "Used a Nordicware stove top one for years - usually burned myself and started a fire on the smooth top range. Usually make them only for Christmas. This one worked great from the 1st one to the end. Easy cleanup. Won’t go back to the old one, Except for using the recipe from the old one.",
        "Krumkakes are a Norwegian Christmas Cookie. And, NO, they're not traditionally filled with anything. It's a cookie; delicious all by itself. My mother has my grandmother's cast-iron Krumkake maker which you use on a stove-top. This is going to be a Christmas present for her.",
        "Works great. It arrived sooner than expected and in great conditon. This electric Krumkake Express maker makes Krumkake a lot easier to make and they don't stick. I love it. Thanks!",
        "I have been using this iron. I do notice that the center of the krumkake is much lighter in color and I may have to adjust the temp gauge.",
        "I made the krumkake I wanted it for, and they turned out great! So much easier to use than the direct stove model.",
        "Everybody needs a krumkake maker the kids will love you as well as the adults!",
        "This is a nice machine to have around if you are Norwegian. It's a modern machine, but makes classic Krumkake.",
        "I bought this one for my Mother. She says it’s amazing! Its easy to use, easy clean up and makes perfect krumcakes every time.",
        "This not only makes delicious krumkake but they're fun to make. Using the krumkake express is actually much easier than the directions imply. Find a simple batter recipe (the one I used was simpler than the ones given with the directions). I even made mine with gluten-free flour and it came out perfect. I filled them with whipped cream and in the summer I plan to fill them with ice cream since gluten-free cones are difficult to find. I highly recommend this product.",
        "Cooks uneven, one side browns about 3x faster than the rest of it. Not the end of the world, but it's annoying.",
        "This is a great machine for those familiar with krukakes. Easy to use and just about runs itself. Also easy to clean. Settings let you get your desired results. Highly recommend this items!!",
        "Very good. I'm happy with it. Everybody in my family like my cake. With Krumkake Express 839I made Krumkake about 6 inches in diameter. I'm looking for a mold that make krumkake about 3 or 4 inches in diameter. Would you please find it for me. Thanks.",
        "Works well, but it bakes a little uneven sometimes. The krumkake and stull still turn out great though.",
        "So many years burning our fingertips on the stove with our old iron. This is really the way to go. Golden brown in minutes!",
        "Works great, easy you use and the recipes are also great. Everyone was impressed at my first batch of krumcakes.",
        "After using the stove top version for many years, I was thrilled with the results of this product. The cookies were uniform and I only wasted the batter from the first cookie due to too much oil. I really like the product!",
        "Better than I expected. Nice to be able to walk away for a moment and the iron maintains the set temperature, unlike using my old manual iron. My only disappointment was that the Krum Kake were thicker than when made manually, not as light and delicate. But of course flavor was the same and they looked beautiful. A good alternative if you don't have or don't want to use a manual iron.",
        "Bought this for my 19 year old son (who wants to be a chef) for his 19th birthday. He was pleased with it.",
        "Works great. It maintains consistent heat so you can make krumkakes without pause once you get the hang of it.",
        "The Krumkake Express is everything i hoped it would be It is so easy to use. Love it.",
        "Enjoyed my new appliance... Plan to use not just at Christmas!",
        "From the first krumkake to the last everyone is perfect. So easy and clean to use.",
        "I love this krumkake baker. I made krumkake with my grandma using a stovetop iron when I was younger. A couple of years ago I bought an electric pizzelle maker thinking I could use it for krumkake. It burned them so I gave it away. I decided to try an electric version again and bought this one since it was specifically for krumkake. It's wonderful. The nonstick surface makes it super easy to get them off the iron. The adjustable knob lets you set it at just the right time so your krumkake are perfection. Now I'm passing the krumkake making tradition to my kids.",
        "Easy to use electric Krumkake iron. Can quickly and easily make batches of Krumkake",
        "My husband bought this for me for Christmas as a possible Bratzlie press. It worked like a charm. It's a little bigger than a traditional cookie, but who ever ate just one?",
        "I bought one of this Krumkake express from Amazon when travelling to US and took it to Brasil. Ariving home, I tested the machine and it works very good. The Krumkakes are crispy and cook fast. I tried several recipies and all of then cooked well in this iron. I recommend it.",
        "Product does exactly what it says. Temperature and lights take some trial and error but once known performs very well",
        "This did not come with the wooden cone roller that is required to properly roll the krumkake",
        "So much easier than standing at the stove with the older one!"
    ]
}