{
    "entity": "Shaved Ice Machines",
    "text": [
        "This is their replacement cause the first one didn’t work, I know how to work a ice shaver . I doesn’t even make a noise. Seems like they give refurbished products",
        "I'm 35 weeks pregnant and everything I eat gives me heart burn. I began eating ice chips from our refrigerator's ice maker as a \"snack\" and really like it, but it's tough on my teeth. I thought \"if only they were smaller pieces...\" Then my husband suggested I look for an ice shaver machine online. 2 days later I'm making my favorite pregnancy treat! It's also a great way to stay hydrated when drinking water has become very boring. And my other children are super excited at the idea of making slushy drinks at home anytime we want! We all win :)",
        "While very slow, it works really well. If you want finely shaved ice, use the little container that come with it to make ice blocks. We make several blocks and store them in plastic bags in the freezer, so we always have several on hand. You can use regular ice too, but it gets stuck often and is kind of chunky. Not great for a party unless you make a bunch beforehand. After reading reviews, that's what I did. Stored it in a cooler and let the girls go for it. It was a big hit. We've used it many times for snocones. Definitely recommend for the price.",
        "The Pot-bing-su maker's dream. Bought this on suggestion from Maangchi - the Korean cooking youtuber. It works great, and makes two bowls of pot-bing-su with fluffy ice. The shaved ice is much like snow, has a great texture, and tastes good on the tongue. I do wish the base were a bit wider since I need to turn my standard soup bowl sideways to get it out of the bottom.",
        "It is hard to get a snow maker that is shaved thinly like snow. This does it. But don't expect to make 20 or 30 of these for a large group. But if you plan on making just 1 or 2 it is fine. Don't put too much ice in as it won't start (took me a bit trying to figure that out as I went to 4 plugs). So for the price, it works. Also make sure your cones aren't too tall as the clearance underneath is limited. You might even need to bend your cup a little at the bottom tip to fit it underneath.",
        "I bought this for my two children to enjoy when they are being good. It works well enough but if you fill the bin with too much ice it will not spin. I noticed some people here saying it was a dud when they got it but I bet you they didn't bother to check that. There is a switch underneath the motorized unit and if the activator on the bottom half does not activate the switch on the top half it will not work, hmmm, what a concept. It works fine for the cost and it provides pleasure my children will enjoy as long as it lasts.",
        "My daughter had to have her tonsils out (she's an adult undergoing this procedure). I wanted to make sure we had this before then. I arrived shortly after ordering it and am I ever glad it did. It was wonderful having it when her throat was so sore after the procedure. I would not only recommend this seller but this product as well. Thank you for the wonderful service.",
        "This product came quickly and was purchased for my son's second birthday present. He loves ice so this is a great way for him to eat it without the possibility of breaking a tooth. I just pour a little melted Popsicle on it for flavor or the kids eat it plain. Works great!",
        "We find this very easy to use and super fast! I prefer to shave the ice, then add the flavoring. All you have to do is let it dry for a few minutes, then put it back in the cupboard. We use it at least once a week in the warm months. I wish it came with more containers, and I am going to check and see if I can get more. It works best with the round shape block containers they provide. Each block makes one very large serving, or two kid size servings!",
        "Tough and reliable. I use this little baby just for making smoothies, twice a day every day. I bought it two years ago, it's still going strong. It's a good price and makes a fine texture ice. I am preparing to buy a back up, I rely on it so much.",
        "So is this as smooth and fluffy as shaved ice from a shaved ice shack? Nope. But, it's not crunchy like a snow cone either. Kind of in-between. I seem to get very similar results whether I use ice cubes or the ice molds. Only difference is the machine doesn't shake as much when I use the molds.",
        "My two girls and I have been using this ice shaver for a month now and have thoroughly enjoyed it! It is easy to use and quickly makes enough for the 3 of us to have snow cones. It says regular ice cubes work, and they do, but it does not work nearly as well as when you use the molds that come with it. We have started making them and storing them in bags while we make more so we never run out. Other than that, we have loved it.",
        "I really love mine, it does what they say about it. It really makes the ice be a powder looking ice. I don't make snow cones i make snow bowls. Great product to have.",
        "I just received mine today and used it right away. I haven't made any flavored things yet but the shaver takes any premade ice and shaves to a nice, soft texture which I love. Most of the ice cones I've had at stands have always had hard little chunks of ice which I've never liked but this shaver does it better. I tried it with semi-crushed ice first from my refrigerator door and it worked fine with that. Its easy to use and easy to clean but like others have mentioned, beware of the somewhat exposed blade.",
        "My 14 YO daughter LOVES this product. I'm happy I made this purchase. She uses it OFTEN; seems to work great for her.",
        "This Ice Shaver is the best thing thats ever happened to us when it comes to making Margaritas. This thing grinds ice for the rim of the cup very easy, the only work you have to do is push down. Now, I used to grind and push down so it was a lot of work but now, pushing down is all. Highly recommended for the price",
        "I purchased this shaver over a year ago now and it still works great! My daughter LOVES snow cones and after battling with the Snoopy Snow Cone machine, I decided to take the plunge and buy this one based on previous reviews. It has been the best $25 bucks I've spent! I use either fruit juice or sugar free kool-aid over the shaved ice and it's a hit. Love it!",
        "We have been so impressed by this great machine. Well worth the price and tons of fun to eat! It was the best Christmas present ever. We've been making sno cones every day because of the ease and fun. The shaved ice is awesome. It is much better and smoother when you use the ice from the frozen containers that come with the product. Great find!!!",
        "I'm disappointed because my package has been clearly used and it has missing parts, which are the 2 freezer containers. And some kind of food scum or something on directions. Very disppointing",
        "My grandsons love this little machine. It works great with the formed ice cups but seems to work pretty good with just standard ice cubes.",
        "The experience, price, and shipping were all exactly what I expected. No complaints here. Truely one of the best of the cheaper ice shavers. I'm on my second one in 4yrs.",
        "This electric ice shaver replaced a hand cranked one that I had before. It works well and is MUCH EASIER to use...just drop in the moulded ice chunk and press down. Just that easy.Now I don't work up a sweat to get shaved ice.",
        "great! does the job. Fast. Quick. Ice is Fluffy (sometimes icy) but usually fluffy works with cubes and molds",
        "Worked great for me for almost 6 years now and that blade is no where near dull! A product so worth the purchase.",
        "I purchaced this because I have diabetes and I can freeze sugar free juices and make very light and tastey treats. this works well by shaving the ice into a very fine fluffy snow like ice treat. this item worked better then any of the others that I tried.",
        "I bought this to make Filipino dessert-halo halo and Korean dessert- pot bing so. Just like what other reviews say, it works well when using ice from the container that came with it. Also works with ice cubes. Highly recommended!",
        "My children enjoy getting out the ice shaver occasionally. I got it for my four year old son for Christmas last year when he asked for snow. Of course adult supervision is required. But my older children have no problem working it, and it is fun.",
        "It is acceptable - nothing special. Takes about a minute for one serving, but when you add the syrup the volume of the ice decreases by half (unlike shave ice you buy from a vendor). I think I would have preferred a hand crank shave ice machine so I can control the speed. Acceptable for the money - good for kids, not for hosting a party.",
        "I got this 2 months ago and have really used it a lot. It shaves the ice perfectly and easily. It's never gotten jammed. Plus, it's not just for ice. I make a great Pina Colada drink by freezing crushed pineapple, pina colada drink mix, and rum extract. Then you shave it and add it to vanilla ice cream and pineapple juice. That was a Pampered Chef recipe from a long time ago, but it also has ideas in the instruction booklet.",
        "my son loves his ice and it make my work easy since I use to do it manually",
        "The shaved ice is extremely fluffy and fine just as advertised...but positioning the top so the pressure switch is engaged is a challenge. Also, I have to press hard on the top to completely shave the ice disc. Makes a great snow cone if you do not mind a little work.",
        "This is a fantastic product. The ice is extremely fine! My grandchildren and the neighborhood kids love to make and eat the delicious snow cones. I highly recommend the machine for home use.",
        "This is a nice little device to have around the house especialy when it's hot outside. The two little tubs that come with it are perfect but I never tried using ice cubes out of the freezer. The only thing I didn't like about it was the fact that the base limits what you can & can't use to catch the ice. However if you take the bottom off (which is really easy) you can use practically anything you want to catch the ice no matter how tall or wide it is.",
        "The blades rusted badly after just a few uses... so... we donated to Goodwill. Hope it went to a good home.",
        "I tried many others. This is the only cheap one that works. You do have to push down a bit, but no big deal because it actually works.",
        "Very easy to use. Quickly shaves a cup of ice using the round ice trays provided. I got this unit for mixed drinks. It works for that, but the ice is better suited for snow cones.",
        "Just love it. The ice came out snowy and not chunky like the last machine I bought.",
        "Easy to take apart & put back together. This little gem performed exactly as expected, the price was excellent and best of all it arrived in time for the party.",
        "Fell apart very quickly. I would not have wasted my time.",
        "Very good electric shaved ice maker. Easy to use. Makes a small shaved ice cone in less than a minute. Shaves ice fairly soft with little effort. Probably the best you can get excluding large expensive commercial shaved ice makers. I would definitely recommend it to friends and family. Bought it from Amazon: $19.99 w/free shipping.",
        "The machine works great but the only problem I have found in it is that once in a while it clogs",
        "When it 'shaved' the ice, it also 'shaved' the plastic. Therefore, your shaved ice had plastic in it!!! Didn't realize it until I added a dark liquid over the shaved ice. Then I inspected the machine. Yep. The plastic was also being shaved.",
        "Not super high quality, but I didn't expect it to be for the price. The first one I ordered was cracked on the side, so I sent it back and ordered another. The ice is not like shaved ice, its a bit larger.",
        "If you want shaved ice, this is a bargain. Uses the molds or cubes. We use it all the time.",
        "this makes great shaved ice,i own two.great any time!love it.",
        "I bought this for fathers day so the kids and their daddy could enjoy it together. It takes way too long to get enough ice for one snowcone. The kids were very antsy waiting and so were we. You can only put a tiny bit of ice in the ice compartment too or it jams and wont shave ice at all. I thought with the overall number of stars this was given, the bad reviews could just be overlooked but I was wrong. We will be returning this item asap.",
        "Works well. My 12 yo son is able to operate it independently with his friends.",
        "We were extremely pleased with this ice shaver---we really didn't expect the ice to be as finely shaved as those you get at the snowcone stands, but it was! This is a *great* tool for making real shaved ice snow cones at home!",
        "The kids love it, and I love that it is simple and safe for them to operate. Works great with either regular ice cubes or the ice molds! They love this over the easy bake oven which turns out not to be so easy...",
        "I have had my Snowman Ice Shaver for a month and really like it! Yummy shaved ice!! I use it 3-4 times a week. I have only used the ice made in the included plastic containers. (I haven't tried cubed ice.) This is a very decent ice shaver for the price.",
        "The Hamilton Beach Snowman Ice Shaver is the biggest hit. My daughter has always craved shaved ice and could not be happier with this product!",
        "It's slow. Maybe it's faster with the ice-mold rather than regular ice cubes, but i doubt it. Just after I got this model last week, I tried the Rival Snow Cone Maker at my friends home and that one is SOOOO much faster. I'd love to return my Hamilton BEach snowman for the Rival model, but I've already thrown out the box.",
        "Easily dispenses the shaved product from frozen ice. The different flavors will win over all who use this product. GREAT BUY.",
        "This product is great! But yes, I agree with the other reviewers here that i wish i had more of those \"cups\" because this product works so well and easily! A great gift!",
        "This unit does shave ice, if you have the time. It is uncomfortably slow at accomplishing it's assigned task. One reviewer said that using ice cubes results in a coarser product. I did not find that to be true. It perhaps shaves cubes a little quicker, but you still have to wait. Using the provided cylindrical ice forms was a bust. I could not apply sufficient pressure to the top of the machine to make it do anything with the round ice (I am of the male persuasion). I returned it.",
        "I bought this to make pat-bing-soo, and this ice shaver makes good fine shaved ice. Easy to use, easy to clean.",
        "Great shaver. Value for money. I have been using this for 6 months now and without any problem. Easy to clean and maintain and does a fantastic job in making shaven ice. The ice maker provided is a cool attachment that creates steps in the ice block which holds the block in place to get an effective shave.",
        "i really like this ice shaver. the ice is snow like and you get a good amount out of the molds provided. i normally purchase another brand, but this one is definitely a bang for your buck!",
        "I like this machine it's good for hot days. Al thought it takes it's time i think it does a decent job. I don't really use ice cubes because sometimes it jams. I prefer to use the plastic container put water in it freeze it and then just drop it in. it won't jam and it's faster.",
        "This is exactly what i was looking for at the right price. The product is quality and works really well. My kids love it and it so user friendly. I use it everyday in the winter - this will be a big hit in the summer months for snow cones and slushies. Personaly I just like crushed ice plain. It's mor of a shaver texture which is very palatable. I would highly recommend this product. turns out my girlfriend has the same one.",
        "This does what is says!! It makes shaved ice not chipped ice. Nice and fine, fluffy ice for snow cones",
        "From just having a quick cool off to making your own shaved ice (we call them snow balls in the South) this machine does the trick. I use it everyday!",
        "Reasons for not buying it: 1. you don't want to spend 1-2 minutes for each glass to be filled, if you have a family the first glass will melt down before you can serve to all your guests. 2. It is impossible to keep clean, the design does not allow a good cleaning. Another reason why i hate this product: It didn't work at all when took it out of the box, i had to dissasemble and repair.",
        "Not effective, takes hand pressure and more than a minute per cube from standard tray, also can't shave other frozen fruit, I.e. Lemons",
        "It takes a while to work with this ice shaver. Now that I know that, cannot say I would buy it again.",
        "Mine was defective and/or broken, even though we had just taken it out of the box. Had to return it.",
        "My daughter got this last Christmas and still uses it. Great shaved ice maker. Pucks work good, and it's easy for her to make. We haven't tried any other types of ice, but we have made the pucks and then after freezing, put in a baggie, so we could make more. We always add flavor to water before freezing - it will melt ice if poured over shavings. Great gift",
        "Yumm!! This inexpensive, compact ice shaver works a treat and effortlessly offers up delicious fluffy shaved ice in a matter of seconds! You can either use the two included forms and fill them with whatever liquid you prefer, or you can just put ice cubes in the hopper (though ice shavings from the round forms are more fluffy). You can freeze liquids such as orange juice, root beer or kool-aid, or you can shave plain ice and add syrups later. This is a fine product and works like a dream. The only problem is that the sharp blade inside the hopper is exposed and you need to be VERY careful when cleaning.",
        "My grandkids love snow cones, and I love the fact that I use juice to make them. So they get hydration, vitamins, and no undue sugar! Each container of frozen juice makes 2 generous cones.",
        "This does not make ice snow . It does not work with big ice cubes . My food processor makes identical crushed ice and does it more completely and much faster .",
        "Love this snowmaker machine. It makes the best slushies. I wish I could find someplace though that sells some of the freezer containers that came with it.",
        "My 3-year-old loves to press the top to shave the ice almost every day. I love this automated ice shaver. Now we cannot live without this in summer.. We gave the same ice shaver as a gift to our friends who have kids!",
        "I gifted this to someone who was eating several popsicles a day, even during wintertime when snow was on the ground. He liked being able to make his own. Easier ones do exist but this was usable and still works after several uses.",
        "I was looking for an ice shaver to make sno-balls/hawaiian shave ice. I've tried several \"snow cone\" machines that produced crunchy chunks, the opposite of what I wanted. This produces a very fine snow when using ice blocks made from the included molds. The only way you're getting better than this is by purchasing a commercial block shaver at around $2000. Pros: very fine ice, like snow. This will make new orleans style \"sno-balls\" and hawaiian style shave ice. 2 ice molds. Easy to clean. Cons: Base is a bit narrow and short. I couldn't fit a bowl, or full size cup underneath to catch the ice coming out.",
        "I took a chance on purchasing this after my husband & I enjoyed Hawaiian Ice in Maui. We place a small scoop of vanilla ice cream in the bottom of a bowl and place each bowl under the shaved ice machine. Our topping is Torani syrup, especially like the raspberry. We use our machine ~3 times per week, and I also served it to a group of women at my home last week. They loved it! I always use the \"hockey puck\" ice forms that came with the machine.",
        "I ORDER THIS ICE SHAVER ABOUT 3WKS AGO FOR MY 7YR OLD AND 2YR OLD DAUGHTERS TO MK SOME LATE COOL SUMMMER TREATS AND FOR MYSELF BECAUSE I LOVE JUST EATING ICE BY IT SELF.WE USED IT THE 1ST DAY WE GOT IT AND IT DOES WHAT IT SAY IT WILL DO. AND ITS EASY TO CLEAN AFTER USE.I GET TO EAT MY ICE WITHOUT HAVING TO CRUNCH DWN ON A BIG PIECE OF ICE. AND MY GIRLS GET TO HAVE THEIR COOL SLUSHIE TREATS EVERY DAY IF THEY LIKE WITHOUT ME HAVING TO DRIVE OUT AND SPEND CASH.WE LOVE THIS LITTLE SHAVER AND WILL ORDER AGAIN IF NEED TO IN THE FUTURE.",
        "Lots of fun, 20 seconds to make a cup of ice. The 2 inches of water in the bottom of a cottage cheese or yogurt container makes more ice to fit the machine, in addition to the two containers supplied with the machine.",
        "I have owned this machine for about a year, and I use it 2-4 times a day. It has held up just fine for going through that kind of usage. The molds are starting to crack a little, but I do bang them down every time to get the ice out. I bought this on a whim and ended up loving it so much that I am looking on here for another one. Shaves ice beautifully, nice and fine. Easy to use, just put a little pressure on the top. I definitely recommend this.",
        "A piece of junk !!! I tried shaving ice cubes and also ice from the molds that came with it. Barely shaves either one. Would only be for adult use to make ice for an occasional frozen drink, not even suitable for 1 cup of ice per day. RETURNED will research again then order a different one.",
        "Kind of waste of money. It took a long time to make a little cup. I used it a few times and never touch it again. It is made in cheap plastic and a small motor. You get what you pay for.",
        "I have beat the crap out of this thing, and it still works great! I wish I could get extra ice molds, but freezer cubes work just fine in a pinch. This is one of those rare products that delivers more than promised. I picked up a great tip from the Hawaiian Shave Ice website (great syrups, BTW). Before you start shaving, let the ice sit at room temperature for 10-15 minutes. The pros call this tempering, and it produces that flaky ice like you get at a shave ice stand.",
        "At first I thought it might be broken because the big button I pushed on top didn't start the motor a few times, but now no problems. So far I've made several snow cones for friends, family - and most importantly - myself. Put Torani syrup on top. Yummy! I figure a few more snow cones, and this thing will have paid for itself compared to the amount I spent every summer at the snow cone stand.",
        "This is a great ice shaver that my Korean wife loves for her summer desserts. Unfortunately, she doesn't eat cold food during the winter. I like it for smoothies - any time of the year. It's best when water or fruit juice is frozen in the containers that come with the product. I reuse the containers to make lots of ice blocks to prepare for the days when I need to make a lot.",
        "This is the second one we have purchased. Our first one, which is the same model, was FANTASTIC and lasted for years! Sadly, it got dropped and would no longer work. We were so happy to see that Amazon still had this ice shaver available! However, not sure if we received a defective machine, it will not shave ice--no one flake! If Amazon is serious about these ratings I would hope to hear fro them soon",
        "Both ice mold cracked at bottom within a few weeks. I think poor quality. Had to return to get replacement. Otherwise it works great. Shaved ice is fine and pretty fast. From time to time, when it seems slow to shave, remove and rinse blade area because sometimes ice builds up at where the blade is. Put pressure on where the blade is.",
        "Just an average ice shaver doing its job. Kind of big to store.",
        "This was one of the best things I bought this summer. My 5-year-old granddaughter loves ice and \"snow\" to eat. She kept going into her mom's freezer and scraping the frost off the walls, which wasn't really too good for the freezer. Now I can make her a bowl of \"snow\" anytime she wants. The machine is easy to use, although I do recommend using the round cakes of ice that they include the molds for. She's happy, her mom is happy and I'm happy.",
        "I think not much needs to be said about this simple machine other than it works exactly how it should. It's easy to use, and easy to keep clean. The two ice molds that it comes with are perfect, and the ice shaves really well. We got this as a staff 'perk', and everybody is loving it, especially now that summer is here. I highly recommend it!",
        "This is the first ice shaver I have ever purchased but I have been enjoying it! I have had it for about 2 weeks and have used it almost every day. ( I am pregnant and have been craving sno-cones!) I have used regular ice and also have made ice with the containers that it comes with. Both work - but the ice in the containers it comes with works better. It turns ice into a consistency similar to freshly fallen snow. Can't wait to make margaritas with it next summer!",
        "I was given a Rival Ice Shaver (which I threw out 30 minutes and 1 tbsp of shaved ice later). Desperate for a snow cone, I bought this and I am glad I did. This machine works as well with ice cubes as it does with ice made from the tub that comes with the machine. While the snow from ice cubes may not be as fine as the snow shaved from the ice made in the tub, it is not like its bits of broken ice either. What is best is you are NOT depending on a little bit of plastic to make the machine work (as in the case of the Rival Ice Shaver).",
        "Although this isn't as cute as the Snoopy Sno-Cone type machines, it works way better. I got it for my daughter for Christmas. It comes with two containers that can be used to freeze juice, root beer, etc. to make snow cones with or you can use regular ice cubes. You can also freeze yogurt and shave that.",
        "I'm a shaved ice craverrr. I bought this item and couldn't wait for it to arrive. Soon as I recieve it I happily opened it, assembled it.. only to find thag it didn't come on at all ! Its going to suck waiting all over again to return and buy a new product especially since all shaved ice shacks are about to be close.. very unhappy customer :(",
        "I am so addicted to this ice shaver that I bought one for the office because I couldn't wait until I got home to have a slushy. I also take it with me when I go on vacation. My Hot Flashes say \"THANK YOU\" to Hamilton Beach!",
        "I didn't expect much for the low low price but this little machine did not disappoint! It only comes with 2 containers to freeze the recommended discs of ice but luckily I had plenty of containers the exact size and was able to make tons of ice discs before my daughter's birthday party. I read lots of other reviews before taking a chance on this. All of my family was so pleased with their shaved ices that they are going to purchase one for their homes as well.",
        "When i bought this i thought it was not worthed, it made the ice very slow but actually for all the negative comments out there, if you put ice cubes inside IS NOT GOING TO WORK HOW IT SHOULD BE, you have to put water and froze it in the 2 plastic containers provided, after is frozen put it in the container that has the blade, this will make it faster.",
        "This makes the best, fluffiest snow. Not like the crunchy little balls of ice at the carnival. My 3 boys love it and beg for sno cones on every warm day. It takes about a minute to make one cone so it isn't fast like the industrial ones. For a family of 5, it is perfect for impromptu treats. We bought all the syrups and make rainbow sno cones. You can also buy sugar free syrups for a treat that won't make your kids so hyper. Love it, it is worth every penny.",
        "Love the Snowman Ice Shaver. Easy to work, easy to clean. Makes great snow cones. We keep it healthy with plain ice or frozen fruit juice - even works well with chocolate milk. Our son loves helping me make the snow cone and enjoys every last chilly bite. Great value.",
        "I first purchased a $299 model ice shaver and wasn't happy with the output. It was too grainy. So I returned it. This one puts out as good if not better quality of shaved ice for a much cheaper price. We used this every day for two months. My daughter can't have food dye and I was able to find syrup that was all-natural and organic, and it actually tastes good.",
        "I've used this everyday since I bought it and it's fantastic! Love this thing!",
        "Has made this summer a little easier... My kids constantly want a shaved ice when they see the little hut on the corner of every street in my town! I tell them wait till we get home... Saves me $10 each time!!!"
    ]
}