{
    "entity": "Shaved Ice Machines",
    "text": [
        "So good I actually rented it out once. Just don't overload it with ice and don't drop the top, mine cracked. Makes enough ice for 3 snow cones every batch, each batch takes about 30 seconds.",
        "I cannot believe I ever bought that stupid snoopy one! This thing is super amazing!!! Lots of fluffy ice in no time at all!! Awesomeness!!! We've been using the syrups, but I bet this would be great with any liquid. My only complaint is my box was missing the scoop. Not even a big enough deal to knock a star off the rating.",
        "Bought this first to see if it would actually make great snow cone ice. It makes snow with very few small ice chips in. So fine you can actually compress the flakes and make a nice round real snow ball. Easy to set up and clean and makes plenty of shaved ice in about 4 minutes. For the price, we will keep using until it wears out or breaks, then just get another one. RECOMMEND TO ALL.",
        "Huge hit at a 6th grade graduation party. I had considered renting a Sno-Cone machine, but it was cheaper to buy this. Sure, you have to do it in smaller batches, but we had about 25 kids wanting Sno-Cones and no one had an unreasonable wait. They came out nice and fluffy. The only issue is drying it out afterwards... the area where the ice gets shaved can't be wiped out, so I just kept shaking it and shaking it and could still hear some water drops inside. So next time we use it I'll have to remember to wash it out first in case there's mildew.",
        "This machine is as expected. It's very cute and great for kids and adults.",
        "Great snow cone maker. This is just for small family use, you wouldn’t want to use it for a large birthday party or anything like that. We used it this past summer, the kids enjoyed the cold treat. It’s easy to use, and easy to clean. I like the holders on the side and the plastic holders it comes with. I purchased a tube of drink cones separately, they worked well. Snow cones are a great way to get kids to consume more water, and the amount of syrup per cone isn’t extensive enough to add too many empty calories. You might be able to use the slush for drinks, like daiquiris. I don’t drink, but it might work.",
        "Great product. Shaves ice very well. Used it for a class project. My kids shaved about 10 pounds of ice (enough for more than 60 students) in about 25 minutes. Use with online snowcone flavoring recipe and you will be in heaven.",
        "Amazing! We will be using it at our next get-together! Comes fully assembled, so easy to use and shaves ice really fast. One round of ice cubes made two snow cones. Let the ice sweat a little before starting and you won’t have any issues! Great product!",
        "I did early Christmas shopping and gave this as a gift to my 8 year old daughter. She loved the look and the wheels but when we tried to turn it on, it only made a clicking noise and has never turned on, tried everything! Now I’m annoyed and my daughter is sad because I can’t return it and my daughter is out a gift. We really just want to exchange it and get one that works. I will be contacting them.",
        "Worked perfect for a luau party! Looked cute too! Perfect table top size. Chopped the ice nicely.",
        "I ordered 3 times. The first 2 came in a box that look like someone jumped on top of it even though I checked that it be put in an Amazon box twice. The 3rd came in an Amazon box but the top was missing when my grand daughter opened it Christmas day> She was heartbroken. So I had to return all 3 and give her a gift card",
        "I’m so bummed. I got this for me to use for my kids while out of school and it’s quite working on the second time. The reviews were good so I assumed it’d work fine. We read the instructions which say to not use longer than 5 minutes at a time. Presumably so it won’t over heat. We did follow that time limit. As a matter of fact I only ran it 4 minutes at a time (to play it safe) then I let it rest a half hour before using again. And we only used it yesterday and today and it has quite working entirely. I’m sooo bummed! 🙁 So are my 4 kiddos.",
        "I purchased this in 2015 and it has lasted through both girl scouts and cub scout meetings, numerous birthday parties and long hot summer days in the South refreshing all the neighborhood kids. It is still going strong today and well worth every penny spent on it. You would not believe the amount of \"snow\" this machine makes. I am going to try the make your syrup recipe I saw posted on this review section...2 cups water, 2 cups sugar, boil and cool, then add pkg of any flavor koolaide and shake in bottle.",
        "This machine is very slow, loud and gets stuck too often! So annoyed I went away for weeks and was unable to request a return! Will be calling for a manager!",
        "It is a cute design. It is loud. Like a loud blender. So far, it works great! We've used it regularly for a month now and we have had no issues. I do wish it could maintain the ice, 'ice' for a little while. Once u make your \"snow\" as my DD calls it, u gotta hurry up and serve it. Anything that stays behind will quickly melt. If it maintained it as \"snow\" then it would give u time to have a second serving. Perhaps that's a design the company can come up either next. The base is just cosmetic, so if somehow they could add something to hold insulation, that might b a good add on.",
        "This is by far one of the best purchases I've made. It is quick and easy clean up. Just basically set upside down on dish drainer in sink..dry..put away. The best part other than my 7yr old grandson being the snowcone man for all the kids is the fact that I can monitor the sugar intake. Here in Florida heat the kids are happy with just the crushed ice so adding a splash of Gatorade or low sugar fruit drinks is perfect. I highly recommend this product.",
        "Served up about 100 snow cones for a huge party, and was a crowd favorite. There was always a line for this thing, and yeah, I totally ignored the 5 min limit, and had no problems with overheating. Sometimes the ice has trouble going down to the shaver if you have big cubes, and you gotta flick them down, but if you get that bag of ice from the grocery store, then you will have no problems.",
        "I will never buy one of their products again. This is the size of a toy. Plus, this company can't seem to provide their own supplies (i.e., syrups, cupc, straws, cups) as advertised. This was purchased as a gift package. The machine finally arrived (over a week late). The supplies were not included and never arrived. Oh, I paid extra when purchased as a kit. Amazon Customer Support stepped in and finally new supplies arrived. This seller gets a ZERO...size is a joke. What good is a machine without the accessories?",
        "Gave to friend's grandchildren. Nice, easy to use. Large enough for them to use for their family and friends of their kids. Down here in S Texas something like this is loved in the summertime. Bought the syrups and cups on Amazon as well. Bought a smaller one for myself. Also can be used to make \"adult\" beverages, like margaritas.",
        "This has been used every day since we got it two weeks ago. Sometimes more than once a day. It is so easy to use and take care of plus it does an excellent job at shaving the ice to the perfect snow cone consistency. I highly recommend this machine over the ones you have to freeze the circle of ice and shave it instead of you’re own ice cubes from your ice maker. Being able to use regular ice cubes is a must have.",
        "This snow cone machine is so quiet! It is super cute (white with gold trim) so it isn't an eye sore if left on the counter top or shelf. The ice is super soft and it held enough shaved ice for 6 servings. It comes with 2 white snow cone cups with an attached stand. It also has an instruction manual that gives you ideas on different kinds of shaved ice, like milky ice. I'm so glad I bought it! My kids love it & it's been so much fun experimenting with flavors.",
        "Great size and shaves ice perfect! We got this to add to our theater room and the kids love it! The only thing that is a down side is when you open the door to get the ice it falls out as it's located on the side of the machine, just have a towel handy to wipe up small amounts of ice. Everything was delivered fast and in perfect condition.",
        "THis is great for summer parties or all year long! We used concentrated grape juice from a spray bottle to flavor the ice, but you can buy official snow cone syrups. The only issues we have w it is that it turns on automatically when plugged in instead of when activated. You can only run it for about 5 min at a time, but that makes at least 3 snow cones. Definite thumbs up!",
        "When you find something like this for such little money, you expect to get what you pay for... something cheap that will work twice then break and end up in the rubbish bins. So far we have used this several times, and it is holding up great. The kids are having so much fun making snow cones. It's a bit loud, but it is crushing ice, so that was expected. Hoping for a fun summer with this little machine.",
        "I really wish I can give this 0 stars.... I bought this to use at my daughters candyland birthday party. And it didn’t work!!! We tried 3 different electrical sockets and the sno ball maker didn’t turn on. I’m very disappointed bc my return window ended on Oct 1st. I wish I cld contact the seller bc I want a refund",
        "Top part came broken...it did not work at all we tried every possible thing but at last we found the top part was broken which did not let the machine start. total waste of money.",
        "We love this snow cone maker! I have never had any other one so I don't have much to compare it too. This produces snow cones in the range of fluffy-finely shaved ice. I wish the entire thing were a pit smaller for storage. I gave this to my 9 year old for her birthday and she uses it all the time by herself with no problems.",
        "I got it for Christmas like a year or two ago and I LOVE it. It’s pretty noisy, but who cares right? I have a ice addiction and this is perfect for me. It doesn’t hurt my teeth, the flavors are delicious, it crushes the ice EASILY, I love the scooper and cups, I could go on ALL DAY! I make it every day and it’s so convenient. I know it’s for carnivals, but I guess every day is a carnival 😂 DEFINITELY RECOMMEND!!!",
        "This brought back memories when I was a kid, so of course I had to buy one for my kids. It’s a great size for personal use and just a little bit of ice goes a long way. I fill it up with ice and it make about 2.5 servings so since I have 4 kids it takes about 2-3 min to make 4-5 regular size snow cones. It really is awesome ! If you’re thinking about buying , stop and just buy it!! You won’t regret it. It would even make the perfect gift to anyone really. (We had this over a month now and use it almost everyday in this heat)",
        "My boyfriend loves this he uses it ALL THE TIME it’s perfect at crushing ice. We definitely make a lot of snow cones with this & the kids love it too. Clean up is super easy. The cord is a good length too. Definitely recommend for anyone who is interested I’m not joking when I say WE USE THIS ALLLLL THE TIME",
        "This little snow cone maker was a pleasant surprise. I am very impressed with how well it shaves the ice, and how much ice it will hold. It is rather loud, but it is shaving ice, so it's nothing unexpected. My daughter loves snow cones and this is much more convenient than heading out and spending money at snow cone shops. I definitely recommend this machine.",
        "I really love this product and the way it looks and I want to love it so much but upon opening the package I already noticed the tampered sticker has been tampered with already (meaning it has been opened). When I took it out of the package the plastic was already open like someone just packed it right back up. I am sending this back and will be buying from the store instead.",
        "Absolutely loved this. I bought another brand machine first that cost more and had to return it. This one worked perfectly the minute I plugged it in. I will say I can use my standard ice tray but the smaller cubes ice trays I got from dollar tree worked great. It's a tad louder than I expected but it is so quick that minute of noise is worth it. I used it with the Hawaiian shaved ice liquids I had already purchased and it was perfect.",
        "We've had the snow cone maker for about two months now and the kids love it! We used it almost every day at first and still use it around twice a week or more and it still works great. We have used both bagged ice and ice from our refrigerator ice maker and works well both both. It's a little hard to scoop all the ice out of the corners but after it melts I just use a paper towel to wipe out the water puddles.",
        "purchased to bring to weekly pool parties - so glad I did! Very easy to transport but makes a decent amount of snow cones quickly without issue. Brought in for my daughters class and within 10 minutes or so made cones for her class of 20. Only slows down when I need to scoop and pack the cones - basically just limited by my speed. My daughter is having a lot of fun with it and it's pretty safe I think as the ice doesn't turn on unless the safety lid is in place. Works better than I expected so very happy after 8 months!",
        "My first review was revoked due to my youtube video review link. It is easily searchable though. I would say yes to buying this again. It makes great snow cones and for the adults the alcoholic slushees are superb! My gripe here is the scooper. It is more for ice and not for that typical rounded mound you think of when the words snow cone grace your aural canals. Well at least mine.",
        "Awesome purchase! We usually rent a snow cone machine for my daughter's birthday party in July ($50 for a weekend!). Last year, while putting ice in, she cut some of her fingers. Never again! I went to Amazon and found this machine has great reviews. I bought it, but was a little hesitant that it wouldn't work with so many kids. I was wrong! Quick and easy, and there is a safeguard on top that won't run unless it is on. We never used consistently for 5 minutes, but it made so many snow cones at once, we never had to. Definitely would recommend!",
        "Super cute design, and can make a goodly quantity of shaved ice for parties/gatherings. The best part is how easy it is to make keto-friendly treats using sugar-free syrups :)",
        "UPDATE: the company was gracious enough to send another snow cone machine to rectify the issue of the original one that arrived broken. We’re really happy with it. Thank you! ORIGINAL REVIEW: Arrived broken! I‘m uncertain of the easiness to clean, use and its noise level, since I wasn’t able to use it. Super bummed because we were really excited to give this a go",
        "My sister -in -law has one of these (an older one), it was great so I decided to buy one. The motor had a faulty bearing it was extremely loud. It was that loud even with no ice in it. So I returned it and got another one. No faulty bearing but the motor itself was so loud you can't hold a conversation next to it while it is running. My guess is they used to be good.",
        "Was a hit at 4th of July BBQ and kid's bday party. Made about 6 snow cones before having to shave the next batch of ice. Filled the top with ice 2x to make the 6 snow cones. Could probably have crushed more ice at a time but it was super hot and we didn't want the ice to melt before we served them up. Shaves the ice pretty quickly though.",
        "The snow cone maker is so cute looks exactly like in the description but I’m disappointed that it doesn’t work all that great. You can make only 2 snow cones and per the instructions it says that the machine over heat In fact right after the 2 snow cones it was already way too hot and I had to wait approximately 15-20 minutes to let it cool down",
        "We bought two of these around the same time and gave one to a family member. I kept the blue vintage one and I gave my niece the Nostalgia RSM602 in red. Her machine was shaving ice 4x better than this. I’m not sure if the motor I have in ours is bad, or if this model is just terrible at shaving ice. Regardless, if we are going to base this off of experience... I would NOT recommend this vintage blue model, I would get the RSM602 instead.",
        "Didn’t work too good. Doesn’t shave I’ve good and takes a very long time. Before uou put the ice in, you have to make the ice even smaller for it to work. I wouldn’t buy this again. It was a waste of money for me.",
        "This product is amazing! For the price it is totally worth it. My daughter loves watching the ice chopping and I personally feel the ice is perfect texture. Less than a minute and you have enough to make several cones. I don’t understand the negative reviews on this - I am so happy with this purchase!",
        "Awesome!!!!! I bought this for my son for his 8th birthday! He absolutely loves it and told me....Best birthday gift Mom😊❤️ It is an awesome snow cone machine. It is exactly like the Kona truck that would come to the school events. I also bought him all 12 flavors to go with it, so he has the entire snow truck experience. 😊",
        "The snow cone maker was everything that I was looking for. It was easy to use and within few 30 seconds the ice was shaved and ready to serve with whatever flavor you desire. The product itself was not heavy and very easy to clean and maintain. It probably took me 10 minutes or less to clean. The product is great for parties or any type of get togethers. I have used this machine 10 times for parties so far and it is still in great shape and still working like I just brought it. I recommend this product to everyone.",
        "We really like this snow cone machine. Delivered 4 days ago and we’ve used it every night since. As you can see by the pic we used a lot of ice - more than I planned on - so we got a lot of “snow.” The noise isn’t that bad, it’s ice being crushed so don’t expect something whisper quiet. I’d buy it again. Kids absolutely love it.",
        "About as noisey as you’d expect, nothing crazy. Was a gift. Has a major shipping issue trying to receive it, super delayed but once it finally came the 10 year old who received it as a gift loved it. She uses it frequently. Can get flavors at Walmart for the ice. Easy to pull out and just use quickly and then clean.",
        "Love this thing. My 3 kids eat snow cones everyday now. i think its worth every penny. So easy to use. No mess. Easy to clean. Just noice bothers me but acceptable. Door like other reviewers mentioned doesn't close easily and it may crack if you weren't gentle with it. The door is very poorly made.",
        "Wow! Bought based on excellent reviews for a party for my 9 yo we had yesterday. This little machine is fantastic. Made about 25 snow cones. Ice is perfectly shaved and so easy to use and clean up. Other parents plan to buy when they get home. No more expensive rentals for us. Used ice cubes from freezer and when those ran out used ice from a bag we purchased. Even if we never use again it was worth the cost, but I’m sure it’ll be used many more times.",
        "Got this for our grandkids,,,, sending it back it locks up and grinds the gears tried it with no more than 5 ice cubes and it still locked up sending it back. Yes it is noisy but we had had one years ago and it was lots of fun and we didn’t let the noise Bother us. But this is junk even the syrup isn’t syrup its favored water. I do not recommend this to anyone.",
        "Love this snowcone maker, had it for many years, finally motor gave out, so replaced with this one, because of the long durability of my old one.",
        "This little machine is great AT FIRST. After just a few months of using it it already won’t shave ice anymore. The blades just aren’t designed to go for long. I would have given it a nice 4 star review (decent bang for your buck) in the beginning but now it’s basically a useless piece of plastic.",
        "Absolutely crap!! Do not order!! I sent the item back for a return it was crap !! Will maybe make 1 or 2 in an hour time span, absolutely ridiculous!!",
        "This is a great little snow cone maker. It definitely does not make the fallen-snow Hawaiian shaved ice, but those machines are 5 times more expensive. This makes the snow-cone-in-a-little-white-paper-cone-from-the-80s type. It is loud, but also works fast so the noise doesn’t last long. Target sells cheap snocone syrups that are good.",
        "Works well. Makes quick work of ice-cubes and gives you more of fine shave that snow. Growing up in the great lakes area, I know snow. My only issue is that it's not very easy for someone with big hands to get in the box and scoop out the shavings. Otherwise, I would buy it again.",
        "My daughter, age 11, got this for Christmas and LOVED it. It was easy to figure out and made enough shaved ice for four small snow cones in about five minutes. The biggest gripe I have with it is that the ice is a little chunky and you have to chew it a bit. We shall see how it holds up but for the first run we definitely loved it.",
        "My ASD son wont drink water so I bought this to help him stay hydrated in the 120 degree heat here. It is amazing! It fits right on my counter, light weight, already assembled so all you have to do is pop on the little tray, and its quiet enough that it doesnt bother my son. Its quick and super easy to use with very minimal clean up. The cups are easy to wash and dont stain.",
        "was only going to give 4 stars but i love this sno cone machine. the door to get the ice sticks at times, but we never really use the door as its just easier to take the top off and scoop the ice out from there. the ice shavings are very tiny just like buying a sno cone from the ice cream truck. have had this for about a month now and our family has probably made the equivalent to about 80-100 cones or so and still going strong.",
        "I purchased this for my son's 5th carnival themed birthday party, this snow cone maker shaved ice VERY SLOW! had about 14 kids, and we couldn't serve all the children, it would have taken hours to make each kid a snow cone,it was unbelievably slow total waste of time and money, returned!",
        "Always loved snow cones and shaved ice ever since I was a kid. This little set up is so cute and makes a perfect snow cone. So happy with my purchase",
        "I bought this for my snow cone loving daughter, for her birthday. It’s cute, durable, works great, makes great snow cone ice, and is easy to use! My 10 year old can manage to operate it ally herself. Sometimes the ice container gets jammed, but it’s an easy fix. It doesn’t takes a 5 minutes or so to make enough ice for 3 snow cones.",
        "The best thing I ever bought. Saved sooooooooo much money. The whole family’s s sometimes friends enjoys it at least once a day. Best investment. Thinking about selling snow cones to the neighbors. Lol just a thought. It does exactly what it says it does. It doesn’t take too much ice. It’s easy to clean. It’s just water so I just use a paper towel after the last remnants of ice melts, or I let it air dry by leaving the door cracked open.",
        "I am an adult that loves snow cones and crushed ice. I bought this for my use and use it all the time. It makes great fine crushed ice. It is not like snow but I like the consistency. It is easy to use. It is a bit noisy, but not really any more so than other ice crushers I have had.",
        "The top plastic lock keep popping out very poor design. It's more like slush than snow. Beside that Amazon automatically replaced the item, that I can't cancel. That was the first never happened before since almost 20 years as a customer. The rule is stupid. I won't buy from Amazon anymore.",
        "We love this machine !! It was a big hit at my daughter's 10th birthday party, my elderly mother couldn't get enough of the snowcones. Thanks so much for helping to give my child and my guest a wonderful experience.",
        "I realize the item came from Amazon Warehouse but I did not know that I was buying a broken item. The item arrived early but was missing the instruction Manuel, the scoop, and the plastic cups. When we tried to use the item it would not turn on. Once we took it apart, my husband found that it had a blown fuse. We were supposed to use it for my daughters birthday party. Very disappointed.",
        "I bought this for a party that I threw for my daughter and it was a big hit!! Everyone loved it and was asking me where I bought it from. I’d recommend this for everyone and it keeps all the ice and water inside unless you don’t close the door all the way. This snowball machine is the best thing you could ever buy",
        "I purchased this for my nieces (4 and 6), and they love it! It’s super easy to use, makes fairly good ice (TAD bit chunky but perfect for unparticular adults or younger ones), and even comes with the perfect snow cone cups! They’ve used it many times and I’ve used it a couple times with them. I plan on purchasing one for my son on his next birthday because I might be a tad obsessed. Keep in mind it’s a snow cone machine not a super thin shaved ice machine. Suuuuper cute too.",
        "Got this for a high school graduates party! And was a hit, my kids are still using it almost 2months after",
        "My wife loves her snow cone maker. Purposely bought it because it can use normal ice cubes. It's pretty loud but for two people, it makes plenty of ice for pint sized snow cones. It'd do decently for a family with normal sized snow cones.",
        "It’s pretry. We used the house ice from my fridge but when You load it on top it get stuck and it was frustrating because the plastic that turns the ice will lift and get stuck and you have to pull all the ice out and reset everything again. It took over 20’min to make a dam snow one for the kids. Once it worked it cut ice doe two snow cones only.",
        "Very cute aesthetics, but some parts like the snow cone tray was very hard to assemble, and I'm probably never going to take it off in fear of breaking the whole thing. Also the machine is very loud when its shaving the ice and can be a bit of an annoyance. otherwise, gets the job done amazingly. Had it for about 2-3 months now and no technical problems so far.",
        "Bought as a gift for my 13 year old daughter. She loves it. We forgot to order extra snowcone cups and the icee mix so don't forget that when you order yours. But it works great, it's very beautiful, it's not noisy. We love it!",
        "Bought this. Used 2 times. Handled and washed delicately. Pulled down few months later and flywheel kept stopping and pushing ice container up...spinning its wheels. Terrible machine for 40 bucks.",
        "Its adorable and not too large and perfect for my daughters birthday party. We are doing a Hawaiian theme with Lilo and Stich and Moana themes mixed in. Those are her favorite movies and this will make the shaved ice/snow cones all summer. Wheels do not work they are just decor but I don't care about that it's too small to wheel around anywhere. Its perfect for a medium counter top appliance. Takes up more space then a crockpot but less space then a convection oven. But it is pretty tall so not great for under cabinets. Very well built.",
        "Thisbis the second exact product I have purchased. First one lasted over 15 years. My youngest son was so sad when the blades had dulled I bought another one. Works great for home use for several cones. A little loud chopping ice but so easy to clean. And it is so cute to leave sitting on the counter. This is the second one I have bought and I would recommend it.",
        "Easy as competitors to use. Last year I had the red one last year, which I prefer esthetically, but they are otherwise the same. Occasionally the blade casing needs reseated. If you can't get the lid on, unplug and reseat",
        "Really cool snow cone maker. Kids love it. Easy to use and lots of fun.",
        "Chunky ice is what it is. My blender makes better snow",
        "I just got this for my sister as a gift. This is really easy to use, just plug it in, add ice, and turn. I love how it came with 2 reusable cones and the scoop. Although, i got worried it had came broken or something when I first saw the package because it looked a bit beaten up but nope it came perfectly fine! For me the noise does not bother me, it is a bit loud (maybe as loud as a blender) and may bother others but as long as you dont mind the noise then I suggest you get this. Will update this review if anything happens.",
        "Amazing! I bought this for my sons birthday party and I didn’t set high expectations for it because I knew it was small but i figured it would be good for one time use. This actually blew me away with how well it crushed the ice. The snow cones came out amazing and everyone was asking how I found the machine !! Will definitely be using all summer !!",
        "I wasn't sure if this machine would actually be able to shave the ice to my liking, especially since it was so inexpensive. Well, it works fantastically! It shaves the ice exactly like the big machines do. I bought this for my kids for Christmas and even though it's been cold and rainy, they are still making snow cones every day! I've even used the shaved ice in my margaritas!",
        "It has kept up with the summer! My son bought this to sell snow cones like a lemonade stand. He obviously doesn't have a lot of customers so he doesn't need a professional grade. He makes his own syrup and earns about $5 each time so it works perfectly for what he wanted it for. It's electric (which we wanted) so he hauls out the extension cord too.",
        "This definitely does not make \"snow\", it makes crushed ice. I've tried this with several different types of cubes and in several different suggested ways and it DOES NOT make snow! That being said, it is quick and makes a decent slushy drink.",
        "Snow cone quality from this machine is awesome! Similar to Hawaiian ice. It does jam every once in a while when it gets stuck on a piece of ice & make a loud noise. I'd still say it is a great little machine for the price! *Updated review: the machine started getting jammed more frequently. It's a great idea but the design/construction is just not quite right. Because of this I am returning the machine & downgrading my 4 star to a 2. It was a good price but in the end not worth the hassle. Hopefully the company figures the kinks out because it could be a great product.",
        "I bought this for a picnic and it worked out fantastic! My mother really loved it! Very easy to assemble and clean, which is a must!",
        "There is nothing to complain about. This is a great product! Bought one for my snow cone loving fiancé on his birthday and we use it all the time! I would definitely buy it again if this one ever dies, but being that we’ve used it frequently for 6 months and there are no signs of wear, I doubt it ever will!",
        "I bought the first one as a birthday gift for my 7 year old granddaughter. It is operated by an adult. It grinds the ice well and is easy to clean. It was a hit at my granddaughter’s slumber party. She has had it for 2 years and it still works well. As far as noise is concerned, grinding ice is going to be noisy. I recently bought 2 more as gifts.",
        "We purchased this for our child's birthday party and it worked well for the small-sized crowd (15). One round of ice creates enough for three snow cones. The snow is on the icier side, not light and fluffy, but small enough for young kids to work their way through.",
        "Really easy to use! I use a small measuring cup to shape the top of the snow cone, otherwise it stays loose and crumbles off. But it's easy to clean (honestly, it's just wet!!) and it crushes the ice perfectly! I use the ice cubes straight from my freezer. I was worried smaller ice would be required.",
        "So far it is a smile maker for sure. My kids love it and I like that it’s easy to clean and maintain. I have only had it a few months and used maybe 10 times and so far it is holding up",
        "Leap watches with a snow cone maker for the kids when we go up north we bring it with us. The syrups are decent. If you have a couple of kids and you want to make them snow cones this is the perfect machine for it",
        "Great little machine and very sturdy. Held up to a while afternoon of Texas heat and lots of kids. No complaints as of yet. We used sonic type ice which was easy for the machine and worked fast. No issues at all great buy for the money. Definitely recommended. Makes the event more fun with snow cones",
        "Great snow cone machine I love it. I hate to write a review till I have used a product for a few times. This has worked well and I have used it plenty since this pandemic as I can not go out and get a snow cone from up the road. This this has been used extensively to say the least. Great product I would buy again.",
        "I purchased this product for my son's birthday. Honestly it didn't work very well, takes forever for the \"snow\" to grind up and lots of constant feeding of ice into it. Within a couple minutes I knew this wasnt going to work and instead made snow with my ninja blender. The product itself was very cute and nostalgic.",
        "I love how quickly it makes snowcones its fun for the whole family! I used ice right out of my fridge. It is a little noisy but it is super cute on my counter! Good value for the price.",
        "Good product for household use. I does take some time to shave ice for one small 10 oz. Cone. If you plan on using it for a small household party, you will be shaving ice for a while.",
        "Easy to use. It on the top you twist right to open put the ice in a left to start it. It is a bit loud but it’s a snow machine. The bottom when plugged in keeps the shaven ice cold. Easy to clean."
    ]
}