{
    "entity": "Deep Fryers",
    "text": [
        "This deep fryer works extremely well! I fried chicken and fries using it so far and they both had the perfect amount of crisp to them. This deep fryer does not smoke out the house or give off the smell of fried food throughout the house. My husband was sitting just a few feet away while I was using it and he didn't even realize I was frying food until I handed him a plate. It is also worth noting how safe it is to use. I didn't have to worry about grease flying all over the place! This deep fryer is a must have!",
        "I brought this my niece who wanted to sell chicken wings and fries on the weekends. First weekend it worked great, second weekend plugged it up and it didn’t come on. Hit the reset button on the back and it came on. It didn’t work as great as the first time using it, temperature seemed to be off and not as accurate. Third weekend it never came on no matter what. Therefore I’m only giving 1 star for the only weekend it worked great",
        "The fryer is excellent. This is a great replacement for my Waring that I had. It’s bigger and fries more food and comes out just as crispy as the Waring. The problem is that the handles on the baskets come off too often. A real pain when you are trying to retrieve your fried food! There is only one way of attaching the handles and for some reason they totally come unhinged. Not a deal breaker but a pain.",
        "I just loves it, heats up real fast fries awesome and tenderizes your meat its great quality",
        "Cooks great. Heats up to 375 degrees F in 14 minutes. It should have an audible alarm to let you know when the set temperature has been reached, but it doesn't. You have to stand there and wait until an orange LED light turns off, which means your temperature has been reached. Also, be careful removing the inner grease pan. It's lip is extremely sharp. I cut my finger on it the first time I tried to remove the pan. They should have rounded off the edges so this couldn't happen. No audible alarm, and sharp edges, minus 2-stars.",
        "This fryer worked one time, the 1st time, and it was great. The 2nd time it barely stayed warm and the 3rd time it would not turn on at all. Do not waste your money! Spend the extra money and get a better brand or you will be just as disappointed as I am. Not only did it stop working, but I missed the cutoff to return!",
        "Save yourself some money and get something else that works better and wont disappoint you. Unless you expect 1-3 use out of it, then this is for you. We used it mostly to fry fish, big surprise the 4th time we took it out. It just didnt work, and watch it if it wasnt the 3rd, im just being modest. Now i'm out of warranty/return window and this thing is looking almost unused. I'd be more careful buying electronic appliances.",
        "I will change my star rating after I use the fryer. I just want to say that it arrived really quickly which was pretty amazing. It took me a while to figure out how to assemble everything and it's because the instructions aren't great. I have a Ninja Foodi cooker and can't wait to cook up some wings in that and fry up some curly fries in the Presto fryer. I also want to make egg rolls. Frying egg rolls in a pan on the stove is a smokey mess but I figure they will be fine in the deep fryer.",
        "This little fryer does a decent job of frying foods if you don't put in too much. That said, there are couple issues which come with the cheap price. Most important is the oil basket has a dangerous sharp edge all the way around. This is ridiculous and I'm amazed presto would put this out as a finished product. WASH WITH CARE! Also the way the baskets rest on the pan is very sloppy. This I will do an easy modification. If presto gave a little more attention to simple details, they could have had a 5 star fryer. I give it 3 & 1/2 stars.",
        "I couldn't decide between 3 or 4 stars because I really want to like this product. The outer shell is pretty flimsy and can get pretty hot. But it is convenient and easy to use. The recommended temperatures in the instruction manual for cooking certain meats is off – seemed too hot. It served the purpose for frying chicken wings, just had to reduce the temperature. Not sure I would buy it again.",
        "I use this fryer for fish and chicken. It keeps up great for a little fryer , if you have a hand full a people over , frying for a small party it works great ! The clean up is great also because it all fits in the dishwasher , just hand wash the electrical parts not bad. The only thing I wish it had is a timer , that's it. You can never go wrong buying presto , I have always had good luck with that brand",
        "We bought this deep fryer to replace the one we have had for years. The difference in the quality is unbelievable. The old one is made of sturdy stainless steel - the new one is tinny and the cover doesn't sit properly on the pot. Probably made in China like everything else we purchase these days.",
        "My husband wanted this for his birthday, so I did my research and found this one to be the best one on both functionality and size! It is easy to use, just follow the directions on keeping the plug away from the fryer. The fryer needs to have a good space so that the cord doesn't get crammed up, running the risk of melting it. We've fried so many different things from Chicken to okra to vegetables etc. It has been so easy to use, highly recommend if you love fried food. It's the best and worst thing because it's hard to stop frying things once you've started lol",
        "Did donut holes and buffalo wings the first day it arrived. Came to temp quickly maintained temp well considering it's a counter top unit and doesn't have the thermal mass of a commercial unit. I am very pleased with the construction, the instructions and abilities of the unit. I cook using gluten free flours because of Celiacs and the flour burns quickly at higher temps. Being able to fry at 325 instead of 375 is an important requirement. This unit performed wonderfully.",
        "I'm so happy I made this purchase!!! It's my second favorite kitchen appliance. I use it at least once a week ...chicken tenders and fries are on the Friday night movie night menu almost weekly. It does a great job, easy to clean and store",
        "Used three times over the past three months, and it has already completely crapped the bed. Just completely stopped working while I was in the middle of frying my first batch of food for Christmas dinner. Ruined my holiday meal. I followed all of the reset instructions and even waited days later to test it out again—still inoperative.",
        "Nice looking unit that ties in very well with the other stainless steel appliances in the kitchen. I like the two baskets as me and my son like our fried items different, and one batch can be left in longer than the other. So far have just made homemade potato chips and french fries and both really came out well.",
        "OK if you have tons of people who eat the same then yes it is nice I have had mines a while It is still nice but only reason I gave 4 stars was because I don't eat fried food often in I winded up getting a smaller one which is much better because I don't make ton of food",
        "These were purchased for a concession stand at a softball field. We use them for chicken nuggets and french fries. Once at temperature this did a very good job of frying our food to a nice and crispy outside, while heating the food all the way through. It took about as long as all product instructions said it would. However, it really started to take longer to cook each batch, if the fryers needed to be used to make numerous batches of food consecutively.",
        "Ours has died but it put in a decent service life. I think by the time it was said and done, I preferred deep frying in a big stock pot. My biggest complain/wish/grip was that you would have to order the single big basket separately. The two little baskest were too small to really fry up a mess of fried chicken.",
        "I really like this deep fryer. It's easy to use, keeps an accurate temperature, and can fit a lot of food. It is large so it does require a lot of oil. It has 3 main components to clean: the baskets, the basin, and the control panel with heat element. All the components come apart easily and it stores easily. The electric cord even comes off and can be stored inside. The directions are thorough on how to use and clean. Definitely satisfied with this purchase.",
        "To those who said the temperature couldn’t reach 375’ I suggest you find the reason why elsewhere ! If anything you might have to dial it back a bit. It registered 385 after about 15 min. This little gem will deep fry onion rings, French fries and a host of other delicious foods. I love this thing !!!!!!",
        "Works as expected, love that I can fry boughten food or make my own homemade French fried or chicken fingers. The baskets come in handy and make is so much easier to use. This is actually my second I purchased from this company and have one at the house and one at the cabin",
        "When I turn it on the red light comes on and I Waited for green light to show up It never did. After a certain amount of time I decided to put A few pieces the chicken in anyway. After a chicken cooking amount of time, frying. certain parts of chicken cooked other parts were not done.",
        "The cooking temperature was not accurate. Not sure what the issue is, but when I made fresh French fries with my old fryer, they were perfect. Used the same recipe, temp and cooking time w/this fryer, and the fries were dried out. I think the cooking coils run too high.",
        "I was excited to buy this fryer after reading the reviews. I was disappointed when I tried to fry chicken in it. It would look beautifully golden brown but not done on the inside. If I cooked it long enough to get done inside it would be to dark on the outside.Actually it would be burned on the outside. After modest use for a year and a half it never heated enough to cook things without making them greasy. I am really disappointed.",
        "Good little starter fryer. Decent capacity and build quality is ok. The plastic top is a little flimsy but don’t plan on having that on unless not in use. The temperature control knob is not really accurate but within 10 degrees or so. Also would have been nice to have one additional large fry basket.",
        "I use this fryer every day and clean with grease grease every day. The lid Is NOT easy to clean ! Also the temp runs about 15 degrees under what you set it at . BUT I wouldn’t have any other fryer it’s better then my commercial fryers for smaller item such as wings , mushrooms, sweet potato fries",
        "Very happy with this products - it is a 3rd machine to supplement what we already have and is used by non-profit at fairs making doughboys and it is just what we need to keep the line moving rapidly.",
        "Great deep fryer. Heats up quickly. Was able to grab handles without a mitten. Chicken tasted great. So far, no complaints. BTW: This item is huge, not hard to clean just a lot to clean and requires a lot of oil.",
        "Very convenient, and the design is good. Only problem is, I've eaten way too many fries, tater-tots, and home made chicken strips! I'd better cut this review short, and go for a run! Lots of nice touches, like a quick-release, magnetic power cord. It's designed so 1 gallon of oil equals the perfect level for safety. Easy to clean without leaving a filmy, greasy residue.",
        "I CAN DEEP FRY FRENCH FRIES AND TOTS WHENEVER I WANT. And it is glorious. This thing is easy to set up, easy to use, and I love having it in the house. My doctor probably won't be thrilled, but I'm pumped about it.",
        "This deep fryer has a huge capacity, but the baskets are small in comparison. However it’s heats up nicely, and regulates it’s temperature well. The baskets aren’t super easy to clean but if you have a brush or something it maybe easier!",
        "Can't use CRISCO or any other hydrogenated oil. Also, it auto shut off before I could fry 2 chickens because of the heat threshold. Finally, has no drain - super pain to clean. Spend the extra money - get a 20L fryer that has a drain.",
        "If you want a cheap ass fryer buy this made in china crap. It works but expect to cut yourself on bent sheet metal while cleaning. Every time I use it I get cut when cleaning, if I had more time I would take them to small claims court because the cuts hurt like hell.",
        "I bought this for my mom to be able to fry fish because they eat fish often and she loves it but it takes 20 minutes or more to get the grease up to 350 degrees which is frustrating. Other than that she loves it. We will see how it goes from here but so far that's her only complaint other than she wished the cord length was longer.",
        "I was a little skeptical about this purchase but, after using it, I couldn't be happier. The maximum temperature is 375 and I was a little worried that it wouldn't create the crispiness or crunchiness that I sometimes desire but that has not been a problem. The dual baskets make it possible for me to now cook enough at one time for a meal instead of having to cook 2 or 3 batches of something. It also has easy cleaning features as you can simply remove the heating element and then remove the black container from the fryer itself for convenient disposal of old oil and washing to get rid of all of the grease. A definite recommend!! :o)",
        "Came in excellent condition. My only criticism is that it wasn't shipped in a plain box. I would have preferred if no one knew what it was. In case I wasn't home and someone saw it on my porch and wanted it",
        "This is my second deep fryer, first one was a T-Fal many years ago. It was excellent! My only complaint is this one does NOT get the oil up to the temp advertised or on the dial. I've measured it with two different thermometers on three different uses. High = 325 degrees F. The good things about it are it is easy to clean, and being able to use it on the patio means the house doesn't smell like fried food.",
        "Love the fryer. Temp control is good. The food capacity is good. Made homemade chips for a family reunion recently and they came out perfectly. Saved the oil to fry chicken strips, was amazed to find the oil still at the max level! Would buy again!",
        "It works well, the only think I don’t like is the fumes and it makes my eyes burn. I wish the cover could be used during cooking to prevent this but it says to not use it while in use.",
        "Got it for my mom and she really likes it! She makes empanadas very easily. She said it takes a little longer to get to the temperature she wants but it works great!",
        "Kinda cheaply made. It does its job though. Would order a different one if I was doing it over.",
        "I really wanted to give this 5 stars. I got this specifically to make cannoli shells. When trying to fry more than 2 at a time, the temperature quickly drops (could easily fit 5). While it does great with just 2 in the fryer, it is going to be very time consuming to fry 40-50 each batch.",
        "I absolutely love this deep fryer. It works very well and is easy to clean and easy to store on my countertops.",
        "What a great fryer! It is definitely a pro series that makes you feel like you are producing top chef foods at home! It was easy to assemble and left the food crispy yet juicy on the inside. It takes a few minutes to heat up is my only complaint but it is insignificant when the results are so great! I highly recommend buying this fryer if you enjoy frying regularly. Two baskets make it able to cook more and make managing two different fried items with ease!",
        "This is a convenient product. Heats up quick, and cooks food to perfection. I use this fryer to cook chicken and fish. You can also boil seafood like lobster and steam veggies!",
        "this is a great fryer! Holds temperature well. Perfect for fish fry, wings. I use this one for bigger cook's and a smaller one for me and the wife.",
        "I bought this for my dad for Christmas and he is in LOVE with it! He used to be a fryer way back in the day so he knows how to use this kind of machine (and he knows a good one from a bad one!) and he loves this for making simple, smaller meals. We've made everything from donuts to spring rolls to chicken fingers in here and it works perfectly every time. The dual baskets are great for making meals like chicken and fries.",
        "I just got it and only used it three times but so far I couldn't be more pleased. It works exactly as it should with no problems. If something happened to it today I'd order another in a heart beat.",
        "I had fryer before..from Europro. It was hard for me to clean. I couldn't remove the pan and caused the fryer filthy after a few uses. Oil became rubber sticky and goey...on all the service. But this one you can remove one buy one and easy to attach again after clean. I was worried about few people reviews about the temperature. I tried a few times before wrote this reviews. Oil inside the pan hot as the temperature said, but I stirred to make sure and all the food I cooked turn out really good and didn't soggy at all. I'm glad I decided to buy this fryer",
        "Is really easy to set up and is very clear with instructions and hassle free when cleaning the product and storing it away, somewhat light weighted and very safe for adults that have precaution!",
        "I have had this item before and use it all the time. It makes the best French fries that my family loves. I wouldn't fry any other way.",
        "Soon as I cut it on it sparked with fire, cut it off and never used. Very dangerous",
        "Had a family outting with a ton of items to fry and it would not work on its second use would not buy",
        "One of the best I have used so far, kept temperature very well. Do not over fill, it pooped like crazy and spilled oil.",
        "We love this fryer. We love fried foods and are always looking for something that just just serve one person at a time! We cook full wings in here, homemade chicken tenders, fries.... It holds a ton of food. Since it is bigger, it takes up a bit of space, but we keep ours out in the garage. Two baskets allow you to cook two different things at the same time, or stagger your cooking. This fryer is not for those who will just use it occasionally, this is for the person who will use it weekly or daily!",
        "Love everything about this Pro fryer, will order another one soon for back up!",
        "I like having double baskets. It doesn’t get as hot as you think it would and the only way it shuts off is unplugging",
        "I really like it, my only complaint is that the baskets are small. But it'll fry up anything you want with excellent color and not greasy!",
        "Does the job, but when they say don’t put the lid on for high moisture foods they really do mean it. The plastic on the vent grills warp when they’re exposed to any amount of steam. Luckily the max fill level is low enough that you won’t have to clean up too much splatter.",
        "I was worried about getting this fryer and I am in love! So easy to clean, temp is just right. LOVE the baskets and handles.... I just love this darn thing!",
        "Product quit heating up after the 4th use. Troubleshoot it. Pushed reset and nothing! Barely used! Do not buy! I should have heeded prior negative reviews about it suddenly quit heating up!",
        "I PURCHASED THE PRESTO 5466 0PROFRY STAINLESS-STEEL DUAL-BASKET IMMERSION-ELEMENT 12-CUP DEEP FRYER AS A FAST AND EASY WAY FOR ME TO FRY UP MEALS FOR MY LARGE FAMILY. I LOVE THIS MACHINE. THE ONLY DRAWBACK IS THAT IT TAKES A LOT OF OIL TO FILL THE WELLS, BUT IT FRY'S EVERYTHING CRISPY JUST THE WAY MY FAMILY LIKES IT AND IT EASY TO ASSEMBLE AND CLEAN UP OF THIS MACHINE IS A BREEZE. THE CONTROL KNOB ALLOWS FOR EASY HANDLE OF THE TEMPERATURE THAT YOU WANT AND THE LID AID IN THE NON-SPLATTERING OF THE OIL WHEN FRYING. THIS WAS A SENSIBLE BUY.",
        "This is the best! I use to have a fry daddy until the handle on the basket broke. Looked for a new basket but the basket is as much as what I originally paid for the fryer! (even on ebay and craigs list!). Heats up quickly and easy to use. Love that you can fry two items at one time with the individual baskets. Easy clean up as well. Fast ship, excellent condition upon arrival!",
        "When you use this make sure that they they little black thing make sure that it makes aclick when u put it on because if u don't put the right way it what come on and make sure that you use 12 cups grease",
        "I have had this exact same one for around 15 years. It finally played out so I bought another just like it. It has a few small updates but it still works as I expect it to work. Hope this one lasts for 15 years.",
        "Mediocre, cheaply built but also cheap to buy. Struggles to maintain temperature thus you result is soggy greasy fries and Tempura",
        "Works as it should we had the single basket version of this one and now with it being extra wide we can drop about 20 wings at a time and have them all come out perfect. Comes with two small baskets as well as a big one which is awesome.",
        "I ordered this deep fryer based on the previous Amazon customer reviews and I could not be happier with my purchase. I fried tater tots and popcorn shrimp the day after I received my order and they turned out great! The temperature was fine. I monitored my temps using a Maverick digital oil thermometer and the Presto Profry kept it right on the money with quick recovery times after each fry batch. The cleanup was easy. My initial impression is GREAT!! Hopefully we will see years of trouble free use.",
        "I am pleased with the performance of the Presto fryer. It does a great job on french fries, I haven't used it for other foods yet. My only complaint is the handles on the unit could be a little beefier. They are very thin and hope they last.",
        "Great purchase. Really coming in handy during quarantine with 4 kids. So easy to use - my 11 and 15 year old use it daily to make nuggets and fries. Very easy to clean as well.",
        "This was perfect for our small business. We put it right to work, the same day we got it and used it for 6 hours nonstop. It cooks fast and efficient. This would be a great addition to any cooker.",
        "Can now cook family size hot wings all together. That way wings are still hot when time to eat. Before had smaller frier so would have to cook couple of wings at a time. Which meant first batch start to get cold. Only problem I see so far once I put wings in temp drops and never got back up to 375 like it should have for wings. I just then cooked a little longer to make sure they were cook. But easy to tell when they are done.",
        "Great. Just learning how easy to use and clean up. I wish it came with a bigger single canister.",
        "does a great job - gets hot fast, can do one or two loads before needing to heat up again. the plastic on the top warped a little bit when we cooked brussel spouts - more our fault though - it says don't use the top with high moisture items like potatoes - i just didn't know brussel spouts were also high moisture...",
        "I have had two of these fryers that each lasted several years. This one only lasted 2 and a half months. Sad that I have to spend more money on another fryer for one that wont operate properly.",
        "Did I just buy a Presto?? Yes I did and I am happy with my decision. I have used it several times and it works like a champ. I have a large family (7) who eat a lot of food. It being the largest fryer I've ever had cut frying time in half. It is big, so if you don't have space, opt for another. If you got space, bigger is better (at least that is what my wife says). I've had 3 other fryers in the past couple of years that cost a lot more than this one did, and Presto is the winner.",
        "I was so excited to receive this item. I quickly put it to use. I fried catfish & fries. They cooked up great!! After reading previous reviews regarding the inconsistent temp of the cooking oil, I made sure to stir it prior to placing the food items in the basket. Second time I used it, I fried jumbo chicken wings. Man they were delicious. This fryer is a great time saver. Note that it uses approximately 5 cups of cooking oil in order to immerse the food. Good choice & well worth the money.",
        "I don't deep fry very often, but this works really well. Comes apart easily to clean and easy to store. Stable on the counter top, but need to make sure the handle on the top of the cover is securely in place before you heat up the oil. Make sure the handle on the cover is all the way into the slot or you could easily drop it.",
        "I only wish this had a drain feature. Even cooking, fairly simple to clean up, but getting the oil back out can be tricky.",
        "I use this as often as I possibly can. Works perfectly except for one minor inconvenience: it's a serious battle to pour the oil out of the fryer once done. Wish there was a little spigot along the bottom like an ice chest to drain the oil. That would make it much easier to handle, especially if one wanted to pour it into a container for future use. Otherwise, excellent product!",
        "It was great for the first few months. It stopped working right after the return window.",
        "We love this fryer. We held out and tried air fryers and didn't like them. We opted for this product and it is wonderful. It allows us to cook more than one thing at a time. It is not too bulky and it is easy to clean. We love it.",
        "Easy to use, easy to clean and works well. I like the large size and that there are two baskets, you can also order a large single basket.",
        "I love it! Having two baskets is fabulous. Whatever appliance you decide to buy, make SURE it's certified by UL (Underwriters Laboratory) for your safety. My last fryer was not UL certified and it suddenly burst into flames and I'm here to tell you, you do not want a grease fire! I had to call the fire department.",
        "I already have one and I am very pleased with it so I purchased another one just to fry my fish only",
        "Have already used this fryer several times and am very impressed. Large basin with two baskets allows for cooking more things at once and saves time overall. Old fryer did not have a basket, and it's a great feature to have. My only negative would be they don't include the large single basket. You can buy it separately, but only the two small baskets come included. I would have paid more to have it included. other than that, this is a great product and you won't be disappointed.",
        "Very happy with this product! It makes frying food much easier.",
        "I liked the eveness of temperature and the fish was cooked evenly. I used it for a fish fry at church",
        "It's difficult to get an idea of scale when looking at this online, so you may want to measure out the given dimensions on your counter to get an idea of how big this thing is, and where you're going to store it when not in use. I think if I would've thought that through a little more, I might've purchased something smaller. That being said, I can't complain about the frying quality. I also like the easy cleanup. It does require over a gallon of oil, so you may want to buy that at the same time.",
        "Really great for the price. I have never deep fried anything in my life, but my fried chicken came out perfectly. Extremely easy to use and clean -- I have no regrets about this purchase.",
        "This is the second time I have bought this fryer. Our first one which we had for 5 years did not make the move to our new house. This was one of the first things that we ended up buying when we moved in as we realized how much we do use it. The only thing I can say against this, is that I wish it came with the bigger basket as well.",
        "Sadly, mine will only heat oil to 350 degrees, even after I modified the temp sensors. It's not hot enough to do a good job. Next I will void the warranty and attempt to modify the thermostat. <Edit> I take it back. Oddly, I put the cover back on and when the thermostat kicked back in it heated the oil to close to 400 degrees with the top in place.",
        "Not bad take a little long to heat up but overall it is pretty good",
        "I have used the Presto 05466 several times and have the following to offer: It heats very well and maintains the heat level reasonable well. Three things could improve the cooker. 1. The arrow on the temp. knob which indicates the temp selected should be white not black on a black knob. 2. The handles on both sides should be solid so that it would be more comfortable when carrying the cooker when filled with oil. And 3, The tank edges where you are instructed to lift out the tank should either be more rounded or have an edge covering because the present design presents sharp edges.",
        "Basically pleased with this product. The only con I have is that the baskets are too small for frying chicken. When eliminating them the heating element leaves a burn mark. I expect that purchasing the large basket will resolve this issue. Otherwise we are enjoying it immensely!",
        "Works fine. We're not craY aniut the cord that comes off easily, but maybe we are in the minority. It has detached and we weren't aware. Very frustrating.",
        "Had problems with the magnetic cord staying in place, the first time I used it. The magnetic cord would not keep constant contact thus the oil was not always up to the 350 degree setting. The french fries took for ever to fry and chicken too...not impressed with this fryer because of the cord not keeping in place. Otherwise, the fryer has many features that are great.",
        "I couldn't put it together. I told them that I don't want products that needs assembling"
    ]
}