{
    "entity": "Deep Fryers",
    "text": [
        "We finally used this and the divider melted. Hard to see, but the black part literally slid into our french fries. I will be contacting Amazon and Presto for a refund and perhaps a recall. UPDATE: Presto made me provided several photos, serial numbers over the course of several emails. Then offered to replace the part that melted. No thank you, why would I risk ruining another meal and let toxic smoke into my home I am done with the Presto brand. All for a mere $45 refund. Well done Presto.",
        "Very nice size for a family wanting to do side items or cook a couple of large items at once. We don't fry a ton, but what we do for egg rolls, okra and other vegetables has worked well. I have a round splatter guard in case but I have not used it yet due to no splattering.",
        "Love the dual Daddy. Needed a new Granpappy and saw this. Works great. Did fries on one side and chicken strips on the other. Removed divider and use for fish fry. Perfect!",
        "Larger capacity than the standard fry daddy. I can fry a complete chicken in just two sessions. Fry the first 1/2 in 15 minutes. Then put the 1st half in a warm oven and do the 2nd half.Voila! fried chicken in 1/2 an hour.",
        "I love the fact that you just plug it in wait 15-20 minutes and you are ready to go. My son is addicted to crinkle cut fries and I must admit this DualDaddy makes them crisp and amazing in about 6 minutes. I have used it to make homemade and frozen chicken tenders and they come out awesome too.",
        "So much fun to use a deep fryer to play around with cooking a different way than the usuals. I've been frying all sorts of things in this fryer since I got it, and it's great to have the larger size to try cooking larger pieces of food. I love that I don't have to adjust anything - just plug it in with oil at the fill line, and wait 15-20 minutes for the oil to hit temp, then cook. I found that waiting a full 20 minutes gave me best results and got just to my desired 375 degrees using peanut oil. 15 minutes wasn't quite to temp but close.",
        "Size is great. Not crazy over the electrical plug. The way it connects to the deep fryer does not impress me. Sometimes you have to giggle the plug to make good contact. The inside finish is much better than the older gran pappy deep fryer.",
        "I've owned several of these DualDaddy deep fryers. They're easy to use and work really well. They come with a lid so the oil can remain in the fryer after using it. Cleaning is a little cumbersome because you have to hand wash it being careful not to let water get in it from underneath. It's good quality and I'm very happy with mine.",
        "I had a Fry Daddy I bought at Goodwill that I used for years and loved, but it was too small. Enter DualDaddy. Great price. Perfect temp control. Awesome wings. Big enough to cook for everyone. I've had a few fryers. This is the one. So easy to clean. If it's really bad you can boil water in it for a couple minutes. Wipe it clean. I would give it 6 stars if Amazon let me. You just can't go wrong with this brand and this fryer. Cheers.",
        "We love this, it was a replacement for one that was about 15 years old. Works perfectly",
        "Very much like the ability to fill with oil plug in and attend to other duties while it warms. No running over to adjust temp or check thermometer.",
        "The size. Just the biggest size of a great fryer. Easy to clean and use.",
        "I purchased this as a gift for my parents. They had searched several avenues with no luck in finding a large fryer. I found this on Amazon. I thought the dual fryer option was a great idea for fish fries or for appetizers. Also, if a larger portion needs to be prepared, then they could remove the divide and just utilize the entire space for their food of choice. After presenting the gift and utilizing it several times, my parents have given me nothing but rave reviews of this product. They are so pleased and happy to have their fryer back, only this time larger and capable of handling more food, saving them time when cooking and entertaining. THANKS AMAZON.",
        "I have purchased several of the deep fryers, 2 for myself and gifts for others. It’s the perfect fryer and easy to clean. I love love love this fryer. From frying empanadas, to fried chicken, to seafood you name it. I never use the separator as I like to fry a lot at once but that just me. Definitely recommend!",
        "Frying fish creates a very bad smell, thats why I use this to fry fish on my porch and keep the smell out of my house :)",
        "I purchased this for my daughter in law. She’s used this every week since Christmas. Fries, chicken wings, cheese sticks and much more.",
        "Very nice pacjage arrived as deacribed and works very well nicely made duarble easy to use",
        "This Deep Fryer has done great work for the price. It is extremely simple, just plug it in and it starts heating up. It comes with the lid and sifter thing that comes in the picture, but you might want to get strainer separately. This can cook a decent amount for 1 or 2 people. It is perfect for 1 person at this size, but I've fried for more as well. The divider is really handy. There is no temperature setting on this. That's all I can think of.",
        "Family loves this. We fry alot and we love the divider",
        "Been looking for a big deep fryer that doesn’t take up to much space!",
        "This fryer is awesome. It fits a lot of stuff in it. There is a divider that you could put it in if you want to fry 2 things at the same time.",
        "Very good fryer. It cook like a big fryer. I love it.",
        "My friend had one and I saw how durable and easy to use it was so I had to get one for myself. I had another deep fryer with the coils in the bottom and this is a lot better than that one.",
        "I love this thing I purchased it for my hubby and had to hide it he was using it so much. money well spent!",
        "Love this fryer! It's my second time buying it! No problem from the last one, just moved and didn't feel like taking to time to clean up all the oil so I could pack it away so I gave it to a neighbor that needed one and bought a new one when I got to my new place! It has room enough to fry 5-6 chicken thighs at the same time, or with the divider, you can fry 2 or 3 pieces and french fries all at the same time! Will definitely buy again if I have a need!",
        "I bought this product a month ago and it just stop working in the middle of me cooking. I plugged it up in another socket and it still did not work. DO NOT BUY THIS PRODUCT.!!!! WASTE OF MONEY!!! Now I have to go out any another fryer.",
        "The lid does not stay on, otherwise it works fine",
        "I like the size - the ease of cooking in it - cleaning it and results of food cooked",
        "This is the best fryer I love that it is strong and If I want to fry 2 different things at the same time I can",
        "I absolutely love this deep fryer! This I the 2nd one I've purchased & will gladly purchase another one when the time is needed!",
        "Very nice, has a divider you can fry 2 different items. It's very big also.",
        "I bought this in trying to down size some from what i had this is a little bigger then i wanted but i like the divider it has so you can make Fries Nuggets, Patties or whatever all at once and the spoon that comes with it is super neat it fits well and easy to clean. So if your looking for a change sure i would recommend this. Oh Also got this on time..",
        "We use it daily. This is a Quality Product. Size is great for large portions.",
        "Great size and temp gets pretty high. Only down side is you cannot control the temperature.",
        "Love the size and the material its made of. Wonderful that my neighbor has ordered her one for herself!",
        "I bought this as a gift and it was very well received and used frequently. No issues with anything, basic design and the divider is awesome, food tastes great. I would buy one for myself.",
        "It’s was working good then one day it’s just stop working",
        "I used it for egg rolls and it came out perfect, recommend to buy it and not so expensive. 👍👍👍👍 The only I didn't like is the lid, it's plastic other than that everything is great",
        "Almost impossible to scoop out food or clean due to shape of sides and no basket. Tiny capacity. Don't buy.",
        "We love the fact it can be used as a large single fryer or a double fryer.",
        "After trying and returning two other fryers I can say the sometimes the simplest solution is the right one. This one works GREAT.",
        "I have had this same model through 2 moves, and decided I just needed another. Great Price, and love that I can use it for 2 different food products at the same time. So glad it's still in production as the newer models.. they are sadly bad, we took 2 back then found this one on Amazon! yeah!",
        "It’s large But has a small heating element in it so difficult for it to keep up if you cook and large capacity. With a unit this size it should have a larger heating element to be able to keep up",
        "I still had one of these fry daddys but I bought an extra for me and one for my niece who had to cook a lot for her father. So I guess you could say, I don't like it-----I LOVE it....",
        "Great fryer for the money. I had one that lasted several years before it gave up the ghost and quit working. This is a replacement one and I hope it last as long as my first one.",
        "This is really handy for cooking two kinds of fries, or fries and onion rings at one time. With the center seperation in there, You can't cook a lot of both things, but enough for two or three people. It is quite large if you are only frying one type of food without the center piece in there.",
        "Excellent retention and recovery of frying temperature with normal batches. The increased capacity of the Dual Daddy increases quality by reducing the urge to overload the fryer to make dinner on time.",
        "Very happy with this model a little extra wattage on this one fries everything up real good. Easy to disconnect the cord held in by magnet easy to clean",
        "Fits a lot of chicken in it, takes quite a bit of time to heat up the oil though. We have a fry daddy and just wanted to upgrade so we could do more at once. Works well",
        "Very easy to use since you do not have to worry about the temperature. You just plug it in, wait a few minutes after putting oil in and it is ready to go.",
        "It gets a little bit hotter than I’m used to. I have had to unplug it when it gets over 400* Other than that it’s a great product.",
        "I didn’t like that there’s no way to control temperature. It gets very very hot fast. The lid won’t fit on it after use.",
        "it's a good deep fryer for a first time user. I was a little disappointed to not be able to control the temperature, but for what I needed it to do I'm satisfied",
        "There is no temperature adjustment makes it harder to use.",
        "Really Good for frying but didn't realize there was no temp control like my old one.....that bothers me for some reason....don't know why.",
        "works great and takes no time at all to heat the oil",
        "This is my third one in 25 years or so. Love them.",
        "I only used it 3 or 4 times and now it doesn’t work sooooo upset ..... I can’t even send it back . It’s not like my old fry daddy ☹️😡",
        "This dual daddy fryer is great, you can fry fish on one side and fries on the other side. Far better than a regular single side fryer.",
        "There is no temperature control. Though the divider is convenient to have it, of course, makes the frying area small.",
        "Love that 2 different things can be cooked at once, such as fries & chicken strips for example. Really easy to store with the lid.",
        "Ok little fryer but would be better if it had a basket and a lid.",
        "We've had these things since the little ones first came out. When our last fry grandpappy finally gave out, we got this over-sized one. Have never used the divider, but it looks like it would work just fine. The only thing I don't like about it is the magnetic power cord attachment. It isn't the old friction stick-it-in kind of plug, but it's never came loose since we started using it. We really like the extra room in this deep fryer.",
        "This is my second purchase of the same fryer. I had my first one for years. It still works really well. Quality product.",
        "I have been looking for another deep dryer.. and found it! Just wish it was a little larger!!!",
        "This gets a lot of use in my home! great tool",
        "I never had a fryer and don't know why I waited so long to get one! This is awesome! Heats up quickly and fries to perfection!",
        "How can you go wrong, same as original but bigger and able to separate two foods at once.",
        "Bought this for my mother and she loves it. Has a separator down the middle that you can also move in and out for a bigger cooking area. Great buy",
        "Very good for deep frying. Luv it & the size!!!",
        "This fryer cooks Awesome it was what I was expecting or hoping it to be.",
        "This fryer is so simple...just fill with oil to the line and plug in, and give time to heat up. It makes great chicken wings, french fries,fried zucchini, and fried mushrooms. It even makes great funnel cakes! To clean, simply let cool, pour up oil into container, and clean inside with warm soapy water",
        "I had one of these for over 10 years it was a gift before. and I finally found another one",
        "I got mine in May and it’s August and it has stopped working! It doesn’t get hot anymore!",
        "i loved it and purchase for my mother for Christmas. Due to i has purchased one for my self and she loved mine. so i figured i would purchase for her so I know she will love also",
        "We've used the dualdaddy several times now and it has fried everything perfectly. It's easy to clean and stores well since the cord snaps off pretty easy. Would recommend.",
        "So far, so good. We used a few times. We love it. Hope it can work a few years.",
        "This fryer does a great job. The preset heat control seems to be right on the money, and it recovers quickly after loading. Cooks considerably faster than other fryers.",
        "Great product. Works great. The only reason I took a star from it is that it came with a dent in it and now the kid doesn't go on.",
        "have had at least 4 of these since they came out years ago. perfect temperature for deep frying. perfect for sea food and fresh cut fries!",
        "Had one before and will reorder if I ever need to",
        "Love the size, medium sized pieces of chicken and full fish fillets fit just right.",
        "The divider is nice. Being able to fry two items such as chicken and fries is good.",
        "I am pleased over all with this economical fryer. It is larger than I expected. You will need to buy a frying basket, the spoon is not adequate. I like how It heats very quickly to cooking temperature. I would have given it 5 stars but I am very unhappy with the lid. They warn you that the lid will melt if left on while frying (I can attest to that). Why not provide a lid that is safer to use?? I think this is a SERIOUS design flaw and the company should replace my melted lid, and start using a safer lid. Remember to remove the lid before turning the fryer on.",
        "Heat's up pretty quickly and and served it's purpose. So far happy with it.",
        "Nice having ability to cook two different items at once.",
        "Bought as a replacement for my daddy. It's the only one he likes that lasts. Easy to clean, and retains heat well.",
        "Have used this product many times and am very pleased with it. The extra capacity comes in handy and shortens the total cooking time.",
        "My husband and I are empty nesters, so making dinner for two is challenging. We very rarely fry food but when we do the DualDaddy works great. It keeps the oil at a consistent temperature and reheats very quickly when the food is added. This is my second DualDaddy, the first one is at our vacation home.",
        "Nice deep fryer, I love that you can fry two things at once. I wish it came in a bigger size.",
        "Found this product to be good for cooking larger and smaller items at the same time. It seemed to heat evenly and stay at a constant temperature. I would recommend this product to anyone. We purchased this item to cook perch and walleye together, but separated (small & large). I'm not sure I would cook french fries with fish though. Also, I wish it would have come with baskets to keep the food off the bottom of the cooker. But it is still a good product.",
        "This is our third one and we like using it for French fries. We upgraded to a Dual Daddy to fry larger amounts of food at one time.",
        "Good quality at reasonable price. Cook 2 things at once so all my food is hot.",
        "Great fryer!! I've used it twice in the past two weeks and love it! It heats the oil rapidly and fries the food evenly and in a short time period. I drain the oil after each use and it's not a messy or time-consuming process. The cast-iron construction sets it above most of the other fryers on the market. I've had several, and this one works better than all of them! It's priced very reasonably, and quite inexpensively compared to most of the others. No complaints here!",
        "What a great idea. It works well and it solves the problem of how to deep fry two items at one time. Thanks!",
        "Simple and sweet, works very well. If only oil wasn't so bad for you I would have no complaints, but the product itself is quite excellent.",
        "This is the only way to cook fish! I have three of these. They are so quick and easy to use.",
        "Purchased as a replacement for one I have been using for years.",
        "The best deep fryer on the market for the money. This is my second one. Heats up quickly and is easy to clean. I use my Laser gun to measure temps while cooking. Worth every bit of 5 stars.",
        "This is a great deep fryer. I've already told at least ten of my friends they should get one of they don't have a deep fryer"
    ]
}