{
    "entity": "Deep Fryers",
    "text": [
        "I just bought this deep fryer last week. I got it for one reason only: To fry chicken. However, unfortunately, the oil gets too hot to do that. Using the manual’s recommended cooking times for thighs and legs, and anywhere within the given range of temperatures for both, the skin got blackened and burnt before the inside of the chicken was cooked thoroughly (no pink). If you want nice, golden brown skin *and* cooked chicken, this deep fryer is not going to do the job. If you don't mind burnt, black, hard skin, then you'll be satisfied. I’ll be returning this.",
        "Have used this so many times already. I use peanut oil to fry everything, shrimp, chicken wings, mushrooms, okra.. everything frys perfectly. Have not had any problems. Never noticed anything melting. I think people that are complaining about the fryer melting, did you make sure you removed the plastic lid before you plugged it in? It is just hard to believe this fryer would melt. Just saying.... Love My GranPappy. Better than any other fryers I have bought and does not take up so much space. Do remove the lid before operating. Peace, Bertie.",
        "I am loving this counter top Fryer! 2 days in and I’m glad I made this purchase, wings, fries and burritos all fried up great. I was a little worried about the 1 setting but the fryer heats up and the pan makes the adjustment.",
        "#1. Absolutely the best fryer available. I've had them all - this is the simplest, easiest to use and clean of them all. Anyone who does not recognize the simplicity and beauty of this machine should not be let near a hot stove! Highly recommended.",
        "This is not much bigger than the smaller version . This is the best little fryer for the money but only for food that doesn't need certain temperatures as this has one heat....hot. The little plastic spatula is worthless so buy a decent one for a few dollars more. I wish the lid wasn't plastic as it is a hazard. I forgot to take it off while heating the oil then wondered where my lid disappeared to only to discover it had melted into the oil. Yuk! Hence the reason for buying a new one.",
        "Just what I wanted, made perfect wings, drumsticks and onion wings. Used peanut oil, great for keto diet. Heats up in 12 - 15 minutes, seems to recover heat quickly. I was shocked to see how little oil was used when I strained and returned oil for storage.",
        "Save your money, -Only ONE temperature, burns chicken (undercooked on the inside), overcooks on the outside. -No on/off button -No basket, so your food burns on the bottom -outside will burn your skin (1st or 2nd degree burn) -Smaller than I thought that it would be I can’t get my money back, but I’d like to save you from wasting you money. *PLEASE DIN’T BUY THIS FRYER",
        "fries perfect every time and doesn't use up a much oil compared to other fryers. Heats up quickly too and is light weight. The cord is magnetized and will unplug itself from the cooker before the yanks the fryer full of oil over so that is a nice safety feature. Some might complain about that but I think it's a must have.",
        "What could be more simple??? Fill with oil, plug in, drop in meal, pop out tasty treat! If you want simple, this is your fryer. If you want a space-saver, this is your fryer. If you want a good value, this is it. However, if you want a little more control, this may not be for you. It gives you 375* and that's it. If I could change anything, I would love to turn it down to 325-350 sometimes. I'm learning to adjust the times and recipes. But, in the meantime, chicken, shrimp, French fries.....Love it! I'm going to cut this short and go make a batch!",
        "Have had a couple of the small ones over the years. I like the fact that they are not lightweight yet easy enough to lift and store with oil in them. The reason I have had more than one is because after a few years they become a little gunky around the edges and I could not get it off. Yet that is basically my bad in that I am sure if I wiped it off after the container cooled it would not get the buildup of oil. They did not wear out, I just tossed them because of the gunk I did not like to see. Actually, I plan to purchase another small one to use for smaller amounts.",
        "As an eldest of ten children, I have cooked and fried a lot of food in my time, with many, many devices. However, with this thing, I couldn't get anything right. Ruined everything. Boils over. Impossible to handle. Pain in the backside to clean, and it will constantly need to be cleaned because of the way it is designed. The only good thing I can say is what a joy it was last Saturday night, to take this thing into the backyard and fling it with all my strength into the woods, to never be seen again. Now I will begin the journey of erasing this entire event from my memory.",
        "THIS IS NOT INSULATED. I feel like I should start with that since it isn't mentioned anywhere in the listing and my husband nearly singed his fingerprints off trying to undo the plug from the back. It does NOT maintain a perfect temperature, it fluctuated anywhere from 385-400 degrees, burning everything on the outside while leaving it undercooked in the center. I am SO disappointed with this purchase. I got it for Christmas, it arrived beat up and poorly packaged and to add injury to insult, it's also a bit dangerous.",
        "I like the way the deep fryer looks and can be cleaned with ease but it defeats the whole purpose if you have to put your food in the oven to finish cooking on the inside. It cooks the outside extremely fast, a few times the outside of my food was burnt and the inside was barely hot. It doesn't have a temperature setting, if so it probably would be the perfect deep fryer! I should have listened to the reviews! Im so disappointed because I will no longer be using it. Make sure to let the oil cool before putting the lid on or else it will melt inside the oil.",
        "Well I bought this fryer based on reviews which were very good. However I did not have a great experience like the others. My major critique would be, There is no temperature setting. Basically you plug it in and it heats up to one temperature which can burn very fast what your trying to make. I also would have liked a glass lid not plastic, mine came warped so I could not close it.",
        "the fryer works well does a very good job cooking items WHAT I DO NOT LIKE IS THE ELECTRICAL CONNECTION IT SMELLS FROM OVERHEATING it is not a better way for the connection our old fryer which was a fry daddy we had for over 20 years and did wear out the connection this new one will never last. I am a retired electrician and do not have any faith in it",
        "I've had bigger and better fryers with all the bells and whistles. However, they were big, wasted a ton of oil, were hard to store and hard to clean. I got the GranPappy a month ago and I love this little thing. Big enough to fry breaded chicken and fish etc.....small enough to fry a hand full of french fries. Super easy to store and clean. If you're frying for home use once or twice a week this is all you need. Don't waste your $$....the GanPappy is awesome.",
        "Yes, I know it not a healthy way to prepare food, but it does an excellent job for what it is designed to do. I always preheat for the recommended time and everything I've cooked so far has turned out great. I'm glad I went with the GranPappy instead of the FryDaddy as it will hold more food, is easy to clean (no ridges inside), and doesn't take up much more space on my counter. The only negative thing I can say about it is that you need to be careful about setting anything that can be damaged by heat too close to it, as the outside of the pot gets pretty hot.",
        "I use Canola oil in my fryer . It warms up in no time ! Make sure you read and follow directions cause your useing Hot oil . Ive made onion rings so far and they taste great . Next will be chicken tenders and tater tots and whatever else I can think of to fry . This is a fantastic product I will be useing in the winter as well . Nothing like something fried on a cold winter day . Its easy to store and you can leave the oil in it , comes with a lid . Very cool . Im happy with this and I know you will be too . Happy Frying !!",
        "Larger than I expected, but the high sides are helpful in controlling splatter and, as others noted, wide enough for for more than one chicken breast or a larger piece of fish. I have only used once and did not yet check the temperature throughout cooking - but homemade onion rings were tasty. Purchased as a means to occasionally deep fry food for two. Following the directions to allow oil to heat for 15 minutes worked fine and I did not feel the need to have a temperature adjustment. The scoop was fine, but silicone tongs may also be helpful. Unlike past fryers, device cleanup easy.",
        "Great little workhorse. After the cutting and breading prep, I can perfectly fry up 5 lbs of chicken cutlets in 20 minutes. Easy compact storage but even if it weren't I would not care. I like to have individual cutlets on hand in the freezer and ...did you hear? 20 minutes! No flipping, No spattering, No watching stupid chicken fry for hours!",
        "This little deep fryer has been worth every penny I paid for it. I have had this thing for about a month and have never been disappointed with everything cooked with it. I looked a few cheaper and dome of the more expensive fryers and this one fits my bill perfectly. No bells and whistles. Not even a temperature display. Don't really need one because the oil heats to 350 to 375 in short order and it stays in this range quite well. Sure have saved lots of money on cooking oil with this thing because it does not scorch the oil the way my cast iron cooking pot does. Well worth the money.",
        "I used to own a Fry Daddy but it got lost in a move...it was so old I think one of my kids chunked it. So after the move I bought the Granpappy and I love it. Uses a little bit more oil than the Fry Daddy but it is worth it for getting more cooked in a shorter period of time. So far I have fried shrimp, pickles, hush puppies, and fries and it did great. The only issue that I have ever had is that the temperature range appears a little off. I think the oil gets hotter than advertised which is fine for most fried things but harder when frying chicken.",
        "For many years we have had the Presto Fry Baby. When replacement time came I UPGRADED to the Presto GranPappy and it was a smart decision. Seems to heat much faster and obviously holds more. GREAT for frying Ore Ida Slim Jim fries. When thawed only takes about 2 minutes at most to fry them to golden brown and very hot. I highly recommend this unit. It is great!!",
        "We had a fry daddy about 20 years ago. loved it but it finally gave out. Then i tried a bunch of different types of expensive deep fryers. hated them they did not work. and they took way too much oil and also you had to empty the oil after each use. I wanted to fry fish so i ordered this one and now we cant stop using it. forgot how easy fry daddy makes it. this one is much bigger than what i had before. make it so easy. bought one for my daughter 1 month later. mine didn't come with a basket but not sure i would want one, it comes with a great plastic scoop.",
        "This is super simple! Plug and go, that’s it. I watched the temp with an external thermometer and it got up the onion ring temp quickly. I fried an entire onion with no smoking oil, hardly any grease splatter, and quickly. If your a gourmet cook probably not your fryer since there’s no temp control. But if you just want to fry fish or fries or onion rings now and then I highly recommend it.",
        "We didn't want to spend a lot of money on a fryer when the small fry-daddys are so inexpensive, convenient for size, work as well as expensive fryers, take up less space in storage and when they look unsightly with grease, you can afford to replace with a new one. I would not want one of those stainless steel expensive models.....no reason to.",
        "Had two others just like it in our 40 year marriage. They all were great. They are easy, they fry, they work. We've tried other bigger and more exspensive types and they never were better or easier. It's quick, easy and sets on the shelf with its cover on it and the oil in it till you need it the next time. It's plug in and fry. No gages, no fuss. Throw your stuff in scoop it out with included dipper, drain contents on a couple of paper towels, eat.",
        "This is an amazing fryer that does what it says but the design does have a few opportunities. The outside doesn't have a protective coating so likelihood of getting a serious burn exists, there is no temperature control, it just heats up to 350 or 375 ( I forgot which one) and the top cover Isa thin plastic and if you forget to take it off it will melt. Luckily we haven't melted anything or received burns but these things are what are pointed out in the manual.",
        "We don't eat very much fried food, usually French fries once a month and onion rings at the same interval and have been using a cookpot, then emptying the cooled peanut oil into a storage container, which was a messy task. We had a Gran Pappy many years ago and decided to try this new one. The unit works very well and the oil is stored in it when not in use. There is no temperature control but none is needed since it's automatic. Be sure to use peanut oil and to discard the used oil after several uses.",
        "Like this fryer. Cooks enough for two at one time and maintains heat well and recovers quickly. Glad I bought. Had a big one and rarely used it. Gave it away. Use this all the time. But buy a small screen filter to filter the oil at least every 3rd time used (the crumbs burn and oil will get dark and taste a lityle burnt) and a digital read out temperature probe with a wire. I use regular vegetable oil going up to 350. Love swans raw breaded chicken tenders in this and steak fries.",
        "So easy to use! No worrying about the temperature or anything, this gadget does all of the work for you there. We've made onion rings and fried tofu so far. Both delicious. The scoop works well too. Have been quite impressed with this. Looking forward to trying more fried foods at home.",
        "I bought this grandpappy fryer to replace my old Fry Daddy, it's constructed the same way quality materials although it seems a bit lightweight it gets the job done I would definitely recommend this to anyone who is looking for a little bit bigger fryer.",
        "I've used this 3 times and havent had any issues. It's just the right size for my family of 5 and cooks really quick! It holds a nice size amount of food. Easy cleanup...and even though there is no lid to use while cooking, it doesn't splatter all over the place. There is no basket but the spatula that it comes with scoops everything out with no problem.",
        "Wonderful user friendly deep fryer! Love that the oil remains at one temperature, so you never have to worry about burning the food. Please read the instructions prior to using!! Remove the plastic lid before you connect the cord, because it will 100% melt. You can place the lid back on later once the oil has completely cooled down. I made egg rolls and they came out perfectly! Great way to conserve and reuse oil!",
        "Nice, does the job, easy to drain, clean, and refill. Con... Wish it had an indicater light to tell when it's hot! Otherwise just plug it in 15 mins before use and you're good. Nice size. I can deep fry 8 to 10 (2 X 3\") pieces of battered fish in one batch.",
        "Sometimes you just need to fry some fish and fry's. This does it every time. Plenty of capacity, heats up quickly, has the features you need to fry up a little food for a quick dinner. Easy cleaning too. Lots of recipes out there for more and more uses of this fryer.",
        "Good product. Heats up in an acceptable amount of time. There really is no way to control the temperature. It reaches 375 degrees. I like how the cord is attached with a magnet it definitely lowers the chance of getting a burn. I can’t say if it is easy to clean as I haven’t cleaned it yet, but it does seem to not get all greasy on the exterior like my old one did. I fry with lard, so that helps minimize spills.",
        "I had a fry granddaddy for years and years and loved it. This was disappointing in its size for a 'grand pappy' fryer. It is a lot smaller. I do french fries at 400 degrees so that was fine but there is no other temps offered on the product. This product claims to make enough fries in one batch for six people but it is not the case. I was going to use it for four adult dinners and it wouldn't have made enough. I will keep it but really wanted a bigger size.",
        "Great little gadget but I wish it had a choice of three temperatures instead of just one. 325° and 350° would be helpful in addition to the preset 375°. Some foods will cook too fast and not cook through because of the higher temperature. Would be the perfect little fryer with the addition of these temperature choices. Easy to clean & easy to use.",
        "Works good, but it does not have a \"ready\" light on the unit. so unless you put a oil thermometer in while heating you have no idea if it is up to temp. Who likes to have a thermometer stuck in their vat while trying to fry things, big hassle when you are stirring fries, wings and such!!",
        "This is a really good deep fryer. I used another Presto deep fryer for ~15 years and only got a new one because I moved. The other still worked really well. So far I like the new fryer, I've done tofu, veggies, french fries, doughnuts, and fish and it's worked really well. My only criticism is that there is no thermometer or heat regulation. The fryer does the temperature on it's own, which is nice, but I like to know the temperature and modify it for different applications. Overall, I recommend the product and it's very good.",
        "As others have said, it is hot on the outside since it has no insulation but it does the job cookwise for what we wanted. We've fried okra (we have a garden) over and over, potatoes, chicken fried steak. We love it. I will say that we use it outside rather than in the house since we grill alot.",
        "Originally I bought this so I could cook my lumpia outside instead of stinking up my kitchen (curtains retain all fry smell for weeks)... I end up using at my work to cook fresh lumpia for a pot luck. A great tool if you like to fry anywhere, needs a plug in! Could fit about ten lumpia comfortably.",
        "I read the reviews and still bought it. I shouldn't have. It works so in that regard I can't complain. The unit is real basic, it only heats to one temperature which is a pain, but the biggest problem is the black plastic lid. One of the kids finally plugged it in with the lid on. They don't even have the courtesy to make the lid in a different color. Sure us adults will remember everytime, but eventually someone is going to forget.",
        "Product easy to use. Just fill to the line, plug the magnetic cord, and it heats up quickly. Love the spatula that come with it. I prefer the plastic over metal so it won't scratch the surface. The inside is really easy to clean and the lid helps reserve the good oil for another use. Going to buy another one as a present.",
        "This is the second one. The first one lasted 20 years. I like the magnetic attachment of the cord. It comes out easily so you do have to be careful not to disconnect it accidentally. The volume is great and it heats up quickly. Plenty for 2, 3 or even 4 servings.",
        "Cons, no temp control, no led or anything to indicate \"on\". Cooks large pieces of chicken too fast and leaves you unplugging the cooker too save your food from becoming too brown on the outside and under cooked on the inside. Pros good size for family of 3, I like the plastic lid. Summary-Better fryers for the same price with temp control and power switch. Just not safe to cook with because of how you have to protect food from over browning on the outside and under cooking within. Had I used one of these somewhere I would not have purchased one for myself. Not safe, not a good value. Disappointed",
        "I love the gran papi. Things hilarious. I eat every meal after it was been baptized in the holy gran papi. The name is hilarious. The fact that you’re deep frying regularly is the most American thing ever. All around it’s friggen hilarious my buddies love roasting me for having the gran papi but I could care less about my health or well being anyway. Bugida",
        "I don't do reviews but this little guy deserves one, actually a little bigger then I imagined, I took it out of the box, cleaned it and used the simple recipe for crispy and did wings, actually put 12 pieces in the fryer, did them for 10 1/2 minutes and wings came out Great, so easy to use. Highly recommend this fryer.",
        "Works great. Top temp will vary between about 390 and 410 which is OK for most frying. It gets used at least once a week.",
        "We had the frydaddy and used it for years before it stopped heating. Ordered the Granpappy which is quite a bit bigger but perfect for our needs. Heats quickly and the temp comes back up quickly after the food is added. Perfect for frying fish.",
        "I’ve owned several Fry Daddys over the past 40 years and compared to a Fry Daddy, this fryer is terrible. This fryer has no temperature control knob or a light to tell the user when the oil is hot enough. Also the cable that connects to the fryer is held on by magnets and easily can be knocked off. Very poorly designed! And I will not use this fryer again. I’m sorry I wasted $48 on this product!",
        "Luckily this thing is electric and did not catch fire. Was using peanut oil and I think a mike tyson chicken. Cooked in under an hour felt like maybe a half hour. Would suggest buying a theromeater, as too have optimal temperature, not sure what over cooking this taste like but, cooked a little past the optimal suggested chicken internal temperature, can't remember exactly what degree, but was juicy, flavorful, and most importantly easy.",
        "Love it, i have a fry daddy [which i.love] so need a lil bigger 1, now i have 3 deep fryers by presto.... 1 for fish, 1 for chkn & other stuff, & the big fryer for family gatherings . I use outside..takes literally secs to warm & u cannot touch",
        "This is my second GranPappy. My first one lasted over 20 years, although I didn't use it but maybe once a month. I ended up replacing the old one due to the cord getting very hot while in use. I was very glad to see the cord connection has been greatly improved and should last me another couple of decades.",
        "Love it! Small doesn’t take up a lot of counter space. Uses only 6 cups of oil so it is very efficient. Like it for it’s no basket design and it heats up quickly. Nice tight fitting lid so when done there is no clean up until the oil needs changing.",
        "Really like the size of this fryer. It uses one 48 oz bottle of oil and works great. Have fried fish, French fries and hushpuppies. Love it",
        "I had a commercial style basket fryer, it was a pain to clean and had a big footprint to store. I gave it to the Goodwill. The simplicity of this fryer is it's greatest strength, and it's cheap. The lack of adjustable thermostat is a plus in my opinion. It maintains the oil at 340F to 350F very well. Buy a good spider to remove whatever your frying.",
        "I got tired of my husband cooking on a propane tank with iron pot for fish and hot wings. He worked 2 hours from start to finish. I slipped this order in with out him knowing. He now loves it. No more propane. You can't screw up deep frying in this, unless you just don't pay attention and let something burn.",
        "Works well, simple and holds more than I thought. I had another fryer that held an entire gallon of oil. This takes six cups. It preheats very fast and doesn't have knobs or switches to get gunked up or break. It also has a very quick recovery time once you put the food in. While my old fryer held more food, this fryer has a couple of batches done while the other one is still preheating. I'm happy with my purchase.",
        "I havent used it yet so I may have to edit this review, I was just disappointed it didnt come with a temperature gauge. I did contact product support and they said it heats to 375 degrees, which is fine but it would have been nice had was mentioned in the instructions (which I always read) or even the box.",
        "I literally hate this fryer. This fryer is a health hazard, grease pops ever where. I make sure my chicken is dry before puting in fryer and it still pops all over my counter top and back splash. I used this fryer only twice and both times I was burned from the grease popping. Now that the 30 days is up, I cant return it? This is horrible. I am so pissed and disappointed with this fryer. I don't eat half cooked chicken with burnt skin. This fryer cooks entirely to fast leaving my chicken under cooked and burnt. If it had a timer, it would be a perfect fryer.",
        "Easiest deep fryer to use. I always use two fryers at the same time. This was a replacement for one that finally bit the dust after 15+ years. I have tried different brands over the years, but always come back to this one.",
        "I have used it for deep frying chicken, french fries , mongolian beef, pork schnitzels and beignets on my patio over the last 3 or 4 months. I use a deep fry thermometer that mounts easily to fryer. When frying is one and it is cool , I put the lid back on and store in our pantry .",
        "I really like the size of this fryer. It's large enough for French fries, chicken strips, etc. The only gripes I have are: the outside of the unit gets very hot, there's no basket (though there is a slotted spoon), and the lid doesn't form a good seal on the lip. Other than that, it's a great fryer at a great price!",
        "I have a frydaddy already and I wanted something bigger so I ordered this. It gets a little too hot. I have to put things in it and run away Lol... Also it uses a whole bottle of oil... but it's perfect if I want to fry 2 things at once using this and my frydaddy",
        "i brought sweet potato fries and ohhhhhhh my goodness they were so good after deep frying them. i'm so happy i brought this deep fryer, i fried vegan chicken and it was the bomb too it's the right size.",
        "I haven't never owned a fryer like this. I've always used a heavy pot to fry. I've been missing out! I love this fryer and the size is perfect for us. Highly recommend.",
        "Bought this as gift for my parents and this is their feedback: \"First impression was that it was very small than expected. But once heated it up it fried snappers in no time at all. Fried two medium sized snappers cut in halves in one batch. We used a long food temperature thermometer and it heated up to 400 degrees. Temperature dropped a little when finished frying one batch but quickly went back up. Fried very fast and fish came out very crisp on the outside and soft inside. Love it. Simple to use and exactly what we needed\" .",
        "This is money well spent. The color of the chicken was great. The texture was moist. It was crispy. The fryer regulated its temperature to give my kids and I a mouth watering meal. I am going to buy the bigger size to use when I have guests. This Presto fryer is the best secret I am not in a hurry to forget and I will tell all my friends to get one at the great price it is now.",
        "This is an awful product was too high of a temp all my food was burnt on the outside and not cooked in the inside",
        "No big deal, just a little deep fryer. But does exactly what it says. We were deep frying chicken in a big pan and it caught fire and almost burned the house down (even with an elect. glass top stove). Anyway, no more deep frying anything in a pan for us. This thing is only for small portions but does a nice job. And it's safe! I think we got it in one day. Amazon Prime rocks. P.S get a fire extinguisher and know how to use it. Stuff happens faster than you think. We were insured but it's still a nightmare.",
        "i have used the smaller fry daddys and been so satisfied with them. i got the larger one this time so i could fry larger things. Would not be w/o one.",
        "The actual product is fine. BUT if you’re planning to give this as a gift, beware. Mine was shipped in it’s regular box, but it had half of one side torn out and the product was exposed. I checked, and all the parts were there (cover, cord, directions, and scoop) but it is going to be a terrible looking gift.",
        "Keep a thermometer nearby and check the oil as it's heating. As soon as you get to your desired temp, start cooking. Otherwise it WILL get too hot and burn your food. I love this fryer. Works great for our needs.",
        "Love, love, love this fryer. It is a good size and easy to store. It offers consistent temperature control and requires no regulation on my part with different foods. Conservative on frying oil use, too. I have 2 of them.",
        "Bought this so i could Fish Fry on my tailgate outside with extension cord instead of smelling the house up. Works great, then dump oil into fire pit and wipe out with paper towel.",
        "We don't deep-fry a ton, and when we do, it's usually perch or walleye. After junking our old, messy fryer, I was in the market for something simple and easy-to-clean. This fit the bill. My husband was happy with it (he does the frying) and I love that there is not a basket to clean. Would definitely recommend.",
        "This fryer is great- heats up very fast , perfect for 2 people. Easy to maintain because it takes so little oil. The only thing that keeps it from being perfect is no temperature control. However, it’s perfect for me.",
        "My husband uses this every time we have a fish fry at our home. It heats up the oil so efficiently. He is always able to fry so many pounds of fish and French fries with this fryer.",
        "Unit does not work at all. Bought this brand new and it worked for about two minutes and now will not heat up at all. Tossed the box prematurely so I guess out of luck on the return.",
        "Our teenage boys like fried stuff or grilled stuff so I bought this for when it isn't grilling season and the boys love it. It does French Fries, Hash Browns, Tater Tots, Cheese Sticks and other things with ease. Boneless chicken takes about 8 to 10 minutes in mine but drumsticks take 18 to 22 minutes. If you do too many consecutive batches, like trying to do 3 batches of Drumsticks, the oil will start smoking and drinking pretty good. Still a great product though, especially if you strain or change the oil between uses like you should with any fryer.",
        "Easy to use, nice size. Only thing that could make it better is to have temperature control. But still easy to unplug and plug back in to keep the oil from getting too hot. Would recommend and purchase again",
        "They should have a glass cover or medal cover not plastic. My melt I forgot to take it off before plug it. lol. And black. I did not see that. But hell is good clean easy fry chicken en 12minuts I love it I would recomend to my friends.",
        "It is basically a bucket of oil with a cap! It doesn't have a basket and it is not bulky. So, fill it with oil (I use canola) and plug it in. Some people won't like that it doesn't control the heat, it doesn't have a basket, etc. For those who want a simple, easy to clean, easy to store, compact fryer, this works great. I made some good onion rings, fried chicken, and french fries with it.",
        "Love this fryer! We like to have a big family get-together with lots of catfish! We bought two of these, and they work perfectly!",
        "Very good fryer and gets the job done. I used to have a smaller version of this and did not go through so much shortening. This one actually uses a whole can so that is one kind of downfall for me. Other than that I do like this product. The upside is I can cook more fries and stuff so I could feed the family quicker instead of having to make smaller batches in my old one like I used to.",
        "Perfect sizr for my familt to fry meals. Fried fish well. Hopefully they will make a bigger one to use for large gatherings. I would definitely purchase.",
        "This Granpappy fryer is exactly what I needed. It is a nice size, heats up fast, and is easy to clean. The lid and spatula are nice additions to throw in with it. Some people said they have splatter problems; I slowly lower stuff into it and I never have it spatter up. It's also nice just being able to throw the lid and keep the oil in there for reuse. It only has one temperature setting but I don't need it really specific. I wish there was an on off switch instead of just it turns on when you plug it in.",
        "Maintains the temperature very well, even after you add several cups of frozen food. There are no temperature dials, which some people don't like, but I love it! Reminds me of the old Fry Daddy my mom used, except it's a lot better at maintaining a steady temperature than the old ones were. It also has no nasty fry basket. The fry baskets always get gummed up and are hard to clean. The only improvement that could be made is to provide a metal slotted straining spoon instead of the useless plastic one. I would recommend this fryer to anyone - it's great!",
        "not adjustable temp and the power plug is held on by a magnet and falls off all the time and the power cord is TOO short , about 18 inches",
        "I’ve owned a Couple Fry Daddy’s over the last 20+ years. After 11 years on the most recent one it was time to replace. I decided to upgrade to the GranPappy and I am happy I did. The additional capacity over the FryDaddy is so nice.",
        "I have a FryDaddy and bought one of these for my best friend and his son (all of use are fisherman - or wannabes). I love mine, but it only holds about 5 mid-size fillets. He and his son love theirs - it holds 8 - 10 good sized fillets. You can have that baby really going and still put your hand over the top and you will not be splashed with ANY grease! These things are TOP NOTCH! The onloy reason not to have either a FryDaddy or the GranPappy (or both) is if you don not eat any fried foods and know no one who does. We don't know that kind of person here in Oklahoma... ;-)",
        "Easy to use, easy to clean, save on oil over bigger deep fryers. Oil stays hot. I fry freshly caught fish often and I wouldn’t do it any other way. Fry daddy was too small. This was a better size for my use.",
        "The presto granddaddy is great, as you can see, my fish turned good. With perfect coloring,you can't go wrong with this one, reasonably priced 👍",
        "If only I would've used this deep fryer before I burned my house down... perfect fryer and safer than using a stove! I love taking it outside and frying fish so that the whole house doesn't smell like burnt fish grease! lol",
        "PLEASE RING THE BELL when delivering products. Porch thefts, bad weather, and animals can ruin products. You are already on the porch!! Item works ok, although it was wet.",
        "So much neater than frying on the stove top. I got so tired of trying to scrub hardened grease spatter that was missed during clean up I broke down and bought yet another small appliance but this is worth the small space it takes up. I'm usually just making french fries so when it cools off I pop the lid on and put it on the shelf so it takes up no counter space. Saves money on oil too.",
        "Love love this fryer. No frills just plug in and it does the right temperature itself. Wait five minutes. Frying takes about five minutes and crunchy and yummy.",
        "Purchased for camper. There is no temp control...but it isn't supposed to have one."
    ]
}