{
    "entity": "Earbud Headphones",
    "text": [
        "Pros: Incredible sound quality, I got Bose earphones ..... but the SR125i ones are better in quality and comfort. Cons: the cable is too thick and to heavy, explains also the good soundquality. The noise isolation is non existing, so when you are alone, these will give you the best soundquality ever heard before, when I am not alone I use my Bose headphones, which are better noise isolated and with good sound!!!!! Although I miss the SR125i sound immediatly.....",
        "The sound quality is amazing, slights warmer than the SR80i's that I own and while the style is retro, it is quite distinct from any other headphone in a good way. I recommend getting a case for it if you travel with it and maybe G cushion earpads which make it way more comfortable",
        "I bought a pair of these to stop my son borrowing my Grado 325's. It worked. Mainly because I hid my 325's. Comparing $150 to $300 headphones should be easy right? Actually it is - the 325's are much better. Maybe 25% better. Easily worth the money to me. If you only can spare $150 then the 125's are really good. Just don't kid yourself. If you could stretch to $300 I would personally pay the difference. It's a couple of nights out or an expensive restaurant meal. The 325's are worth the extra. Someone will tell me I should have bought XXX - and they are probably right - but I can only tell you my experience.",
        "The sound with these headphones is excellent, very clear and accurate. The only problem I find is that after an hour or so it hurts my ears. Perhaps it's because I wear glasses.",
        "Unpacked these babies, put them on and was completely blown away. Absolutely the best headphones I have ever used. One review said there was a \"break in period\". If there is I may not be able to handle it. Be forewarned, mine came with a 1/4\" plug so you will need an adapter for 1/8\". But that was a small problem. I am running mine through an Audioengine D1. Excellent.",
        "Grado clealry has produced a high quality audio product here. For the money, these are the best headphones I have listened to. Unlike some reviewers, I have found these plenty comfortable, even after several hours of use. Don't be fooled by the plastic exterior. These are for real.",
        "I bought these on the recommendation of several friends who raved about Grados. I agree that they are some of the best sounding phones you can buy in the price range. They aren't really monitoring phones as I hear them being biased a little - a LITTLE - toward the bass, but the overall sound is excellent.",
        "I love the sound, clarity and deep bass. Better than both pairs of my Bose. The quaility is top notch and they are made in the USA",
        "The Grado SR125 headphones are a great set of cans. On albums like Kenny Rankin's \"The Bottom Line Encore\" the SR125's bring out the quality of the voice and guitar. I've had no trouble with comfort. Bottom line is that they were worth the money.",
        "It's probably not a good idea to use it with your laptop or computer cause you need an adaptor, and it is still too tight(for a normal head shape) after 6 months. It is too big so don't even think about killing time in a long trip with your mp3 device and this thing. Sound was great. I have always trusted Grado and AKG in sound quality and this product proved that. Best with rock or folk music. If you play electric music instruments and want to keep the voice to yourself, consider SR125 or SR80.",
        "These are great headphones with top quality sound. The ear pads are not the most comfortable, however I only use them for about an hour at a time so the pads are bearable. Looking for softer ear pads, but the originals seem to be what is available.",
        "Love Grado's sound... it's too bad they don't put the attention to quality on the construction of the earphones that they do on sound quality. Earpiece falling off the mounting stalk. I guess I should be happy these fall apart so quickly, because I can return under warranty.",
        "These headphones sound good. You can have sex with them and have an orgasm forgetting that you're having sex. \"Oh I forgot you were even on me, shall we do this again?\" I enjoy them better than Dr. Dre headphones.",
        "Cheap foam is not comfortable. Sound quality is pretty good, but certainly not the best in its price range.",
        "We've owned these headphones for a few years. I'm not an audiophile but appreciate great hi-fi sound. The sound is fantastic on these. I won't be able to expand futher on the reviews here. However, both my son and I use these and we both have ears that stick out though I wouldn't say it is severe. We find these headphones painful after about 20-30 minutes. Its obviously bothersome enough for us that I am now looking for a more comfortable pair. The pain is more noticeable lately and I'm wondering if the foam pieces are breaking down although visually they look fine.",
        "These sound good and are fairly comfortable for a short listen. I have never been able to make them as comfortable as the AKGs that I replaced with them. They have a smooth, detailed, sound, but be prepared to fiddle around with the fit.",
        "Have had these for awhile and used them with my stereo which was great but just started using them with my iPod and the sound is incredible. No matter what kind of music I'm listening to the sound remains crisp and extremely clear. Had been thinking about checking out Bose but then realized what a mistake that would be. The comfort is not a problem as I have had them on for a couple of hours at a time and never had to adjust them. Without a doubt the best headphones I have ever owned.",
        "These headphones deliver excellent sound quality. The clarity and extended frequency response are hard to beat in this price range. But I am forced to give them only 4 stars due to comfort. I just can't wear these for 4 continuous hours without my ears hurting. For this much money, I expect them to be more comfortable out of the box. I have tried one of Grado's older models that still has the flat ear pads (as opposed to the new bowl style), and I find them comfortable. I am planning to swap my ear pads for the older style. With this modification, I expect to be happy with wearing them for longer periods.",
        "You just can't compare them to anything else in this price range, I have listened to headphones upwards of $600 that don't compare in sound depth and overall sound quality. If you put these headphones on after you're current pair same song same volume, it will sound like someone just took there hands off your ears. Especially if you are a fan of jazz, classical, rock, reggae, opera, but even Hip Hop sounds amazing on these cans. But don't take my word for it listen for your self. The only complaint I have is comfort it's not that bad though. It is defiantly tolerable for 2+ hrs of non stop listing.",
        "These headphones have magnificent sound. They are semi-open so not great (although functionable) on noisy airplanes or on streets with lots of traffic, but for walking the suburbs or other low noise level areas, they are better than most speakers.",
        "If you like rock, metal club jazz or quartets, Grados do the job like no other. They persent the music in an up close fashion the really accentuates these types of music, a lot of phones put you in the audience, these put you on the stage. The biggest downside is comfort, the bowl shaped pads really hurt my ears after 30 minutes. If you put the pads on backwards, it's not so bad.",
        "After using these cans for 10+ hours, I've found the sound quality to be superb. They will be used for mixing, mastering and production of audio. While the comfort level is just adequate, the foam ear-cups are slowly becoming form-fitting. Highly recommended!",
        "These are the best headphones I've ever heard. Every note is perfect, if you're listening to bad material it will be very obvious with these. I would recommend these headphones to anyone that can afford them. The only shortcoming is that the foam earpieces have disintegrated, bought my pair was bought in 1996.",
        "I bought Grado SR 125 headphones after reading many reviews. I figured they'd be good, but they turned out to be incredible! Every note and instrument is so clear and distinct. Vocals are rich and natural and there is no distortion. Much better than my Bose and Sennheiser headphones! I'm spoiled and don't want to listen to anything else. Well worth the price!",
        "Prior to purchasing my Grado cans I paid little attention to compression rates of stored music on my Mac. Now I find myself rethinking such things using lossless transfers so I don't miss any detail. Detail I'd never heard before.",
        "I recently purchased the SR 80 headphones (they sound great!), not the 125's, but this may help buyers of this product who might be dismayed to see the 1/4\" plug instead of the 1/8\" on the end of the cord: The 1/4\" end on my SR 80 cord was a threaded piece, and all I had to do was unscrew it to reveal the 1/8\" connector for an MP3 player. So there was no need for an adapter. Give it a try with the 125's. That's all-hope this works for you.",
        "These headphones are on the top of my list! Here is a link of similiar headphones:",
        "Product lives up to its technical reviews. Sound quality is excellent. Lightweight and comfortable, neither my wife nor I have had comfort problems with it, even when used for several hours. Recommended.",
        "I've spent over $200 on speakers and sound cards to try and get a great sound for my digital music. There was always something missing as far as quality went. I've used headphones before, but nothing like the Grado SR125i. The sound quality is just amazing. I highly recommend them to anyone looking for that better sound for a fair price.",
        "Very, very pleased with these Grado SR125's. I would highly recommend them, especially as they are better than what I expected.",
        "Bought these headphones because of the glowing reviews submitted by others, but I have to disagree hartily. The bass is thin and weak, the soundstage distant (as if you're sitting 50 feet away from the sound source), midrange is pleasant but average, highs are ok. For the price of these cans I'm very disappointed and definitly would NOT recommend them. If you dig big low end in your phones, and hunger for FAT lows and smooth midrange, look elsewhere."
    ]
}