{
    "entity": "Earbud Headphones",
    "text": [
        "Looking at these headphones, you would logically think the bass response is terrible like most earbud headphones. You would be wrong. Very wrong. Adjust the earbuds so they fit comfortably in your ear canal, blocking out outside sounds, and you will be amazed. The bass response is incredible! The high frequencies are crisp and clear. The earbuds can be turned up to concert volume levels. The only downside to these headphones is that they must be in your ear canal to sound good. This means you have to keep your ears very clean. Not a problem? Great. These are AWESOME headphones. Buy them. Really.",
        "Great minimalistic headphones! These actually fit INTO the ear canal with 3 different sized earpieces included for a good fit. Having said that, after getting used to the headphones being inside your ear you will be rewarded with great sound. These little things are excellent, great highs and mids and very decent bass. Much better sounding than any other bud type headphones for your money. It has a short cord for using your mp3 player on an arm band and a 3ft extension when you have your player in a backpack or back pocket.",
        "Sound quality was amazing on these earbuds, until I lost one of the silicone tips, thus making them useless. While they did work, the audio quality, especially the bass, was fantastic. My recommendation for others is, once you identify what silicone tip size fits your ear, superglue the tip to the earbud so it won't fall off or get lost.",
        "I love these. They are comfortable and sound great. The problem is that the rubber coating on the wires breaks down very quickly. The wire coating gets soft and gummy after a few months and then hurts the integrity of the headphones. If Sony would fix the rubber on the wires, I would give them 5 stars.",
        "I was a bit hesitant to buy this when I read other reviews about how it would fall apart after extended use. But I've used this product for some months now and it's holding up just fine. I've had many other Fontopia earbuds before, and the sound quality is on par for its price. The buds are comfortable enough to listen to while sleeping, and I was pleased to notice that the white doesn't get dirty too easily either. It's a solid product at an acceptable price.",
        "....the fact that if you plug it into your ear and start talking without any music playing, it kinda amplifies what you are saying in your ear. So unless you plan to do a lot of what i just mentioned (why would you, huh?), it's a very good buy. It fitted perfectly well in my ear, didn't have a problem of earphones falling down from my ear while running (like the ipod ones), and the sound quality was great. Only thing i wish was that it had a retractable cable to avoid the messy tangle that most earphones have.",
        "These are perfect headphones if you are like me and have really small ears. I have many sets of different headphones, one which actually sounds a bit better than the Sony MDR-EX71SL but none that fit in my ears so well. I spend time every morning walking my two large dogs and found that all my other headphones pop out while I am walking. The Sonys stay in place (nice that they have 3 different sized buds) and the sound is very good. The price at Amazon.com was half the price in retail stores which for me made it an easy choice. I would recommend these headphones to anyone.",
        "These little earbud headphones have very good sound, but I HATE the cord...so much that I bought a cheaper pair of no-name headphones that I use instead. The cord is asymmetrical (imagine a wishbone where one wing is twice the length of the other) and way too short overall. It's so short that I can't put my iPod in my front pants pocket! It's awkward, it's annoying and it's a serious product flaw IMO.",
        "Too bad they don't make these anymore. I like these small cables.",
        "I like these ear buds because they fit snug in my ear and don't pop out when I accidently tug on the cord (which happens with iPod buds all the time). They also do a good job of blocking out some ambient sound. I use them to listen to Terry Gross while I work in the yard so I can't comment on the bass quality. But the overall sound clarity is very good. The cord is a perfect length for a Nano hanging around my neck but too short for anything else. The supplied extension cord is so long I have to stuff the extra length in my pocket. The price is very reasonable.",
        "I can't tell you how many pairs of earbuds/headphones I own, it's ridiculous. I'm through shopping forever. These are the best value. Enough can't be said about the fact that they have EXCELLENT isolation, which is what I was looking for. I can't hear myself typing this review at all! :) I intend to use these at my church as a cheap in ear monitor, and based on the isolation, it will be PERFECT! I recommend this to everyone, I just hope they don't fall apart in a month like a lot of people have suggested...",
        "Not a pro, but I've never heard in-ear phones that sound like these, truly excellent with great bass and overall sound. The drawback comes when you try to run or walk, and the little connector in the middle of the cord (which lets you use the cord as super-short (arm-mounted iPod) or long (iPod in pocket or on desk); the connector is far to heavy, pulls on your ears, bounces, and is quite distracting.",
        "These were the first type of earbuds that I use with my iPod. I am a fairly delicate user but there were times that they would fail on me. As I appreciated the sound of these earbuds I would go out and buy the same thing. After the third break on me, I gave up and decided to buy a different earbud.",
        "Above average sound quality but durability was an issue. Over time the cable frayed and eventually the connection where the two cords meet went bad for one ear.",
        "These earphones are great. I have experienced no problem with them so far. I'm sure one of the three sizes that come with them will fit in your ear. I could just be me, but even though I did find a comfortable size, they tend to get bothersome after long periods of time (if I'm not listening to anything). Other than that, they're good.",
        "I would have given this a \"5 star\" but I lack experience with other brands and it might not be fair. The Wall St. Journal reviewed ear phones and this brand did well and that is why I bought them. They tangle easily but work very well. They even fit well under noise protection ear muffs and I can use them when running my gas powered chipper shredder. They are light weight and comfortable.",
        "Great sounding earphones!! awesome bass reponse. Only complaint I have is the cord length. Without the supplied extension cord length is to short for for mp3 player to be worn on a belt clip.Plug in the extension and guess what ?? You have about 2 feet of extra cord to contend with and the plugs add extra weight.",
        "I have indicated the degree to which I have appreciated this purchase and how it his been of value to me. Hope you have the same experience that I did and that it will be beneficial to you.",
        "I just bought my second pair of these and I love them. They are the perfect length if you were an arm band to hold your mp3 player and the ability to use the extension cord is genius. My last pair I had to throw away because the cord covering wore away, but the sound was still great. I have tried other less expensive pairs, but these are definately worth the money. The sound is great and the fit of the ear buds is awesome.",
        "These are nice earbuds, comfortable and providing nice sound for the money. My complaints are with the cord. The main cord is too short for almost any use I can imagine. The included extension is long enough to make it a bother. I also wonder what Sony was thinking in making the left earbud cord so much longer than the right. The loop it makes is long enough that it is easily caught on fingers, branches and in coat zippers.",
        "i bought these for my ipod, they are great. the ones that came with the ipod kept falling out of my ear and were uncomfortable, these stay put, cancel outside noise and sound great. i was hesitant to spend the money for a pair of headphones (the ipod wasn't cheap either!) but it was really worth it, makes the ipod so much more enjoyable. what did we do without our ipods?",
        "The sounds on these is amazing especially for the price. Unfortunately, a lot of the other reviewers comments are accurate. The cord is very long and gets tangled easily. They are designed with an extension very close to the neck, which I imagine is for using with players that strap to your upper arm, but just makes them more awkward. Ear buds fit very well.",
        "This is the only \"pricey\" earbuds I own. they are very comfortable and ideal for gym use. the behind the ear design and the very short cord combined with an armband makes this the ultimate gym going buds. as for sound quality they are decent but not great.",
        "The sound from these headphones is a major upgrade compared to the stock iPod buds. However, the cord design is awful. Its been mentioned in detail in other reviews as well. Basically the left ear piece holds the weight of the cord and the extension cord (which you will almost always need). There is a constant, annoying, pulling on the left ear. Its so irritating that I'm giving up on trying to get used to them.",
        "I bought this because I felt the Shure E3 did not have enough bass. Well, the Sony buds certainly delivered on the bass; however, there is no noise-canceling to speak of and the sound is not as crisp and clear as the E3s. But for the price, they were acceptable.",
        "I purchased and iPod which came with earphones - very large and too hard for my tiny ears. Sony's are perfect. They came with two sizes to customize for your own ear. The sound is great and they match and work with my iPod. Having the traveling hard case is a plus for protection. I just throw them into my gym bag and plug right into the TV sound system at the treadmill, bike, etc.",
        "These are the best phones I have ever used. Impressive sound and comfortable to wear for long periods. They do seal out almost all ambient sound, however, so should not be used in unsafe environments. Or around testy wives for that matter.",
        "I have found it impossible in the past to find ear buds that fit my rather small ears. These are perfect! They come with small, medium and large size adapters to fit various size ear canals. Sound is very good and noise blocking is excellent. The case, though it could be a little sturdier, is convenient and keeps the earbuds from being smashed in my purse.",
        "I bought these instead of noise canceling headphone, to block out noise on frequent plane rides. I am able to listen to movies with the volume significantly lower than standard over the ear headphones. The sound quality is great and at a great price.",
        "I bought this as a gift to my nephew a few years ago when he was a teenager. He was pleased and grateful and didn't have any issues about it.",
        "I like the short cable. Extension is supplied if needed. Short cable is perfect if iPod is in shirt pocket. Not much noise from cables rubbing on clothes makes it to the ears.",
        "Excellent headphones. I play tennis a lot and sweat like a hog. But these beauties continue to play beatutiful music inspite of the occassional abuse they get. Excellent base reproduction. Good on airplane rides too. Cancels outside noise very well. Very light and sturdy.",
        "I bought these headphones for my daughter and she just loves them for her ipod mini. The ones that came with her ipod blew out after only 1 month. She is very happy with these headphones especially because they are the in ear type.",
        "I love the fontopia headphones. I like the fact that the two cord portions that go to the earbuds are of different lengths, so that you can hang them around the back of your neck comfortably. I thought the extension cord this model offers would be a nice novelty for certain circumstances. However, the primary cord is so short -- just 16 inches -- that using the extension cord is almot a requirement. I'd suggest the EX5 model instead.",
        "Excellent sound quality, comfortable fit, and a great price. Some folks might find the cord a bit short, but I think it is perfect for either \"shirt pocket\" use or when I'm using my Nano in the gym wearing the neck cord.",
        "I bought this and other sony headphones (noice cancelling). I travel sometimes because my work and I prefer use the Fontopia headphones because they are small and the sound quality is good. In addition, they isolate the outer noise enough good due to their design. The small case is nice and protect them from scratches... I recommend this product.",
        "these sound great! if you are buying these for kids they are great because the loudness is not high!!",
        "I labored over everyone's comments before I bought these for my Ipod. The headphones that came with it fell out of my ears on a regular basis and the foam covering was gone after one or two uses and they also hurt. I bought these to use my Ipod while lifting weights and riding my bike. I know people say it's not safe to use while riding, but I do so at very low level so I can still hear traffic! If you want to tune out any outside noise they are good for that as well. I use the smallest ear bud option and they are comfortable, don't fall out, and sound great!",
        "If you want nice headphones that are extremely comfotrable compared to other in-ear style headphones, then these are good. However, the sheathing on the wires is prone to splitting open, particularly where it meets the left bud. After trying both, I suggest going for the MDR-EX51LP's, they last much much longer and provide the same awesome audio quality, and usually at a cheaper price.",
        "The law library is often noisy so I wear headphones to help me study. With my Apple headphones I listened to rock music to drown out my neighbours--now I'm rediscovering my classical collection. It's a sublime experience. I'm not a big fan of ear-plugs, but these are impressively comfortable. A random note though: I have to keep my Apple headphones for the car! They block out too much to be safe IMO.",
        "These headphones (earbuds really) are a perfect fit and stay in my ears. The sound is excellent, delivering a deep quality to the music, particluarly the bass. I've tried comparable products sold my other companies and this set is a great value for the money spent. The length of the code is rightous, too.",
        "The Sony MDR-Ex71SL/WK's were a Christmas present. The college student said they were comfortable, and sounded better than the standard headphones. (They come with their own carrying case, a nice plus for a student on the go.).",
        "I love these headphones. Comfy, blocks out all noises and it looks sleek....but they could have provided a better case and the fact that they are really designed for running. therefore one ear cord and shorter then the other is a slight nuisance. But overall they are a keeper.",
        "I have been looking for decent headphones for a while now. I started using my mp3 player more often at work and needed something with a short cord. My mp3 player hangs around my neck so I was a little sick of tripping over cords. These are the perfect length. Plus amazing sound and noise reduction.",
        "These earphones sound really good. I used them when i was at the gym and all i could hear was the music. I had mine for a few years before the wire started to wear. Would be better if they lowered the price some! =)",
        "This product does well at noise canceling while delivering quality sound, especially for the price. But its not for active wearing while working out or running because it will easily fall out. I use it now for when I am sitting around or in an air plain.",
        "I really like the extension cord that comes with this model, it makes the cord just a bit longer than others, and you can separate the headphone from the device if you want to thread the cord easily through something.",
        "Great deal for great workout/walking around/personal headphones. The sound is great. For me the only complaint I've had is that I have had to buy a new pair, because the cord has ripped from earbud to earbud. I'm a student, so I listen to them 40hr a week and put them through a lot of wear and tear. All I can say is that I'm still buying the Sony Fontopia headphones again.",
        "These work really great and would recommend them as a good replacement for the originals that come with the I-Pod. I could never get the stock I-Pod earbuds to stay in my ears.",
        "I love this product because it cuts out alot of the background noice. It is also great because others can't hear what your listening to either, even when it is at full blast, but believe me the sound is quality. Good buy!",
        "I like the sound of these headphones, however the cable system is annoying. One cable runs almost all the way to the left earbud, then it splits and runs back down your chin then loops around to the other earbud. It's not necessarily a deal-breaker, but I find it somewhat annoying and not an improvement over the traditional equal split found on essentially all other models.",
        "The sound quality of these headphones is great. Bass is deeper than you would expect. The reliability is terrible. I went through three sets of these headphones in less than 6 months, each time the left earphone went out. I would recommend the Sennheiser CX300 instead.",
        "One of the most comfortable, easy to use headphones, quality is good, it's not shure, but its right up there for its price range",
        "I tried to use these on a creative labs MP3 player but found max output too low to drive these buds. Make sure your player has lots of volume for these buds.",
        "Very comfortable could wear them all day. Great to workout in the outside noise cancel feature a real plus. They sound excellent.",
        "I can wear these headphones for hours with no pain. The included inserts will make a good fit for any ear. I have tried more expensive earphones and these fit and sound the best to me.",
        "Sounds fine. Priced a bit high in my opinion. I don't like Sony's behind-the-neck cord, but that's just my personal preference.",
        "Indeed the sound quality on these is excellent, but after about 3-4 months the cord develops a putty like consistency and peels away from the inner wire, leaving your headphones unusable. Buyer beware!",
        "Love these bad boys. Then they were eaten by a dog. So I bought another pair. Tell you anything?",
        "Really good headphones for the price...didn't have to break the bank ya know.",
        "These headphones were just what I was hoping for: a much more comfortable fit than the standard earbuds and much better sound quality.",
        "These headphones work great for my psp. Reduced the outside noise to a min. works best for me because I ride the subway system everyday to work.",
        "This earphones lack a descent extension cord. ITs very small cable, but its of good quality. Sadly, cord its too short, and the extension is useless.",
        "quality if great. clear sound. fits tightly in ear, comes with extra and different size earbuds. unbeatable price.",
        "Sounds the same as my earbuds that came with my mp3 creative player. It's a waste of money.",
        "I don't find these headphones comfortable in the least, and they don't create a proper seal for sound isolation. I've also purchased the Shure E2c and Etymotic ER6i, and the only ones that actually work (comfortably) are the Etymotics. Another misfire from $ony.",
        "I should have believed the previous reviews - the sound stinks - very tinny - no bass. Sony should be embarassed to put thier name on it - I'll think again before buying Sony. Also the cord is oddly assymetric and does not hang right. Terrible product - what were they thinking?",
        "I haven't even plugged these in and am already annoyed. The cord is designed more to show off the SONY logo instead of comfort or what you're use to with any other set. I am not going to sacrifice comfort just so I can act as their billboard. Instead of meeting in the middle, both L & R wires come together on one side, so you have this stupid metal clip/logo hanging right next to your face, hitting you as you move around. I tried them on and was instantly annoyed. Who the hell designed these stupid things? Keep looking, these suck.",
        "A big step up from factory iPod earbuds. Instruments sound clear and distinct. Definitely highly recommended",
        "Love my headphones. I can hardly hear any outside noise and the service was awesome.",
        "I have had headphones before that promised much but delivered little. This is a quality product for a great price!",
        "Great sound quality. The only problem is they fit so well that you can hear yourself breathing.",
        "I ordered these headphones because the ones that came with my mp3 player are a little too big for my ears, and tend to pop out. I liked the idea of a \"small\" sized ear plug. When I got these, I tried them out immediately & was NOT impressed. I must have exceptionally small ears, because even the small sized plug didn't fit quite right. And once I got them settled, the sound quality (something that I didn't think would be that noticeable) was crap compared to the buds that came with my player. Very disappointing... returned them the same day I got them.",
        "SONY SUCKS!!! Dont buy sony products. Their customer service is the worst. These headphones have the weakest wires connecting them. To get it replaced, you have to first send it to a service center then they will charge you more than the cost of the headphones and screw you. Take my advice, don't ever buy a sony product."
    ]
}