{
    "entity": "Earbud Headphones",
    "text": [
        "This was my second pair of these headphones. I loved the noise-cancelling attributes and the sound quality is pretty good. I wish there were volume control buttons on the cord - a perk it's hard to live without once you've had it. I gave three stars because the connection of the wire at the plug became exposed in less than a year of use. I figured it was because I stretched the cord as I wrapped it around my mp3 player every day. I bought this second pair and took better care of it and it still happened.",
        "You can't beat the quality for the price. They're worth every penny and much more.",
        "Great sound with nice bass. A little warm sounding, but I like it that way.",
        "I've had these since December 9th, and my first impression was that it's near perfect. However, as time went on, the flaws became more apparent. First of all, the ear buds are very small. That may sound like a good thing, but putting it on requires delicacy. I've often bend the wires because the ear buds are too small for my hands (and my hands are small already). Secondly, the wires misshape itself. This sounds weird, but the wires do become crookedly and there's nothing you can do to reshape it. Sound quality wise, it fairs little better than the V-Moda.",
        "I've used these while commuting in a vanpool for a couple of months now. I have never before liked the feeling of any in-ear device, so this was a risky purchase for me. These come with 3 sets of different sized ear pieces. They are so soft and fit so well, that they are comfortable for me. The bass is not like my Sennheisers, but hey, they are less expensive and TEENY. I just wish the carry case would hold the airplane adapter.",
        "The most un-belieavible sound playback--EVER--!!--they require constant cleaning in order that they remain inside the ear canal..I can wear them all day..walking around the city and they might fall out 3-times/..but I do make slight adjustments..they become..NON-feeling..at times you can't even feel them..but the stereo quality is quite amazing..I doubt I can ever use a different type of headphone.",
        "I first purchased these in 2006 and they work just as perfectly as they did then. They block out ambient noise while producing clear, crisp music with solid bass. They fit comfortably and can be worn for hours without discomfort. As a creative customer, this product has the simple yet solid design that i look for in a product. Update (February 2013): The right ear started to get fuzzy and then cut out all together. All in all, not bad for 7 years of daily rigorous usage. I just ordered a new pair.",
        "These are awesome for the price. I'm going to get 1 or 2 more. Sound is quality. My first pair were about twice and then some. They were worth it. That was 7 yrs ago. I'm careful with them too. Do not wrap them tightly.",
        "I am a musician who uses the Aurvana as in-ear monitors on stage. They have similar frequency response but much lower cost than Shure E5's. The cable doesn't look as sturdy as the Shure brand, but I have had no cable shorts or breaks after 1.5 years. Noise reduction is excellent. The package does not include any wrap-around ear forms. If you are a musician or using for workouts at the gym, I recommend purchasing an accessory kit with wrap-around forms. Wear the cable to the back of your head, not under your chin. Move the cable slide snug to the back of your hairline and the buds will stay fixed in your ears.",
        "this is the best earphones i have baught an i am so amazed at the audio quality its like you are right there in the studio picture it that way its flawless the higs and mids and everythingis beyond outstaning its amazing i think if they break iw ill buy another pair they are just so awesome hope this review helped since i am an audiophile",
        "I'm just me - no savvy in the tech world, but sure do know what good sound should be. I had a cheaper pair of earbuds from Sony and these far and away surpass them in sound. In fact, I was surprised at the different levels of instrumentation I heard that I had not heard before from the same CD's. They are comfortable and really quiet down exterior noise. So very glad I invested a little more in this set - and - it was on sale!",
        "One wire came out of the socket, in the first week. They are still usable but you should put them in a case when not being used (Case does not come with the buds.)",
        "These headphones are great & have excellent sound quality. You will love these. Only con is the cord quality isn't so hot. o beware of this.",
        "You can hear things with these ear headphone that you can't with others. If I had ordered it from Creative directly, I would have paid double the price. The quality is exactly as described. Noise reduction is great! Love these. Have owned a pair before. Would buy again!",
        "Excellent sound and very good noise cancellation- stereo separation and bass are also very good",
        "These ear plugs are the best so far. The angle fit the ear perfect for me and like other earphones these don't start slipping out of the ear, and the wires don't tangle as other. The carrying case is also great to store the ear earphones. I listen to alot of audio books and the sound is clear in the earphones.",
        "I'M HARD OF HEARING. THE QUALITY OF SOUND IS AMAZING. IT FITS VERY WELL INSIDE OF MY EAR CANAL AND IS VERY COMFORTABLE. IT IS AMAZING TO HEAR SOME SOUNDS I HAVE NOT HEARD WELL IN MANY YEARS",
        "I had sony MDR-AS40EX before this which I got for 40 bucks; unfortunately its left side ear piece got short. So I ordered creative aruvana and got these delivered yesterday. The packing was shiny and while opening I felt like the sound should be amazing too. But the joy didnt last a second I listened to the earphones. It was too loud, I know how to adjust the volume. But when you put it to nominal level the Bass disappears. My friend had 10 bucks panasonic earphones. Which when we compared sounded better than this piece of crap.",
        "Ear plugs work well. Volume doesn't get as loud as I would like but they do block most of the outside noise. They don't stay in the ear as securely as I feel they should.",
        "I love these ear buds. This pair replacing a pair that were damaged on my part.",
        "Pretty sure my pair is defective, but sound is incredibly muffled.",
        "These phones have a sharp, clear sound with good bass. This is the second pair I have bought and I use them to monitor the band in which i play. Best phones for the money. You can pay more and get less in other professional phones.",
        "I wish I had bought 2 more packs... just as a spare for future years!",
        "The service from Amazon was amazingly fast. Thanks The product: Honestly, my $15 creative headphones have better sound! By far. Low frequencies are awful! For a $110 set, I feel generous with 2 stars.",
        "I thought I was going to get a quality product at a good price. I really like my Creative Zen Player and assumed that their earphones would be as good. Wrong. They seem to be of a 10 -20 dollar quality, maybe something that kids would get. Very limited response range. I was missing half the music. It was meant to be a gift, but I was curious to see if I should get some for my self. I am sorry I bought them.",
        "If you want good looking, portable noise cancellation that doesn't require batteries, these are the earphones for you! I don't have a single complaint.",
        "The earphones are a snug fit, easy to insert and sound marvelous. Great choice and well worth the money.",
        "Creative has a excellent ear bud here, good fit and sets into the ear perfectly",
        "I really do not understand all the one and two star reviews other than this is a hit-and-miss product. Well I must have a HIT. I got them by default after I bought them for my wife who does not like anything in her ear canal. She wouldn't even try them. I did and I was sold. The sound is great with really good mid-ranges. I use them more on trips and never when I am engaged in physical activity. I have other ear phones for that. I have fallen asleep with them in my ear several times and NO other in-ear headphones are comfortable enough for me to do that.",
        "These are very comfortable, small and light, and they block the ambient noise very well. There are a couple of major problems however. One is that the chord is microphonic. It transmits a loud scraping sound to the earpieces when it rubs on your face or clothing. The other is the response. The only other earphones I have to compare it against are the Ultimate Ears Super.fi 3, (a.k.a. Altec Lansing UHP336). The Zen suffers very badly by comparison. It has an uneven frequency response with a bump in the mid treble range around 3kHz to 5kHz that makes it sound shouty. Another nit is that there is no room in the supplied carrying case for the airplane connection adapter.",
        "These earbuds fit nice and snug helping to eliminate ambient noise. They need to be broken in to sound their best, fresh out of the box they can sound a bit tinny and don't expect a thumping bass. I was fairly happy with the way they sounded after the break in period, the sound was fairly clear, the mid range was decent as was the top end. Downside, these things are fragile. Mine malfunctioned after only moderate use due likely to frayed wiring and the thin cables pass on external noise from rubbing and movement. So make sure you buy these from a reputable dealer with a good return policy.",
        "The Creative Zen Aurvana In-Ear Headphones is a good product, but it doesn't work when I run. If I'm using the stairmaster they work just fine, and even walking on the treadmill is fine. The problem is running either on the treadmill or outdoors - I can hear the pounding of my feet that reverberates through the body in my ears. I don't have that issue with earphones that fit over the ear. The product comes with different size ear molds - that's great because I had to play with the different sizes until I found a combination that works for me. Overall, I'm not sure this product was worth the price.",
        "I had to replace the stock earphones that shipped with my Creative ZEN Vision M. After alot of looking around I found the Aurvana ZEN earphones and ordered a set. I am very happy with the performance for the size of these earphones and they block outside noise well. If you are looking for great BASS performance get some good to great Headphones because earphones just aren't big enough to pull off great BASS responce and never will be. With listening devices size can matter alot. If you want something that works well with a portable like an MP3 player or a laptop I would consider these to be a good choice.",
        "Do not purchase.This is my third pair.The left channel has gone out on all three.The last set I sent back to creative and they sent me back someones broken earbuds.Their India technical support is useless.Good luck If you decide to purchase.I bought the first pair in November 2007.",
        "I purchased these at a airport, so returning them to the store is next to impossible, they worked for about 10 minutes, after contacting the store they pawned me off on the company and after contacting Creative they tried to pawn me off on the store, after finally contacting Creative by email the only way to contact them, they expect me to pay to return them to their service department and pay a fee to look at them. I should have stuck with Shure great customer service and they actually work.",
        "I got these about 8 years ago from circuit city for about $110.00 and they still work like new. i use them with my phone and they play better then any other ear buds i have ever used. Im not sure if the ones i got are the same name as these but they are the same. The only thing i wish they had was a little more bass.",
        "i have had many headphone especially in ears and for the money these are the best of them all the lows could be lower but the highs are there i would definately recoomend these headphones to anyone willing to spend the money for them",
        "BEST in-ear earphones I've had (Boles full headset are as good but cumbersome at work). They really block out outside noise and the sound quality is fantastic - excellent product and a great price. I highly recommend!",
        "Much better than my bose earbuds they block outside nose better and actually stay in my ears while at the gym the bose never did. With the better fit I dont have to turn up the sound as much and they sound great",
        "I purchased my first in-ear-headphones for myself in March. Sound quality is good. External noise reduction is also good. I surprised my wife and bought a set for her when she lost her other headset.",
        "I purchased this product from Amazon as a Christmas gift. It was delivered broken and unusable, yet Amazon and BlueProton have both refused the return. BUYERS...BE AWARE!",
        "You really don't hear anything besides your music!!! I love going to the gym and getting \"in my zone.\" A little pricey, but worth it.",
        "Great earphones. i had the Bose before these although the Bose had a little deeper base overall sound these are much better. They go great with my Zen.",
        "These are small, light and comfortable. That's the good part. They also sound very tinny and thin. Very little bass. I've put them away and chalked them up as a total loss. I'm using my old phones. They're a bit bigger and heavier, but they sound much better. If you like flat frequency response, look elsewhere. If you're only listening to voice, these might be just fine.",
        "ok... these headphones are ok.but u cant return them and they hurt ears do yourself a favor and do not buy these"
    ]
}