{
    "entity": "Outdoor Speakers",
    "text": [
        "I've had these speakers for 8 years. The sit on an outdoor wall, exposed to the elements on a windy corner patio is NYC. They've survived 2 hurricanes, 2 tornadoes, snowmageddon, snowpocalypse, Bloomberg, de Blasio, and some pretty intense heat. I haven't taken them down or covered them in the winter, and they still sound great. Only now are the grilles starting to rust. Hard to go wrong at this price.",
        "Mounted these on the south side of my house in Colorado. Yes, the south side is the warmest but temps have only reached the low 90s. They have been mounted for less than a week and as you can see from the picture, they are starting to melt. Clearly the plastic used is not build to stand up to the sun. The sound for the price is fair and I'd keep them if they were not oozing off the walls.",
        "These are really nice sounding, well built speakers. Their installation is easy and versatile, either with the included sturdy brackets or can simply hang on the wall directly via the screw hole. Construction is solid and they have a bit of weight. The composite plastic material with which they're built should see them withstand the elements - but that's not how I'm using them. I'm using them indoors as mains in my store room setup, with a separate 8-inch sub that complements their sound. They do sound really good, though. There is some bass and the heights are not harsh at all. No distortion at high volumes from my Sony receiver. Nice clean sound. Highly recommend.",
        "Let me start with this, I’m an audio freak, I usually always have top of the line equipment in my cars, home, boat, rv everywhere. I was skeptical to buy a set of speakers priced well under $50, but they are for outside around my pool, what could it hurt? These speakers exceeded my expectations 10x over. They sound great, no distortion, even with the volume cranked up(on a high quality amplifier). I ran 14 gauge oxygen free copper stranded speaker wire, the book recommends at least 18 gauge but mine are a good distance away from the receiver and amplifier. Great product, amazing value, I will be buying more!!",
        "For the price, the sound quality is exactly what you would expect. The frequency response is definitely geared towards mid/high range, but with some equalization they can sound flat \"enough\". The construction quality appears to be good, they don't look or feel \"cheap\", the mounting hardware is entirely acceptable, and the packaging should prevent shipping damage in all but the most careless of situations. I paired these with a cheap amplifier for ambient noise on my porch, and they work more than well enough for that. These are not the quality of Polk, Klipsch, or ElectroVoice, but they are more than sufficient for their intended usage.",
        "These speakers are slightly smaller the the Yamaha outdoor speakers I have on a different outside wall of my garage, but the sound seems comparable. I got the Yamahas using hotel points. Looking at their price I could buy 3 sets of these. I’ve only had them up for about a month, but so far they seem to be doing fine. If they hold up over the winter, I’ll try to remember to bump them up to 5 stars.",
        "I use these bookshelf speakers to monitor audio on my PC Digital Audio Workstation. They produce very nice, clean sound in an attractive, durable package. You should only plan on using these for lower intensity work like PC audio through a 20 watt amplifier to boost volume or for light background music. They are not \"foreground\" speakers so forget playing party music through them, using them for home theater, or D.J.ing at a nightclub. They're exactly what they purport to be: nice sounding, nice looking bookshelf speakers (they come with nice wall mount brackets too). Used in the application for which they were intended, you will be very happy with them. And a good price, too.",
        "Sound quality is acceptable but product broke. Cannot mount now due to broken clip, rendering item useless to me. Unfortunately unable to contact seller as return window has closed. Happy to revise this review if I'm contacted by the seller. I did like the product up until the point I attempted to mount it but at this point it is worthless. First pic shows how female part of clip collapsed within, second pic shows other end (how item should be). Very disappointed.",
        "I'm a mechanic and I bought these to use at work out in the shop. They sound like garbage. They have no bass. Very empty/tinny sounding. For about 10$ each, it's hard to complain though. I listened to these for about 3 minutes before ordering Atrium 5s for almost 10X the price. If you really only have $25 to spend or you think they're probably going to get destroyed, these will play music. If you appreciate sound quality AT ALL, you'll need something better than these.",
        "I have 4 of these, and they have lived outside for 6 months with no ill effects. Surprisingly good quality speakers for the price as long as you're not expecting large amounts of bass (not their purpose). I did have the issue of the mounting screws breaking off inside the box, which is annoying, but I had several lengths of 1/4\" threaded bolts that fit snugly into the holes and allowed me to mount them without using the provided hardware. Considering the price of these pretty good speakers, I good with that being their only issue.",
        "I have these on the back patio connected to a small 3\"x5\"x1\" amp connected to an Echo Input mounted under the eaves. Both the amp and Echo Input are plugged into an outdoor smart switch. This gives me voice controlled access to music on the back patio (and I can turn it all on from inside the house and off from outside). These have been rained on heavily and still work great. Sound is decent - I'm not an audiophile but when I tell Alexa \"volume 9\" it's more than loud enough to annoy the neighbors :) Not that I do that... Great value for the price, would recommend.",
        "I bought these for use inside my garage - 2 pair. I was shocked at the quality of sound these speakers produced! For the price, I really wasn't expecting much - but OMG - AMAZING crystal clear sound! Can't speak to weather proof because I use them INSIDE the garage, but read many very good reviews about these things surviving hurricanes, etc. on someone's patio. If they can survive the body dust, humidity, heat and cold out here - I'll be a happy camper! Lots of great reviews and they were not wrong - these are very impressive speakers for the price!",
        "First set came with no mounting brackets. I sent them back. Second set came with no mounting screws, and the front grills caved in . Neither of these are minor imperfections. Not worth getting ten bucks off. I'll try them before I mount them to see how they sound, but I'll probably return them, and get new speakers, or, and, another brand . In the condition I recieved these speakers, if expect to pay around 5 bucks at a garage sale",
        "Bought these to get set up with an old stereo with a record player attached that I found outside in front of someone’s trash... I figured I would take a shot in the dark and buy some cheap speakers to see if the payer would work and it does! The speakers served their purpose for me and they actually work pretty well. Very happy. For the price you pay I was expecting them to sound pretty crappy but they’re actually not bad. Easy set up after I went to Lowe’s to get the speaker wire. Pro tip: buy more speaker wire then you think you’ll need, you’ll thank me later. Overall 8.6/10",
        "I read the reviews and thought for the price, why not. When I got them I tried them out and was very disappointed. Upon examining the reviews, I found that this speaker (LU43PB), and its bigger brother (LU53PB) both had the same reviews. Most of te reviews ended up being for the next model up. This speaker works, but just doesn't cut it for me. I wanted to use it for an outside, back porch home theater. I'm a bit picky on sound quality and",
        "I.. AM.. BLOWN.. AWAY!!! I paired these with a small nobsound 100w amp and WOW!!! :O :D How speakers in such a small package could deliver such range, such depth and kick out such great bass!?!? This is sound quality you expect from Pioneer or Bose... quality sound plain and simple. Will these fit what you want? That depends. I get what I want just fine out of these two with the 100w amp. In time, I will add a sub for that true \"earth shaking\" bass. Later two more of these speakers for a perfect 5.1 system.",
        "Great sound, my only complaint is It automatically reconnects to its previous Bluetooth source. So if you are attempting to connect a Bluetooth device that was not The device previously connected you must manually disconnect from the other device. Can be a pain having to go find the last person connected and have them disconnect before you can connect your device. This is on the porch that the family uses and constantly having to go disconnect the previous user.",
        "Would I replace my bookshelf speakers with these? No. But they're excellent on the patio. I wanted to listen to my records and tapes outside as well. My stereo has A B speaker selector so putting wired speakers outside made sense to me. It's definitely Dual only by name, it probably has nothing to do with the Dual that made famous turntables back in the day. But for the price these are just awesome. I mounted them under my patio roof and it rained a couple of times since she these are still good. Pool prettier are going to be more fun this summer given we can have guests due to covid19.",
        "I installed these with an inexpensive Mini Bluetooth Hi-Fi Stereo Audio Amplifier so I could have some music while working in my garage. Installation was easy with the supplied brackets. I like that the brackets allowed me to swivel the speakers to get the best coverage in such a large space. For the price, sound quality and construction were good. If I ever want to add tunes to our back deck, I'll probably pick up another pair of these.",
        "I have 3 pairs of these speakers, all mounted outdoors. After a couple of years, they are still performing perfectly! No rust, no corrosion. Sound is good. No deep bass, but still a very crisp and loud speaker. I have one pair mounted under patio and 2 pair mounted about 12 ft up in trees. I did fabricate an overhang for the ones in trees so they are not completely exposed to the weather. These are a great buy! I would absolutely buy again.",
        "Just got around to mounting the speakers and using them. Cant get above 45db without making them staticy, when I attempted to mount them the screw that attatches to the bracket into the speaker broke off and now rattles around inside. Didnt even get 1 day of use out of them, headed straight for the garbage can, gonna pick up some higher quality speakers.",
        "Surpassed expectations! Originally got as surrounds for garage setup, but got bug to mount as patio speakers. Sound is very impressive for price and size. Mounted under lower roof eaves, so hopefully will hold up weather wise, as advertised.. They sound VERY good in this install! Have ordered second pair for the garage surround setup. So far highly recommend. Flexible mounts, keyhole vertical hang and brackets for vertical or horizontal mount included. Dual logo even rotates for horizontal mount!",
        "Okay, I was really skeptical about these speakers before purchasing. I mean $34.99?? How good could they be right? They are amazing! I actually now have two sets. One I am using as surround speakers and the other I am putting in my boat (they come in white too). They actually have decent bass and the highs are pretty accurate and crisp. Throw in a subwoofer and people will think you spent hundreds on them. It's nice to see a well balanced speaker that works so well at such an amazingly low price.",
        "These have spring clip terminals which seems to be the norm these days. The ones they use really aren't very strong and don't hold in the wires very tightly. I mounted these on the wall and 3 times when I thought I was done there was no sound: the wires had slipped out. I ended up putting packing tape over the terminals and the wires to hold them in place. Other than that, these sound pretty good. I'm only driving them at 10 watts and really can't give them a very empirical review. But they work fine for my Echo Dot application and appear to be fairly solidly built.",
        "These are just for inside my shed when I'm working on something. Not very high volume. Running off a Pioneer 2 channel receiver (previous speakers were 20 yr old Polk that sounded great! but were very old and dry rotted). These have absolutely no lower end at all. Pretty much anything less than 300 hz is not there. These are so bad, I plan on packing them up and returning.",
        "I've been shopping on Amazon since about 1998? These are the best value ever! I had Polk Atriums for 10 years. They were great, but they blew out from old age, so I had to replace. Saw the very good reviews on these and took a chance. (Not much of a chance because it was backed by Amazon Prime). Anyway they sound as good as the Polk's and at $34.00, they are a steal! Best value on Amazon!",
        "I read all the reviews and really thought I would like this set of speakers. The quality of sound is clear at low volume but once turned up the quality is not there. If you have a very small space (I would say less than 10 x 10 outside area) you will want something else that has a more powerful sound if you are going to do any entertaining. If all u want is faint background music this will work for you. Unfortunately it didnt work for me.",
        "Great Wall mount speakers! I installed these behind a low cost Pyle amp and connected to a projector to be used as a low cost entertainment center. The sound is great! I had no issues with these speakers while installing and all necessary hardware was included though I recommend using higher quality screws and anchors. The speakers look decent and sound great!",
        "I had planned to have two sets of these speakers on the side of my house. I bought one set to test them and see if they were good enough. I have a 7-acre property, and these speakers turn up halfways can be heard throughout the property. They are impressive speakers, I already ran the cable for the other set of speakers, but they are not needed, I will most likely set them up another set any way how they are so inexpensive, but they are not required.",
        "Finally replaced my 15 year old outdoor speakers. Had to choose from 3 offerings on Amazon, these were the cheapest ones but I am so satisfied. They are really constructed well and have good sound. I hooked them up to my house stereo and the base is very good for the price. So much better than I had before my 11 year old daughter blasted my old ones last week. Don't know why I would spend $100-$200 on a name brand offering slightly better sound.",
        "Not what I expected, but for the money. I gess, you get what you pay for. Sound is OK. But there's not much base. I don't know what other people are talking about when they said \"there was plenty of bass.\" Cuz there is none. And I'm not lessening to rap. Just classic rock. I'll leave them up and adjust my review as time goes by.",
        "I’ll have to give these five stars for the price quality and sound. They seem well built and sound great for there size they sound great across my 3 acre yard. Granted by their size they have limited bass and should be expected. They were a lot better than anticipated. I have these mounted under the eaves of my detached garage for when I’m working outside and they wired to a marine stereo mounted in a pod under a shelf. It is a solar powered setup. Play it almost daily and the speakers have survived three hash storms. Pleased with my purchase.",
        "Added to old school stereo for speakers in the basement. These work almost as well as the high dollar ones I have on the patio. I will buy the next size larger for my garage next. Good value for me. These did not go in a outdoor damp environment like some of the others so I can't attest to how well the grills hold up in the damp. My amp is an Onkio 125 watts with a total of 3 sets of speakers on it and I crank these pretty good with no distortion .",
        "I ordered this product and only one of two speakers were functional. I requested a replacement and was sent another set and again only one of two were functional. The one speaker that worked had white paint spatter on it and dirt and spider webs on the connectors. Clearly the functional speaker was used. I decided to keep the used speaker along with the functional speaker from the other set and returned the two nonfunctional speakers.",
        "These speakers were okay (not great) sounding. Not bad for the price though. That being said, 14 months in and 1 speaker no longer works and the other has developed some static. They have been kept outside, out of direct rainfall, but exposed to the heat, humidity, and the cold. Perhaps nothing is going to last more than a year or so in these conditions. But these things DEFINITELY will not.",
        "these speakers are excellent, they have a powerful and clear sound. I put them in the bathroom and it seems to have a party every time we used it. They have 9 months and still look like new even moisture to which they are exposed",
        "the speakers sound good but, as in other reviews, one of the female mounting stud pushed into the interior of the box when the bracket mounting screw was inserted (carefully i might add....aware of other reviews). no way to get the stud out other than breaking the case open. i was able to use a drywall molly bolt to fix the problem. no biggie for me but disappointing that this is a common problem that has not been addressed.",
        "Got 4 of these for an outside deck. Powered off a basic stereo amp. Also ran through a wall knob for volume adjustment. I have been very pleased with these speakers. You really can't beat them for this price and value. My only complaint is the back connectors are weak. It took me a few tries to get some of them connected and hung without the wires coming out [14awg]. I ended up using puddy to keep the wires in place and hopefully reduce corrosion outside.",
        "These speakers are small but extremely loud. Unless your trying to suppress the sound of metal band playing next door with a good receiver you don't need another speaker set. They are loud! Sound quality is great. You can't beat the price either. I set up dual sets for surround sound and I shut the one set off because it's to loud. Love them!",
        "I bought a set of these a year or two ago, and wanted to \"check-out\" how weatherproof they were. I mounted them around my pool deck so they are exposed to ALL the elements. I was so impressed with them that I bought another set just recently (AUG 2020) to add to the back deck. The sound that comes from these little speakers is exactly what I wanted and is good quality as well. Yes I would recommend them to anyone.",
        "Initial thoughts unbelievable sound for the price.l was not looking to blow the neighborhood away,just wanted some good quality sound at moderate levels. These speakers delivered,knew as soon as I lifted the box up that the weight was a good indication of a solid speakers. What a steal for the price,just don't be expecting to wake the dead",
        "UPDATED: Added a star as I have been using these for quite a while and just bought a second set for under the porch. Very happy with these and feel they are a good value. Just installed these on my porch. No need for super loud sound and these sound really good at the volumes I am using them for. Very happy with the purchase and in fact will be buying a second pair for under my porch outside. I only gave them 4 stars because I’ve only used them for an hour so far.",
        "Hooked them up to a brand new Pyle 100W receiver (recommended by amazon to purchase to gether) and you can't even turn the volue up half way and they are totally distorted! By some Rockwood speakers for twice as much and then water seal them with sealer... much better system!",
        "Highs are decent. Bass is tinny and thin. To be fair I am in audio engineering but the bass response is junky, tinny and thin. I do own a small bluetooth portable speaker that has a richer sound response. If you plan to use predominantly outside, by a pool, deck, etc. These would be acceptable. Use for indoors is not recommended due to poor sound response.",
        "I had to open one of the speakers and re-solder one of the wires on. I wasn't going to rebox everything and send it back just to buy another set. I had already installed everything. Its a good thing i know how to open things up and solder. It works now. Its a little crappy to have to fix something brand new out of the box. The product quality is kinda cheap but the sound quality is great for the price!",
        "These where perfect replacement speakers for my needs, not your high end speakers however teamed up with an outdoor subwoofer you do have plenty of sound to go around and good quality too! I wasn’t looking to spend an arm and leg for speakers but did want something that worked for me!",
        "Got this product as expected. The actual size of the speakers was much smaller than I expected...but no issue there. The speakers sound good enough for the price. That said, one of the speakers went bad within a week. If I have time, I will contact for return. I had no issues with the wire connectors or with the mounting hardware as other have experienced. Even with the issue, I would buy these again. I mean for this price if it works for a year it would be worth it!",
        "Hooked 4 of these up to a Fosi audio BT20A mini Hi-Fi amplifier. Bought two sets on sale. 2 speakers per channel ran in series. Not much bass but loud. Not the cream of the crop but a cheap speaker set that gets the job done.",
        "I'm using these with a Kinter K2020A amp for desktop speakers. Probably a bit overkill. The sound quality is SO GOOD with decent bass and good treble. I'm kinda fussy about the treble due to bad ears so its' great to hear it through this combination. I don't regret spending the bucks for these.",
        "Excellent affordable speaker solution for a backyard patio space. I have these mounted on the outside of my garage facing the patio area. Buy the suggested Bluetooth amplifier and make your life easy. Wired them and had no issues out of the box. Paired my echo dot in the garage with the Bluetooth unit and have full control over all of my music libraries. For the price, these are great and produce a pretty decent sound for being as small as they are.",
        "Dual LU43PB 3-way Indoor/Outdoor Speakers... Sold By: DUAL I have an entertainment system on my patio and chose these for the sound system. They are Indoor / Outdoor speakers but best to place them under cover to protect them from weather. The base is not earth shattering but the sound is acceptable. The enclosures are well made and are put together well. They should hold up for a long time or until they get replaced by a bluetooth system. They ARE NOT amplified speakers, only the speaker is in this enclosure. I would recommend them. I DID NOT receive compensation for my unbiased review.",
        "These aren't bad. I have them wired onto my deck for projector speakers. The colimenis good of driven correctly. Great for rock or even speaking (movies) not really good for bass. Like, at all. Kind of a bummer but the price reflects it. You get what you pay for.",
        "I got these with a great deal and I wasn't really expecting much from them. I merely wanted to complete 2 surround systems I have, so when I hooked them up I was impressed by what I heard. And am very happy I purchased 2 sets. And where I come from, 2 sets of speakers for $50 that sound great, is a no brainer.",
        "These speakers are a good size. The swivel mount is a great feature to move the direction of the speaker as needed. The sound is quiet. Doesn't work well with others across the room. I installed them in my shop to gain sound in the last spot without any speakers. I can hear the other speakers I have set up better than these ones, while standing next to the Dual Electronics ones.",
        "We used these in a commercial setting for smaller patios at restaurants and bars and they work great for that. The sound quality is decent you just have to make sure not to send too much power to them other than that you can’t beat the price for the pair",
        "Great indoor/outdoor speakers with small footprint. Connector terminals for speakers are very weak and cables easily fall out. Need a stronger spring or a screw type. I worked around this by making a solder ball at the end of the cable to catch better in the terminal clamp. Solid performance for the price but admit that my HEOS1 smart speakers deliver a fuller sound (but at 5x price). Still cannot beat the price with solid performance of these speakers. Perfect for the uses I bought them for, small office speakers for my old-school stereo and outdoor speakers for parties.",
        "Bought in June 2019. It's now February 2020 and one speaker is blown already. We have neighbors so it's not as if they get cranked up loud. I wish I could recall the name of the pair of speakers I had prior to these. They were also inexpensive but lasted almost six years. Very disappointing.",
        "The speaker wire connection broke the first day I try to install a new wire. This speaker sounds distorted when you play it at someway medium too loud. If it’s on low setting the sound quality is not too bad at all. You get what you pay for these would be perfect for small room setting or even like a garage. I had them installed for my outdoor pool deck and honestly was not worth the money. And worst of all, you can’t turn them up because hey will sound distorted. Even at a mid to low setting",
        "I installed these speakers in my garage, and so far I love them. They sound very good (especially considering the price) and they look really nice. The mounting brackets couldn't be any more simple to use, and they keep the speaker very firmly attached.",
        "Great sound and quality. I keep in my backyard to use with my projector or connect to my phone for music",
        "These speakers work and sound great as I matched the exact specifications to the output of my amplifier. Easy to install but I do share the same concern with previous write-ups while connecting the speaker wires to the speakers if you're not careful it can pop loose as the connecters are not the greatest. Other than that they pack a little punch for my outdoor porch speakers",
        "I've always been a stickler for great sound on a budget and these little jewels deliver! MOST low cost speakers boost the mid range to make them loud (and muddy). Not these gems. Of course to really enjoy them I recommend a powered sub but they deliver beautiful mids and highs.",
        "These sound much better than I had hoped for at this price point. I have them mounted on the side of my house by my back deck and they provide more than enough sound for my patio area. The only reason I give them four stars instead of five is because the spring loaded tabs for connecting the speaker wires on the back are very cheap and pop out when connecting larger gauge speaker wire. I had to fix them several times before I finally got them to stay in but I'm still not confident that they'll remain connected long term.",
        "I wanted some cheap speakers for outdoor use on my patio, and these fit the bill perfectly. No, they don't sound as good as the Bose speakers I have in my house, but at this price point and for what I'm using them for, the work fine.",
        "I have only had these speakers for a week. They are okay for what we're using them for. It only took me a few minutes to mount them. I'm going to wait a while before ordering two more. I want to see how these hold up first.",
        "I was hesitant to buy because of the price and different reviews, but the good thing about Amazon if you don't like them send them back. They are under priced for the quality. Not disappointed would buy again without hesitation",
        "I bought these speakers a little over three years now for my outdoor patio/bar. They are up throughout the spring/summer/fall seasons in NJ. I take them down and store them in the winter months. I have not seen or noticed any issues with these speakers. They hold up nicely throughout each season, and for me they do not give me any problem in the weather. One speaker is under cover but the other speaker is out taking a beating from mother nature. Each year I rotate each speaker from uncover to not to help keep the ware even. Like I said before very great sound, and quality.",
        "Great speakers for their price! So far they have held up to the weather, they were easy to instal and to even pull off the bracket and move around if i want them inside. They give great sound when set up with a subwoofer and make it all the way across my yard which is pretty big, so thats a plus!",
        "Surprisingly good sound for the price. Good value at 3 times the price. My only quibble is with the spring clip speaker wire connections. The springs seem a bit weak resulting in intermittent connection if the wire is gently touched. I'm sure there is a work-around; perhaps tinning the stranded speaker wire or adding a crimped lug.",
        "These for the money are a great buy. Compact with decent sound. Not a bunch of low end but plenty for my patio which has 3 stone walls. I placed them in the corners on the ground so the low end is perfect for this application.",
        "Nice looking speakers, not the best quality sounding but they work for the deck outside. Update: after a couple months with minimal use, the sound quality seems even worse. Even replaced the wiring, but it’s definitely the speakers themselves. You get what you pay for I guess.",
        "they are great for the money and sound great. Very easy install. But at the price all the bracket and hardware are a little flimsy, but you only have to worry about it during the install once they are mounted they are solid.",
        "Missing screws for wall mount but not a issue for me. Sound is ok. Wanted cheap speakers for outside so would be thieves will leave alone. would buy over again because of price. Bought 2nd set for Inside Family room .Works Great!",
        "Not bad at all for the price. I have them mounted under my patio cover facing outwards into the yard. They get pretty loud but when turned up I have to lower the bass to prevent distortion. But at normal levels they sound pretty good.",
        "great speaker for the price, bought it with the Dual Bluetooth amp. Its a good combo for music by the pool, its loud, but not a concert. I paired it an Alexa DOT and installation was completed under an hour.",
        "Bought six speakers for my backyard. Thought they would be OK at beat but was shocked that they do very well. I am very happy with them and would buy more when needed. Excellent product. I’m picky on this kind of stuff so to give this five stars is a big deal",
        "Needed 2 extra speakers to add to an enclosed area in our workshop. These fit the bill perfectly. Decent sound for what we needed and easy to click in speaker wires. for the price you can't beat them.",
        "Well you really get what u pay for. They soumded great 1 day the next day 1 went out oh now cant replace 1 so i kept them with only 1 working. Now the other one is going out ha today was the last day for a return to.",
        "I've been looking for wired speakers to set up surround sound for TV, DVD and CD. I'd read that these inexpensive speakers had good sound, and I gave it a shot. I'm finding the sound to be excellent, both at very low and higher volumes. I think the set was under $35 for two, which made me a little leery, but I trusted other reviews I'd read, and have not been disappointed.",
        "BOUGHT 4 OF THEM FOR MY SHOP SO NOT IN THE WEATHER BUT THEY SOUND GREAT NOT A REAL POWERFUL STEREO GREAT BUY FOR THE SHOP FOR THE MONEY. SPRINGS DONT HOLD WIRE IN TIGHT BUT WORKS AS LONG AS THE WIRE HAS SOME SLACK",
        "These are replacement speakers for our super old ones on our pool deck/ patio. Good sound quality even in higher volumes. Easy to install. I was skeptical about these when ordering because of the price point but don't be. I couldn't believe how good they sound for the price. They meet our needs perfectly.",
        "I bought these to replace some ancient outdoor speakers we had and they were great right out of the box. However, it only took one rain to make everything start rusting. They take tweaking with the wires now to make them work and the sound is not nearly as good.",
        "Speakers sound great for the price, however the speaker wire connectors are of really REALLY poor quality and barely hold the wires. The spring loader is weak and cheap plastic that came loos several times if the wire even pulls slightly and in one case the plastic spring connetor came out in my hand. I had to try and put it back together, but it comes out any time the speaker is moved.",
        "We used these speakers in an outdoor pavilion for church activities. Mainly for voice and piano music rebroadcast. They work very well so far. They are tucked up under the roof and hopefully out of the worst of weather since this in an open pavilion. Will update later if any issues but happy so far with them.",
        "I just needed a set of speakers for my work shop, nothing fancy. Actually, these are quite nice and sound great. For the price, with mounts, really can't go wrong. Now, these are not going outdoors so can't see how well they would do outside, but I probably wouldn't have any problems putting them outside away from rain or snow.",
        "Bought two pairs of these. First pair is outside and works fine. Second pair is inside, and one of the speakers is defective. Returned for replacement and those work fine. Not sure how the outside speakers will hold up. I am leaving them outside all winter. We'll see if they hold up. Nice speakers for the money.",
        "above certain volume level (I would say 60%) speaker starts to static and becomes very noisy. also the mounting brackets are really flimsy and will give you anxiety about if they are going to hold speakers or not.",
        "Just built a new room for my large wood stove and wanted to get some speakers up in the corners because what’s a fire without music? Nice brackets made it easy to get them where I wanted and the sound thorough a vintage amplifier sounds pretty good. I’m not audiophile but for 22-bucks I’m happy with the purchase and it’s nice having something that doesn’t sit on a shelf where a cat can use it for a scratching post.",
        "These are often available for less than $30 here, and are a great buy at that price. These are not audiophile quality speakers, but they sound just fine. Pair this with a Lepai amplifier and you have a patio or garden stereo system for about $50. My only complaint is that the clips to hold the speaker wire in place are a bit flimsy. I used some lower gauge wire and they definitely had some trouble holding it in. You're probably best off sticking with 18 gauge wire, which is what the manufacturer recommends. You will hear some distortion if you pump up the volume too high, but you're buying the wrong speakers if you're intend on rocking the neighborhood.",
        "The nuts embedded in the housing were loose on one of the speakers, forcing me to attach an aftermarket bracket. After getting everything mounted and wired, the speakers sound out of phase. Switched the polarity, but no change. Audio quality is terrible - pulsing and tinny. Save your money for something better.",
        "You get what you pay for. For those expecting great sound...be serious, you paid $35. There decent but dont look for booming base with great hifi sound its not here. If thats what you want you need to spend far more. These are decent for the price. Great speakers will make a weak stereo sound good, great stereo wont make cheap speakers sound good. If you buy these and complain about poor sound quality...well thats on you.",
        "These are cheap outdoor speakers and they sound like cheap outdoor speakers. I recommend the Polk Atrium over these. I have both sets and the Polk are far superior and worth the extra money. I guess these are ok for those on a tight budget.",
        "These have a pleasant sound and are definitely loud enough to annoy the neighbors. Just add a cheap subwoofer and you will have wonderful sound on your patio. I left them outside in bad weather and they work like new,",
        "Very good output for such small outdoor speakers. I had a neighbor blasting his music outside for 3 days 24/7. I called the police to get someone to look into this a couple times over 3 days and no response. I hooked these speakers up and 15 min they showed up. I turned them off. They realized the neighbors music was too loud and shut them down. Problem solved and I still have great speakers to use for more enjoyable purposes. FYI Dub Step will get someone coming right away.",
        "We installed the Dual Electronics LU43PB speakers in each side of the front sleeping cabin of a boat connected to a 24v 21.5 inch bus/camper van fold down TV/DVD entertainment center (picture shows only left side speaker). They run through a small 6ohm 24v 50w X 2 amplifier. While not exposed directly to the weather, we find it is better to install weatherproofed speakers indoors on a boat where they may face high humidity. The speakers output and sound quality are very good for the size of the space and it's a major improvement over the sound quality from the two small speakers in the TV/DVD.",
        "Wow. Great pair of speakers for my outdoor music box. This is on volume 2 and sound fills the area. For my project these where a no brainer.",
        "I have these paired with the 'Pyle Home PCA2 2X40-Watt Stereo Mini Power Amplifier' and they perform wonderfully! *** About my review *** First and foremost, I always check the reviews before I buy anything. Looking at the positive AND negative feedbacks is the only way to REALLY know how others felt about the same product you're considering for yourself. That being said, I have offered the review above. If you felt it helped you, please click 'Yes'. Lastly, if you have any questions about this product, PLEASE feel free to ask away and I'll do my best to relay what I've seen so far! Thanks!",
        "Was hesitant about $40 speakers, but pleasantly surprised. Use the speakers for music while working in the yard, we have about 2 acres and the speakers are loud enough to hear while working with decent sound quality. Thinking about replacing a couple of my other speakers with this model.",
        "dislike....these speakers can handle absolutely zero base only highs and a little mid range can not turn up load as they will start popping and distorting Like ....they seem to handle getting wet pretty good and priced nice",
        "good speakers for the price. Dont expect high end quality and sound, but do expect a good speaker set for the price! I have them in my garage/shop, they do the job!"
    ]
}