{
    "entity": "Rotisseries & Roasters",
    "text": [
        "This thing is poorly made in China. I chose the 4-year protection plan. I made broth in it and I noticed the broth kept getting dark. I looked at it and the finish is coming off. So I was eating the enamel. So I bought a 7 Quart Genuine CROCKPOT . The 6-quart Nesco Roaster Oven is half the size of the 7-quart CROCKPOT. The finish on the crockpot is baked in. I paid $25 for the CROCKPOT and $50 for the Nessco product.I gave it one star because they did not have a negative star.",
        "Love my Nesco and this is the second one I've owned. I like the flexibility of the temperature range. Use as a slow cooker or a roaster. I like that I can start my meal as a slow cooker and then turn up the temp if I need to get it done quicker. I cook roasts till they're falling apart for delicious beef or pork sandwiches. I also use it for meatballs, sauce and soups.",
        "Bought this oven a year ago from Amazon and never had the need to use it. I tried to cure it as instructed today6/30 2018 and it just will not turn on ( No HEAT, “NOTHING” ) A piece of crap that I will be putting out with the garbage on Friday",
        "I purchased in March to use for a June Graduation. I unboxed it the day of my party plugged it in and had smoke pour out everywhere. It started a electrical fire inside unit. I am past my return window and just wanted to tell everyone that you should try yours right away. Gets 1 Star for pricing.",
        "I bought this roaster to replace my mom's 15 year old worn out teflon Nesco predecessor. I really loved the old one and this one having the porcelain cookwell is even better because of the health benefits. I prefer the variable oven-like control over traditional crock pot \"3 temperatures fit all\" approach. I can saute the meats in the roaster which saves an additional pan to wash, then add the remaining ingredients and slow cook the remainder of the day. I've recently gotten into freezer cooking and this little gem is my go-to way of preparing. Place the frozen food in it, turn on low, and come home to a finished healthy delicious meal. Almost like having a maid!",
        "Perfect for large gatherings or Thanksgiving if you only have one oven. Our large turkey did very well and was super moist. It won't get golden brown though. We found the thermostat wasn't quite accurate and we made our Turkey atz higher temperature which was perfect! I also used this to heat meatballs for fifty people at a large party and it was fantastic. Well worth the money but... I did see it at a very popular discount department store after Thanksgiving for forty dollars less. But since we are reviewing v the product not the price, I would say buy it it is a great product.",
        "I own the larger Nesco and I cook my turkey in it several times a year. My home has downsized so I purchased the 6qt. It’s wonderful. I cooked a casserole in it and a stew. They both came out wonderful. All the temperatures worked well. After cooking and serving the pot was easy to clean. While cooking the roast beef for the stew I seasoned it, added my ingredients and covered. I went shopping and when I came home the meat was very tender and the broth was ready to add the vegetables. I love this pot and it’s the right size fir me. I’m never disappointed with Nesco.",
        "I've had a couple of 6 quart Nescos in the past that were made in the US and lasted for years. The company was sold, and a year ago I couldn't find one to purchase. This Nesco roaster has more versatility that a crockpot. I can brown items initially and then turn the temperature down. Everything is moist and perfect. These are made in China now sadly. The price was very affordable. Hopefully it will last as long as my other Nescos. I still have an older 18 quart.",
        "This roaster replaced our family's 1970 's era Nesco 18 Qt roaster that finally died out. Yes, 1970's. Nice re-do of the product. Perfect size. Updated with \"circular heating\". Works great and looks great. The lid could be a little heavier as they used thinner metal than the old model. Over all, four solid stars. Great price point too. RECOMMENDED",
        "This can double for an oven if you have something smaller to bake i.e. Muffins, small TV dinners, pasties, just about anything. Great when only cooking for one, or out on patio if you need to keep something warm. The insert is washable.",
        "This is the second nesco we have because we have 2 homes and would not be without one. The first one has been around for many years and we use it all of the time. When we retired and purchased a sommer home we had to have one and purchased the current model. Unit 1 has to be 20 years old, so you see how durabile they are.",
        "Looks nice....but the inside pan was damaged on the handle and pitting errors...this makes for poor quality cooking, asking for a new inside pan...packaging was ok, but the product itself is very flimsy aluminum. Not quite what I was expecting. Seens how the roasters I have used in the past are higher quality Built. Kate",
        "Slow cookers cook at too high temperatures anymore, even on low. This is the perfect solution because you can cook on really low temps, somewhere around 125 to 150, all the way up to 450, or anywhere along the way. You can use it for anything from roasting to bread baking, to slow cooking, to most anything that suits your fancy. I wish it also heated from the bottom so you could brown things, but that's no big deal. If I want them browned I'll use a separate pan, then cook them the rest of the way in this. I use it at least twice a week, it long ago paid for itself, and then some.",
        "Nesco in general can be a harder brand of kitchen toy to get a hold of nowadays, so I'm glad I came across it here. No regrets on the purchase. In terms on reliability, style, and ease of use, this is an amazing roaster. I love the size and ease of this roaster. My concern is the outside gets so hot! The handles too. I have granet countertops and those are hot not warm as well. I hope this isn't common in these roasters now, as I have been a Nesco fan for years.",
        "My wife and i have owned one of these for many years and then we found one just like it here at amazon, the old one was still working after more than 20 years but was scratched and looking pretty worn- we decided to get another for the house and the old one is still working in the big boat. these are great for all day slow cooking stews and soups also for meatloaf or a big chunk of just about any meat, slow cooked and fillin the house up with all that great smellin food... oh yea! we really do love our \"crockpot\" and now i think its time to make some chili :) frank",
        "I love my roaster. I used it for the first time on Thanksgiving. I did a 22 lb turkey in it, no problem. The outside does get very hot to the touch. We burned it off in my garage when we first opened it fir about 3 hrs. It still smelled a little when we turned it on to start the turkey, but not too badly. The wing of the bird pressed the plastic liner against the edge of the pan and left burned melted plastic on the pan. That was my biggest disappointment. Used the pan inserts to reheat and serve leftovers at leftover feast saturday. It worked great.",
        "love it, but forgot the cookout the first time, and could smell chemicals. No harm done, just put it out in the garage the next day for an hour. Love the recipe book and all things you can make in it. Less dishes to do. Not big enough for a turkey, but I get the breast and legs separate or a four and a half pound chicken works great too, Convenient on the counter roaster, slow cooker, warmer.",
        "I bought one of these for my wife in stainless several years ago, she uses it several times a week, and it still works like new. She wanted one in red, so I bought her a red one.....I have no idea what she's going to do with two of them! But seriously, she loves the Nesco roaster oven and I love the things she makes with it!",
        "The Nesco still works great for slow or regular cooking. This is my second one in 30 years. Nothing wrong with my old one. Just wanted a new oval shaped one'...Great to head out to work in the early AM to return home at the end of the day to a delicious meal wanting for you'.. And on any given Sunday, place your roasting chicken, on the rack carrots and spuds underneath and roast or bake 90 minutes later have your Sunday dinner'...Terrific cooking especially in the cold winter months'...Highly recommend'..",
        "After only 4 years the thermostat went out on it. Of course I had a roast in it that got ruined. This is the second Nesco I bought that the thermostat went out on in a short period of time. The last one only lasted 2 years. Guess I'll be changing brands.",
        "Great oven. This was my 2nd purchase. The first time I go the non-stick pan. I found it too tiresome and not easy to clean. This time I purchased the porcelain pan and so far I'm very pleased with it.",
        "I like to cook outside with my crockpots, Insta pot and I decided to get a roaster also. This roaster did the trick! Works great and my Cornish hens were delicious!",
        "I owned a Nesco roaster Oven for 37 years and it still worked well but the knob on the cover came off. I was always happy with the way it cooked and was easy to prepare meals. I bought another Nesco roaster oven this last Christmas and it cooks the same as the one I had for 37 years. I am very happy with my new Nesco roaster oven.",
        "I had been given this roaster as a gift many, many years ago. I love it. I now spend the winters in Florida and summers in Michigan. I was lost without it while in Michigan last summer so I went on line to purchase another one. I had a hard time finding one on line. I don't know if they don't make it anymore but I finally was able to purchase one. I use these roaster more than any other electric pan. From slow cooking to roasting a roast. It is wonderful. I hope they continue to make it.",
        "I have another one just like this and have found it invaluable when company is coming. I know there are other brands out there that may be a few dollars less and work just as well, but this is the one I began with and haven't felt it necessary to change. I noticed some people had problems with rusting of the top. I've had mine for over ten years and that hasn't been a problem. Having said that, I use it numerous times throughout the year, but less than once a month. Possibly that is why I've fared better. Buy it. You won't be disappointed!",
        "These are GREAT little work-horses! I have three (two in white before I found out about the red that have lasted for years and are still going - but I needed one more) that I've worked HARD at fundraisers and pot-lucks. They maintain an accurate temp and are VERY quick to heat up compared to crock-pot types. Hint: put a little water in the well under the baking (inside) liner and you have a mini-steam table.)",
        "This Cooker does what it is supposed to do; Slow Cook.. The temperature control is perfect for various kinds of food being cooked. According to the of the meal you want cooked. If you read the owner's manual it will give the time in hours it takes at each temperatures setting.",
        "My wife likes this. Loaned it to our daughter for quite a while. When it was returned, I put it on top of the washing machine not knowing where the boss wanted it. It fell off when the washing machine vibrated and broke the knob on top and bent the lid pretty good. It was old, so I got another to stay out of trouble.",
        "I love everything about the Nesco roaster. It cooks everything in half of the time and everything I've made comes out delicious. GREAT PRODUCT. HIGHLY RECOMMEND.",
        "The lid has bubbled up. The paint has bubbled up on the inside of the cover. I don’t know what to do. I have only used it a few times and only on low temperatures. Very disappointed.",
        "I always cook my thanksgiving turkey in a nesco cooker like this but this is the first year my boyfriend and I have had thanksgiving together and he did not have one. This worked just as it should and arrived on time",
        "this is the best way to countertop cook. it's controlled temperature makes crockpots out dated. cook at the exact temperature that you want. once you use one of these 6 quart countertop \"roasters\" you will really like the results. i have donated all my old crockpots to charity. after i gave my beloved Roaster Oven to my daughter, i had to buy another for myself. For great effortless meals and fast warm ups, this one is a great buy.",
        "My wife wanted one of these after using her mothers nestor. Spend hous online reading the reviews. I settled on this model because it had what we wanted. Bake out (burn in etc) done under our range hood, and following instructions. All went fine, and has been fine since. Many briskets have been roasted since with predictable consistent results.",
        "This is a great little cooker. I cooked a ten pound turkey breast in it at Thanksgiving. I did use browning sauce because this cooker won't brown the turkey (don't know if any roaster would), though it does cook it done. The turkey breast turned out great. We also use it to simmer barbecue in. After my husband does the grilling, he puts it in our roaster to simmer, making the taste awesome! We have 2 of these roasters. We bought one for a friend for Christmas because she's always admired ours. She loves it.",
        "What a great roaster. This comes in very handy for large family gatherings when the conventional oven is tied up with other dishes. The removable cook basin is easy to clean.",
        "Would have liked the option for non-stick pan. This pan was ruined after it got scorched on first use, accidently. It happened in 10 minutes but we could not salvage it, so we ordered a non-stick replacement pan from manufacturer. We had expected non-stick based on the previous one we had from same company for 16 years. Its a great product that we like better than a slow cooker and we would suggest non-stick.",
        "Gave it for Christmas gift. Ended up using it a few hours latter to cook the Christmas ham in it. And it came out perfect 😎. What a great slow cooker. Can't wait to do a chicken in it next. Best part, it free's up your oven for that monster Thanksgiving Day 🦃.",
        "Nesco usually has great products and this one seems to be no exception. This is a replacement for one of 5 roasters that get heavy use for 4-5 months of year, feeding a competitive marching band. I didn't consider any other brand when needing to replace an older one that met its end!",
        "1st one was bent and broken. Amazon sent a new one. The next day. It is very small and a small ham barely fit. I would return it but I did use it for vegetables. An expensive vegetable maker. Not worth it.",
        "Love Nesco roasters and this is a good one. The only thing that is missing is the metal clips above the handles that allow you to slip the edge of the lid underneath so that you have somewhere 'clean' to keep the lid when you need to remove it. I have an earlier version of the Nesco that has this holder and find it odd that they've left it off this model. That's the only reason that I give this 4 stars instead of 5. It heats quickly, looks nice, and does everything that I need a roaster to do.",
        "I am using it instead of a toaster oven for polymer clay baking, and am finding this bakes at correct temp more than toaster oven.",
        "This is replacing my very old (maybe 30 years?) 18-quart Nesco. My old one finally gave up the ghost. My only wish is that this one had the same shape lid as my old one, which I had purchased a convection lid for, and which was not having any issues. All in all, though, it is very handy, especially if you're cooking for a lot of people, or during the holidays to free up room in the kitchen oven for other things while cooking the ham or turkey in the Nesco.",
        "I bought this expecting it to work exactly like my other one, same model, brand, temp control , only difference was the color . I was SO disappointed ! This white one took hours to heat up (my silver one literally takes 45 min to get soups to temp to serve). I bought this thinking I would use as a cooker, then as a warmer once to temp. I returned it after 2 uses . Still on the search for a different one.",
        "It’s all aluminum even the cookwell!! Product not as described it says porcelain cookwell but it’s entirely aluminum. I will be returning this because I wanted a porcelain cookwell!!",
        "Put your food in the roaster and forget about it. Low temperature roasting is the way to get a tender juicy roast beef. Much better than a crock pot and more efficient heating mechanism. Perfect for summer cooking when the the whole house can stay cool using the Nesco roaster as the main cooking source.",
        "After the first use the lid started to warp and as a result of the warping some of the paint started to peel up. It still seems functions fine just cosmetically issues so far. And I followed the pre cooking directions exactly, I performed the \"curing\" for longer than recommended and even cured it a second time before cooking due to an odor reappearing after the first curing.",
        "I bought this product skeptical about whether it can hold a 22 pound turkey or similar meats like dear quarters and such. I was not disappointed because it can and plus some. It also came with a stainless steel lid although the booklet says aluminum but I did get the stainless steel model.",
        "Love it. We had a Nesco Roaster that lasted 20+years with weekly and biweekly use. Sadly, it was time to retire it, and get a new one. I only hope that this one will last just as long.",
        "I bought two of these to serve food at my son's first birthday party. There were 100 people there and we served hot sausage and meatball hoagies. I made the meatballs and sausage ahead of time and froze them. I placed the partially defrosted meats/sauce in the roasters a few hours before the party started and everything was hot by the time food was served. It was much simpler than chafing dishes. I'm looking forward to using these again for family functions and parties and also looking forward to trying it out to make soups l, roasts, etc",
        "Nesco has always been a great product. We had to return it because the lid discolored we could not fix the problem how they told us to do so we returned the item.",
        "These roasters are awesome, you won't be disappointed. Great for turkeys, roasts, big batches of dishes such as potatoes. We now own four for parties and gatherings.",
        "Finally got a new Nesco and gave my old one to charity and it still works very well, had it approximately 20 years, bought it from QVC. These roasters are the best! Looking forward to using my new red one for many great dinners and years to come.",
        "Works well, but it boils out liquid fast, as three is no option to close of the vent holes in the lid. This leads to hard crust forming on the sides as the liquid level drops. I think we are going to use turkey bags in this to keep liquid off the sides.",
        "When I purchased the first time it was pictured with a glass lid, I returned it because it came with a metal lid. Tried reordering, and again it came with a metal lid. It appears they have now corrected the picture to show a metal lid. Would have liked a glass lid, but I like this roaster and how it can slow cook or roast.",
        "The unit seems to be performing well. It heats up relatively quickly and likewise cools quickly. The pan and divider inserts we purchased to accompany it are horrible with peeling teflon that makes its way into the customers' food! If I had a recommendation for the steamer unit it would be to make a positive \"clicking\" OFF position so you know it is in fact turned off.",
        "My neighbor has this same unit and I loved her roasts in it so wanted to pick it up. 1 star lost for Amazon's shipping as the box was all banged up, the lid was bent but otherwise works fine. Tried it out last night with a pork loin tip roast and tasted amazing. Great unit and I hope I have many years of use from it.",
        "You won't like my review. I returned because after the first use, the paint came off the lid and there you have it.",
        "My Roaster has rusted and is defective and the company isn’t responding to my request for replacement....it’s still in the warranty window, but no response to my communication...very disappointing and definitely not money that my family has to waist on a defective product. The nonstick coating peeled back off the lid and rusted the lid and the crock. I’ve only used it 4 or 5 times.",
        "Just want I needed to prepare large amounts of food for about 30 people on a frequent basis. Works well, heats accurately and has become indispensable in my kitchen.",
        "I help feed the crew of the Wisconsin Rovers each summer when they come to our part of the state. They are resposible for building the bridges and boardwalks on the North Country Trail in Wisconsin",
        "I used this roaster for a number of foods. The main reason I purchased this roaster was to heat nacho cheese in our snack shack. It worked fabulously! I also used it to make chili, cheesy potatoes, and soup for our snack shack and team dinners. I would definitely recommend this roaster. Great value. The one downside was the very strong chemical smell/fumes it puts off the first few uses.",
        "I opened the box, hoping to find the same quality inside pan as my old one. the new one is super thin. not a comparison of quality to my old one. very disappointed.",
        "We use more than residential use. (2-3x/wk). Our previous one were professional model and lasted for 5 yrs. Still working but the inserted got scuffed or wear off the porcelaine from staff using metal scaper. I had the other ones with the clay pot insert. They break and leaked and heavy to clean so staff would too hard and cracked the pot. I love it.",
        "So far, I really like this roaster oven. In my experience, it cooks much faster than in the big oven, so when you first start using it, check your food earlier so that you don't over-cook it. You do lose some heat when you take the lid off, so try not to do that too often. How convenient this little oven is! And it definitely helps at holiday times to have a little extra oven space. I'm really glad I bought it!",
        "Love this cutie - roasted a 23lb turkey - great instructions for smoking out the appliance before use and for the handy roasting guide included - loved the Candy Apple Red color - major factor in my final decision.",
        "This is the 3rd Nesco roaster I have had in the last 30 year's. I wore the first 2 out! This roaster is like having a portable oven. It does a wonderful job of cooking a pork loin or a beef chuck roast without heating up your entire kitchen.",
        "Hope this one last as long as my old one 15 years of use 3/4 days a week.",
        "I bought this for my Church since their Nescos were disappearing and I was involved with our Men's Breakfasts at the time. Seems to work great and being red I felt that someone 'borrowing' a Nesco would be less likely to think it was originally theirs. It is still there after many months.",
        "I used this to cook an 18 lbs. turkey this year for Thanksgiving. Everything turned out perfectly most and cooked through. Very easy to clean. Very light to transport from room to room, if necessary. Highly recommend!",
        "Thanksgiving is almost here. The old one that I inherited from my family finally wore out after nearly a century of use.",
        "We have 7 of these. They are all less than 2 years old and three of them have now died. Not the sort of quality I expect from a long-established brand.",
        "Love this roaster. I can roast 3 chickens at a time, debone it and then freeze for all types of dishes. During summer, can put it outside on the deck and the house does not get hot!",
        "Bought this with the inserts thinking I'd use it once a year for the family get together but found it was very handy as a slow cooker, bread baker, hot dog cooker, and in one case a phone dryer. Very accurate controls and large enough to handle a crowd. Don't like the lid for weight or rough edge but smoothed out the rough edges and got used to the flimsy material.",
        "This is my second 6-quart Nesco. The other one literally wore out, I had used it so much. Of course it didn't help that I dropped it and messed up the dial. I use it a lot. We live in FL, so I put a meal in it and set it out on the screened porch and the Nesco does the rest. I really do enjoy it. I wish they would make a 4 quart one, which would be handier for just two people.",
        "This is my favorite roaster. I love the color. It does dent very easily, so be careful not to drop the lid. The quality has changed since the past, however, it is still a great roaster.",
        "I had a Nesco for many years and it was great. So when I needed a new one I didn't hesitate to order it. However, the liner is far inferior to the old one and everything sticks to it. It is difficult to clean. On a positive note, it is multi-functional and much better than a regular slow cooker.",
        "This is my thrid one. Hard to clean after awhile.",
        "Works as advertised. My only complaint is the rack doesn't cover the entire bottom. Large spaces on the sides and between the metal wires, which causes veggies to fall through. Tried to find a replacement on-line that would fit, with no luck.",
        "I have owned 2 of these and also bought them for my children and grandchildren. We use them often and have never had any problems with them. Soup, meat, vegetables. It will do most anything you need in the kitchen. I like it much better than a crock pot, but I use those too.",
        "I use this more for cooking than about anything else I own. With only two people in the house this is just perfect for cooking casseroles, barbeque ribs, even soups",
        "IT'S NOT A HUGE ROASTER BUT IT DOES A WHOLE CHICKEN EASILY.. EASY TO OPERATE AND CLEAN",
        "This is the second Nesco roaster oven that I have owned. It is very versatile, and I especially love being able to roast the meat, set it aside, and then place the removable teflon insert on the stovetop to make the gravy. It is lightweight and durable, and I use it for making everything from soups to roasts to chili sauce.",
        "Bought this to replace one that fell apart on me after 10 years of very light use. This one was put to the task immediately after arriving at my home. I LOVE it! And you will too.",
        "This item is terrible. Have used it three times and there is rust on it already on the lid on the vent hole. Used over the weekend and the underneath of the lid the coating is bubbling up. Sent message online to Nesco and have not gotten a response yet. Total waste of money. Was a Christmas gift and now to late to return.",
        "Worked beautifully roasting a large ham. However, when originally removing it from the box, I noticed that the control knob was bent slightly down. Even so, it still seems to be working--at least for now. If not for that \"quality control\" oversight, I would give the roaster 5 stars.",
        "I like it... however I'm not in love with it... I wish it would have came with a porcelain insert ... the food cooks to temp but comes out a bit dry... working on that issue... will post later if I find the answers to a better method of juicy food.",
        "I bought this Nesco a month ago went to use it today for first time and plugged it in smoke was coming out from behind the knob and around the front edges of the base around the seems. Not sure if I can exchange it I am new to buying things on here.",
        "I was very pleased with my purchase. It is nice inside and out and I really like the red color. Easy to wash because the inside comes out. I wanted it before the Christmas holidays and it arrived just in time. I baked a whole ham on low all night with pineapple juice and everybody raved about how good it was. Can't wait to try a Boston butt or turkey breast. I can easily sit it on counter top and he frees up my oven for other baking. I highly recommend it.",
        "This is my second Nesco, my first is a 4 quart that is 20 years old. I wanted a slightly larger one when I got my 6 quart.",
        "Works great! My turkey came out great and it frees up my oven. However, make sure you season it prior to using. I had to season mine for about two hours just to get rid of the smell. It also changed the finish some, but it didn’t effect the cooking or cleaning process at all.",
        "Made the best turkey I have ever had. Be sure to following the instructions",
        "We ordered this to replace one we used for 15 years. This one has the porcelain insert and I prefer it to the old which had the non stick one. It is just as easy to clean up and no worry with damaging the surface. We used the old one heavily and will do the same with this one. It is so versatile. We use it as a slow cooker, but also for roasting pot roasts, turkey breasts, making soups , and our favorite chile verde recipe. We have an electric pressure cooker as well, but the Nesco is our go to cooking appliance.",
        "The lid does not fit properly and the porcelain insert is impossible to clean. I had one of these for years and loved it. The new one is a huge disappointment. Jackie",
        "I love this roaster. The lid is not as thick as the other parts of the roaster but, neither is my grandmother's roaster lid. I bought this to replace hers because it finally died and I have to say we use it all of the time. I have used it like a big crockpot and have also used it as a little oven. Does not put off anywhere near the same amount of heat as my oven. Oh and you have to love the color.",
        "Upon un-boxing I noticed that the temperature knob was damaged (knob was crooked). It still seemed to be functional so I decided that I could live with the imperfection. When I was attempting the initial, recommended \"smoke out\" I noticed smoke coming out from the knob hole. I immediately disconnected power and will be returning. Hoping this was a one off defect and I can reorder soon.",
        "Cleaning the liner after cooking ribs was horrible. It seems to me a company like Nesco would have provided a non stick surface in this liner ! Once food is cooked in it, cleaning it becomes a real problem removing any stains or burnt food from the liner.",
        "The top cover is flimsy, there was a permanent stain after the first use, this is not the Nesco I remember purchasing from HSN 15 years ago, this may be manufactured by a different company.",
        "It's the perfect size for roasting a chicken or turkey breast. The meat is perfectly tender and moist.",
        "Great investment. This is our second. Nonstick only lasts so long. Maybe 5-7 years of heavy use. Nesco' are great for wider range of temp control. Buy it, you won't regret it. Also, I consider the porcelain finish one more of a lifetime finish but the nonstick holds up decent and we like the convenience.",
        "I have used this many of time. And I have used the slow cook function. I have put my crock pot away because this does a better job. Where a crock pot only heats from the bottom this heats all the way around and meat and veg's always come out tender"
    ]
}