{
    "entity": "Window Fans",
    "text": [
        "If this fan was balanced, it would be a great fan. Unfortunately it isn't balanced and is getting louder every week. It is beyond the return window so I'm left with a $155 fan that I can only use on its lowest speed or its going to tear itself out of my window frame. It could have been great if the quality control at Airking had integrity. If you buy this fan, make sure you return it within 30 days if it rattles much or you will regret it.",
        "I had an older Air King--same size; slightly different. The last one would still be working fine (after twenty years) had I not dropped it out a window (difficult to do, but I'm a talented man). The new one works fine; creates a nice breeze through multiple windows on high. At night, we put it on low and open just the bedroom windows. We're very comfortable. It's a bit loud, but we're rarely in the same room (my office) when it's on high. We expect that this will last more than twenty years (I'll be more careful), but we're not sure that we will.",
        "Love this fan. It's designed for a window but I actually have it in the crawl space going up into my attic from our laundry room. When it's on it pulls in air from all over our condo and works perfectly in our place.",
        "As expected the highest speed setting (3) is loud, and sounds like rushing air, but it also moves a ton of air. What I didn't expect was that speed setting 1 produces loud electrical noise continuously. This can be heard throughout the whole house. Speed setting 2 is actually drastically less annoying and generally sounds like air, but occasionally there will be a loud hum oscillating in and out. This will do what it promises. It cooled my house in a matter of minutes in the evening when I turned it on! However the drawbacks in terms of annoying noise produced I believe in my case outweigh the positives.",
        "Despite the negative reviews, I made the plunge and added the 4yr guarantee on this fan from asurion. I received the fan next day even during this whole 2020 pandemic. I installed this over a window slightly smaller than it is and it is at an expected decibel level for a fan with this high of an RPM. I don't feel any excessive shaking, though there is a noticeable vibration, it again is expected from any fan spinning this fast. The fan moves a lot of air, and slams doors shut if a window is opened in a room. This is exactly what I need this summer!",
        "I have a two-story 1300 sq ft home; I put the fan in the upstairs bathroom window. The fan does pull in the air, and if Amazon posted the video, you can see how much air it moves from the movement of the curtains downstairs. It is hard to install due to the space from the fan to the sides.",
        "Three speeds in or out. I smoke in my in-house office and it exhausts well on the lowest setting. It is heavy, and a little hard to install. One needs to put a couple of screws in the window frame to hold it in securely. This was a repeat purchase as my first on died after about three years. I believe the death was caused because I practically never kept a different window open when on exhaust, resulting in extra wear on the motor. The instructions advise you to do this, but I refuse to do so in the Winter.",
        "Installed the fan inside the window. Works great, but can't open the window when the fan is permanently installed. Need to go outside, climb up a ladder, and take out the screen to open the window. Also, when I screw in the Extender Panel Screws, the side panels are forced outward leaving a 1/2\" gap for air to leak. I will fabricate some wood panels to close the gap, and install some kind of rope system to open the window. Seems like it should not take additional modifications to use this fan. Otherwise, it throws a lot of air, so I am happy with that.",
        "I live in NYC and in the summer these buildings become unbearably hot. I installed the fan with little hope that it'll actually cool down my apartment.......I was wrong. When I turn it on exhaust it moves out all the hot air. When the sun goes down I put it to blow into the apartment, and it cools it down. WAY cheaper than running an air conditioner. This was the best money I've spent in a while.",
        "This beast easily moves air through my whole house. I put it in a window on the first floor and it will suck air from the attic, 2nd floor, and basement if the doors are open. Perfect for beautiful warm spring, fall, and occasional summer days when it's not hot enough for air conditioning but a little air flow is nice to keep it from getting stale. Also great if you need to air out a smell or dry a place out or ventilate a little heat from cooking. Great fan, I am very happy with the quality.",
        "Not a bad fan but didn't expect the grills on both sides to start rusting after only three months of use. For the price I would think they could prime and paint the grills properly so they don't rust. If I could I would return it. One star. Thank you for reading my review.",
        "I like it well enough that I planning on getting another. Everything about this product seems like it built in the USA. it's about 76 dB in the noise range right up close. But standing back 8' It's about 70db S0 even up close my at 76dB Usually considered to not cause hearing loss, even with prolonged exposure up close. It does MOVE AIR, I'd say 2,000 sq ft. But I have been exposed to whole-house fans that would lift my hair; these the Arking 24\". n Weaknesses: it's a tad loud and I'm not sure about the claim to a whole house fan. Overall; I'd buying again for another window. It is husky in every way.",
        "Use this fan to cool down the garage only. Problem is, this thing shakes so badly and is so loud, i am afraid to turn it up past low, for fear its going to come out of the wall mount. Last year this fan was noise and shook. This year it have progressively gotten worse. I am past the warranty/return, and for what I paid for this piece of XXXX, I would expect much better quality. My advice, while its the perfect size and airflow, avoid it. In fact, run away.",
        "I live in Bay Area and it’s normally hot during day time and cool in evening. I have tried many ways to move the hot air out of my house before sleep, but didn’t success until this product. Normal box fan simply will not work. It takes a while for me to figure out how to mount this thing, since I don’t have the kind of window shown in product description. End up using two big hooks and hang it by the window. Works perfectly with some noise. At least the house is cool...",
        "Very powerful with the sliding side panels that eliminate back flow. I use this when I work on the house to keep dust from getting into the other rooms. Highly recommend for people who do construction and for use as a whole house fan.",
        "Like so many others have mentioned this fan is not well made. After occasional use the past two summers the motor on this is failing. It sounds like a bad bearing. I’ll have to tear it apart to see if it can be fixed. My 10yo $20 box fan, by contrast, still runs like a champ. One other thing is that the low and medium settings are nearly identical. High is off the chart. In essence it has only two speeds.",
        "works great but it is noisy moves more air than my old 16 inch on high when it is on low.",
        "I don't have an attic so I was unable to install an attic fan. I installed this fan in a window opening (worked for me because I have a window in a walk-in closet). It draws air from my whole house (675 sq ft) easily. I tried two other window fan options in the past - one I paid $70 for and they didn't even come close to working as well as this one. I've had it for about 3 months now. Love it!",
        "This is a large window fan that must be affixed to the window frame or fitted into the track. It will obscure the view from the installed window. Some drilling of pilot holes in the window frame may be required depending on how you mount it. It's pretty quiet as room fans go with good balanced constitution (low vibration). The reversible air direction will easily and noticeably vent 800-1000 sq ft of living space with proper air flow control.",
        "Great fan. Mounts into the window with no gaps so it's efficient in pulling air through the house. It's large, so make sure you have a large enough window. It's our A/C alternative. This fan pulls a ton of air, so make sure doors are all propped open. Great purchase!",
        "I did not realize there was no reverse on the fan. We bought it to pull in fresh air, but this will only exhaust air or blow air out the window. It looked to be will made, just not what we were looking for.",
        "I like the ability to use in multiple size windows. Much much better than a box fan. Moves air through my entire house, regulated by how much I open each window to control a balanced flow.",
        "I grew up with an attic fan and loved it. For those of you who love attic fans but don’t have one, this is the next best thing to having one installed. Installation was a breeze (yes, pun intended) and unit does not vibrate as some have experienced. I assume vibration could be due to uneven leveling. You do want to make sure it is level when installing. Our house is about 3500 SqFt and the fan, installed at the furthest window at the end of the house, has no problems pulling air in from the opposite side.",
        "1st time review: wow, this thing is powerful! We installed it in a downstairs window, open the windows upstairs in the evening and let it rip... Works perfectly for us. Tip: when screwing in the sides to the frame, you can slide the fan to the right to get access to the left screws, and then reverse the process to get access to the right side screws. Then slide the fan back to the middle and tighten the set screws. It will make sense once you start the install.",
        "I never could get rid of the raddling noise that comes from the expandable frame of the fan, so that is a ding; but one thing is for sure: the fan is a workhorse and gets the job done. We survived a Chicago summer with this fan cooling our house at night.",
        "Its loud but it moves air, a huge amount of air. It turned out to be perfect for me, cooling my 1900 sqr house down in less than an hour(100plus deg day, low of 65 at 6am) taking it down 20 plus and even more given the outside temp. It doesn't need perfect conditions to be useful either, I live in an area where AC is a must but I can still get buy with just this fan, given I have to wake up early before it heats up outside or it gets bad but thats just another reason to wake up and work out.",
        "This fan is great! Solid construction, mostly metal except for the shroud. Does shake/vibrate a little but it cools the house off so well. Wish I got one years ago, would have saved me a ton on my electric over running central air when it's kind of cool at night. The vibrating is minimal and goes away when adjusted. Would buy again.",
        "man this commercial fan sucks out the greasy cooking from the kitchen...amazing and powerful...oh dropped it out of the window 3 times, and did not break, made to withstand, but I bought squaretrade just in case it broke",
        "I bought this to use as an exhaust fan in a dish washing room until my permanent system gets installed. It works really well and it's not that noisy considering all of the air that it moves. I think the mounting system needs some work but you can modify it to fit your own set up.",
        "It was great when it worked I had mine for 2 years I only use it like 2 mouths each year so about 4 mouths total for about 12 to 18 hours a day now it sounds like a bearing is going out which is said I have fans I run all summer long from menards for $30 do a better job lasting had them about 5 and I run them 24/7 in summer I don’t understand why there fans don’t last",
        "This was replacing a 16 inch fan made by Lakewood that I purchased in 1985. It was designed like the Air King, but it also had a thermostat. It worked flawlessly till july 2020. Sad to say it\"s no longer made. I wanted something heavy-duty and Air King appeared to be the answer. After installing the Air King in the same window, I was very disappointed to find the 20 inch Air King, set on high, could not move any more air than the OLD 16 inch Lakewood could move set on medium!!! The words HIGH VELOCITY meant something in THE GOOD OLD DAYS!!",
        "Great air mover. Bought to fight high electric bills in San Diego. Home is over 2,300 sq ft and works great as a whole house fan, as advertised. No vibrations heard as in other reviews. Pulls cool coastal air in, cools upstairs perfectly.",
        "This fan is great pulls the air from the other end of the house perfect. It is a little louder than I had hoped but I am saving money on air conditioning and that is all that matters. One thing I screwed up on is leaving it on in the rain, my windows are in a straight line across the house from each other and I had it on exhaust so it actual pulled some rain in through the window. My mistake but at least I know how strong it is.",
        "Powerful fan for my attic window. We have it connected to a smart switch with a thermometer so we use this when the thermometer teachers over ninety and it turns off when it drops below 80. We use the to link smart outlet with the switchbot thermometer with the switch bot hub and ifttt to make them work together. If using in the attic remember to open another window in the attic for a cross breeze.",
        "This fan moves a lot of air and has been in use nearly every day since May of 2017 in my shop. Never a problem. When you move as much air as this fan does there is bound to be some noise but it is acceptable probably better than most large fans. Excellent fan, great quality.",
        "I live in an old Victorian rental with no AC and insulation that was only installed in the attic area - it gets hot! I was able to build a simple window frame with screen to which I mounted the fan in such a way that it can be removed whenever I want to remove it but the screen remains. I open the front and back doors, turn on the fan (its in a window in the middle of the house) and in about an hour (after the sun has gone down) the house has cooled down to where I like it. It is a little loud on the high setting but not too bad.",
        "Works perfectly! Unfortunately the black screws - screw into the black metal fan and then into plastic. I have had it for two days and I already have 3 screws that have fallen out and will not go into the plastic because it is stripped.....not very happy and wondering how long until the fan falls completely off of the plastic housing unit.",
        "Absolutely amazing! This thing isn't even in the same league as other window fans. It'd be like comparing an attic exhaust fan with a AA spray bottle fan. lol. I took my other window fans out and closed the windows just so I could open two windows at the opposite end of the house. Any where you stand you can feel a breeze from the air moving through the house and thats on low! lol.",
        "This is a great fan and has high volume intake & exhaust. I use it to pull excess heat from our store. Fits great in window opening.",
        "This is a serious fan. At low this fan really moves the air out of my house. I have had a number of window fans, many which lasted only a few years. This one seems really well built. We'll see how long the bearings last. I don't see any oiling points, but I haven't looked carefully either. This fan is also heavier than the previous ones, so it is a bit more work to install. Put a towel on your window sill if you don;t want it to get scratched up during installation.",
        "Using it in and upstairs room of and old 1880 house with very little attic space would have used an attic fan but not enough room. Fits window decently only problem is it is difficult to open window and can't get fan right up to window but it still works awesome. Pulls tremendous amount of air. Only draw back is the noise level but it is worth it.",
        "I love that this fan will suck the air out of my 1500 sq ft house in a half hour. The noise and vibration is awful i no longer run it on high due to the fact that i dont want to destroy my wall i can feel the vibration in the floor in the next room",
        "We had an old Air King and the bearing wore out after 20+ years of service. This one is great and very well made and I hope it will last just along. It moves a *lot* of air.",
        "This thing can move a lot of air. By opening the right combination of windows, we cool most of our single story house with this fan alone. The biggest downside is that it's super noisy, even on low. I wish it had like 2 or 3 more \"lower\" settings. Also, the guard on this fan is OK for the most part, but my toddler can get his fingers between the wires (so we have to keep it in a room he can never get into).",
        "this fan has cooled off my whole house. I live in south florida and it gets hot. I have no ac. I have a bunch of fans. none are as good as this fan. it is like an industrial fan all metal. love it",
        "first - it works, i put it in and opened a few windows about 5\" and there's a noticeable breeze through the house ... nice cool air but it's definitelyloud - i have it in a window on the far side of my 2000sqft house with a wall between me and it, and at night it's still loud on 'exhaust' turned to the lowest setting. Oh well, if you don't have a/c and want to cool your house down quickly by using outside air this thing works and ultimately that's what matters.",
        "Just began to use it last night (I wait until the last minute to begin using as to save on utilities). This fan cooled my entire 1st floor! Yesterday, before I installed, I was sweating while making my morning coffee. This morning I am wearing my robe to stave off a chill (the fan is on the lowest setting)!! Happy, happy, happy!!! I",
        "I love this fan. I honestly don’t know why everyone in the city doesn’t have one of these. I only had to use my expensive ac for one month this year. I saw a lot of reviews that say it’s super loud, mine is only loud if it is on the strongest setting and even then I don’t find it offensive, I have even slept with it on a few feet away. Mine came perfectly balanced so I don’t have a wobble or vibration that some people complained about. IK it seems expensive for a fan, but at least for me, it has already paid for itself in lowered electricity charges.",
        "We have a 2800 sq ft home in the NW. And during hot days and cool nights the fan completely cools down our house in a couple of hours.",
        "I'd rate this fan a 4.5, you do have to think out the install method, especially if you have horizontal opening windows , but all in all a great fan that really moves the air. Try it in different locations before permanent mounting, this is a big advantage over traditional whole house fans.",
        "I have been using a whole house fan that I purchased back in the late 1970s to pull air though the entire house and out one window. This new fan does the same, but is so very quiet! If it is built half as well as the old one, it will last me the rest of my life! As important, the controls are easier to reach. Love it.",
        "Got this for a 3/2 home. Can not close the window with unit in, so in the morning we shut the door to the spare room where the fan is located. In the evening we open the room up and open a couple windows on the other end of the house and use exhaust to pull cool air in. Cools the house down and it stays that way all day. Works for us.",
        "We bought a Lasko whole house fan years ago and saved a ton of money by using it at night instead of AC. The motor was held in the center with flimsy plastic, but it worked for years, until we had a brownout and the motor burned out. This thing, on the other hand, is all steel. It's heavy, and a bit harder to install because of the weight, but I'm glad we bought it. I'd say it does just as well, if not better than the Lasko we had, and we're not getting any extra annoying sounds from vibrating plastic. Sure, it's loud, but it's a large and powerful fan.",
        "Powerful fan. Does great job at pulling/pushing vast amounts of air through out the house. The blade on the unit I received was too much out of balance and vibrated intensely, causing a low pitched rumble throughout the house. After taking the unit to my local machine shop and having it balanced, the fan no longer vibrates and reverberates the house.",
        "I'm using this fan to cool my garage. It's design fit almost perfectly. I added strips of masking tape over the small gaps made when extending the side panels over my window's trim. When mounted it was rock steady with no rattling at all. In my particular garage configuration, running it as intake blows fresh air towards my work desk and cools better than using it as exhaust. Opening one garage door, even just a bit, lets this unit do it's thing. Looking forward to getting more garage project time in the warner months.",
        "I love this fan. It moves a ton of air. It fits neatly in the window. The unit I was shipped does not shake and it is as quiet as could be hoped (there is a delightful roar of rushing air and I can’t hear the motor over it). It would be a mistake to call this a “whole house” fan but it’s as close as you can get with a window fan. I just ordered a second one.",
        "Performance was solid (on high it moved a bunch of air) but reliability & longevity is terrible. I bought this fan maybe 18mo ago & it ran for ~20 hrs total before it malfunctioned. Now it only runs at about 1/2 of low speed which it does in shifts... it alternates running 5min & shuts off for 5min. How do I feel about it? This is literally the 1st review I’ve ever written... I’m trying to save you $. Go buy 10 cheap plastic box fans & put them in your windows; they’ll move more air & all 10 will last more than 20hrs. Air King is an ironic name.",
        "Significantly more powerful than your basic window fan, but not well suited for quick, temporary installation. The sliding adjusters are loose and sloppy, and the fan has blown itself out of my windows on several occasions, so I have to use window locks to keep the window from vibrating open. I do like it that you can reverse air flow direction with a knob, rather than having to turn this big, awkward fan around in the window. It excels at helping purge heat out of my house in the evening when the outside temperature drops.",
        "Eh. It's apparently what's available these days. I have a 60 year old Kenmore fan that hugely outperformed this one. But it has a broken switch. I like that this fan has the motor well on the inside, away from the window. Installation was easy - some vibration but not too awful. And air moves, just not nearly as fast or as much as with the old fan.",
        "Man when its 100 degrees out, my room still cool with this fan. The AC cost 5,500 to fix. This was the 100$ solution.",
        "Works fine on high, but vibrates the entire house on low and medium. Didn't contact company since we used high, but now have a child sleeping in the room so low would be best. Company will not offer any support since past the warranty period, despite acknowledging during support session that it is probably a motor issue.",
        "I have a two story 2100sq.ft house and it Really moves a lot of air. Placed it on the second floor master bedroom to ventilate hot air when the sun goes down and within 15-20mins, depending on how cool the air is outside, the whole house gets cooler! Saves energy that I don’t have to turn the AC on when we turn in for the night. Only thing is that it is really noisy at the highest 2 levels, especially when it is mounted in the same room. I would recommend turning it on an hour or two before using the room.",
        "Fantastic unit. Really moves the air. We put it in the garage. Our garage gets afternoon sun and has generally been a hot place. I installed this in about 15 minutes in one of the windows. Easy to do. I love the \"intake/exhaust\" feature. You can move air both ways. In the cool mornings...I will place it on exhaust...prop open the kitchen door (I use one of my wife's Crocs....) and open some windows. Not only does it exhaust the garage...it pulls air through the house. Just a wonderful unit. Plenty of air.",
        "Very nice. Installed in a window in a spare bedroom, and use it to cool our home. The intake feature seems to move more total air than the exhaust feature, but very happy. Its 3-5 times as strong as your regular box fan.",
        "I bought window fan for my bedroom before. It was so wimpy, maybe useful for one person. This is real stuff, pump out hot air from my whole house and suck in cool air from outside. Very satisfied. I installed a timer so that I can go to bed and let it work a couple of more hours.",
        "Makes it a little hard to open the window considering it takes up the whole thing and it also was hard to fit into the sliders that situate it in the window but it really does cool the house down. Turning it up to 3 is pretty loud. Can’t really hear the tv over it but I like the noise to sleep to",
        "We purchased this AirKing model based on other reviews. We have an finished daylight basement that here in the South tends tends to get very humid/damp (even with a dehumidifier). This unit was installed in one of the windows in the basement, adjusting it so it would exhaust the stale air. In the first week of continuous use, our basement was dry and must free for 1,700 feet of space. What great product and we're completely satisfied.",
        "This has saved us! Our house doesn't have central air. Most of the time in the PNW we don't need it, but occasionally it gets REALLY hot. We turn this on at night and crack a few windows and by morning our house is almost too chilly. It keeps the house from getting too hot to have it really cool in the morning. First thing when we wake up we turn off the fan and close the windows.",
        "Cool Fan! Pun intended! It’s a nice unit, it moves a lot of air. We have really enjoyed it so far and it moves way more air than I had originally expected. There is easy install and set up. Couple this I would like to note. MAKE SURE YOU MEASURE! This is a very large fan and does not fit in a majority of our windows. Also it protrudes out so to set up and instal it’s important to measure and make sure it will fit your application. All that said it’s still a great unit and in a more mild climate it works great!",
        "Sucks air into the upstairs windows on cool nights when there is no wind. I have it installed in the basement window. Kids love the way it cools their bedrooms immediately. My house is over 3000 sq ft. so it's a little small for that size house but still works if I leave it on for a few hours. Can cool the entire house.",
        "An excellent \"whole house\" fan. It moves a great deal of air. Mounted on 2nd floor side window. It draws air from 1st floor rear window helping to cool the whole house. A bit expensive but well worth the investment",
        "Used this in my garage window, i open the attic door and let it pull cool air in through the window into the attic and out of the vents two electric bills later savings of between 80 to 100 dollars, i live in centeral florida it is hot !!! Also it allows me to work in the garage during the day without circuming to heat exhaustion!",
        "Fantastic window fan! Needed to vent out cooking fumes and bring in fresh air my clothes were smelling like home cooking but not anymore.",
        "This fan is very heavy and one would think that is a good thing for durability but in this case it only makes install harder. The noise level is high even at the lowest speed. Is certainly solidly built and perhaps in a small factory would be a good option but not for a typical home.",
        "The fan is excellent but the size in totally incorrect. It's advertised as a 20\" Window Fan. In fact it's 26\" square and won't fit my standard window. I had to modify both the window and the fan enclosure in order to install it. It's heavy and hard to install but once installed, works wonders.",
        "We installed it and within 3 hours the fan stopped working. We tried several outlets. What a huge disappointment. While it worked the amount of air it moved was impressive, but disappointing to get only a few hours out of the product.",
        "Folks, if your looking for a gr8 fan, this is by far the best I've had in 15years. The 9166F is the one i thought i ordered. I received the 9166G. Not really sure what the difference is. This fan works great.",
        "Perfect if you live in a place with cool nights and warm days. Easily exchanges all the air in our 3000 sq ft house overnight, so it stays cool through the next day.",
        "We placed this fan in the window of our unfinished attic. We have it attached to a thermostat so that it automatically turns on once the temperature in the attic reaches 102 degrees. Venting all of that hot air has really helped us keep the rest of the house cool.",
        "This is a strong fan.I have it in the laundry room and it will blow the curtains in with the breeze. When i first got it and turn it on it was sucking my fireplace soot had to close the damper in the fireplace.",
        "Can’t be in the same room with it. But it does help move air.",
        "I really like this fan. It does vibrate some as the housing isn't all that sturdy, but it's got three speeds both for out and for inward blowing. It didn't fit in the window as I would have liked but with some work I think I can get it to sit steady and not vibrate so much. In NC, it gets pretty hot and humid and this fan certainly works better than our old Sears fan that's only 60 years old.",
        "Easy to use. Pulls air and creates amazing breeze. Sucks out heat or smells fast!",
        "I have no a/c in my house, and the upstairs was stifling. It's a lot cooler now that I have this in the window. I did have to modify it because the windows upstairs are tiny, but it works perfectly. I plan on getting another one for the downstairs next summer.",
        "I use it in a 1400 sqft condo and it works perfectly well.",
        "This fan is very strong. I use as an extractor in my kitten litter box room I foster kittens and cats so I have lots of boxes. It works really well. It is big. Make sure U have the right window to fit it.",
        "My husband decided to buy this, and I was like, \"OK, whatever.\" He has his things that he gets hell bent on. Anyway, this thing is AMAZING. We use it mainly at night to pull cool air through the house and vent it out the upstairs back window. Man, oh, man, by cracking windows strategically around the house, you can really cool down your house. They are not kidding that this is the air KING -- it is SO POWERFUL. Love this thing to pieces.",
        "Great fan clears our whole house out. Took a little extra work as we had double windows within one frame but I was able to make it work well. Since its on the second story I took off the outside fan guard to get a little more flow and have less to clean.",
        "fan make a HUGE amount of noise when running on high or even low speed.. i mounted this in the garage window that had no inside trim .. i later re-mounted it with a previous reviewers idea of using foam pipe insulation and it is now running much quieter.. even so you would not want to locate this near living , dining or sleeping area.. have a 2000 sq ft . the garage is at opposite end of house and works quite well.. i put fan on exhaust close all windows and crack windows about 3\" where you want air circulation",
        "I had this fan for all last years warm season. It was so much fun watching the temperature drop in the house when I turned it on. Put it in a window and open another in the direction you want the wind to blow. It is seriously an addict fan for a window.",
        "quiet, moves air pretty well. satisfied with overall quality and efficacy.",
        "Wish I bought 2 to help push air thru house. It is on the noisy side, but the constant hum puts me to sleep.",
        "This unit moves a substantial amount of air. Although it is loud on settings 2 & 3, I am satisfied with its performance.",
        "Has been cooling my house nicely and seems well made. I leave it on through the night and have no trouble with the noise.",
        "Wasn’t beyond impressed, but I’m happy. It does move the air, not like an actual attic fan, but it’s pretty decent. I suppose it’s worth the money as long as it stays in good working order.",
        "Demonstrably helped with pulling warm air out and cooling our second floor in exhaust . Does not rattle but it is a large fan and is somewhat loud . Sturdy and I believe will last many years. Also like that you can close the window behind if need be. Only thing I thought strange is that The power cord comes off the center of the fan",
        "I like the air intake and exhaust it like having a air conditioner",
        "We have window AC units, but with this fan, they were rarely used this summer. Admittedly, setting three is a bit like being in the cockpit of a Spitfire in a WWII documentary, but still great way to suck hot air out of the house or blow it in. We are in a graystone, first floor with about 900 square feet. It is the only fan we need to cool the house.",
        "Would like to have an even lower low setting. Seems well made. It works beautifully!!",
        "I am overwhelmingly impressed with the amount of air this fan moves. This is not a run of the mill WalMart/Home Depot window fan. Used early in the morning or in the evening during the summer in a 1000 sq ft home, it creates a breeze and lowers the temperature measurably in minutes (15-45 minutes) drawing air through open windows or doors."
    ]
}