{
    "entity": "Window Fans",
    "text": [
        "So far so good! Just need to order 2 or 3 more extender panels if I want to fill in the gap at the top. Thought the vertical install might be useful for others to see.",
        "Has been sucking air from my room 24/7 for several months now. Works good, although I did modify it. There is no 'always on' feature for the thermostat. Once outside temp gets to around 38-40F the fan shuts off even with the thermostat at the lowest settings. That will not be an issue for most, but I like my room COLD. I added a switch to selectively bypass the adjustable thermostat if I so choose...which for me, is always. The product works well and is fairly quiet. I am happy with it.",
        "I have had this window fan for a month and a half and used it 15 - 20 times and worked great until this morning. I turned it on Intake and I started smelling an electrical burning smell coming from the fan. I turned it off and waited an our then tried to turn it on and nothing. The unit is completely dead! I am terribly disappointed to have spend $40+ on something that only worked for 1.5 months. I loved it while it worked!",
        "I have casement windows and this fit PERFECTLY in it! My old one by the same brand did not have the option for intake or exhaust so we would have to keep flipping the fan around which was a pain. This one is just what we were looking for! It has the option for exhaust/intake and to switch from high, low or a degree setting is great. Totally recommend!",
        "The first time I got this model, it died in 5 weeks with only light to moderate usage. Amazon replaced it for free even though it was a week past the return date. That was about a year ago. I live in a fairly cold climate so this fan only gets used sparingly. It was unseasonably warm yesterday so I ran it for a few hours, no problem. Put it in the window today, dead. Double checked on another outlet to make sure that wasn't the issue. I'll never buy from this brand again.",
        "I should have read the reviews on this. Fresh out of the box the fan blade wasn't turning and popped off so I investigated and realize that Holmes QC Department decided that one of the fan blades didn't need to be secured with a nut! Nice.",
        "1. The extender screen is roughly 6 inch (perhaps more) too small to fully seal the windows.I use 47 inch blinds on my windows. 2. The thermostat is not very reliable. Changing fan speed, changing intake/exhaust or simply different times of day (day vs night) will need recalibration. 3. Even on high the blow of the fan is not much. I have used the cheapest holmes model and I guess over here they compromised noise for speed. The fan still cools the room so it is acceptable",
        "Bought this to try it out at my home so i dont have to turn on my a/c Arrived used, (was previously used by another client who also returned the product) product did not function properly on low, medium, high settings the fan would not work unless the speed was adjusted to more then 50% cheap material. a bit loud didn't have a remote total value of this product around 20 bucks. I can get a better fan from a local 99 cent shop for half the price. Wont buy another Holmes product again. returned it asap.",
        "I bought this fan because I'm a smoker and since I own my own home I reserve the right to smoke in it. With that said nobody likes the smell of stale smoke this fan fit's perfectly in my window and runs almost unheard while circulating the air in my smoking room, it's also great for using the morning cool air to bring down the temperature resulting in a slower warmup on hot days. The reverse switch is a must if you don't want the hassle of pulling your fan out and putting it back in to reverse air flow. I have had other window fans in the past and non of them worked as well as this one.",
        "I don't recommend this fan. First, the few times it did work, the output was low. It didn't push (pull) much air. Second, we've used this fan literally only a handful of times because we've been using the AC during the excruciatingly hot summer months and the fan simply stopped working. We had it on and it literally stopped spinning for seemingly no reason. So strange...and janky, clearly. Massive disappointment. You know, I won't buy any electrical appliances from this site anymore. A 30-day return policy just isn't enough time to properly vet an item like this.",
        "It worked fine for a week and then just died on us. Purchased it at the same time as 2 of the Hurricane 20in. Box fans. They are still going strong. Will get one of those to replace this substandard one. For the price, really thought it should have lasted for longer than a week.",
        "The multiple clicks to shut off the device, this fan works very well. I suggest using an outlet that has a way of turning the device off directly. I am currently using a surge protector that has a main switch that I use to turn off all the devices connected to it.The fan's temperature system also seems to be funky. If the current temperature is hovering around the designated temperature setting you have set (for example, 80 degree temperature setting), the device will constantly turn on and off every few seconds. Both intake and outtake air flow causes your room to feel a huge difference. This fan has helped a lot with cooling off my room's overall temperature.",
        "I am not happy with this product at all. Save yourself the hassle and get a box fan, 10x the performance at 1/2 the price. Pros- You don't have to flip the fan to change from Intake to Exhaust. the blades change the direction in which they rotate at the flip of a switch. Cons- The fan is ineffective in accomplishing it's primary function. It doesn't matter what setting you use, this fan isn't pushing much air either way.",
        "Purchased first one Aug 3, 2015, one fan stopped working after almost three years of steady use and otherwise no problems. What I like about this fan.... 1. Thermostat works. 2. Electronic reversible airflow switch control (no need to manually turn fan to exhaust) 3. Each fan has its own switch for air exchange setting (same speed though) 4. Fits securely in window (somewhat wide) and expands and locks well 5. Better than most fans for the money without above features and comfort 6. When I read the reviews for window fans this season, you are fortunate if you can get a fan with these features and last one season. I am reordering a replacement fan.",
        "(Non remote version) I can't sleep without a fan on and it's a nice kinda loud for that reason. On high, it's very effective for cooling. The extending part comes off easily. My original one came with a blade that was broken but Amazon shipped a new one the next day and had ups come right after that for the old one. I was impressed with that. I definitely would recommend. I haven't had this long but seems like it's gonna last. 😊",
        "We do not have air conditioning, we live off grid. Wanted something that would suck in the cool night air to assist with our 'natural' air conditioning. This works very well, and does not use much energy. I love the fact that you can flip the switch and it will reverse the fans, so you can exhaust air, like when the husband burns the popcorn, or intake air, like we do at night.",
        "Overall, I like the design of this fan. The noise level is fairly low and it gets the air circulating well; however, I am giving it an overall rating of 1 because it inexplicably broke 1 month into use. One half of the fan just stopped working one day, and it was just after the return period which now renders this fan useless to me. The best feature is that it’s a dual fan where you can have one side in fan and the other side set to exhaust to help circulate the air in and out out of a room, but now that only one side works, I can’t do that anymore.",
        "These work just as good as many other window fans of similar style. I like the fact that each fan is independently controlled and can be intake or exhaust. The little \"blocker\" to get it to fill the window, exists only on one side. As a result, these will not sit in the middle of MY windows. Not a real big deal but if that is important to you, you should know they do provide extensions of a fixed width for the left side of the fan. The right side can be adjusted to any width. I would still recommend this product.",
        "I bought this window fan hoping to get some good circulation in a second floor bathroom. It was highly disappointing, even with both fans turned to blow air into the room. It was worse when one was turned to circulate and the other exhaust. It's fairly quiet though. I sent it back, as it didn't perform as well as the description says it should have.",
        "We were looking for a window fan to bring in the cool night time air to our bedroom and also provide some \"white noise\". This fan fit perfectly between the sill and the screen. We do not have air conditioning so bringing the cool night time air is essential for sleeping. With 2 fans and 3 speed settings, we can set them on high to cool the room down then adjust for a cool breeze during the night. The sound level on low is perfect for the white noise factor we were looking for. Very happy with this purchase.",
        "I like the size, shape strength BUT you cannot over-ride the thermostat. The fan will NOT stay on all night & keeps going on & off disturbing my sleep. Last nite in one hour it went on and off 13 times! It keeps my room cool all day but not at night. I need to return it and find one without the thermostat that just stay on. WISH THE MANUFACTURER WOULD RESPOND. UPDATE: Someone said if I hold the button in past all the thermostat to past 80, the fan will just stay on. I am trying this for the next few days before I decide.",
        "Honestly I tried another Holmes fan model and this was the first time I have tried this model, had problems with several previous models and this one unfortunately has the same quality control issue. Motor and one fan blade refuse to come on and spin less than 2 full months after purchase, though while the fan worked I really liked the intake/outtake switch and the options. Durability and lifespan are always my concerns with this brand.",
        "Definitely was happy with the air flow when we got this fan to replace the generic Home Depot version we'd had for years. The issues ended up being it was SO much taller. Besides the actual window space, the slots in the fan are huge. So when it's running you can see you right into the window as though it was open. If you're in a totally private area, then this is probably a 5 star fan for you. However, if you're using it any kind of apartment or close urban sub-urban housing situation with neighbors in view, then you'll probably have similar concerns that we did. Amazon made the return easy.",
        "I bought one of these 2 years ago. It worked pretty good, so i decided to buy another one. Exact same brand, model, everything. This second one has totally weak air flow. I did a side by side comparison and the high is weaker than the firsts one's low. Don't know what happened, maybe they were addressing noise complaints or just using cheaper motors. Would not buy again for chance.",
        "Holmes USED to be such a good brand - I bought two fans around the same time. This one and the HAWF-2021. BOTH units had a fan go within two months of use. Stay away from the entire band if you can. I know I will.",
        "A great little window fan for my rental unit. The number of settings and the strength of the fans works great, plus it's not too loud. This fits in both horizontal and vertical windows in my house, and has attachments for both sides that can be added or removed for a lot of different sizes. Not great for a HUGE vertical (or horizontal, probably) window, but great for average sizes. The one drawback I have is the cycle-through for choosing a setting. Try not to press the button one too many times or you'll have to restart from the the beginning...",
        "I love this fan. It's simple to use. Push a button to change the fan from input to exhaust. Some fans require that both fans on a dual have to be input or exhaust but what I really like about this one is that I can have them going opposite directions. It's so lightweight and easy to install that I have put it in my window in the middle of the night without even turning on a light. Holmes makes great fans that last for years.",
        "Fan seemed great. Less than a week of use, and one fan rattles like crazy. We typically only use the fan at night, and it’s now way too loud to use one side. The other side is fine so far. My husband thinks the bearing is going out already (same reason we replaced our last one after five years of use). Unfortunately, after using it for a few nights I threw all the packaging out so I can’t return it. I’d advise, don’t waste your money. It’s total junk. The other window fans we have were half the price and lasted for 5+ years. We couldn’t even get a week out of this one.",
        "My assumption was ridiculous and I should have read further into it. My fault. But I saw nowhere in the product description information regarding backflow or airflow coming into the home through the fan. When I set the fan to exhaust on both sides ideally I would think even when the fan off the air from outside which is hot could not come into my kitchen. Other than that flaw, the fan works great. I found that keeping my storm window open about 4 in reduced some of that backdraft but it is still a problem and I'm still looking for a better fan. But for the money I paid it is what it is.",
        "We bought this fan to help circulate cool afternoon air into the house during heat waves. It does the job pretty well. Having the reverse and exhaust options are great since we don't have to physically flip the fan around. This fan was intended for windows that open vertically. Our windows slide horizontally so we have the fan in an open window turned 90 degrees. It works fine this way but it does put some weight on the window screen so just be aware of that.",
        "the on/off switch is the WORST switches ever designed by man, impossible to use, even my wifes small fingers find them hard to operate. if i could give it zero stars i would. AND the right fan does not work, i threw the box away, live up in the mountains and the post office is a hour away so i will just have to eat on this one CONS WORST switches ever designed by man Right fan DOA on arrival PROS Fits window ok Normal fan noise",
        "I bought this thinking it would do an amazing job at helping keep my office just as cool as my bedroom, which are on the same side of the house. The bedroom has a different brand of fan that sometimes makes the room feel like an ice box. This one, however, I walked into my office and felt almost little change to the temperature, even having it pull the cold morning air in. I can't say this was a good purchase... I'm rather disappointed with its performance. If you decide to buy one because decent ratings, I hope your experience is better.",
        "This looks exactly like my beloved Bionaire twin window fan, which was sold out so I bought this. One of the fan blades was ticking a little as if it was off balance or hitting something. So I gave it another chance and replaced it for a new one hoping it was defective. But the new one does the same thing only worse. It gets so loud it wakes me up. Sometimes reversing the fan fixed it, but sometimes not and it always does this. Not giving it a 3rd chance. The bionaire is way more quiet compared to this one when it's not ticking, and has never in 3 years of constant use made any unwanted noise.",
        "I purchased 3 of these fans to cool during the summer months. They are moderately effective, but not quite as much as my older Holmes model which is about 20 yrs old. Two of the three units had quality issues- the thermostat didn't work on one, and another had a noisy fan. One nitpick I want to call out is that the fan control positions are different for the left and right fan! On the left, the top position is 'low', and on the right, the top position is 'off'. You have adjust the knobs in different manners to get the desired effect.",
        "This is a QUIET fan with useful functions. One interesting feature is the ability to pull OUTSIDE air IN with one fan while pushing ROOM air OUT with the other. And vice versa. (For US it also seems to function perfectly when inverted. This was necessary to reach a just-a-few-inches-too-far-away outlet.) It is quieter than the dual window fan we had for several years previously. (a WindDance) The larger diameter fans move more air but without being noisier. My wish would be for the individual fans to have at least a BIT of airflow steering adjustability-maybe pivots top and bottom?",
        "I had the cheaper version of this that you had to manually flip around in the window, obviously the convenience of this is much better, just being able to flip switches to exhaust or intake. And the fact that you can do both at the same time is nice for circulating air. This is also quieter than the cheaper version.",
        "I love having the windows open when it's nice outside, but sometimes it gets a bit warm during the day and heats up the second floor bedrooms. I have used box fans in the past, but I was tired of tucking curtains around the sides to maintain privacy. This is perfect to cool down the room quickly as the temperature drops in the evening and has the side panels that help with privacy. Plus I love the exhaust fan option to air out a room or pull the warmth out with one side while bringing in cooler air with the other.",
        "Had an unexpectedly hot summer in NorCal this year and relied on the use of AC until we purchased this fan. It gave us the same effect as AC but was a much more cost-effective solution. The temperature control feature was especially helpful as it gets a lot cooler into the night but the fan was able to adjust itself accordingly to keep the room at a comfortable temperature. One star deducted because the box was damaged and looked like it had been opened before when received.",
        "I ordered 4 of these units, and 2 have had to go back due to multiple issues. One unit had a ton of rattling/metal-on-metal rubbing noise coming from the right fan motor. The replacement showed up the next day and had the same problem on the LEFT fan motor in addition to a faulty power/low/med/high switch AND thermostat control didn't work. Waiting on the third replacement now. Hope that one doesn't burn the house down! Update: one of the other units is now making the same metal-on-metal rubbing noise on all speed settings.",
        "This fan works amazingly in my small bathroom. I have a bathroom with a shower that has no ceiling exhaust. I shower with the door closed and my walls have started to get mold spots from the constant heat and humidity. This fan fits perfectly in my window and is such a snug tight fit that I can keep it in even in the dead of winter (I’m in Pittsburgh so it gets coooooold!). When on with the shower, there isn’t a hint of steam outside of the shower, the mirror is perfectly clear while the hot water is on. Amazing. Would highly recommend over all other brands, and thousands less than having an exhaust installed!",
        "I purchased this fan because every other temperature control equipped fan I tried required you to hit a button after power was off. Whether it was a power failure or just unplugging it, this fan goes right back to whatever you set it for without needing you to do anything. Other fans would stay off after a thunderstorm caused any power failure and that sucks. I use one to vent hot air from a top floor window and this fan has worked perfectly so far.",
        "A good product except air flow on exhaust is extremely weak. Input air flow is good. I bought this fan to replace a 6 inch dual fan thinking the 8 1/2 blades would blow more air, but they did not. My 20 year old 6 inch fan seems to have larger motors even though the operation is all manual. I've decided all the features of the new fan, I wouldn't use anyway since I only be using it as an exhaust fan. If I needed a fan to only bring air in, I would have kept this fan.",
        "I don’t really get the point of the temperature control, but you can use the fan without it. I love this fan because of the intake/exhaust switch. We smoke inside and it’s so much more convenient to be able to hit a switch instead of taking the fan out of the window and turning it around. Not only that, but you can have one fan blowing air inside, and the other blowing air out for circulation! I didn’t realize this was a feature so I was pleasantly surprised. We have used this fan almost every night during the summer heat and it’s really nice. Fits perfectly in my window so I didn’t have to use the extenders.",
        "purchased 8/10/2020 . worked fine at first. 2 weeks later fan makes so much noise its totally annoying. like it will fly off at any minute. Holmes does not provide a number to call and so far they dont answer email. Spent a half hour chatting with amazon help only to be told to call holmes. after i asked him at the start should i contact them . amazon assured me they would handle it. they didnt. sent me to holmes. I am not saying to not purchase this product because of my one defective unit. I am telling you to find someone who doesnt hide from there customers and wants to help there customers . Holmes isnt that one",
        "The dual fan is helpful in maintaining air at decent temperature inside and exhaust too. I have placed it in 2 different rooms to good air circulation. But the only problem is it's keep going on and off depending upon the temperature setting. Fits both windows. Easy installation. I have to leave blind open in one room to keep it unblocked. It's not very noisy but enough to realize that something is running on/off. I am enjoying it as far. Highly recommended product. Received with a delay but hope it last longer.",
        "Good price and good size for any window in the house. Like the fact you can switch from intake to exhaust without taking the unit in and out of the window to change air direction. Very easy to install, remove, use and clean. Have had three over the last 12 years and have had no problems and they were all fairly quiet.",
        "I purchased two of these fans, having seen a similar one before. One side of one of the fans stopped working just 2 months after buying it. The knobs are more like pretend knobs on a children's toy. While the dial in the middle shows temperature control, it really one works to turn it off or on. The smaller knobs for high/medium/low settings do work. I do enjoy that you can change the direction of the fans. The quality of these is so low, I would try a different brand for sure!",
        "Always purchased Holmes window fans. Currently have 3 of them. Have had oldest one for many years and it's still quiet and works great. This new one, after only 2 days of use, the left side fan has developed a rattling noise that keeps us awake at night. Tried to turn that one on reverse, but still the same noise. Interestingly, this is the highest price I've ever paid for a Holmes fan and it's the noisiest. The $23 version from Walmart is working much better and has been in use longer.",
        "I use this fan in my window at night for sleeping, and it doesn't rattle or howl or sound like an airplane engine--it just sounds like air. It works perfectly. The only downside is that it can't be taken apart to be cleaned. Other than that, it sucks air in and out, and it has the three settings. I don't use the \"thermostat\" (nothing is too cold for me) so I don't know how that works, but overall the thing is fantastic! Hopefully they'll still be making it in a few years when this one goes so I can get another one!",
        "One of the two fans makes a rattling sound when switched to exhaust. I bought the same fan about 10 years ago and while this seems to be the same make and model - the thermostat control does not work as well. When switching from high to low, the fan speed does not immediately change. It takes a few seconds for the speed to slow down, and then when cycling through the temps (not on high speed) it speeds up again before switching back down to low. I think this might be a defective fan but I already threw the box away so I can't return it.",
        "It’s a fan, so it works... definitely do not notice any better temperature control in the room. But above all, the fan is loud. Not a soothing loud either. The fan makes a mechanical rattling like the revving up of electrical equipment. The video didn’t quite pick up the actual noise described. But it’s not conducive to having this fan in a room where you are trying to watch TV. If you have it on medium, it’s not as bad. But when it’s on high, it’s obnoxious. Sounds like a lawn mower. This is a manual fan, no remote.",
        "For years I have been saying to my husband \"I wish I could bring the cool air from outside, inside!\" Now we can!! These fans are the BEST! I initially purchased 1 fan for our dining room, then quickly ordered a second one for our bedroom. I have double hung windows, one set opens side-to-side and the other opens top-to-bottom. The fans fit perfectly in both sets of windows! And on cooler evening, I have to turn the fans off because it gets too cold! I am so happy with these fans!!!",
        "It worked great for about 6 months, then a couple days ago I smelled an electrical fire smell. Turned out to be coming from one of the fans (Left one to be specific). Fan no longer works at all, would've expected it to at lease make a year..... Read other reviews and they seems to experience the same thing: Electrical burning smell coming from the fan after it no longer works anymore.",
        "I just received it today (one day shipping with Prime - yay!) Unfortunately, it just doesnt move much air. On the highest setting it's reminiscent of an old-school box fan on low. The noise level is fine and there doesnt appear to be any mechanical deficiency, it just doesnt suit my needs.",
        "This barely works at all. The controls are messed up and you have to bang it like it’s a remote for it to even come to life. I threw away the box which I’m pissed about. Can’t even return this crap",
        "This did not come with a remote. I have had it up in my window for a couple of weeks now and my room is so much cooler with it. During the day I have both on exhaust so it can pull out the dry stinky air while I sleep (I work at night). Then at night one of the fans go on intake mode and we get the cool air. I have to say we also have 2 other fans blowing in the bedroom for circulation. Definitely a great investment and much cheaper than using the AC for us.",
        "We purchased three of these. Each unit included only 1 panel extender; not 2 as shown in the pictures/thumbnails. Disappointed in the deceptive advertising. Also, one of the units consistently produces a rattling noise regardless of the setting (intake/exhaust, low/high).",
        "Growing up, we had a bunch of these and I remember them working really well. Same story—this fab does exactly what it says in the description. I live in a city and my neighbor smokes cigarettes on his patio. So when we have the windows open, I keep this fan on the exhaust settings and I swear it makes a difference (decreases the smell of cigarette smoke wafting into my house). Great little fan.",
        "It has no power. I'm so disappointed. My laundry room is a very small attached room to the house. It's not ventilated. I live in Az so doing laundry in the summer is not fun. I was so excited to see this product, especially with the temperature controls. I had it installed professionally & fitted. I didn't expect this to cool the room like an AC unit would, but I did expect a cool breeze. Nope. I would've gotten more power from a $15 desktop fan.",
        "This fan is just about useless. I live on the second floor and my apartment is always hot. I have tried this every way possible, one side exhaust, one intake, both intake, even both exhaust. I have this in my kitchen and even when I am not using any appliances it is really no different than just having the window open. I bought a cheaper, simple hi/low, manual reversible fan for my bathroom and that one is 100% better than this one.",
        "I’m not impressed with this product at all. We bought 2 fans hoping to really get the air moving. We have a cape code style home and had put both fans in. One pulling in and the other pulling out. The fans just do not have a good wind force and didn’t circulate the air enough air. We literally just threw $80 out this window. I had read the reviews, but the reviews certainly didn’t line up with my experience. We would have been better off buying box fans and spending half the money. Don’t waste your money - go buy a box fan!",
        "After reading reviews I was excited to have my house cool down. I also have a rental in my basement. However me or my renter have not noticed any big difference in temperature. Has an intake and outtake mode but the only time I felt cool air is late at night or early in the morning when the house was already cooled down. I feel like I wasted my money no difference whatsoever during the day when you need it most.",
        "it was the only way to evacuate the air I'd stirred up in my apartment. I have two cats and the fur gets everywhere. To help move it outside while I'm dusting, I have a larger fan behind me blowing towards the window and two of these puppies, side-by-side, sucking the air and everything suspended in it, outdoors. I needed two so they'd fill the window and I could seal it closing the window on the two of them. Perfect fit!",
        "While the fan was working, it functions ok. The adjustable side panel came apart, and I had to fix that within the first few months. The amount of air it brings in is decent, but I would have liked more. The reason this isn't a 3 or 4 star rating is that one of the sides stopped working completely after about 4 months. So it is pretty much worthless now. ok product when working, but not durable.",
        "Was also delivered late and went MIA on its tracking number. This was a bad purchase. The one fan that does work is way louder than expected even on its lower setting, too. Amazon replaced it at no charge with the same model, and it also has a broken/rattling left fan. Only on top of it this time, it also smells like burning plastic. Not buying a Holmes branded product again.",
        "great window fan, but it the cooling aspect is not that great, claims to dial down to 60 degrees but all I get is mildly cool air, I could open my fridge and be cooler. It does move the air around and set really well in my window.",
        "I like this fan a lot. My last, slightly less pricey model from Target, finally bit the dust after 4 years of hard use. This one has some additional features that are quite useful—being able to turn on only one side for instance. Powerful enough to cool a 12'x12' bedroom down at night, very quiet on lower speeds. I did have to return the first one because it had an annoying rattle at low speeds. The second one was perfect. Positives: Hardy fans, do not break easily. Good looking Fits most windows Powerful No LED light Negatives: Knobs on this model are awkward to turn Thermostat a bit hard to understand",
        "I have used this fan almost 24/7 during warm months of the year for the past three years. Works well. On the high setting, the fans do emit noise but works well as ambiance for sleep and is not loud enough to be picked up on phone calls/video conferences. Temperature and separate intake/exhaust fans seem a bit like a gimmick-- at least, I have never found use in them. If there is a similar quality fan that is cheaper for less features, I would probably go for that.",
        "This fan is no good. The high setting is like the low setting on other fans. It has a temp control that when it reaches the temp it’s set at it stops, and it’s not yet cooler. Wish I wouldn’t have bought this. What a waste of hard earned money.",
        "Developed a noise in the right fan, I returned it. The Holmes quality isn't there.",
        "This is the wimpiest fan ever, not capable of cooling anything. For 40 bucks it's not \"better than nothing\"",
        "The fan works fine on exhaust and intake. However the resistor works, it is louder on low than on high, as the fan emits a low, consistent hum. The thermostat feature does not work. If you set it to the same temperature it is outside, say 65, it will pop on and off every ten or fifteen seconds. It may even shut off, turn on to high (it always goes to high first), then to low, then off again in the span of 10-15. I do not recommend this product. I wish I had bought the cheaper model.",
        "This fan is awesome. May have cost a bit more but worth it. Have in my window of my guest room and no need for air conditioning on days that are not sweltering hot this thing does the trick and pushes the warm air out and keeps it cool inside. Really please wish wasn’t out of stock... bought a cheaper different named one and just didn’t compare to this one and the power.",
        "I bought this fan last year in August a little after summer to get some fresh air in my room and also out take the hot air. Over time the buttons starting not working and since the beginning the temperature gauge didn't really seem to work because once you adjust it to a certain temp, its just up the fan speed or lower it at the same time not really changing the room temperature. The fan ended up not stop working thats why im writing this review.",
        "Junk avoid. I would rate zero stars if Amazon had that option. Item arrived defective. After closer inspection It appears to either be a refurbished or returned item, which it is not advertised as. I am tired of receiving junk from Amazon. Too bad they don't have to send their own trucks back to collect all the returns, maybe then they would care about what is shipped out.",
        "This fan fit the bill for us and it worked great the first few days, but after a week of running all day, it has started an annoying metallic sounding rattling and vibrating and is now too noisy for us to continue use. Outside grill and housing is plastic and does not seem to be an issue. Problem is internal and appears to be the motors and fans themselves.",
        "Great little fan. The Intake/Exhaust option is fantastic. Feels solid and well built. Moves air very well. I bought this one to replace an older model, same brand that had to be 15 years old. Note, this unit has fins that help it stay in place with the window half way down. Once locked in place, it won't go anywhere until you open the window.",
        "Stopped working after one season, no product support, warranty doesn't exist.",
        "Very Flimsy the buttons for intake and exhaust keep falling out there is no power off button you have to cycle through all settings to reach it I bought it because its white on all the pictures but it turns out to beige not happy you have to have both fan on you cant chose just 1 and very loud if I didn't need it right away I would return it I'm very disappointed in this I wouldn't recommend it to my worst enemy and really remove all the picks if it's not white that's False advertising",
        "Its a great looking fan, its powerful, has temperture control and is quiet or at least I thought it was. Ive had the fan for less than 24hrs. The left fan blade started making a terrible noise in the middle of the night, as you can see from the video it is unbearable. It stops making the sound if I put it on low speed, but comes back at medium speed and is terribly loud on high speed. It comes and goes so it gets even louder if you let it run longer. I liked this brand for window fans, its my second one from Holmes, but I wont be buying from them again, thats for sure.",
        "One star on the remote control question, as it does not have a remote control and I had to give an answer.. All other functions are excellent. But - it does not fit in a standard casement window with the screen in place. I live in an apartment so our windows are el cheapo in nature. Recommend you measure the space between the window and the screen, and check the manufacturers specs to be sure it will fit your installation. Installed mine in a window that opens on to a screened in lanai, and it works perfectly.",
        "A great product and a great price! These fans are easy to put in the window and take out! They are very quiet compared to any fans I have ever had! They had controls that were easy for anyone to operate! I definitely would recommend these to anyone and I would definitely purchase more of them! I have had them for a long time and they are still working great!",
        "I had an older version of this product and purchased this one due to the quality of the product. The only item I like about the older one verses the newer one is that it had temperature controls instead of dial system now and the speed settings, new one dials up for speed and the other goes down (have to watch to make sure I set it right) but still has the 3 speed settings.",
        "The temp control is very sensitive and when it fires up and it's too cold it shuts off instantly which is fine except it likes to check very frequently so it is always turning on and shutting off and it's loud. The fan part works good but the reason I got it was for temp control at night so I don't freeze by morning and all it really does is keep me up",
        "Works great! A little louder than some fans, but similar to our box fan. I'm so happy we got this fan, because you have complete control of the direction and intensity. We live in a skunky area, and it really helps to be able to switch the fan to outtake with a button instead of having to flip the entire fan around. No lights to keep you up at night, and I don't really think it needs a remote, though I could see why other people would want that.",
        "The fan is OK but it doesn’t have very strong engine power so it blows air very Very low even though you have it on a higher setting.It is very quiet but only because it doesn’t blow air very strong.I threw out the box otherwise I would have returned the item",
        "Slightly bigger than I thought it was going to be. Doesn’t fit in my small window. My fault for not reading the description better to compare it to an older model fan I was replacing it for. The fan blades are bigger than my older model. Love how you can have only one fan on or having them blowing in opposite directions. For the price point I hope it lasts for a least a decade.",
        "I bought 2 of these for my house when it got up to 100 degrees this summer. I bought a house in the mountains with no A/C, and an attic fan that only does part of its job. The fans are very effective in pushing hot air out & pulling cold air in. Once I had these installed, I could actually enjoy being at home without melting. I may be getting more for the downstair bedroom when it is finished & ready to live in.",
        "The “high” speed on this is bizarrely weak- I thought must be doing something wrong. I’m used to a box fan and knew there’d be a difference here, but putting my hand right in front on the fan (yes, on intake mode), I honestly can hardly feel any air coming through. I would have believed it, if that was the lowest level. But it’s essentially useless, considering the super weak output. Returning.",
        "It's super annoying to have to push the button so many times to change between settings. I didn't think it would be this hard to go from high to low. But ibha e to hit the button like 8 times.",
        "Just got this today , arrived beat up in no packaging just manufacturer box. But I still said I'll try it Worked first time, and now the mode button that turns it on is screwy. Doesn't work well Sending for replacement The idea is good but HORRIBLE shipping and quality control",
        "My previous Holmes window fan lasted me 25 years, was whisper quiet, and had a convenient touch bar to turn it on and off with ease. When it finally died I bought this fan. It's made of cheaper plastic, has hard-to-turn knobs, makes a horrible grinding/whirring noise when I use one of the fans, and changes fan speed randomly whenever there's a breeze. Perhaps fan technology hasn't advanced significantly over the past 25 years, but I had no idea that it had regressed.",
        "I purchased two for my kids' rooms and really need to purchase a third for our master bedroom. They do a great job of keeping our upstairs bedrooms cool during hot summers, without needing to run the AC at all hours of day and night. They fit nicely in the windows, even with window screens. My only complaint is the touchy thermostat, which turns the fans all on or all off - there's no slow mode or happy medium, which causes the fans to strobe on and off. This can be distracting for sleeping, and I never use the feature, just setting the fans to low or high as needed. Otherwise, I highly recommend them.",
        "received this product today in poor condition. Poorly packed and worked for two minutes. Started making noise and one of the fan fell off inside the frame. Never expected Holmes products to be like this poorly made. I have two Bionaire Fans for last 5 years working amazingly great. Tried this one as could not find that brand available. It seems I have to wait for Bionaire until its available again as other products are not as good with the similar price range.",
        "I just opened this up so I can’t speak to its actual function. I just wanted to comment that the front exterior is ‘white’ a whole lot like an old computer where the plastic has aged. I’d call it closer to a taupe-y light gray than white. Disappointed because it makes it look older than it is and I’d prefer it be actually white to look more like my windows.",
        "Have had this fan for over three years and run it at least 10 hours/day year round. It has held up well and provides much needed air to a room with poor air circulation. No bells, no whistles. Just a fan. The one draw back with this fan (and all window fans) is that if your window is not a standard size, it won't fit well. Holmes purports to sell additional extender panels (one comes in the box) but they don't have them in stock ever and their customer service is lousy. All that being said, I have gotten my money's worth on this fan.",
        "My boyfriend got this for our bedroom. It's great at keeping our electricity bill down during all but the hottest \"heat advisory\" days (if it's 85 deg F in the shade, no amount of fanning helps). My favorite part of this fan is that there's no indicator lights or sounds to add to the beeping glowing cacophony of our bedroom.",
        "The thermostat is very sensitive, I set it when the air in the room was just right in the morning, When the ambient heat in the walls warmed up the room, it came right back on. Moves a large volume of air, but slowly, which makes it quiet. This is just what I wanted, but don't expect it to throw the air a long distance quickly. I'm very happy with it!",
        "I just installed this fan today after receiving yesterday and it barely cools anything in my small bedroom. I do not feel a difference in the temperature controls. The fan is very weak and does not circulate much of anything let alone cool the room down. For a new fan, I am surprised that it makes a buzzing noise out of the box. I wonder if this is refurbished. Either way, I will be unfortunately returning.",
        "This lasted 4 yrs before it died. Can't complain. It did a good job circulating air and cooling during the hot summer months in a small room (12ft×12ft). Only negative thing was difficulting cleaning all the dust out, it would definitely accumulate. But overall was happy with the purchase and would buy again if needed"
    ]
}