{
    "entity": "Window Fans",
    "text": [
        "We bought this for our smoking room. Calling it reversible is a slight stretch. In order to reverse it you have to take the fan out of the window and flip it over or take it out and flip the control on the opposite face. It does have \"dual control\" but it is a control on each face of the fan. It feels well made and should last a while. On high you may need to turn the volume up on your tv or radio. It's not real noisy but just enough to interfere with hearing in a small room. Hope this helps.",
        "Obsessed! Fits my window perfectly and allows me to turn the AC off at night and suck the cold air from outside - into my room! I use this to cool down my master bedroom since it's on the backside of my house and doesn't receive a breeze I keep it on low and it keeps the room cool and smelling fresh!",
        "Thought I reviewed this before. Maybe I get to rereview every time I buy one. I've bought three over the years. Fan 1: eventually stopped working Fan 2: Only one side works, so I keep it in a second window Fan 3: very loud at first, but has been getting better. The only reason I buy this fan is it was $12.99 at one point. (need to reevaluate for next purchase) And it works for a couple years.",
        "This powerful, reliable, low cost fan has been a life saver during this summer's heatwave! I placed it vertically in my double paned bedroom window, and it dropped the temperature in my room drastically in a matter of minutes. I've found that if I leave it on throughout the night in low, I actually have to turn it off or put more covers on, because it's too cold! The only downfall is that it only comes with one window extender, so it leaves a large gap if you mount it vertically, No problem though, as I ordered some extra extenders directly from Holmes for only $2 a piece!",
        "This fan does not come as advertised will not fit my window I still need to buy two extra panels to completely close the fan in with the window which are not included,if I knew this I would have bought a different fan. The fan is not reversible, does not have a switch to reverse fan airflow, you literally have to take it out of the window and turn it around. So this fan is not reversible and does not fit every window, the word play in the advertisement is very deceiving. I do not recommend buying this product just because of the word play and false advertisement.",
        "My expectations were low at this price point but not only does this little fan move a lot of air it's quieter than I expected and well-designed. The variable with attachment and sliding panel make it easy to fit in different windows very quickly and the molding on top is designed to keep an environmental seal so the only air coming in or out is the air from the fan.",
        "My fault, I didn't read the reviews just assumed this was an actual reversible fan. You have to manually turn it around in the window! If I'd wanted that I'd have gotten a cheaper box fan. It's not a bad product, but I feel that the seller is being deceptive by labeling it \"reversible\". I'll keep it long enough to replace it with a product that isn't deceptive. Everything is reversible when you turn it manually!",
        "Although the fan noise is a bit too much, it does its job well in cooling the room. The noise is bearable if set at a low level but if it's high, then it gets louder to a point where it's hard for me to fall asleep even.",
        "The fan saved me from the recent heat wave in New York. There is nothing special about it and the noise level is quite high even on the low setting. That being said the wind power is worth bearing the sound. If you’re looking for a no frills fan on the cheaper end of the market this fan will suffice. Pros: -It’s cheap and easy to install -It fits your standard 28” window -Powerful air flow Cons: -It’s noisy -You have to manually turn it around if you want the air flow to go out",
        "Bought four of these. One stopped working entirely in less than 2 weeks. Two only work with one fan working after only 2 weeks of use.. One of them is working just fine after two years of service. 1 out of 4 is not a good track record. Never again will I trust Holmes products. I contacted customer service to replace a fuse that had blown JUST AS THE OWNER Manual told me to. The customer service center told me they no longer carried that kind of fuse and had no idea where to buy one.",
        "Second fan motor blew out in less than a week worth of light use. The motors are fairly small along with the fan props which leaves you with a mid-high pitched sound while the fan is running. The amount of air it moves is not very impressive either. My previous unit did not make half the amount of noise this does and moved much more air. The plastic case is fairly durable and fits into window well. If you do not have an electric outlet within a few feet of your window, plan to use an extension cord. * I did not get this unit free to provide a favorable review.",
        "Set it in window, turned it on , and to test it, lit a wood match , blew it out , and watched the smoke. 10 feet - smoke straight up. 5 feet - smoke straight up. 2 feet - smoke straight up ( ! ) - not the slightest movement of the smoke toward the exhaust fan on high. This test done twice in a 10x12 room : once with door closed / once w door open. NOT THE SLIGHTEST MOVEMENT IN THE UPWARD STREAM OF SMOKE. NO \"EXHAUST \" WHATSOEVER. COMPLETELY USELESS.",
        "Out of the box, slide a side in, and you are good to go! My only criticism is that I wish there was a way to adjust how the window holds it. I had this fan many years ago, and I loved it, but I owned an older home. It fit perfectly. With new windows, not so much. It stays stable where I put it, no vibrating, etc., but I'd like it if it fit better. The sash is almost too wide to fit onto the top, and the extension sides so not extend enough and have to snuggle into the thin sides of the window.",
        "Works great! I got it 6 months ago for the summer. Got it real cheap as an amazon warehouse deal. For the price of around $13, it was worth it. For the price now, might want to shop around. The Fan only spins in one direction. If you want to reverse flow (instead of having it intake cake) you’ll have to flip the entire fan.... meaning controls will be on the outside facing. Not sure if you could reverse the polarity of it but that’s not without modifications. Fan has two speeds. Both speeds are not too loud, I find it acceptable. It’s white noise for me.",
        "These basic window fans are good for what they're designed to do. They are without frills with two speeds and single direction air flow. You can physically flip the unit in the window to reverse the direction of the air flow since the controls are located on both sides. Those looking for the convenience of frequently reversing the air flow should spend a bit more for the upgraded unit that does this electronically. I only needed the ability to blow cool air into the room from outside and this unit gets the job done. Some might find the twin fans a little noisy. All in all a pretty good window unit for the price. I purchased two of them.",
        "Updated review: the window fan died less than a year later, but it says it’s outside of the return window. Annoyed to have to hunt down warranty information. I got a better unit at my local pharmacy. This one was awkward and a hideous greenish beige color. Please do a better job describing the product you are selling. The attachment piece is awkward and the extension/accordion piece is extremely difficult.",
        "This thing works great......for a few days😔 I literally had this delivered 6 days ago and now today it won't turn on. At first I thought maybe the outlet went bad but after some testing it looks like the fan itself just won't power on anymore. Shoulda just spent the extra ten dollars to get a nicer fan guess we'll see how the warranty works ....",
        "This unit is small and, as a result, not very powerful, yet it's as noisy as a more substantial fan. Still, it's pretty inexpensive and does an OK job drawing cigar smoke out of my office, which is what I use it for. I can't imagine it would afford much cooling with those tiny fan blades. It's plastic, but somehow sounds a little tinny or wheezy. We'll see how long it lasts under some frequent use (about 2-3 times a week for a few hours. My guess is I'll get a year out of it, but maybe I'll be happily surprised.",
        "A cheap piece of junk. The third time I turned on the fan, only one of the two fans was turning. After wasting time on it, now the right fan works normally, but the left one is barely moving. \"Dual Blade Twin\" wonder! If I send it back, it will take me hours to find a box, find the receipt, pack it up and walk to the post office. I'll throw it out. Lesson learned.",
        "I bought it 13 months ago and it just finally had an issue and one of the blades gave up! Was ran CONSTANTLY for that whole year and was not cleaned lol so I bought it again this week :) fits the window well holds up to abuse and runs like a champ! It didnt slow down or miss a beat until the one half died and to be honest it could have done its job probably a few more months....its noise is noticable like a ticking clock but in the same way not annoying or disruptive on high :)",
        "I purchased a homes twin fan almost 10 years ago and it’s still going strong. When I was in the market for an additional fan it was a no brainer to buy the same kind. Unfortunately my current purchase stopped working after two uses. Of course it was after the warranty. Their CS wanted everything but the fan itself as proof. Took a while for them to send out a new fan. Here I am less than a month later and it’s stopped working. Not even used full time. It’s a great fan when it works but no excuse for it to stop working. Save yourself the hassle.",
        "With this oppressive heat, this summer, thought a \"fan\" will be a sort of help, especially during nights. Stumbled over this fan on Amazon, and the idea was kind of \"nice\"to have a fan with a \"dual\" functions. Extract & Exhaust fan at the same time, is a great idea indeed. Unfortunately, it turns to be just \"waste of money\" ! Didn't utilise the moment I received it, and certainly, this is my mistake! Otherwise, I would have return it at once. Both way, it's \"OBSOLETE\" and sadly, the time frame to return is over.",
        "We've had an older version of this Holmes fan for many years with no problems. This purchase was to use in a different room. The packaging seemed odd in that there was no plastic bag over the entire unit and the electrical cord was not nearly wrapped and tied as you'd expect with nearly all appliances like this would be. That is the reason for the 4 star rating.....it seemed strange. Looked like it MAY have been a returned item and repackaged. There is no other sign of use (dust, cracks, etc)....it works as it should.",
        "This fan is pretty nice and I have no real complaints. My notes: It is not white or even off white, it's more of a really light cream/tan color, borderline beige. It's not really reversible, what they mean is you have to take it out of the window, flip it around, put it back in. The switch itself is on both sides though, it's pretty dang clever actually. All of that aside, it pushes a lot of air and is fairly quiet. Only having the extending flap on one side is kind of odd but it is what it is.",
        "This fan is great. I used to use the big box window fans throughout the house and they worked well. I had new windows installed and they do not open fully by design. These types of fans are the only ones that fit anymore. They work very well, almost better than the box fans that took up twice the space. The reversible airflow is very convenient to have a lot of air cycling. I highly recommend this fan!",
        "It worked OK at first. It was a little loud, but I could live with that. But after 1 1/2 weeks, it just would no longer turn on. It was always used inside the house and never exposed to anything that would have caused it to stop working. In my case, since I've tossed the box it came in (hey, it worked at first), I just sent it to electronics recycling and bought another brand of fan from a different manufacturer and vendor. I do NOT recommend this.",
        "Great fan. Moves a good amount of air. It’s a window fan that does exactly what a window fan should do. Adjustable sides to fit in any window. My only complaint or disappointment is the noise level. Kinda reminds me of a small plan getting ready for take off. It doesn’t really bother me, but it might for some others. Otherwise if you don’t mind a little loud hum it’s a great product.",
        "It fit my window like if it was specially made for it. At night my room gets very cool with the fan. During the day if its hot outside it does throw warm air but of course its a fan, so i already knew that was going to happen. But overall it does its job. I would recommend it if you dont want to waste ablot of money. I have seen other reviews that complain that it was too small for their window so i suggest u measure your window before purchasing it.",
        "I have purchased two versions of this fan: 1) in 2018 and 2) in 2019. My review applies to the 2019 version (the fan seems to have been 'redesigned' in the intervening period), and I returned the 2019 purchase. Issues: 1) the fan smelled and filled the room with a faint burning plastic smell and 2) the electric motors/design appears to have been changed from 2018 to 2019 (perhaps the reason for 1) and in a side-by-side comparison the 2019 version appeared significantly underpowered compared to the 2018 version. See the photos for the apparent difference in motor/configuration. Additionally, these issue could have been a defect of the specific unit rather than the line, but this is just one review.",
        "Cools down the room, saves electricity from having to turn on the A/C. Fits my window fine. It does have a loud humming sound but its almost like white noise. On a hot day, the house gets very stuffy and by night time, the air outside is a lot cooler than inside the house where the warm air is trapped. This fan is able to pull the cooler outside air into the room and cool the room down drastically. I do have the room door closed while doing this to be most effective.",
        "We're remodeling our house one room at a time and I bought this to blow drywall dust out of the room when I sand drywall. It has handled the dust well. I'm sure the amount of dust will kill it before its time but it has held up well. I also sanded a floor and it again did the trick for removing dust and chemical smells. I docked it a star due to not being very quiet. The noise level is not a concern for me but it might be for you. It isn't bad, but it is noticeable.",
        "I actually like this basic model better than the advanced electronic controlled model. There are two reasons why: 1, I can turn it on and off with a remote controlled plug module. You cannot do this with the electronic model. 2, if the power goes out or flickers the fan resumes running when the power is back on. The electronic model does not. The only thing the electronic model has going for it is the fact that it is electrically reversible. This model you have to turn around manually. Sometimes an old fashioned on/off switch is better than fancier electronics. If they added the reversal switch to this model there would be no need for the inferior electronic model.",
        "This fan was purchased to replace one almost identical to it. The previous fan was purchased from a Target over 7 years ago and held up to being left in windows during the rain. The side extensions to fit better in the window works well with only an inch of uncovered space left. The high setting is a bit too noisy for white noise at night, but the low setting is just right. The reverse airflow only means that you can flip the fan around and point the air in the other direction, therefore the advertisement of this feature seems gimmicky. Overall, for the price, this fan is great. I hope it lasts just as long as the last!",
        "Two fans stopped working at the same time after the return deadline passed. I contacted the factory since my fan was still under warranty and received no response. Worst product and customer service ever! I don't understand why Amazon deleted my initial review for this fan?",
        "The price is fantastic considering that this fan is a really great exhaust fan. I needed a nice window fan that was an exhaust fan and for the price you can't beat it. It works really well. I haven't needed to use the fan which the only drawback is you actually have to take the window fan out of the window and reverse it so it becomes a fan but the fan isn't heavy and it really is quite simple to switch it around. I am really enjoying this exhaust fan.",
        "I mounted this in the bathroom as an exhaust fan. It easily keeps the humidity in the bathroom down during hot showers which means I don't have to clean the ceiling and walls (mildew) as much since the moisture isn't hanging around. A little noisy, but that doesn't matter when you are running a shower. Great for what I purchased it for and at a good price. This is my 2d one. Old one still works and it is about 10 years old, but it is starting to show it's age and plastic is finally starting to deteriorate.",
        "If you just ab-so-lutely need air to be pulled in or pushed out of a particular window, these are the fans for you. No fancy gimmicks. Just Low, High and Off. You'll need to physically flip the unit around to reverse the airflow but that's super easy. I got it for sucking smoke out of my kitchen when I had to clean the oven and it did the trick! I look forward to having my windows open in the summer and blowin' that cool night air in! Awww yis",
        "We purchased an older home and we dont have the funds yet to install a fan in the bathroom but needed a exhaust fan to blow out the condensation from the shower. This is a great price and works well. Never fogs up in the bathroom now. The fan is very quiet to me. We used it once before we started getting cool fall weather and it kept the upstairs very cool and pleasant to sleep in.",
        "I loved this fan so much, I purchased two. Unfortunately, one of the two fans stopped working shortly after it was too late to return. So as much as I'd like to recommend the Holmes fan, I can't get past the fact that one failed completely and had no exchange or refund options. This is not an emotionally driven review. I'm simply trying to prevent this form happening to others. Thanks.",
        "We use this fan to help with pushing the cooking smells outside in the kitchen window. It does very well for that. I live in a condo without much ventilation, as I said it does well, but I wish it had just a little more power on high speed. Of course I'm not using it for what it was intended for, so I can't complain. Fits in the window nicely, has slots to fit on the frame of the window so there's no fear of it falling out.",
        "Picture doesn’t say anything about the quality of the product. If this was on display at a store, I wouldn’t buy it. I am disappointed with the quality of product after taking it out of the box. I put it back in where it belonged and started working on its return. It’s a waste of time and money. Peeling off labels and taking it back to UPS store for return, what a trip. I will not recommend this product.",
        "It worked decently but wasn't as quiet as i would have liked it to be. I purchased a table fan that i thought would be louder and its actually quieter on there fastest settings. Didn't fit the window well, it was too bulky on the screen side and wouldn't stay put even with window pushes against it. To top it off , one of blades stopped working after only 3 months. Wont be purchasing again. Just gonna spend a bit more and get a better one this time",
        "I love these fans! I purchased two, one for each of my kids rooms. We do have an AC unit, but for cost savings and noise reduction, I prefer not to use it if possible. These fans work great. They fit well in a standard window that opens either direction. The high speed is a bit noisy, but not terribly disturbing. With these fans on at night, my kids end up covering up with heavy blankets by the middle of the night! I’m definitely purchasing two more.",
        "Purchase this fan November 2019 it’s now September 2020 it just died. the fan is a reasonably good in terms of airflow move and it’s reversible it fits in the window well but obviously the two problems are number one it hasn’t even lasted a year and number two is it was pretty loud",
        "This was a great fan as long as both of the fans were working, but two months in and one of them stopped. It’s a only a month past the rerun date so I’m curious if the company has any warranty at all. Just a note the only way to reverse it is take it out of the window and turn it around. That’s what is meant by manual reverse. Even with that I thought it was awesome while it lasted, but I can’t see having to purchase a fan every other month. I was actually planning on buying another, but have changed my mind. I will update this post with how the company handles this issue.",
        "I bought one of these window fans, it seemed OK, not too powerful but quiet enough. So I got another one, within the next two weeks the first one broke. I returned it. Easy returns. I did not repurchase the returned one. Thankfully because, Then the second one broke, five days after the final return day. Do not buy, cheap, it’s not a fluke that they both broke. I got less than a month use out of each. Very disappointed.",
        "It’s a good cheap fan. Not a fan of how loud it can get at the high setting and the white plastic is a slightly off white color that’s a tad yellow so keep that in mind if you’re looking for a WHITE fan. I do like how it’s no frills and not complicated. 2 speed settings that’s it. Really do wish it pumped more air at quieter volumes though. Perfect if you need white noise to sleep though!!",
        "Love it! Not noisy at all, like a drown out the background noise. No remote so couldnt rate that. Wish there was a way to turn the shutters of the fan so I didnt feel like someone can see right thru it. Over all very satisfying tho. Only been 2 days and I'm about to buy another and escape the outrageous bill of running my ac units all summer long! Great price and good product. Very easy to Install.",
        "Live Saver fans in Southern CA during heat wave where we don't have A/C here near the coast and it got to 91 degrees, indoor temp reached 93 and these fans did a really good job of pulling in the cooler air outside. I bought 3 of these total, for 2 rooms (have 2 in the same room working together). This helped us get through the summer with no AC for sure. These were designed for windows that open vertically so it lays Horizontal, but I used them in windows that slid open Horizontally and this fan actually stands vertical in the Window and still works fine, just make sure you are securely fastening it into the window.",
        "This is perfect. Easy to put in the window, two settings, quiet but still gives off \"white noise\" which is great for sleeping. I love it so much I bought two more for other parts of the house. I like that it isn't digital or fancy - less things to break or malfunction. If I want to push air out of the house, it just isn't a big deal to flip it around. I would rather do that than pay double for a switch to do it for me. It saves me a lot of money because I don't have to turn the a/c on at night as often.",
        "I live in a third floor attic apartment. The windows are irregular so window air conditioners are not an option. I finally bought one of these and put it into my window and it honestly did make such a difference. The apartment is still unbearably hot, but now with some cooler air coming in! Used it all summer in New England with no complaints. Wish I had purchased sooner!",
        "Has good power. However I'm very disappointed that the whole \"reverse feature\" is not accurate. I have a similar one that you can set one blade to exhaust the heat and the other to blow in to cold. The whole reverseable bit on the fan means you have to physically turn the whole fan around. So it's either exhaust or cool. Not both at the same time. I feel like the description is misleading.",
        "Pros: - Relatively quiet. - Rather powerful. - Reversible (bit of a nuisance). Cons: - Sizing: What size of windows do they have in mind? 3 more inches and it would fit a standard 3' window! - Uneven thickness: My window has 1\" groove which fits all but the area with the extension clips. So it drops in on one end and sits on top of the groove on the other. Unless it fits your window as is, you need to be a little handy to design some secured fitting for it. Remember to stop your window tightly against the fan to deter uninvited guests.",
        "Perfect. Needed this for my studio apartment because I can't control the heat and living above the boiler room made my studio super hot. This works wonders. Feels like I have the AC on even on the low setting. Fit in my window but seems like there is still a gap on the side that it won't cover but don't mind. Solved my problem and saves money.",
        "At night I used to put this fan in my window to bring in the cool air so I didn't have to use the air conditioning. I let my neighbor borrow this as their air conditioning wasn't working at all and I never saw it again. I really should buy another one.....",
        "These work better than our air conditioners hands down. There were nights where I had to steal this out of my kids room because it was cool and bring it into mine to use INSTEAD of the window A/C! Cools fast. Also, it's nice that you can reverse it to vent. Works wonderfully for my daughters room (she has a stinky ferret). Only gave 4 stars because you need to turn the fan around in the window to vent. This is kind of annoying and with my daughter wanting to switch from blow to vent often. Other than that it is nice. You can fit it in the window even with the screen in, which I appreciate.",
        "I have had one of these fans for about ten years and it is still working great. I recently moved, so I needed two more so I purchased this exact model of the original one. They are still great. Quality plastic, not cheap junk. It would be great if they were just a bit quieter, but they are not so noisy that they will annoymost people.I don't mind the manual reverse. It's not a big deal. Decent price.",
        "Bought it because of the price($16 I think). Blows air pretty good though it’s loud. It is reversible, but you actually have to manually remove the fan and turn it around. Not a reversible switch or button. But I will be getting another 2-3. It works great for the price and helps pulling in the cold outside air at night when it’s been hot all day and you don’t want to run the central air all day",
        "I bought this in hopes of saving electric by not turning on the AC and using Air from outside. I bought this in 2019 and it's now summer2020 and I doesn't even turn on. I used it for 2 -3months and that was all I got out of it. Such a shame. The Bionaire twin fan that I bought for my children's room STILL works and I bought them at the same time.",
        "I used this twice up north in my cabin and left for the season. When I returned one fan would not work. I would not buy this garbage. Cheat and cheaply made. I read reviews carefully and often discount some one star. Not on this read the one stars and buy another product.",
        "Wonderful fan. Fits most windows 23\" or better in diameter. A little loud but then, I have yet to find a super quiet fan and this one is not that bad. It can either draws out air from inside or blow air from outside in. It does not have a reverse feature so you have to turn the fan around in the window - not a big problem. There are 2 speeds and I usually leave mine on low and it is fine.",
        "After nearly 3 summers of use, this fan is still doing its thing. I wish it could reverse with the flip of a switch. I wish it had a remote controller or timer at least. But it’s likely this fan’s simplicity that makes it so dependable year after year. I like better than the fans I’ve owned that the switches and remotes. I’ve got several of this particular window fan for just under $20 on Amazon, and at that price point, it’s a great deal.",
        "The fan worked great for a few months. Like the adjustable parts to fit most size windows that slide up. But it pooped out completely for some reason I checked the inline fuse in the plug.. Still fine. Somehow the motors just gave up. Bummer Good price for this fan but it is cheap. Also the fan blades are both blowing the same direction. To change air flow from in to out you must remove the fan, spin it 180 degrees and put back in desired window. Dumb.",
        "This fan is better than I expected it to be for $15. Another good thing is, if it doesn't last very long, I'll buy a new one. At 15 bucks you can't go wrong. I have only had it for a week, so I can't review long term life. However, it feels well made, it's super quiet and fit the window perfectly. One side you can adjust the width & there is also a permanent piece that you can attach on the other side. Would def. buy again and recommend. I read some reviews that said only one side had an extender to fit larger windows. That is not true.",
        "Whether you have central AC or no AC and your bathroom this fan is a must I've got mine blowing outwards sucking out all of the bed smells and drawing out the bathroom quickly from all the stain build-up from showers and baths it fits perfectly and most windows and it has an extension piece the fit is amazing how well it sets in there it's pretty quiet even on high we have been able to eliminate any bag smells and keep the humidity down very low",
        "at first i was going to send this back because when it got hot the fan didn't do anything and i'm thinking great me and my dog were super hot. I had printed out the label about to send this sucker back and noticed it had a booklet in the box duh. Once i read it i remembered that I can suck out the hot air, i turned the fan around it sucked out the hot air so fast it was amazing i have left it like that no need to invite the hot air in anymore. my room hasn't been hot sense.",
        "Fan doesn't fit well in the window. It doesn't expand wide enough as my old fan did so there are gaps at each end and it doesn't sit right between the sill and the bottom edge of the window so it's wobbly. The cat can easily dislodge it and make his escape out the window. So I ended up giving it away and buying another. Disappointing. Also, the fan strength, how much air it moves, isn't all that great either.",
        "This product is good, it’s not very loud however it’s a window fan so I do not expect it to be as quiet as a brand new modern ceiling fan. That being said I’m happy with this product it does excellent in pushing inside air are out or pushing outside air in. (This must be done be physically switching the way it faces rather than a simple switch or remote) it does NOT include a remote.",
        "I knew this was not a high quality fan at this price but I expected it to last more than a month. At least it died on the last day I had to return it to Amazon. Had been using it off and on during the night since I got it on May 29th. Last night turned it on like normal and within 10 minutes it just stopped working. No noise, no indication that something was going bad, it just stopped. I don’t tend to write reviews but felt others should know how short a lifespan this item could have.",
        "It's very loud. Even after a year of owning it I often mistake the low setting for being high just because of how loud it is. One of the fans already died after 1 year of moderate use. Purchased Apr 7th, noticed the fan issue April 20th the next year. I've had fans in the past that lasted me 5+ years each time. I would not buy this again. I can't believe I'm only getting a year out of a fan. The only upside is that it's more aesthetically pleasing than most fans.",
        "It's not as good as I thought it would be. The \"high\" setting is not very strong. I purchased three at a time, and the \"low\" setting on one of the fans doesn't work. The perk of this product is that the window can rest on it, however, it does function well in this capacity. The pullout section for the fan (that is supposed to keep bugs out) doesn't work very well on this product. I would not buy this product again.",
        "I was really nervous because the box was horrible and a piece was just thrown in the box but it works not dents or chips or scratches nice breeze the noise level is not to bad. But I also don’t mind the fan noise I sleep with a fan every night. They deff need to work on packaging quality. I work in shipping and it’s not hard. This was lazy but the product works.",
        "It is fairly quiet, and decent construction. But it stopped working after mere a few months of use. I think the safely fuse in the AC plug is blown. However, I cannot find the right fuse for it.",
        "Well it’s a fan but it did not put out as much as I thought it would I put it in the a window that was perfect for its size fit like a glove turned it on first thought hummm seems low check and switch was on high so second thought maybe give a bit of time to cool the room down now the room I put it in is a small kids room so I came back 20 min later and room was still warm I’m disappointed I had high hope for this fan so back on the prowl for a good fan",
        "It was ok until it quit, exactly 25 days after I installed it. I will never buy this model again. $22 and some change for an ugly fan that quits after three weeks is too much IMO.",
        "Seemed like a decent fan at first but after less than only three days' use, one of the two fans inexplicably stopped working. I thought maybe it just needed a \"rest\" so I turned it off for a day and turned it back on again. One side worked normally and the other barely turned again. I had a electrician friend have look at it but there is no problem with the wiring. It's just junk. Can't even return it now since the allowable return date passed before I ever even opened the package after I bought it last year to use this year. Don't waste your money.",
        "Sits nicely in any window. You just flip the fan around to change the flow of air, there is a groove in the bottom so the cord is easily reversible. I'm not bothered that it doesn't come with a reverse switch as the fan is very light weight and easy to flip around. The fans are strong. Noise is average for a fan, it's not specifically designed to be silent, so it sounds like an average fan. I'd buy this fan again.",
        "I do not control the heat in my apartment building and it is often oppressively hot. I wish I'd thought to buy this little fan years ago. There is no remote control and you have to choose between bringing cold air in and venting your air out (by turning the fan around) but this has not been overly burdensome. It does make some noise but it's a small price to pay to be comfortable.",
        "I have vaulted ceilings in my bedroom that trap heat - On a cool summer night my room is still sweltering. I tried all the better looking room fans and nothing really helped except this. I can't say I love the way it looks - but I don't leave it in all the time. It is under my bed when not in use. Installs in seconds. Fits inside my built in window screens. Brings in the cool outdoor air efficiently.",
        "Don't buy this fan, you have to take it out of the window and turn it around if you want to exhaust instead of blow air into the room. Waste of money for $30+ when you can buy one that has a remote and each fan can work independently. Returning. My fault I didn't read all the details, just thought I was buying the same one I had before.",
        "This fan made such a difference in this unusually hot summer we’ve had. It fit perfectly in the window and cooled the entire room. The only not-so-great thing is that it’s pretty loud. However, the cool temperature outweighs the noise. It’s worth having and barely affected the electric bill. Overall, such a must-have, we bought another one.",
        "Maybe the best thing I bought for my apartment! It instantly cools the room and provides a nice breeze. It’s a great supplement to my AC which has a location low to the ground and makes it harder to cool the room. My studio apartment is small and I love that by being in the window, this fan doesn’t take up any precious floor or table space. Only wish the cord was longer.",
        "Contrary to both the picture and the description, the fan is definitely a beige/tan color. I purchased this specifically because the picture looks like a nice white. Instead you get a 90s computer beige color. Otherwise, works fine. Very simple non-nonsense fan. Just wish they didn't advertise false color.",
        "With a $5 Amazon gift card I wanted to use up, this window fan just cost me a little over ten bucks. I knew for that price I was looking at a plastic fan with small blades, but it produces a very nice breeze and is nice and quiet. Lightweight and easy to take on and off the window, I do remove it during the day as the hot sunlight would probably warp it. Nevertheless I am happy with this fan!",
        "These are terrible. There is almost no air flow and they have such little power that they have no effect on the heat in any room we have tried it in. We have tried it in the smallest room in our house, 6X8, and it made no dent and cooled nothing. I wish I would have purchased one, but unfortunately I purchased many and now I’m stuck with electric fans that have no more power than hand fans. I feel ripped off.",
        "I've gone through many window fans so I'm an expert on these. This one is decent, but not quiet. It tends to rattle and vibrate a bit. Not always, but more often than not. When sleeping that can be annoying. Also, a window fan should be able to handle a little weather. Sometimes it rains while you're sleeping and some minor spray might hit the fan. This one has exposed electric bit that maybe will be fine, or maybe will not be fine if sprayed with rain. You can do better.",
        "We love this fan and now have two of them. They do the job as needed and keep things cool, in fact sometimes too cool. The only down side we have is the noise, But then again we have gotten one of those expensive ones that make just as much sound. Can't beat the price, simplicity and how cool this fan makes your room.",
        "Not as powerful or as versatile as the Holmes original which has now gone WAY UP in price. Both fans blow same direction, not one on intake and one on exhaust. No temperature indicator. To exhaust, take the fan out of the window and turn it around. There are controls on both sides, which was slightly thoughtful. (Who'd want to pick up a spinning fan to turn it around and put it back in the window???) Just. meh..",
        "I bought this fan almost a year ago. I really liked the fan. I especially liked that I could turn it around to suck out the hot air. I took it out of storage and was able to use it for a week before it gave out on me. It has a warranty on it but there's no info to contact the seller. I'll be buying another but it won't be this Brand and Model... I couldn't even get 2 seasons out of it before it stopped working.",
        "These fans work great and make a big difference to keep the house cool in the summer. I use them in the summer non-stop to keep the house cool and they work. They have held up several years and they run for more than 12 hours a day non stop. Would highly recommend.",
        "This fits perfectly in my bathroom window which is very small. The fans are very powerful and I love the fact that I can switch it from pulling the air into the room to pulling the air out of the room. There is noise to the fans/motors but nothing more than I expected. If you used two clip-on fans for the same purpose it would have about the same sound.",
        "I live on the Oregon coast and although the temperature doesn’t get crazy hot here, the humidity can be pretty muggy, especially in upstairs bedrooms. I’ve owned many of these fans over the years and not only are they inexpensive, but they work tirelessly for 10-15 years! The best thing is you can bring in fresh air from outside or vent out stale air from inside your home just by turning the fan around in the window. If you have air conditioning in one room, you can circulate the cool air throughout the house by venting air outside ... works like a charm. I have one for every bedroom. I highly recommend this product!",
        "Have been using this brand for windows fans for a few years and this is great piece! They last me at least a few years as long as you clean and properly maintain them. My only issue is that Amazon had this listed as \"White\" in the title but they are actually a slightly gray color but an only gray lol. If you carefully read the description it says \"White or Gray\" so read to make sure you know exactly what color you may be getting. There were no options to choose color either. Otherwise, very happy with purchase!",
        "I gave this product one star for each week that it worked before stopping. I've contacted the manufacturer and will wait to see if they will make good. It's a cheap fan , and i knew it before purchasing. But I have other cheap fans from this company and i have found it reasonable to get two or three summers worth of use before they stop.",
        "The only downside is that you need to pull the fan out of the window to reverse the airflow direction. Previous fan I had the airflow was reversed with a switch. Much more convenient. Not the fault of the manufacturer. I didn't pay close enough attention when I ordered. Other then that I'm pleased with my purchase.",
        "Loving this fan. I have a screen on the outside of my window and I can place it inside, at night to cool down the room. I recommend for use at night, cause you're home(in case of a break in) and the cooler weather outside can cool down your place. I wouldn't use it on a super hot day, cause I wouldn't want the hot air outside, inside my place. I also use this with window locks, to secure the window from being opened on the outside.",
        "I get that this fan is reversible if you turn the fan around. It is true that the controls are available on both sides. But the title says that the fan has reversible blades, and that is simple not true. Only the entire fan is reversible. I hate how you have to dig through reviews to find the truth",
        "Bought it for our kitchen area and it helps a lot sucking out the smoke or cooking smell. When we need fresh air, we just need to flip it and it take outside air in. Compact, easy to put in. Just wish it come with different side cover length option (longer in our case). But it's just a minor thing.",
        "I was skeptical. All my life I just open the windows at night, run a fan next to my bed, and hope for the best. The past week was miserably hot so I bought this thing and gave it a try. It works! How did I live before I had one! We have hot days and cool nights up here, so this is only going to help you out if it’s actually cool at night. I saw the same thing in Target for double the price. So just buy this one. It’s kind of loud, and it’s made of plastic. Who cares.",
        "It makes a little more noise than I would like, but for this price, you can't be too mad. Obviously the noise will bother some more than others. I find that it's a higher pitch than my other window fan, but I'm still able to sleep through it. I've currently had it going for multiple days in a row on either high or low and it's doing just fine. It's \"reversible,\" as in, you can just flip it around."
    ]
}