{
    "entity": "Yogurt Makers",
    "text": [
        "This product did not work for us. My husband had been successfully make yogurt using the oven with light on method for a few weeks when we decided to buy this so we could use our oven for other things again. We tried it 4 times and only got it to make yogurt one time. The other three times, it got way too hot and curdled the milk. We tested the temperature and it often got up to 130 degrees. This is way too hot for yogurt. I don't understand all the wonderful reviews of this product. Maybe we just got a dud?",
        "Even though I received a refund for this yogurt maker I decided to do a review. I had purchased theYM80 and later on the Euro Cuisine LED model. The temperature instead of being 110 degrees it was a constant 130 degrees. When I purchased their LED model, the temperature was also a constant 130 degrees. This high temperature kills all the good bacteria in the yogurt. I return both models. I since then purchased the Cuisinart yogurt maker and it maintains a constant 110 degrees. I would not recommend the Euro Cuisine because of the high temperature.",
        "The description of the item when I purchased it said that there was a \"timer,\" which I interpreted as, you know, a \"timer\" that keeps track of time. No. What that meant, apparently, is that there are numbers 1-12 printed on the side. You have to keep time yourself by other means. The numbers are useless. I also wasn't impressed by the insulation of the plastic lid. Overall, disappointing. I returned this item and filed a complaint for the misleading description with Amazon support.",
        "Got my yogurt maker this week and tried it for the first time yesterday. Followed the instructions exactly, making my yogurt before bed. 8 beautiful hours later, I woke to perfect, creamy and thick jars of yogurt. I used some leftover Stoneyfield Organic Greek yogurt for the starter and Fairlife milk as it was the closest to organic milk that I could find, all of which seemed to be ultra-pasteurized (a no-no according to manual). For a single person...this small size appliance is just the right size. Easy to use. With the Euro Cuisine, no more reading labels....I know what's in my yogurt for the most part :)",
        "After 7 months, it stops working now - milk is still milk or at least it's not yogurt any more. Not sure what's wrong with it. I'm going to as the seller for the warranty service, although they might refuse it like other thousands of sellers on Amazon. Let's see.",
        "This is basically a warmer. It's very simple but accomplishes what I need and I love that's it's not a huge footprint. My last batch I used a 1.5 qt bowl I had. Would love if there was an additional accessory available to go with it like this but thankfully I had one that fit. Definitely check dimensions before purchasing a bowl to use b/c it's a tricky fit. I purchased this b/c I wanted to make a high fat yogurt for keto diet and I'm happy with the 2 batches I made so far.",
        "Loved that it had glass containers but...Temperature control? It only has an on/off switch. There's 1-12 printed on the side, presumably for keeping time but there's no timer or lights or anything connected to them. The jars are curved at top and bottom, too short for a small spatula to fit under the rim. It's basically a heating pad with a lid. As long as I use fresh non-dairy milk and yogurt, follow heating & cooling directions, then it works. The price was low so I guess I got what I paid for :(",
        "We like homemade yogurt but in winters it was very hard to get it consistently and it was sometimes too thin or didn't taste right. This contraption has made it easy. Used it twice a week for a few months now and it delivers. Usually ready in 3-4 hours. Perfect flavor and consistency. I just use 2 tsp of the old yogurt as starter- not as much as mentioned in these instructions. Boil the milk and then cool it to about 50F before adding the starter or you will end up with cottage cheese.",
        "I would buy a one with a timer next time since couple of hours can make a significant difference between yogurt and... sour yogurt. I make a vegan yogurt from cashews and it seems that a sweet spot is around 6 hours. Leaving it overnight makes the yogurt really sour so... I am looking for a timer solution now.",
        "I haven't made homemade yogurt before but I wanted to make something without a lot of additives. My first try didn't work so well (tried adding powdered milk), but I could shake it up in the jars and then drink it like a smoothy. The yogurt I used for starter also didn't have the \"live stuff\" in it and that may have affected it. I ordered some starter, and since then it's turning out great! If I put the heated milk in a cold water bath, it doesn't take very long to reduce the temperature, then add the starter and pop it in the incubator. I add a bit of vanilla and a few drops of Stevia.",
        "I used this for raw goats milk yogurt making. It held the temp consistent and was quiet, safe and easy to use. The glass containers are comfortable to use and clean. The only thing left is for me to perfect the consistency. I’m glad I purchased this item for my probiotic yogurt making needs.",
        "Works well, easy to clean and appears to be well built. Only thing I discovered was a small crack in the dome lid. This looks like a manufacturing fault and could have been noticed if the product was inspected prior to packaging. Since it doesn't effect performance I didn't want to go through the return hassle. If it cracks further then I feel foolish for not returning.",
        "Didn't work at all. I thought I was going to waste half a carton of organic whole milk after nothing happened after 6 hours - the machine wasn't even warm, and the milk was cold. So I checked different options online about what to do, and threw the whole thing into a cooled oven, and presto - I made yogurt without this piece of crap yogurt maker. DON'T BUY THIS YOGURT MAKER.",
        "I like the yogurt maker, it's super easy to use and the yogurt tastes great. My concern is \"a lot\" of condensation forms on the inside lid during the heating process. I have had to very carefully lift the lid straight up and off during the heating process, dry it off and place the lid back on. If I don't wipe it dry it starts to drip into the yogurt. I'm not sure if the machine is running too hot or if this is a natural occurance. The jars are very hot to the touch when the process is finished and the instructions do not address these issues.",
        "I've had an older model yogurt maker for years and, since that one was discontinued, this looked pretty comparable. I heated them both next to each other and my oven thermometer read their temperatures as identical. This one heats up to a good temperature for the yogurt, and I like that the cups included are glass, not plastic,and come with screw lids.",
        "Very disappointed after reading that it had a time indicator. I was visualizing a indicator that showed the amount of hours the yogurt has been cooking. No, just some numbers printed on the outside 1 thru 12 which are nothing more than cosmetic and totally useless. They need to rewrite the description, and remove item “C” time indicator. Your time indicator is you watching your watch until the correct amount of time has elapsed. Just more inferior products from China.",
        "This small yogurt maker has been making great yogurt for us. The unit itself really only holds the yogurt at a steady temp for the time needed, and while there is not an actual timer, it's not really needed since I always process it for 12 hrs. - pretty easy to figure out. This can be used with either the 7 jars with lids or a glass bowl. I have found the individual jars to be better since you can just grab one and go. Using the bowl, the yogurt became watery over a few days. For the price, this is an excellent assist to achieving homemade yogurt.",
        "The yogurt this product makes is the best I have ever been able to make and easiest. I used whole milk as other types of milk (skim milk, 2 percent) take longer to produce yogurt. I also as an option mentioned in the instruction booklet used 10 tablespoons of powdered milk mixed in with the milk to increase the thickness of the yogurt. As per the instructions I kept the 6 ounce glass containers in the unit for 8 hours. Excellent consistency, great taste, and very easy to make.",
        "Pure and fresh. Simply wonderful tasting yogurt. Beyond any packaged-store bought. I was displaced due to covid-19 and got a second one to make it where I am living. It’s that good! I use lactose-free milk and have found the yogurt made with this machine is perfect for my stomach issues. Almost a miracle!",
        "Although the maker is nice and simple and affordable, I'm dropping a star because the included glass jars will crack if you pour a little boiling water over them to sterilize them before making yogurt. I've read this is a good and standard practice... an alternative to running them through a high-temp dishwasher cycle. They do survive the dishwasher, but I like to rinse with boiling water when I'm ready to use them, which can be a week or so after the dishwasher. Clearly they're not a quality of glass that can withstand the temp. change. Just be careful and now you know...",
        "Since I have needed to conform to a dairy-free lifestyle, obviously milk products are out of my life. So I actually bought this to try making my own yogurt out of canned coconut milk instead. The coconut milk varieties found in grocery stores still have too many preservatives and additives. Well success was an easy result. Stay with full fat coconut milk and use the kinds in the cans for the best results. It's so easy to put this stuff on in the morning and then take it off at dinner time. Or some times I start it right before bedtime and it's ready at breakfast.",
        "This is such an easy and useful appliance. I don't even get to put it away. Since the day I got it, I have been making the most delicious home made yogurt!. My only thing, they say to use 42 Oz of milk, I would however advise 45ish if you want to fill the jars all the way.",
        "..I have two of these now. I make a double batch twice a week. I let them go for 12 hours and the soy yogurt that I make is just perfect:-) I have an instapot that is supposed to make yogurt too but I'm getting such great results from this one, I'm sold for life:-)",
        "So this little yogurt maker is pretty neat, but it has some things I would like to see. It does not have any kind of timer, or automatic shut off. So it is up to you to figure out when the yogurt is set and ready to go into the fridge. Also the review asks about temp control. There is none. It's just on or off. It essentially is just an incubator. Makes great yogurt though so I won't knock it points wise.",
        "I bought this for vegan yogurt as didn’t work in instant pot. It is very easy to use and makes perfect vegan yogurt with Eden soy milk and vegan starter from amazon. I’m don’t use the time strip as I know when I want to end. I let it go for 12 hrs. and have had perfect yogurt ever time. Have made yogurt weekly since appliance arrived. Well worth the money.",
        "I’ve been eating yogurt as a snack at night instead of ice cream or something else. I had a yogurt maker in Europe about 40 years ago, but haven’t made my own since. These are simple devices and work well. Even then, I was pretty excited this morning when I went and checked the machine. They all looked perfect! Next, I’m going to make my own granola mix to add to it. I can’t wait to explore all the possibilities.",
        "So easy to use! I purchased this to use with coconut cream/milk as a way to reduce my plastic consumption. I can make 6 containers of organic yogurt for the same price I would pay for 2 commercial containers. And the flavor is, in my opinion, superior. I added fresh berries without even cooking them. The tartness of the yogurt (15 hrs cooking) against the sweetness of the berries was divine!",
        "The package was well packed with clear instructions to use. However, I got fooled by the hour indicator. Took me half and hour to figure out that it's simply markings on the device (no switch, no alarm) . it's the primitive form form of setting time. Have kept my first batch of yogurt for making and hope it turns out right. The jars are cute but manufacturer might want to consider one round glass jar instead of 7. My suggestion- better to buy a hot insulated pot instead of this. It functions more or less the same way PLUS you will save electricity.",
        "Good product but the timer and directions are useless. Overall this is easy to use if you can simplify the directions - here’s what works for us: break open and mix a probiotic capsule into a small grass fed Greek yogurt cup bought from the store (just the milk and live cultures plain yogurt), scoop one spoonful of that into each small container and fill (don’t mix) remaining spaces with grass fed whole milk, put lids on and place into yogurt maker with the cover on - turn on - let it work for 9 hours (use your own timer). Remove and refrigerate overnight. Enjoy!",
        "I used to make my own yogurt 40 years ago and have recently started to make it again. I make plain yogurt and then we flavor it ourselves according to our own likes. Plain yogurt can also be used in place of sour cream in my favorite recipes or even buttermilk in my homemade ranch dressing. The additional perk is keeping those little plastic containers out of the landfill or recycle bin.",
        "Have used this yogurt maker twice now with two different kinds of regular milk, once with Fage yogurt and once with one of the jars. I heated the yogurt and then cooled it. I left it for 10 hours as that is what other people seems to leave theirs for. I haven't tried leaving it for less. The yogurt has turned out great both times. The little jars are good as you can use one at a time and not get all the whey. I hate the whey and pour it off when it collects on store bought yogurt. Going to try goats milk yogurt next.",
        "Hello. Thank you for great product. It works perfect. However, first try were pretty good, but not perfect probably due to fat content milk we used. It would of been much better with atleast half and half, and ideal with cream. But even with milk its pretty great. Yogurt maker itself, jars are all working good. I have no clue why people complain about jars of not proper shape, caps spilling. Bogus. It works great. I would buy again. Device keeps consistent temps, do not vibrate, didnt set place on fire. Made yogurt. We are happy. :)",
        "Makes great yogurt, and great appliance for the price! I use a 7 cup Pyrex glass container instead of the little glass jars most of the time. The one flaw is that the glass jars are handy, but the lids do not seal, and unscrew easily. They are smaller than small mason jars, so I can't trade out the lids. If the jars are just going into the fridge, it's not a problem, but I wouldn't trust them from not opening up for traveling.",
        "I am very pleased with the yogurt maker! It was easy to use and made delicious yogurt! I did not give it five stars because, the instructions are a little confusing on where the timer is, and how to set it. The timer never went off. Except for that, it proves to be a great investment! I went back and ordered more jars! Totally happy!",
        "Grreat product! Terrific results on the first try. Used a Fage 0 percent fat 8 oz for my starter, and organic whole milk ( I prefer this for a richer flavor). I did not use powdered milk and found the thickness perfect. I do not care for Greek yogurt consistency, so was happy with making regular yogurt. 8 hours did the trick for this batch. I did heat the milk before mixing it with the fage yogurt and it did take a bit for it to mix properly. Will try other ideas...addind vanilla bean to the milk might be next. So excited. ..",
        "This is a nice little unit. Unfortunately, it doesn't work. The first one they sent only brought the milk up to 80 degrees. The customer service was great and they sent another one out right away. The second unit didn't function properly either and only got up to 90 degrees. I'll be returning it also.",
        "Excellent product! Follow recipie & you can't go wrong - I suggest organic whole milk and your starter yogurt should be organic, no artificial flavoring, no sugar and lots of live organisms- bring your milk up to temp and immediately cool down. I did buy powdered milk a non-GMO powdered milk you can add 10 tablespoons to make it thicker but I didn't even have to do this and with each batch just use your own yogurt that you make from your first batch for your second batch and third and so on you will never have to buy yogurt again",
        "Great product. It's idiot proof. I had one before. The only gripe I have is with the glassware. The old models had simple, unadorned, boring glass containers. This new product comes with containers slightly curved at the bottom. And that is why I am giving it only 4 stars: Bits and pieces of yogurt tend to get stuck at the bottom and make cleaning unnecessarily a chore. But that bothers you, you can always change the containers. The extender allows you to add larger glass containers.",
        "Darn i wanted to like this! Ive tried it three times and gotten an epic fail! Orange and grey skim forms on top. Took temp when i opened the last batch and its 134 degrees in there! Cooking the starter! Not GOOD! Replacing it with one with temperature control.",
        "I am confused about this product. I do not know why but it takes longer hours than the conventional way of making yoghurt. This aside, my real dissatisfaction is the size of the cups. Although it is written on the product information, I found it very small and not enough for a week if you are making yoghurt for more than one person. For that reason, I use some other cups that I have and put them into this machine to keep it warm and it works. I only wish that this product had bigger cups and make yoghurt in a shorter time.",
        "Using the recipe for fat free milk and non fat milk powder, I was able to make a delicious yogurt. (I used the Yogourmet Yogurt starter from Amazon) I left mine overnight for a total of 10-12 hours and the yogurt was nicely firm. The glass jars are made of a thick glass, seeming more durable than the thin ones from my Salton yogurt maker from the 1970s.",
        "Maybe its just me but idk. I cannot figure this thing out. Everything comes out horrible! The directions are not clear at all. Idk what I'm doing wrong. After a couple months of trying and waisting food, I finally give up! (I've gotten help from people on FB and I still can't get anything right with this thing!)",
        "Seems pricey but when you eat expensive yogurt (1.46/cup) daily, this is a huge savings linger term. I like that I know EXACTLY what is in my breakfast. I can make my own flavors too - even a variety in one batch. Note: I did find I needed to add dried milk to my batch to get it as thick as I like (like skyr) but that isn't difficult.",
        "The yoghurt maker works as described. Prep work is easy and it does heat properly. Only thing is there is no timer at all, which is silly given the requirements of yogurt making includes heating to a certain time or the yogurt will curdle if it goes too long! Otherwise it works",
        "We love this yogurt maker so much, we bought a second one to make double batches. (It was comparable to just buying a second set of jars). We don't like the sugary yogurts in the store and even our kids remind us that we're almost out because they love them so much. We just add a bit of honey for some sweetness and that's all it takes. We actually eat more yogurt now because it is so good. We tried coconut milk once and it didn't turn out with the recipe we found, but that was user error. Whole milk works every time.",
        "Once you follow the instructions well, expect a yummy yoghurt. I experimented with a powder milk base yoghurt and used plain yoghurt as my starter, got good results.",
        "Lid design makes condensation leak on to counters. Temp control too hot for some strains of lactobacilius, hot spot in the middle.",
        "This was so easy. We just scalded whole milk, let it cool down, added in some store-bought yogurt, and then let the machine do it's thing. The yogurt was mild and creamy and delicious. The instructions are clear and easy to follow. And the little jars are a perfect serving size. Because it's so mild, we will be using it to replace sour cream and buttermilk in our cooking. This was fantastic.",
        "What can I say. I have had this yogurt maker 15 days . It has already almost, paid for utself. I love noosa lemon yogurt. Quest what, I make it even better with this yogurt maker. I will be saving almost 400$ a year by making my own!!!👍",
        "Nice little appliance for making single-serving yogurt. I especially love that the little jars are made of glass and so my food doesn't come into contact with toxic plastic. I also got extra jars so I could have one batch going while the other batch is in the fridge.",
        "We got this so that we could make our own yogurt in the Euro Cuisine jars (love them!). This is super simple and basic, but works exactly as it should. It doesn’t have a timer, so you have to remember to time it (or set a wall plug timer). We’ve loved having homemade yogurt and knowing what’s going into our bodies and yogurt (homemade is so much less sweet and has more probiotic). I like it, but you might be able to do something similar with a heating pad if you’re budget tight.",
        "One of those simple gadgets that simplify life 1000%. My family loves home made yogurt and I used ti jump through hoops to make it. Setting an alarm to turn the oven on and off every hour. Until Euro Cuising yogurt maker arrived. Perfect yogurt every time and saves money bu making yogurt at home. Seven little jars is a nice touch and the individual cost of these jars alone exceeds the cost of the unit. Would recommend to any one who likes yogurt with breakfast.",
        "My only complaint is that the center jar (6 outer jars in a circle with 1 in the center) has condensation dripping from the lid because of the shape of the lid drooping down in the center. Because of this, the center jar yogurt will be very runny compared to the outer 6.",
        "I love this. I love you can make your own yogurt with any milk you want. You know exactly what is in this. Coconut yogurt costs like 2 dollars a container you can make it at home for the fraction of the cost and it tastes great. It comes with recipes and instructions how to make. I love the little jars it comes with. You can order more jars and another layer to make more yogaurt in each batch.",
        "Everyone else baked bread-I finally learned to make yogurt! Easy to use, clean. You do need a kitchen thermometer for precise results. I did not use that and all worked well. Only used organic cow milk. No timer or temperature setting on device",
        "I love making yogurt at home and it is such a pain to do so. I tried using my rice cooker and it failed. I made the first batch using this and I actually leave my yogurt in for 14 hours and its so good. Perfect! it was easy to use and the price is reasonable. highly recommend it",
        "I have never made or eaten homemade yogurt until I got this yogurt. I will never buy yogurt again. My husband even eats yogurt now and looks forward to it each day. I bought the attachment to make 14 4oz jars of yogurt each week and it takes longer than the instructions say it will, but that is okay. We still love it.",
        "I’ve used Euro Cuisine yogurt makers for years. After being diagnosed with Crohns Disease at 8 years old my mom put me on the SCD diet which heavily relied on the benefits of natural probiotics in yogurt. In recent years I’ve gotten back into it and holy cow! I forgot how tasty fresh yogurt is! You have so many options to customize to your liking. Add honey or fresh fruit to sweeten and you’re ready to go! Easy machine to just set and walk away. Don’t waste money on an expensive machine.",
        "It's very easy to use, the hardest part is prepping the milk. I only wish there was a beeper and not just the sliding indicator on this model to notify when time is up because my parents, who I got this for, forget over the 8 hours that they are making yogurt. Other than that I think it's great. It saves a lot of money in the long run and it lets you have control over your food since most store-bought yogurt has too much sugar or other additives which takes away from the benefits of eating yogurt in the first place.",
        "This does not work. I’ve tried several different recipes over the course of weeks but it simply does not work. It’s cheaply made and does not maintain adequate temp. Either it produces little to no heat or runs far too hot for the yogurt. I’ll be returning it. I’m convinced 75% of the positive reviews are fake because there’s no way this product actually works for anyone else.",
        "This is an awesome addition to my kitchen. I love being able to add stevia instead of sugar, and tons of blueberries instead of buying store-bought with only a teaspoon of fruit in it.",
        "So far so good! I made a dozen of batches so far and they were all a success. The recipes in the book work well. It would just benefit a little alarm/ timer indicator because I sometimes forget to stop it and store my yogurts🤦‍♀️",
        "The Euro Cuisine YM80 Yogurt Maker is my favorite appliance. It is so simple to use and the glass jars are very durable. I make my mix ( organic whole milk and organic greek yogurt) in the evening and let the machine do the work while I sleep. I've never had a bad batch of yogurt. The appliance is easy to store and no noise! Much healthier and yummier than store bought yogurt. Great base to add protein to your smoothies and diet. Goes great with homemade granola.",
        "Bought this to replace the one I had. My kids had gotten this one for me years ago. I wore it out and had to replace it. Stuck with the same one as it works great. It does not have a timer on it, which is fine. But it does have a time reminder, no alarm. Maybe, some day they will add an alarm or timer. Until then, I will keep making my yogurt with this one.",
        "I own this yogurt maker since 2008 and love it. It gives great results over and over. Sometimes I use Pyrex bowl, instead of jars to make more yogurt. 7 inch bowl fits perfectly in this maker. Recently I bought another one for friend and she loves it too.",
        "Comes with a little recipe book and teh 7 6oz glasses with BPA free screw-lids. Super easy to operate and looks nice and well built (Three year warranty of a low price item speaks for itself). Just to mention it, the \"timer\" is merely a notch on the lid you slide into position. So you remember the time you started the process. No clock or alarm is involved here (not that it matters to me).",
        "My only complaint was, it has numbers printed on the side(I'm assuming to use as a timer?) but no instructions on how to set them. The numbers don't seem to have any function so I'm confused about what they are for? Doesn't really matter though, I just set my own timer and this cute little appliance works wonderfully. Incubates the perfect batch every time! Never over cooked on the bottom like some yogurt makes do. If you want a constant supply of yogurt, I'd suggest purchasing an extra set of jars so you can have some in the fridge while the next batch is incubating. Great price, arrived promptly, well packed.",
        "Used one packet (5 g) Yogourmet Probiotic Yogurt with 4 cups (1 quart) whole organic milk in my new Euro Cuisine YM80 Yogurt Maker. Perfect, and I mean perfect, yogurt the first time around even though I did everything wrong (milk boiled out of pot and slightly scorched, didn't know temperature of milk, no cool-down ice bath for pot of hot milk, mixed packet directly with the heated milk rather than a small portion). Each of the little jars is a perfect portion for one serving. I'm the only one in our household who eats yogurt, so I will only make 1 quart at a time, which fills 5 jars and just a smidge of a 6th jar.",
        "I love this yogurt maker. I tried making yogurt in the past in my slow cooker but gave it up after wasting a whole gallon of expensive milk that went sour. I decided to give it a try one more time using this very affordable yogurt maker. Success on the first try! My yogurt came out thick, creamy, and delicious. I love the glass jars. They are the perfect serving size.",
        "This is a pretty cool machine but the containers are not leak proof and are fairly small, which is a real bummer. One of them fell over in my fridge and leaked everwhere. Its very easy to use, though.",
        "Perfect size. I was successful on my first attempt. I used Yogourmet freeze dried yogurt starter and it’s was a great creamy yogurt. I used in smoothies and fruit salads. You must set a separate timer to keep track of time.",
        "I have made Greek yogurt and regular yogurt in this machine. It does take longer than the 8 hours that it says in the instructions to get the yogurt to set up firm like store bought. The first batch I took out at 8 hours and it was so runny that I had to strain off the liquid which left me with a nice tub of Greek yogurt. The 2nd batch stayed in for 15 hours and it came out perfect. A lovely little machine if you want to make your own yogurt from raw cow's milk like I wanted to for health benefits.",
        "Unlike my old yogurt makers you save the the lids for refrigerator storage: lids not involved during the processing. This produces smooth. creamy yogurt without having to use gelatin which has become ridiculously expensive. Nice on the budgeting the tummy!",
        "This little machine is very easy to operate. The instructions are very clearly written. It makes about 5 3/4 to 6 cups of yogart. It is easy to clean and doesn't take up a lot of space. Great tool!",
        "Wow, we are saving so much money making our own yogurt now! Our kids love the taste and we are at the point now where we do not even sweeten it, we just top the yogurt with fruit and they gobble it up. What I love is that we can get the discounted, soon to expire milk, at half the cost so we really see a big savings overall. Plus, the taste cannot be beat! And, it really is super easy to make.",
        "This is a basic yet effective yoghurt maker. It provides a contained environment at the required heating level. No manual adjustments needed. Took me 5-6 hours to make firm yoghurt (after boiling the milk). The only irritating part was the \"timer\". It took me a little while to figure out that the \"timer\" is neither an auto-shut off nor is it a timer that tells you how much time has elapsed. It's just a string of numbers printed on the body; quite useless and misleading to call it a \"timer\".",
        "Love this appliance. First one came with missing parts but amazon replaced it and I made my first batch and it wss great. Very simple easy to use and best price",
        "I feel like this is a joke. It doesn't turn itself off. It is essentially a hot plate. Use your slow cooker on low for eight hours, at least then you can leave the house.",
        "It arrived promptly. I was not sure if it was going to work. All the reviews asked for powder milk, I could not find it so I used regular whole milk. It is delicious I added some organic honey into the mixture of milk and greek yogurt. I am very happy with the machine.",
        "So far so good. Being the sort who has very little fear of food l mix culture into fresh raw goats milk moments after the milking while it is still nearly body tempature and then put it in the incubator. Sometimes l add fruit and stevia extract. A nice change from that no fat high sugar pasteurized milk yoghurt from the grocery store.",
        "I purchased this yogurt maker years ago. Just noticed I didnt leave a review, so here it is. It is still working great. I make my own homemade yogurt following the SCD or GAPS diet. Not much to say about it. Plug it in and ready to go. Cleans up easy. DOesnt make any loud noises.",
        "The temperature looks like a little bit high. I tried two times. They were all not very good than I expected. And the glasses are too hard to clean. I began to use one 7 oz glass big container.",
        "I have always wanted to make my own yogurt, but I thought a yogurt maker would be too expensive, and making yogurt too time consuming! This yogurt maker is inexpensive, making the yogurt was easy-breezy, and the result was delicious!! The only thing is, there is no timer, so you have to set one yourself. With cell-phones, Alexa, and every other home device available now, this shouldn't be a problem. :-)",
        "My wife and I love yogurt, and not only did this unit make delicious yogurt (better than what you can buy in stores), but it makes it for much less than what you would pay for it from a grocery store.",
        "The bottom came without one rubber foot but it does not create a problem. I noticed that others that have purchased this yogurt maker had the same problem. But it makes up for the little missing part in quality of yogurt. It makes perfect yogurt.",
        "There is no timer on this yogurt maker and the instructions are a little vague, but after lots of trial and error I have worked out a ‘recipe’ that works. Luckily I knew someone who makes her own yogurt who helped me figure it out.",
        "This doesn't have a temperature control but it does well. I haven't used it to make yogurt but it's been great for making infused oils.",
        "I’m so glad I bought this yogurt maker. The little jars and lids make the yogurt an extra treat. I had been making it in my pressure cooker. This is a jiff and easier to make. Effortless",
        "I have been making yogurt every weekend. This is the best investment I could have made. I love yogurt but not all the sugary stuff out there, now I can make delicious yogurt with minimal amounts of sugary.",
        "This product just didn't cut it for me. Too temperamental. It's inexpensive but couldn't do the job. The yogurt separates which is a sign that it got too hot. I replaced it with thewhich is so much easier.",
        "I opted to purchase this inexpensive alternative for my yogurt making needs and was not disappointed. It makes perfect yogurt. At another customers advise, bought the Pyrex Simply Store 7 cup round glass food storage dish and use this in place of jars to make whole quart of yogurt at one time. Works out perfectly.",
        "Works perfectly! What fun I have making homemade yoghurt now. It's a whole new hobby. What's nice too is that one can use a Pyrex 7-cup bowl instead of the individual jars supplied, and get even more yoghurt from one incubation period! Great yoghurt, and so much from a small amount of starter yoghurt. Well worth the money, and the little effort!",
        "I have make whole milk yogurt 2 times one with not heating and one with heat. heating the milk fist does seem to produce a thicker yogurt at the end. I have not tried alternate milks yet.",
        "I bought this to make my own non-dairy yogurt. It works perfectly with the soymilk yogurt I used. I got perfect yogurt in about 6 hours.",
        "We bought this a couple years ago and just got around to reviewing it. Not much to say other than it still works fine after dozens of yogurt batches. We frequently use a large pyrex dish instead of the individual jars, and this works well too.",
        "The jar lids don't seal,they leak everywhere. It hasn't created a batch of yogurt yet, only liquid separation. Hope this helps, too late for my refund.",
        "I bought this because of the price and positive reviews. I was disappointed when I realized that it doesn't have a timer, so I have to put it up either just before i go to bed or first thing in the morning. I am not using the jars because they seem impractical and hard to clean where the sides and bottoms meet. since there aren't special places for the cups, I'm using 1 large container in the unit and it's producing fine yogurt.",
        "So easy to use and I've made my own yogurt for the first time following the instructions that came with the product! Now, I can enjoy my yogurt that does not have too much sugar, or fat, or any preservatives, and it's fresh!",
        "Was looking for convenience over using my crockpot to make yogurt. While it works (although half the time the bottoms are grainy) it was not as convenient as I had hoped so I went back to making yogurt in my crockpot. Also we like greek yogurt so the individual jars are not so useful for that and even when we use the individual jars we like to add fresh fruit or granola and there is not enough room. Yes it works but not useful for us. I see this being in my next yard sale....not worth keeping as I have limited room to store appliances.",
        "It sort of makes yogurt, but only the top inch of each jar firms up, with liquid underneath. So I just use my oven instead and it firms up much better. Perhaps I received a defective item since most reviews are quite positive."
    ]
}