{
    "entity": "Yogurt Makers",
    "text": [
        "I absolutely love my yogurt maker. I have a limited diet and a sensitive stomach so many times I eat yogurt as my dessert. I would always get whole milk yogurt which is absolutely scrumptious but is pricey when you’re eating yogurt with every meal like me. So, I bought this guy, and it is amazing. It’s the best yogurt I’ve ever had and it cost a fourth of what I was spending before. I have to buy the yogurt culture powder from the grocery store for every other batch (I can’t seem to use the cultures from the actual yogurt more than once) but it’s still significantly cheaper and tastes amazing.",
        "This maker is a breeze to use. I do transfer the yogurt to a smaller container to store in the refrigerator. I make one quart at a time using organic whole milk, but will try a reduced fat milk next time and will add, as suggested, powdered skim milk. They conveniently let you know in the directions what amount to use for the type of milk you're using. The yogurt tastes so much better than store bought. Unfortunately, I accidentally dropped the inner container and it broke, so I need to contact the company to get a replacement.",
        "We purchased this unit in Sept 2015 (2nd one, first one lasted a little bit longer) and it is now failing.... at 49 dollars I could almost see my way to buying another one, but not at double the price,$107.... that's a rip off.... we took good care of this and used it once a week... not worth replacing..... be careful, just because it's the most expensive doesn't mean it's the best... far from it... Yogourmet, your product has become junk....",
        "This is a great, reliable yogurt maker. A yogurt maker is helpful to maintain a constant temperature while the yogurt is incubating. I have used this appliance for many years, and there is nothing negative to say about it. I purchased this one for a friend for her birthday, as she has been talking about learning to make yogurt. Both of my sisters use this appliance, and they love it. This yogurt maker will make up to 2 quarts at a time. That is so much less trouble than using the appliances that make small jars. I would highly recommend this appliance to anybody who wants to make yogurt for household use.",
        "I've made a couple batches of yogurt with this product so far and each of them has turned out excellent. Consistent results were a challenge using the 'lights on in the oven' method. But the yogourmet has made that a cinch!",
        "I was staying with a friend and she had this Yogourmet Yogurt Maker and had just made some fresh yogart. I am very picky about my yogart. I didn't expect to like it. I LOVED IT. It had to be the best yogart I've ever eaten. I purchased this yogart maker right away and made my first batch. The instructions it came with were scanty so I asked my friend and she shared detailed instructions on making perfect yogart. I have made two batches and they are excellent. I would just recommend that the manufacturer, or whoever is selling it, please put more detailed instructions in with the yogurt maker.",
        "I like that this is Specific Carbohydrate Diet (SCD)-friendly. It comes with everything you need to make yogurt besides the milk, starter, and gelatin. It's small, so it doesn't take up much space when it comes time to store it. It is also very easy to clean. The toughest part is getting the inner container into the bigger one when there is water in it without spilling everywhere.",
        "This yogurt maker had poor temperature control. It caused many yogurt fails. I wound up returning it because I was so dissatisfied with its performance.",
        "Perfectly works the way described. Used it first time last week for 2 quart of while milk. Got perfect solid yogurt with the yogourmet starter. Used Nedo milk powder as well 2 spoons. The lid of the inside container is amazingly tight and perfect for the purpose. I dont have to transfer into another container, it just fits right in my refrigerator... What I dont like is the lack of timer... It would have been added plus to have auto off for the device or a timer to adjust the time off. Or a digital stop watch. Thus four star or else I would have given 5 stars. Nevertheless device is worth every penny. Love it.",
        "This is a very good product. We used a 2 quart glass honey jar we had which fit perfect. It looks just like the one sold on Amazon. My wife makes the best yogurt with it. There was a bit of a learning curve at first, like getting the soy milk up to he right temp and also the water bath. Not so hard to do though, just a few minutes of work. Makes yogurt in about 4 to 6 hours and fairly thick at that. Haven't done Greek yogurt yet, maybe someday.",
        "I used to have an oven with the pilot light always lit, but have since moved, and did not have that luxury. Went hunting, on line, and decided this may be the ticket. I have really enjoyed this one. I have left the yogurt in longer that directed, and still stays perfect, until you get to it. Love the one large, 2 qt. container, and is a breeze to clean. Have only made vanilla, but oh, so good. I do add the powder coffee creamer, and use 1% fat milk. I have been making yogurt for years, thanks to my Amish friends, who passed on the recipe.",
        "yes, overpriced, however I would not play around with a cheaper version while growing live bacteria. Using it is not as cumbersome for as it would seem, for SCD I suggest googling the videos available, it shows the steps fairly simply. I do recommend the glass jar, it helps prepare a batch and I keep the plastic container only for storing the yogurt on the fridge, that way I don't run out.",
        "Used it twice and both times it did not heat to the degree that was necessary to make yogurt, it's only function. I probably needed to return it, but never did, as I was in the middle of replacing many household items due to a disaster, SO now I guess I have to find out how to recycle it.",
        "Love this yogurt maker!!! I have been making the 24hour yogurt in it for almost a year now and it has come out perfectly every single time! Super easy to use and I highly recommend!",
        "Home made yogurt is by far the best and this is one of the easiest makers I've found. The only drawback is that it's completely manual meaning no automatic shut off or temp control. Been using it for years just bought one as a birthday gift.",
        "I tried and tried to get this wonderful machine to make yogurt using Fage for starter. Fage is my favorite. After reading the reviews again I realize that when using yogurt for starter you need to cook for 12 hours to get a good, thick yogurt. I tried someone else's recommendation to use Mountain High plain full fat yogurt, and that has worked and tasted good. I heat the milk to 185 degrees, cooled it to 110 degrees and added the yogurt and didn't stir too much. Perfection. I'll try that Yogourmet starter when I only have about 6 hours to cook.",
        "It is easy to use and makes great homemade, healthy yogurt. But one time when I put the container into the heating shell it slipped and dropped only 2 inches into the heating unit and it cracked the plastic. So now it is unusable cause when I put water into the bath it leaks down into the heating element area? Too mush risk of electrocution! Not something I want to mess around with. It was not a far drop and as far as I'm concerned should not have cracked the base unit!",
        "I love it. Makes yogurt making easy. The thermometer is difficult to read, though, so I use a digital.",
        "Twice I ordered this yogurt maker, and twice I received only the base and a warranty card. No yogurt container, no lids, no cheese cloth, and no instruction manual. I've returned both, and I won't be ordering it a third time. I just don't get it.",
        "Works great, and I love the yogurt that comes out. Wish it had a timer for the price point, and also a glass inside container, as I try to avoid heating food in plastic containers. Overall I am happy and would buy again.",
        "I already have this same model of yogurt maker. In fact, it is the one my mother bought in the seventies that I am still using a lot. I needed a second one for our cottage, so I didn't hesitate to buy the exact same model (even though it is more pricy compare to other brands on the market) because I know I can rely on this yogurt maker. In the good old days it came with a glass inner container, but this plastic one works fine. And the yogurt is as good !",
        "Works great. Absolutely no problems whatsoever. We have made around 40qts of yogurt with this and every batch has turned out well. Some better than others but that is our fault not the machines. I chose it because you can make 2qts at time with it. Cleans easily. If yogurt is prepared correctly this will make 2qts in about four hours. No issues with the canister being hard to remove like some of the other reviews state. You just have to be carefully. It's just a very simple no frills machine that works.",
        "When we used to make yogurt in a warm place in the house, we could take some of the yogurt and use it as a starter for the next batch. No matter how many times we try with this, the yogurt that we make does not do anything to the milk if we try to use some of it as starter. What that tells me is that sometime along the process, this gets hot enough to kill the good bacteria. Very disappointing.",
        "Fantastic product. We've been struggling for long to make good yogurt at home with a patchy rate of success. Sometimes creamy, sometimes runny, sometimes lumpy. Then we got the Yogourmet Electric Yogurt Maker and presto. First try, we had creamy, delicious tasting yogurt. We did leave it in for 6 hours, rather than the suggested 4.5-5 hours, but it was kinda liquidy. So, we let it sit on the kitchen counter overnight and refrigerated it the next morning, which allowed it to firm up nicely. We are very pleased with this product and would recommend it to anyone who wants to make fresh, creamy, delicious (no preservatives added) yogurt at home.",
        "I purchased this February 23, 2015 and used it a few times and it made great yogurt. However, I just made some last night and went to check on iit and found it leaking around where the cord is at on the bottom of the unit. Since it's only covered by a 1 year warranty, now own a defective unit that is not safe to use.",
        "I wanted to love this. We eat a LOT of yogurt. I first purchased this: [...] And it worked AWESOME! One time. Then it died. I sent it back and got this one. And I have made four or five batches in this thing,first letting it cook for 4 hours, last night I let it cook for 8 - SAME consistency. RUNNY! I used their yogurt starter, I used powdered milk, I used gelatin, I used brand name yogurt for a starter. I have tried everything. The yogurt comes out like Kefir, which is great for smoothies, etc. but how do I make it firm up? Can anyone help?",
        "I incubate yogurt for 24 hrs to remove lactose. This fit that requirement perfectly. Note: If you consume a lot of yogurt for health reasons, order an extra inner container.",
        "I use it to make 24 hour yogurt, and I've been very happy with this product. It's very simple to use, easy to clean, and it comes with a very convenient thermometer. If you take the yogurt canister out and put it right in the fridge it's very difficult to open since it creates a vacuum as it cools off. I recommend opening it and either covering it with a cloth or plastic wrap, or transferring it to another container before putting it in the fridge.",
        "Wow this is the easiest yougurt maker ever. I like the fact it’s one unit with one container to make either 1or 2 quarts, depending on how much you want to make. I made my first batch with lactose free organic whole milk and it came out great!",
        "Nice to make a large batch. The inner cap needs to be warmed up with hot water to snap on, then the seal is excellent.",
        "I really thought that this would be too time consuming to use but it's really easy. The only time consuming part is cooking the milk and waiting for it to cool. When using the Yogourmet Maker be sure to check the temp of the water inside from time to time. If it gets too hot just take the the top off a bit or all together. If your house it too warm then the yogurt maker will probably run a bit warm too. I like to make mine over night when the temp is a bit cooler and more even. Enjoy!",
        "Makes fantastic yogurt! It's a little pricey at first, but it'll easily save you in the long run. It's improved our digestive systems and we both feel better overall. We love it!",
        "A friend told me how easy it was to make great yogurt with this machine. She was absolutely correct and I'm now a convert to home-made yogurt. It takes the guess work out of incubating the cultures. Would definitely recommend!",
        "Love that this unit makes two quarts of yogurt. It is simple to use and easy to store.",
        "I love this yogurt maker. It is reliable and well made. It makes a full 2 quarts of yogurt easily using the container, thermometer included with the yogurt maker. The instructions are clear , easy to understand, and will get the user on the way to making good, healthy yogurt with only the ingredients that you want in it--no hidden extras. The product works as stated, consistently. No bells and whistles-just does exactly what it is supposed to do. Love it and recommend it, without hesitation.",
        "I have made yogurt for 40 years; but, I decided to try this machine. So far, I have not been able to make a successful batch of yogurt or kefir with the enclosed brand of starter packets. I will try other brands of starter in this machine to see how they work. So far, I do not know if it is the machine, its regulatory heat system, or the starter packets.",
        "I bought it as a gift for my sister when she visited and love the yogurt I was making using this product. It seems kinda pricey for such a simple product, but it does turn out great yogurt.",
        "I don't know if this yogurt make work. I order it and I received it. Seems a valid product BUT it cannot be use in Italy!!!! There was not any indication of it. I try it and it started to burn. After I discovered that is not compatible with European plugs!!!! Even with adapter! The yogurt make work only with 110 V. This should be clearified in the caratteristic of the product. I order it from Italy, I spend a lot money for custom etc...and I have nothing. Noe I discovered that Ican use it with a transformer. This means I payed it, in the end 3 times is worth.",
        "I purchased this item less than a year ago. Used it 6x and now it won’t heat up. At 54.00 For 6 uses that really expensive yoghurt",
        "Purchased this to try making my own yogurt at home and I love it. I think the yogurt tastes so much better than store bought. It is a little more tart, but I love mixing it with all different types of fruit and creating my own flavors. I also love making new smoothie flavors frequently for my family. The Yogourmet is easy to use and very cost efficient. I would recommend.",
        "It works great! I just wish I didn't have to buy the pricey (yet marginal quality) glass jar, as I wouldn't even think of using a plastic container (such as the one that comes with this yogurt maker).",
        "Absolutely love this yogurt maker! Made yogurt 8 times, and it delicious!",
        "As I was warming my milk I couldn't figure out why it wouldn't heat above 120... causing me to slowly keep turning up the heat... and scalding the milk..... Finally AFTER I decided I was about to give up because the milk wouldn't get hot enough, I put my own personal meat thermometer in and it said 180!! The thermometer is WRONG! And no, I wasn't looking at the celcius numbers, I was looking at the farenheit numbers. GR! Will see how well the yogurt maker works.",
        "We have really enjoyed making our coconut milk yogurt in this. Purchased a Libby glass jar for the yogurt to sit in while in the maker. We've made several batches without fail. Works like a charm and would def. buy again.",
        "This is a product that is fool proof. Both the brand name starter as well as store bought container yogurt starters work well. I am still in the experimental stage and the process is so easy. The unit keeps the culture at the right temperature and so far all the batches have turned out well. The only reservation I have is when taking the jar out.... be very careful. The lid loosens because of the pressure and the only way to grab the jar is by grasping the sides with your fingers otherwise... major spill (yes, it happened to me). I highly recommend this unit because of the ease and maintenance free operation",
        "Works great...lasts about 3 years and need to purchase new... works great while it lasts... this was our third purchase!!",
        "Like another customer - this worked great when I first got it but after a couple years of use water penetrated the base and leaked from the light and cord (very dangerous)! The appliance was never submerged in water, so it has to be poor base construction! Stay away!",
        "I never made yogurt before, but this product makes it so easy, now I do it all the time. I love making the large batches, instead of having a bunch of little jars to deal with. I make the SCD style yogurt, but it would be equally satisfactory for any type yogurt. This is saving me a lot of money and it makes excellent yogurt - as good as any I've bought in the store.",
        "This yogurt maker is incredibly easy to use, and turns out great yogurt. The yogurt I have made so far, however, has been very soft and soupy, but I have not added powdered milk to thicken it as the directions say. It also comes with a thermometer, very cool, although my thermometer must have gotten wet because not all the numbers are displaying correctly now. Just follow the directions and you'll get great results! A tip: if you don't want to buy expensive yogurt starter, just go get a $.69 cup of yogurt from the market and use it as a starter. Just make sure it uses \"active cultures\" or you won't get no yogurt. 5 Stars!",
        "Love this yogurt maker. Easy to use and clean. Yogurt is fantastic!",
        "This yogurt maker was recommended from my niece. I have made 2 quarts and love the yogurt and feel we are eating more quality yogurt. The maker is easy to use and a quality product.",
        "This has been a life saver. Makes great SCD yogurt, easy to clean. Happy as can be with this product",
        "simple design to make up to 2 qts of yogurt. Instructions are easy to follow.",
        "My family have used this yogurt maker for the past 4 years and I just recently got one for myself. It works fantastically as expected. Since I always use the CBA yogurt starter, I use the following recipe instead of the one provided in the instructions: 1. Boil about one container (5/8 of a gallon) of organic whole milk to 180F/82C. 2. Cool off to 22-25C. 3. Stir 2/3 bag of CBA yogurt starter into milk and place it in the yogurt maker for 11 hours. It takes about 30 minutes to get the milk ready to the right temperature. The yogurt always comes out with the consistent texture.",
        "Great Yogurt maker...Seems to be in constant use at my house..Home made yogurt is so much better and healthier than store bought..We eat yogurt 2-3 times a day now that I make it...I can't keep up with the demand...we love it...This Yogourmet makes it real easy to do...very straight forward & does the job...We leave our yogurt maker on for 24 hours before refrigerating so we get maximum beneficial bacteria production..Enjoy!!",
        "this is by far the largest yogurt maker I have purchased. One of the problems is that it overheats. Poorly designed that way. They insert a paper in the box telling you to turn your air conditioner on to help it not overheat and keep the temperature in the zone. Ha ha, what kind of nuttiness is that!",
        "This is a great, easy-to-use yogurt maker. You can't go wrong for the price! You MUST buy the dimmer switch with it, so you can adjust the temperature throughout the incubation process. Room temperature in the house is always changing depending on the weather/season, so you absolutely need the dimmer. It comes with a thermometer. I ferment my yogurt for 24 hours as I am following the Specific Carb Diet (SCD), so I am checking the temperature often and adjusting the temperture as needed.",
        "I am so happy I purchased this Yogurt maker. I have been making yogurt for years in all sorts of ways. Coolers, heating pads warm oven....This is just so compact and easy! Not to mention the tub goes straight to the fridge, so convenient. This came with everything I needed except of course the milk and starter. Just a great product that will get lots of use.",
        "My wife and I have been making yogurt at home for several years and really enjoy it. The one drawback has been making it in 6 small cups at a time. We finally decided to try this 2-quart maker and see if it is as good. It's Better, this machine makes great yogurt and we do not have to use it everyday like our old on(we gave that away). We tried the cotton sack a few days ago and now I'm hooked, the yogurt is thick and creamy.",
        "I love this yogurt maker for making fresh homemade yogurt. However, I have had some issues with it's durability - this is the 3rd maker I have owned in 3 years and my previous two eventually develop cracks in the bottom of the container after weekly use. It's a bit pricey considering its durability, but I have not found a better product yet to replace it with.",
        "Great product, which makes yogurt making really easy! For those of you that complain about the yogurt getting too hot, you can just add a potentiometer to control how hot you want it to be. You can also go to Home Depot and buy Credenza 300 watt plug-in lamp dimmer, and set it at 50% output and you will no longer have a problem. In addition to that, I bought 2 half a gallon jars from Walmart for $5 each, I like a glass container bettet and it's easier to clean it. I am really satisfied with the product!",
        "The machine can't hold the temperature within the desired area of 38-42 degree C on it's own for making SCD yogurt (24-48 hours) - I have to use a timer to turn the machine on and off repeatedly throughout the day. And the lid of the inner container tends to come off, when you lift the inner container into the outer container, resulting in a lot of spilled fluid if you aren't very carefull. Being a customer from Denmark, it would have been nice, if I had been warned, that I needed a power converter - but that's kind of my own fault :-) Those power converters are just very hard to come by in Denmark for some reason.",
        "This machine doesn't heat up the yogurt or cool down so you need to boil the milk on your own and cool it down. The machine only keeps the milk warm during the fermentation process. I wanted a machine which takes care of the whole process so I returned this product. But if you want a machine to keep the milk warm, I think this product does the job well.",
        "I've been using this brand of yogurt maker for nearly 20 years. Works great. I'm still using the original and I bought a 2nd one so I can have 2 batches going at the same time. A glass container would be nice, but otherwise perfect.",
        "We love this - we make probiotic yoghurt and strain it 24 hours for really thick Greek-style yoghurt.",
        "I LOVE my Yogourmet yogurt maker!! I use it on a weekly basis and it's so easy that I can pretty much do it in my sleep. The larger container is better for me since I make so much of it due to being on the SCD diet. I can't say enough about it. If you're thinking of getting one, don't hesitate.",
        "The yogurt produced by the Yogourmet electric yogurt maker is creamy, thick, and delicious--far better than the yogurt produced by the other yogurt makers we've tried and better than store bought. It's also a relief not to have to deal with all those little jars filling up the dishwasher.",
        "So happy I purchased the Yogourmet electric yogurt maker and glass jar.......one of the wisest purchases I have made...perfect yogurt every time..so easy to use and keep clean....",
        "Makes very good yogurt. However, after using just once hairline cracks developed in the bottom of the container. The next time I used it the water leaked out all over the counter. A very cheap product that costs too much. I would not recommend this product to anyone.",
        "Best yogurt maker - don't forget to buy glass jars that fit in this machine. Bought a second one for my son. Great gift idea for health conscious friends and family.",
        "Makes great yogurt but if you already have a dehydrator then it is not necessary. I will be selling mine! You can get glass jars to online through Lucy's Kitchen Shop to replace the plastic inner container.",
        "This yogurt maker consistently heated the yogurt 120-123 degrees, which was too hot for the yogurt I was making. Possibly not the product's fault, but it didn't work for me.",
        "This machine makes perfect yogurt. While the product info strongly suggests using their starter, I used plain yogurt with excellent results. The thermometer included is marked with the best cool down range, an important step. The container fits into the machine and when done is a storage container for the yogurt. I would recommend this product to any cook who wants to make yogurt. It takes a little time and watching temperatures but well worth it. Taste is superior to commercial yogurt and can be made with any milk.",
        "Very pleased with this yogurt maker. It does what it says. Haven't had a poor batch since I started using this product. Easy to use, and clean up is a cinch . It makes perfect yogurt in about 4 hours.....any longer and it becomes more tart. Personal taste determines how long you need to incubate the yogurt. Adding a small quantity of powdered milk makes it very creamy.",
        "Easy to use. Used to make yogurt with it every few days, no problems whatsoever. Made to last.",
        "I love his machine! I follow the SCD diet plan and making your own yogurt. It works perfect!",
        "My daughter loves this! It was on her wedding registry but I got it early as her graduation gift since she doesn't like the \"typical\" gifts. I've been using a dehydrator to make yogurt but maybe I'll get one of these, the version with a timer (if there is one).",
        "I put off for years buying a yogurt maker. This was on lightening deal so I figured why not. It's awesome and super easy! I used regular greek yogurt instead of the powder starter and it turned out great. I've made two batches so far. First batch didn't even last a week in our house.",
        "Took me a while to get the recipe right but once I did, it made some very good yogurt! Quite happy with it. Delivery wasn't completed in a timely way BUT the guy I ordered it from called me pretty quickly & refunded my shipping charge. Very happy they have that level of customer service.",
        "It only worked once and leaked on the second try. Would like to return for a refund. Please advise how.",
        "Just started the \"Specific Carbohydrate Diet\" and this is the machine that is recommended by many people on the diet. Performs exactly like everyone says, and making my own yogurt is EASY and cost effective! Love it!",
        "The product is well constructed of good quality plastic and is simple but works well. The thermometer is too small to easily read (for an older person). Unfortunately the heating element died in mine after one week of use. I'm returning it and will update the review after the replacement arrives.",
        "I would like to give it 10 stars.Perfect creamy yoghurt every time. I've tried making yoghurt with all kinds of milk.Trust me, homemade yoghurt taste so much better than the store bought one. It comes with a jar, thermometer and a cheese cloth bag.I also bought an extra jar so that I don't have to wait for the first batch to get over. Highly recommend this yoghurt maker.",
        "I love it. It is easy to use and clean. The yogourt is very good and creamy",
        "I bought this yogurt maker to make 24 hour yogurt. The first batch got too warm, after 3 hours it was up to 115 degrees already. I bought a dimmer switch at Lowes and was able to keep my next batch around 103-106 for the full 24 hours. The yogurt comes out great, and is very simple to make! Definitely recommend.",
        "I got one for my daughter because I like mine so much. It's easy to use, the yogurt is delicious, and it saves me a LOT of money. It was shipped and arrived quickly and in good shape. Terrific product. I've probably saved the cost already just making my own yogurt instead of buying it at the store.",
        "This 2 quart yogurt maker is everything my research said it was. The most impressive thing is the firm texture. With the 2 quart size each family member gets the portion size they want to have. I made the yogurt cheese and used it in a cheese cake, It was delicious. I wish I would have purchased a second container when I bought the machine.",
        "I bought this yogurt maker because it allows a larger batch than others on the market. The first few batches have worked tremendously well. I also like the inclusion of the \"bag\" which allows separation of the whey. Very nice product",
        "I wanted it to make yogurt and cheese from Goats milk. It works nice. It would better if the inner jar had an edge on the lid that made it easier to pick up out of the water. It makes yogurt very well and is hands free no need to watch it. Just plug it in wait 4 hours and it is ready. I am still practicing. on some adjusted recipes and I am going to try some cheeses just waiting for starter and rennet. This is the best yogurt, I eat it just as it comes out of the yogourmet",
        "I've using this product for more than a month. I bought this yogurt maker because it also came with the thermometer and the cloth for straining (which I don't use). I find the machine very useful and I've been enjoying home made soy yogurt ever since. The price is right and super easy to clean. The thermometer seals the deal for me because I'm new to this whole soy yogurt deal and this the temp point for incubation marked on it. I love it and will recommend it.",
        "It makes really good yogurt. We add powdered milk to it and keep 1 cup of yogurt as our starter for the next batch. If you like real plain greek yogurt this is great. If you don't, we found that adding jam sweetens it enough for us.",
        "I was so pleased to find a 2qt yogurt maker. I have made perfect yogurt every time and can hardly keep up with friends demands for more! more! The kit included a thermometer which I think is essential to determine which step you are at. Highly recommended.",
        "I followed the directions in booklet which are very minimal, but sufficient. After checking online, I learned that adding 1/2 cup of dry milk to milk before boiling and instead of using a \"starter kit\", I used 5 Tablespoons of Stoneyfield Farm plain yogurt that has six live cultures in it(mixed with a little cooled milk then added to rest of milk). I let it incubate for 5 hours and it was nice and thick. Would be nice it they included a few recipes.",
        "I have goats and Jersey cows so I go through a LOT of milk. I use this for yogurt and sour cream, and it does a great job. I like that I can make 2 qts at a time and flavor my servings the way I want. The containers are also great for ice cream.",
        "Gift for daughter - she loves it - yogurt good tasting and nutritious and not difficult to make once you get the hang of it.",
        "I have bought several yogurt makers. This is the best to make soy yogurt. Soy yogurt tends to be a little watery, but with this yogurt maker is a little thicker. I am very happy with this purchase.",
        "I like it very much. Ive tried to rigg up a waterbath system myself, but it is so much trouble. This works fine so far.",
        "I recently purchased this unit and am very pleased with the product. We use soy milk (make sure there is nothing but soy and water in the soymilk) and a 1 quart glass canning jar (filling with 3.5 cups of soy milk) and have been very pleased with the yogurt we get. Nice and creamy and good tasting. Very easy to use!",
        "Makes great yogurt, just gotta stay on the timer or you'll get overcooked yogurt.",
        "Make sure you buy a dimmer switch if making SCD yogurt. It will overheat and ruin the bacteria if not."
    ]
}