{
    "entity": "Safety Work Gloves",
    "text": [
        "30 bucks for something with no quality control it would seem. got a pair of gloves that seem to have been made at two separate factories at two different times and then paired together to be shipped out. two different colored velcro straps. two slightly different sku#'s. i paid for a new pair but now i'm not sure if that's what i got. it looks like a couple of returns were picked put of a bin and paired together.",
        "Was excited about getting some decent work gloves for cold weather. Unfortunately these were not the gloves I was hoping they’d be, I put my hands in them once, took them out & the liners on the inside of the gloves gave that annoying bit where you can no longer put the glove on completely. Like the liners were not attached.",
        "I have a 4yr old pair of these that I love. I use them in the colder months for yardwork and snowblower/snow shoveling. I bought a new pair in anticipation of my old pair wearing out. The new pair is too small - same size as old, but doesn’t fit. My 7yr old son wore them outside for about 10 minutes while playing in the snow and they got soaked inside. So much for waterproof. My old pair does a much better job at keeping the moisture out. In short, product quality has degraded significantly.",
        "Its been more than month since i received my Gloves from Youngstown , i was very skeptical as i have bought over the years so many different brands and every one of those either had tears in fabric in just a week or weren't waterproof as advertised, this gloves are heavy Duty , in -30F freezer my hands stay warm and water melting ice or condensation never goes thru first layer, its usually gets wet from outside but my hands are 99% dry from inside, you wont be able to pick up screws or small objects with this gloves as fingers are extremly large because of all that insulation but as warm waterproof heavy duty gloves this ones are amazing",
        "I used them today in a mild snowstorm to shuttle shopping carts around and after a few hours they were completely drenched with water and got to the point that they became really heavy with so much absorbed water that I had to take them off and ring them out! I am not joking. These are the exact opposite of waterproof, it’s almost like they’re made of sponge material that absorbs water. I am very disappointed.",
        "Horrible gloves. The internal liner pulls out when you take your hand out. Forget about putting these on when your hands are slightly wet, which they tend to be when you're working in the rain or snow.",
        "These are rugged, tough, and comfortable gloves. I bought them for a winter mountain trip in Utah in 13 degree weather, coupled with hand warmers they kept my hand warm while maintaining a reasonable amount of movement in my hands. My hands never got wet while I was moving through the snow, and I didn’t go easy on them during the five days I was in the Wasatch mountains. I highly recommend these gloves.",
        "These are perfect gloves for winter chores, both warm and waterproof. Cold from snow and water does not get in, at all. Construction is high quality. They look and feel as if they will last. Stitching is uniform and even. The insulation is Thinsulate. In addition to snow shoveling, I plan to use these gloves for outdoor endurance events in wet and cold weather. The fit is true to size. The liners in the pair I received stay put.",
        "I have had a pair of these gloves for almost fives years. I live on a small homestead and use these gloves to get firewood, break up ice and pull it out of water troughs, repair fencing, etc. They are only now starting to show enough signs of wear that I am purchasing a new pair. However, they are still completely functional and retain their waterproof lining. The only downside is that they are not windproof and do not keep my hands very warm. They work well as long as the wind is minimal.",
        "I bought these because I live and work in NC it's pretty cold in the mornings. Plus my hands get wet these are neither waterproof or warm. They say the warmth is subjective. It depends on body temperature and activity. I was cleaning stalls today I think that's a pretty active thing so my body temperature was probably above normal. It was 28° which is an average morning here at the ranch. My hands were so cold my fingers hurt! When I was rinsing bowls they didn't even get all the way wet my fingers were soaked and frozen. These are not as described at all.",
        "Work great so far. A bit annoying to get on and off cuz of the 3 separate layers. But have lightly used for a 3 months pressure washing and have yet to put a hole in them. And your hands stay mostly dry even when the outside is soaked and you can bring water out of them. Keep hands just warm enough, but in 35 degrees and wet, ur hands will still get cold even if they aren't actually wet in the inside.",
        "These gloves are warm but once water gets in through the wrist, they take a while to dry out. They are perfect for working in just snow, but I used them during a bad snow/rain storm. They get waterlogged very quickly and its tough to tell where the water gets in. But Youngstown is a great brand!",
        "I work outdoors in all weather conditions for 8 hours everyday. These gloves are not waterproof and they ripped within the first week of using them, They are not work gloves that can withstand carpentry.",
        "I've received compliments on these. They are warm and I haven't gotten wet hands yet working on a water truck. Note: don't jam your hands in these type,or any other gloves, you could puncture the waterproof lining. Careful. ( This warning should be on manufacturer list for all waterproof gloves).",
        "The gloves are good quality and warm for the $25 or so price paid. Much better than the poor quality gloves you see at the check-out stands for not much less. Regarding size, I typically wear Medium but ordered Large because others had said that the gloves run small. These are slightly long at the fingers and across the palm, but I probably wouldn't want to drop to a Medium since too large is better than too small, in my view. So my experience is similar to others--these seem to run just a hair smaller than standard sizing.",
        "The gloves are decently warm and very durable. I normally blow through the home depot gloves in a few weeks and these have held up for 3 months. The Velcro holds up, the lining is warm. I will purchase again when these finally break",
        "I like the glove, it seems like it will last a long time. But I've worn it this winter in very cold, below zero weather (in Minnesota) and it does not live up to the hype. Zero degrees and up its OK but I bought them hoping to use them in below zero weather",
        "These are not waterproof at all. They are water resistant for a few minutes, maybe an hour or two under light conditions. They are very absorbent. The water that was on the outside of the glove is quickly pulled to the inside of the glove and then it is thoroughly soaked and hard to get dry without actually just putting them in the dryer. They have liners that are loose and very difficult to get your hands in which make them difficult to take on and off. The glove only made it a few days at work and now reside in a box in my closet.",
        "Fingers way too short, lining bunches up in the tips, it's like a form of torture....you can almost, but not quite get in there....very frustrating. Like a bad highschool date. No satisfaction, but looks the part on the outside.",
        "Very Durable and definitely water proof, I live in Australia and it's almost impossible to find gloves of this quality and thickness. I've been wearing them for about 5 months now and the only time my hands get wet is when they sweat. They have shown very little signs of wear and I've used them for shovelling, with machinery and mulching so they have seen their fair share of dirt. The only problem with these gloves (and it's not really an issue) is that when your hands start sweating they get very damp inside and develop a rather pungent smell, but this is easily fixed by throwing them through the washer machine.",
        "These seem to be good gloves, but they fit me a little tight. I am 6'6\" tall and thin, have large hands, but not particularly thick fingers. However, these gloves squeeze my fingers (though the fingers seem to be long enough which is a rarity for me). I've worn them a couple of times while motorcycling and they feel warm. They are too bulky to use for mechanical working gloves. I will probably give them to my 15 year old son to wear, or else just wear them on very cold days.",
        "These gloves are truly waterproof. I used them to clean gutters while there was still some ice in the gutters. My hands stayed reasonably warm and completely dry. The gloves still look good so I think these gloves will last.",
        "They are ok honestly I am disappointed that I bought them for work because I drive a forklift in a freezer so my fingers got freezing cold with the gloves my company gave me I bought these and for some reason I am not sure why but an abnormally large amount of moisture stays in them so if I do not dry them every once in a while my hand will literally develop ice crystals from the moisture residing in the glove which make my hands even colder than the other pair I had its a hit or miss with these.",
        "OK you're reading the right review. I haul chickens for a living. I've had these gloves for about 3 weeks now... If you have a job where there will be a lot of friction on the palm, I advise against these. The reason is, the palm has all the tiny thread showing and it did not take much friction to fray those completely away. Now the extra padded protection is coming off and one of the fingers has opened up showing the waterproofing layer/ thin rubber... This is my only issue, and its huge. They were great before the thread started to slowly disintegrate. Now they are becoming junk gloves. For $30, I expected better.",
        "It is very nice to have this in winter time ... saved my hands many times ... i worked on my truck in freezing weather and i was able to get stuff done in freezing weather...",
        "Returned. XXL IS ONLY A XL. I am a glove nut with dozens of gloves for wet, cold, sensitivity, safety, etc. This mislabeled \"XXL\" fit just like every other XL glove I have. I had ordered an XXL to leave room for a thin insert inside the glove.",
        "These gloves are perfect for anyone who works outside during the winter. They are warm and waterproof. Never has my husband had a problem with his hands getting wet. It is easy to work with these gloves on, they are not stiff to where you cannot move your fingers. They run a little big so I would suggest buying a size smaller than you would normally wear.",
        "I needed a waterproof work glove, I'm a tow truck driver so I work in any weather. I bought these hoping at a minimum they would stay dry inside. They are nowhere near waterproof, at all. They have this stupid fleece liner that pulls out with your hand every time and makes putting them back on impossible. After only 2 weeks they got many cuts and holes so the material seems to suck. Also I wear xl gloves and xl gloves always fit nice. These were good around my hand but the fingers were too long making it so I couldn't feel anything. Buy at your own risk.",
        "I have to work on machinery in all types of environments that may be covered from oil to hydraulic fluid. I usually wear a large Mechanix glove. I purchased this glove in the large size and found it to be almost to tight. After the first use, I will probably go back to Mechanix and deal with cold fingers as the non-slip surface isn't made for any type of wet surface. Mechanix gloves have a porous slip resistant grip area while these gloves have an almost gortex-like gripping surface. Not what I want in a work glove.",
        "Bought these as a Christmas gift. When my brother (who normally wears a size large glove) tried them on, they were much too small. I then tried them on and they fit me perfectly (other than the fingers being way too long) and I wear a womens medium glove. I returned them for an XL and those were perfect. I don't yet know how they are out in the weather. UPDATE - Just heard from my sister-in-law. She said my brother put them on and went out to plow. They were completely soaked through just connecting the plow to the truck.",
        "Love these gloves! I use them to shovel snow (we're talking over a foot of snow at a time) and it's now my second winter with them. My hands stay warm and bone dry. They show no signs of wear. I debate about wearing them out as my regular cold day gloves, but figured it would be over kill.",
        "I bought these gloves based on the title of the product and the description, but when I received these all bets were off. The liner is not breathable, so your hands start to sweat. The \"winter plus\" is a joke. I used these(or tried to at least) at work in the freezer for moving boxes and such. My fingers will never forgive me after they became extremely cold to the point I had to switch gloves. The \"waterproof\" is well, I guess good, but as I said earlier, when your hands start to sweat, does it really matter any more? I will be returning these and looking elsewhere. Don't make the same assumption I did and believe the title.",
        "I love these gloves. Bought them a size too small a long time ago, but actually following the sizing chart, the Large is the perfect size. Great customer service. I had a slight problem with one glove and they sent me a new pair. That said, the sizing on the two pairs of Larges were slightly different....the replacement was a little bigger, which actually felt better. Amazing construction. Definitely water proof and very warm (I use them for winter cycling around the city and I bike everyday) Would recommend them....and I have!",
        "Bought these for my husband and they lasted him the entire season, he does construction but needs to have lightweight gloves for he can feel what he’s doing, while keeping his hands warm in the colder weather.",
        "Ran across the Youngstown brand about 15 years ago, I won't use anything else. I've dealt with the company when I had an issue, very nice people who went above and beyond to you ensure customer satisfaction.",
        "This is my second pair of these. They are awesome for camping, snow shoveling, and yard work. They are very water resistant. Your hands may get a little sweaty as they are fairly impermeable.",
        "Really disappointed in these my hands were numb in a matter of minutes not waterproof and cut my hand like an ice cube. Maybe I had a defective pair I don’t know but I’m not trying another one that’s for sure",
        "Seem like good work gloves, but sizing is weird. Not sure where they were made, but the fingers are long and real skinny. I got a medium, and can barely get them on -- but still have a half inch left on each finger. 2 years later - just threw them away. Probably the worst pair of gloves I EVER bought !!! They fit like ----. and they have already worn a hole in the finger. I couldn't have used them more than a 1/2 dozen times. So tight they cut off my circulation - and INFERIOR materials. Just buy some good insulated leather work gloves - more comfortable, and will last longer.",
        "Good glove with very good insulation for outdoor winter activities. The rubber (palm side) of the glove is also very grippy and is durable. However, the fabric interior starts to deform after getting wet - which is troublesome for a \"waterproof\" glove. Once this happens the glove becomes very tough to put on and requires some interior maneuvering of the fingers in order to fit properly. Not a huge issue but enough to knock down the total stars for this review.",
        "The glove is padded heavy enough to be warm. It passed the submersion test. I bought it in case of a cold rain on a hiking trip. I’ll update if there is any new information.",
        "I bought these to work in a freezer section when doing store resets, but after just a few minutes the cold temperature made them so stiff I couldn't move my fingers. Took them off and never wore them again.",
        "I used these while i was a fed ex driver these gloves tore right away and were only good for about of week, only was picking up packages and leaving them at peoples doors.",
        "Fits like a glove! Pun totally intended there. I bought these gloves for working in the freezer at my work. They're super warm and are truly waterproof. Any other gloves would get wet and freezing after touching a couple frosty boxes in the freezer at my work.",
        "I purchased these gloves six years ago and they have totally served their purpose. In South Louisiana we do not have a very long winter, so most of the time I keep these in my garage for getting something out of or reorganizing my upright freezer... they're perfect. Not too bulky and my fingers don't freeze handling frozen food. In the winter, I will use them for outdoor chores (cutting firewood, picking up fallen branches in the yard, etc) or bike riding (bicycle; I have specialized gloves for my motorbike). After six years of mostly wintertime usage, they are still in good shape.",
        "An odd amount of material at the end of the fingers makes them clumsy when trying to pick anything up. Every time I take my hand out the liner pulls out with it and it's a pain to put back in. Once my hands are wet from snow or even a little sweaty these are impossible to put on.",
        "This is my second pair (my first pair had to be retired to my being a dumb*** and grabbing stuff out of a fire). These are the warmest, toughest, waterproof gloves I’ve ever owned.",
        "My BF wore these on a husky sledding trip in the snow in Norway however the gloves got wet and his hands got cold. He took them off because of this and was then without gloves. Disappointed; I had high hopes.",
        "Bought these gloves for spring skiing - to help fend off both cutting ice and slushy snow, keep my hands warm and dry, but lend enough dexterity that I could adjust bindings without taking the gloves off. Also I wanted them to not hold in so much heat that I'd have to peal them off to cool down on the lift. Turned out they weren't waterproof. Not sure why they're described as waterproof but they sure aren't. And they're not particularly warm. Once they were wet the wind cut right through and my hands got definitively cold with an external temp of about 30 F. Dexterity is good, toughness is good, waterproofiness and warmth are bad.",
        "Gloves do not breath well. Inner lining should be stitched down so it does not bunch up inside. These gloves look and feel nice, but for $30 they need some major improvement.",
        "I have used these three times while on the tractor plowing snow. Each time, they kept my hands warm, but they were soaking wet by the end, and it wasn't from sweat.",
        "These gloves are nice and seem like they'd keep you warm. But I returned mine -- my hands usually fit an \"XL\" glove -- but I bought the 2XL size, which seemed like it was an \"L\" in reality. UNDERSIZED! Youngstown -- why not invest an extra square inch of material and make these gloves come out the correct size? I respectfully disagree with the reviewer who said the gloves are suitable for long fingers. I have long fingers. And there's about a half inch of \"webbing\" between the fingers, and the same between thumb and forefinger.",
        "these gloves fit tight for the medium size I got...difficult to get on and off without pulling the inner liner out...PITA to get it back in...they didn't break in at all, after 20+ hours cutting and carrying firewood...",
        "I bought these gloves because they were supposedly on the top 10 for warmest gloves. Don't by them for warmth, 5 minutes out loading trucks outside in temps in the teens and i damn near had frost bite in my fingers. These are warm weather gloves only as far as im concerned... they might be useful when working indoors with your hands in a fire tho.",
        "Very warm, water proof gloves. Would not use for demolition work where you can rip them. Bit too bulky to work picking up small stuff.",
        "i read about these on kk cooltools; thought they'd be great, but: i used the guide for deciding which size to get: the guide indicated a M, but i couldn't even get my hands into them, so i got a L, which i can wear, but are too snug to use any kind of liner glove. wish i would have got an XL instead. i haven't tested the waterproof-ness of these, so i can't write to that. they are NOT very warm; wish i could supplement them with a liner. they are very stiff gloves and haven't loosened up at all in a month of wear. i'll keep looking for a better winter glove...",
        "I work in a freezer for a living at a Pie Factory. The freezer is cold. Yes I know that's hard to understand. During the summer its usualy 0°-10°. & during the winter it's around -10°-0°. These gloves make that sooo much more barable. Especialy in my case because I'm a techie & program / type fast. So my fingers are a little extra on the sensitive side. They're not compleatly water proof, but definitly resistant. My only real complaint is that if & I stress \"IF\" the glove goes inside out, which it does eventualy you'll find it hard to get the pink finger back into place becasue of the linning.",
        "Nice quality gloves. Maybe I should have bought a bigger size than my usual because it was tight. If you aren't working in the cold your hands will get warm and sweat. Also don't expect to be able to pick up small things or parts because I couldn't move my fingers as much as I would have like to. I didn't dip my hand in water with the gloves on but didn't notice any water going in the gloves.",
        "Very good gloves, wish I was able to keep them but unfortunately they were not touch screen friendly and I work outside with a touchscreen device so I had to take them back, bummer",
        "I originally purchased them on 10/6/2010. **Although these can be used for a number of outdoor activities (Work/Play), I used them for riding my bicycle in the winter. **They kept my hands warm and dry. It took me over three years to find gloves that kept my hands BOTH warm and dry. ** They are very durable and the original gloves I purchased looked as if they were still new. I my opinion, these are the best gloves ever! However, after a day of riding, I lost them--I was very fortuate that the exact same model was still available over two-years after my original purchased.",
        "These gloves are warm, but the inner lining comes out when you pull your hand out. Lining won't go back in place when you put your hand back in the gloves. It takes a punch or a rod to push the lining back in place, especially the little finger. This is the hardest place to get the lining back where it is supposed to be. Don' waste your money on these gloves.",
        "I originally purchased the gloves for myself but found them to be too stiff and too long for my fingers. The size of the glove fit my hand but the fingers were about an inch too long. So I gave them to my son for Christmas. He rides his bike to work, so I thought he could use them. He seemed to like them, although the fingers were a little too long for him as well, but not as long as they were on me. That's the reason for the 4 stars. Otherwise, I think they would work ok. We didn't test the waterproof quality, so I can't evaluate that.",
        "In my never-ending search for waterproof winter gloves that can be used on the farm, these FAILED. First I tried divers gloves...fail. Then these. The third time I dunked my hand in a bucket of water the pointer finger filled with water on the left and the middle finger filled with water on the right. By the time I was done filling water bottles for little critters my hands were soaking wet and freezing cold. I guess I need to try those camouflaged duck hunter gloves that look huge and bulky. Maybe they will at least do what the description says - keep my hands dry! I am calling the manufacturer of these Youngstown \"waterproof\" gloves today!",
        "Just got these. Loose/long in the pinky and ring finger. Insulation keeps your fingers from comfortably repacking end of glove. Loose fingertips = accidents at work. Will update after a week of wear installing windows in PNW. Not impressed thus far with claims of being a “work” glove.",
        "I expected these to be a warmer glove but they are very sturdy and well made. Order a size up.",
        "These gloves are well constructed, warm, and most importantly, truly waterproof. Though it doesn't affect their quality, they do run a little small on the sizing. A large size glove is usually comfortably snug, so I first ordered a XL size but found it was too snug to easily get on and off. I then ordered an XXL and it is a perfect fit for my L hands. The extra ordering isn't too critical for us as my wife now has a good fitting pair of \"Winter Plus Performance\" gloves and can enjoy the same comfort I do when she helps with the firewood gathering.",
        "Just used these gloves this week for the first time and they passed with flying colors. I was working on a construction site on the ocean in northern new England. The temps ran from single digits in the morning to the teens by lunch time. We were in a ditch - outside installing underground piping. I mention this as the conditions were extreme and the gloves worked very well. They are pricey, so we will save them for the real cold days, but they allowed us to work under very difficult conditions.",
        "This is my second pair. The first ones were amazing. This pair not as much. They are super warm and waterproof which is great. This pair is super stiff and the fingers are too long",
        "These gloves are well constructed, warm, and most importantly, truly waterproof. Though it doesn't affect the quality, they run a little small on the sizing. A large size glove is usually comfortably snug for me, so I ordered a XL size, only to find it was too snug to easily get on and off. I ended up ordering an XXL and it is a perfect fit for my L hands. Not too critical for us, as now my wife has a good fitting pair of \"Winter Plus Performance\" gloves and can enjoy the same comfort I do when she helps with the firewood gathering.",
        "Warm, durable, waterproof... Everything they claim to be. Bought them for my guy who works outside on the airport runway at 4am. He says they are perfect.",
        "great gloves, warm but not too much like some winter gloves can be. There is a thin layer that provides the warmth, makes the gloves feel more sturdy, though it does take a second longer to get your hand comfortably situated in the gloves. I have had these on the jobsite for 3 winters with no fraying or cuts in them, intend to use them in the upcoming winter too. a great buy all around",
        "I use this gloves for motorcycle ridding. They work great for rain and relatively cold ridding. They are a little thick as any waterproof glove, so dexterity is pretty much lost, but you don't really need fine motor skills to drive. I live in a tropical country where it rains for a good 8 months of the year and I tell you this gloves CAN take a storm. Only downside is you won't be able to use them the next day. Would definitely recommend for bike ridding.",
        "Keeps water out, but after a few times wearing. The inside of the gloves comes loose. Hard to put back on, not worth it.",
        "In short, they fit well, are flexible enough to use power tools, and do keep your hands very warm in the winter. Still my favorite work gloves and I have bought at least 5 or 6 different types. If you use them a lot you will have to replace them maybe once a year, but well worth it. One thing I did notice though is they are not washable in the washer /dryer.... they will turn inside out and good luck getting the fingers back in and having them fit comfortably. But again, due to quality, I am still giving these 5 stars.",
        "Keep in mind the warmest gloves group your fingers together to help retain heat. With that said, since you may want individual fingers to increase your desterity (range of motion) the manufacturers of these gloves had to increase the thickness of the lining on the inside. A little practice with these and I am up and running. They are pretty warm, I was in 15 degree weather for approx 6 hours and had no problems.",
        "Absolutely love these gloves!!! I work outdoors and here in N California we've had a very wet month. I've tried about 15 pairs of gloves for work over the years and none have worked out like these. It was pouring last night and the gloves worked like a charm. My hands stayed completely dry and warm. The outside of the gloves were soaked but never seeped into the glove. Absolutely worth the money!",
        "The gloves are well made and look sturdy. I bought the gloves for snow shoveling, I was outside today doing some yard work and in a span of about 20 minutes my hands were frozen. The temperature outside in New Jersey was about 25 degrees F.",
        "This gloves are awesome! Extremely good deal! When I seen how cheap these were I was a little bit skeptical but they work great. I bought these for my dad and he loves them. He works in a shipping freezer all day so he needs gloves that keep his hands warm, keep water out and won't tear or stretch out. He has gone through so many gloved but he's had these for a couple months now and they still look perfect.",
        "The gloves work really well overall. They are as waterproof as I need them to be. They're not as warm as super thick gloves or mittens, but hey, they're gloves! My only complaint is that they are sized a little small. Even after measuring my hand, I ordered a medium and I kind of wished I ordered a large. They kind of fit, but they are really tight. I'm still hoping they stretch out a little. I'm using them for motorcycle gloves and are happy with their feel and performance as such.",
        "I am in North Dakota. These claim wind/waterproof. Soon as I got them I took em out on the patio for wind and cold weather test. One cigarette and my hands were getting cold already. Not even going to try em at work. Might be ok in the spring. But I won’t know til then. Lol",
        "I expected the correct size for $48, They were size small or X-Small. I gave them to a friend with very small hands and they didn't fit her either. there was no return shipping information in the package so I could not send them back and gave them to an even smaller person who could wear them. Very Very disappointed for the price.",
        "Outdoor work and hiking. these gloves are awesome!! Kept me warm and dry all day long while working in the snow.",
        "These gloves are exactly what I wanted: a nice light-duty winter glove. I spent 2 hours on a 20 degree day shoveling my driveway and building a snowman with my daughter. My hands stayed warm and dry. Edit: On a warmer day, the liner of these gloves gets very sticky if your hands sweat. When I removed the gloves the liner pulled out, and I had a hard time putting the gloves back on. Still happy with these for colder weather, but I won't use them on a warm day again.",
        "Fit great. Run a little small I think but breaking them in makes for a good fit. Still easy to work in while being insulated.",
        "Well, I got defective with a huge hole in the left glove and they are not waterproof and my hands freeze. DO NOT BUY THIS. They are new outside but inside they are garbage",
        "These fit well and I like how they are water resistant. Yes, I said resistant when they are labeled water proof. It is not often but on occsion they have been wet from slush. When I am in the snow they never get wet, cold, but not wet. I would not take these skiing or temperatues below 0° F(-17.8° celsius). I would buy them again but not for snow ball fights as they are not as good a keeping your hands warm as other gloves.",
        "These gloves were perfect for my husband's job. Working in an area that gets a great deal of rain, these gloves have come in handy as he spends most of his time outdoors. The grip on them is perfect, and the inside stays warm and dry so he doesn't have to think about them all day. These are a great buy for anyone who works outdoors.",
        "I was very eager to wear these, once revived and tried to push my hands, but could not help it. I ordered the small size based on the product page description, but I could not slip me hand completely in. A returned and ordered medium this time, thanks to Amazon. After trying very hard on medium size, I was still not able to move my fingers and could not band my palm at all. I have returned back this size too. I wish I could have use it, though like the quality of material used.",
        "Purchased as a gift for a farmer and laborer. He loves them.",
        "Great for cold weather. You do lose dexterity though since it's not a 'close to skin' type glove. For general outdoor chores when cold it really is a great product.",
        "These gloves were intended to keep my hands warm and dry as I did morning barn chores. Activities typically include handling and throwing hay, operating the snaps on gate chains, snaps on horse blankets and halters, and removing ice from troughs. I had a lot of difficulty with the snaps, and often had to remove the gloves. My fingers were also cold, even though my chores last about 15 minutes! They kept my hands dry when I fished ice out of the troughs, but it accelerated the feeling of cold in my fingers. They kept my hands warm when it was about 40 to 50 degrees, and they were fine for handling large items like boxes and stuff.",
        "Solid, really durable. They're super stiff at first but they soften up a bit. Handling wet rope and snow with them, my hands have never gotten wet. They're not the warmest gloves, but they do okay.",
        "I tried three different sizes of these gloves, L, XL and XXL. I couldn't even get the large on, and they were even too tight even for my girlfriend's fairly small hands. The XL were still too tight around my palms even though the fingers were very long. The XXL finally fit around my palms and were OK for my finger's girth but were so long that I could barely use them. I'm not sure what proportions a person needs to have to fit these gloves. They seem to be meant for someone with small palms, and skinny, very long fingers.",
        "They are sturdy but not as warm as I was hoping. The grips make them a good glove for outdoor work. I am using them as my main gloves for work now and so far they handle getting wet very well. I would probably been better finding a XL pair they are quite snug on my hands. I noramly wear a large. I do like them for quality style and features. fit and insulation are my only quips.",
        "not as warm as I'd like while actually working pruning in winter in Michigan, but they are super warm otherwise, walking around. super durable. when I helped my mom with her xmas tree I washed them like I was just washing my hands to get the sap off, thinking, \"they did say they were waterproof.\" They did not leak through to my hands, though they did feel like they got soaked in the layers on the outside. I wrung them out and hung dried them and they're still fine! Yay!",
        "I splurged and bought these, nearly $30 gloves thinking that they would keep my hands warm and be nibble enough to handle a rifle on my very first hunting trip in northern Arizona...well, lets put it this way, I wore those little cheap, stretchy - one size fits all gloves and they were way warmer. I even tried pre-heating them by placing them on the defroster in the jeep but to no avail. Sorry, but I think I keep them only because I feel guilty returning them because they have elk blood on them but they don't work at all.",
        "These clubs or not waterproof I repeat NOT WATERPROOF they also aren’t very warm I live in MN and these couldn’t even keep my hands warm in 40 degree weather they will also charge you a 20% restocking fee if you wish to return them",
        "I usually get an xl in any type glove but theses gloves are really undersized and once I could get the glove They were super tight and stiff I can’t see any way to work with these glove",
        "Decent gloves, used size chart came on the small side.",
        "These gloves are warm enough and seem pretty wind and water proof so far. The palms seem tough but the backside fabric not so much. Things that should be improved are the that the liners are loose and when you pull your hands out; the liners pull out too making it hard to put the gloves back on without some work readjusting. Also the finger tips have extra fabric on the tips making it really hard to work on anything small; I had to remove them when hanging Christmas light hooks and adjusting the volume on a car stereo can even be tricky. I always wear an XL glove and the XL in this case fits me well.",
        "Small was the perfect size for my hand and to make sure the small was the correct size, I used the recommendation the company suggested I use for measuring my hand width. The glove feels good on my hands and the movement is easy while keeping my hands warm."
    ]
}