{
    "entity": "Safety Work Gloves",
    "text": [
        "If you want durability, these gloves are NOT for you. Please look at the attached picture of the gloves after 3 months of light use. Big holes appear at the finger tips. I only use them for about 15 hours a week. Nothing serious, just holding nails/screws, putting cable ties on, etc. I guess it is related to the material at the finger tips which is like spandex.",
        "These are a different design than the same model glove i bought a year or two ago. The first thing i noticed is these are thicker in many parts, which exactly negates the reason i bought these gloves in the first place. I also have other more protective Mechanix and those are good for those jobs. I really wanted the same high dexterity low profile glove, but that doesn't appear to exist anymore. Also, after only a few uses some stitching is already becoming loose.",
        "We have been buying these gloves for several years. The last two orders that we received had all of the same markings, etc. but the material has changed. Used to be able to wash and reuse these gloves several times but the material is now so cheap that I go through a pair about every day. The gloves are more cheaply made but the price is the same. I have attached pictures of brand new glove that I wore for approximately 10 minutes. Shut the hood of a card and the material ripped.",
        "Unlike all the other gloves I have tried I keep coming back to these. They fit well, are comfortable enough to wear all day, easy to get on and off, not sized in weird proportions, have excellent dexterity, and the touch screen perfance is excellent. I just wish they would last longer. They are very robust in construction. However, after use in dirtier job environments (like handling corroded steel) the touch screen feature starts to suffer. I find that after 9 months to a year of steady use they are worn out and need to be replaced. 'Not really that bad and after trying other brands nothing else is worth buying.",
        "This is the second pair I have purchased. Not because the first are worn out, but because I like them that much. I started using them for general homeowner projects and maintenance. Raking, mowing, weed trimming, they are actually better than regular work gloves. Fingers fit in switch loops, you can manipulate cords and buttons. Palms grip most materials without being overly bulky. Probably not what you would want for daily construction work, but for most peoples purposes these work really well. For the price of $10 they are way better than the cheap ones from the hardware store. Oh, and they're still good for working on cars.",
        "I am a hobbiest so I can't rate them for professional daily use, but these are great gloves. These are actually my second pair because I wore my first ones out. It actually took me a while to find this particular pair because I just wanted the pull-on instead of the velcro strap. They are very comfortable and I feel very well protected. My concern was with the big branding all over the top of the gloves and it doesn't bother me as much as I thought it might. I will buy these again when I wear them out.",
        "All around great work gloves for light to moderate material handling but I get the feeling they wouldn't do too well handling abrasive surfaces regularly - stitching seems to be holding up everywhere and the fit is solid and true to size For touch screens I've had to resort to using more the pad of my finger than the tip because of where the seam is located so unlocking a phone to take pictures or pressing a few buttons is fine but I doubt I could stand typing out a longer text message - touch screen capability is a luxury in my opinion and overall these are fine for my purposes",
        "I put these on for the first time to do some simple hammer & nail work in my garage. They are very comfortable and the fit was just right for my hands. I order the XL, and based on the size chart, it was the right fit. After an hour or so of some nailing work, I noticed the finger tips were starting to wear down. I still have plenty of use to get out of them, but I was surprised that they had worn this much with just one use. They are comfortable, and for the price, it's a good buy, but just don't expect them to last long if you're going to be doing any handy work.",
        "So I normally purchase this brand of work glove. Works well to protect and also helps in the cold to keeps hands somewhat warm. Only had the gloves for a couple of months and use a handful of times, not everyday. As shown in the pictures the palm part of the glove does not hold up at all. If looking for a durable glove look to a different material. These do not seem to hold up long at all.",
        "I can't even get through 10 days of usage on these without holes appearing. Absolute garbage will not buy again as a package handler my hands are constantly grabbing boxes and these can't hold up at all and are horrible quality. I regret buying these awful gloves. Oh well ten days of use comes out to 1 dollar a day of usage but these can't handle actual work. I don’t recommend these gloves to anyone as these can not handle a real working job. I can not believe the fingers ripped within less than two weeks of usage. Don't waste your money and buy something else as there is no quality to these gloves.",
        "Unlike many cheap gloves, these are comfortable riding gloves for biking. Most work gloves have seams and fabric layers that bunch up when holding the grips while riding, but not these. The Mechanix Wear FastFit are comfortable and durable for riding. I've run them through the washing machine 2 or 3 times as well, and gone on ~20 rides and they are still as good as new. They are a bit warmer than typical summer-weight mountain biking gloves, so not the best choice for hot days, but I find them pretty comfy for temperatures from low 50s to upper 60s.",
        "I bought the gloves two years ago but only really used them over the past couple of weeks, to clear foliage in my yard. Pretty light duty work...pulling vines, holding weed trees while I sawed the branches, stuff like that. As you can see from the picture, the fabric wore away. They are comfortable and do work well with phone screens. But, as work gloves? Not good.",
        "If I could give these 4 1/2 stars I would. They're comfortable,they work with rock screens and they're fairly durable. This is my third pair, having work holes in the other two. Those both lasted about 8-10 months. Of course, I'm not expecting them to last forever but I'm also not a mechanic by trade. I just turn wrenches on my own vehicles and as a hobby. I figure these would last a professional mechanic only 4 or 5 months. But, I do like them and I'll keep buying them as I wear them out.",
        "I purchased a pair of these at Auto Zone and \"thought\" I loved them. I ordered 3 more pair from Amazon. Within 2 weeks the middle finger on the left hand blew out. Same happened wit all 4 pair. Amazon replaced the 3 pair and within 4 months 6 of seven pair were destroyed. I handle packages all day. Nothing rough. I only use that middle finger on my left hand when driving occasionally and it's the one that ripped on all 6 pair. I'm starting on my 7th pair Monday and expect the same. Six pair destroyed in 16 weeks. I'm looking for a better product. Very disappointed as they fit so well.",
        "I've been looking for a durable glove that can go through the wash and feels good on the hand. I decided on this model. The color is wonderful, it has a nice fit, it washes well so far - but it's thin with no palm padding at all. It is not as good as the $9 pair I got in the grocery store. If the price were lower on these. say $10, I'd give them five stars. Disappointed. UPDATE: I've been using these now for quite a while and they hold up after lots of use and repeated washings - so I am upping my score. For the money, these are a good deal!",
        "I keep a pair in my truck, in the family car, the garage, the basement, two pair at work, and a few pairs with my tactical gear. Do I love these gloves, yeah I do. I have been using tactical/mechanics gloves for about 2 decades now. I think I have tried most on the market. These are the most comfortable. I have a few other really cool ones from Mechanics Gloves, but at the price point, these are what I regularly buy. When comfort and dexterity count, count on Mechanics Gloves.",
        "I've tried many brands and styles of mechanic's gloves and have settled on this style of glove for ease of use. I often need to remove the glove to do some work with my bare hand and then put the glove back on. These elastic wrist gloves make it easy to do that compared to other gloves that have a velco strap at the wrist. The addition of touch screen capability allows me to use my phone without having to remove the glove.",
        "I’ve owned several different brands of mechanic’s gloves but I always end up back with Mechanix. Great fit and can still start nuts and bolts without having to take them off every 5 seconds. Works well with my iPhone and iPad but the finger pads are a bit large to effectively type a quick text, but work perfect for jumping to the next track in my playlist when a song comes on that makes me hate my job.",
        "These are the best driving gloves I've found. Tough, great fit and most importantly, terric feel. I can tie my shoes wearing these. And when they get messy I drop them in the washer. I drive 60 hours a week in a gig that also includes plenty of machinery handling and as soon as the temperature drops below 40 these go in my work bag and never stray far. No touch screen ability but that's ok for me.",
        "Bought 2 pairs. First pair, I got a small amount of CLR on the fingers, which then bled out a huge amount of black dye onto my hands that took days to remove and gave me some light chem burns. Fair enough, they don't handle chemicals well at all. Second pair I've kept away from any liquid or chemicals, they're still slowly transferring black dye onto my hands. The material is also wearing noticeably thin in several places after maybe 10 hours of light automotive use. Very weak. Recommend going with a different glove, I've never had these issues with any other brand",
        "These are NOT \"Work Gloves\", unless your work is painting or something else that you don't need to protect your hands from. The fake leather offers no more protection than cloth. They fit fine, but can't be used for gardening or any rugged work where your hands take a beating. I ended up with so many splinters, it would have been the same had I worn no gloves at all.",
        "I have many pairs of these gloves and they are my go to for pretty much everything in and outside of the house. Good grip, keeps sweaty hands for losing grip on tools, thin enough for fine work like wood working, thick enough for working on hot engines. Have a pair in the glove box of all my cars plus a few more at the house.",
        "I got these to replace my lost work gloves. My shooting gloves (also Mechanix) got pressed into service as my work gloves. These new gloves have good enough tactile sensation to serve both jobs. They just pretty darned good all-around gloves. When I wear them out I will replace them with another pair of Mechanix gloves.",
        "I use these for shooting and light work (moving wooden targets around, steel etc.) They go on and off quickly and offer great tactility. I shoot with these which is normally very difficult with gloves, but these are perfect. The suede also has a fantastic ability to remain clean-ish, I've gotten paint and dust on them, but simply clapping them together gets a LOT of the crap off them.",
        "I'm an old retired mechanic. These gloves are perfect for me. I like that they absorb the shock of the various air tools, and I also feel safer knowing I will not be 'busting' my knuckles, if a wrench slips. Unless a job is very greasy\\oily, I prefer these gloves over the rubber gloves. I'm probably only one of the few that actually washes their gloves. After they get dirty, I wash them. It takes several washes, but they eventually come out very clean.",
        "I love these gloves for shooting sports and hunting when finger dexterity is important. Easy on and off. They are great for work/chores but they will wear just as quickly as cheap rubber coated gloves. I can buy cheap rubber coated gloves for bout $1 a pair in bulk packs so I save these fast fits for when being real precise with fingers is key. Example would be manipulating all shotgun, pistol and semi auto rifle functions. Not to mention loading mags. Enjoy",
        "I'm a transit bus driver and I love these gloves for driving. Any time I'm in the nasty bus these things are on. I still have good dexterity to help people with money. These gloves last about a year of full time work. I wash them in the washing machine and put them in the dryer every 2-3 weeks. Highly recommend",
        "I really like these gloves. This is my second set. They’re warm enough for most things that I do, from walking the dog to deer hunting. And you can use your touchscreen phone without removing them. I like the elastic wrist band instead of Velcro, which slowly shreds your jacket cuffs. Hope that they are durable.",
        "I guess they did protect my hands but after only a day and a half of moving some small retaining wall blocks, holes all over. These gloves are not what they used to be. Not a ton of money but you can definitely buy cheaper and I’m sure they’ll last just as long.",
        "I’m a big fan of mechanix gloves. Now truth be told if you’re like me and Work on heavy mechanical and industrial maintenance. These are gonna last you forever. However I still prefer these fast fits to the mpacts. I feel the reinforced finger and thumb and palm and knuckle padding on those styles really decreases your dexterity, which is something I rely on. I’ll even forget I’m wearing these versatile and breathable gloves",
        "I like that these are padded and they wash well. I used them pulling poison ivy, hence the washing. I just wish they were a bit smaller. It is hard to get womens work cloves. I didn't buy these for warmth, mostly to use while cutting down trees. Great so far.",
        "These gloves I've purchased several times. They are extremely comfortable to work in, but with heavy work with anything abrasive like stone or bricks they do eventually wear through. But, never a broken or unraveled seam. Great Gloves ..!!",
        "I’ve owned countless pairs of Mechanix gloves and the quality seems to be heading downward. After about two weeks the left index finger started to wear and a hole formed as a result. They are comfortable, but the durability doesn’t seem to be what it used to be.",
        "I buy these when they go on sale. The price they charge at a Parts store or any store, I could get 2 or 3 of these for the same price. Just have to keep checking. Depending on what they are used for in work field depends on how long they last. I use these everytime in my job field.",
        "Wife uses them when she gets out of her car to go to the store. Then after shopping she takes them off and gets in her car. Since these are machine washable, she can reuse them. This is a better option than latex or nitrile gloves, which can be hot and sweaty.",
        "I'm doing demo in a renovation project & wanted gloves that would allow me to answer texts and phone calls. I'v e gone through 3 pairs of these in 2 months (working some evenings and weekends). For me, the left index finger wears a hole way before the rest of the glove is worn out. I've had to switch to a different glove completely. I wish the fingers did not wear out so quickly. I love the gloves otherwise.",
        "I wanted something reliable for my emergency backpack kit and this is perfect because lighter and able to squeeze in a tight place, not bulky. And the layer are thick enough for work but for thin enough to feel when use hands for general use.",
        "The index finger end frayed and has holes in it. The worst it’s seen is a bicycle chain and parts. Been using it for lifting printers and such at work lately. It’s usually stored in a dry place away from sunlight so idk why it’s so frayed and chewed up already.",
        "I don't have very big hands and I got large, but the fit is still pretty tight. I bought a pair of Mechanix FastFit gloves in 2017 and absolutely loved them. I lost those and bought this pair in 2020. There's something about the design of these that isn't quite the same; they fit great once they're on, but it's a squeeze to get them on every time.",
        "I've worn these gloves for years and never thought to purchase off Amazon! They are super cheap here and these things are great. Super light weight, and they give you the ability to pick up little pcs and function as great mechanics gloves! Will be purchasing more",
        "Mechanix Wear are my favorite gloves and I've gone through about 6 pair over the years. High quality and they take a beating, at least they do when I wear them. I use them for everything from yard work to moving boxes or furniture in the house as they save your hands and your nails. At certain times during the year my hands are very sensitive to animal dander so I will use them when working with the horses or the dogs and they're great. Very happy with my Mechanix Wear gloves.",
        "These gloves have been changed without notice. If you order these you will get a different glove. The fingers are smaller in diameter and have a coating on the tops of the finger tips. After ordering many times THIS glove in the description they have changed to one I hate and does NOT fit anything like THIS one. I returned it and explained the problem only to receive another one exactly like the one I returned.",
        "mechanix gloves are the best!!!! i mean i wish they were a little bit stronger at the seams but out of the gloves i have tried so far from Home Depo, walmart, pepboys, autozone.... these are really good. The price is cheaper on Amazon and also since i have small hands... amazon is the only place they have it in stock. almost no place has size small... med. size pops up here and there but yeah....",
        "This is now my go to glove for every day activities. I am getting great fit, and longevity out of them. I highly recommend. Be sure to use the fitting guide when purchasing as the size I bought is not my normal glove size. They fit like a glove. :-)",
        "This is my second pair (lost one of the first pair). Great for light duty work in the garage. Very good 'feel' when working with them on. Not recommended for heavy duty work, but great for the light duty stuff where you need to 'feel' what you are doing.",
        "Great gloves for work in garage or around the house. Not great for touch screens. Otherwise excellent. Great for and allows for feel when using tools. Will buy these again when this pair wears out.",
        "Bought these for electrical work as I wanted something better than the semi disposable rubber dipped gloves. These gloves fit well and are soft. That's all they have going for 'em. They were tattered within a week. Stick with the 2.99 gloves at home depot.",
        "Love these gloves. I use them while working on my truck, doing yard work, working around the house and while riding my dirtbike. I wear through a pair every few months but I also use them almost daily",
        "I have purchased a few pair of these over the years and loved them but this pair is different. The back of the hand and fingers are padded. Feels like a cold weather glove instead of a work glove. Too bad Amazon won't take them back. I wish I would have bought them from Lowes as usual.",
        "Have big hands, tired of beating them, these are a good reasonable low cost solution to your problems. I ordered XXL gloves and they work great, with no lost dexterity or feeling.",
        "I got these as a stocking stuffer for my dad and he was happy with them! They’re less durable then the usually Mechanix gloves I get him but he likes that these are just quick pull on kind. Can’t beat the price either",
        "I only purchased these because I desperately needed a pair of gloves to shoot my recurve bow with. These gloves are good in quality. As good as you can expect a mechanic's glove to be. My huge gripe here is that Mechanix has zero customer service. Several years ago I experienced an issue were several brand new pairs of gloves I bought had identical seam failures on every pair. I emailed the company concerning this and I have yet to recieve a reply. I've decided to boycott this company indefinitely. Now that I've found other sources for similar gloves, this pair will be the last pair I'll own.",
        "Love these gloves, this is my second pair in about 10 years (first pair was ruined by me when pouring concrete) so I ordered a new pair. They last a long time and do not fall apart. GREAT purchase!",
        "If you use the chart,It shows you how to measure your hand. You definitely get the right size. I highly recommend the gloves I have been using them for years. I get almost a full year out of one pair of gloves. I am a truck driver, use the gloves for fueling I am doing checks on the truck. And I use them to put king pin locks on the trailers. When they get too dirty I just put them in the wash machine to clean them. I highly recommend these gloves.",
        "good Value for product, after only two month the right hand got a big hole in the palm😠 so not such a good value after all. Synthetic leather , pay the extra five, six bucks for the real leather",
        "As always, a perfect fit and rugged gloves. I like the cuff as the velcro version always wears out. Good quality design. Fits my hands better than others.",
        "I bought a pair of these for my bugout bag. Just something to use in a what-if scenario. So I can't comment on durability. They aren't particularly comfortable due to the way the seams are sewn inside the fingers, but I'm not wearing them every day so it's not as much an issue for me. Please note that they fit snug for the size. In many Mechanic's gloves I'm kind of between a medium and a large, but this large pair barely goes over my hands. If you're undecided about size, definitely err on the larger side.",
        "There's more gray on these gloves than black, so don't expect a nice \"tacti-cool\" blacked out pair of gloves. I went with the fast fit over the traditional Mechanix in the hopes that I could fold them and fit them into a cargo pants pocket, and they do just that. They compress down well in a pocket, are very slim and trim while providing a fair amount of hand protection while maintaining good dexterity. If you buy to fit snug (as you should), they can take a little more time to slide on than the traditional Mechanix, especially if your hands are sweaty, but the trim size, light weight and pocket friendliness make it worthwhile.",
        "I have two pairs of the fast fit from a year or two ago that I absolutely loved, saw these on sale and grabbed a pair...the cuff is a little puffier than Id like and the material feels weaker.",
        "These gloves are probably the best pair of mechanic's gloves I've ever owned. They fit amazingly. Before I received them I was worried the thumb might not fit very good like most gloves, but these fit perfectly. They're very comfortable and they breathe. Definitely would buy these again! The only thing I found is that you shouldn't necessarily go by their sizing chart. I wear a medium glove and I ordered a medium and it fit perfectly. On the other hand, the sizing chart recommended a large, which I know would've been too big for me.",
        "I followed the sizing but these were still too big for me. I would up ripping through one of the finger tips maybe a month of use. Will not buy this brand again.",
        "The design has changed since the last time I bought these. I'm not a fan of that at all. Touchscreen works better but that not why you are buying these. I prefer the earlier version. They were more comfortable and the dexterity was better in my opinion. All and all though, worth it for keeping your hands clean or great driving gloves.",
        "I like the way these glove fit and feel. I was disappointed after only wearing them two times. The seam between the thumb and first finger on the right glove is already coming apart. I realize they are not expensive gloves, but coming apart after such a short period of time is ridicules. Just to be clear, the two times I wore the gloves I was not abusing them. Very light work. I might have just been unlucky and got a bad set. I've owned a number of Mechanix gloves and have always had pretty good wear and tear out of them. Might try another pair, not sure...",
        "I have had several pairs of these. Love the pull on feature and soft finger material that flexes. The fingers do wear through after years of use.",
        "My hands cut and bruise easy due to age. I've used these several times working on vehicles and they provide protection. They've been great at handling bolts and nuts without dropping them. They already have scuffs so I can't speak to their longevity but I don't believe they'd last a long time with daily use. But for a shade tree mechanic, they do fine.",
        "These glove feel nice and are very comfortable. Two holes have developed from stitched area in less than 60 days. I have cheaper gloves in bulk that last longer.",
        "i use these for riding bike. I cut the gloves at the tips of the fingers, so I can use my cell phone...etc, and they keep my hands warmer than regular bike gloves when it's cold, plus they block more sun than regular gloves during hot days, which is important for my 4 to 8 hours rides. I double wrap the handlebars of my bike, so I don't need normal bike glove padding...",
        "The gloves arrived before promised and they are the best fitting pair of gloves of any kind I have ever owned and I am over 70 years old. Highly recommend them to anyone.",
        "These are great for general work, nothing too dirty though. The fingers fit fine for answering the phone or such, but not great enough for anything requiring dexterity. I bought these for charging birds and limes in the winter, it was a pita to capture them on the app with the gloves on. But they kept my hands warm and clean while doing it.",
        "Fit tight ,this is the second pair of mechanix gloves I have bought online this time from amazon both pair have been tight !.. I have purchased (L) FastFit and Mpacts from local auto part stores and lowes ,have no problems those fit perfect , bought online because they were a lot cheaper !",
        "These are the most versatile gloves I've ever worn. I wear them on winter days, driving the car and working on the car. And I've been using them for many years... almost 8 years. Still holding up great. Love these gloves!!",
        "Love these gloves. They don't last forever, but they are quick to take on and off without the annoying velcro straps. Yes they are thin, but they allow good feeling. Saved me from many cuts and burns. I am on my third pair. I have worked in them almost daily for three years. If you don't like them, then you are using them for the wrong purpose.",
        "I use this as garden/yard gloves. I love them only bad thing abouts them is after about 6 months one of my finger nails poke through the top of one of the fingers.(I have long nails) . But I still use them until I order more",
        "I bought the wrong size (meant to get one size larger) but they fit my son an Mechanix has always been a quality durable pair of gloves. Bought them for riding a motorcycle and they work well with a touch screen phone. Wish I had purchased the correct size. I will buy another that are the correct size.",
        "Not a tight fit, which is good if you need to take them off from time to time. Not good for fine work because of the loose fit. You get what you paid for. I worked on my rotors and brakes, and aside from when I was working on little screws and bolts, it protected my hands. Washable, which are a big plus.",
        "I used these over the course of 5 weeks to build a stout fence for my dogs. By the end of the job, the fingertips tore but I was very pleased with them. They fit great, were comfortable, and protected my hands throughout the project.",
        "Good fit and protects my hands from cuts while working on the car. Hope they last a long time because they are comfortable.",
        "I use these gloves daily at work to handle boxes, chains, etc.. They give some good dexterity while still protecting your hands. I also keep a pair of these in my glove box, which come in handy on the road, and I use another pair at home for yard work and other odd jobs. These gloves are a bit thin, which I like, but it also means they will wear out over time. If you're looking for a thick extra-tough glove, this isn't it. But if you want a good lightweight glove that won't make your hands sweat, this is a good glove.",
        "Needed a pair of gloves to wear while unpacking boxes and stocking my store. Figured these would allow me to keep my dexterity while doing so. That, they did, last, they did not. After about two weeks of opening and handling cardboard boxes they ripped at the finger tips. You get what you pay for I guess. Not sure how they are so highly rated by people using mechanical devices.",
        "Wear these on patrol when the time calls for it, almost a year of use and tons of washing later they are holding up great could wear them all shift they are so comfortable",
        "These are my third pair. Big negative was that this was a \"UPS signature required delivery\"! For a $12 item, ridiculous.",
        "These have been my go-to gloves for a while. I love these things. They fit great, they're comfortable, they're protective and they hold up pretty well. I use them on the farm and put them through a lot of punishment. They don't last forever, but I feel like I always get my money's worth out of a pair.",
        "The gloves fit perfect and seem to be well made. The gloves are very comfortable however I have not had them long enough to determine long term durability.",
        "First pair lasted for a few years of yard work, this is the second pair and expect the same performance, fir perfect, would recommend",
        "When you wear these and they get a bit of dirt or everyday grim on them they lose their sensitivity values and it’s really hard to open your phone or answer a call etc, they are basic and protective for your hands.",
        "Got my first pair of FastFit's at an auto parts store. After 3 awesome years, I replaced them with other gloves that couldn't last more than one.. Mechanix gloves are great for twisting wrenches and pulling parts. Definitely pricey, but worth it. Using any glove is better than bare hands every day, no question...these just happen to rock.",
        "I prefer these to the velcro wrist band ones. I always ended up cutting the wrist band tabs off, anyways. Bought a pair for my 87 year old dad, he uses them to play golf now...hilarious!",
        "Easy to take off when you need to, but they don't come off on their own. No idea how well they work with a touchscreen, as that's not their purpose.",
        "Awesome gloves especially for the price! Only thing is they are cut pretty small so I need to get a size up. Gave the ones from this order to my room mate and he likes them.",
        "These are the best work gloves I’ve ever owned. Use them for working out, near freezing weather, and in the garden. Comfortable even when soaked. Soaking them in oxi clean every few weeks both cleans and renews the fabric.",
        "Mechanix is recognized in the work field as a leader in a comfortable and usable glove. The person wearing Mechanix gloves feels more \"one with the glove\" rather than fighting the normal \"I'm wearing gloves and can't grip anything\" trouble we have all experienced. These fast-fit gloves are a tight, but not too tight, fit to feel like the glove is your hand, which creates a better work experience, no matter what profession. Personally, I used these gloves for woodworking, and they work great for it. It gives the the protection and grip I need while still maintaining a good, comfortable feel. A good glove, can't have too many pairs :)",
        "Probably the best work glove that i have ever owned. I have worn through several pairs of the home depot brand and while they worked and were comfortable, these fit like a glove...sorry for the pun. For my hands these fit so much better than the others. In the HD brand the large was too small and the Xlarge were too big. These fit right in the middle. They are great to wear when using tools as they are not bulky...like you would have it you were wearing leather work gloves. I have since ordered a second pair.",
        "I'm a huge fan of gloves; I work faster with them. I've gone through over 15 pairs in the last 8 years or so; all different types, from $1 to $30. For heavy duty work that doesn't require precision, get something else that's a lot thicker. For smaller screws and work that require you to pick up little objects, these are great! It fits well and is very thin, but if you use it for rough work, it'll wear through very quickly.",
        "I leave these in my car and come in handy when I need to do anything on my car in the cold or not. I work in an office so I don’t want to get my work clothes dirty with oil and such so I make sure to use these gloves if anything comes up",
        "The sizing is accurate, and these gloves just somehow magically form to fit my hand. I do not dread putting them on like any other mechanics gloves I have had, and they feel so comfy that I actually forget I have them on. I just finished a job that involved a lot of axle grease and some brake fluid and nothing penetrated inside to my skin as of yet. And I would add that my finger dexterity is about like not having gloves on at all. I have had mechanics gloves that cost twice what these do and were not comfy at all. This is my glove for now on.",
        "Like the gloves a lot ,very comfortable and usable even handling small objects. A little of the stitching broke at the thumb area ,maybe too small a size for me even tho they are XLarge, but they're still getting the job done. I would buy them again.",
        "I use these gloves for all yardwork. They are perfect for the jobs I do with them. I have several and will continue to buy and use them. They last a long time, even when pulling weeds in gravel. The Double X size fit my hands better than any other gloves I have ever worn.",
        "Not as dependable as I thought it would be. I used these hoping for dependability and did not get that with these gloves. The stitching in the fingers started to come out. I found a more dependable glove at Wal-Mart!",
        "Not quite as durable as the more form fitting leather gloves, but much warmer than they are in the winter time. When the leather ones get impregnated with filth you can't wash them. These are washable (best by hand and they do hold a remarkable amount of dirt). And they are flexible enough to wear for long periods of time without becoming irritating.",
        "Bought in april. In is now july. The palm is almost gone. Holes developed. Heavy wear. And im using them for very light work. Mechanix usually has solid gloves. These suck."
    ]
}