{
    "entity": "Safety Work Gloves",
    "text": [
        "They don't last! I purchased these less than 3 months ago and have used them for very light duty just framing in and drywalling a basement. The fingers already have holes in them making them pretty much useless. (I covered the holes with duct tape in the pic so I could try and use them, but it didn't work) They are marketed as tough gloves, but they just don't last. I would not purchase them again and I would return them if I could. But of course I'm already past the return period. Also, I think I have average size hands and the extra large seemed very tight.",
        "We have bought more than 15 pair of Ironclad gloves from Amazon in the past few years. Everyone in the family uses them and we have given them as Christmas gifts more than once. This is the first time we've had a pair that didn't hold up. We bought these 6 weeks ago, so they can no longer be returned to Amazon. In that 6 weeks though, they've only been used lightly for about 1 week. The coating on the fingers is cracking and seams are coming loose. This is not the quality we've come to expect from Ironclad.",
        "These are not the best gloves . They get very slippery. The leather on the fingers are not ideal for holding tools. This glove is however a heavy duty glove but not ideal for use around oil or where you would get something spilled on your hands. The leather causes things to slip right out of your hands. I bought two pairs of these hoping they would be better than their other ones but I was wrong. Buy the other one that doesn’t have all that leather on the fingertips.",
        "These gloves are very poor quality. For something to be described as \"heavy duty\" implies that it can be used for at least 6 months before shredding to pieces. After 30-60 days you'll notice all the fingers ripping open and the gloves falling apart. These are not worth the money and I wouldn't purchased this brand ever again. Leather should be a lot more durable than this. Maybe these gloves would be alright for light gardening or something, but not much else.",
        "I'm actually using those gloves as workout gloves and very happy giving them a shot. I was previously using workout gloves with the cut off fingers but the my fingers was getting gnawed by my adjustable dumbbells course handle. Well that's not an issue anymore with those heavy duty gloves. Plus as some other reviewers pointed out they fit a bit snug but that's actually prefect because I sure as hell don't want 100 lb and heavier dumbbells slipping out my hands. Also those gloves are very sturdy so I don't see them wearing out anytime soon. I wish I brought those gloves first instead of those fingerless workout gloves that I now trashed. Oh well live and learn right!!!!!",
        "I bought these based on my glove size, usually an XL. When these arrived, they were tight to the point of being uncomfortable. So, I returned them and bought an XXL, which fit fine, though usually a size too big for me. It might be a manufacturer's glitch, as I've worn these before, comfortably, right outta the box, in an XL. No problem returning them, but the list of reasons DID NOT INCLUDE \"Too Small\", so I used \"Inaccurate Website Description.\" FYI, with no problem in the return. That was kinda weird. Never got the chance to do the TouchScreen or Durability test, since I had them a day or two and never used them for work.",
        "Bought these for my husband because they stated they were high performance and seemed like they could stand up to the job, not the case. My husband does not do construction or anything quite as heavy duty either; he works over night unloading boxes for a grocery store and we got about two month before they completely fell apart. For construction and actual heavy duty work they would probably last less than that. The fingers are coming apart and the stitching is coming undone, not to mention the leather is rubbing off in some places as well. It's a complete disappointment.",
        "UPDATE: I should have updated this sooner. I love these gloves. Yes...when i first got them, they ripped off a couple of fingernail tips, but once they break in, they are pretty indestructible, as far as construction gloves go. I have purchased 2 pairs so far. ORIGINAL:The gloves feel durable and strong, but the seams on the middle finger tip are in a bad location. Just doing jobsite cleanup, it ripped off the tips of both middle finger fingernails. Very uncomfortable, obviously. The seam repeatedly gets right between your finger and nail and folds the nail back, rather painfully.",
        "Make sure you size up oh, I have average size man's hands. Mechanix gloves large fit me perfect, the latex gloves for this political pandemic large fits me perfect. My wife uses medium latex gloves , but these gloves fit her hands perfect. Instead of going through the hassle of a return I gave these gloves to my wife and will go to the hardware and buy myself a pair.",
        "Well I had a certain pair of gloves that cost more than these and ripped around the wrist after 8 days of work but seemed to be the norm so I tried this glove trying not to expect to much after so many failures and I've been really impressed with the comfort and grip along with the durability with my job I use a shovel at a Pitt scraping Mudd, clay ,dried dirt that's been dried and compacted to be as hard as concrete rain or shine so my gloves go through extreme conditions know glove is going to last forever in that environment but these will last longer than any glover out there I'll be ordering more",
        "I've owned several pairs of these, they seemed to be better quality when they came in green. They do work great for brambles, and fit nicely, but the last few pairs I've had wore out before they should, busting out at the seams along the fingers while the rest of the glove still looks new and is hardly worn. I wound up sowing one pair up along the fingers when my stitching failed (lasted longer than theirs) and then got another pair and they did the same. Last pair I got will be the last pair I buy. I am switching to youngstown for now, until I find a better brand.",
        "Just ok, fit was a bit tight. I've already started to wear through the fingers. They do not get comfortable til worn for a few days.",
        "Got these delivered on 12/30/2019. I am not a contractor or a professional handy man. Needed gloves to protect hands while lifting some plywood boards, some lumber I bought for garage remodeling work and also while using reciprocating saw to trim backyard trees .. in nutshell some basic chores. As in pictures middle finger seam gave up. Also, in the close-up pic there is an indentation in the seam on top of index finger, it made my finger sore. It digs into finger like anything. Except for the middle finger the whole glove is intact and doesn't show much signs of wear. May be they need to strengthen/review sewing in these areas. Returning.",
        "I am a utility/material handler at a plastic manufacturer. I've used these gloves for about two months. Heavy use with sharp plastic runners and lots of lifting, pushing, pulling, high heat (melted plastic), etc. The leather pads on the work side of the gloves have held up well so far. The stitching is coming out though from being snagged by the runners as I grind them. The top of the glove is a nice breathable material. The only major complaint I have is that the velcro is losing its grab and I find them coming apart easily. The glove fits snugly without it, but it is annoying.",
        "These are my go-to late-spring/summer/fall gloves. I use them about 5-10 hours a week for chopping wood, yard work, and odd jobs. I've had them for about three years before they earned their first major hole, and so I ordered a new pair. They fit well, have a good grip, and are comfortable to wear all day long. I have not tried them on a touch screen, and I don't want to have a lifestyle in which that is important.",
        "Worst gloves ever. Palms not leather so they rub and aren't very flexible. My hands sweated terribly inside the gloves which made the gloves very uncomfortable and in a couple of hours worsened my hand eczema. Fingers of the gloves are weirdly long so the tips catch on everything. I have used the Ironclad Ranchworx gloves exclusively for several years and they are great. This was an experiment gone wrong. Don't buy the Ironclad heavy duty utility glove.",
        "These gloves are great. The fit is on point. They are thick to protect from injury. Cushiony too to prevent callous. So far no ripped nor holes. They were left on a desk for a few hours, and they magically disappeared. I purchased another set. I will never buy the cheaper standard ones again. I love the quality of these gloves. They are NOT touch screen friendly. Still worth the purchase.",
        "On the surface, these gloves look great. Materials are nice, and the protection is in all these right places, and in good amounts. However, the way it is put together is not the greatest. Seams started to fray after just a week of everyday use doing things like shoveling and sweeping. It's a shame, because these would be great gloves otherwise, but I don't expect them to last very long. Update: these gloves lasted me 6 months of daily use, which is honestly longer than I expected. Yes, some of the stitching came loose, but the gloves did not actually fall apart until I had really abused them. So, I'll add one more star to my review.",
        "TOUCH SCREEN doesn't work when wearing these gloves ... DURABILITY is amazing I work with lumber everyday and so far these gloves have held up with no problems .. today I was grinding some metal down and sparks burnt threw the glove on my ring finger so I would NOT suggest these gloves for grinding .. COMFORT they are light weight cant even tell you have gloves on.",
        "Not touch screen compatible, but I did not see that in the description anywhere so that's okay. They fit as expected and have double layer on the palm side which makes them VERY durable. I like the stretch in the wrist band. It allows me the option to leave the strap closed for easy on and off since I like my gloves a little loose on the wrists.",
        "Overall they are good work gloves. I work at a lumberyard and I need protection for my hands. After about a month 1/2 the fingertips started to rip and they are no longer usable. They offer a fast removal if you're hand gets stuck you can easily rip your hand out of the glove. My only dislike was the cheaper fabric at the end of the gloves. I am definitely buying these gloves again and I would recommend you to purchase them as well",
        "I use these gloves extensively for general construction, yard work and all-purpose around the house. I like the fit, materials of construction and quality. I am tired of repeatedly buying gloves that don't last. I do not expect these to last forever but thus far I am very pleased and when they do fail I will replace them with the same pair.",
        "I bought these for my husband, who works as a professional gardener. He kept getting cuts and having dry, cracked hands from his various work assignments. He really likes these gloves. They were really designed with function in mind. They fit his hands really well and allow him to grip things better without cutting or scratching himself. They wash well, too (cold, regular cycle; air dry), though they did have a bit of a sweat odor lingering in them after I washed them the last time, but I think soaking them overnight in oxygen bleach would probably solve that.",
        "I put these to work doing heavy hand sanding. Holding up fairly well after a month but I have cracked the index finger middle joint padding that takes the brunt of back and forth sanding. They were VERY stiff when first got them but have broken in fairly well. Overall no complaints as I do beat up on my gloves. Price wasn't bad.",
        "These are good quality gloves. They will not last, of course, you are a fool if you think anything lasts. They will last long enough for the price. I work in a refrigerated warehouse. I deal with wood pallets, heavily packaged boxes of all shapes and sizes: wet and dry, and heavy machinery: pallet jacks. Constant hard labor puts these gloves to the test every day. And for what they do, they last a little over a month before they become unusable (fingers and palm separate). I wrap shipping tape around two fingers that I notice wear out first and that allows the fingers to last longer. I've tried youngstown and leathercraft. Ironclad wins in comfort and longevity.",
        "I bought these as I had purchased the Ironclad General Use ones beforehand, but due to the high amount of friction on my hands in my line of work, I need these ones. These are SO rugged and yet so comfortable at the same time! This brand is one I'd easily recommend to family, friends, AND coworkers... in fact, I think I will. These are fantastic!",
        "You cannot get a better work glove for the price. I have been buying these Ironclads for years now and am always impressed by how solid they feel, the excellent grip, and especially how long they last. I have used these for riding offroad and on snow/ice and they perform great in the heat and cold.",
        "I work around trees to get firewood and keep them from falling on something I like. Wearing out gloves just happens pretty quickly if not from equipment with sharp teeth and edges than from stacking, splitting and restacking wood. Try to not wipe your face with the back of the glove as the protective rubber elements are stiff and could scratch you, I think. Haven't been scratched but have felt the rub and its potential. Like the rubber things because they saved me from cutting my hand while reaching into something with sharp edges around the inside. Big fan now.",
        "This is the perfect companion for the Knees saber I just bought! This guys are amazing. Great fit great work. Use them everyday for handling bags at the airport all day long . No problem what so ever . BTW people ask me where did I get the gloves .. hahaha Ana their’nt Not even that “ flashy”",
        "I work with trusses everyday and the metal plates that hold them together are very sharp they will rip apart your hands. These gloves are GREAT tried quite a few and these are hands down the best. They still get torn up but they last week's longer then others I have used. •They don't keep your hands to hot. •They fasten great and stay put •Wash easily. Highly recommend them to people who need some durability and comfort.",
        "Have used it for 5-7 months and helps protect my hands from ratchet straps, heavy equipment operation, load tie downs, warehousing operations. My company offers the cheap cut resistant gloves which I requested heavy duty gloves since I'm a driver/heavy equipment operator but they dont see it as a requirement since they cater to the majority. Durable in warehouse operations and much more comfortable.",
        "These are the ONLY work gloves that my husband will wear for chopping wood and working as a park ranger! They last longer than any other gloves including the nice leather and suede ones. They offer more dexterity because they aren't thick like the leather and suede ones.",
        "Can't speak to durability over time and haven't tried using with touch screen, but where I take a large in all but Italian motorcycle gloves, these in large fit quite snug (finger length is spot on, though). Woudn't shy away from them, but maybe order a size up, unless you're looking for some compression.",
        "For some reason I can't find these where I now live so I had to order online. I've used this brand for a decade or so and they are the sturdiest glove I've used. I've used them for farm & garden work, rough carpentry, moving firewood, etc and they've always held up well. Heck they even make killer mountain biking gloves! I have worn these out in one season of heavy work, but that is way better than cheaper gloves which have literally worn out in a weekend.",
        "I usually buy goat skin gloves, but I like my gloves to fit very snugly, goat skin gloves are very difficult to put back on when your hands are damp. These gloves have a little tab that helps put the gloves on and a velcro band to help fit them snugly. Time will tell how long they least.",
        "These gloves are excellent. I have been using them regularly for months in my landscaping business. They are thick enough to allow me to grab thorny plants and do other tasks that are hard on the hands with no pain or worries. I will purchase these again once I finally wear through my current pair.",
        "These do not fit the same as an older pair i had. They work though. I use these as rescue gloves for the fire service. These things are tough as nails. They laugh off broken glass and I even went at my old pair with a knife and barely touched the finger tips with the first few slices. They just seem to fit a bit bigger than my old pair.",
        "The glove is ok. seems well made. The down side is the \"extra large\" is NOT that large at all. My hands are normal I thought getting extra large would be fine. Apparently I'm an Extra Extra Large for the first time in my life. They are a struggle to get on and are very tight. I won't go through the hassle of returning but I would recommend buying the LARGEST size they offer unless you have very small hands.",
        "Nice, comfortable, rugged gloves. Be warned though that due to the thickness of the glove you will most likely be unable to manipulate small items with fingertips. I have a lighter duty pair I use if I need fine motor control over small screws or other parts.",
        "I've been so frustrated trying to find a (vegan) non-leather work glove that will last through even one hour of gardening. This is off to a good start. Comfortable and has held up to a couple of sessions of weed pulling and bush trimming and is still going.",
        "3 months weekend only use. I used them for all around outside work. Lifting, carrying, using digging tools, on the tractor. Ironclad and heavy duty don’t belong in the same sentence. They were very comfortable, I liked the sweat wipe feature on the back of each thumb and they were very dexterous. I also liked the Velcro closure at the wrist. They just didn’t last long.",
        "The description of the 'Ironclad Utility Glove Synthetic Xtra-Large Carded' says '3 Pair Pack'. This is wrong. False. And misleading. I purchased this option, got the item mailed to me quickly. But it only included 1 pair. I contacted the seller (EZ Gifts 4 U) and have still to receive a reply (4 days later). That said ... the 1 pair that I did get a very nice and fit well.",
        "i've always been an Ironclad fan. been using Ironclad since my racing pit crew days with the United States Touring Car Championship and when it was a sponsor of the series and one of its mainstay race teams. i don't use any work gloves other than Ironclad, it's Iron tough.",
        "Bought for work on a construction project as a laborer. After one day all the seams around the fingertips came apart and they were riddled with holes. The stitching is very cheap and obviously not designed to last at all. There are much better cheaper gloves that last a lot longer, these ended up just being a waste of money that I couldn't return. Another bad note, they make your hands smell terrible, like an old cast.. terrible when you're wearing them all day out in the desert heat for work.",
        "I ordered these gloves hoping they would be the right size. I ordered the biggest size they had and they were still too small for my hands. I ended up just putting them in a drawer and leaving them there. If you have very big hands do not purchase these gloves.",
        "I used a pair of these for cutting/splitting and stacking wood. Fingers wore out and seam split after about 10-12 hours of use.",
        "I bought these gloves thinking that they would hold up to the work I put them through, but sadly, I was disappointed with the gloves' durability. After 2-3 days, the stitching came undone around 2 of the fingers on the same glove. I wrapped the fingers in some packing tape to get through the day, but that proved to be annoying, so I ended up throwing the gloves away. They were a waste of money. So far, the ironclad box handlers gloves have been my favorites, but they wear out within a month. By the second week, most of the rubber grip pads are already gone.",
        "I love these gloves. They fit great for my smaller than average hands. Normally if I buy the \"one size fits all\" type gloves, they're way too big, but these I can get in a size that fits \"like a glove.\" They're also durable and last a long while for me. They are a little stiff at first, but once worn in they're comfortable.",
        "As a farmer, I work on equipment, vehicles, and all sorts of miscellaneous heavy, sharp, rough, tough, and dangerous things. These gloves stand up to the test. I have a paid of IronClad General, Framing, Heavy Duty, and now that it’s winter I got one of their insulated pairs. These are the only gloves I’ll wear due to comfort, durability, and overall toughness. Definitely am a customer for life.",
        "Finger tips wore out in the first week. I have had this problem with several other brands as well.",
        "My son works at a feed store while he's finishing college. He loads feed, hauls hay and drives a forklift. It's hard work and his gloves take a beating. These are sturdy and last a long time. Other gloves end up with the fingertips torn out quickly and otherwise have to be replaced.",
        "Between myself and my husband we blast through gloves. I wear them for all yard work since pokies and splinters are the worst! These save my nails also and protect very well. I have used them from everything from weeding the garden, dragging concrete out and scooping up yard trimmings. Will buy again for sure. These are especially a tasty favorite of my pebble. He likes to chew the fingers off.",
        "I gave these gloves to my husband at Christmas because he often gets splinters from moving our firewood. He loves them! They are very comfortable and have been perfect for protecting his hands. We have just ordered a pair for our son.",
        "Already have a hole in the thumb where the stitching is located. Ironclad has lost this customer for life. I've tried their box handler line and now their heavy duty line and neither gives you more than a couple mints of medium level use. Really sucks bc I had a pair of box handler from them a few years back that lasted me nearly 4 years. Now the new pairs don't even last 3 months.",
        "The touch screen doesn’t work quite as well as I would like. It could be because the gloves are a little large for me though. I am using them to build a deck and so far nothing has gotten through to my hands. They are not ripping or tearing.",
        "I was very much looking forward to this pair of gloves. Looking forward to having a tough pair of gloves that would last. Hugely disappointed! Did not last two weeks. Falling apart already. Fingers are ripped, palm seams coming apart. The 10$ ones I get at home depot lasted better/longer. Ridiculous! I emphatically, do NOT recommend these for real outside work.",
        "Not as tough as I thought they would be, war of the palms out in less than two weeks and I’m still use it on but the palms and fingers are all wore down they just did not really impress me I still have one more pair to go through and I’m telephone gloves but I was hoping they would last a lot longer than this because they’re kind of expensive",
        "Gloves fit my extra large hands just perfectly. They are snug enough so that you maintain a great grip. I use them to lift 50lb cast steel plates. the steel has a rough texture that tears up the average glove. These have remained intact with 6 months or so of weekly use. Will definitely purchase again. The Ironclad logo is rubber glued to leather to provide excellent knuckle protection. The Velcro strap is strong and keeps them in place.",
        "The gloves are very flexible, fit snugly and are extremely tough to protect my hands. This is my second pair. Didn't wear out, but, house painting with them ended up with too much paint to continue to use.",
        "Good set of gloves, i'm using it pretty much everyday and they're holding up well, although it's only been maybe 3 months or so. They feel thick enough, but that also means if you're needing to pick up little things, it can be a challenge. Can't use a touch screen phone while having these on. They fit well enough but can get a little stiff after they get wet, but it's not a big issue, it's not so stiff that you can't use them. I will get another pair once these start to wear out.",
        "Bought size large which are normally loose on my hands. These “large” are quite tight on my hands. “Heavy duty”— I don’t expect these to last a week. Must have been rated by someone who has never done actual hard work like logging.",
        "Used to use these to frame houses. Years later I went back to them for working in the yard. Awesome durable and comfortable gloves. Easy to work with. Well worth the cost and nice to see that 15 years later quality has not diminished.",
        "I ordered the Ironclad Heavy Utility work gloves (note the 'Heavy' on the wrist strap), I received the Ironclad General Utility work gloves (note the 'General' on the wrist strap in my pic). I ordered a replacement and received the same General Utility gloves. The sticker on the package reads Heavy Utility, which they are not. I'd order another replacement but fear I'd receive the same wrong product.",
        "These gloves are very rough inside with poor stitching...gave me blisters. Past Ironclads have been comfortable, but these are horrible. I suspect they'll last a long time since I won't use them as vigorously as I normally would.",
        "I purchased these gloves because I am a diyer and wanted a nice pair of gloves to work around the house. They did not hold up at all. The first day that I wore them they started to fall apart. They fit nicely, so I guess if you want a pair of gloves for light work then these are good but they will not hold up to harder use.",
        "Bought them for work. Very sturdy and durable. Didn't work for what I needed them for. I needed great grip for package (box) handling. Slippery when touching boxes so didn't help for what I bought them for. But I believe I can use them for other things.",
        "These gloves worked great! I used them most of the day Friday! Digging, cutting limbs, pulling up roots and unwanted vines! They kept my hands protected and have a good grip. I've only used them one day so I can't speak on how long the gloves will last. They held up with all the projects done Friday!!",
        "I have a very large yard with a ton of trees, so I will spend long weekends working outside. I have gloves on most of the day while I work. These fit excellently and are very comfortable. Buy leather gloves if you are going to be around fire as these will melt from sparks.",
        "I bought these for my son to use on a Cub Scout service project. They're decent gloves, but not near heavy enough for dealing with shrubs with thorns. He got numerous pricks from thorns on an invasive species they were ripping out.",
        "just don't hold up well, and if you don't wash them, they get funky pretty fast. The middle finger seams in both left and right split at the seams. Slowly my middle finger emerged over a period of 2-3 days of wearing them. If you're just wearing them to rake leaves or something gentle, they'd probably hold up okay, and they are more comfortable over time, unlike the leathers which get stiff. For me, back to the ole leather gloves;(",
        "Good quality used it intensely over the summer. No issues! Update 3/27/19: I bought this in June of 2018. I used them constantly over the summer, and also during the winter. I got them dirty in mud and concrete, I got them hot, and I've frozen them stiff. They've held up with perfection until this week, the seems on the fingers are starting to go. Ordering another pair now.",
        "So, the main part of the gloves is the same high quality ironclad construction that I've always loved, with perhaps a few upgrades over previous models in fit and dexterity. Unfortunately, it seems like they've changed the hook and loop closure that the're using and it doesn't work at all. I can strap these closed and just barely move my hand and it comes open. Very annoying, especially considering that the gloves are otherwise great. Maybe I just got a bad pair, but I'm going to have to now think twice before going with Ironclad for my next pair.",
        "I bought my first pair of these gloves in August 2014. The fingertips just started breaking through this summer. They were used for five years of HARD landscaping work! They don’t owe me anything! I just bought my second pair without a second thought!",
        "I pour concrete for a living and I am constantly buying new work gloves. The concrete and oil we put on our steel forms, as well as the forms themselves, simply ruin gloves. These gloves have lasted longer than any other pair I have ever used, and trust me, that's saying A LOT! I have went through hundreds of pairs. These can't be beat, and the price is outstanding for such a heavy duty glove! BUY THESE!",
        "Lost my first pair last month after having them for 4 months. They were still in great shape. I will continue to have a pair while they are in production.",
        "Because of how they look I didn't think they would be the best for thorns and such but these gloves more than do the job. Happy to purchase a second pair for when the first finally do wear out but it's been several months of yard work and the originals are still going strong.",
        "This is my second try at ironclad, my first we're redwing ironclads, light weight. This one is a bit expensive but the materials show a well made product. I have just one complaint about these gloves and that is the thumb. They are unusually long, maybe it's my hand but it seems only for this brand. My present glove and I hope it lasts a while is the craftsman mechanics heavy duty and they fit just fine. I think a better way is to go in to a hardware store and size yourself properly before you order. BTW it's cheaper here that most hardware stores I've checked.",
        "Excellent gloves! I used these to pull some briars and the thorns didn't pierce the material. The gloves are not too bulky and I can pick up small items fairly well with them. This is a quality glove and reasonably priced! Would certainly recommend!",
        "These gloves have proven themselves on a few jobs thus far laying stone and cutting firewood. They're holding up perfectly. No issues with seams. Recommended.",
        "I need a tough glove for railroad work, which is very hard on your hands. I tried the xxl after measuring my hand, which is pretty big. First impression is that the stitching inside the fingertips is very thick and digs into my finger nails, which is a very uncomfortable feeling. I’m not sure I can deal with that every day. Address this issue and you might have a great product.",
        "Favourite pair of gloves I’ve ever had. I do hard labour and work with tough materials( steel, metal, rusted metal, wood, dirt, iron, etc). These gloves fit my work environment very well and the price is great for me. Highly recommend!",
        "Fits well. Appears to be stronger than other work gloves purchased at a higher cost. Waiting for Spring to really get into the hard work with them.",
        "I need to find a glove that fits and is tough enough for me. This may be the glove. So far it hardly shows wear in the finger tips. I may be ordering a second pair soon.",
        "I have XL hands and these fit great. At home I work in the yard, on the car, around the house in these. In the past I have had several pairs of these and they hold up extremely well. My hands sweat a lot and these do not cause my hands to sweat like most other gloves.",
        "Have used these gloves for several years I’ve always been very pleased however the last pair I received it appears that they have a thinner palm pads that is not nearly as durable as previous models even though the price has gone up over that time. (Could have been an anomalous production flaw) Ironclad Ranchworx Work Gloves RWG2-05-XL, Extra Large These are the gloves I have moved on to. they are tough to beat but little more pricey",
        "Durability is terrible on these gloves, which is too bad because they're conformable, they breath decently and they stand up to small thorns from berry bushes. Used them for two long weekends of backyard work and by day 4 a hole had opened up on the thumb and the stitching was frayed in multiple areas. Buy for super lite gardening, but can't recommend these for anything heavy duty.",
        "Only had these for a few days but they seem durable so far so good. The seller is 5 stars. I would order again from this seller. I Will update glove status in a month.",
        "Quality has gone down big time !!! I drive a semi 12 hours a day . I only use these to keep grease off my hands when in coupling to a trailer.. they would last 6 months or more .. now the last 3 pair have lasted about 3 weeks .. horrible product and over priced",
        "I already returned Ironclad Heavy Ultilities Work Gloves in person , please double-check on your record again, please do not confuse to charge me again, Thank you for your kind attention !",
        "Tried this out as soon as I got them to replace a different pair of ironclad gloves that just weren’t rugged enough. Very happy with performance and quick delivery.",
        "I recently ordered these for my wife and I as we took on a home renovation project. I was very impressed with the overall durability. We subjected them to some harsh work and they held up great and were comfortable to wear for extended periods.",
        "They fit well (sizing seems correct), and have handled using a chainsaw and sawzall for demolition work. They are comfortable and absorb a lot of vibration from the power tools.",
        "I ordered these for one task, so I don't need them to be a long-term use item. I have another pair of Ironclads (a less heavy duty pair) for around-the-house stuff. Being familiar with the brand I ordered the large size. These just seem to not quite want to allow my fingers to reach the tips without pulling them, from the palm, really hard, and the palm kind of extends up to where there is like a 'webbed hand' look. It may just be a function of the Kevlar not stretching, unsure. Again with only 1 task in mind I'm sure they'll be more than adequate. Arrived on time.",
        "I got them for my husband for a gift. He's used many different gloves in his 20+ years in his career. These are the best he's ever had! Even with the normal wear, there hasn't been any holes! I am done sewing the holes in his old gloves as these will be the only ones he will wear! Score for the both of us!",
        "I paid over $20 for these gloves. Only lasted about 3 weeks at my job. Ordered other gloves 3 pack for $10 and each pair of those lasted longer than the ironclad gloves.",
        "Like other reviewer said, size is NOT ex-large, its somewher btwn medium and large. Seems very sturdy, good seams. But protective material on palm side bunches under some fingers and digs into the skin when gripping pipes or other round hard objects. A nice design, but poorly executed. Disappointed with price when dealing with lack of comfort.",
        "I bought these not sure what to expect. After using them for awhile I quickly learned they superior to my other gloves.",
        "These work gloves are great. Very durable for work around the yard and garden. Hilusband lives moves them. I've ordered another pair to have on hand. Good purchase.",
        "A fella at an Ace hardware told me about these. He was not wrong. A lifetime of burning through gloves like paper. These have held on for many months. Still in superior shape. Can’t brag enough about these.",
        "I really like these glove and how they fit. My hands dont seem to sweat to much in them. But the knuckle pad is just a bit high. That is my only complaint. They are stiff at first but i just rolled them up and put a rubber band around it to keep them loose"
    ]
}