{
    "entity": "Safety Work Gloves",
    "text": [
        "Gloves ripped on second use. I unload trucks for a living and have yet to find a glove that holds up to unloading 1000+ boxes per truck. These gloves ripped just like another brand I bought in the same place near the finger. Guess I'll try resewing them if I can find a needle and thread. They do fit really well but if they're not durable what's the point? Also all of the grip on the fingertips is pretty much gone after second use they are now very slippery when trying to pick up boxes by the sides. If someone can recommend some lasting gloves for handing 1000+ box's a week please comment and let me know.",
        "My wife needed a pair of work gloves for her job working with slate. Initially, these gloves were just what she wanted but they did not last, ripping out at the seams on different fingers on both hands. Purchased the middle of March and started wearing beginning of April. Lasted about 3 weeks. Could be a bad assembly, but cannot spend another $15+ to get another pair to find out if that is true or not. Will have to go in another direction to find a pair that works but lasts.",
        "Job deals with concrete/brick/cement etc. These gloves last about 1 week before they rip apart. They will fail at the seams and finger tips if you work with rough surface such as concrete. For my job, I have NOT found ANY glove that will last longer than a week... i literally buy gloves weekly (experiment with different brands) they ALL last about a weak... so I will say they are average. Padding on palm & knuckles is good tho... my calluses on my palms are leaving after 2 pairs (2 weeks) of using these gloves. These gloves reduced palm calluses and skin cuts to knuckles because of padding BUT i have to buy them weekly. 3/5 stars for being average",
        "i work with HVAC and deal with a TON of sharp edges and razor thin metal, mostly aluminum and stainless steel sheet metal. these gloves have saved me several trips to the ER!! so many close calls on knives, sharp edges, nails, screws splinters, etc. I recommend these for anyone looking for work gloves. ive had em for a month now and under the grime theh still look and fit brand new! they are comfy too. is it wierd i whisper \"thank you little buddy\" to them after a days work? Lol highly recommend.",
        "These lasted about a month and a half. Worn daily for various tasks from rolling hose ( I'm a firefighter) to pulling and replacing snow stakes, light construction, tool maintenance mainly, the seams on the fingers started to go after the first 2 weeks. All the reinforcement and padding remains intact however 6 out of 10 of the fingers are now wrapped with tape. Pretty ridiculous for what they cost. If anyone knows a better glove PLEASE refer me , unless you are pulling weeds or petting the dog is pass these by",
        "These are excellent gloves, great fit, very comfortable and durable. Once they get dirty I wash them and let them dry in the sun and they feel just like new. great for landscape work and swinging a hammer. Typically I order a couple pairs a year just so I have some fresh ones to use. Cant go wrong with these gloves. If you found this review helpful please let me know by pressing the helpful button below. I do my best to write honest and helpful reviews of products I actually purchase and use. Your feedback helps me to understand how good of job I am doing. Thanks.",
        "I bought these gloves roughly about three weeks ago, because I started my new job at a warehouse. It consists of unloading trucks daily, and wrapping the unloaded cases in plastic wrap. Sometime around the second week the stitching started to unravel.. Soon after the finger tips started to ware, which soon followed by holes. It says in the description that these gloves could even be used for automotive.....yeah well I highly doubt it. These gloves can be used for anything BUT labor work. Maybe....just MAYBE, for mowing the lawn. But these gloves are useless. Gloves I had purchased at Family Dollar have lasted a lot better than these have...",
        "My first pair of CLC gloves was 124M and they almost lasted 3 months before ripping and the velcro no longer sticking. I purchased the 125M for better protection and it did provided better protection, but the quality was the same as the 124. Matter fact worse these didn’t even get close lasting 2 months. Very disappointed with my purchase. I have purchased one last CLC glove which is the grip one and we’ll see how long those last. The material seems the same for all 3 so I don’t have high hopes. Wouldn’t recommend these gloves for hard duty jobs. My job is a warehouse light job and get destroyed easily.",
        "I bought these for my DIY projects at home as I often need to protect my hands whilst doing plumbing or electrical or my wood working. I’m always doing something and figured these would be great. They are a great fit! I was concerned when I purchased but I used the size guide and they are snug. The only thing is that they take some doing to get off because of the snug fit however the fit enhances the natural usability of my hands whilst being protected. They feel great. Firm hold not tight therefore comfortable. As time passes I’ll update on the wear.",
        "Would have expected these to last a little longer for what you pay. Gloves started coming apart at the stiching for the finger tips. I use them under kind off harsh conditions. As i am an unloader at ups and it is peak sesson. On average a day consist of unloading appx 100 to 2000 pakages per trailer depending on the load, bulk 200lbs to small pakages of 1lbs and up 2 3-4 trailers a day",
        "I ordered these to replace a pair I have worn for years but, unfortunately, a hole has been worn in my old gloves. The old gloves are medium and, in spite of my thought to get the large size, I ordered the medium. They arrived today and I found out that I would have been right to order the large size. These are cut smaller than my old gloves. I can get them on with quite a struggle, but they do not fit like my old gloves. The quality of the gloves is good, and with a proper fit I am sure they will be serviceable for many years.",
        "these gloves were perfect for what I needed them for. initially they were not very comfortable, but for the cost they were a great product. I actually went back and bought a couple extra to stash for back up gloves. Once broken in to your fit they are comfortable for wear for a full shift. beware, the first thing to wear out on these for me, was the Velcro, but once broken in the worn our velcro didn't hinder their fit that much. the touch screen feature wears out quickly too, but I didnt rely on that much initially anyways.",
        "I drive a forklift and handle boxes and tile on a daily basis. I wanted these for the winter .. purchased in the middle of December before Christmas.. its now not even the end of January.. one of the finger tips has already worn all the way thru.. I notified amazon and I am getting a new pair free of charge.. lets hope these last til spring otherwise I will be writing clc for a explanation on why their gloves have declined so much in quality but went up in price I mean 15 bucks.. and they lasted me a month? come on. Second pair lasted around a month.. Garbage..dont buy these if u handle tile or any rough items..",
        "Just got these gloves in and they're perfect. $15 quality pair of gloves. Very durable, protective, breathable. I love these. I'll be using them while cycling on my ebike to work, and at my job also, in an Amazon warehouse. They supply gloves but there isn't enough cushion in them for people who work inbound in those trailers, or in DLI loading (or is unloading? I forget). But essentially you're lifting heavy boxes over your head into these 6-7 feet gaylords. These gloves will definitely be very supportive.",
        "These gloves did not last more than a couple days before the thumbs and fingers had holes in them. Absolute garbage. It was always the right glove for some reason. I sent the first pair back and they were replaced promptly but the second pair wore out just as fast. I didn’t bother sending them back again. I will not buy them again. I’ve bought a 10 pack of cheap gloves for $5 from Lowe’s Home Improvement that last longer than these gloves.",
        "I bought these gloves after being disappointed by 2 pairs of expensive leather motorcycle gloves. These are great. They fit properly (I bought Medium - the finger lengths and wrist are perfect) and they provide the right amount of padding in the palm to balance buffering the grip and providing a feel for the bike. Also warm enough for cool days. I may use a liner for colder days before I switch to my winter gloves (I live in the Chicago area). From the looks of them and the wear pattern so far, my guess is that these will last for at least a couple of years. Sure beats spending another $90+ on another pair of ill-fitting motorcycle gloves.",
        "These are my new favorite gloves. I used to use Mechanix gloves, and those are great. But after a month or two I like these even better. Just the right amount of padding while maintaining all the dexterity. Touch screen thing works okay, but that's not why I bought them. You can answer a call though and that's nice. If I need to type a text message though I usually prefer to take them off.",
        "For the price, these were a no-brainer. I had a pair of these at work that I loved so I bought some for personal use. Just past the return date expiration, my right glove ripped open exposing my hand below the thumb. I’ve sewed it back (see photo) and it seems to be holding up, but for a work glove.... that shouldn’t be happening so soon. The touchscreen part is a bit gimmicky, but will work if you have patience. I honestly think if they can perfect the touchscreen part in this glove, they can totally top the market for gloves in this category and price range. Has potential, but I currently don’t see it yet.",
        "Love these work gloves! They are a comfortable, precise fit with a velcro wrist closure that prevents debris from falling into the glove. They are almost impenetrable and have yet to tear even a tiny bit even when handling thorny brush or objects with sharp, pointed edges.This is not to imply that they are indestructible but, rather, that the gloves are well designed and well made, resisting damage from handling objects that would usually cause damage. Most important? They provide great protection for my hands. I haven't had a chance to use them in cold weather yet. I'll update my review after I have worn them during the fall and winter months.",
        "My hubby has short fingers and relatively small hands for a man. As such, he has a difficult time finding gloves that fit him well. The size small in these gloves fit him perfectly. The first day he used them at work, he came home and gave me a huge kiss and thanked me for finding them! He says they have excellent gripping abilities and keep his hands warm and protected while he works with sheet metal and glass daily. I highly recommend these work gloves for any tradespeople who need their hands protected at work. I'll be buying this exact pair again when his new ones wear out.",
        "Very Nice! I had brought these with intent for work, but once trying them on decided they would be more useful at home. Not too thick to cause overheating, but padded in all the right areas for max comfort and cushion. The individual padding for the finger sections is unique as they are spaced at each joint giving better flexibility and movement. The 3 fingers with special tips for touch screen tech is handy when tech interruption happens in the middle of work. Although I don't understand why my fingerprint scan won't work with gloves on?😁😁 Overall, great gloves and will be purchasing again when needed!",
        "There is NO insulation of any kind in these gloves. In fact, the mesh backs make them very comfortable during West Texas summers. These gloves are really comfortable and dexterous enough to wear for a lot of situations that leather gloves will be just too bulky for. If they were not misrepresented as being \"Winter Gloves\", they would have easily earned 4 or more stars from me. In fact, I am going to keep them to use when it finally warms up! # I have no relationship with this or any other company that does business on Amazon. I purchased this product wholly on my own and I have never been compensated for any review. #",
        "Comfortable and can access touchscreen. Amazing work glove. Update, What was I thinking??? These may be great for someone who handles boxes for a living, but I work in the Lawn Care industry with Grass, Weedeaters, and Hedge Trimmers. Since my last review, there isn't a spec of touchscreen material left. The gloves themselves still function pretty well though. Update 2 The gloves suck, the thumbs now have holes in them. THEY WILL NOT LAST. I have only had them for 3 months of use.",
        "Gloves broke THE FIRST TIME I put them on, which was today. I'm pretty upset because I purchased there's a little over a month ago and the window to return them has closed (I moved and haven't had time to try these out during the last month). The strap the Velcros the glove shut was never properly sewed on it appears, because only one thread ripped the others must have never been attached at the factory. Cannot use these without duct tape now",
        "I have been having an issue finding gloves to fit my hands. I am 6’6” and have ridiculously large hands. Buying gloves that actually fit me appropriately has always been an issue. These gloves literally fit like a glove! I selected the XX Large size and they were perfect for me. For comparison for other guys with large hands, I can palm a basketball and these gloves work for me. I have not tested these gloves for touchscreen compatibility because I use them in a occupational health and safety role on a construction site, so that feature was not important to me.",
        "I've purchased 3 pairs of these gloves over the last 2 years. They fit great and aren't as bulky and restrictive as standard leather gloves. In exchange they definitely aren't as durable, however I'm willing to trade some durability for the greater ability to use my fingers. I've used these gloves to cut down trees and clear brush, as well as split and stack wood. The fingers are the first to show wear and eventually tear, but given the abuse they've taken I don't know how they couldn't. They are also breathable, which is a huge plus when working in warmer weather. Great product CLC!",
        "I work in irrigation at a golf course and took a chance on these gloves to help me out. They are great. They give me the dexterity i need to get into smaller places, the touch screen pads work great so i dont have to constantly take them off to make/recieve a call and the pads on tge palms help with shock absorption. Also they are pretty durable. So far i have had no problens with them.",
        "Rating gloves is subjective – hands are like snowflakes, no two are alike. But, for my hands, these gloves are excellent. And when I take into consideration the price, they are more than excellent. The palm padding is very important to me, and it's perfect on these gloves. The fingers fit perfectly, and there's none of that stitching crap that can interfere with your fingers. And the gloves are remarkably flexible. It's easy to handle small items wearing them, especially given the great protection they offer. I hope this is helpful.",
        "I got these gloves on a lightening deal for a good price. They fit (and stretch a little) over my large(ish) hands. The finger tip grip work well and allowed for more dexterity than a typical workglove. My only issue is they've gotten pretty ratty looking after about 3 or 4 prolonged uses while building a sofa and working on my lawn mower. No tears or rips but they have kind of \"stiffened\" from sweating et. al. so it take a few minutes to break them back in. If they made it a little more breathable this might be a non factor. I would still recommend these gloves, especially on sale.",
        "I wear gloves for nearly 8 hours, 5 days a week, and these start getting holes in the fingers after about 6 weeks of wear. They're fantastic for a month or so, then the thumb and middle finger just fall apart. For the price I would hope they would last a few more months before needing to be replaced. If you need gloves for casual use, go for it. But if you need gloves for daily use and want a pair to last for months, then don't bother.",
        "These fit perfect! I'm between a XL and XXL so work gloves usually are tight or loose. I choose the XL and they fit awesome. Snug enough to have some touch but the padding is still there for protection. I'm really hoping they last... I'll update once they tear. October 16th Update: 16 days after purchase... Right glove has multiple tear... Thumb seam and wrist spandex/glove fabric... Left gloves vinyl? tips are already rubbed off so thus makes the tips are slippery now.",
        "These are great. I've been using these and the mechanix brand for a couple decades while shooting/archery and firearms and teaching shooting. These are very well made, and allow me to use my touch screen phone easily! Make sure you check your hand sizes, otherwise get several! Love that the knuckles take some bumps, and dexterity is still great! ! Cons- They are NOT slash resistant OR winterized in any way. These are too prevent minor issues while doing projects from yard through mechanics and shooting/archery! They do a decent job of protecting from cold /windy weather just dont get wet/ and understand they are not winterized",
        "I bought these gloves to work on a patio. Hardscaping is very wearing in gloves, and these unfortunately didn't hold up very well. When the finger tip area became worn after just a few days of using these gloves, the touch screen feature became difficult to use. These gloves wore completely through before we finished laying 180 square feet of our patio. They are probably best suited for jobs like yardwork and light construction, to protect from blisters and splinters. They just aren't durable enough for hardscaping.",
        "I am highly confident recommending this gloves. They are comfortable and durable. As a satellite technician having a pair of gloves that provides protection and comfort it is very important. This gloves fit perfectly on my hands, that I don't notice I have them on. I can place every fitting on a coax cable without straining or hurting my fingers with this gloves. I can screw on every cable to its port with ease and answer my phone without taking them off. At the same time it keeps my hands somewhat warm when it's cold outside. I recommend this gloves for anyone looking for comfort and protection.",
        "At first looks like an A product, think will fit perfectly to work in a warehouse facility. Fits really well and the touch screen works. Secondly I found some lack of grip, which I thought would come with time( only used for a week, got to be fair) so driving a forklift or a pallett Jack needs grip and endurance, I was using fingerless leather gloves before, and they get destroyed. But the disappointing moment was when using a brown tape to seal boxes it pulled out parts of the finger tips that makes the touch screen possible. Overall, fair to say, if that ain't happened, the time would tell if it's worth or not so much.",
        "I really liked these gloves when I first started using them in late April. They fit snug and seemed tough, although they did not keep blackberry thorns from piercing my fingers and hands, which was disappointing. But they could be washed and dried, did not shrink, and were working well until the other day I saw my finger protruding from the glove. The top had just work out, in not even two months as maybe three times a week, 2 hours a day use. I'm goign to look for a better paid now.",
        "I purchased the size small of these gloves and they are perfect for my crafty little woman hands. I've had trouble finding small work gloves (that aren't a tragic shade of pink - egads) that fit correctly. I do a lot of sanding and so far these gloves are just the ticket. They fit a little snug across the palm/thumb area, but I feel like the gloves will relax a bit after I break them in more. My hands (from tip of middle finger to wrist) are 6.5 inches long. There is plenty of room in the fingers, but if you have wider hands, I would possibly consider going a size up since they fit so snug across the palm.",
        "After five full working days of use, these gloves have exceeded expectations and passed all tests. I work with vehicle parts, and in wet, dirty, greasy conditions - all while using a scanner. They have not shown any wear, especially in the stitching, where other brands of gloves have failed miserably. I can also use the touch screen on the scanner while wearing these gloves. They dried fast after working in the rain this week. Good buy.",
        "It is double stitched in most places that need it, but along the sides of the palms and fingers is only single stitched. After only 2 days of decent use I already have a blowout on the side of the palm. I buy my gloves a little smaller because I like them snug, and while I was trying to pull them on to my hands I heard a couple stitches pop. All in all I dont think these gloves are good for daily work use.",
        "I ordered these gloves, Custom Leathercraft 125M Handyman Flex Grip Work Gloves, Medium, when I got a bucket pocket pouch, from the same makers. I like them for the fit and feel. I can wear them for quite a while, before having to remove them for a hand breather. They are snug, without being binding and are comfortable from the first time I pulled them on. The wrist closure is tight and is better than Velcro. I like them for four stars and my revisit this review and change it up or down as necessary.",
        "I originally bought these because I work with moving packages and thought these would be great because of the reviews and stars. These gloves are great compared to some nitrile covered ones I used recently, these gloves absorb sweat better and don't hold in smells. The gloves fit me great, but whenever I would go to pick up something I would have to do the most awkward stance to pick something up because the grip is non-existent. I was helping a coworker pick a heavy package up the other day and i had to make them put it down because the box was sliding out of my hands. Wouldn't recommend these if you need something with grip.",
        "I've used these for a couple weeks now for various tasks like yard work, and moving boxes and furniture. For these tasks, the gloves have worked great. They are fairly breathable and comfortable to wear for long periods of time. The sizing is accurate and they fit my hand well without being too tight. The touchscreen capability is just meh. If you really need to use your phone, just take the glove off. You'll save yourself some frustration. For light/moderate tasks, I can highly recommend this glove!",
        "These are restively tight (no, they aren't as tight as rubber/latex gloves) and I do personally prefer the Velcro closure at the wrist. They are padded at the palms, which is nice for work gloves. However, I would not necessarily consider these cold weather gloves (as the description implies). The work adequately if you are working (getting blood circulation going) and not immersing yourself in cold items (such as snow), but I would not use them for snow balls or a snow man. They will not keep your fingers warm if you are out in the cold and not exerting yourself. As work gloves, they appear to be more than adequate.",
        "I haven't purchased a new pair of gloves for a while. So when I purchased these. I had hopes they would last more than a week. So far so good -- with impressive results even for the week. Most of my gloves are ruined quickly due to the amount of boxes and other materials I deal with daily. These have held up to the task without any wear or tear thus far. The only reason I give them a 4/5 is because they are a bit slippery with various materials. Heavy boxes for example have the potential to slip. Regardless of that blemish, the padding provided by these gloves is an added bonus. I enjoy them.",
        "For how cheap it is compared to big brand names, these are one of the best gloves I have used, and I have been through dozens as an aviation mechanic. They are incredibly comfortable with palm and knuckle padding. My hands are big with short fingers and swell even more in summer or working heat, but the inner fabric stretches well, while my fingers ALWAYS have free unrestricted motion for the tight aircraft wing spaces. Simply feels like my hands are armored. A bonus - unlocking and using the phone at work without removing gloves.",
        "I got these before going to do weeds and seeds in Yosemite and they did fine. Were comfortable enough, was able to use my screen as necessary (although usually forgot I could because I\"m used to having to take the gloves off). There wasn't much water to worry about but I did notice they didn't quite protect me from thorns as well as I would've hoped. I'll give them 4 since they lasted the whole 4 day work trip, worth the money. But wish they had denser fabric.",
        "These gloves offer no protection whatsoever. They are thinner than my Grandmother's 50 year old knit gardening gloves. The material tears easily and it allows Rosebush thorns to pass right through to poke your hands. I will be going back to Harbor Freight for durable, quality gloves that actually protect my hands. I do not recommend these gloves to anyone that values the safety of their hands at all.",
        "I have used these gloves for cleaning up brush fire debris, including burned roots, limbs, sharp succulent leaves, burned leaves and other residue. They provide excellent protection for the hands. They are also very useful for more routine work of pulling weeds, gathering fallen pine needles and cones, etc., as well as working with the soil to create spaces for small plants and for picking fruit from thorny trees.",
        "Bought these for Relic hunting to replace a great pair of Mechanix gloves not made anymore. These gloves feel good and true fit for hand size. Only “con” I have is that the little finger on the gloves is 3/4 inch to long. Bought ones size down to see if that would correct the problem. No luck! Both a large and medium pair of thes gloves have the same extended little finger. Will probably go back to Mechanix gloves when these wear out.",
        "This is a well-designed and constructed glove, with good padding and reinforced stitching, but the leather palm is much thinner than expected and would probably wear through with heavy use. That said, it's grippy and comfortable, with a good balance between warmth and breathability, so perfect for routine jobs around the house and light enough to throw into a backpack for camping. After reading other reviews I bought a pair in medium and large, one each for my wife and I, which fit perfectly but one size larger than we typically wear.",
        "Touch screen tips are wearing out, threads are coming off. good thing it is double stiched. but I would think this would have lasted more than 1 year. I wash them in the washer and dryer on auto so that might have something to do with it. but dexterity is only mimimally compromised with these gloves. fits nicely. I am 5'7\" from wrist to middle finger is about 6.5 inches and the size small fit me perfectly not extra at the end or tight fit around the joints. the touchscreen was perfect before it started wearing out. I use these gloves almost daily for everything.",
        "I have bought dozens of these. I originally bought a few pairs at the Home Depot, and then started getting them through Amazon's Subscribe & Save program. For the money, they're pretty good. After a few weeks of use, they will start to show signs of wear, usually in the fingertips. The seems tend to give out after a while, and you either keep using them or swap them for a new pair.",
        "They're definitely comfortable but they won't protect from the occasional thorn. Will protect from ants, but a wasp had no trouble stinging the back of my hand while wearing these. The finger tips tore recently so I'll be replacing them with something else. The build quality isn't total junk, but they did wear out and tear quite a bit faster than I'd expect given the limited use. I bought these in 2016 and have used them for occasional yard work. I don't do my own mowing, but I do trim hedges several times per year and clean up flower beds.",
        "Do not buy this gloves unless you're going to have them only to look at. Maybe to wipe your butt that's only what they're good for. Anything else is pointless go to Walmart and you can find better gloves. I regret buying them for work they lasted a day. They are garbage.",
        "I bought these as a replacement for my boyfriend's lost gloves, and he was skeptical on their value and use. However, as soon as he put them on, he was a believer. He loved the way they feel (I think I ordered either a large or a medium). He does a lot of yard work and outdoor tasks, so gloves with a good grip are a must. No wonder they have so many good reviews! Well done!",
        "They lasted a whole week, approximately 20 hours of moving/placing rocks for a retaining wall. Each of the fingers with the \"touch screen\" ability (which only works half the time) has large holes in them. I liked the padded palms and the touch screen ability is nice when it works, but they are not durable at all. I think they'd be good for light to moderate work, apparently rocks are too much.",
        "I go through work gloves like nobody's business, they go through hell and back on a daily basis, I usually go out and but gloves 3x the price of these and they last me maybe a week or two before they are destroyed. But these gloves are absolutely amazing and especially for the price i haven't had a single tear rip or hole in these which is a miracle, I wish I knew about these before spending money on so many others, if you need a work gloves that's comfortable and also durable you really shouldn't hesitate on these!!",
        "Gloves started coming undone within one day and within the first week, the fingers started ripping through. Very nice gloves, unfortunately not up to the task as a \"workman's\" glove. Only reason I am giving them three stars is because the company was easy to work with and no fuss given when requesting a refund.",
        "Every other pair of \"large\" gloves since I've been a teenager have fit my hands well except for the fingers. They've always been too damn long. Now I'm not sure if these are right or all the others have been but. Who even cares!!! They fit, they fit, they fit!!! I've always wanted a glove manufacture to make gloves in M, L, XL and (Short, Medium OR Long fingers)",
        "Do NOT consider buying Custom Leathercraft gloves unless you are certain the size you order will fit. Keep in mind, you'll need to order 1 -or- 2 -or- 3 sizes up. I recently ordered a pair of gloves one size larger than usual (as recommended in the reviews) but the gloves were still too small. So small in fact, I doubt the next size up would fit. Thus I requested a return authorization from the shipper stating the gloves were defective. Regardless, Custom Leathercraft will only accept the return under their standard policy \"... we must recoup our original shipping cost to your address...\" and the buyer must also pay for return shipping.",
        "First time purchasing this style/pair of gloves, and right off top you can tell these gloves are not designed for any type of strenuous labor. These gloves are what they state they are general purpose, meaning very light duty work. Like mowing the lawn, or if you drive a forklift at work. But if you pull orders, or work with abrasive material like stone, these gloves will not hold up. I'm giving it three stars because I ordered extra large gloves but for some reason these run smaller then stated size. So get the next size up or go with a different brand.",
        "These are an idea thickness for supporting both yard and home improvement work. You get pretty good dexterity. The fingertips may technically work for touchscreens but they're too big to be useful for me. That's not why I got them though. These also aren't thick enough for cold weather (below freezing). But they're super flexible and even allow me to wear my wrist brace.",
        "Ordered these gloves as an alternative to the Reebow Tactical Military Hard Knuckle Tactical Gloves. Mainly so for easier use of the touchscreen while wearing gloves. The touchscreen functionality worked well, and the gloves did provide adequate protection for my hands. However, there was little to no grip for picking up items. Cardboard boxes slide right through these gloves and made them quite aggravating to use. Ended up found the Ironclad General Utility Work Gloves GUG-02 to provide far better grip, while keeping touchscreen capabilities.",
        "If your someone looking for a pair of light work gloves, will be your ideal fit. They are not meant for heavy lifting, construction, and gardening (small pricks will poke through the glove). These gloves are light protection for the inside of your hand. I do not intend to use these gloves for anything except for mountain biking. They do provide a nice grip and a fin layer of padding for the inside of your hands. I've used these gloves for 1 month to tighten down bolts and screws, only to figure out the stiching around the pointer finger and thumb are starting to tear.",
        "These started out great for the first week or so but quickly came apart at the seams at the sides of the fingertip area on a few fingers. Appears to have happened mainly because of the use of a thinner material in that particular location on the glove. Wouldn't recommend these for heavy duty tasks. I wasn't even doing hard labour with them or anything, I was moving boxes around, just wanted them to protect my hands from scuffs and unfortunately they quickly got several holes in them with fairly minor use. I really liked that they weren't bulky and fit my hands well, but a more durable material needs to be used on the problem areas of these gloves.",
        "I work at a shipping company so I'm throwing boxes all day. I needed some gloves to protect my hands because they were getting extremely hurt. I decided to buy these gloves because Amazon recommended them, and me and my dad absolutely love them! They have great grip, some protective padding, they hold a bit of warmth for those cold mornings and overall, they have a really cool looking design. If they ever break, which I don't think will happen anytime soon, I'm getting another pair.",
        "Second pair of these glove I have had so far and they didn’t last nearly as long as the older version. I am guessing it’s because the touch screen ability. Fingertip stitching let go but they lasted long enough to build a 12x16 shed, vinyl siding and roofed it so cant complain. Will buy again for the next project and just expect them to be a consumable now.",
        "I've been using these for months now, renovating the house, and I can't stop raving to my husband about the cushioned grips. They're so comfortable I took to wearing them for yoga, too, lol. I've even worn them for touch up painting because when I don't want to dump a bunch of paint in a tray I just carry the can around in my left hand. The cushioned palm makes that way more comfortable and increased the amount of time I can paint in one sitting. Plus, now I can tell which pair is mine at a glance because they're so colorful compared to my husband's.",
        "I really like these gloves. They are comfortable, fit well, let me use my phone without removing, and pretty good at protecting my hands. I tried to wear them to rip out some blackberries though, and the blackberries won. I ended up switching back to my cheap $5 harbor freight gloves as they were more impervious to the blackberries. Still a good set of gloves.. well worth it.. I use them 90% of the time.",
        "These gloves look great and are actually very durable, I personally use them mostly for moving wood but I have also used them while working on my car, and moving boxes. They do not really protect from heat or cold too much, the mesh on the back of the glove lets the outside temperature in, but they are still some of the best gloves for the price!",
        "I've been a huge fan of these gloves for a while. I buy them for me and my colleagues and clients. They're comfortable and pretty durable. Sometimes the thread let's go but nothing unfixable. They also work on a phone screen although I don't use that option that much but sometimes it comes in handy. I am a professional crafter and use them for making candleholder or wood working, picking pallets apart and spraypainting and they are very versatile because of their flexibility",
        "Most comfortable gloves I ever have but it doesn't last long. Touch screen sucks as well. It worked only 2-3 days for touch screen future. It is kinda expensive if you get small size for 15 dollar and it lasted only 1 and half month for me then I had to get a new glove. For people who want most comfortable glove they can get,this is a glove they need. For people who want to save money and pay 1-3 dollars per glove,this glove is not for them. Little overpriced for a glove that doesn't last long.",
        "I purchased these gloves for hiking/camping. Ii really like these gloves. They provide protection from the elements while not making my hands sweat. I would really like to love these gloves but the problem I am having is they just don't last. I am on my third pair and continue to get holes in them on the index and middle finger. They are not coming apart at the seams or anythi by like that. They just seem to wear holes on the inside tips. For $12 they are a great pair of outdoor gloves and I will continue to use them. I have tried the Mecanicx gloves and in my opinion these are much better.",
        "These gloves are fantastic. I purchased these for walking my dog, a 165 lb Alaskan malamute that is hard to handle. I have found myself wearing these gloves for many other daily tasks, like taking out garbage, cleaning up in the yard and gardening. These gloves are especially good for trimming shrubs and rosebushes where you need flexibility and dexterity but you also need protection from injury also. These glove provide protection and provide easy maneuverability and flexibility. They have padding where needed and make daily task, especially walking my hard to handle dog, easier.",
        "I just do yard work and some woodwork in the garage. These things are already wearing out. Honestly, its so hard to get a pair of gloves that last. Best ones i've ever used are real leather, but you lose so much dexterity in your fingers with those. Someone could get filthy rich making an indestructible work glove. Can it be done? Has to be possible.",
        "Received gloves well enough. Package not tampered with arrived quick. Good fit stray away. Would recommend that if used for work as I do, then it may be better to go a slight lesser size. For a nice, snug yet comfortable grip. Decent quality: durable but not durable enough for constant (driving forklift) steering wheel rubbing that may wear out over not so much time. Price: PRICED WELL for me. I have already gone through 2other pairs that were not as comfortably or as reasonably priced as these here. Even considering the wear that DOES occur over time I would certainly buy again.",
        "Can’t get enough of these things and can’t tell enough people. I always have to use my phone with my nose while working because touch screen gloves never work. These are great, work so well! I have super long fingers so gloves never fit right but these contour to the size of my hand so well and the cushion keeps me from getting hand pains when I work long days. Buy again for sure! (If they ever wear out-but they’re holding up great compared to my other gloves.)",
        "Half way through a patio job they are pretty crapped out. Durability is poor, but I think that is common in touch screen gloves. That said, they were used quite hard considering the wet, dirty stone silt conditions. Still not done with project, but gloves are trashed. Holes in thumb and fingers. Has a lot to do with the roughness and sharpness of concrete edges.",
        "I was shopping for a winter or insulated glove. These aren't them. By the feel, they'll be a good summer glove. They're comfortable too. As you can see in one of the photos the back of the hand is pretty thin, as you can see the light reflecting on the table through the glove. The webbing or in-between the fingers is thin too. The palm side of the fingers is also thin. I don't suggest using these for something like sheet metal work or messing with courses materials like cement blocks.",
        "My husband loves these gloves. I’ve bought two pair not because the first pair wore out, but because I was afraid they wouldn’t be available to buy again when they wear out! He uses them for all types of outdoor work and also at his workbench. They are durable yet they aren’t too bulky. He claims they’re the best work gloves he’s ever had...definitely worth a try!",
        "I'm a female who likes to do DIY and gardening, and these gloves fit me well and the Velcro closure keeps then securely on. I like the stretch that gives them flexibility to move your hands as needed. The reinforced palm area has stood up to thorny bushes and household DIY projects so far. They are fabric, so they do get wet. Overall, very happy with the purchase.",
        "I bought these gloves a year ago and it's time for new gloves. The pair I got a year ago is starting to wear down after having seen their fair share of action. I keep looking for a better pair of gloves and ending up back here thinking I should just buy these again. I'm a woman with small hands and need at least moderate protection. Looking for construction level gloves in my small size has been challenging. These gloves seem like the best compromise for the price I can find. I'll probably buy these again and keep looking for something better.",
        "The size that i got was a medium due to the impressions that i got from reading the description , i got a medium sized which fit too snuggly and the product didn't have the grip that i thought it would have. I returned the product but i would recommend if your looking for something for light use but not for more intense long term work such as landscaping,logging or farming , it will be fine for moving boxes here and there thats it .",
        "Like many others, I had purchased these gloves years ago, and recently ordered a replacement pair. I loved these gloves because they were durable, comfortable, and fit my hands perfectly. That is no longer the case. Both gloves pictured here are size small, but there is a significant difference in size between the two. The quality isn't even comparable, the padding is more sparse, and these \"tech friendly\" fingertips feel weak. I am very disappointed, as it took me a long time to find a perfect pair of gloves, and they no longer manufacture them the same way.",
        "As everyone has said, previous model was much better. These ones are uncomfortable to wear on the long run, and aren't form fitting as the last model. Mine lasted me 3 years for the two pairs of last model. The new ones are already tearing and I've had them for TWO MONTHS. Lame.",
        "These are good generic gloves, and I do believe they're also available for purchase at your local Home Depot store. Might be under a different name, but seemingly identical in construction/fabrication. Oils/water readily go through the gloves, but would imagine washing with a light Dawn dishwashing liquid and warm water solution will readily clean the gloves without degrading the materials.",
        "They looked nice on paper and I liked the touch screen capability so I decided to steer from my ironclad box handler work gloves. Mistake. They are slippery and lack grip. A bit too thick. Fit my hand kinda funny. Touch screen doesn’t work well. Perhaps they need a period of breaking in, but I want going to put that kind of time in, I just kept them as a rain backup and purchased a new pair of Ironclad.",
        "Bought a pair of these for myself last year and my friend has been helping me with work in the backyard. He was using my gloves, which were a bit too small for him, so I bought this pair for him in a larger size and he really likes them! His only complaint is that they're not waterproof but for the price, you can't expect everything! My only complaint is I wish they were just a little bit longer. But they're really held up. As I said, I've had mine for more than a year and they're still going strong!",
        "Have purchased four pairs. Over the last two years. First two pairs were great but the two pairs purchased recently both had a manufacturing defect in the seams on fingertip edge. Too bad, the first sets were amazing.",
        "I tried 2 different sizes working L & XL. L fit snug at first but were est for my hands. XL were oversized but usable. The gloves last about 2-3 weeks working as a freight handler. Labor and handling materials by hand - 10%, forklift operation 90%. You would think they would last longer. The quality and protection is good but the stitching in the reinforced fingers and palm area starts falling out and wearing harshly. Price versus durability and time used does not seem to correlate value to me.",
        "Going on searching for wood is a pain with gloves, but these gloves make that and wood-working so much easier. I've been using them for a couple of months now and love them. My only thing is you probably don't want to use them weeding as small thin weeds can get in and prick you. I need to find a better glove for weeding.",
        "These run very small. If u wear a medium to large size normally, u should order an extra large. I normally wear a medium size glove but even though the large is comfortable, I would order a X-large so my husband could wear them too. They are very good quality & look durable and are comfortable but they just don't fit loose enough.",
        "I bought these for knuckle protection while splitting wood. Overall I’d say they are good enough, they offer flexibility and protection which was what I needed. There is a weird seam on the inside of the left pointer finger that is uncomfortable, I’m not sure if the glove is defective or if I am just a princess.",
        "My husband likes his gloves tight as they usually stretch with use. I read reviews and decided to go up in size to a large and they were to long in some of the fingers. Normaly would return but decided to gift them to some family members. They seemed like nice gloves for the money. He likes his blue harbor freight ones! Lol Husband: 5'6/160lbs. And a medium would have been perfect.",
        "I mainly rated these gloves based on durability as I don’t use them for touch screen capabilities. These are my go to work gloves for outdoor work and home maintenance. Other gloves have ripped in the past, and so far these have held up really well. I like the way they fit and don’t have a large Velcro strap around the wrist.",
        "I just received these a few days ago so I haven't used them a lot. However, I can tell already these WILL not hold up to Heavy work or heavy gardening tasks. The finger are too long for my hands so some of the finer motor skills arent able to be accomplised. The palm and finger reinforcement are not that thick and show signs of wear after 3 to four days using them. I have purchased more durable/better fitting gloves at Walmart for alot less money.Four less money I have",
        "These might work for very light work or driving gloves but they did NOT work for me. Biggest gripes: - padding inside too thick weakens my grip and causes more discomfort when operating tools. - poorly made. Velcro fell apart on wrist in first hour of use. - too smooth and slippery grip for my work. To be fair many gloves are slippery like this. Just not good for me.",
        "For ~$10 they lasted as long as I expected them to. Got them in December and they lasted until now. The \"touchpad\" fingertips are all worn out so they don't work anymore. A few of the finger tips are also growing holes in them. Though, its understandable how there are holes growing as i use them to open freight boxes up for work. These gloves don't really protect from below 0 weather, but they work well enough to keep my hands warm at near 20F and higher. I haven't used them for anything needing heat resistance so not sure how good they are there. They aren't really water resistant though. They soak up water quickly.",
        "Gloves fit me perfectly and were very comfortable. I've used them for a major project involving demo, framing, electrical work, insulation, and sheetrocking and gloves have been exactly what I needed. I've done similar projects in past without gloves and my hands were always cut-up and what not, but with these guys on, no issues. I was also able to use my touchscreen phone with gloves on, which was a nice bonus.",
        "I ordered a pair of these a while back and they were perfect! They fit good and they lasted for a good while...BUT THESE ARE NOT SAME GLOVES. These are junk? What happened? They fit the same but they are made of crappy material now? It feels like I have to be careful putting them on or Ill rip them. These might last one day? I am all for improvement but cant you guys (CLC) at least offer the old pair? I WORK, I don't play on phones and tablets all day. Please fix, maybe name these Handyman 2 n bring back the GREAT PAIR of gloves you guys (CLC) used to make."
    ]
}