{
    "entity": "Safety Work Gloves",
    "text": [
        "My first Original mechanix were awesome. This pair is same quality of Chinese fakes. Regular finish. Deformed fingers. Loose threads. Very big thumb. It's a shame.",
        "Great gloves to use when I go on call outs. The medium is just the right size when I am firing on the range with my Glock 17. The finger tips do not obstruct my trigger finger nor do they rub up against my weapons light. Also bought a large for my motorcycle and work great! Review Update: I bought a size Large for riding while on my motorcycle. The Velcro on the wrist has started to come apart and I have had them for less than 3 months. I have only used these while riding on my motorcycle and nothing else.",
        "So far so good. I use these exclusively when taking my pistol to the range. My Walther PPQ can rub your thumb knuckle skin down very quickly and I prefer to not have massive amounts of lead dust on my hands anyway. That being said they are very comfortable, they breath well, and most of all provide stable grip and aid in shooting comfort. They are thin enough to be able to hand reload the magazines, and would be great for lite utility tasks as well. I would not recommend them for heavy duty type tasks as thats not what they are geared towards.",
        "Fit is snug, as it should be for tactical applications; and provides sufficient \"feel\" to safely manipulate firearm controls or perform tasks requiring some degree of precision. Subtracted one star for the pointless tags (as seen on the product picture): the \"Mechanix\" logo is plastered everywhere on these gloves- why add the stupid logo tags? They're stitched clear through the outer seams, as well- so you'll feel them while wearing the gloves. Cutting/tearing them off won't address the stitching- and will likely shorten the life of the gloves if the stitching is removed (you'd just open holes in the middle of the seam). They're otherwise great gloves, except for those pointless tags.",
        "I love these gloves for what they are. Used them in corrections for a bit, use them for coaching to stay warm as well as when students are having behaviors. Work pretty good as hand protection, wouldn't reccomend for inclement weather or being in rain/snow for long but otherwise great. I've used for things like airsoft, paintball, and the shooting range. They washed and air dryed great.",
        "I use these on the farm working as well as when I’m working on my vehicles. They have saved my hands wonderfully. I have hands they tear up easily and these help prevent damaging them more. I also use these for working out and they have great grip.",
        "bought a pair while in the middle of a paver patio installation. The gloves were wrecked by the end of the first day of use. brick, rocks, aggregate, stone, concrete, all rip this glove like your hand was covered in paper. Don't get me wrong, I had a pair that lasted YEARS, but it was because I used it for extremely light work. Day one, destroyed my old gloves, bought these, destroyed same day, and finally went out and bought the iconic \"dad\" gloves. Those things lasted 3 weeks of handling brick, and cost about $4 a pair",
        "I've had a pair of mechanic gloves for 5-6 years before I bought these. I finally wore my old pair out and bought these, and the quality on the new ones if far less than the old. These feel cheap, palm feels thin and fragile and the seams are rough on the inside. I'm positive these will not last like the others and I will not be purchasing them again. They are only 1 step away from being generic store brand gloves at this point.",
        "Love this gloves i use them for many things. And work and feel great. I know there thousands of brands out there and many people have many different ways of thinking but to me this is my favorite brand.",
        "I love Mechanix gloves. These all black ones are perfect for me because they're stylish and durable!! The best combination in my opinion. Absolutely worth the money which is only $20! I'll recommend these and any Mechanix gloves to anyone.",
        "As always, Mechanix gear is the toughest glove around. Perfect fit, got these for the bug out bag but I have been wearing Mechanix Wear gloves on the job as a heavy equipment mechanic since they came out. I have a pair of the Impact 2 gloves that I have been using for over 5 years. Soaked in grease and oil, no problem, hand wash in the sink with Dawn, air dry and good as new.",
        "I've owned multiple colors of this glove for various purposes. One pair has worn out after about a year of yard work; mostly due to thorns and sharp rocks. Protected me when I accidentally bumped into a campfire coffee pot; letter partially melted but glove still functions good.",
        "I've heard great things about Mechanix wear. Their quality is nice, don't get me wrong but their straps are just awful. My MPact 2 have the same problem. The seams start to rip out as well as the \"velcro\" or whatever technology it is, does not stay stuck so I'm constantly readjusting the wrist strap. These were a bit large on me so definitely use the sizing chart. They do not keep the cold out. These are more for light protection. I don't notice an improvement in grip either. My primarily use for glove is handling boxes. If you are looking for something with grip, I'd recommend Ironclad, specifically their Gripworx or Box Handler model.",
        "I've tried all kinds of work gloves. My job is very hard on gloves and I usually bust through them within a couple of weeks. I cannot use thick leather gloves because my job requires fine tactile feedback that I cannot get through thick leather. These are by far the longest lasting gloves I have owned for work. They last me on average 6-8 months. Very comfortable. Machine washable too. They have seen a lot of hard use, friction, grease, dust, metal filings, and keep on going.",
        "Not my first pair of Mechanix, but I have to say I was very disappointed to put holes in these with about 3 weeks of use. Holes formed in the index finger (palm-side) and expanded very quickly when the gloves were wet while working. Definitely disappointed in the quality of the palm-side material.",
        "I have always used gloves while I work. From working on cars on the weekends, to my day job as an electrician. Most of my co-workers hate using gloves because of their experience. However, these gloves have converted the non glove users. I have used a number of different gloves and there are some that a better than these for certain jobs. However, these are the best all around gloves I have ever used. The palm is thin enough to make for a great feel while still providing the same protection as leather palmed gloves. If these ever rip or I lose them, I will order them again and again. I will never use another glove.",
        "fingertips wore out and exposed my fingers in less then 3 months, I am a medical courier and use them to protect my hands while driving and carrying boxes etc. i can only imagine a mechanic or someone with a much more rigorous job would wear them out faster and since that is who they are designed for my only thought is they are meant to bilk more money out of people who are going to have to replace them often",
        "As an active duty soldier, I use these gloves for everything. (even though I'm not supposed to) Mountain biking, working on my car, camping, landscaping, moving, painting, physical training, shooting, etc. I've only ever ruined one pair by falling off my bike onto a bunch of rocks which poked a hole in the palm. For $15-$20 you can't do better. They're comfortable, great fit, light weight, super durable, sleek, reliable velcro fastener, extra thick where you need it around the thumb and index finger. Overall the best pair of gloves I've ever had, I own several pair and will never deviate from Mechanix brand.",
        "Got Medium size after measuring myself. It gives me an awkward fit. It will do too much pressure on the width but then not so much on the finger length. It is the first time I use gloves outsize winter gloves so I guess it is a matter to getting use to it. I didn't have problems loading magazines even in 22LR.",
        "I have owned Mechanix gloves for quite a while, they are the only gloves that I have found that fit my hands perfectly (no dead space between the tips of my fingers and the gloves, my palms don't swim in the gloves). In the fall the mechanix gloves keep my hands adequately warm without preventing me from working with my hands. In the summer, they seem to stay cool enough to remain comfortable, while maintaining good traction with gripping.",
        "These are great light duty gloves that are a definite improvement over the Wal-mart specials I used to buy. These gloves will not save your hands if you work in really cold or wet conditions or with heavy duty machinery - if that's you, do your hands a favor and pony up for heavier duty gloves. What these do offer is a good fit, touchscreen friendly, breathable material and cool, tactical looks. Recommended for dry, light duty work.",
        "I've now owned several pair of Mechanix gloves over the years and they're better than advertised. I've used mine for everything from winter running to working on a cattle ranch where a rugged work glove that doesn't impede dexterity is a necessity!",
        "Cheap, easy decision for Motorcycle gloves. Fits great, cools the hands at speed, generally a great option to the super expensive name brand motorcycle gloves.",
        "Great glove overall. Fit, grip, size, except it wears quickly. I have attached couple of pictures after 2 month it has a hole in the finger tip.",
        "I wear these everyday at work and they are great. I recommend going to a store an trying them on for size before you buy special colors. My department requires the all black ones but no stores locally sell them. I also recommend for police use, using a smaller size than you would for general work use. I wear both large and medium. The Medium gloves are better for searches and tasks that involve dexterity Because they are tighter to the hand.",
        "Meh. Relatively thin gloves (summer weight), but a fair amount of material at the finger tips. Uncomfortable for fine motor control. Definitely doesn't \"fit like a glove\". Will keep them, but won't buy a 2nd pair, and wouldn't recommend them for others.",
        "EDIT: After a year of use - taking away 2 stars, the durability of the Mechanix Wear gloves is not what it used to be. My previous pair lasted almost 7 years before they began to fall apart while this pair has barely lasted a year. Disappointing Original post: I've owned many different all around work gloves and these are by far the best, they fit great and have good tactile feel. Very sturdy construction and have held up well over the past year for all tasks.",
        "These gloves fit really well, are extremely durable, and look great. I have been using these for over a year now and have put them through some pretty hard use. They are holding up great. I find these gloves give good protection while allowing good tactile feel. The material on the palms and fingers is thin yet strong. I use these gloves when working with my dog and also when I go to the shooting range and it's cold. When they get a little smelly from use, I just throw them in the wash and they come out clean with no issues. I highly recommend these gloves.",
        "These are great gloves, I use them for everything. I keep a pair in my jacket at all times. They are great for working on vehicles, woodworking, metalworking, tree trimming, shooting, etc. I really like these and I own multiple pairs.",
        "Bought these for crossfit type workouts and they met all my expectations. Comfortable, good fit and easy to put on and take off. The grip could be a little better otherwise I would have given them a fifth star. I have only worn twice so I cannot attest to durability yet. I would recommend.",
        "Great quality and the fit is awesome. They show you how to measure your hands. Before my son always bought large. With these he wears a medium and he was amazed at House well they fit. Wil be ordering a few more to put back just in case they stop making them. That’s how much he liked these gloves.",
        "I got these to bring to the shooting range and to drive with when it's cold out and they are great for both purposes. I have good size hands and the medium size fit just right, snug and form fitting but not restrictive. The glove has just enough flex to allow full range of movement but still allows me to feel the safety and trigger reset on my gun and the grooves on my steering wheel while driving. I would recommend this to a friend and plan on purchasing more in the future once these wear out.",
        "These gloves are extremely comfortable. I use them on a daily basis in an automotive shop and they hold up very well. These gloves provide plenty of protection while still allowing the user to use his or her hands like normal. Many other brands limit dexterity and make it very hard to work on things with the gloves on, but these Mechanix Wear gloves work great!",
        "I've owned a pair of mechanix gloves in the past and I don't remember them falling apart so quickly. However, that was over a decade ago. This particular pair didn't last even a month before they started falling apart. I've only used them for working outside while chopping and stacking wood. I'm sure I can get a little more use out of them before they've completely fallen apart. I've already made a purchase for a completely different pair of gloves. No more mechanix for me.",
        "Mechanix gloves. If they fit your hand, these are a great all purpose glove. I have a different pair for doing automotive work, outdoor work, and a pair for doing \"clean\" outdoor tasks, such as photography. The sizing is fairly consistent, but you might find slight variations from glove to glove. However, in comparison with other work gloves on the market, these are the best thing to provide you very good dexterity and protection and at a great price.",
        "I bought these to use for three gun during the \"cold\" texas winter. They keep my hands warm enough for short periods, and maintain enough dexterity for mag changes and firing. They do also help with hot barrel grabs, and I intend to use them on shotgun stages even during summer. Minor complaint: the heat protective material does not cover the full flesh between thumb and index finger, and can lead to some unexpected heat on a rolled over shotgun reload if you aren't careful.",
        "I've been really trying to like these gloves. For the longest time I wanted to get them. The first week of wearing them they started to unravel which was really disappointing after reading such great reviews. I have a pair of military issue gloves which have made it through a deployment and some and I thought this would be a step up (seeing how our gear is made by the lowest bidder). I'm returning these, god knows I tried to like them.",
        "2 Days of use at a fairly intensive construction job, and multiples holes developed on the fingertips and palms. Great if you have to move feathers from place to place one at a time, bad if you have to do anything rougher or heavier.",
        "I had these gloves for almost 6 months and put them through a lot. I got a tear in one of the fingers along the stitching but considering what I put them through every day for work I think they performed well. Also if you wear these with jackets with cotton cuffs the velcro can cause pilling on your jacket.",
        "I can use these gloves with a touchscreen. They fit relatively well. We'll see how they hold up to moderate use over the next few months. Bummed out that they are a little short. If I went with the Large then the gloves would have fit length-wise but not width-wise. Okay! After a couple months of moderate use I have to say I am disappointed with the quality of the gloves. See pictures of details.",
        "I work in a warehouse for a retailer, I use these while driving powered equipment and replenishing goods on the sales floor. No grip, but no problem, I got these strictly to avoid cardboard cuts. Measured my hand per the chart, fits perfect via my measurements. Wore these for a month straight, 5 days/45 hours a week... No rips, no tears, the velcro isnt coming unstitched, they're still as new. I'm not delicate or gentle with them either. I treat them the same as I would a free pair. Worth the 15 bucks I paid.",
        "I have used these gloves for many years. They fit very well, and are long-lasting. No glove works forever, but these are better than most. I use these gloves for general wood/metal/ceramic work. I don't use these gloves for dirt, wet or chemical work. I like the feel of them, and the way they fit my hands. I also like the muted style of these, the \"Covert\" type. You can find them in other styles and colors. Just be sure to try them on for yourself to decide the size you like.",
        "I love these gloves. When I hunt geese in the fall I wear these gloves and they keep my hands warm and yet give me great dexterity for reloading. Great gloves for target practas well",
        "These gloves have excellent fit and dexterity, which for me is the most important factor in a glove. I have been using these gloves for over a year now, and the overall durability has been decent, but I don't use them for anything really abrasive, like moving rock or lumber. One pair I use for auto-mechanical work, and the only worn spot after extensive use is the hole I burnt in them from a hot exhaust pipe. The one big flaw I have found is that the velcro wrist closure wears out after just a few weeks of daily use.",
        "They fit like a second skin and are very durable. The gloves can take a beating and don't fall apart. Balance is the key with the thickness, not too thick or thin, so you can handle working on your car and operate your smart phone with these.",
        "I've been a cop for about 5 years now and haven't been able to find a good glove for everyday use. I've tried leather glove, batting gloves, and football gloves, but none really did the job, and some of the name brand gloves were about $70. These gloves seem to be perfect. Good snug fit and high quality. I'm comfortable driving, shooting and doing anything else the job throws at me with these gloves.",
        "I'm a theatre stagehand and go through gloves fairly quickly. I purchased these mechanix as general light duty gloves for work; I have thinner, thicker and temp resistant gloves for other specific tasks. I used the company sizing chart and the gloves were the perfect snug, but comfortable fit. They didn't breathe very well, had less finger dexterity and sensitivity than I like and wore out a little faster than my average pair of gloves. On the flip side, they were very affordable and comfortable even when they began to wear in.",
        "These are hard as nails and ideal for an 11B. Wore them all day every day throughout a summer training cycle and a JRTC rotation. They stink something awful at first when they're damp but the durability is worth it. Wish I'd had them on deployment because I've blown out every other pair of gloves I've had. One of the very few \"hard use\" items I've purchased or been issued that I can recommend to others.",
        "ideal for garage usage, downside is that the the quality of stitching on my finger tips was not amazing. this makes it harder to use it for smaller things.",
        "Fitment was perfect and the gloves are very comfortable. I prefer something that are the most minimal and these fit that as well.",
        "While they feel nice and fit very comfortably the tips of the fingers are beginning to tear after loading a few hundred rounds into my mags. It does help to avoid finger pain but I was hoping for more reinforcement on the fingertips. Not bad at all but also not the best for my particular needs.",
        "I tried these gloves on a recommendation for Youtube Nuntenfancy. They make a great shooting glove and is the first glove I think I have had that actually is sized correctly. I am generally a Med sized person and do not have a large hand. But every glove I have ever bought has had to been a large size. I ordered this glove in Med it the fit is perfect. I where them shooting in cold and hot weather. Have gotten them wet and the dye does not run and stain your hands like the 5.11 gloves I used to use. I have used them for several months now and they hold up very well.",
        "I ordered these gloves to use as shooting gloves. I used their fit chart on their website and was a medium. When I received the gloves they were a little tight which is fine for my intended use. Can't comment on longevity because they are still new but if warmth is intended use I would go with a heavier weight or Goretex. I think at the price point here on Amazon you can't go wrong.",
        "These Mechanix Wear gloves are pretty good. I bought them for a marksmanship class I took, where I wanted a little hand protection from the rifle sling. They provided that just fine, but could probably have used a little more padding. Otherwise, your ability to handle and manipulate objects is much better than other types of gloves, and I really don't have any complaints otherwise.",
        "Very fast shipping. I love this gloves. Perfect riding gloves",
        "I wear these while shooting pistols and rifles. They made me a better shot, grip equals control, control equals accuracy. They absorb summer palm sweat and warm hands in the winter. Very good movement, probably not among the best but if that's what you're looking for in the first place, you probably wouldn't be reading this review. Amazon has best price, as always. Buy a prime membership!",
        "Good gloves. They lasted much longer than my Kobalt gloves. If you get them in the \"Covert\" style it helps hide all the branding. If you wash these kinds of gloves (any brand) make sure to air dry them. I've found that putting them in the dryer, even on low, weakens the faux leather material and causes gashes to appear.",
        "You can't go wrong with Mechanix gloves. I use them for everything; from moving items, work around the house, work on your vehicle, and even handling sensitive items prone to skin oils and perspiration. They fit as expected and are durable.",
        "They are ok, don't really know what the big idea behind it is. My glove size is medium and it has been the perfect size with every other glove, but not these. I don't really use them after using them for about a couple weeks, they feel ok, but it feels exactly like my generic bike gloves that were a tad cheaper.",
        "I read great things about the Original Mechanix tactical gloves. Pretty much legendary. Maybe the pre redesign gloves were winners but the new design has a major flaw. The velcro closure has no gripping strength. It often opens up by itself. It appears that the new rubber wrist straps, which the fuzzy side of the velcro closure is attached to, contributes to the problem. I'm going to try and replace the velcro but, why should I have to? Hey Mechanix, when you redesign a hall of fame item, do some product testing before going into production.",
        "This is the first pair of gloves that i have gotten, that I have not wanted to cut the pointer finger and thumb off. So I could work the safety, magazine release and changing magazines out. The material of the gloves are extremely durable, I wish I had found the gloves years ago.",
        "This item is very good- exactly what I hoped for. Thank you.",
        "Very comfortable. Very durable. Very subdued color (black on black). Keeps my hands warm when it's colder. Keeps my hands safe when I'm doing something potentially dangerous. Keeps my hands clean when I'm doing something a little dirty. Plenty of dexterity for anything I may need to do (pick a pen up off the ground, load a round into a magazine).",
        "They work, they keep my MLOKs from chewing up my hands. Only used them for about 1000 rounds so far, but they're still holding up very well. Great deal for the price",
        "These were a perfect fit, with good grip. They do stretch just enough to give a good snug fit. The tab go pulling them on is handle when you already have one on. I've only had them a week or so but the construction seems really good and I think will hold up nice the future abuse.",
        "gloves are the best. have used many different brands over the years. these rate the best. good company who got them to me in 2 days.",
        "I bought these for shooting as one of my grips is tough on the palm of my hand. Work well.",
        "I drive a big ass bus. These are perfect for driving the said big ass bus. These are also perfect for commuting by bicycle in temperatures down to about 40 degrees for up to 10 miles. Unlimited miles above 50 degrees F. Anyway, I'm on my 2nd set. First set lasted a year with daily use which I thought was very good.",
        "These started coming apart at the seams within a few uses. They were never wet, used very roughly, etc. They are nothing like the first pair I owned. I'm exchanging them but if the replacement pair is anything like these they are going back also.",
        "I wore these for about two hours before it got way too hot, and then i got oil all over my hands working on my car. still, it's pretty good at gripping and while i was wearing it, i didn't get as many cuts and scratches. I recommend it if you don't sweat too much from your hands",
        "I use them daily for pulling drops as a cable technician and they are holding up. Not super grippy but that’s my fault on the style I chose.",
        "Best gloves out there. Comfy after a little use. Durable leather and mesh fabric. Blacked out so no loud logos standing out. Good fit. I've owned 4 pairs and keep buying them.",
        "Nice glove but stitching at web between fingers started coming undone after a few weeks of light use. I feel like last pair I bought was way more durable.",
        "the glove is very nice I am not happy with the strap on the back of right hand or left hand because they keep coming open. I drive a school bus and when the glove comes open it very distracting. You need to put some double strength on it so it will stay fastened. I would like to get another pair but I am hesitant because I can not deal with the straps coming undone all the time",
        "Always happy with these gloves. Have had three now...These seem to be a bit thicker than the previous and that needs a bit getting used to, especially when grabbing screws. Not sure why these are thicker...They are the same exact model as the previous ones I owened.",
        "Sent me a size too small but worked out because they fit just right! I am Policeman and wear these when needed at work, so far no complaints and they look pretty cool!",
        "Great glove, form fits well, size is good, wear is good. I use for general use around the shop/yard, these are fairly easy to get on and off, strap tends to be a bit odd with my watch, but great gloves overall. I have excema on my hands and these do a pretty good job of protecting them from further damage. I recommend these.",
        "My adult son loves these gloves! I gave him a pair last year for Christmas and this year he told me he wanted another pair \"as a back up.\" He uses them for working on things and has even worn them biking. So if he wanted them two years in a row, that's a pretty good review in itself!",
        "Whether its for use in the shop, just for keeping your fingers warm in the cold, or for use downrange; these gloves can do it all and then some. Mechanix is a trusted name and with that, you get a valuable product. This is my third set and I love them.",
        "I use them when shooting at the range. They fit well, and they prevent my hand oils from getting on my rifles. I liked them so m,uch I bought another pait because I realized they provided the grip and protection I needed for numerous others tasks around the house",
        "OK gloves, but nothing special. Purchased because I was getting other items just to use for general yard work. Same type could be purchased at local stores.",
        "I do a considerable amount of work outside and needed a good pair of work gloves. My husband and I split/stack wood, garden and clean up the yard in the spring and fall. My husband has the same brand of gloves and I was impressed by how long he's had them. I've gone through many pairs of cheap work gloves and wanted a pair that would last. So far so good!",
        "Used for Law enforcement. Haven’t had long enough to decide if they work well enough. For now it does it’s job.",
        "Just a great pair of gloves. They'll hold up great for anything from building a shed to fighting crackheads.",
        "this works exactly as i hoped it would. i would echo other commenters in saying that the gloves run a bit on the smaller size so if there is any doubt then order the larger size. i don't think of my hands as particularly large but the gloves are snug across the palm.",
        "Although our experience with work gloves is limited, the Mechanix Wear products have been great. My husband and I have used them for yard work, assembling furniture, and even exercising in the cold. The gloves provide excellent protection without restricting your motion too much, and seem to hold up well after washing (delicate/air dry).",
        "I cannot review these gloves highly enough. Don't buy Oakley's, get these.",
        "I use this for my work as a cable installation tech and they are great. Between feathering coax cable shielding, assisting drill bits/screws and just general work through the day these gloves are great and stood up to a lot before wearing out. Had to replace them about 4 months later but that is completely reasonable with what they undergo each day.",
        "Great buy. Have been using these at work, and they have held up well.",
        "Really like the design and fit of this style of Mechanix glove.",
        "**WARNING** I received these today and they are clearly counterfeit. These fake gloves are no where near the quality I’ve purchased in the past when I’ve bought the same model locally. I will be disputing this item.",
        "I generally wear medium gloves and these fit perfectly. If I could change the design I would only change the stitching in the fingers so they don't cross over the tips. Arrived quickly in perfect condition, still had security device attached-easily removed with wire cutters though. I'll buy again.",
        "So far these gloves have been great. I use them for hunting when its not too cold bc i can still manipulate the gun very easily. Make sure you use the sizing guide on Mechanix website to order the correct size. Mediums were perfect for me.",
        "These things are amazing. I have had them for several years now and used them for about everything (crawl space work, yard work, wood work, even mountain biking a couple times). Will definitely get another pair",
        "These gloves are perfect for working on cars or doing anything that might be hard on your hands. Keeps the grease and grime off your hands and is also warm enough to make working on cars in the winter bearable. Now I don't have grease under my nails for the next week after changing my oil.",
        "They feel nice fit well. I bought these to work around sheet metals, and they saved my hands. Medium was a good fit for me.",
        "Recommend going for a thicker glove, sizing is quite strange with wide palms and shorter fingers. Annoying internal seam on the index finger (mainly due to size). Quality is reasonable although a few loose threads",
        "My Mechanix Covert Black Gloves Fit Great! Awesome Gloves !!No loss of dexterity! Nice seams at the Finger tips! I have Used Mechanix Gloves!.. one model or another since 2006. I wish I could find multi-pack",
        "Excellent fit. Snug yet articulation allows for sufficient finger dexterity, striking a great balance between protection and tactile feedback response. They wash and dry easily and also allow input to your smartphone touchscreen. I used them to input data on an iPhone without incident. Great overall, and will buy again.",
        "These fit well except for the fingers, which are a bit long (I have wider hands with 'stubby'/short fingers). I think these will work well for range work. Seems constructed well, however I do think they are quite a bit over priced. I will continue to try various brands to find that 'perfect' glove out there..."
    ]
}