{
    "entity": "Tea Kettles",
    "text": [
        "I had mine for 3 years and it rusted inside. For the last few months I did not realize I was drinking little flakes that was coming off the bottom of the kettle. I'm not sure if the flakes was mineral deposits, or actual metal flakes. I tried the cleaning it white vinegar but it did not remove it, so I assume it's not mineral deposits, so it must be something else. I'll never buy this kettle again and I do not recommend it.",
        "Build quality seems fine, and it works exactly as it should, but aesthetically it is significantly inferior to the product for which it is offered as an alternative. Where the more expensive product has matte finishes, this one has polished surfaces that look and feel cheaper. You get what you pay for. The gourmet coffee experience is largely about feel, so it may be worth investing the extra money in the superior product. However, if saving money is a primary objective this is a clear winner.",
        "2018 This went from 5 stars to 3 because after a year and a half the whole bottom on the inside is rusted. 2017 I was looking for a reasonable priced pour over kettle that would work well on my induction range - and this works perfectly - serving up hot water in 3 minutes. I had been reviewing different pots for a month before buying this one. The top is removed easily and holds enough water for my one cup of coffee. The handle remains cool, as well as the lid top. Great product. Why buy something at 4 times the price when this one works so well? Excellent product.",
        "This small tea kettle (5 3/4 inch base) nicely fits the smallest induction pad on our cooktop. The water boils quickly and while it does not whistle, the top clatters to alert you. The handle stays cool. But the best part is the pour. I mainly use this for cone filter coffee pourovers. My old teapot made it difficult to control the pour, but this kettle, with its light weight and narrow and ergonomically curved spout, makes the pour a joy.",
        "I got this kettle to use with my aeropress. The spout is perfect for that because it keeps water from splashing everywhere. The kettle doesn't make a noise so you have to guess when the water is hot enough. This doesn't really bother me but it means the results are somewhat uneven. You can hear the water boiling though, so you do know when it's 100 degrees celsius / 212 fahrenheit. But you have to be standing next to the kettle listening for this. To be fair, the kettle manufacturers never claimed it whistled. I checked. The kettle is super cute which is what matters.",
        "This product truly is from Japan...all tags & product info are in Japanese; hence, unable to read. The box it arrived in was in horrible shape. There were scratches on the stainless steel kettle and flaws on the black handle. It smelled like cheap metal. The lid \"rests\" in place; not secure. I bought this because it was highly rated, but I beg to differ. I would not recommend this kettle to anyone.",
        "After 1.5 years of every other day use, it started to rust on the inside.",
        "Cute looking kettle. Appears to be made of fine quality materials and crafted well. Arrived 3 weeks after order was placed. Came directly from Japan via postal service. Email messages kept me informed of the status of shipment. All documentation that came along was in Japanese. Not a problem because we did not believe we needed instructions for using a tea kettle. There is cost savings when getting directly from Japan. So far, we liked it. Works well for 2 people, maybe for 3 people drinking a medium size American cup. Lid is not very tight, but not too loose either. I keep a finger on the ball above the lid while pouring.",
        "I've been using kettle for pourover coffee for over a year now. However within about 8 months there was a lot of rust showing at the inside seems of the metal. I've been trying to get rid of some of it to avoid buying a new kettle but, but I'm not sure I can continue that. It is a nice kettle with a great shape for pouring over tea or coffe but I don't think it's acceptable to have to buy a new one every year or less to void rust in your tea/coffee water.",
        "I guess I shouldn't be terribly surprised, other people had reported this when I bought it but the overwhelmingly positive reviews made me think that it was just an unlucky few. That still could be true but I recently noticed that the inside has been starting to rust, which is very disappointing. Next time I'll just shell out for a higher-quality kettle.",
        "Bought this to use with my Aeropress coffee maker and it works wonderfully. It's easy to hold and use and pours evenly. Other reviewers mention the lid is a bit loose, but it stays on even if you tip it almost completely vertical. You'll also see other reviews regarding rust. I live in an incredibly humid environment and I just make sure to dry the pot every day and store it without the lid on. Any teeny rust spots I've seen I just run a Brillo pad over and they're gone instantly. It's very easy to take care of, easy to use, and looks nice.",
        "Great design, works very well. I would have given it 5 stars if I reviewed it after a week. However as other reviewers have noted, after about 6 months it started rusting at the bottom seam. This tells me there is some issue with the grade of the stainless steel if it is rusting out this soon. It seems to be a tea kettle even at this price point should last at least a couple of years.",
        "Sleek looking and light weight. Top opening is slightly small for cleaning and drying. Although this tea kettle is made in Japan, if it is sold in the U.S. (and elsewhere), the literature and box markings should be updated to include other language(s) for the care instructions.",
        "This kettle/tea pot is perfect! Feels good in the hand, looks wonderful on the stove or counter and functions/pours perfectly. It is very well made, I have used it several times a day for over two weeks and it looks new ... no corrosion, no scuffs or scratches, no wobbly pieces or connections. I have an induction range and it heats quickly and responds promptly when the range is turned off. It doesn't need a whistle ... you can hear the water begin to boil. I am very pleased with this purchase.",
        "Smaller than I expected, but boils just enough water to fill up 2 16oz coffee mugs. I may have gone with the larger version if I had to buy again, because I need to fill this nearly to the top, which causes the water to boil over... not a big deal. Only significant dislike it the reduced surface area on the bottom means I have to use a smaller stove burner, and as a result, it takes a few minutes longer to boil the water in comparison to our larger kettle (which holds the same amount of water).",
        "Second purchase. Sold my old unit when I left Hawaiian Islands. Still good after 3 years. It's really great Japanese artisanal quality! My wife gets wrist exertion from pourovers but I think she needs a lower than counter height table.",
        "I love this little kettle! I've had it for a couple of months now and use it several times a day. I got it to replace my beautiful but heavy copper tea kettle with a goose neck spout. I make coffee with a pour over Melitta filter for each cup of coffee and it is accurate and light - a pleasure to use. Super fast boil because of only 1-2 cups at a time. It is silent, so you have to watch for steam coming out of the vents in the lid.",
        "This is the perfect size. It looks nice too. I really like the design. It is easy to use and pour. I use it daily for my tea. After each use I let it dry out completely (as you should with all tea pots). Some people complained that the directions are in Japanese. Seriously? It's a tea pot. Do you really need directions? The size is perfect for a few cups. If you need to make a lot of tea then this may be too small for you. This is perfect for me. I am not concerned with rusting as some mentioned. I think if it dries completely after each use there shouldn't be any issues.",
        "I got this a little over a year ago and I love it. Perfect for 1-2 cups of tea or coffee. I wouldn't recommend it if you regularly need more than that. Boils very quickly, and the handle is never hot to the touch. Got another one for a friend this year since I like it so much. I keep it on the stove at all times so it gets pretty messy with oil splatter, but it cleans up nicely with bar keeper's friend (or whatever stainless steel cleaner you happen to have, I'm sure). Fun fact: My thermapen thermometer just barely fits in the steam vent, it's like they were made for each other.",
        "It's a nice design. Looks great on my stove top. It poors nicely. However, it has one big problem: There's no warning whatsoever that the water is about to reach boiling temps. No whistle or anything. It just starts exploding out of the funnel. I can't tell you how many times it's flooded the top of my stove if I step away for a minute to take care of something with my kids or something. You have to stand over it a watch it and cut the heat off immediately when the water starts to boil or you'll have a mess.",
        "The pour is very easy to control and the price is very reasonable. I dislike the quality of the product however. Whenever I wipe the product down I get grey metallic stains on my towel which makes me feel like the steel isn't what it claims to be. The handle, while easy enough to grip, is also not ideal and the lid is practically pointless. Water also takes a little too long to boil in this kettle.",
        "Perfect for making about two 12 oz cups of coffee at a time. I make a pour-over single cup of coffee at a time and love the perfect pour out of the spout. The only reason I give it 4 stars is that I wish it had some sort of whistle or some sign to indicate when the water is boiling. As it is, I have to hover over the stove and guess when it has come to a boil from the amount of noise and steam coming out of the lid. Really enjoy having it though, and have put my larger kettle away for use only when I have guests or a full house. Highly recommend!",
        "A great little pot! it is well made sturdy handle, and love that it does not whistle it steams through the vent. I would recommend when you pour the hot water out of the pot to hold part of the top so the lid does not pop off... most tea kettles do that no matter how tight the top lid seems to be on.I will be looking forward to using this in the morning with my tea and breakfast it is a cute pot good for a single person to have two good size mugs out of it.",
        "The water heats amazingly quickly on an induction cooktop (~2 minutes on the highest setting). Once it starts to make gurgling sounds, have your hands on the off switch (or be prepared to lift the kettle) to stop the heating. Once significant steam comes out the vent, turn it off. On the highest setting, so much steam got released at boiling that the lid popped off. Do not leave unattended. The kettle is very light, which is nice when you have to hold it in the air for over two minutes for a pour over. It is also great for watering plants.",
        "This looks like hell- pitted and rusting. Bought it in January. It's not cleanable. I CAN'T believe WHO is giving this piece of garbage good reviews!!! Total waste of money. I'm currently shopping for a new small kettle!",
        "We use this almost every morning. It holds enough water for about 2.5 (large) cups of coffee. We use the pour over method and it works great. My issue is there appears to be a small area of rust inside the kettle after only a couple months. I tried cleaning it to get rid of it but its still there. Stainless that rusts??",
        "I LOVE this kettle. I'm a pour over coffee kind of guy and have wanted a goose neck kettle for a long time. After doing extensive research I landed on this one due to it cost and overall rating. The one thing that I was weary about were the reviews that mentioned rust forming quickly in and around the kettle. I can confidently say that I have not experienced any formation of rust inside or outside the kettle, I will say that I use this daily so water never sits in it for an extended period of time.",
        "The kettle was great for pour overs or hot water for tea in the beginning. However, after several months, I noticed rust near the inside seam of the kettle. I thought maybe I had a faulty kettle, so I purchased another as I had really liked it for my coffee and tea. Unfortunately, rust showed up again in the inside seams, so I had to find a different kettle. It's a shame as I really liked this model.",
        "I previously had a regular tea kettle that I used for my pour over coffee. I didn't know what I was missing until I purchased this one! It makes control of the water flow much easier. It's sorta elegant too - I sorta feel like a barista when I'm using this thing. I highly recommend this kettle, I have had it almost two years and no complaints.",
        "Great kettle but there are 2 things I wish they would change. They kinda go hand in hand. Make it bigger and change the plastic handle to something more heat resistant. We use this on the smallest burner on our gas range and the base isn't large enough in diameter to stop the flames heat from really making the handle hot. We have to park it on the burner offset so we can grab it once the water is boiling. Other than that, it's a joy to use when we're geeking out at coffee time.",
        "Who would think that this little aluminum kettle would be so cool! Yes, it's designed as a pour-over coffee kettle. Pshaw! I use it as my tea kettle. Because it's aluminum, it heats up wicked fast. No, there's not a whistle. Yes, you're going to have to pay attention. Trust me on this. I've melted 2 kettles because I relied on a whistle that didn't. Oh my mom likes it also. She's 76 and the placement of the handle and the spout at the bottom make it much easier to pick up and pour. No over extension of wrist, arm, shoulder movement. Oh and it's cute!",
        "This was great for about 8 months, and then I started to find rust along the bottom seam along the inside of the kettle.",
        "It does what it is supposed to do but after a few months the outer surface turned a golden brown and no amount of scrubbing, baking soda, bartenders friend worked. It is an eyesore now, I wont use it anymore and the manufacturer provides no warranty.",
        "Just another simple I love this kettle review because it is working for me and I am thankful for it... Only suggestion for the manufacture is that I wish this same design would come in 18/0 steel as I feel it is a healthier quality steel.",
        "I was looking for a coffee kettle made in USA or Japan. This is made in Japan and matched that I wanted. Works as advertised and I don't regret buying this!",
        "Why did I wait so long to buy this kettle? This is a great kettle: precise spout, doesn't drip. I was previously using a gorgeous stone teapot to make my pour over coffee but was constantly frustrated by the water dribbling out of the spout when I poured. So I decided to copy the baristas in the fancy coffee shops and get a kettle that looks like theirs. While it looks like most of them use the Hario kettles, I am perfectly satisfied and pleased to be using this Fino kettle -- it's a little less pricey and still Japanese made. Works great on my glass stove-top. Haven't had any problems with rust or build-up. Comfortable handle too.",
        "Got this as a Christmas gift and couldn't be happier with it. Besides the perfectly controllable pour from the spout, I also love that it doesn't whistle. If you've been using a stovetop kettle for a while, you already know what boiling water sounds like and probably don't need a whistle : ) The instructions on the box are 100% not in English and are very hard to understand. That said, it's a kettle, so use common sense and keep your hand away from the holes on top and you'll be fine. My husband totally guessed on this item as a gift for me and it literally makes me happy just to see it on the stove. winner.",
        "I needed a small (1-2 person) kettle, was going to get an electric but then realized I have a gas range with x000 BTU instantly on tap. I couldn't be happier with this kettle, it's just the size I wanted, elegant and well-crafted. The spout makes pouring exact and easy to regulate. The instructions are in Japanese, I had a co-worker translate them, they don't say anything unexpected except clean before first use (I used a clean rag and bit of dish detergent) and it may take a couple boils to taste clean.",
        "It's adorable! Seems well made. Handle doesn't get hot when heating it on the stove. Easy to control the pour. I like a big cup of coffee so I make about 10- 14oz cups so this is the perfect size for me. I would probably get a larger one if I was making coffee for 2 people. The lid doesn't fit super tight so you have to be careful not to tip it too far forward or you need to hold it so it doesn't fall off. Really not a big issue.",
        "This pot is so cute, it pours beautifully and with such accuracy I am glad to have it for my aeropress. I haven't used it on the stove and just boil the water in my electric kettle. It keeps the water at a good temp for me to complete the blooming and drawing of the beans, and there is ample water left to adjust what kind of brew I want ie latte etc. I Might get a trivet to warm on stove as the shiny finish is so appealing to me. Shipped really fast. Highly recommend this pot.",
        "It's a nice little teapot and it heats real fast, but I find the handle and the lid get too hot and I get burned more often than not when I take it off the stove. I think because it's just too little, and there's no insulation against the heat on the handle & lid.",
        "I've had this teapot for quite a long time. However the coating on the inside has started flaking off. I didn't realize I was drinking the flakes until I noticed them at the bottom of my coffee. After looking closely at the bottom of the inside of the tea pot it looks like some sort of coating is peeling. If it was really made of stainless steel as they claim, it wouldn't be doing this.",
        "I just love this Coffee Pot. Use it for pour over coffee method. I have never had a problem with it boiling over and spilling out, as other customers complained. Pour over coffee is made with water at a temp just before boiling, so I use a thermometer to measure 195 degrees. The water pours out very smoothly and you will have good control of the flow. It is also just lovely to look at sitting on the stove. LOVE IT !!!!",
        "Great kettle, perfect for pourovers. I use this with the Hario V60 dripper and either make single cups or use with the Hario V60 600 ml range server. I decided to get this over the Hario kettle because I think it looks nicer -- clean and sleek and very shiny (just as pictured). It also happened to have a significantly lower price tag than the Hario or other narrow spout kettles, which is a huge plus! Note that it doesn't come with instructions in English. Not a whole lot to be instructed of, however. Just make sure there's enough water in it, and that the lid is on when heating the water. You can heat directly on the stovetop.",
        "My boyfriend uses this every morning and so far (4 months in), no rust! That was a concern after researching models. Really well made and perfect for pour-over coffee but I love using it for tea as well. Very cute sitting on the stove top but also great at it's job!",
        "I purchased this to make pour-over coffee in my motorhome, using my propane gas stove. The pot it replaced took 10 minutes to boil 2 cups of water. This little jewel heated water up in the time it took to gather two cups, the container of ground coffee, the coffee scoop, the filters and the coffee cone holder. I love it. And it is so pretty to look at. It is very well crafted, no rough edges, no visible welds. The handle does not get hot, and the top does not fall off when you pour.",
        "I was looking for a nice, small, drip kettle and finally settled on this, as I was on a tight budget. I love the size, and the simple, yet cute, design. I have been using it for a year now and love it. The pour control is much better than the nothing I had before, and it is small enough that it doesn't take up much space in my kitchen. It isn't used daily - mostly weekends only - but it is just right for my needs. And it's cute. I like that too.",
        "came in a box that had all japanese writing on it. no idea what it said. perhaps it said, \"this is an awesome little kettle. perfect for french press coffee.\" i have been keeping it DRY and haven't seen a lick of rust. i also imagine it said, \" keep this little kettle on the edge of your burner, and the handle wont get so hot! \" i was reluctant to buy this but have been very happy with my choice.",
        "Excellent product, I use it daily to boil water. No marks from gas stove and super easy to clean. The handle never gets hot, even if I forget to take it off the stove when it is boiling.",
        "Bought for the wife, she loves pouring out of this pot. Don't overfill, but she loves the handle, and really everything about this pot.. scored me points :)",
        "Works fine but it is awkwardly heavy. I wish it had a built in thermometer.",
        "I love this kettle. It is nicely made and I have used it multiple (10+) times now. I do wish it was a little bigger, but I think it is about the average size of all of the ones I looked at before buying this one. A lot of the kettles I looked at had reviews about the gooseneck solder melting. This one has a very nice connection and I do not see that being an issue.",
        "I highly recommend this gooseneck kettle. I got this after my Bonavita broke due to poor build quality. The weld on the neck appears much more secure than that of the Bonavita. I went through two of those breaking and gave up on them. I use the Fino for making coffee with a Chemex and it performs perfectly. The size is perfect for my 1 liter Chemex even if I use some water to clean out the carafe and prime the filter. The control of the flow is precise and steady.",
        "Very well constructed Tea Kettle. I like the compact size, about one liter which is just about right for my needs. The kettle is very attractive and looks \"artsy\" just sitting on the stove. I love the fact that there is no noisy whistle. I can tell when my water is boiling without an annoying whistle, thank you! The water pours slowly and evenly from the well-placed spout. I love everything about this kettle.",
        "We used this for about year at the most and it peeled on the inside - totally low quality. We went to a french press afterward. I'm back looking for another pour over to travel with and surprised to see this with so many good reviews. Won't waste my money a second time.",
        "excellent kettle **UPDATE** lid falls out and smashes into whatever you're brewing. If you have to use two hands - one to pour and one to hold lid with hot pad that CHANGES EVERYTHING... returning",
        "This beautiful little water kettle is perfect for me. It is quick to heat water and the pour is perfect! I prepare tea in a Xing clay pot and need a precise flow of water onto the tea leaves. I can dry the inside of the kettle without any trouble. I am very pleased with it. I recommend it highly!",
        "This was just what I was looking for. It does not make noise when the water boils and holds enough water for a couple of cups of tea.",
        "Love my new kettle! I've been using the pour-over method for more than a decade and was using a saucepan to boil the water. When pouring from the saucepan I always had grounds and coffee splattering. Now with this kettle, it's a gentle pour and no splatters at all! Love it!",
        "OMG I LOVE this tea pot! I had it for about 2 month now, and no rust issue, it pours very nicely and accurately too. The only thing I didn't like is the picture on the internet looks better than the actual product, on the picture it looks like shiny smooth stainless steel, but when I received mine, it has some ring pattern on there and doesn't appear as smooth as it is on the picture. Still love it though!",
        "I was hesitant to spend money on a new kettle but the neck makes this much more functional for coffee pour-overs, which alone justifies the upgrade. Awesome bonuses: The plastic portions are out of the way so that large flames don't damage the kettle and you can get it to temp real quick. Looks great. Indicates boil via a stylish triple hole steam jet deal in the lid. You get a neat aesthetic and can skip the sometimes grating whistle.",
        "My complaint is that the lid rumbles like crazy and easily allows the water to bubble out. I have to watch it carefully. But it does pour nicely",
        "I boil water to make Chinese loose leaf tea every morning. After 9 months of daily use, the bottom of the pot is scattered with rust spots. I empty the pot after each use and descaled with vinegar once for a while, but that didn't help. Now I have to look for another tea kettle. Very disappointed!",
        "It's perfect! I totally love this little kettle! I have used only filtered water in it. Absolutely no tarnishing or rust issues. It always has a little bit of left over water sitting in it after heating and pouring so I'm not drying it out after every use or anything. In fact it gets no special treatment at all. I use it every day, often several times daily.",
        "Really great kettle for pouring over both, coffee and tea. Water gets boiled very fast in it, too. Made in Japan. The steel looks and feels sturdy. I wish they made the handle and a knob from wood instead of plastic, though...",
        "This tea kettle is a perfect size for me - much smaller than others I have had in the past. Easy to store or leave on the stove top. I have an electric stove. Interestingly, it will not whistle. I let the water boil, steam rushes out of the three holes on the lid, but there is no sound. That doesn't bother me, because I will not leave it unattended.",
        "I purchased this kettle a little less than a month ago. I use it twice a day (morning + evening). Just noticed last week that the coating on the inside of the kettle is chipping/peeling off. I suppose if you only use the kettle every now and again, it may last. Otherwise, if you plan on using this daily, I wouldn't bother purchasing this one.",
        "It does its job but it has very thin metal and the plastic feels very cheap. More significantly, the rate of flow is rather difficult to control for a pour-over kettle. Too fast, too suddenly. The lid is also a very loose fit, so be careful when it is at an angle so that it does not fall out. I guess you get what you pay for, but it is really not that much cheaper than other kettles of superior quality.",
        "It was a great little kettle until it rusted over about 4-5 weeks after purchase. I used it daily, drying it out thoroughly between uses. Inconveniently, it began to rust 30 days after my purchase, so I could not return it. I would suggest investing a little more money and purchasing a higher quality product.",
        "This pot works great for pour over coffee, though I'm not a barista and I've only used a couple other gooseneck kettles. The only negatives are the top lid handle can get too hot to touch, and there's a bit of a rolled lip at the opening, which means water will sit in that lip if you're trying to dry this by sitting it upside down after use.",
        "Using this every morning with excellent results for 1 year or more. Plan to keep doing so",
        "Very happy, this really does appear to be made in Japan, nicely built of heavier material. I use this on my wood burning fireplace insert, it works great. The lid has vent holes so it doesn't build pressure and spit through the spout, pours very well, doesn't drip.",
        "Very well made coffee pot. I use a #2 coffee filter and the narrow spout is perfect for precise pouring of the water into the filter. The 1.2L size is also good as it lasts for several cups without need for a refill. The quality of workmanship is excellent. I am looking forward to much good use of this pot. This is an excellent product for its purpose.",
        "The long crane neck helps control the amount of water for dripping coffee.",
        "This has been a great kettle to use with our Chemex, however it has been a problem that it doesn't whistle since my kitchen is kind of far from my living room. Just make sure to check on it periodically to make sure it's not boiling over and you're good to go with this nifty lil kettle.",
        "I was looking for a replacement for my kettle, I could not have made a better choice. It's not big on size but it suits me perfectly and I love the look of it. I'm not sure if my use is the intended use but again it suits me just fine. I would buy it again if I need to but it seems pretty durable and not likely to need replacing anytime soon.",
        "Had one of these in our travel trailer and it slipped away from me in the sale. Very sad day. I bought this to replace it. Love that it heats the water so well on the gas stove in the RV. I also tried it on the induction top in the house and it works fine. Water pours easily and no leaks. I'd give it five stars if it had a whistle.",
        "I love my new tea kettle and I love the price! I did some online price comparison and bought this one because it was less expensive but looked just like the more expensive ones. I was right! This one is just perfect. I use it almost daily and have had no problems. I love the way it looks on my stovetop. I highly recommend this product.",
        "I ordered this for my hubby whose electric goose neck kettle (Bonavita) recently broke. It's small looking, but hubby says it's fine. It looks shiny and pretty. Hubby says it boils fast, as fast as his electric one used to be. He is happy with it, so I'm happy with this purchase. Oh, it does not rust inside either. Yay!",
        "I purchased this kettle for controlled pours using the Aeropress and especially the Hario V60 dripper. This is a solid performing kettle and exceeds my expectations. Water heats quickly on my gas stove. The spout is a perfect design, allowing precise control of where the water goes and how fast it pours. I highly recommend this kettle, and I'm glad I found it on Amazon.",
        "Perfect in every way. Attractive, well made, well balanced when pouring. The thin spout allows for excellent control when pouring over coffee grounds.",
        "We use it everyday. It is holding up well on the flat electric stove. Nothing lose, pours smoothly. I don't use it on pour overs anymore, I use it for a French press for me and my wife. Just be warned it doesn't give you an indication water is boiling. Usually I see the steam come out but may not be visible all the time.",
        "A terrific kettle for pour over coffee making. Use it every day, and it does exactly what you want. No problems with fragile spout. Works perfectly on my induction stovetop. Most importantly, it is so easy to pour with a controlled, accurate flow. It's a pleasure to use for coffee and tea, but I also find it very useful in cooking when I need to add a little water to something I'm cooking in a precise and controlled manner. It also serves as a very convenient and effective watering can for indoor plants. Quite a useful purchase.",
        "I am so disappointed in this tea kettle. After only using it once, it rusted inside. I will have to return it.",
        "I love this little kettle and have been traveling with it in my tiny camper for the last few months. Everybody who sees it comments on how cute it is, and I also like that water heats up quickly in it and there is a nice clean pour -- which is absolutely essential when you are trying to work in a small space.",
        "I think this is a great kettle and I love how it looks. That said, if it existed, I would buy a kettle that: #1: Has a whistle (this one doesn't) #2: Has an insulated lid (this one will burn your fingers if you try to touch the plastic knob on the lid after boiling water)",
        "This is the perfect size tea pot for my pour over coffee maker. Because it's small, my water heats up quickly, and the nozzle makes it easy to pour over my coffee even when I'm tired. It also looks super cute, so I can leave it out when not in use. I've used it a lot and it still looks brand new.",
        "Love this kettle! We use it for pour over coffee and for tea. Only wish is that it made a noise when it was done. There have been several times we've left the stove on for longer than we want to admit because we forgot about it...",
        "Works fine and seems well made. Once small quip, if you fill it even slightly close to the top of the kettle water will come pouring out of the spout with a vigorous boil. Making the spout a little longer so the opening is higher than the lid will solve this problem. Keep this in mind as you can only boil about 2/3 of the stated volume of the kettle.",
        "I've just started using a Chemex for my coffee and for the best results it requires a goose neck pot for the pour-over. This performs perfectly up to 700 grams of water. It provides me a nice gently stream of water into the fresh grounds. I use it every day as I make my coffee. I'm very satisfied.",
        "Perfect little teapot. Pours beautifully, with no need to hold on to the top, as there's a little catch to hold it on while pouring. Easy to fill, and an overall delight.",
        "Great little pot perfect for a couple of Cups of Tea.",
        "I really like the looks and ergonomics of this kettle. It's the perfect size to fill the Large Coffee Shrub Lever Dripper. Pours are controllable and smooth. The ONLY negative is the bottom of this kettle is not flat. Using this on a glass or electric cooktop will take longer to boil than on a gas stove.",
        "This is the best tea kettle I've ever bought. It is fine for brewing two large cups of tea or coffee. It cleans up well. I wish it whistled because I am absent minded and have left it on simmer to the point that most of the water evaporated out of it. This tea kettle replaces a stainless steel one and one that is enameled.",
        "Been using this coffee and tea. Excellent little kettle. I don't boil in it, just use the thin spout for controlled pouring for a pour-over coffee brewing method, as well as for tea. Very graceful looking thing and comfortable to use.",
        "I ordered this 7 years ago and was thrilled with it. It has developed a tiny leak so I reordered the new one doesn't work on my induction stove (magnet doesn't stick it the bottom). So confusing because it states clearly it will work on induction stoves. So disappointed.",
        "Nice kettle. Little on the thin side but heats evenly. Handle gets very hot so you need to be careful with it. Poors smoothly and easily. Steam comes out fast so you have to turn the lid so the steam comes out away from your pouring hand. I'm happy with it. .",
        "It’s a perfect design to use with my Chemex coffee maker",
        "I am not happy with this purchase. The handle gets too hot to pick up and I need a mitten to do do. Inconvenient. Do NOT recommend.",
        "Great except the handle gets hot enough to give yourself a painful burn. I won’t be using it anymore as I’m typing this with my left hand due to burned right fingers!"
    ]
}