{
    "entity": "Tea Kettles",
    "text": [
        "My wife is an avid tea drinker and we boil water 6+ times a day in this thing. She raves about this product! It's extremely durable and after a year of extensive use, it still looks brand new and taste remains perfect. I feel bad for the reviewer who got a defective one. So far, we haven't experienced any rust and I've even torched the thing by accident a few times (putting the pot on high heat with no water inside... I am an idiot). The product not only survived but looks no worse for the wear. It really seems well-built. We just purchased another one for my sister, an avid tea drinker, and she is a believer as well.",
        "I love this teapot! The water heats up VERY quickly. It looks lovely sitting on my stove - I use it so often I don't even consider putting it away. Very stylish. I DO wish it had some kind of whistle, but that's not a huge drawback. The only thing that can be improved on is the fit of the top. The handle does not heat up, but I have to wear a silicone mitt anyway, because if you tip it too far, the top comes off, and steam escapes, of course. A bit awkward, therefore, to pour. Still, I can deal with it because I love the heat up time and the appearance.",
        "Lovely appearance and heats fast BUT it LEAKS ALL OVER when you pour, and it sputters and splashes all over without control. We have a pour over filter and the water spurts putt l out, sending coffee grounds all over the counter. We also have to be careful not to get burned with this projectile boiling water!!! I did not realize Amazon only gives 30 DAYS for returns!! Most places I patronize give 90 days, so I did not know I had to return so quickly. I will not use this and will look for another kettle. I wish I could get a refund. 🙁",
        "This is a great teapot. With the wide opening it is easy to keep clean. The bottom is thick enough to spread the heat. Water boils quickly. There is no annoying whistle but steam pours out the spout to let you know that the water is ready.The stainless steel me it cleans up quickly. Yes the top is not tight, but is designed to be held when pouring. Better than those you have to fight to remove. The handle keeps upright and is never hot. Lastly it pours well with no dripping",
        "Simple design. Not fancy in any way. It passed the test I was most interested about which is the quality of the handle. When pouring hot water from device, the handle did not move. It did not feel that it wanted to move, therefore, I felt secure knowing I was not going to be splashed with hot water. True statement. I have an electrical stove and it heated up quite quickly using a 6 out of 10 temp on dial. I have no desire to have any other kettle than this. Worth it on many levels.",
        "We really liked the design from the outside. However, when you look inside you can see the really shoddy welding job. Also, when you look into the spout, it looks like the edges are rusted or it may just be the same bad welding. Not sure whether it is an official Sori Yanagi kettle. I had seen a similar review but thought it might be a one off situation. Guess not.",
        "After ruining my enamel coated kettle, I decided to seek a plain steel kettle. This kettle exceeded my expectations for beauty and functionality. First, its shape is sooo beautiful. The handle is very comfortable in my hand. The lid fits loosely and doesn’t fall off when pouring. The manufacturing quality is top notch. It is large enough to provide water to both preheat the teapot and then fill it. The Amazon pic looks bluish on my monitor. Hopefully, the included picture shows its polished steel sheen properly.",
        "I’ve used this teapot for a few months now, and This is the BEST teapot I’ve ever owned. It is stunning to look at, it is made with impeccable craftsmanship, and best of all, is chemical free and not made in China!! Everyone who has seen it asks where it was purchased. It will surely last a lifetime! It is the best investment you can make if you are A tea drinker. I immediately noticed the game-changing quality Of this one the moment It arrived.",
        "Is it O.K. to say I love this teapot. It looks great, clean and simple. It is not made in China - which makes me feel much better about drinking water from it several times a day. The water after heated does not have a metallic taste - as in less expensive teapots. I have a glass top stove and it sits even and perfect. If you can spend a few extra dollars on a teapot - this is the one.",
        "After ordered five different tea kettles, with good reviews and tried them, I selected this one like the best in between. It is made with the art of a great Japanese designer. It’s the easiest one, with natural beauty an excellent quality. I keep it on my stove to make my kitchen look very intimate an beautiful. The natural is the exception, ans this is exceptional !",
        "This is a great teapot. Easy to clean the inside, heats up very quickly and is very durable. I've had this a few years and have had no issues. When the outside gets a little spotty, I use brasso and then wash it well and it shines right up. THis arrived on time and was well-packaged.",
        "I searched for a while for a tea kettle without plastic pieces and manufactured outside of China. This kettle fits the bill perfectly. As a bonus, it's clean lines and shiny finish make it very attractive. Pros: - heats water quickly - manufactured in Japan - no plastic pieces make contact with the water - swivel handle for easy access to the kettle opening and more compact storage size - well made, high quality, attractive kettle Cons: - the lid can easily fall off when pouring out the last drops of water (easily fixed by holding the lid down with one hand and pouring with the other)",
        "Very frustrated. Bought this after hours of research as it was made in Japan (not China) and of pure stainless steel. After a week of use there is already rust spots on the inside bottom. Stainless steel does not rust. Very annoyed and disappointed",
        "My Sori Yanagi kettle is a pleasure to use. I've had it for two years and it still looks new. It's like a work of art on my stove. My favorite features are its pleasing shape, sturdy, cool handle that stays up, wide opening, easy to clean inside and out, pours nicely, and doesn't need a whistle for me to hear it. I've tried many kettles in the past, but feel that this little beauty is here to stay.",
        "I purchased this kettle for the second time and it is just as perfect as the first. I lost the first one to an ex boyfriend because I gave it to him as a gift. I guess I could live without him but not without the Sori. Beautiful craftsmanship, lovely lines and gorgeous enough to leave out. Smooth as silk and heats up quickly without an annoying whistle. I highly recommend it.",
        "The upside to this tea pot is the same as the downside. The lid doesn't fit snugly.. Lack of snugness for a person wanting amazing Japanese quality is a downside. For an older person who wants a nice looking, well designed Tea Pot but has arthritis and doesn't want to struggle getting a tight fitting lid off - it's perfect.",
        "I just started using the kettle this month...today while cleaning, I found spots on the rim of the lid that appear to be rust. And my lid fits so tightly that I have to snap it on. While reading questions just now, I see that most people are saying theirs is only snug to loose. I have to be careful when it's hot. I tried to find a place on my order to contact seller, but I couldn't find one. I DO NOT THINK IT SHOULD BE RUSTING AFTER USING FOR LESS THAN A MONTH❗️❗️❗️",
        "I used this tea kettle to boil water. It had received high ratings. The problems were that when the water was boiling, the lid was jumping up and down on the kettle and when I tryed to pour it into my Chemex to make coffee the water coming out of the spout splattered and shot out. I waited a while and tryed again, but the same thing happened. Could be dangerous if your other hand was in the way... nice burn.",
        "No plastic products in touch with the water. Heats fast, excellent size and spout directed away so steam doesn’t reach one’s hands",
        "this is a solid and well designed tea kettle. it’s beautiful in a classic way and easy to clean, inside and out. i love that it doesn’t whistle.",
        "This is a quality teakettle. It is well made and polished to a beautiful shine. The flat bottom allows the water to boil quickly. It has a substantial weight to it, and the stainless steel seems to be of a higher quality than kettles from China that I've purchased in the past. We make tea two of three times a day, and expect this teakettle to be used for a long while.",
        "Bought Sept 2, 2017 and make tea with milk and tea spice everyday and love it. No rust or any corrosion, it is well made of stainless steel. In fact buying one for my Bro-in-law he loves tea.",
        "I thought it is insane to pay this much for a darn kettle.. but I realized I'd use this every day (I am Japanese, meaning I drink ton of green tea every day) and can't go wrong with Japanese product so I went and glad I did. This is clean and easy to clean and looks fantastic. Boilds water very quickly at full capacity and the handle doesn't get hot or doesn't feel flimsy. This is a good kettle that will last me a long time. My mom in Japan also has a kettle (made in Japan) and has been using it for 30+ years so hopefully, my Sori Yanagi will accompany me till I am 70+years old.",
        "Love this kettle it's more beautiful than its picture makes lovely cup of tea doesn't take long to boil & love not having a whistle I dislike the loud high pitched noise they make this kettle is nice & quiet. Now my dog doesn't have to find me with his ears pressed back making me follow him to turn it off !",
        "I have had this several months now and couldn't be happier. It's quite sturdily made, zero rust, looks nice, and boils water quicker than other teapots I've had. I expect this to last a lifetime.",
        "I was worried after reading a few reviews that I would end up with a fake, low qulaity product. I ordered from Japan Import Shop and from what I see it looks like the great quality kettle it promised to be. I searched high and low and this seemed to be the ONLY kettle with high quality stainless steel. I am praying that it will not rust, especially after paying $70 for some thing that boils water. It arrived well before expected delivery date. Can't wait to try it out!",
        "I've been searching for a well-designed tea kettle and finally have found it. The spout is such that you don't have to tip the tea kettle upside down in order to empty it, thus risking burning your hand on steam - and you can pour without any dripping.The cover is wide, and the heat-proof handle moves, thus making filling easy. Though it has a decent capacity, it doesn't take up much room on the stove, yet has a wide base for energy-efficiency. I got the mirror finish, and the picture just doesn't do it justice. It's a beauty, and I love it. I expect it will last for years to come. Other, more expensive kettles were not nearly as well-designed.",
        "Love this shapely kettle -- no drips when pouring, lightweight and easy to handle, heats fast. I bought an expensive UK kettle for tea two years ago that drove me mad when I poured -- always hot water leaking from lid. Happy with this replacement!",
        "This is a beautifully designed and functionable stove-top teapot. It is made of durable stainless steel, has a nice wide base covering the burner, a spout offering precise pouring, a handle which bends to one side to permit easy filling, and a solid cover that fits well. I enjoy making tea with my new teapot.",
        "This kettle is the best I've ever had - even LeCruset. It does not whistle but that's not a big deal for me. It does not stain inside like others do and the opening is very wide. Wide enough to put in the top rack of the diswasher when there is room. Comes out looking brand new.",
        "I am happy with this product. It has been working very well for a month. It seems very well made and should last a long time...it is a pricey item at least for me, but I'm planning on it bring the last teapot I every buy. It does not whistle in case you wondered:).",
        "Weve only had this teapot for two days. We love it! It is an old school beauty with no seams that would allow for leaking. Works great on our induction range. Just what we were looking for..real, lasting quality with style.",
        "This kettle suits our needs perfectly. I didn't want a whistle, but it does let you know when the water is getting ready to boil with a lively rattling sound. The handle pushes aside one way for ease of filling, but not both ways so it feels stable when pouring. The cap is loose (as mentioned) but taking things gently or using the other hand to steady it prevents any mishaps. The spout allows good control of the rate of water flow, for relatively fine and drip-less pouring -- good for making pour-over filter coffee.",
        "I spent over a year trying to find the right kettle and my Sori Yanagi kettle was a case of love at first sight. Its craftsmanship is outstanding. It heats quickly and cleans easily. It fits perfectly in my hand and is the right size for a smaller household. It's well balanced and aesthetically lovely. This kettle makes me happy; I smile every time I see it in my kitchen.",
        "I love the style and construction of this kettle. It has no whistle so you have to kind of keep an eye on it, you wouldn't want it to boil dry. Heats up fairly quick. Does not appear to be rusting with use. The handle can get a little warm at times if the steam vents in the cover are aimed in the wrong direction. All in all I really like this kettle and I'm glad I bought it. I may even buy another.",
        "This is the only pot my wife allows on the stovetop instead of a cabinet. Beautiful, useful, and very well made. Far superior to a French made stainless steel kettle I considered.",
        "Very nice! The steel and plastic are heavy and high quality. I do not find that the handle gets hot. The design is a work of art and lovely to own. I am very pleased with my purchase.",
        "This tea kettle is very nice to look at (shiny stainless steel) and heats water fast. The handle has a good feel to it. I just wish the lid fit tight....hang on to it while you're pouring from it.",
        "Had the kettle now for a few months and really like it. The size is perfect for our standard size stove. The kettle does look better in person than in the photos. It boils fairly quickly. It's easy to keep clean with the wide top opening and articulating handle. The lid does fit loosely, but is easy to keep on by pressing a finger to the top of the black handle when pouring. This kettle looks like it will last a long time.",
        "Compact design. Handle is snug yet folds down easily. Generous opening means cleaning inside is easy. Exterior cleans up in a snap with a soapy sponge. Designed so that lid is secure when pouring. This kettle is made of a solid, not flimsy stainless steel.",
        "Love this tea kettle - it is very smooth and the quality seems to be very good. Has a good weight and feel to it also..",
        "Absolutely great kettle! Looks super sitting on the stove top. Is made of quality stainless steel. Fills and pours easily. It seems as if it will last a long time. Highly recommend this tea kettle.",
        "This is not a cheap kettle but I bought it based on many good reviews hoping to get a quality product that would last me for many years. Unfortunately the quality is simply not there. The weld around the spout was so bad that it looked like it was not done at the factory but a 10-year old did it with a cold soldering iron - highly irregular and not smooth at all.",
        "Great kettle, The water tastes great. There is no aftertaste. I wish it had a whistle though.",
        "I love my new Sori Yanagi kettle. It is stylish and heats water very quickly. I also love the mirror finish. The only suggestion I have is to make the lid fit tighter on the unit so the lid doesn't fall off when pouring at more steep angles. I must use two hands to pour the hot water, one hand on the handle and the other on the lid to prevent it from falling off and scalding me. Other than that, it's a great kettle. I am now used to using two hands to pour!",
        "It's bit heavier than I expected but it works well. My favorite part is that it's easy to clean the inside and there are no sharp edges so I don't get cut while washing out the inside.",
        "This has become my favorite tea kettle. I love everything about it, just wish it whistled. It was worth every penny.",
        "While it doesn't whistle this is a good sturdy tea pot, well designed and in a traditional classic style. It holds quite a bit more than it looks like it well and we are very happy with it!",
        "A lovely kettle. Everything about it is smooth, clean and timeless. I suspect I will be using this for many years!",
        "Simple to clean and pretty well constructed. Will have to observe over time though - hopefully it does not rust.",
        "Awesome!!! Just what I was looking for!!! It's perfect and will last a lifetime!!!",
        "Heats fast, easy to clean & great design. Love it!",
        "HIGHLY RECOMMEND this Zen design, very sturdy teapot. Heats quickly to highest temp water",
        "The kettle is so pleasing. It boils water quickly, is well balanced, and pours without dripping. It is exactly what I was looking for.",
        "Simple and good design...no \"bells and whistles,\" which I like.",
        "The model delivered had a linear crimp or fold in the metal near the spout that appears like it might be a potential focus of metal fatigue and later problems. It demonstrates less than expected workmanship considering the price of the kettle.",
        "Just what I hoped it would be. Simple and elegant.",
        "Good design. Tarnished and rusted. Had to replace in a year's time. Not worth the money.",
        "Love this tea kettle! Thanks for offering this quality product, Amazon!",
        "The kettle is nicely constructed, very classy mirrored finish. For some reason the lid fits very loosely into the top. If it is not held in place by hand it will fall off at a certain point as the kettle is tilted up to pour. That was a bit disappointing, but not enough to return it.",
        "This is all I hoped it would be: beautiful, highly functional, and well made along with being SILENT. It is seldom that I purchase something that is so incredibly pleasing just to hold, look at, and use.",
        "This is a very well made tea pot that is apleasure to use and most likely will be the last one you will ever buy.",
        "Be prepared to wait several months for this product to arrive from Japan, but WELL worth the wait!",
        "Great kettle, got to use on induction cooktop. Works as advertised.",
        "When I opened my box and took it out I was in ahhhh it is so beautiful. I'm a tea drinker I use it daily, it boils water fast and it feels sleek and clean. I love it and I'm sure its going to be my tea kettle for a many many years.",
        "I gave a 5 star rating because of the design and function of this wonderful kettle. I recieved this as a birthday present and its a welcome change from the other kettles Ive gone through. No metal taste or smells from the heated water, pours in a controlled manner, cleans very easy, and comes to a boil fast. I did notice a sloppy large welding band that streched around the bottom half of the spout connecting it to the pot. Not an issue for me. This is a great kettle, would recommend!",
        "This beautiful kettle completed my kitchen renovation project ! Love it.",
        "given as a gift, nice shape and stainless steel. looks nice on the stove :)",
        "I have burned myself because the pot builds up team and does not come out of the pot smoothly.",
        "Beautiful, functional, ergonomic piece of art for the kitchen that does a swell job boiling water.",
        "Beautiful well made teakettle, looks better than the picture. Shipped quickly, great service. I look forward to using this for years to come! Thank you.",
        "Just got our Sori Yanagi kettle and we love it! It's ok if it doesn't whistle because it's so classic. :)",
        "I love my Sori Yanagi kettle. It works great, and is a nice to look at as well.",
        "Pictures do not do it justice. This is very attractive kettle with a highly functional design and it rapidly boils water. We love it!",
        "Love its look and it is easy to handle when full of boiling water. Very light weight and easy to pour.",
        "I never would have guessed that having a kettle that doesn't whistle would be a problem. This doesn't and while I still find it to be a wonderful, high quality product, I wish it did alert you when the water was at a boil.",
        "It's doesn't even look close to the Sori Yanagi (not that it would matter because it's a huge pile of trash). I received a cheap, crappy, horrible COPCO tea kettle. Wow. Buyer beware.",
        "Do not purchase. They sent an inexpensive COPCO kettle with a sticker on the box claiming to be a Sori Yanagi. Peel the sticker up and it says 2010 Wilton Industries COPCO 1.2 qt steel kettle. This is definitely not a Sori Yanagi kettle.",
        "precautions are printed in JAPANESE-- For an expensive item precautions are only printed in Japanese. If precautions are required they should be communicated in English (American).",
        "This is a very high quality product. Every detail is perfect, from the stainless finish to the welds. It's bigger than I thought it would be and provides adequate hot water for about 10 cups of coffee or tea. It is a joy to look at and feels great in the hand. The cost is reasonable, perhaps even cheap, considering the quality. The kettle gives back a little pleasure every time it is used.",
        "This is much more solid than the ones I've had in the past, and smooth and well made. It is easy to clean with a large opening that I can reach into and really clean off the hard water. It is not whistling, but that has been okay. Big capacity but not unwieldy to pour and hold when full. Handle moves completely out of the way of the opening which I love. Overall nice design, simple lines, and exactly what I wanted. Have had it many months now and zero issues.",
        "Great so far - only had it a few days. It has a Sori Yangai stamp on the bottom. It's a really pleasing design, simple and beautiful. People complain about it sputtering when poured - just pour slowly and you'll be ok. It just sputters when people try to pour it too fast and the steam gets trapped behind the water flowing out. In our house we use this kettle about ten times a day, so I'm glad to have a teapot that's not got lead or aluminum or god knows what.",
        "I would go through a kettle like every few months. They would rust or, one of them had paint chips flake off? My grandmother loved finding me a kettle on a 'deal,' after I inevitably threw the nasty rusting ones out. I'm of the mindset to spend the money on good products once instead of over and over buying garbage made to fail. Goodness this is an expensive kettle! Best one I've had though. Boils water fast. Pours well. Seems of excellent quality. Time will tell. Hoping this is the one.",
        "So thin; the lid falls off as you pour the hot water out; the handle doesn't align with the kettle, stays at an angle unless you move it to the right location with your hand, rather than just picking it up and having it align properly. Such a ridiculous waste of money. It looks nice but as we all know (or should know), looks aren't everything!!",
        "I used this Kettle with no problems until about 6 months ago. The handle start to fall to the side causing it to be burnt by the gas flame. It was still usable but it was ugly. Then it started falling off to the side every time. I had to just throw it away.",
        "I have only had this pot for about 3 months. When ordering it, I was very careful to get a good, quality pot. After checking out many and reading all the reviews, I felt that this was the pot for me......... even though it was VERY expensive for a teapot. I decided to forgo the expense because I would be getting a very good teapot. Well, even though I am very careful to empty it out after each use and dry off the lid inside and out - it is rusting! I'm very upset! It's not worth the hassle to return the pot, but, I do not recommend buying it....unless you're OK with rust.... and paying a lot of money.",
        "Like the other reviewers said -- rust developed after 6 months of daily use -- inside the spout and inside the kettle on the connection between the spout and the kettle. No thank you for a $70 \"stainless steel\" kettle that rusts.",
        "I bought this product to heat up water in the morning to put into an insulated pitcher to quickly make instant coffee throughout the day. Unfortunately, it drips bigly when I pour the hot water into the insulated pitcher or other vessel Sorry but I can get a drippy stove water kettle for less than ten dollars at WalMart. Screw the looks. Do not waste your money on this product.",
        "If, for some reason, you are looking for a kettle with no whistle, this one is great. I happen to like the whistle, but my partner does not. She got this for me about six months ago, so there you have it. It's a great looking kettle and it's nice and heavy. I expect to be using it for a long time.",
        "Love this kettle! I finally found a great kettle. It’s bigger than I thought it was, but it’s very lightweight. I was surprised at how easy it was to pour. Usually, something that size would hurt my wrist. I highly recommend this product.",
        "Few will pay this much for a kettle. If you're contemplating this one you fall into a different group. After months of daily use I can say it was all that others said. The old Revere pot went in the camper. The two best surprises have been how much faster it heats water, and how much I realized the old whistle was irksome. Love the gentle rattle of this kettle. Update: Months later of daily use, I'm continually impressed with this pot. Again, surprisingly fast boil, pleasant rattle when done, solid heft. Plenty of volume for the largest Bodum Fr press.",
        "If you have a stove -- and you want to boil some water -- you absolutely need this kettle! It has a soft pour. I've been through many kettles, and this is the most structurally unmitigated that I've encountered. It's like the Ferrari of kettles.",
        "This is a superb kettle and is just the right size for two folks to have a tea break. If you want to see it in action, watch Ghost in the Shell. Motoko's mother uses one to heat the water before she makes tea. Sits firmly on our wood stove and transfers the heat effectively.",
        "Love the shape Too bad the insides are turning !!! Have to throw it out complete rust inside the kettle",
        "An exceptionally fine teapot. Light weight yet sturdy, easy to fill, heats quickly, pours wonderfully! The insulated hand is the *perfect* size for my average size ( female) hands. My teenage sons think the handle is ok, but aren’t able to use the grip demonstrated in the manual due to their longer hands.",
        "While the pot is very pretty, I am very disappointed with how loose the lid is. There is no friction whatsoever to keep it on. I expected more from the price tag and am worried we may get burned pouring boiling water. Is this normal or a defect??",
        "I was excited to open my new teakettle, but I found a cheap Farberware teakettle with a sori yanagi sticker on it. Returned with no problem, but I see several other buyers had the same issue. I waited a couple of weeks and re-ordered the kettle, this time it came from a different supplier. Now I have a work of art. Simple, elegant and it boils water, doesn't drip and it looks great on my stove.",
        "This is not top quality: It is not a one-piece kettle - the spout is welded to the body. While from the outside this is barely noticeable, from the inside - it can lead to rust. As happened to mine, after about 2 months of use. Image attached, *after* I tried to wash it off.",
        "My old tea kettle were still good but some what this tea kettle catching my eyes, maybe the way it look or the way people rate them anyway I end up purchase it , when it arrive I took it out the box , look for any defect could not find one. I start use it right away and found out it heat the water faster than my old one, I replace the old one with the new one enjoy it every day now..",
        "Absolutely gorgeous tea pot. The black top gets hot but doesn't burn my fingers, and the kettle doesn't whistle (so it doesn't wake up my roommates when I want to make tea at 1 am). Warning: Be careful about pouring the last few drops of hot water. A few weeks ago, I was trying to get out the last bit of water, and the top fell to the floor, causing the steam inside the kettle to hit my hand. I quickly put the kettle onto my counter, but did receive a small second degree burn on my hand."
    ]
}