{
    "entity": "Tea Kettles",
    "text": [
        "I have had this Tea Kettle less than a month. Already the lid on the spout is melting and leaves an odor of melting plastic in the kitchen air and beyond.. I can't imagine it's good to breathe the chemicals. I am considering returning it before it makes someone sick. Don't buy this Revere Kettle if's a total dud!",
        "Ring mechanism to open kettle broke in two, used maybe twice per day. Never roughly used. Previous kettle lasted 30 years -- clearly not manufactured to same standards. Note that the limit for returning product was 30 days, but a tea kettle should not break down in less than several years at least, in my opinion. Very disappointing. Mitchell",
        "The handle gets so hot you have to use a pot holder on the handle. I have almost dropped it several times trying to push the button with that area being so hot. Going to through it in trash.",
        "Saw some review that said Revere is not quality anymore. I purchased this to replace a 25 year old Revere kettle that was still functional but just looked stained and worn. I was extremely pleased with this kettle. It looked and felt just like my old kettle. I see no difference in quality compared to old kettle.",
        "Found out they are not made anymore and you have to find one that is still left to buy. Couldn't find the large one so only one left was the smaller version. I have one of these in our travel trailer and it is great. So when the larger one in house wears out I'll have this one to replace it. Nothing like the old Revere ware pots, pans and kettles!",
        "This is not the original Revere tea kettle that it resembles. This one comes in two sizes: too small and way too small. Because the diameter of the base is small, heat from the burner comes up the sides of the kettle and heats the handle which gives off an odor like an electrical fire and becomes too hot to touch. Globalization gone bad - again.",
        "I've owned mine for several years and love it. It get's used easily 4 days a week and still works great. The finish has held up well and continues to look good on the stove. Simply put, I would order another if this one ever gets stolen. I don't expect it will break.",
        "Had one of these for many years, finally needed to replace. Because we were so satisfied with the original bought the same thing. However, this one is made in China and it shows. It doesn't whistle. Upon inspecting, it appears that the bracket that holds the pivot pin for the spout cap is welded on crooked and it does not let the spout cap seal, so all the steam comes out around the cap rather than through the whistling port. We have to have a whistle, having already ruined a glass top range without having the whistle alert on another teapot. It will be going back and our opinion about Revere products has been changed.",
        "I bought this on Amazon as a replacement for an old Revere kettle, and like some others here it was a big mistake! Don't bother buying this tea kettle - these new Revere knock-offs are cheaply made junk. Within 6 months of buying this kettle it started to leak around the bottom edges! Metal is thin, stamped joints are poorly made.",
        "I purchased this as a replacement to a very similar Revere Tea Kettle I have owned for close to 25 years, despite reading the comments that said the \"Made in China\" version wasn't as good. I've only had it a few days, but it looks and feels very much like my old one. I don't see a huge difference in material or construction. I suppose time will tell, but at the moment I am very happy with it.",
        "A present for my wife. She had one exactly like this for 20 years... finally broke down, and she asked me to get a new one. I bought a different kettle which had better reviews... but she had me send it back and get this one. Her favorite feature is the hook that allows you to pull the whistle top back and leave in place, instead of most kettles which have the whistle top as a separate piece that needs to be removed. Plus it's not too heavy, which makes it easier to hold and pour when the kettle is full.",
        "This is my favorite model of tea kettle. I like that it does not have an additional unneeded lid. It also whistles loud and reliably. It seems to get 2-3 years of continual service before it breaks, which is longer than more expensive models that I did not like as much lasted. I would buy this again and have!",
        "There has always been one of these in my house. I grew up with one, I bought one when I first got married and I hunted one down for now. The rest of them are still in use I just dont have them. But this one I do. If you buy anything else your wasting your money.",
        "Such a cute kettle but the inside bottom was covered in rust. Shined a light in it before I went to use it; glad I did. So disappointing. The exterior was in real nice condition.",
        "From the moment I opened the box, I was disappointed at the flimsy construction of the handle and the plastic lever. It wasn't a couple of months before the metal whistler fell out. I was able to push it back in until recently and now it is just broken. It won't stay in and the steam released when it is out makes it dangerous to use. I grew up with a Revere tea kettle on the stove and I am appalled at the lack of quality in the materials to make this kettle compared to the ones made 20 years ago.",
        "After reading all the mixed reviews I have to add my two cents. I too remember this teakettle from my past. I haven't had a teakettle for many years and I recently decided I wanted one. No matter how hard I looked, I could not find something I really liked. I even bought one at a local store and because I wasn't 100% happy with it, I kept the receipt and I kept it in the box. While browsing Amazon I discovered the Revere teakettle, read the reviews and took a chance. I am very happy. No leaks, it fits the small burner on my electric stove perfectly and I returned the one I bought locally. Respectfully submitted, John",
        "It boils water, has a good whistle, and pours well, without dribbling. However, it looks and feels cheap. The bracket between the black handle and the kettle's body is a thin strip of metal that, fortunately, does not have sharp edges. However, it has become bent with use, which contributes to the cheap look. The \"Paul Revere\" stamping on the side of the kettle distorts the metal around it which again makes it look cheap. We bought this as a replacement for the larger Revere kettle, which is no longer available. This is not an adequate replacement for the larger 4-quart kettle.",
        "The first one I got leaked so I returned it for another, this one is fine, but compared with the exact same teakettle that I replaced, it is nothing like the quality of my old one.. They don't make quality anymore like they used to, just a matter of fact..",
        "While I don't doubt this is a quality product, it is so small it looks like a children's toy. It looks ridiculous on my stove top. I wish it had been pictured with the larger tea kettle for comparison.",
        "Quality was nowhere near the quality of my original that I used for more than 40 years. Not worth the price but the style is perfect.",
        "I bought this teapot for my lady, because it goes with her retro kitsch aesthetic. Plus, it kind of looks like a curling stone, which is cool. It's inexpensive and pretty good looking. The metal is VERY thin, and the kettle is light. This means...it's just not a very high quality kettle. I guess that's fine, considering the price. Also, the plastic somehow melted on the stovetop. I'm willing to forgive this, and chalk it up to user error, as the stove is one of those beastly Wolf commercial ranges and was probably set too high. Revere is off the hook for that one. So, it's a cheap teakettle, both in price and build quality. Meh.",
        "Searched high and low for a tea kettle made in USA with no luck. I have an old revere that I dropped and broke the lid on so needed to replace it. Bought this and was very disappointed in the quality. Much lower than my old revere. Old Revere was made in USA this one I believe is made in China. I returned for a refund and bought a Medelco 12-Cup Glass Stovetop Whistling Kettle and paid under $10.00 for it! I am very satisfied with it and it is made in the USA.",
        "\"Earl Grey Hot\" is what you get with this tea kettle, but any flavor will do I suppose :-). This is a wonderfully made, beautiful copper bottomed tea kettle. I can not say enough good things about it. I have never had an issue with anything from Revere. I use my Revere cookware everyday. It's easy to clean and always a beauty to look at. In my opinion there isn't a better tea kettle at any price. Handle is always cool, water pours easily, and without dripping or spilling. The whistling always makes me smile. Anyone care for a spot of tea?",
        "This was a Amazon Prime Order...product was very cheaply made...would not hold up...very flimsy...returned it right away I paid Grand Total: $34.37 I was only refunded a Refund Total $25.64",
        "Works perfectly. Don't put it on max heat on your stove since it has a copper bottom, or you could scorch it. Putting it at medium heat still gives me hot water fast because of the design and materials.",
        "Pretty good, but the nozzle seems to have gotten worn a bit quickly. Delivered/packaged just fine.",
        "The bottom does not touch the burner. The edges sit on the burner and the bottom is slightly above the heating device. That is an inefficient use of energy. Why have a copper bottom when it does not touch the heating element. It is simply a hot air pocket underneath. Be aware there is no way to fill the device except the spout with the whistle device.",
        "Had one of these for most of my wife and I's married life-- 55 years. Finally burned it up. This is an exact replacement and it works like a charm. Very pleased. Quality has not changed. This one is just as good as the previous one.l",
        "Extraordinarily displeased with this product. Although the picture gives the impression that it would be a proper replacement for a 'revered' Revere Ware kettle we'd had for years, this is simply a cheap knock-off similar to any you can find in dollar store. To make matters worse, it the size is about equal to what you are viewing on your computer screen. Tiny, at best, it holds just about enough water for two big cups of coffee.",
        "It looks really nice, but the copper and the steel is very thin. The cap opener difinitely feels cheap but it work and it seals. It feels light weight. But it boils water, you dont burn your hand on the handle and is not leeking. I gave 5 stars because it works and it real steel and copper, and is not that expensive. It make the tea noise anyways and very loud too.",
        "i was kinda disappointed, the opening to put water in is the spout, which is about the size of a quarter, the handle gets really hot, I burned my hand the first time I used it not expecting the handle to get so hot, I’ll use it until it’s broken but I don’t recommend it.",
        "Although the body is fine, the handle controlling the spout is flimsy plastic and broke in 32 days of use. Amazon will not allow a return so I am stuck with a useless kettle, which I can not recommend since its plastic is so poorly made. Thankfully, I kept my old IKEA kettle, which still works. Shame on Revere for sticking such a cheap piece of plastic on an otherwise good item!",
        "The only downside is that this product is not made in USA. The handle also gets a little hot - whereas the Revere-ware kettle my mother has from the 1980s has a thicker handle. Good kettle,great whistle sound. Water dribbles out a little bit when pouring, but not terribly. Already seeing green stains on the copper after only a few months. Overall I like it though, and I would buy this again.",
        "This is nice quality like you would expect from Revere ware. The design is lacking. It is so small it is a hazard to pour boiling water from. The handle is too close to pot and it gets quite hot at times. There isn't enough room to use a hot pad.",
        "Lid does not stay open for pouring. Very difficult to pour while pushing the button. Would not recommend.",
        "very small which is ok, but the handle is ridiculously small and burns your hand when pouring and it doesn't even whistle. returning item for sure!!!! Digging my old one out of the trash.",
        "Lives up to the Paul Revere reputation. My second purchase of this tea kettle, only because I wore out the last one after many years of upteen times of day use. It was almost completely full of mineral deposits from the hard water of the SW. The smaller size is easy to set off to the side on the stove.",
        "I love the look of this tea kettle, and that it whistles cheerfully, but the handle gets way too hot to...handle, like, scalding. We tried putting different amounts of water to make sure that it wasn't that we were filling it too much or too little, but with each test, the handle was untouchable with bare hands. I don't want to have to use oven mits every time I make a cup of tea!",
        "My first one (probably a different manufacturer) lasted 35 years. This one lasted 3 years before the plastic around the whistle crumbled so it won't whistle anymore. Maybe it got bumped; I guess I'll try buying another one.",
        "Having burned up two non whistling kettles, decided to try this Revere 2 1/3 quart whistling kettle and am so pleased with it. Not only will it whistle, but also has a tiny little feature that will allow the cap on the spout to stay open , if the whistle feature is not needed, which is handy early in the morning for not disturbing late sleepers. The copper bottom lets the water heat faster, and the size is perfect for our use. Very happy with this little kettle!",
        "I bought this kettle to replace the one I took from home when I first moved out over thirty years ago. At the time, this was my Mom's \"extra\" kettle as she had two from her engagement and this one wasn't used daily. For the past thirty-something years this kettle had been used daily in my homes and finally the mechanism controlling the spout wore out. I had no choice but to buy the same kettle again and ensure daily use for the remainder of my lifetime! Good, sturdy and plain old water boiling kettle. Still whistled every morning. Well worth the minimal price.",
        "Not like the Revere of old. Does not feel substantial in your hand.",
        "This was an exact replacement for the kettle I left on the stove with no water in it. My original kettle was at least 20 years old and it still worked perfectly. I was very glad to see that the new one was of the same quality and heft as the original. The size is perfect, smaller than most kettles which are way too large for just a cup or two of water. I'd buy this one again without hesitation.",
        "The kettle will not whistle loudly and water comes out of the spout when filled to 6 cups. This was a replacement kettle for a friend who had had one of the exact same kettles from Revere for many years and wanted a new one because hers was finally getting ready to be retired. I am very disappointed that this product is now made in China instead of in America where it was previously made.",
        "This kettle is just about perfect. The handle is easy to hold. The cap lifting mechanism works just right and is easy to use. It looks nice, fits the burner correctly.",
        "There are so many teapots with all sorts of gimmicks and many for outrageous prices. We are simply boiling water here and in my case, mainly for tea. This does it fast with the copper bottom, has an undeniable whistle you can't ignore (unless you're deaf) and looks fairly nice on the stovetop. It's also inexpensive so it's a good price value tradeoff. The only reason it doesn't get 5 Stars is that it's nice looking but it's not an aethetic masterpiece. But I'm pleased with it and use it multiple times daily.",
        "I gave this to my daughter-in-law. She is very pleased.",
        "Perfect tea kettle. Great handle, easy pour. Those high handle tea pots that are all over the place are junk, IMO. Get this tea kettle, you wont be disappointed.",
        "My mother had a revere teapot she used for decades, I had one for years but very disappointed to find in this newer version that handle gets too hot to handle without protection. This was not the case in the tea kettle I used for years. I like this style for ease of pouring. Not sure if same manufacturer.",
        "Bought this to replace one that we had for years. Really NOT made like the old ones. There are better ones on the market. Also, the \"cap\" melted after a few uses...Seemed like cheap plastic. I'd look elsewhere.",
        "I grew up with a classic stainless Revere tea kettle like this. My mom drinks tea daily and the familiar whistle is the sound of nostalgia. This is a high quality product - no fancy \"bells or whistles,\" other than the intentional sound. Great tea kettle!",
        "This tea kettle is not as well-made as Revere Ware tea kettles from 30 years ago, but it's definitely good buy, I'm happy with it, it whistles and doesn't sputter.",
        "The Revere Kettle isn't well designed. Because the diameter of the kettle is so small, heat travels around the edges and makes the handle very hot. And, using an oven mitt is impossible due to the loop-shaped trigger for the spout. Of course, we can use it on a normal burner, and it's just fine... but very slow... So slow that my wife took it off of the stove and put in away, which means 0 use.",
        "This tea kettle was much smaller and lighter than expected. I returned it immediately for a refund.",
        "it was broken when I got it, I was very disappointed, never whistled that part was broken off :-(",
        "This is the perfect tea kettle. My plastic lid on the first broke after many years of regular use, so purchased this exact same product to replace it.",
        "This product used to be a good product. I had two that lasted for a over a decade each. But Revere is trading on its former glory -- this product is noticeably inferior to the Revere kettles of the past. I threw my latest Revere kettle out in less than a year -- the spout was not properly attached to the body of the kettle, and leaked water every time I poured hot water out of the kettle.",
        "Very disappointed. It gets so hot that you need a pot holder to empty it and I am sure the flip handle will wear out quickly. Not as big as I hoped, partially because you can't fill it very much and still be able to handle it.",
        "I have always had a Revereware teakettle. Love the size, how it is easy to lift and the handle fits my hand. Pours hot water without burning and the ability to 'turn off' the whistler is a bonus, sometimes we use it, sometimes we don't. Over the last 40 years I've owned 3 and never would think to buy anything different (although I've looked at other teakettles always come back to this one).",
        "This product is flat out dangerous, and should not be sold by Amazon. Stay cool handle is a flat out lie. Handle gets scorching hot, and if you use an oven mitt to prevent burns, you can't use the lever to open and pour. Kettle is going in the trash, where it belongs! Shame on you, Amazon,for even selling it.",
        "Need some hot water? Want to know when it is ready? Don't need a whole lot of hot water? Want a Tea Kettle with some style and function? Look no further. Possibly the best Kettle I have owned. the whistle is load enough to hear but, not ear shattering! I have had some that were painful! This one is pleasant.",
        "I am not at all pleased with this kettle. As another reviewer said, I grew up with Revere Ware and expected a good product. I still can't understand what is going on, but it takes FOREVER for the water to heat up. This is also much smaller than I expected. Very disappointed!",
        "I am 53 and purchased this for my mom who was a Revere fan years ago so I thought she'd like this. Actually really cheap compared to how Revere used to make it. And, I realized I have owned one of these before and the skinny plastic leading up to the spout lid broke within a few months of usage and I can see this one will probably to the same. I am not returning it however, not worth the hassel. Just won't buy anymore Revere products online without seeing them first as they are not at all made like they used to be.",
        "This kettle makes a mess with every pour. It's as though the spout is designed to create a spill. The kettle is clearly manufactured well with high-quality materials, but it doesn't function as it should (unless you intend to clean your counter every time you pour yourself a cup of tea).",
        "This is the second tea kettle I have purchased in the last 25 years. My faithful Revere tea kettle of 25 years finally developed a crack near the spout that dribbled when it poured. It was time to replace it. I looked around but nothing on the market or the web looked as good as \"old faithful\". I bought the same Revere tea kettle, and I expect it will last l long time.",
        "small size for small stoves , but still holds enough water for a a 8 cup french press coffee maker and a little extra water. Only the handle gets very hot after boiling the water,like so many other kettles. but still is a good pot to boil water for coffee or tea. The whistle is loud enough to hear it in small apartment. it won't bother or wake up everyone, but still you'll hear it. Easy to clean or wipe off spots.",
        "Nice quality kettle, but the 6 cup kettle i bought splatters and shoots boiling water out once it hits boiling point. So not only do you get the whistle..but you get boiling water spitting and shooting out of it. I think this is just too small for its own good. I usually only fill it part way to keep the eruption to a minimum. Also my elctric stove I only use this at about a 6 or a 7 so the coils don't get too hot. Think twice on this cute and small kettle. I put a picture up of this eruption in action.",
        "Well, it's fine but I did not realize it was BARBIE size. I guess I should have paid better attention. Other have said the handle gets hot but I have not found that to be the case. It just looks so small sitting on my stove top.",
        "DONT BUY OR AT LEAST PAIR WITH BURN CREAM!!!! What a disappointment. Looks just like the kettle,in my house growing up in the 70's. There should be a thimble next to,it for scale. The issue is because of the small scale there is no way to grab the handle without burning your knuckles on the top of the kettle. The handle gets very hot and the clearance between handle and kettle top is too narrow, hence burn fingers evey time. Tossed the darn box so I'm stuck with it.",
        "Small and compact, but takes a long time to boil water",
        "I purchased this kettle bc of how quickly it boils water. I have had it for 3 days and the whistle has fell apart. I do not have the box any longer, and certainly did not anticipate this. How can I have this replaced for one that is not defective",
        "The handle is very close to the top of the kettle. When I used it the first time, my finger brushed the top and got burned. The company refused to take it back because it was used.",
        "The tea pot is ok but it's a DISGRACE that the entire packing materials are overwhelmingly smokey. So much so that even the stainless steel tea pot smells. Very unprofessional.",
        "The seller did not disclose that the kettle had a replacement whistle top that did not have the stainless steel accent.",
        "I bought this tea kettle in hopes of getting a duplicate of the revere we had when I was growing up. This is not it. It is constructed of flimsy feeling sheet metal, the copper bottom is thin, and the plastic handle is not of the same construction as they used to be (70s,80s). If you buy this having used a similar kettle in the past, you will be disappointed.",
        "Not the same kettle that I got in 1990 but it works fine for heating water. The whistle is not very loud so you cannot hear it from other rooms. I am not sure if Revere even makes the kettle that I originally purchase many years ago but this is a little disappointing.",
        "Although partial to Revere, this kettle has been a disappointment. First, the handle gets hot. There is no need in this day and age for me to have to grab a hot pad in order to pour boiling water.The other problem is that the lever to pull the cap open sometimes sticks and you can't raise the cap up. This is admittedly an intermittent problem but is a design flaw unacceptable. I intend to purchase a different kettle.",
        "Classic teapot. Boils water and looks great. My old version of this same pot had a piece of metal pressed into the lid from the bottom that created the \"whistle hole\". After many years it came loose and fell in. This new one has two pieces of metal pressed in from both top and bottom. They improved it so it will hold up bettter. Really nice to see someone making their product better, instead of just cutting corners all the time. Now, if they could just make it in AMERICA, I would be happy.",
        "No way should the manufacturer, or Amazon, say this tea kettle has capacity of 2 1/3 quarts! When that amount of water is poured in, it totally fills the kettle and is dribbling out the spout. It cannot be used like that.",
        "Not quite the same as the 'old' ones we used to have, but it works!",
        "A great tea kettle. My previous was was also a Revere (made almost exactly like this one), which lasted about 17 years. It is very light weight, the grip is very comfortable and the kettle pours without dribbling. My only worry is that in 17 years or so when I need to get a new one they won't be making them anymore.",
        "I bought this for a friend who had burned up her previous Revere kettle and wanted only a Revere Tea Kettle. She could not find one at the store and was very happy when I gave her this one. It is just like the one that she had previously and loved.",
        "I looked everywhere for a Revere tea kettle to replace my old one. I am very pleased and the price was very reasonable, better than I've found in stores anywhere. Thank you.",
        "This tea kettle is ridiculous, you heat the water until the whistle goes off and gosh darn it if you cant even pick up the kettle bare handed. WHAT is this? My family has had revere ware for over 50 years and this was very disappointing.",
        "This replaces a similar teapot which we had for many years - but my wife dropped it and the handle broke The new pot is smaller and seems to be made of thinner metal..A good feature on the trigger release for the spout is the hook that allows you to pour without holding the hot trigger. Also there is no central cover. But it does the trick - good for heating water.",
        "Great kettle, low price, good whistle. I am however a bit concerned that it may rust eventually since there's no easy way to wipe the inside to keep it dry. It will eventually have to rust since you cant dry it properly, but it's great for now!",
        "Good, but not great. The lever to open the spout cover doesn't seem sturdy, so I'm not sure how long this will last, but presently it is doing the job just fine",
        "While growing up the Revere tea kettle was always displayed on my Mom's stove top and used daily. When she passed away we kept her kettle for ourselves. We only recently ordered a new tea kettle and retired the old one. It is sturdy and heats up water quickly. Easy to clean. This little tea kettle is perfect for the needs of 2 people. It definitely brings back good memories..",
        "Within just a few months of owning this tea kettle we started to see water leaking from where the copper bottom meets the stainless sides. And since we are outside of our return window, there's nothing we can do. We probably use it 2-3 times a week. It seemed to be a pretty popular kettle, kind of a \"tried and true classic\", but if it doesn't hold up to light use in a married couples home, what's the use??",
        "Teapots in general seem to be inferior to the revere ware kettle. Either they can't whistle or they rust. My grandma appreciated hers in her later years because she could hear the whistle. I don't know how long they've been made in China, but this is the first one I've bought in 20+ years so I can only compare my old one to this one. The whistle isn't as strong, otherwise it seems alright. If it lasts me another 20 years I'll be ok with it.",
        "This tea kettle replaces the same brand tea kettle that was purchased at a Goodwill store many years ago and developed a small hole in the bottom. This feels comfortable to pick up and pour and looks really nice on our black stove. We hope it will last as long as its predecessor.",
        "The rim on the bottom of the kettle prevents contact between the kettle bottom and a flat (electric) stove burner. I found unlike my previous kettle it took much too long to come to a boiling point. I have been using Revere Whistling Kettles for over 50 years and have never had this problem before. Other than that I have loved them and hope to find one that does not have this problem.",
        "I've had this kettle for about a month now and overall it's a good basic kettle. It does not have a lid so it can be a little awkward to fill but then there is no lid to lose. I am concerned that the hook attached to the lid won't hold up over time since it's cheep plastic. The hook can also be a little tricky to latch when trying to open the spout.",
        "The bottom does not quite touch the flat ceramic stove top and that slows the boil. It worked better on the larger burner. On the bottom: \"Revere Ware; China\". I have a swarped sense of humor, so I thought \"The Chinese are coming! . . . three if by web.\"",
        "Bought this to replace another Revere whistling tea kettle that was probably about 25 years old. Especially like the copper bottom.",
        "It has been at least 40 years since I have not had a Revere tea kittle sitting on my stove. This is a true classic and is as good as ever. The only thing that has changed is that I can no longer hear the high pitched whistle when the water is boiling - but that is obviously not the tea kettle's fault!! I love it. What else can I say?",
        "this whistling tea kettle is great. we wanted one that whistled loud enough so we could hear it even far away. These type of kettles are hard to find in the stores so I ordered it on amazon . there were many to choose from and the price was reasonable and it was shipped in a timely fashion. I recommend this product to anyone who wants a good and reliable kettle.",
        "Have always had a Revere kettle on the stove except for a few mistakes all of which never lasted long. Was concerned after reading some of the reviews from when production was first moved to China (my previous Revere kettle, which lasted around 20 years was made in Korea). But I think they must've worked out production problems because this kettle is great. Even got another one for my Mom who's also very happy with hers.",
        "Great teakettle. I like the notch to hold cap open. Used to have to put stick in to hold old pot open to not whistle. New pot has rather quiet whistle. Wish it was louder so it would wake me up! Not sellers fault. Fast service. Good seller.",
        "The best tea kettle. Husband dropped the first one we had forever and dented it, but still worked and whistled fine, he just had to have a new one."
    ]
}