{
    "entity": "Bread Machines",
    "text": [
        "I think our machine is defective, because we followed the directions very carefully (4 times, with different recipes each time!) and got the same results each time - dry powder on top, hard as a rock bread on the bottom, with a 3 inch diameter hole in the bottom of the loaf from the paddle. I emailed the manufacturer last week, but I have not yet had an answer from them. If I don't hear back in the next few days, I am returning the machine.",
        "I’ve tried five or six times to make a loaf of bread and this machine simply does not cut it. Too dense, not cooked enough, did not rise correctly are 3 issues I’ve had",
        "This is an awesome little machine. You may find that you have to adjust the yeast in your recipe, as I did. The first loaf came out rather dense. After doubling the yeast, it came out perfect. Note: you cannot select light brown when you use the timer for delayed cooking, however, the crust came out perfectly anyway. This machine does not \"rock\" off the counter, as other units do. It is a heavy, quality product. I would highly recommend. The one pound size is great for households with one or two people. Love waking up to the smell of bread cooking. It's positively sinful. This makes a wonderful holiday gift.",
        "works for a few times then stopping working. Poor customer support. not worth the money!",
        "This machine has been a life saver!!! Having a child with multiple, multiple food allergies and not being able to buy bread--even gluten-free ones, has been quite a challenge. I used to spend 5-6 hours over the stove/oven watching dough as I made allergy-free bread the old-fashioned way. With this machine, I just put all my own allergy-friendly flours/starches in the machine, hit a button, go do other things, and three hours later, I have a loaf that my child can safely eat. It is worth every penny!!!",
        "It does MOST of what it's supposed to. However, on the Quick Cycle, it's supposed to beep when you need to add nuts, choc chips, etc - IT NEVER BEEPS. VERY ANNOYING. So if I want to make a \"quick\" recipe that contains nuts, choc chips, etc, I have to stay nearby and add them while it's kneading. Kind of defeats the purpose of easy/convenient ya' know? Btw, it makes SMALL loaves. Perfect for a family of 3 like us. Also, I bought this when it was $100, not over $300 like now! Wow! I'd be really, really ticked off if I'd paid THAT much!",
        "Wow. So many positive reviews already. It seems silly to add mine. We travel in our RV and it's been hard to find anything other than super preserved white bread in much of our travels. This machine makes bread. Good bread. We use bread flour and Peak full cream milk powder in the recipes. Fresh, warm bread ready for the toaster in the morning. Easy to clean, works like a charm, and it does all the heavy lifting. Expensive, but well worth it. Buy this machine and be happy. And look for Peak milk powder (or Nestle's if you care) for dry milk that doesn't taste like dishwater.",
        "I purchased this bread maker a couple of weeks ago and finally had the time to make a loaf. I wanted to make some French bread with it. Though the bread itself came out nice, the crust I found was way too hard. I thought it might have been just me so I made another one the next day to see if it would come out the same. It did. I was hoping to set the crust option to light crust, however that option it not available for the French bread setting. I will try one more time using the French bread recipe but use the normal bread setting so I can adjust the crust setting. Hopefully that will work.",
        "I was skeptical about a bread machine since having made hundreds of loaves by hand for over 10 years but this is the bee’s knees. The single loaf that didn’t turn out was my fault for making an error in the ingredients, otherwise this machine makes incredible bread. When making heavy grained bread (favorite) I add vital wheat gluten. I never got aboard the gluten free train since I don’t have a problem with gluten like most people THINK they do.",
        "1. Inside surface of bowl will scratch easily. Avoid using any metal object to help remove bread or paddle. 2. Paddle get stuck in place. Needs an extraction tool that will not harm bowl surface coating. 3. If you miss the \"add chime\" for additional ingredients the is no way to stop and resume. Cycle will restart from begin. 4. Slight variations from recipes will result in large variations in results. 5. Otherwise mix and forget and presto - very good bread,",
        "I purchased this bread maker on December 17th 2008, making it 10 years old, and working like a it did on day one. I use this all of the time. I have never had a bad loaf, unless I have not watched it those first few minutes of mixing. If and when this little beauty goes south, I will order another one immediately. Perfection!",
        "Though I have heard many good reviews about Zojirushi Home Bakers, this one has not yet made a complete loaf of bread. Half way through the kneading cycle, something triggers an error message and ruins the entire loaf - and I have tossed out SEVEN batches already. Unfortunately, I threw out the box and packaging so now I am stuck with this defective breadmaker. Not a happy purchaser....",
        "I just received it a few days ago and thus far I love it..yesterday I baked a \"quick\" honey bread and it was delicious and it came out perfect...its an awesome appliance and I will really enjoy using it..i bought it to replace a larger Cuisinart machine and there is no comparison....i love the quality of a Zojurishi appliance...i also have 2 rice cookers that are amazing...thanks Zojurisji!!!!!",
        "During the Covid-19 pandemic, getting good, quality bread became extremely difficult. As a result, I decided to bake my own bread—the best decision ever! For best results, follow the instructions!",
        "No matter how light I try to make the crust, it always comes out way to brown and over-baked. I've found that if I take the bread out 10 minutes early, on it's lightest cycle, I can get the crust the way I like it. Of the 3 loaves I've tried, 2 came out ok and one erupted all over the inside of the machine. That might possibly have been partially my fault, but I do not find the instructions super easy to follow - mostly because of all the options presented in the guide. Will follow up with additional comments if I get the hang of it.",
        "my wife has been baking a lot lately, almost every day. the serving is just right for 2-3 hungry kids or adults. cleaning is pretty easy. very quiet. I don't even notice when its on. the aroma spreads throughout the whole house. you now have a say on what goes into your bread. overall, its a well made machine. this brand is very reliable and is one of my favorite kitchen appliance brand.",
        "I think this is the best. I read all the reviews. Never thought I would purchase a bread machine. For two this is the perfect size. And the instructions are so very easy. Don’t hesitate if you are considering a purchase. The cost was a bit high but only 61 loaves of bread purchased which we sometimes wasted! So happy bought one for my daughter and her family too. Love love love my new bread machine.",
        "Love how this is a mini! Is adorable! Best brand for a bread machine! Comes with an instruction book with recipies and a dvd, measuring cup and spoons. Still does pasta and jams! Has a handle and a cord holder for storage. It is a little heavr...like a case of bottle waters! But not bad due to the handle.",
        "I have been making my own bread for years to avoid all the additives that are in commercially available bread. I know what goes into producing the bread. This 1 lb bread machine makes a perfect size loaf for 2 people. The smaller size of this machine is easier for me to handle. The paddle comes free of the loaf easily which is not the case in my larger bread machine.",
        "I followed the instructions (except I took the tip and divided the flour, half on the liquid then dry ingredients then the remainder of the flour) and then added the yeast, closed the lid , and pressed the go button and at the appointed time I had a perfect loaf of whole wheat bread! Could not be easier be easier.",
        "I love the size and quality of this machine! 1 pound loaves are perfect for me. I'd rather bake every day or two and always have fresh bread on hand. I primarily make white bread for toasting and sandwiches. For added flavor, I prefer to pre-ferment 2/3 cup of water, 2/3 cup of flour, and 1/2 teaspoon of yeast in the fridge the night before (combine with a spoon or fork in a refrigerator dish). I then transfer the pre-ferment to the bread machine, add the remaining flour, powdered milk, 1/2 teaspoon of yeast, and salt.",
        "I love my new bread maker! I have not used the timer function yet but I have made bread (sourdough and white), jam, and cookies. Everything turns out well. I use it at least every other day and have not had any problems. I would buy it again. The only suggestion would be to buy a good bread slicer guide and a good bread knife.",
        "I just received this bread maker yesterday, and I made my first loaf of basic white bread today. It's perfect! Easy and delicious. I'm going to enjoy this....",
        "The bread from this bread machine is very dry. I have tried three different recipes. I followed instructions exactly. The bread was beautiful. It was so dry that it was not good, and impossiable to eat the next day. I have had a bread machine before, wore it out and replaced it with this one. I am returning this machine.",
        "This bread maker is very easy to use and makes very good bread. It's been nice to have during this pandemic period and I'm pleased with this splurge purchase. The one-pound size is actually quite good for a small family so I don't mind that it makes smaller loaves of bread than most other bread makers. I think most standard bread makers make 2 pound loaves and I've been having success with halving the recipes for those bread makers. The timer function is great as it allows you to put the ingredients in the machine at night and then have the bread freshly baked in the morning.",
        "I bought this machine eight years ago and have loved it the whole time. I use it once a week for basic white bread, and once or twice a month make banana bread. It's still going strong! It does leave a paddle hole in the base, but if you remove the paddle at the second rise (set a two hour timer) you can fix that. I love that it fits in a cabinet when not in use. A one-pound loaf is enough for five sandwiches if you cut the slices to a slightly less than standard size. It's perfect for a week of lunches! No complaints at all.",
        "The USP on this is it's quiet operation; that's why I bought this model (otherwise I would never have spent so much on a bread-maker) and I've discovered that it really is quiet enough to run unnoticed. It's not silent, but it's sound is a huge improvement from the typical thumping you hear from these machines. I would have preferred a large pan and larger loaf, but this is only available at 1 lb, and that small loaf comes out well.",
        "I bought this breadmaker for health reasons, as commercial bread contains chemicals and ingredients that are excluded from my low-histamine diet. The Zoji makes excellent bread with the mostly-organic ingredients I use. Following advice in the booklet, I've adapted a couple bread recipes found on the internet. One-pound loaves are perfect for the two of us, and of course, the apartment smells delightful while bread is baking. My husband has proudly made bread and enjoys the Zoji as much as I do.",
        "Making bread is so easy with this bread machine! I was not able to find bread flour or yeast. Used All purpose flour and bought yeast from a bakery. I've made several loaves of white bread...every one came out perfect. The 1 pound loaf size is perfect for my husband and me. Bread machine fits on cabinet shelf and the handle makes it easy to lift and place on counter. I'm looking forward to making other kinds of bread and pizza dough. Cleaning is quick and easy! Definitely would recommend the Zojirushi BB-HAC10 bread machine.",
        "I just want to say that this bread machine is amazing. Simple to use, easy to clean, very quiet and works great! The bread came out just perfect! I would recommend this breadmaker for small families. It’s fantastic!",
        "Love my mini bread baker!!! It's quiet and works with Perfection! The recipes which accompany the bread maker are excellent! Especially love the milk bread recipe as well as the one for walnut bread. Have also made the butter roll - always delicious! Can hardly wait to try the raisin bread, apple oat and chocolate bread recipes!! Clean up is a breeze too!! Having a lot of fun with this appliance and am definitely happy to own it!!",
        "The item I received has numerous stains inside, under the baking pan (see photos). The baking pan itself feels sticky inside. The manual does not recommend to submerge the baking pan in water since its outer base can get rusty. Obviously, this product would not be easy to clean. I’ve never used the product and my review is based solely on my visual inspection and reading the manual.",
        "I like this bread maker, I like the fact that it’s small enough to keep on the counter. I’ve baked several different loaves and I’m happy with that, however, I was going to make banana bread today and it says to use the kneading blade which is supposed to be included, but I did not receive one. Is there a way to contact the manufacturer and have one sent to me?",
        "I love this brand (has one that was great in Asia). This one does not function correctly. After a flop, the paddle was impossible to remove. My husband had to get it out for me. I’m very disappointed.",
        "It is easy to use and bakes very well with a great consistence. I have not used the timer function because I’m not interested in it. Our favorite is a rye bread and that comes well, even that I’m using my own recipe. It is also easy to clean, as after baking, the only part to clean is the inside bucket.the smaller bread size works for us. I would recommend this bread maker.",
        "Love this thing. Makes small loaves, so you don't wind up with too much. Different recipes come out great and tasty. So far no complaints. Little footprint on counter explains why lots of bigger breadmakers wind up stowed away in the cupboard and forgotten (though this stows away easily and doesn't take any space to speak of. I keep mine on the counter because I like to use it).",
        "This thing is great. It is simple to use, high quality and it makes excellent bread. My only complaint, which is not the fault of the bread maker, is... it’s too small. The loafs it makes are really only enough to make a few sandwiches. I highly regret not buying the bigger model and I suggest that you do the same if you have more than two people in your household.",
        "This is the best bread machine. Makes excellent pizza crust also. Great item. I listened to the reviews and they were correct.",
        "I love the small loaves it makes, easy to use. just follow the easy directions; the only minus is the sides and top get very HOT, this is in the booklette. for the price I would like to see some insulation; over all good machine",
        "Zojirushi is the absolute best brand out there for home appliances. I have a Zoji water heater, bread maker, and ricer cooker. I have never had problems with any of these items and they are in daily use for years. This bread maker is wonderful and makes the house smell great! I definitely recommend it if you are interested!",
        "This has to be one of the best, if not the best bread maker for a small kitchen like mine. The dimensions are considerably smaller than most bread makers. Build quality is impressive, hopefully the durability will be good also.",
        "Perfect for 2 people. I’ve been using it off and on for years. Here’s my favorite rye bread recipe for the mini. Makes a nice loaf that’s great for sandwiches. Dill Rye Bread 1/2 C water 1/4 C pickle juice 1 1/2 C bread flour 2/3 C rye flour 1 1/2 Tablespoon sugar 1 Tablespoon butter 1/2 tsp salt 1/2 tsp onion powder 1 tsp caraway seeds 1 tsp dill 1 tsp active dry yeast Add ingredients in order given. Set machine to regular setting.",
        "I got the used one. The price compare to the new one is not that cheap. So I think it should be in good condition. Unfortunately I’m disappointed about it. The handle is stored wrong way. Can’t use. There are a lot scratches in side. Also very dirty. Now I have to pay shipping fee to return it.",
        "It is by far the best 1 pound bread machine that I found. Zojirushi is a reputable brand internationally. It has all the features of other cheaper bread machine and more which can be found in their website. One thing that distinguish this bread machine from other cheaper one is that the operation is extremely quiet. Other than it is expensive, I highly recommend it to anybody. In fact, these was my second purchase. I bought it as a gift for my buddy's family",
        "THIS THING IS AMAZING! We bought this to make smaller loaves of bread with more control over the ingredients. It's so easy to use! The loaf size is perfect, and the instructions are easy to understand. We have a rice maker from Zojirushi and we're pretty obsessed with this brand, so we were 99% sure this bread maker would be amazing, and it is! The bonus is that it takes up so little counter space. Definitely a great purchase, and at the best price around.",
        "Great little machine! Have had a larger one for years, still works fine. This works equally as well, just a smaller loaf. Perfect whole wheat bread. Used fresh ground white wheat. Machine is SO quiet, had to listen closely for 2nd signal to remove paddle ( so no paddle hole.) before 3rd rise. Machine was packaged very secure & arrived in 2 days.",
        "I like the machine a lot. I make homemade bacon buns and this saves me time and effort by making the dough for me. The dough turned out perfect. I have made several breads. I like that it makes a smaller size loaf. Still trying to perfect the flavors like in a banana bread. Really easy to use. The size of the machine is great and fits perfect in a cabinet. I would recommend it.",
        "This is the best product for those of us in a household of two. Other bread makers make more bread than we can eat at one time. This half loaf is pretty much just right. I have found that the recipes provided can be easily tweaked to make breads that we favor. Really a good product. My only suggestion to the manufacturer is to make the hinge on the lid a little stronger. The hinge became loose on my first bread maker-- I gave that one to my son and bought a new one for ourselves.",
        "We love this. The bread turns out amazingly well and is perfect for our family of 2.",
        "The product is fine but I use prepackaged bread machine mixes and it’s VERY difficult to find them in the one pound size. If I had know this I would have bought a two pound machine :(",
        "I've always been afraid to bake bread...because I've always been afraid to bake anything requiring yeast. That sounds weird...but I've just known I'd kill the yeast somehow. And, I've just known the fine art of bread-making was beyond my skill. Rather than kneading the dough and gently punching it down, I'd end up beating it to death. That's just me. But, I've always wanted to make bread. Enter this Zojirushi Breadmaker (which I researched carefully before purchasing)! I made my first loaf today, and it's gorgeous! (Yesterday's loaf doesn't count...because I didn't follow directions, another of my little quirks.) Just beautiful...and yummy, too. Thanks, Zojirushi!",
        "Zojirushi makes a great bread machine. My second -just wanted a smaller one for a 1 lb loaf. Just follow the directions - if you do you can't go wrong. So easy to clean - great instructional DVD! Raisin bread was delicious and adapted a recipe from my 2 lb machine and enjoying Italian Herb Bread this week!!!",
        "Really love this little bread maker. A friend has already purchased it, and another is considering it. I've made whole grain breads (grind the wheat/rye/flax/chia mixture in Vitamix) and doughs for pizza and baguettes. For the whole grain breads I add a pinch of lecithin, Wheat gluten to help with the rise. Just the right size loaf for one or two people.",
        "So much nicer than other bread makers that I've had. It's compact and does an incredible job on making bread.",
        "The video showed a perfectly made bread, but mine came out looking like a science project, even if I followed the ingredients and procedure to exact measurement.",
        "Loving it after a month. It makes a perfect sized bread for one person. Still experimenting with whole grain breads but perfected one. Many versatile settings.",
        "For fresh daily bread in the evening perfect for two people. Bread not wasted.",
        "The breadmaker worked great initially, but then stopped working well. We went through all of the troubleshooting tips, but the dough would not mix all of the way and it would not cook. Very unhappy!",
        "I use it on my sailboat while cruising the Caribbean. I picked it for the smaller size and low power consumption. Storage and inverter limited. Use it every other day like right now...",
        "Loving the bread maker! Very good portion for a three people household. I used it made whole-wheat bread, and dough for dumplings, all came out very good. It is quite compact so doesn’t take up a lot of space to store. Love it. I want to try out the cake and jam recipe in the future too.",
        "This little Zojirushi BB-HAC10 breadmaker is perfect for smaller families. I have made a variety of breads and doughs and all have turned out perfect. The timer (as others have said) is a great feature if you like waking up to fresh baked breads. If you are a novice baker like me and only have two or three in your household, this is the machine for you! The compact design allows for easy storage on the countertop in small kitchens. It's super easy to clean too. Definately worth the extra $$ over other brands. I posted a pic on the main page.",
        "Follow the recipes at first then do try different things.",
        "Zo delivers again. I already have the Zo water pot and rice cooker which I love. This bread maker is terrific. Unlike a former bigger bread machine, this one has a stirring paddle that comes out of the baked bread leaving a small indentation, rather than coming out with an ugly hole. The paddle is very easy to remove for cleaning. Recipes for one pound loafs are in the included booklet. I have also found recipes for one pound loafs in other cookbooks. Using the settings for regular, not quick rise bread, gives you the most fabulous aroma!",
        "Great bread maker. The recipes are easy and the taste of the bread is wonderful. My family loves it. The timer function is very practical; I set it up at night and wake up with the smell of fresh bread in the morning. The bread is healthier, cheaper, and last longer than store brands bread. It's just the right size for my small kitchen so I keep it on my counter top. The 1 pound loaf is perfect size for my family and it takes no time to prepare if you keep your ingredients at hand. In addition, there is no need to have them at room temperature like other bread machines require.",
        "It takes too long to cook a small loaf of bread. Definitely not worth it.",
        "We really do not have any dislikes for this machine. This is our second zojirushi. We wore the first one out. There are just the two of us and this is the perfect size. We always have fresh bread, etc.",
        "Just received the product today! Very early delivery witch is nice, thank you Amazon employee! Just now put in my ingredients for regular white bread and should be done in 3hr. and 40 min. I'll shoot an update after I've had this product for 6 months .",
        "Love this little guy. Solidly built, easy to use. I throw ingredients in, not really worrying too much about measuring. I put Egg Beaters into almost every loaf, and use mostly or all whole wheat flour. Always makes a tasty loaf that I eat much too quickly. I have also used it to make biscuits, and it did great at that too (on dough setting, then oven baked.) Easy to clean as well.",
        "I didn't know these things existed. I love this little thing it makes just enough bread for me +1 for a week. Bakes bread VERY consistently. Even bake, luxurious options for all kinds of bread. The only CON is expensive (however this thing will last forever, apparently! Will update).",
        "Better late than never! I've now had this bread-maker for almost 5 years. Knock on wood, but I've never had a bad loaf. It works perfectly. I've used all kinds of recipes from different bread maker books and all the different loaves have turned out wonderfully. You can't go wrong with this machine. It's just perfect for the small family.",
        "Been baking a loaf about every other day. Effortless and the bread comes out perfect, except when I forgot to add the yeast one time. Good choice for small households, or folks who don't live near a store.",
        "I accidently bought this with one click, and glad I did. Bread is a fun fresh experience twice a week while I try to recuperate the extraordinary cost of this breadmaker. I could have sent it back, but just look at it, you know you want it! Its quality and zoji made it so easy to remove the paddle and clean, try that with the other guys.",
        "I have baked a couple of white flour loaves in this, and they were very tasty and browned nicely. It makes a good one pound loaf and the paddle is pretty easy to get out of it and doesn't leave as large a hole as other breadmakers I've used tend to do. My main purpose for this is to make dough that I then shape into loaves by hand and bake in my own oven. It's a perfect size for my family of 3. Because of its small size, it has made a better quality bread maker work with my budget. And the handle makes it great to move around to make room on the counter.",
        "My Zojirushi Mini Breadmaker is wonderful. It takes me less than 10 minutes to get out my breadmaker and all the ingredients, put them in the 'bowl' and put them away again. 3.5 hours later I have a perfect loaf of bread. It is perfect for a single person. My favorite bread is a Rye, whole wheat combo with rosemary. It is a snap to clean too. It has no short comings that I can think of. It is everything I could hope for in a breadmaker. It is quiet, has many settings for every thing imaginable, fits nicely in the cupboard, easy to read without glasses. Perfect in every way. It is worth every penny.",
        "I'll just chime in with everyone else to say that this little machine is perfect! I have a full-size Zo but wasn't using it with a now smaller household. I find myself using this mini machine impromptu quite often--so easy and perfect loaves every time. Performs every bit as good as the full-size--I'm so glad I got it.",
        "We are a family of 4 so this compact machine works perfect for us. We typically use the timer function so we can have a freshly baked loaf of bread in the morning. I have tried the basic recipes from the manual as well as other online recipes. All of them turn out just perfect. We are pretty happy with this purchase.",
        "I was confident that I would love this little machine, as I already own a Zojirushi rice cooker. This machine is compact, easy to clean, and easy to operate. The instructions/cookbook care concise and easy to understand, and the bread is delicious. The fresh bread smell is the most wonderful thing, especially when you can wake up to it by using the timer. This makes an adorable one pound loaf which is good for about three people, or two hungry people. There's something about a fresh baked loaf of bread that makes me feel accomplished, even if the mini Zo did all of the work!",
        "This bread maker is terrific. I would write some more but I'm too busy making and eating bread !!!",
        "My favourite kitchen appliance of all time. Really simple to use and I probably use it two to three times a week, even my husband can make perfect bread every time. We have only had a couple of loaves that didn't turn out probably because I was lazy and didn't follow recipes. There is a recipe book and the breadmaker comes with a cup measurements so you can't go wrong just follow the recipes and you too can have fresh bread every morning.",
        "The loaf size is just right. The footprint is small enough to leave on the counter or being lightweight, lift with the carry handle to store away. Have made the basic white bread several times. Easy, fast and tasty. If I were to change anything it would be make the written instructions a bit easier to follow. Tip: Get a pair of 'Ove Gloves' to remove the bread from the baker and the loaf from the pan. I hate to get burned!",
        "Very small and very functional entry level bread machine, great for a single or for two people. Many recipes easy to follow on their manual and additional ones at the website. I wish it could have custom programming as their other big models. It cannot be cleaned on the dishwasher, a little pricey compared with competitors but it is all worth it.",
        "I have had 3 breadmakers over the years..now it’s just me, and the loaf is the perfect size..have never had a failed loaf..comes out perfect every time..love this little bread maker..worth every penny... Fran G.",
        "This is my second Zoji bread machine in 20 years and I STILL LOVE IT. The results are absolutely perfect - I notice this model is quieter than the first. The front \"settings\" and timer panel has changed some but it's still user-friendly and simple. Having \"cheated\" and purchased another brand several years ago (which I used twice before consigning it to the back of a high shelf- ugh)I can honestly say I would never stray again ! Once more, you get what you pay for. Superb !",
        "I used to have a large Zojirushi bread maker - actually it was my second one but by far better than the first one I had (don't recall the brand). But now that our three children are grown and not at home, I didn't need such a large one and gave it to a friend and got this small 1 lb bread maker and I love it! So far, every bread has come out well - pretty good considering I used 2 lb recipes cut in half for quite a few of them. Very happy overall and now I make bread 1-2 times a week and its perfect for two of us.",
        "I adore this bread maker. It took a while to find a recipe I loved - the booklet has recipes that all felt too dry for me - but the loaf size is about the size of a paperback book and just right for a family. Or bread for 3 days for a couple. It fits underneath my counter when I'm not using it and the cleanup is breeze. Highly recommend!",
        "after having tried a sunbeam, oster and cuisinart without success, we decided to spend a bit more and get the Zojirushi. At the beginning the pan looks a bit small, but the loaf size is perfect for 2. One loaf lasts for 3 breakfast meals for us. Also, the pan is more thick and heavy than the other we have tried. I guess that is one of the reasons why the bread always comes out perfectly cooked, unlike the other ones we have tried. Small size is awesome for limited counter space kitchens, and bread always comes out good, even when I unfortunately mixed the yeast with olive oil in a 7hour delay bread. We are extremely happy with it!",
        "I used this every week--sometimes more--for several years, until my cat knocked it off the counter and broke the plastic casing into shards. It always worked perfectly, and kneaded even very stiff doughs effortlessly. Vast improvement over my old $100 two-paddle Breadman, which had a weak motor and died after not much use. For twice the money, I got much more than twice the use out of it. I bought another one, and put it in a safer location. At the rate my old one was going, it might have lasted another decade or two, so I don't expect to be needing another replacement any time soon.",
        "I've repaired these machines for more than 20-years...this is the best I've seen. Simple, intuitive operation. Remarkably easy to understand and use. First loaf came out perfectly. While it costs more than many you can buy, it is true that you get what you pay for. The Zojirushi BB-HAC10 is worth the money...this is good value for your money. The instructional DVD was very helpful. BREAD TASTES GREAT! No complaints whatsoever.",
        "Very small counter footprint. The bread is excellent and very easy to make. The loaves are a perfect size for one or two people. However, I find many recipes (The Bread Lover's Bread Machine) are for 1.5 and 2 pound loaves. I still haven't got the French Bread quite right. One thing I do for sure is that you need to follow the directions including adding ingredients in the order given. The recipe book with the machine is quite good.",
        "it were perfect if it has the pocket for yeast. I have to wait and add yeast by had every time, or yeast doesn't work. So I never use timer. But obviously this is almost perfect and better than any other American brand. And past mode is good for not only pasta but lot kinds of noodle like Chinese noodle, Japanese Udon etc... That is big decisive factor.",
        "I have had the Zorjirushi rice cooker for a few years and it makes beautiful rice, so thought I'd try their bread machine. I've only had it one month, but the Zorjirushi bread machine makes great bread and is an ideal size for 1 or 2 people.",
        "I've had this machine for 13 months, and the built in warranty expires at 12 months. Suddenly, the machine inexplicably won't power on at all. The functionality was fine until now, but I would say that 1 year is way too soon for a machine this expensive to stop working. I'm very frustrated, and certainly couldn't recommend spending this much money on a machine that may only last 1 year.",
        "Practically perfect in every way! Makes a perfect 1-pound loaf every time!",
        "I absolutely love my mini bread machine. Just the right size loaves for a couple of people. Make bread a couple times a week. I use it to make pizza dough too. Love it.",
        "We have used the bread maker several times since it arrived and are extremely happy with it. Makes a great loaf of bread, nice and crusty and great tasting. Bread making is certainly a lot cheaper than the prices in the store. So far I have made about half a dozen loaves from the recipe book that it comes with and they all turned out great. It is very easy to use and cleanup couldn't be easier. I haven't bought bread from a store since!",
        "We've had the Mini now for 3 years and it has been great. We came up with a half-bread flour, half-whole wheat flour soft cycle bread that we love. The pizza dough recipe works out great, as does the cinnamon bun recipe. This model is great for a smaller household--2 or 3 people--since the homemade bread (read: no artificial preservatives) doesn't quite last as long as store-bought bread. The only minor issue is that the non-stick on the kneading blade has come off, so we have to get a new one there.",
        "This is a great little machine. It's easy to use and comes with a lot of recipes. I love that it makes just small loaves for 1 or 2 people. I used to throw away so much bread from the store because it went bad. Now I don't and I know exactly what is in my bread. The only thing I would change would be a lighted display.The digital display is not lit.",
        "I chose this machine due to it's reviews and smaller footprint. I have been trying different recipes, from the enclosed booklet, but have yet to make a \"perfect loaf\". The loaves are denser than with my other machine, a Breadman. I follow the instructions implicitly and use fresh ingredients, so I don't know why the loaves don't rise as they should and are so very dense. Nothing goes to waste, the dense bread is great toasted. I am going to adapt my recipe that I used in my Breadman and see if that makes a better loaf. Otherwise I like this machine for it's versatility and smaller footprint. It fits much better on my counter top.",
        "Bought this machine because I needed a mini and I saw no comparable competition. Although the machine is expensive, it is very well made, works fantastic and is so easy to use and clean. The vhs (to bad no disk)instruction video was very helpful. I even called customer service once to see if I ruined the dough, and there was a USA national who was very helpful and knowledgeable. After you decide to spend the cash, you should have no further regrets, and only great bread, and dough. Happy baking.",
        "This machine is much better than I thought. It is very easy to use and clean. Bread always comes perfect. Delicious!!"
    ]
}