{
    "entity": "Bread Machines",
    "text": [
        "I like the basic functionality but I have had two of these machines, one I purchased and the other was a warranty replacement. Both did the same thing, burned the bottom and left the inside not completely cooked. The recipe book is one of the best I have ever seen with with an ABM and the listing of times and bells for adding is very helpful but otherwise I would totally not recommend this product. I wish I had my old Westbend two paddle ABM, it was a wonderful machine that finally wore out. Don't spend your hard earned money on this product.",
        "I tried everything to get this to work! The normal way--the according to the manual way--produced an odd looking, rather small lump of bread surrounding masses of flour. Obviously it didn't mix well, so next time I tried to mix all the dry ingredients first, then stop it in mid-mixing to pull the flour away from the corners. This time I got bread with the right shape, with a wide dry vein of flour meandering through the middle. The only thing I could think of that would make a reasonable bread with this would be to make the bread before hand and put it in the machine to bake it! Seems like a lot of money for a timer.",
        "Used this Cuisinart CBK-200 bread maker about 20 times over 5 or 6 month period and the pan started popping out. Watched youtube videos and learned that it was a common problem. Tried to fix it. But nothing worked. It baked bread okay at first, but as time went on the bread would burn on the left side. In my experience this was not a good purchase.",
        "I purchased another brand originally but could not understand the written directions as they were poorly translated from Chinese to English (my opinion only). Returned it and bought this Cuisinart which I knew would be 100% better. I should have gone with my gut feeling first. This machine is a dream. Easy to operate and the product it puts out is to die for!",
        "I ordered this bread maker after reading all the positive reviews but was quite disappointed with it. The bread machine is quite big to start and the loaves started coming out with think crust even in the light setting and ended up covering the pan with Aluminium foil as mentioned in one of the reviews. This helped with that but the paddle was always a problem. One would have to wait for the remove paddle beep to remove and if not the loaf was invariably come out torn. After couple of weeks, the paddle became loose and would come off part way during the cycle! I had to keep checking the machine to fix the paddle back in the pan!",
        "After fewer than 40 loaves of spelt bread, it started making a grinding noise during the baking phase. Why was the motor even running during baking? Great machine while it lasted. $400 Zojirushi lasted just over two years. $150 Cuisinart lasted eight months. Next up: $55 Amazon Basics. How long will it last making five loaves of spelt bread per month?",
        "I bought this bread maker because it comes up in searches for machines that will make a low carb bread. The first loaf was disappointing as I have to unplug the machine to end the cycle to mix the ingredients by hand. The tiny paddle couldn't possibly incorporate all of the ingredients. Once I made sure everything was mixed, I started the cycle from the beginning. It seems that I can't enter the correct code for the recipe I was making either. So far, I'm thinking that I should have just stuck to baking bread in the oven. This machine is not saving me time if I'm hand mixing anyway. I'll try again though.",
        "I had one of these -bought used at the thrift shop and it only worked on one setting. I liked it so much and used it for 2 years before it stopped working. I decided to splurge and buy a new one! OMG, this is a different animal! The bread (whole wheat with fruit & nuts& seeds) is even more fabulous. I LOVE this machine and love making bread it it. Works perfectly and the recipes are great.",
        "I’ve owned bread makers before but it has been awhile..I’ve always been told you need to watch it and not just assume this is a “set it and forget it” kind of thing. I have had to add a few drops of water or a dash of flour if the dough is too wet/dry through the knead. I’ve also stopped the cycle a few minutes early to prevent an over brown loaf. This bread maker provides a great knead & rise cycle and the bakes have been great for me. This is a great machine but it isn’t a completely hands off product..you won’t find one of those.. buy it at a bakery if that is what you are expecting.",
        "Making loaf after loaf or great bread and related foods. Recommend getting a good Bread Machine Cook book to go with it as the included book is pretty lame. I have 300 Bread Machine recipes book and will be working my way though them as my waistline allows. Was wonderful for making \"gift\" breads for neighbors at Christmas. Much healthier bread and at lower cost. Do be careful pulling out the bread pan; I put to much force into it and bent one of the retainers. Took some time to get it back into shape. Was very happy that this machine has the power to handle the heavier breads. Those broke my otherwise nice Hatachi machine.",
        "I bought this to replace the Cuisinart I'd had for the past 10 years. The paddle mechanism deteriorated (my own fault; I oiled the paddle peg to make the bread easier to remove and it corroded the gaskets), and Cuisinart no longer supplies replacement parts. The convection took a bit of getting used to (everything browned more than I expected), but other than that everything's fine. I use the machine at least once a week for breadmaking plus mixing dough for pizzas. I especially like the ability to turn off the mixing alarms. (Small thing, I know, but what'll you do.)",
        "Sadly I have to write a review update. After using this machine for awhile now the paddle no longer stays in the machine and so it won't knead the dough right any longer. After ordering a new paddle we realized the shaft that it sets on is no longer working so we had to throw the whole machine away. Very sad as it worked great for the time it did work. Just don't expect this to be a machine you can use often!!!",
        "This is fast and quick! Bread is just perfect! They send a great recipe book, but I also bought \"the Bread Lover's Bread Machine Cookbook\" and it is a great pair. I initially did not see the times for types of bread and how long it took along with mixing, but as I re read book today, they very nicely have all instructions on opposite side of book. This is an amazing bread maker!",
        "I received this as a Christmas gift and love it. The instruction book comes with tons of recipes for all types of bread and is super easy to use. I started with the white bread recipe. The loaf turned out beautifully. Everyone loved the taste and I loved how easy it was to bake! I also liked that the recipe book gave options for baking in the oven (like baguettes). This machine will be in constant use!",
        "Bought this bread maker to replace my old one. It is far better than the one I had. The convection feature bakes a nice, crispy crust, and there are 3 choices for loaf size. It comes with a nice recipe book, and the Oatmeal Bread is our fave so far. I add sesame, poppy, & flax seeds, plus crushed almonds. Very delicious results with that recipe! The bread maker is very attractive with its brushed stainless steel finish, and is easy to clean. FYI: I recommend using King Arthur bread flour!",
        "I replaced an earlier model with this one. I've only used it twice and so far I like it. It is physically larger with s few more settings and aloe heavier. Not sure if the convention feature adds anything-TBD. The manual has some nice additions, like a chart for times to add ingredients and remove paddle. Previously you had to be present for the signal.9",
        "I have owned this bread machine for 3.5 years and have had no problems with it after a lot of use. I don’t know what folks are doing for it not to be working properly. I highly recommend it and as soon as I wear it out, I will replace it with the same brand of machine.",
        "I bought this for my son who has Celiac's Disease. We have made multiple loaves of the GF bread setting and it does a great job! The paddle leaves quite a divot in the bread, but I think this is more of the nature of the GF dough more than anything. It cleans easily and works as specified. Here's to many loaves of delicious GF bread. I think the price is fair and the quality seems good. Hopefully it lasts as long as my Zojirushi which I could not use for him due to non GF bread making in it.",
        "Cuisinart Convection Bread Maker. I use it every week making breads and doughs. It works great! Homemade bread, excellent, what can I say more ! Love it!",
        "Worked flawlessly...... until it didn’t. Was really impressed with this machine when it arrived. Worked perfectly until a few weeks in. All of a sudden the loafs were burned on the outside sides and bottom and dough in the middle. Thought it was a fluke but it wasn’t. Multiple loads and it seems to only be getting worse. Different breads and same result. VERY disappointed in this expensive machine.",
        "This was to replace a Cuisanart bread maker that I had used and loved for many years. I cooked a loaf of bread with medium crust setting and it came out scorched. I had to cut the crust off. I sent the bread maker back and Amazon immediately credited my card. I bought the same item Christmas for my grandson and his works great. Cuisinart appears to have a quality control problem on some units.",
        "This is a great bread maker that allows you to make all types of breads, with all types of add ins. Just get used to listening for the \"beeps\" that will tell you when to add the other add-in ingredients (cheese, garlic, raisins, Soprasatta, sun-dried tomatoes, or whatever). Cleans really easily. Just make sure to take out the mixing paddle when you hear the beep for that, so it doesn't get baked into the bread! :-)",
        "I was getting tired of the terrible bread from the store. I have used this machine at least two times per week since I got it. All of the breads have turned out nicely. I have also used the dough feature for rolls. Being able to make different sized loaves is a plus. It is so easy.",
        "I have tried many of the recipes in their instruction booklet. Since trying this product multiple times in three months I have never had a good loaf of bread from this machine. Adjusting recipe with the suggestions did not improve matters. I would not recommend this bread maker. Very disappointing experience.",
        "I've had this for about a month and have made several loaves of bread, pizza dough and ciabatta bread dough, cinnamon rolls...... I even made tangerine marmalade. I love what I can do with this",
        "Me and my family are so happy with this machine. I have been making bread on it for one month now and It has been a great experience. Bread tastes delicious and you can use recipes in the manual or your favourite ones. Also I love that you can make dough and then take out and shape individual beautiful pieces of bread to bake in the oven. I live in Ecuador at 2.850 m above sea level, we purchased this in the US and were worried if it worked in High Latitude as well, and turned out fantastic!!!!. Beautiful and delicious bread and so easy to use.",
        "The product was defective, inoperable out of the box. After an hour and ten minutes on hold, the people at the customer service number promised to send another unit after receiving the clipped cord from my defective one, which I promptly mailed to them. They're making an effort, but I'm still waiting for my bread machine. And the wait on hold at the customer service number is extreme.",
        "Thank you so much! We couldn’t wait so we made our first loaf of wheat bread last night after the bread machine arrived. We are beyond thrilled with the sweet smell of homemade bread. Now, we don’t have to worry about the local store running out of bread- we have our own ingredients and Our own Cuisinart bread machine. Thanks, again -",
        "This bread machine is superior than the other regular bread machines. The convection oven cooks the bread perfectly. I love this machine, it makes delicious breads and I wouldn't trade it for any other. Buy The bread lovers Bread Machine cookbook by Beth Hensperger, Her book has wonderful recipes. She is an expert baker and so far everything Ive tried is so good. This lady outshines everybody else. This book is also sold on Amazon.",
        "Love. Love this machine. AMAZING. I've been using nonstop. The recipes are so good and the machine is wonderful. I was leary of making jam, but it turned out so good. I've made alot of the breads from the cookbook and they've all turned out great. I'm so happy with this purchase.",
        "I received this breadmaker as a gift in February 2017. It broke within a month of use. Because I liked the features so much and I hoped it was a fluke, I returned it back to Amazon for the exact same model. Now, 1 1/2 years later, this bread maker has broken again (blade won't spin). Warranty documentation says I have to pay to ship it back - which will be expensive - plus pay them $10! That is abhorrent for a $100+ product. I've contacted customer service and we'll see what they say, but if you're looking for a quality breadmaker, I'd look elsewhere.",
        "My dad's been using bread machines since they were invented and he says this is the best that he's ever used... So I take his word for it. He definitely makes some delicious bread with it!!!",
        "This is too complicated to use. They tell you first to select your mode by hitting one button, but that button has been unresponsive, so I have to fool with it for several minutes to get it going. Then, if I use mode no. one, I have to scroll to all 13 modes to get back there because it starts on 2. I wish they had an “enter” or “select “ button. It would make it easier to see what I’m doing.",
        "The first one I received had a control pad that was inoperative. It would not even toggle through the menu choices. I opted for a replacement, and received the second one promptly. The second one had similar issues with the control pad. I noticed that both machines had the same manufacturing batch number, so there are probably more defective ones out there. Cuisinart Customer Support was non-existent (30 minutes on hold) for the first machine's issues. On the second one, I was able to reach them. They seemed to know exactly what the issue was, and suggested a return.",
        "The first time we used it, I thought I was doing something wrong. The pan wouldn't come out without a massive amount of force. After that, seemed ok. I mainly use it as a dough mixing and proofing machine. It has trouble with small batches as it doesn't clear the sides. Otherwise it works ok for what we do",
        "It took 4 ruined loaves, before I learned two things. You have to help mix the dough with a spoon. You can't deviate from the recipes. I was able to add what ever I wanted in the second part of the cycle, as instructed. Again, I had to help mix in with a spoon.",
        "We get kitchen gadgets from time to time, and most we never really use after the first time. But this bread machine has been amazing and we use it every week. Its options are extensive, it's easy to use, and the cookbook that comes with it has tons of amazing recipes. We've even thrown together a few of our own. I highly recommend this product; it's exactly what we were looking for.",
        "Been using the bread maker for just over 1 year and love it! Last time I used it, it had a problem with the bread pan coming out of place and shaking the unit violently. Cuisinart Customer Service was THE BEST I've ever dealt with. Replaced the machine at no charge to me except $10 for shipping out the new unit. This kind of service gives me great comfort in buying anything Cuisinart!!",
        "So the bread pan has a \"weak spot\" and it failed where the little stir attachment goes. It cannot be fixed. Have to get a whole new bread pan BUT on backorder (as well as expensive!). Seems like this is an issue with this model. I guess I can't complain though because I used it a lot and it lasted 6 years!",
        "Good quality bread machine. I've been using the machine almost weekly since I bought it. We've basically stopped buying store bought bread altogether and I wouldn't want to go back. I've made french bread, dough for cinnamon rolls, white breads, wheat breads, whole grain breads. The loaves cook evenly. I really appreciate the delay timer so you can set it up the night before and wake up to freshly baked bread.",
        "We bought this to replace another model of bread maker because it quit working right. This was listed on a \"lightning deal\" that Amazon has throughout the day, so I saved a lot of money on this. I like the Cuisinart brand as I have several of their appliances already, so I trust this to be a better bread maker than most other models. The bread we made came out excellent and had several positive comments on it from family members we had over to dinner. The 2 pound bread was plenty for our guests as it was a small gathering. I highly recommend this bread maker!",
        "If you don't take the blade out mid-cycle, it will get baked into your bread - horrible feature because you never know exactly when to remove it -definitely would never buy again. The bread only rises - it did not bake the bread so i had to bake in my oven.",
        "This machine is awesome! It is very straight forward, and the recipe booklet has step-by-step instructions that guide you through every phase of the bread making process button by button. If you are watching your carb intake, get ready to have your willpower tested, lol. If you keep the necessary basic ingredients on hand, you'll end up making more bread than you know what to do with. It's fun to use, super easy cleanup and of course makes great loaves! It does take a little practice to get the recipes just right sometimes due to humidity (living in Alabama doesn't help!), but once you find what works best you will not be dissatisfied with this product!",
        "I bought the Cuisinart CBK-200 to replace an ancient bread machine. My old machine was unevenly browning the crust, even to burnt, and required a watchful eye. Now, I can set it up before going to bed and wake to warm, crusty bread. Convection makes the bread bake and brown evenly. I have yet to try the artisan bread features but considering how well the machine works, I can do so with confidence Definitely recommend. If this review was helpful to you, please rate it. I count on reviews when shopping on Amazon and your feedback will help me improve.",
        "This bread machine has made a lot of happy campers in my household. We have been using this model for 10-15 years and has made hundreds of loafs of bread, cinnamon rolls and pizza doughs. It is easy to use, dependable, durable and attractive. Should we wear this one out, I will by another in a heartbeat.",
        "I am enjoying using these Cuisinart CBK-200 2-Pound Convection Automatic Breadmakers. We are very satisfied with these bread machines. We purchased two machines; one for gluten-free bread making, and it does a very good job with some of those hard to deal with recipes and doughs; and one for all other breads. It rates supreme for me. I have owned two other brands in the past and they were okay, but do not even compare with the Cuisinart. I would highly recommend these to anybody looking for an excellent breadmaker. I am also very happy that it matches my other kitchen appliances. Thank you Cuisinart!",
        "Since my husband is allergic to soy in any form I have to make bread at home. Most commercial bread is now made with soy. Some artisans breads are not but they are expensive to buy and not always great for sandwiches. There are many reasons I chose this breadmaker. Cuisinart has a reputation for quality products, the breadmaker makes small, medium or large loaves, it is a convection breadmaker and so the top of the loaf is nice and brown and there are so many settings to use. You can remove the paddle and have a loaf of bread without a hole in the bottom. Just lots to like with this model.",
        "Purchased this bread maker at Amazon.com after researching bread makers. This bread maker performs effortlessly, and makes a wonderful loaf of bread. Having decided to cut wheat products from our diet (not for health reasons, to prevent health problems) we decided to make our own gluten free bread. The Cuisinart CBK-200 has a gluten free cycle on it, and it really works. We have made three loaves so far, and can't seem to keep any of the bread for any length of time, as we eat it almost as fast as we make it. I strongly recommend this bread maker for anyone looking to make gluten free bread. Would I purchase it again, \"your darn tooting, I would\".",
        "I am so happy that I bought this Cuisinart bread maker. It’s very easy to run and make a lot of kinds bread. I made what I like French bread 2 times in the first day. First with medium crust, and second with dark crust. They are delicious. You can bravely buy this bread maker and be happy with it. I can say don’t pay attention on bad feedbacks, I am pretty sure they did something wrong, if you do right as described in the book, you will be satisfied with your results.",
        "I use this bread machine every week. I love it! Crispy crust and soft bread! Easy and convenient. I love that you can remove the paddle at the beep and not have that huge hole in the bottom of the bread. Recipe book is very good too",
        "Use mostly on “dough” setting since I like to shape my bread in a loaf pan. Found that adding water and sugar to yeast and letting it sit in the bottom of the pan for a few minutes before adding flour, etc. made for a better bread texture",
        "The machine was a gift for my brother. He had some problems with it at first. Cuisinart said they don't repair them. But he did get it to work and has been enjoying the machine since.",
        "After first use , the convection fan is making horrible noise when baking. I am going to use it for a couple days, if noise is not disappeared I am going to return it and buy another brand.",
        "The perfect Gift ! I received it as a Christmas Gift. Was way to use and was indeed a plus that tools for measurement was included as well as a Kick Ass Cookbook filled with recipes",
        "It takes a bit of getting use to, because of the convection feature. The crust kept coming out a little too crispy. But it makes a fine loaf of bread and it's easy to use. Cuisinart spells quality and longevity, which is why I chose this brand. I chose this model because of the capacity and the convection features. You will be happy you did too.",
        "It is everything it is advertised to be. Mixing, baking and cleaning are all very easy. Perfect for the person that likes fresh bread.",
        "I love the bread maker. It is easy to use and makes wonderful bread. You need to be sure to use quality ingredients in order to get quality bread. One thing I don't like about it is the measuring cup and spoon. The measuring cup is not a true measure but the main problem with it is that it is impossible to see the measuring lines as they do not stand out at all. I am weighing the flour instead of measuring it and using about 1 oz. less for each loaf. Everything else is solid quality and an excellent product.",
        "I had different bread makers before and they all had some problems with mixing or baking. This one is very consistent and works great. After a year of use the pan gets loose when making large bread. Disappointing.",
        "I bought this breadmaker because it received outstanding reviews on numerous sites AND was cheaper than the top brand (Zojirushi). The results have been consistent and have produced delicious bread. I will say that you want to use quality ingredients when making your bread because it will effect the end product. I would recommend this breadmaker to anyone looking for one as it has numerous settings and can take care of a variety of bread types. I've made sandwich bread, pizza dough, cinnamon raisin bread, and dough for monkey bread.",
        "Made 2 loafs with in the first days i got it. Super easy and the bread was good. Glad i bought it. Followed recipe in the book that came with the machine, it tells you step by step. Very user friendly.",
        "This is my third bread machine. I really like the notification of when to take the bread out of the machine to either remove the beater bar or bake in the oven. I have made several loaves of bread and each has been perfect. Why not 5 stars? Well just about every appliance can be improved upon.:)",
        "Not my first bread machine & I’m really enjoying using this one. Love that I can take the paddle out so no big holes on bottom of loaf. Makes the best carrot cake bread ever!!",
        "I bought this machine a couple of weeks ago and I LOVE it. It is super easy to use. The instructions are very easy to follow and the bread is delicious. I have made several loaves already. The only thing I would improve is that the display screen on mine does not light up making it hard to see the screen. Other than that small complaint it is a fantastic machine and I would recommend it to anyone.",
        "Still going through the recipes to find one that I really like. The basic white bread recipe that the recipe book starts out with is OK, but not great. Definitely try other recipes. As for the machine itself, It looks sexy, and it's easy to clean, and fairly quiet. Good, solid construction, though the chrome-plastic buttons on top feel a little cheap. Works great though, and takes up about the same space as a decent-sized toaster over. Just don't stick it under cabinets, as you need to lift the lid fully to take out the mixing basket.",
        "This is a very simple to use machine. Just add the mentioned ingredients in the recipe book in the order mentioned and it does all the job. Loving it!!!",
        "I made a lot of bread (3 loaves a week or more) for 2 1/2 months, satisfactorily, on this machine. Then the paddle/spindle metal apparently wore out, and the last loaf I made, a white with rye, the paddle went flying 6 times during the knead. I was so disappointed. This started happening about at month 2 and just got worse. Also, I do not like the rise I get with this machine--really seems to need more time. loaves were often short no matter how much tinkering I did with the recipe. Buying something else; Amazon won't take it back, and i'm not paying to send it to Cuisinart.",
        "The only thing I dislike is how hard the paddle is to get out to clean. Other than that I love it! My hubby got for me for Christmas and we have used it at least once a week. Sometimes twice. The recipe book comes with tons of recipes. We have tried 4 and loved them. Very pleased with this gift. Oh it is pretty big. We don’t have space in a cabinet so it’s sitting on the counter. But we are using it often enough it’s not a big deal.",
        "I like everything about my Cuisinart bread maker. It works well and the bread is easy to make and tastes great. This is my third bread maker; all were Cuisinart, and all worked great. But I use them weekly and they do wear them out after several years.",
        "Really only worked a few times and not well. Gave it to my daughter for Christmas and she didn’t want to tell me how bad it worked until warranty was done.",
        "Since using this machine since November as a newbie, had to overcome a learning curve (such as always mix the dry ingredients, except add-ins, before placing them with the liquid ingredients and follow the instructions in detail). Well worth it. Will be bringing no more over priced airy bread home from the store. Am using this machine once a week and many times more with great results using the convenient settings. A Breville BTA630XL Lift and Look Touch Toaster is the finishing touch to superb tasting bread every morning.",
        "Baking at 6,000 feet, I was having a hard time getting bread just right the by-hand way. This breadmaker does the trick for turning out substantial, hearty loaves. For a 1 lb. loaf I use a couple tablespoons less flour and half a teaspoon less yeast than the recipe calls for to adjust for altitude, and the bread turns out perfectly every time. Maybe the machine does a better job at controlling the temperature than I can by hand -- who knows? All I know is it works.",
        "The machine screeches towards the end of the baking process. The settings for lighter bread doesn’t work. Because of this the bread is too dark. Disappointed in machine.",
        "I love making home made bread, and as I am getting older, I find this is a great benefit for me. It has clean lines, and is easily cleaned after using. I like the recipe book and have made a couple of the recipes my new favorites. The only thing I have trouble with is seeing the menu, and it would be better for older people (with failing eyesight) to have the letters larger or more legible. Other than that, I love this machine, much better than the two previous brands I have owned. Roberta Williams",
        "Since you can't buy salt free bread we decided to try making our own. All the recipes state that salt is required to make yeast work properly. We are happy to report that salt is not required! We use King Arthur's cake flour, a whole packet of rapid rise yeast, coconut cream for liquid, olive oil and some powered sugar. Makes light and fluffy bread. Great for sandwiches.",
        "Great purchase it helped us a lot. We only use it to make white bread but it is life changing",
        "The first loaf of bread we made (the Pesto Bread recipe in the book that came with the machine) came out PERFECTLY! The machine has many options and is easy to use. The book has so many great recipes! The bread pan is very easy to clean.",
        "The bread on the med setting burned the bread. There was not a very good flavor to many of the bread I tried. It works well for kneading.",
        "Love my new bread maker! I started making bread in my old breadmaker and found that it didn't cook gluten-free bread very well. Now I can cook to my heart's content and be successful.",
        "I can’t speak more highly about this product. Out performs others that I’ve tried. Try it, you’ll like it!",
        "We bought this a cpl of weeks ago, and I’m. Not impressed with it. It cooks our bread to long and ends up burning the outside of the bread. We have made multiple loafs and different kinds.",
        "Love it!!! First bread machine I've ever used and it's fairly easy to use. Be sure to read instructions and all setting descriptions before using, I made the mistake of not reading everything and pulled the paddle out way too soon the first loaf of bread I made. Once you get the settings down it's easy to use....even my 12yr old used it on her own to make pizza dough!!",
        "This is the second bread maker I have owned. It makes good bread. I still am not sure how or when to add ingredients for some of the recipes. I only have two complaints: One is that there is no viewing window, and the other is that most of the recipes in the booklet that comes with it are very dry. I have found the only ones that are not are the ones that contain milk and egg. I like that you have three choices of bread sizes. I also like the seperate yeast dispenser. All in all, it's a good bread maker, and I would recommend it.",
        "I'm a complete amateur but bread has been delish. I had an issue with a component but the company fixed it. Still waiting on replacement part so far very pleased",
        "This is a really nice unit, the singular draw back is with some of the thicker dough's it needs to be scrapped , it does recommend on some but I would check on all your dough's and Jams.",
        "The controls were very easy to use on this machine. But the loaves are very small. All the loaves that I made came out burned. Perhaps the Convection portion of this machine is too much for the breads I made. I returned this machine for the Sunbeam 5891. I have not received it at this time but it is supposed to make vertical loaves that are larger than the Cuisinart CBK-200. When I get the Sunbeam machine and use it I will write a review on it.",
        "This product so far is great and is a good value. The only comment I have is to make sure that the basket is removed when initially trying to change the baking controls! If the basket is in the system will default to the last setting. This actually makes some sense but we almost returned the unit thinking the controls were malfunctioning!",
        "I REALLY like this bread machine. It is easy to use and works well - when it works. Like other reviewers, my machine died after about 8 cycles (the pan and paddle became stuck). Cuisinart's customer service was very helpful and sent me a new machine free because it was under warranty. They asked that they return the defective machine at my cost for shipping. I figured I got about $15 of use out of the old machine, so I returned it - I also felt it was the honest thing to do. My new machine is working so far. I hope Cuisinart fixed the glitch and its not in their replacement machines.",
        "this is our second cuisnart bread maker, this one has a larger capacity but so far the temp is a little irregular, has over baked 2 loaves and burned a 3rd",
        "Makes up to 2lbs., seems pretty simple to use. After making 2 loaves the pan got stuck and couldn't get it out. Also selected the light crust, both loaves came out pretty dark.",
        "Easy to use with manyoptions to make a variety of foods",
        "This is a marvelous bread machine. Did alot of looking before I purchased this one. I bake bread almost twice a week and every loaf turns out perfect. I had to learn the settings tho, I make whole wheat bread, 2 lb size, and use the light baking set as medium and dark were too brown for my taste. I love the beeping sound to let you know to take out the kneading bar. This is a sure way to have healthy bread for your family.",
        "All the bread made thus far has been delicious. Some of the loafs fall at the last minute even when following the directions to the letter. It seems to work best on a 1 1/2 lb loaf, with the setting on light crust.",
        "I received my first breadmaker and had problems with it making a lot of noise. I checked how I inserted the bread bowl, tightened, etc. Sometimes it worked, sometimes it didn't. After having my son and husband try to get it in tighter, having no success, I decided to get it replaced. Amazon was fantastic. They sent me a new one and it had the same problem. I contacted Cuisenart. They listened over the phone and said it was definitely not supposed to sound like that so I sent it back again. Amazon was wonderful. I traded it in for a different model. I won't try this brand again.",
        "I don't bake bread in this machine. Rather, I enjoy having the machine mix the dough (Menu #10), taking it out and shaping it, and then allowing it to rise to be baked in the oven. This machine is perfect for the mixing function. Easy to use and clean.",
        "I must have gotten a lemon, but this product did not work at all. Even after reading the instruction book from cover to cover and troubleshooting as instructed, this breadmaker did not heat up, the convection fan never came on and the bread dough was still a ball of dough after 3.5 hours. I returned it at no charge and got a full refund, but I was very disappointed. I thought Cuisinart made superior products but not where breadmakers are concerned. I would not recommend this product.",
        "Perfect for our gluten intolerant 18 yo granddaughter. She loves it!",
        "We shopped around before deciding on this model. I love the flexibility and options. Other bread machines made bread that tasted like a mix. This one makes bread that is near identical to my brother's homemade breads. We have experimented with many recipes, textures and sizes and have never been disappointed. The only downside is that the bread is so good, you may gain a pound or two if you're not careful.",
        "Although similar to my old breadmaker, it is sufficiently different that I yet have not worked out the subtle changes I need to make to MY bread recipes to achieve a good result. Construction is good. Somewhat disappointed that the convection feature is limited. Still think it's a good purchase.",
        "I love making my bread in this bread maker. When I first purchased it I thought the pan was way too small, however the more I made bread in it I realized that it is just the right size since it is fresh without all the extra preservatives it tends not to keep as long so you probably don't want a larger loaf anyway. I love it though. I don't use it as much as I like be cause of my time constraints but when I do the lovely small of fresh bread fills the whole kitchen and the taste of warm bread never gets old.",
        "This is an excellent machine which has been working perfectly for 6 months. The problem is the recipe book which is a piece of junk. I have been using the whole wheat and white bread recipes and half of them have failed because the recipes are wrong. Usually it is because they forget to include sugar but sometimes they have the proportions incorrectly listed. Don't use any of the recipes until you check it against a recipe off the Internet."
    ]
}