{
    "entity": "Bread Machines",
    "text": [
        "I use this machine 2x a year for cinnamon rolls. I have owned it for 4 years, and have never once had an issue with it. It makes noise. It’s a bread machine. I’ve never met one that makes less noise than this one. My favorite feature is that it heats up the ingredients to the correct temperature, and then adds the yeast from the yeast holder on the top. I don’t need to pre-heat anything that’s in it, the machine does all that for me!",
        "My humble suggestion: DO NOT BUY THIS MACHINE. First of all, it comes with a \"safety feature\" that doesn't let the machine stars for 4 hours after any power failure or interruption (horrible because you have to re-star the whole process.) I only used it once every other week to make pizza dough. It broke down in less than two years and when I contacted the manufacturer I didn't get any support. If you go to the Panasonic website, you'll find the product is being discontinued and any phone support will cost you $9 per minute (I'm not kidding!)",
        "We were very happy with the product in the first two months. However, for no reason, the machine broke down. The bread it makes now is not well-risen and is not baked thoroughly. We tried all the ways its manual suggested but nothing helped. Contacted the customer service since it is still within warranty, but the customer service is not friendly at all. We were asked to ship the product back at our own cost for them to take a look at it. We are very frustrated with this machine and the whole process.",
        "I had my machine for 5 years, baked bread in it constantly with great results. It rocked a bit when kneading the bread until just recently when I was busy else where in the house ( of course) it walked itself right off the counter and broke due to the fall. It always moved a bit but I had no idea even after using it literally a couple thousands of time that this could happen. Should have been watching. What wonderful bread it made before its demise however! Sad to see that it is no longer available would be buying it again that is for sure.",
        "I bought this to replace an older Zojirushi bread maker when it died and their service support wouldn't help. I don't think this is as good as the Zojirushi but on the other hand, I couldn't support that company any more after the way their service support treated my problem. This breadmaker is definitely good. My one complaint is that it makes a very loud knocking sound for a few minutes during the dough cycle, but because it's just a few minutes, I can live with it. I think the dough it makes is comparable to the Zojirushi. I am definitely happy with my purchase, just hoping this one will last!",
        "I bought a Panasonic bread baker in August, 2019. It stopped working in July, 2020. Amazon said it was beyond the time limit for return, and told me to contact the seller. I repeatedly sent requests to the seller through Amazon. But they never replied. I finally tried to contact Panasonic, but I could never get through. I wasted several hours waiting on the phone, trying to get through, but never could. Now I hesitate to order anything Panasonic!",
        "This is the worst bread maker i had, the motor died after 1 and half month. I used it for pizza dough once a week. The first few times it worked, but yesterday I put all the ingredients and started the program, after the beep, i opened the lid and only found that all the ingredients are the same as i put them 1 hour before, the motor did not run at all. I tried unplug it server times but nothing happened, the motor just died. Never buy this Panasonic bread maker as the quality is really poor, my old Oster bread maker is way better than this one.",
        "I bought this product in December 2015. I used 3 times in the past and worked fine. Now it's totally not working. Function key pads do not engage at all after I put all the ingredients and set to go. It's very frustrating. First of all, from all the selections I had, I picked this product because of its nationally well known name brand. But it didn't last long. I am very disappointed. Sorry Amazon and Panasonic I have to write a bad review for the first time.",
        "I've used this machine a dozen times or less, and unfortunately mine does not work properly. If I leave the bread in the machine after baking is complete, the crust will darken to nearly burnt. I have to take the bread out early, maybe 15 minutes prior to completion, to keep the crust light. This happens no matter what setting I have the crust on. Thankfully I purchased an extended warranty with Square Trade. When I filed my claim they opted to refund the money rather than repair the machine.",
        "We purchased this from Amazon in 2011. We've made hundreds of loaves with it. This thing is bomb-proof and has withstood the test. 8 years later and it works like new. Some of the best money I've ever spent. We had gone through two breadmakers in 5 years prior to this one. My wife makes at least 1 loaf a week, throughout this thing's lifetime. We'll see how long it keeps going!",
        "After buying multiple 3 lb Black and Decker bread makers over time where the basin paddles stick and eventually falls apart and leaks, and a partner company that never fulfills orders for spare parts, finally switched to the Panasonic. What a difference in quality. I make bread daily and the bread maker consistently makes great bread. Highly recommend.",
        "I bought this machine back in 2009 and used it sparingly...at most 10 times per year. With the corona quarantine, I have been baking and making pizza dough a lot more...maybe 3 times per week. After a month of this I pulled out a loaf that literally hadn't mixed. It baked, but hadn't mixed. I tested another batch and realized that it was stone dead. Nice machine while it lasted, but if I had used this frequently it would've had a much shorter life.",
        "I have owned four different bread machines. Zorjurishi has a large loaf but the oven has two stirring bars that don't create a smooth dough and the oven does not heat evening producing a loaf that if undercooked in spots. The Oster produces a round loaf that is very strange for sandwiches but it does work well. The Hamilton Beach cooked unevenly and not satisfied. I have actually owned two Panasonic YD 250's and the reason I bought the second is my ex wanted the first one. The breakmaker produces the absolute best loaf of bread. Evenly cooks and produces a crunchy exterior and beautiful soft interior.",
        "Bought this as a replacement for another brand that died after 3 years. We make about a loaf a week and also use the machine for dough. I have only had it a couple of weeks but this machine makes really good bread especially the French loaf which is my favorite and the dough comes out good as well. Only reason I did not give if five stars is because if you make a mistake while making a selection you have to unplug the machine and leave it off for like 15 minutes to clear the memory, there is no cancel or clear button to start over.",
        "I have this bread machine for about 8 years now. Still works flawlessly. It bakes the nicest loafs and makes the best doughs for any needs like pastries and pizzas. the crust is always even and perfect. Do not experiment with other bread machines. I highly recommend.",
        "Loved this machine when it worked for the first 9 months. Then, without warning, it quit mixing and baking bread and instead started giving me lumps of half mixed/cooked piles of ingredients. Recipe didn't change but the end product sure did and not for the better. Shame because I really enjoyed the quality of the bread this machine produced. I would not recommend it based on its short life span. I only used it about two times a month. Panasonic quality isn't what it used to be sadly.",
        "We love our bread machine and have had no complaints. You do have to read the instructions carefully as it will not work correctly if you don't. We use it not only to make all kinds of breads but all kinds of dough, even home made egg noodles. The auto Yeast Dispenser is also a nice feature adding to the value of this lower cost machine.",
        "Stop working after less than 10 time use. I bought this bread machine last September and used for only one function—— making pizza dough. Today I used it to make pizza dough as usual. Although the light is on and time counted down, the knead blade did not work. It left the separate ingredient after 45 minutes. It is very frustrating. I chose this bread machine because of brand and customer review. I am very disappointed. This is my first BAD review on Amazon.",
        "We ordered this machine just to try our hand at bread making and the results were outstanding and so easy. It was just a matter of putting a few ingredients in the machine and out came a perfect loaf of bread. We chose one under $100 because we didn't want to make a big investment in something we might tire of and only use a few times, but it turned out so well, we'll definitely be using this all the time from now on to make fresh bread. Great product.",
        "Bought this machine almost two months ago and am very pleased with its performance. I use it several times a week and it's doing a great job. It's easy to operate - simply add all your ingredients into the metal basket and let it run. It's silent, so I can run it during the night and have a fresh loaf in the morning. Timer works perfect too, I typically load it in the evening and it does its thing overnight. The only thing I don't use is the recipe book - that is rather limited and not useful. Yet there are plenty of recipes online and one can also experiment himself, so that's not really a problem.",
        "I have this breadmaker for over a year yet. I love it! Just bought one as a present for my daughter. She (and my son-in-law) are enjoying it immensely. Saves time and money at the grocery. And the fact that they can have fresh bread whenever they want is a great plus. And extra benefit of the Panasonic is the larger capacity. Also love the yeast dispenser feature.",
        "An Awesome product! I looked around and read lots of the reviews from and about and I choose this Bread Maker Manufacturer. All the negative comments were from people who can't read instructions and/or don't read instructions! I could only say that this machine is amazing! The yeast compartment is great for this kind of people! Machine makes and bakes an awesome looking, yummy bread! Attached pictures and videos are from making XL Dark (4 pictures) and L Light (3 pictures and 1 videos) Thank you!",
        "Great machine! The only downside is that you need to let it cool down a couple of hours before using it again. The directions say wait 30 minutes but in my experience, that’s not the case. Other than that, I love it. Also purchased one for my daughter.",
        "Panasonic makes the best bread makers ever! I have had 2 made by Oster and they didn't come close to the perfection of this breadmaker. It takes a little bit longer but that's because it lets the dough rest between cycles and that gives the bread so much loft and elasticity that people think I bought the bread. There's nothing better! I use the dough cycle and have it memorized, press select 5 times then start. It couldn't be easier.",
        "I don't use this but I bought my mother a more expensive one and she made me send it back because this is the only one she likes. The other one always seemed raw inside. This is her second one over the last ten years or so from Panasonic. If they stop making this type I don't know what I'll do.",
        "The price is the same. Now I use the machine to mix the dough and put it in the fridge for a day, shape it and back it after I shape it. Pizza dough the next day is the greatest. I make two 12-14 inch pizzas with the recipe provided.",
        "It bakes bread, does a pretty good job at is as Panasonic bread bakers have been doing for a while. The timer is 13hours max, which actually needs to be slightly more. Cleaning is tricky, vacuum cleaner works best. Sometimes not all the yeast dispenses, matter of making sure the dispenser is properly cleaned & dry. Otherwise, it's been baking bread and making pizza dough for almost a year now, its been worth every penny.",
        "The kneading blade broke after 15 uses. When i contacted Panasonic for a replacement, they referred me to a \"service center\" instead of sending me a new blade. Just think about this: do they think I should take off a day from work to drop it off and a day to pick it up? You must be kidding me! This is likely the last Panasonic appliance or device I will ever buy. Update: the \"service center\" I was referred to does not even give you the option to speak to a human. Beware, you are buying an appliance essentially without warranty service option!",
        "I’ve owned this for 15 months and have only used 12 to 15 times. It stopped working today: the timer, screen and yeast dispenser work but the motor doesn’t run at all. Checked the belt and it is in good condition. Seriously disappointed and regret this purchase. The good news is I will have THE most expensive and shinydoorstop on the block.",
        "The machine started with two good loaves. I noticed the final two times when plugged in, the \"00\" did not appear in the display. This is not as described in the manual. Two more loaves were barely mixed. a 1/4 inch of flour remained on the bottom. My best guess is the computer program is scrambled. I tried the 800 line tech support but was looped because the system would not recognize \"bread making machine\" or the model number. Moving on....",
        "i have made a one bread a week nearly since getting this bread machine and have had great results. The separate yeast dispensers also helps. The breads I made for family & shared with my friends has already saved me more than what I paid for the unit. The recipes included in the user guide work perfectly if attention paid to measurements. I have experimented with few minor recipe add ins for my family taste with no problem.. This is my second machine- I had another brand few years back but this is much better & improved.",
        "I have 3 of these machines dating back to when they first came out. One in 2 different homes and one in our 5th wheel. I have had many different bread machines and none and I mean none of them make bread like this machine. Do yourself a favor if you like bread like your mom made and buy one NOW!",
        "I bought this machine when my 20 year old breadmaker began to fall down on the job. I use the dough setting to mix and raise 20 - 30 loaves of bread and cinnamon rolls during the holidays to give away as gifts. The machine gives a consistently workable dough. Unfortunately, the dough cycle takes more than 2 hours from mix to first rise - almost an hour longer than my old one. This definitely lengthens the time involved in making so many loaves. However, the long cycle gives me more time to do errands. My finished breads turn out consistently good with this machine.",
        "I like it very much. It is super easy to use and makes very good breads. But the coating of the kneading blade must be improved. I used only around 30 times to make dough, basic bake raisin, whole wheat bake . I need a replacement already. Panasonic doesn't sell the kneading blade itself and I don't want to buy from other sources. I like original parts from Panasonic. Safety is my concern. If I can't find the parts, I'll try to buy other brand next time!",
        "I have only made one loaf of bread so far but it was perfect. So easy to just fill the container with the ingredients and push the start button. Come back in a few hours and there is a warm and perfect loaf of bread. Comes with a mini recipe book for quite a few different types of bread. I got it on sale but I would be happy paying full price for such an amazing item. Banana Nut bread here I come.",
        "The worst customer service I have ever experienced and the worst bread maker I ever used. The bread maker stop working only after 3 months and I have to pay $30+ to use manufacture warranty and the customer service doesn't guarantee the machine can be fixed. Don't buy.",
        "My family is using this bread maker for almost 9 tears and we are extremely happy with it. We have made different tipes of dough, including easter bread, pizza dough, chibatta bread dough and others. The recepes for the bread making programs should be followed precisely and the results are amazing. If possible I shall give it 10 points. The only concern we have that the cost to replaced it has risen up almost twice - we bought ours for $130.00",
        "Bought this to replace a very old Panasonic that finally died - dough wouldn’t rise properly because the heating function quit. The new Panasonic is great! Not being good about reading directions, I thought it was broken on arrival. Once you add the ingredients and set it to run, it sits for several minutes “resting”.",
        "I have had this breadmaker for about 6 weeks now and haven't been able to make one satisfactory loaf of whole wheat bread yet. The loaves are small. The measurements . are too exacting. You are encouraged to weigh your Ingredients which is ridiculous. And some of the measurements are for sixteenths. I am sorry I bought this machine. I have to figure out what to do now. It is too late to return it I think. I will certainly not get another Breadmaker through the mail. Too much trouble to return it. Please don't buy this machine. I don't understand why it has gotten good reviews. I will try to call Panasonic and get some help.",
        "I wanted to cut sugar out of my diet but i luv bread. I purchased this breadmaker and found a great low carb bread receipe and I make at least 2 loaves of bread each week. One for me and one for my parents. Its SO darn easy! I like to slice the bread and freeze it too. It takes me 3 minutes to add the ingredients and push 3 button and 130 min later i have fresh homemade low-carb bread! Ive had this breadmaker for over a year and its still my favorite appliance.",
        "We bought this bread machine after getting a hand-me down machine that stopped working. We really enjoy this machine! Pros Easy instructions Quiet Separate yeast container We have made 4-5 recipes from the book and haven't had any that we didn't like. The french bread is our favorite. The recipe book is full of recipes that work well in this machine. Simple display and set up. The bread pan is easy to clean Cons My old machine let us watch the bread while it was baking - I really liked that We usually take a spatula when its kneading and make sure it gets the flour on the sides of the pan.",
        "I give this bread maker a 3 star because it works well and it adds yeast for you. But it breaks down after about a year. I am on my second one and it's been about a year and the motor stopped working. The first one was under a year of use and the yeast dispenser stopped working and the bread maker had to be replaced. I take good care of my appliances so I don't know if the manufacture needs to work on defects or has worked on them since. I don't recommend this product for long term use. I won't be buying another one, I will just make bread by hand now.",
        "This was a Christmas gift to my son and daughter-in-law and she used it the very next day! Since then she has made several different kinds of bread and they have all turned out well. She was excited about the \"dough only\" setting as she wants to make rolls and shaped breads. We are ery satisfied and highly recommend this bread maker.",
        "This is an amazing product. The first bread we made was a simple white bread. It came out perfectly. I even set the timer to finish the next morning at 5:30 and it did. Great aroma and taste. The second bread was a Pepperoni and Cheese bread and it was amazing. Perfect crust. I can‘t understand all those bad reviews unless your machine is defective. If you follow the instructions it will turn out great everytime. At this time, I highly recommend this Machine.",
        "I have been using this bread maker for several years and still works like new. As long as I measure the ingredients carefully the bread comes out perfectly every time.",
        "It doesn't work 4 months after I bought it. The function menu freeze. I couldn't choose any function except baking only. I called the customer service and was told to send it to Texas manufacturing center to repair. I have to pay about $40 for the sending !! I don't know how long the machine will work after being repaired. If it goes wrong again, will I send it again?? It's really frustrating! I wouldn't recommend anyone to buy it.",
        "Very stable process of baking, works for many years. Seems like very tough. No complains about functionality and durability of any component",
        "I'm a bread-machine veteran. This one has all the right features: 1) Long Teflon coated pan for horizontal loaves, easy loaf removal, and easy cleaning 2) Thick pan for uniform heating and ruggedness 3) Easily removable mixing paddle - no jaming! 4) Pause with beep to add raisins, dried fruit, etc. 5) Fairly easy programming for loaf size, crust, bread type 6) Makes GREAT bread Very minor issues: 1) The ceramic standoff inside is located so abusive treatment might cause damage. 2) The included recipe book could be more extensive. The internet, however, will provide hundreds of bread recipes to use with this great Panasonic breadmaker.",
        "I really like my new bread machine BUT... It is VERY LOUD... This is my second bread machine that i have owned. The first one was not this brand but i wanted to upgrade to a new design. I was not expecting to hear my machine bread machine running when I was using it because i never heard my prior one running when it was in use. I about fell over when i heard it mixing the dough... I thought holy cow thats LOUD is it broke =( . So be aware!!",
        "This bread maker is truly amazing. While the directions to make bread may sound challenging this machine makes it almost impossible to screw it up. Every single loaf comes out perfectly. The only drawback is the amount of time it takes to make bread. You need to think ahead 4-6 hours. The end result is well worth it. You'll find yourself wanting to make bread much more often. Controls are straightforward and easy to use. Timer feature is great so that you can have it start automatically and be ready for dinner when you get home. Makes the house smell amazing!",
        "My first machine didn't work properly. I called Panasonic for help but they are worthless. I only made two loaves of bread before it malfunctioned and they wanted me to drive 125 miles one way to have a service center look at it (or ship at my expense).....after only two loaves! Panasonic has the worse customer service I have ever seen in my 47 years. They just don't care. Amazon on the other hand, was great. Long story short.....I exchange my machine for a new one (same model) and it was on my doorstep in two days. The exchange process was quick and easy. The new machine has made about ten loaves so far and works great. Great job Amazon!",
        "Love this bread machine. Makes excellent bread, pizza dough, pretzel dough, cinnamon roll dough, homemade rolls, and tortilla dough. This machine is well worth the price. So easy to operate, just add ingredients per instructions and you are set. If you don't like the weight measurements, then search the internet for recipes in standard cup measurements. Updated review: Still going strong. I do use this more for the \"dough\" feature. This machine has been used weekly since I purchased it. Friday night pizza night, cinnamon rolls, fruit bread, homemade rolls, etc. have been made numerous times via the dough feature. I do bake bread in the machine occasionally, but prefer to shape my own bread. Still pleased with the machine.",
        "I used this product for almost 5 months (about once a week... Sometimes more) and absolutely loved it. Then, all of a sudden my bread is horrible. I've constantly been baking bricks. I contacted Panasonic about this issue and they told me to send it back to them for review. With this unit only costing $100, it doesn't seem worth it to send it back. It's a heavy product. It's going to cost a lot to ship it. I wish I ended up spending the money on a nicer bread machine.",
        "Wonderful machine!!!! I had a bread machine many years ago but sold it in a garage sale for 10.00! The texture of the bread was very coarse and just plain bad BUT this machine is amazing! The texture of the bread is fine--very fine and the crust is so flaky I thought it was wonderful! I can't make it fast enough! It makes some very funny noises while its kneading but hey it's not me kneading so I can live with the noise",
        "My original Panasonic bread maker was on its last legs after over 20 years of use and I liked it so much I decided to buy another Panasonic. The model is very similar and I hope the new one lasts as long as my original model. The new machine does make great bread and pizza dough, no doubt about it. But the new machine is far noisier than the old one. It's difficult to watch TV if the machine is running in the kitchen. In fact, it is louder than our dishwasher. I hope Panasonic will take this into consideration.",
        "I had had the Panasonic bread maker for twenty years when it finally died. ordered this one as a replacement and love it as much as my old one. makes a great loaf of bread and a quick pizza dough. does everything I need it too. Love It!",
        "Purchased June last year and now not kneading on the 13th months (only lightly used < 10 times). The paddle can still rotate with fingers, and the belt is fine at the bottom. Guess it's software/circuit issues. Called customer service and was told it's 9.99$ charge for just talking to someone. I am giving up after reading other reviews about the shipping cost and the poor technical support. Let this 110$ investment sinking down the drain....",
        "I have already made over 20 loaves of bread in this machine in the last few weeks since I bought it. About every other day! It is perfect for my family, I can make small, medium or large loaves. I usually make the small so we have very fresh bread every day. I have made the whole wheat, 7 grain, raisin cinnamon, pizza dough (which is awesome), oatmeal maple to name a few. I have only had two loaves fail and both times I realized I had made a mistake with the ingredients. I highly recommend this machine. If you would like more options, you can pay a lot more. But for family use, this one was perfect.",
        "I like the machine and how the bread comes out however Im having problems with the buttons. Sometimes they don't register being pressed and none work at all. so i unplug and plug it in again and that does nothing either. it gets frustrating and time wasting at times. I would have chosen a different machine if i knew id have these issues.",
        "Nice machine and it works well. The instructions are easy to follow so you can make a loaf of bread the first time right out of the box. Nice extra features like dough mode and pizza crust. I've had it for about a year now and like it a lot.",
        "We've always been happy with Panasonic products. When I looked over the various choices for a breadmaker I picked this model, even though it was more expensive than the others, because of the brand. My wife has been baking with it every other day, bringing the great aroma of fresh bread into the kitchen, with very little work involved. Our favorite has become the Wheat with raisins (half whole, half white wheat). The directions are very clear with many recipe possibilities. She especially likes the unit's ability to start on a timer, and to hold the bread for a time in a warm mode if she is not right there to remove the loaf.",
        "The Panasonic SD-YD250 is a quiet, efficient, large machine that makes loaves big enough to feed my family of 5 (and 14 yo son!). The yeast dispenser works well. I purchased this machine to bake bread with freshly milled wheat. The bread is tasty, but the recipes with the machine need a tiny bit of tweaking for fresh flour. For us, I've noticed a bit more liquid and yeast are needed to make a tall loaf. My children's favorite is raisin bread, and the beep for adding the raisins makes sure they stay intact during the kneading. The machine is easy to use and works well. I do miss a window...",
        "Being European \"imports\" we we're very unhappy with the American bread (Too fluffy, falvoured and not dense enough). We know that the situation has improved and that good quality bread can be bought in the US, but if you don't want to drive just for getting some bread, this machine is excellent. The build standard is very good and all metal. It's simple to use and makes excellent quality fresh breads every day. We use it for a family of 5 and the L or XL breads do suffice in size. Highly recommended!!!",
        "I had a Panasonic bread maker for about 10 years, and it was already used when I received it. That one, sadly, bit the dust a few weeks ago. So, I saw that Panasonic still made the bread maker and that it had hardly changed from my older (10+ years) version. There was no question about which bread maker I would be purchasing. I love my new maker. In fact, I have bread in it now. And it smells wonderful. Also, the basic white bread recipe in the instruction booklet is phenomenal.",
        "I got this thing in 4 days, thought that was awesome! It was a gift for my grandma an she loves it. Always thanking me for it, after running a few loaves an figuring it out the breads coming out excellent. I look forward to getting a fresh loaf of homemade bread when I visit, no more Safeway for this guy. I'm guessing learning to program the timer an such should be fairly simple considering she's an 80 year old woman an figured it out herself.",
        "I bought this bread machine and after making 3 100% whole wheat loaves I had to send it back because it just seemed to underpowered to handle the 1.5 pound dough. I really wanted to like this machine but was disappointed. I tried 3 different recipes to make sure it wasn't the recipe and also tried 2 different types of whole wheat flour. Oh well. I ordered the book \"Artisan Bread in Five Minutes a Day\" from Amazon and I am very happy with the bread that can be made using this fast/easy method. Thanks.",
        "I love homemade bread. I have been using SD-YD250 for over four years now, I make two to three breads every week. This machine is absolutely awesome. The timer function is great. All you have to do is put the ingredients and take the bread out when ready. Also great for making Pizza dough at home or using it for cake/doughnut etc. Super quality. Very little maintenance required. I would recommend getting an electronic scale to measure the ingredients rather than the measurement cup; for more accuracy.",
        "My husband and I have wanted a bread maker for years. After comparing various machines and reading all of the reviews -- positive and negative -- we decided to take a chance on the Panasonic SD-YD250. We have used it nearly every day, sometimes several times in one day, and have yet to be disappointed with our purchase. It's quiet (the occasional clunking noises are normal) and it does a good job of baking the bread evenly. My only complaint is about the control display. I'm 5'4\" and I have to stand on my tiptoes to see it properly. It would have been better to slant the control panel toward the user for better viewing.",
        "I wasn't sure if I was going to be happy with this bread maker. I was replacing a 25 year old Panasonic bread maker that died. Like aging wine, Panasonic out did itself with more whistles and bells, which my old machine did not have. I made my Sweet Hawaiian Yeast Bread, as a first run. I must say... I am so impressed with the outcome of the dough.... it is beautiful. I hope we have a long life and will continue to be happy with this machine.",
        "this bread machine is so easy to use and i'm wowed by the beautiful bread loaves. i'm having to move to small loaves because the loaves come out so big. unbleached bread flour and no preservatives are an added plus. i made the zuccchini bread recipe - not the kind like banana or zucchini bread in a loaf pan. Just more spicy flavors but you could really use the zucchini recipe for every day bread. Love this machine. Oops - almost forgot - it is really nice and quiet. I think the most noise it makes is when the machine is kneading the bread and even then it's not obtrusive at all.",
        "When my old bread maker finally gave out, I started doing some research. I read many reviews for the various makers. It was a toss up from the bread machine and this one. The oher reviews kept pointing to this one. I kept reading and finally bought it. I have NO Regrets, this one is Great! My old one did up to 1.5 lbs but this one goes to 2.5 lbs. Now I have plenty of of bread for larger gatherings. I love the delay, since I can get everything ready have it ready when I return from work. The delay feature is a life saver at times. I would recommend this to those who love home mnade bread!",
        "This is one of the best purchases we have made! After a long time of making our bread by hand we finally decided to get this and I am so happy we did! It made our life so much easier and it is so easy to use in general! Comes with a recipe book that we have constantly used and bread turns out amazing! Not too loud either. I would definitely recommend this!!",
        "Keypad is difficult to understand. The recipe book gives you the wrong amount of yeast to use and is difficult to understand. I called tech support waited 40 minutes and got an idiot who tried to read the manual to me and then told me I had to make the dough in the maker and then bake it in the oven. I sold it on ebay and bought another brand so much better cheaper and easier. This machine is crap very user unfriendly",
        "This my second Panasonic of this model. My last one I bought in 2007, I originally bought it because they said the bread pan could be rebuilt. I did this once and the pan is my backup for this one now. So 7 years of daily use it survived. The heating element finally gave out, so I had to retire it. I am really hard on them. I have been making bread daily for about 18 years and this model is among the best out there. The sandwich cycle makes a very soft crust and soft bread. I usually use the 2 hour setting these days and it makes a nice loaf. I hope this one lasts 7 years too.",
        "A very good bread machine. I've tried about 6 loaves so far and initially I thought that the bread came out a little dry and over browned. The light crust setting would make a loaf that medium / dark crust. After some experimentation I've found that the keep warm function is to blame. If I take the bread out as soon as it's done, the crust is just right. Also if I take out the bread 10 min before, the bread is very moist. The whole wheat setting and the basic settings create very nice loaves with good texture and flavor. I would give the machine 5 stars if I could adjust the bake cycle shorter by 10 min.",
        "Second time purchasing this bread machine. We haven't bought a loaf of bread since April 2012. This machine has made bread 5 times a week for two years and eight months- the only reason we replaced it was it went on lightning deal, so we upgraded to a new one. We make clean whole grain bread and rolls with this unit! It's reliable and efficient, a complete pleasure to own!!",
        "I read the reviews and am glad I did. Am very pleased with the machine. I felt the machine was quite quiet. It was heard when mixing, altho not loud. From the initial loaf the bread turned out beautiful. The only problem I had (and it could have been a new recipe) was that the pumpernickel turned out really dark & hard on the outside. Do wish that there was a choice of crust color for the darker breads. Overall the bread machine has not been a disappointment, just set it and forget it until it's finished. My husband is always in line for that first, warm slice. Yummmm!",
        "I purchased this product - actually TWO of this product - one for me and one for my daughter. We have had many breadmakers in the past - this one just isn't a good choice in our opinion. The display is hard to read, the instructions difficult to follow and it's just not user friendly at all. We returned them both and got the Zojirushi breadmaker instead - more money but definitely worth it! If you want an easy to use breadmaker with great options, this is probably not the one for you.",
        "Easy to use and clean!!!! Booklet with machine is very informative, easy to follow instructions. My only complaint is storing it when I am not using it! LOL!",
        "Our dad recommended this bread machine and boy was he right. We have tried several other machines and none of them compare. This machine produces the largest loaves ever and wheat bread acutally comes out light and not heavy like other machines. The only complaint: a better recipe book. Some of the bizzare measurements do not compute either in ounces or weight. This only applies when doing larger loaves. We love this machine and the bread is fantastic. Going to try Pumpernickel bread next using flour from King Arthur Flour company.",
        "I thought when I ordered this product that it would have a gluten tree setting. I didn't want to experiment with the different settings to see what would work best. In other I thought with so many settings it would have a gf setting that would be easy to use. Since I do not see very well, I decided to sent it back for one with a gl setting. Amazon made it very easy for me to do that.",
        "First Bread maker ever owned and I am impressed with how easy it is to use.. Great first experience. I made a medium size basic white bread and it was so good i had to eat the whole thing same day.You put the right amount of stuff in and you get bread out. The digital scale helps to measure the flour I would have liked to see a sourdough recipe but I am happy with whats included in the manual.",
        "This bread machine has a large capacity and does everything a bread machine should do, including making dough. We have been through many bread machines over the years. Most do not last very long. This bread maker has been fantastic. We have used our Panasonic bread machine several times a week for over nine years now with no issues or complaints. Thank you Panasonic!",
        "Love this breadmaker. I had one almost identical several years ago that I loved and so when I needed another one, I looked at the updated Panasonic again. The great reviews and the great price helped in my decision.",
        "We have made about 10 loaves. No two are the same recipe. That may come from being a retired chemistry reacher. I like to experiment. Pro. It makes good bread. Very good with no voids and consistant texture inside the crust. Con. On the light bake crust, the crust is a little dark and harder toward the bottom of the loaf. The text in the onboard settings are not easy to read. Overall, we have recommended it to family. The sound of it working is music to our ears. Amazon and Panasonic YD250 are good no matter how you slice or spice it.(just butter them up)",
        "After 7 months use, still getting great bread everytime. If you've ever been to Japan, you know the Japanese make good bread, and the Panasonic SD-YD250 is no exception. What we've learned: * measure flour, water perfectly. * don't use old flour (old meaning left open in the fridge for 6 months) * use bread flour, seal well after use, store in fridge Here's our favorite whole wheat bread recipe: 2 cups whole-wheat bread flour 1 cup white bread flour 2 tbsp honey 1 1/2 tbsp SmartBalance (beats butter any day) 1 1/4 cups water 1 tsp salt 1 tsp yeast (yeast receptacle only) (settings: size small, bake, whole wheat)",
        "Retired, I started reading about the chemicals in bread. Thought I'd try my hand at making bread. Researched and read reviews. My Panasonic arrived last week. Made my first loaf soon after. Perfect. Second loaf. Perfect. Way too easy. The bread tasted great. Now all my friends want me to make a loaf for them. Maybe this might not be as economical as I thought. Didn't factor in the free loaves. Buy.",
        "I bought this machine 2010, and made a lot of bread and Chinese Onion pan cake. I also did something bad to it by forgetting water and found my poor machine turn to yellowish. But It still works as normal. She is reliable if I did my share. Family and friend love my bread especially when I add more butter! Of course I recommend it!",
        "It's a good bread maker when it works. After 11 months of use it broke (no signal when turned on). We send to repair, it took apron three months to be fixed. Now, 4 years later, it's broken again (it turns on but doesn't execute any program). I'm disappointed since it's not that complex appliance. During the period it was broken, I ended up buying a new bread maker: simpler and more reliable.",
        "OK, works great. Read directions before using, and it will product perfect loaf every time. I have made 8 loaves in the last month w/o a problem. I substitute apple sauce for oil in all recipes and have had excellent results. Bake whole wheat bread with Bob's Red Mill pre packaged mixes which I get for $2.28 per loaf. This compares to a load of Arnold or Peperidge farms at $4 ++. The bread cavity is teflon so nothing sticks to the sides and cleaning is not necessary. Great product.",
        "DONT BUY THIS MODEL IT IS OBSOLETE AND NO PARTS SOLD OR PRODUCED,,,,,This machine's bobbin broke after 8 uses AND it's no longer being produced. No part available and Panasonic has the nerve to sell and obsolete Unit via Amazon. I bought it last November of 2014! Panasonic has a one year warranty but one bears the cost of return shipping of 30.00 depending on your location plus 2 return emails were sent per their instructions and no reply with swapping out the machine",
        "I was very disappointed. The Panasonic made a good loaf of bread when I used mostly white flour, but when I tried to make a whole wheat bread with buttermilk that I'd make many times with a Hitachi machine that had given out, the bread came out as 2 inedible lumps. I tried it again - same thing. On another bread (white flour with chocolate chips), the crust was burned and the chips were all at one end. (I'd set it on light crust.) Also, the manual has errors and, as some previous reviewers have written, the monitor is hard to view. I was very impressed with Amazon, however. I got a full refund.",
        "Don't buy this product. The motor is defective, and it broke down when I just had bought for seven months. Unfortunately, it has expired of returns period just for one month. My sister bought the same product which had the same problem. I highly recommend don't buy this stuff. It doesn't worth.",
        "I bought this breadmaker since it seemed to have the most good reviews, and I have not been disappointed. I have only one issue, the rapid bake option does not leave the bread very good, it turns out much drier than I would like. BUT... using the normal bake option, it takes longer but the bread is great.. I have tried many if not all of the receipes in the book that is included, and all the receipes turned out great! Very happy with my purchase and would recommend this product to any potential buyers.",
        "Making bread at high altitude with low humidity can be a challenge, not with this bread maker. A medium loaf is the perfect size for sandwiches. I can control the ingredients that we are eating. Would recommend it.",
        "This won't be a very specific review because I don't know much about bread machines. But my mom has had a lot over the years and is very picky with them. She can always find something she doesn't like about one. I got this for her when her last one broke. Well, she loves this one. She makes bread about twice a week with it and it hasn't had a single problem that I heard of. She did say the delayed yeast despenser was a great feature.",
        "Love this thing....and we are always finding new recipes to make tasty bread specialty stuff (dinner rolls just last night, to pair with a yummy lamb stew....perfect!). We've used our machine for YEARS and it has held up brilliantly. My husband rates this as one of his top Christmas gifts, ever.",
        "I purchased this bread machine after seeing a write up by Caroline McDougall. She raved at how great all of her bread turned out and that she especially liked the fact that the yeast dispenser, which is on the top of the machine, drops the yeast in at just the right time. No worries about your bread not rising any longer. I have owned a bread machine for years and I have had some failures with it that is why I purchased this one. Very happy I did!!",
        "Home baked bread! What more needs to be said. There is nothing that smells quite like the aroma of bread baking in the kitchen. I have used my new Panasonic bread maker to make sandwith, regular, and whole wheat breads and they all were done to perfection. This product works like a dream and I have had no problems. It takes a long time to make a loaf but a little planning circumvents any inconvience. I beleave the time is one of the big secrets to this systems success. I love fresh bread from this machine:)",
        "Every loaf has been perfect... easy to use, program and clean. No more \"store bought\" bread for us... we make healthy, delicious loaves easily with this great bread machine. You won't be disappointed. Hint... be sure to add Beth Hensperger's \"The Bread Lover's Bread Machine Cookbook\",,, every recipe has been wonderful ( we've tried 15 so far!)."
    ]
}