{
    "entity": "Electric Griddles",
    "text": [
        "returned, took griddle from box and put it back 5min later. cooking deck is very thin, heating element stood proud into cooking surface making surface not flat. read reviews before purchase (good and bad) and thought it would be an ok purchase. personally was not aware of any nonstick cooking surface that either needed to be \"seasoned\" to maintain nonstick qualities or was recommended that you remove pet birds from the area so the fumes would not kill them, honestly, this is part of the instruction sheet. needless to say i did not use it, it may cook perfectly ok, but first impression suggested otherwise",
        "I've had many electric griddles over the years, but this Broil King is by far the very best. Easy to clean, large surface, removable back splash and a breeze to maintain with adjustable rear legs to raise rear of griddle when cooking steak, hamburgers or chicken to drain any grease to the catch tray in the front. Great for morning eggs, hash browns or pancakes. This is in my opinion a 5 star product.",
        "I bought one of these in 2008 and loved it. It was used almost very weekend and was great. It recently stopped working so I ordered another one.(Oct 2017) I bought a \"used\" and had to send it back and then bought a new one and had to send it back for the same reasons. The back approximate 1 inch of the griddle was rough to the touch unlike the rest of the surface. The cooking surface was not flat. It was raised from underneath by the heating element. You could see exactly where it was located. I am very sad that I am unable to replace mine and hope they get their quality control better.",
        "My favorite indoor grill EVER! An indoor grill is a must in our household and we have been through many. Most nonstick grills are ok. But cheese and super grease can still be problematic when trying to clean. This grill is amazing! It is the easiest to clean by far! Cheese is no problem during clean up. Burgers, oils, no problem. Cooks evenly for the most part. I would say there are special spots that are hotter than others but I have had some that have one special side, this is way better. I have not used the splatter guard, but just because I don’t think of it.",
        "This was the most disappointing purchase EVER! It's advertised and priced as a \"commercial\" griddle, but it's nothing more than a cheap griddle with a steel guard that doesn't even attach to the unit and is therefore useless. On top of that it didn't work! The power unit didn't fit the receptacle and so there was no way to power it up. Don't waste your time on this one! I sent it back. Giving this one star is too high a rating!",
        "The quality of this griddle is excellent. The nonstick surface is truly nonstick. You can fry an egg or cook pancakes on it without issue. The backsplash is finicky and doesn't fit on great but it does do its job. It just never seems secure. It holds the temperature you set it at on the entire griddle. The nonstick surface durabilty I think will be the big test in this. The backsplash has scratched off the nonstick on the sides and back of the griddle. It doesn't affect the performance of the griddle but I'll need to keep on eye on it to make sure it does peel off at other places.",
        "Really not even a half star rating. Price and picture makes it look heavy duty, well it was not. Backsplash is a flimsy piece of metal and griddle is basic. Looks exactly like one I bought for $30 at Walmart. Inquired to return it, well you have to send back in original box, so it will cost $60 to return and then 20% restocking fee... so I’m stuck with an over priced griddle... I don’t recommend buying from this item. Expected more from this brand.",
        "This is definitely the best cooking non stick griddle that I've ever had. It heats evenly and better than 10 Walmart griddles. However, the design of the handles could have been better. Both handles broke off. And since the legs are integrated into the handles, you can't cook on it without them. I fixed them at one point with some JB Weld, but it only lasted a month or so. The point at which they are attached is just too weak. I've tried to see if the mfg would send/sell me some new legs, but no luck so far. I will likely buy another, but just handle it carefully.",
        "We like our BroilKing Griddle. It cooks evenly and quickly. However the grill we received is not as advertised. The griddle is described as having adjustable rear leg that will lift the rear of the griddle, facilitating the drainage of grease from items such as bacon and hamburgers. The included owner's manual also describes these \"Healthy Lift\" rear legs. This feature is not included in the unit we received. We have tried to contact the manufacturer only to have our message blocked.",
        "I love this griddle, I use it two to three times a week. It hold a large amount of bacon and has a very steady temperature across the whole griddle. I like the fact that it has two little feet that can be put up to drain (bacon), or down if you want a flat surface (pancakes). The reason I gave it three stars is after two years, the thermostat broke. :( Fortunately, I was able to purchase a $20 universal thermostat to get it up and running again, but I was a little disappointed that it only had a two year life, had I not been able to find a replacement thermostat...",
        "Have tried it a few times now and appreciate having it. Much faster cooking pancakes on this than in a skillet or two. Found that I needed to set the dial to 350 deg to get the results I wanted, vice the 325 that the brochure recommends. I thought that the 'spatter guard' was a little kludgy, but it serves well when you're trying to lift a bunch of cooked onions off the grill. Much better to trap them against the guard than chasing the veggies all over the grill. Cleans up easily.",
        "This is my second one. The first unit lasted for several years the only thing that failed was the controller and I couldn’t find a replacement, so I bought a new grill. It was worth it and I’ll do it again if necessary, but you need to make replacement parts available! However, enormously better than the obvious choices at popular the department stores.",
        "I love griddles and was tired of the B&D's, Prestos and other typical homeowner griddles that have inconsistent heat and short lives so I looked up something more durable and heavy duty. So far very happy I made this choice. Cord is heavy duty and longer than most counter top appliances which is nice. Leg adjustment tabs are convenient when cooking bacon. Haven't used the shield yet, but so far very pleased with the space it offers and everything is as expected.",
        "This is my second purchase of the Broil King. The previous purchase lasted about 10 years before the top was just too beat-up to continue using. I got a ton of use out of it. Just to be clear, the old PCG-10 was not broken. It was working perfectly. It's just that the teflon began to degrade from lots of use like with any teflon pan or hot plate. The quality is as expected from Broil King.",
        "I have tried other stove top griddles, but the heating elements were not even, and anything I tried to cook was not done at the same time. I invested in this griddle and found it to be easy to use, everything was done at the same time, and easy to clean.",
        "Relatively even temperature distribution (I used a non-contact IR laser thermometer) and excellent Teflon coating. It is still working nicely but the Teflon is wearing out after about four years. Otherwise, it is still working fine and I use it for things like burgers but bought a cheap one to get a great non-stick surface - unfortunately, the cheap one $20.24 stopped being non-stick after three weeks sticking eggs even with PAM spray.",
        "Returned this griddle, even though the return shipping was outrageous. This griddle is nothing like the Broil King one I have had for a few years. It’s like a factory second or a knock off. The surface was very rough. My shipping carrier said a lot of companies are selling inferior goods, knowing most people will keep them rather than pay to return them.",
        "Exellent Griddle - bought it for work and everyone loves it. Gets hot fast, and the backsplash keeps things from getting all over the place. Update: 10/25/2017 Griddle is still going strong, and it gets used on a daily basis, multiple times a day, and sometimes for MASSIVE cooking events. Doing very well.",
        "Product did not arrive in original Broil King box. I opened the box from amazon and it was just laying in there with scratches all over the cooking surface. Extremely disappointed with this purchase - especially as it was a Christmas gift for my dad. It was very clearly a returned item form another customer.",
        "After rave reviews of the product on TVs Cook's Country, I ordered the griddle. I was unable to use it and returned it for refund because the electric cord heating element would not enter the receptacle on the griddle. No explanation by the company or offer to replace it. I rated it 2 of 5 just because of the TV recommendation.",
        "This is a great griddle! I've been using it for a couple of months now and I love it. The non-stick surface is really that! Non-stick! Eggs and pancakes cook up great. I also really like the back board, it works well for veggies and such when trying to get under them to flip. It also heats pretty evenly, better than any other griddle I've used.",
        "The surface is unusually bumpy, but that doesn't keep it from being non-stick. The tilt function by flipping the legs down works great. You can fit nearly a pound of bacon on it at one time and it cooks evenly across the entire surface. This isn't something that lesser griddles tend to do. I used a temperature sensor and it's within 10 degrees when I check across the surface. I don't care for the backsplash, and the underside of the unit is really rough. I've used it for a couple of things today when it came in. If it lasts, I'll leave an update in a couple of months. So far my wife is really happy about this purchase.",
        "Very minor issue has to do with storage for the detachable stainless steel back-splash that comes with the PCG-10. If they could figure out a way to hinge the two small end panels of the back splash so they could lay flat against the center panel, and swing out when installed on griddle, this would make it much easier for storage. Also, in the on-line description, they need to specify that it is a CERAMIC non-stick coating and not some other type of non-stick coating.",
        "The only minus for this grill is the metal \"backsplash:\" it didn't attach easily, and I ended up scratching off some of the non stick coating on the side of the grill. Rather than inflict more damage to the grill, I opted to leave it off. Also, the Broil King emblem on the temperature control has come loose. So, seriously, these are my only problems. That says something--the grill works well, and I'm quite pleased with it.",
        "We have been thrilled so far with our purchase. Heat distribution is good, no notable hot or cold spots that we have noticed so far. The retractable risers on the rear legs are helpful in draining away fat when cooking bacon. It has done a great job on bacon, sausage, eggs, pancakes and french toast so far, absolutely no complaints about the performance of this unit. Perhaps the only quibble is with the spatter guard, it fits fairly loosely into the handles, so never really feels like it's secure there. This is a pretty minor thing, however, and does not at all impact our overall opinion of the griddle.",
        "I've been using this2-3 times a week for 3 years and it still works perfectly cooking pancakes evenly, heating up quickly and cleaning easily. The edges are a tiny bit cooler than the center but only noticeable on a full pan of thin bacon. Great product.",
        "I bought this griddle for my wife and she loves it and uses it at least 3 times a week. It works great. Some of the reviews were a downer on this product but I'm here to tell you it works great. Yes, it has hotter spots and cooler but if you understand how a griddle works it is no problem. Thanks for a great product. Rick.",
        "The product works as advertised. We have had at least a dozen griddles in the past and everyone of the had hot spots and uneven thermostatic control (hot, then cold, then hot without touching the dial). The Broil King has virtually eliminated these problems by using a better temperature control circuit and heavier gauge wire to reduce variation of current.",
        "I was hesitant to order the griddle due to size. Since there are only 2 of us, I thought it would be better to find a smaller griddle, but Broil King didn't make one, & I had read enough reviews to know this was the one I wanted. Well, surprise! Cooking on it for just the 2 of us is no big deal - bacon, hash browns & Buttermilk pancakes cooking at the same time is a joy. The best part of using this griddle is the ease of cleanup, takes no time at all. I'm so glad to have it in my kitchen!!!",
        "I chose the Broil King Professional Portable Nonstick Griddle after watching a professional kitchen YouTube clip where it came out as the best choice of about 5 or 6 different makes. They used an infra red thermometer to show that it had the most even and consistent temperature of all compared. Yet when I made pancakes on it I found there to be some temperature differences across the surface. Still I really like this griddle and would recommend it. It also has a drain hole and removable catch tray that is handy.",
        "After my last griddle wore out, my husband bought me a new one which I felt was poor quality and I hated to use. Determined to find a good quality griddle, I did some research and ended up purchasing this one. I have not been disappointed. We have had this griddle over a year now, and use it several times each week. It cooks evenly and shows no sign of wear. The backsplash is easy to attach and great for when you are cooking something that will splash grease like burgers or bacon. This was definitely worth the extra money.",
        "I recently had a soup and sandwich day at work. This worked out great! I used this griddle to make 48 grilled cheese sandwiches. I was able to cook 12 at a time. Overall cooking results were about the same across the surface. I did have to turn sandwiches while cooking, but I do that on my cook top also.",
        "This is definitely not the cheapest griddle but it this unit was worth the price. The nonstick coating seems to be thicker then other griddles I've owned. It heats up fast and I find it heats evenly. One tip; set the griddle at the temp you want and let it sit for a few minutes, that alleviates the hot/cold spots. It's not perfect, the splatter guard comes off easily and is another piece to store but overall this is a great griddle.",
        "Very uniform temperature on the cooking surface. My only complaint is that I cook pancakes on the hottest setting. So this is perfect if you want it for Sunday bunch, but not hot enough to sear meat or fish for dinner",
        "Hands down my favorite item - cooks evenly cleanup is easy, love this.",
        "This is a wonderful griddle. Some have complained about the lightly made, aluminum back splash. I think it works just fine and it is very easy to clean and handle as is the griddle itself. I have not found any hotspots on the Broil King like on my old Presto griddle. I do bacon, sausage, eggs, pancakes or French toast brunches almost every Sunday and this griddle is reliable and easily controlled. It is immersiible and cleans up almost effortlessly.",
        "I am so happy with this purchase. I use a griddle every day making breakfasts, lunches, and dinners. And I feel like I bought the BMW of griddles. It heats evenly and perfectly. It is easy to clean. It is large enough to cook eggs and bacon and potatoes at the same time. The packing was great. I would buy this again if I needed to, and I have told my daughters to make it there next purchase. Worth every penny. Wish I would have bought this a long time ago.",
        "DO NOT BUY from this seller! I purchased this as a Father’s Day gift for my husband. It took us awhile to open the box and when we did, we found that the griddle was in terrible condition and appeared to be used. I contacted the seller and was told that I cannot return it and to contact the manufacturer instead. I’m definitely disappointed.",
        "Worked great until we started to smell burning electronics. Had a cheap Presto for years and never had any problems with it. Just dropped it and broke the handle. Bought this because we enjoy using a griddle. Thought we would get more out of a more expensive one. Cheap parts!! Too bad. We will not be purchasing another one of these.",
        "I love this. it's larger to hold a lot. Heats evenly and fast. The only thing I'm not overly fond of is the splatter guard on the back. It difficult to store if you don't want or can't keep it on the griddle all the time. It also comes off easily when you go to store it if you bump it. This can scratch the surface if you don't wrap it since it doesn't lock on.",
        "Sold me the version with no splash guard. Suppose to be the PCG-10 but instead it was the PCG-5. Bad advertisement.",
        "This is the second one of these grills that we have purchased, not because the other one doesn't work, but because it is amazing. We easily get breakfast ready for large family gatherings in minutes. With the use of a press, bacon is PERFECT! Easy to clean as you can submerge the entire grill. The guard does help, but if you aren't careful it scratches the surface, but you don't have to use it.",
        "I bought this for my husband to feed our 3 growing kids their weekend pancakes. It's huge, so kids don't have to take turns eating and waiting for the next batch to be done. I use it for toasted sandwiches, burgers when it's nasty outside, quesadillas, etc. We don't use any kind of spray oil, which can cause build-up on the surface. I do use butter on occasion and it still looks great after many uses. The underside is not finished well, so be careful if you grab it. Quite sharp underneath.",
        "This griddle works great. I have owned a few other griddles like Presto, etc, they always heated unevenly. This griddle seems twice as thick for better heat distribution. This grille cooks a perfectly even pancake, no dark line where it sets over element. The above paragraph is about 6-8 years old. I forgot to post. It just died. The thermostat failed. I would certainly recommend it. Great pancakes, bacon and eggs, even White Castle style sliders.",
        "Got this griddle to replace my old electric griddle that was on it's last leg. I have only used it a few times, but so far I love this griddle. It heated quickly and evenly, giving me beautiful pancakes. I like that there are aot of temperature settings, I will have to use it for other things/",
        "This griddle performed up to expectations. The description said it heated evenly... and it does. All my pancakes come out looking the same. I love this griddle. Well worth the money.",
        "We had one for years and it finally died. Was able to get the same one but don’t like the coating on the new one.",
        "This griddle seems to work fine although the backsplash does not fit well, smart idea about the back legs having the ability to raise slightly to help move grease to the drain in front.",
        "Nice big cooking surface. As other reviews said, it cooks fairly even IF you let it pre-heat fully. It's not as heavy duty as I thought it would have been, but works well. Overall, the best griddle that we have owned, but it's not impressively better and I doubt if any 'Professionals\" would be using it.",
        "I loved the overall use of the product. However, after 1.5 months the surface lost its nonstick quality if places. Other than its uneven heating there aren't any other major issues.",
        "I make pancakes every Sunday. I have owned several electric griddles over the years and this is by far the best. I also use it for other things from time to time. I like an electric griddle for the consistent temperature you get from having a thermostatic control. I plug it in and let it preheat while I am preparing the food to be cooked and setting the table. It is also great for quesadillas for a family. This griddle is a wider than the ones I have had in the past so it is easier to fit the food on it. The nonstick surface is excellent. I love this griddle!",
        "The best top grill we have bought! I wish I knew about this one before I bought all the others. This is worth the money! Thanks to America's Test Kitchen for testing and reviewing this griddle on their show.",
        "I was given a foreign made griddle/panini maker for Christmas and it did not heat evenly or hot enough on max. Pancakes would not brown. Back to Bed-Bath for a refund and then online, hunting for a heavy duty, functional griddle. I have owned and operated 3 restaurants over the years and I care about function first. Simply put, this griddle WORKS. If you are ready to cook, bacon, pancakes, roasted vegetables, steaks, chops, this is the one. It only cost another $15-20 over the foreign version but I made back that value on the first use in frustration reduction! RECOMMENDED.",
        "Shotty workmanship that is not worth your money! I used this griddle about once every two weeks for a year when the tempature control blew. I then tried to get a warranty replacement and never heard from the company!",
        "We love this! We first saw it at a friends on vacation and had to have one for ourselves. We use it almost daily! The backsplash keeps any splatter off the counters!",
        "I like the BIG surface area and it heats more even than others I've used. Only problem is I cant find a place to put it up",
        "I bought 2 of these for our clubhouse and love them. Just wished we would have gotten the partition to keep splatter off. Got one, but we return 2 times & never got the splatter guard.",
        "Cooks everything I use the skillet for eggs, pancakes, burgers, and even toast the buns. I wish you had one with electrical outlet on the left side without reversing it. Will keep looking incase you make one.",
        "I got three years out of it. After three years the temperature started running inconsistently. It runs 50 degrees hotter than what it's set at. For $100, i would have expected it to last longer.",
        "Solid construction. Heat distribution, although still not truly uniform, is better than anything else I could find for consumers. Easy to clean up. I have every reason to believe this griddle could outlast me.",
        "The product was unusable out of the box so Im giving it two stars based on it being poorly built not its cooking ability. The two alignment holes on the plug for the heating element had metal cylinders deep in the plastic casing that would prevent the plug from seating firmly in place to the griddle and wouldn't supply power to heat it up. On a lesser note, the splash guard had protective coating on the back to prevent scratches during shipping/manufacturing, but the front had no such coating and was thoroughly scratched along the front. It still serves it's purpose, but it's a cosmetic defect worth noting.",
        "The first one came damaged, but a replacement was soon to follow and I love it. After 1 year of use, it still looks like new.",
        "After putting up with a cheap Presto with a cooking surface directly over the oval heating element for too long, I broke down and bought one of these beauties. I was so totally satisfied that I bought a second one for the cabin. This thing just flat out makes frying a pleasure. All of the things mentioned already; the even heat, the non stick surface, the accurate temperature control, the backsplash and the overall great quality of an American made well engineered product has me delighted. Highly recommended.",
        "We have had many nonstick griddles over the years, but this one out cooks all of them. It cooks evenly over the entire surface and heats up better than all of them. It has a heavy duty cord and the back guard makes it easy to scoop up your fried potatoes without getting them all over the counter. Would definitely buy it again.",
        "Worked great for the first month. Now one side is much hotter than the other and the non stick feature is non existent. What a complete waste of money.",
        "Got two of these, one for us, one for my daughter. They are of excellent quality, perform better than any other we've used, simple to clean, all-around excellent. Cooking heat is variable from one side to the other, but is actually a benefit when you catch on to it, and we get great results every time.",
        "Nice quality, and fairly even heating for this type of grille. My mother has been using hers pretty much daily with no complaints or build-up. But be sure to check the insertion of the heating cord. The first one I bought for her was defective: it wouldn't engage fully and sparked and arced, burning and melting part of the plastic housing.",
        "Great grill, even heat, Sturdy. I haven't used the splash guard. Not sure why it would be used.",
        "The griddle was received with a crack in the cooking surface.",
        "My only concern in ordering this griddle was the length. I was worried about maneuvering it in the sink to be washed. I forgot that the over all length includes the handles. It turns out that with a sprayer at the sink it isn't difficult to maneuver. And it cooks great. I'd definitely buy it again.",
        "I use griddle 4-7 times per week. This one is best I have ever owned. No hot spots and cleans very easily. I will pass on the splash guard on next purchase. Good idea poorly executed that causes damage to non-stick surface when installing and removing. I just don't use it.",
        "Excellent product! Best griddle for home use, precise temp control and very well made. Also Broil King customer service outstanding! A great American made product, so hard to find quality kitchen appliances this product truly stands out.",
        "Great grill, except on mine the right 1/4 surface area isn't quite as hot as the rest of the surface, requiring me to allow for and/or make adjustments while cooking (e.g. accepting the fact that the pancakes in that area won't brown as well as the rest of the batch on the griddle). I don't have the type of professional thermometer measuring surface temps that the reviewers I read had, but simple usage is telling me there's a difference. IN a way, I wish Broil King or you guys would replace it with one whose temperature IS uniform across the griddle surface.",
        "This is the one to buy. Unless you have 500 to drop on a commercial griddle... It heats very evenly. Our pancakes turn out great! One grip: the legs are indeed not level by about 1/8 of an inch. I leveled the griddle with duck tape on one leg as a riser pad.",
        "I have not seen problems reported by other reviewers. The griddle is heavy and large, but that goes with having lots of room and heating evenly. The handles and thermostat attachment are sturdy. It makes six identical pancakes at a time at 350 degrees--far superior to small pans with 1 or 2 at a time. The nonstick surface has some slight unevenness in a couple of areas but this does not appear to be a problem. Haven't tried it on bacon yet; no experience with the drain, but it all looks OK. Highly recommended.",
        "This was the second time I bought this product and there appears to be a clear drop in quality. The last one lasted over two years while this one has lost its stickiness in less than 6 months, despite careful cleaning and use.",
        "I purchased this for my daughter for Christmas. She loves it!",
        "Worked great in the beginning. Back cover got in the way so that was tossed to the side. Burners started to go out within a couple months.",
        "I love it . Iy does what its suppose to.",
        "Excellent! Best griddle I've used. Heats pretty evenly, and I usually don't even need cooking spray or oil...cleans easily too.",
        "The guard metal frame scratched the skillet. I would not recommend using the guard metal frame.",
        "This is a high quality electric griddle with solid design features and well regulated heating that does not fluctuate. Purchasers should be advised that, much like an actual grill or griddle, there is a heat variation between two sides of the griddle - it has a hot side and a \"cooler\" side. This makes it excellent for foods that benefit from such an arrangement, enabling you to move foods to the lower temperature side to prevent burning/overcooking (e.g, steaks). This is less than ideal, however, for other foods where consistent heat throughout the surface would be preferred (e.g. pancakes).",
        "This is our 3rd Broil King PCG-10 griddle because we love it so much we always end up giving our current one to one of our friends and then we have to order another for ourselves. Never disappointed, works great, lasts years, cleans up with a paper towel on the warm grill surface. No complaints ever.",
        "Works well. Cooked for 40 people 3 times a day for a week.",
        "This griddle rocks! Heavy duty and even heat. Update - Two years later and it is still going strong! Update - Three years later and still going strong . We use it all the time.",
        "PRO - wonderful cook surface. A true jem. CON - minus 2 stars for splatter guard that has raw edge that dig into the non-stick surface and threatens to fall off. Straight to the trash can with the guard. I'll just need to wipe the counters down, just like I would with any other grill.",
        "The nonstick griddle surface is excellent and makes clean-up very easy. The nonstick surface on the PCG-10 is actually double coated which is definitely superior in the long run. The griddle can be washed in an automatic dishwasher, but due to how easy the unit is to clean I have not had any reason to do so. I previously owned a Broil King USG-10 nonstick griddle for years. It performed very well. However, the USG-10 nonstick surface in not double coated as is the model PCG-10, therefore the surface life expectancy is not as long and the nonstick properties are not as good as the professional model. I would highly recommend the PCG-10.",
        "Nice size, does not stick. Temp setting seams a tad low, but that’s it.",
        "This griddle turned out meet or exceed all its claims. It heats much more evenly than cheap griddles availalbe at the local box stores. The non-stick surface is also superior and my wife loves the backsplash. The heating element and cord are heavy duty. We use it every day and are very satisfied with our purchase.",
        "Heats evenly and easy to clean. The only thing that I feel needs improvement are the legs of the griddle. They griddle slides too easily on counter top.",
        "After throwing away griddle after griddle, I found the one I been looking for. A little more than I've spend in the past at $100.00. But, I would have to say, spend throwing away 4 griddles price ranging 25 to 45 dollars. Eggs don't stick, food cooks evenly. Eggs, hash browns, bacon, pancakes and even hamburgers when it's raining. The size is great for a family of four.",
        "Don't know yet how this grill works, the controls never fit into the griddle and I'm still waiting for my replacement griddle...it looks great though . ..",
        "Likes: - It's big! - Easy to clean! Dislikes: - The power source/plug wore out and finally stopped heating today. The light is on, and it plugs in, but the griddle will not get hot. Very disappointing because of the price. What do I mean by wore out? I'm guessing it's due to gravity, but the plug into the griddle would lose \"contact\" and stop heating the griddle. I would need to prop it up straight with something. This started occurring within a year, and today it just won't heat. It's only 22 months old.",
        "I bought this griddle after reading other reviews and it is perfect! A large cooking area that heats well. After using for 1 1/2 years the probe quit. I called to get free replacement ( has a 2 year warranty ). After providing proof of purchase, I recieved my replacement in 3 days! I love this griddle!",
        "Poor quality for the price. Non stick surface scratches off easily. Stainless steel back splash is flimsy, and contributes to some of the scratches on non stick surface. I personally expected better quality, and would not recommend this product.",
        "I have cooked bacon and pancakes on this several times now. The size is great. I can make all 3 kids pancakes at once so no one is waiting. 🥓🥞🥓🥞",
        "worked great until it simply died almost year to the date I bought it.",
        "I can cook six large pancakes at a time on this. The only down side is it is much hotter on the side opposite the element plug-in. The grill closest to the plug is so cool that it does not cook effectively.",
        "The electrical plug that goes into the base is cheap, it does not stay plugged in, after only using it 3 months (we only use it maybe twice a month). I am surprised that this hasn't been recalled.",
        "Grill works good, but it came with the legs reversed which required me to remove and switch sides. Also, one leg is much shorter in the front which causes it to rock back in forth - so I put some sticky foam underneath the front leg and put down one of the leg extensions to get it level."
    ]
}