{
    "entity": "Electric Griddles",
    "text": [
        "I bought this griddle specifically because I couldn't find an acceptable flat non-stick griddle for my new induction range. We are a family of 2 with 2 young grandchildren who visit often. The original intended purpose was for pancakes-they do so much better on a non-stick surface. Pancakes are great, but it also comes in very handy for grilled cheese, quesadillas, eggs, and burgers. When cooking burgers or bacon, I place the griddle on a dishtowel directly on the induction cooktop and turn on the fan. I never put it in the dishwasher, although they say you can, but it takes about 30 sec. to wash. Small, easy to store, reliable, what more could you want?",
        "Love, love, love this size griddle. Use regularly - for bacon, hamburger, grilled cheese, reubens, pancakes, eggs, etc.... If you are single, or a couple or just have a small family this is the perfect size! Doesn't take up all that room in the cabinet and holds 4 hamburgers or 3 big pancakes perfectly. Heats evenly, and the drip pan on the side catches the bacon grease. This is my 2nd one, still using the 1st one after 8 or 9 years. Bought this as a backup, that's how much I love this brand and size!",
        "This is a great size griddle for 1-2 people. We keep it on our boat and it's perfect to store in the cupboard. It heats up quickly. I was skeptical about the size but it works out well for the two of us. It cooks food so quickly that if we have to do two batches of food, it's no problem.",
        "I have seldom been more pleased with anything I have bought. It is the perfect size for my husband and me. It cooks bacon, sausage, eggs, pancakes, hash browns, anything. By chance, I thought to put a ribeye steak on it and the results were great. One of the best features is the ease of cleaning--just wipe out the grease, set it in the dishwasher and it comes out clean (Don't put the cord in !!!). I even dip out the grease from the well and use it to season other pans with veggies. It is one of the best purchases I have ever made.",
        "I love my Liddle Griddle. All I have used it for is Pancakes, which is what I mainly bought it for. I had a regular size griddle but it never would get hot enough and because it was so large I hardly ever used it. But this is perfect size for 2 people. Plan on using it a lot and it doesn't take up a lot of space. Very easy to clean and just store it in cabinet. You won't be disappointed in this appliance. I rarely do reviews but I am one who always reads reviews before I purchase and hope this helps someone to decide on what a great Liddle Griddle this is.",
        "Really wanted to love this griddle. It was nearly perfect except for the temperature. The surface measured with 3 different infrared thermometers, one of which is a more expensive, very accurate one, showed the griddle consitantly to be 100 degrees too high. For example with the dial set at 200 the surface would be 300! If you wanted 200 degrees you had to set it on warm. There is some uneveness of temperature, but that is normal for electric griddles like this. But the average wasn't even close to the setting. Great little griddle in all other respects but nearly unusable because of the temperature control (or rather the lack of it) So disappointed!",
        "I am spending a month in Zihuatanejo and this griddle is paying for itself! Just the right size and easy to clean!",
        "I am very disappointed in this product. I mostly wanted it for frying bacon and making pancakes. It failed at both. The bacon ends up with undercooked areas, even moving the slices around on the surface. The first time I tried to make pancakes, I used the recommended temperature and waited for bubbles to appear indicating they were ready to turn. When I turned them, the back side was black. The burn taste was so bad, I threw them away. I don't plan to use this product anymore. A waste of money.",
        "If you are just cooking for 1 or 2 people, this is ideal. The dimensions are given, so this is my fault, not the product's, but this thing is tiny. Not a whole lot bigger than a sheet of legal sized paper. On the upside, its small size comes in handy from a storage perspective. Also easy to clean.",
        "VERY COOL griddle for one or two people. Heats very quickly! LOVE the fact that it is lite weight and take up little space. The only thing is, I do feel it is a TAD bit expensive, as it should realistically only cost about $25.00. A MUST HAVE!!",
        "I found this on Amazon by accident. I always wanted a griddle in my van conversion but thought it was a lost cause ( no where to put it and wattage overwhelms my converter). Then I found this! negated both the problems. For just the two of us it's perfect for stealth camping when you don't want to open the roof vent to cook. Looking forward to grilled cheese sandwiches.",
        "I’ve had this griddle for over a year and use it almost daily. It’s still just as good as day one. The non stick coating has held up well, I don’t need to use any oil when I make pancakes. It’s small enough that I’ve brought it with us on trips (my kids love their pancakes in the morning). I’m glad I got the smaller size because it’s easier to store and fits well on the counter. It wouldn’t be great if you have a lot of people to feed, but it’s perfect for our family of four.",
        "If you use a griddle often this is perfect. Cleans right up, eggs do not stick. Get used everyday. Nice, compact size. It does fit about 3-4 fried eggs if necessary, we usually make 2 scrambled with plenty of room for more. Have tp pull out the regular size for those big Sunday breakfasts but this little one is perfect for daily use.",
        "Just the right size for two people. We got our sourdough going again, and I am enjoying the pancakes. My wife hates our electric range. She could not keep a consistent heat for pancakes about 375 degrees. This little jewel is perfect for pancakes. Easy cleanup with a damp cloth. Also very good for toasted cheese sandwiches and quesadillas.",
        "Works like a charm. Compact, fits on a small board on top of the gas hobs. Big enough for 4 fried eggs, bacon, 2-3 large pieces of French toast. I wish Presto made a grill the same size.",
        "Love this griddle. We have used it so much, I’m looking for a new one. It’s still in fantastic shape after two years but I’ve never had a griddle last this long and afraid if it dies, my boys will starve. 😉 Want to have a backup plan. Seriously, cooks beautifully. More often than not, simply wipe with a paper towel to clean. When necessary washes beautifully in the dishwasher. Frequently used 2-3 times a day.",
        "Fix pancakes! Plus other food. Cute little griddle. Perfect size for 2 even for one. Most stores locally big long ones. Waste of space not used. We seniors don’t eat much we use to. Pictures does justice till you actually see it. Even we haven’t used it but I do trust it will work perfectly for us and returnable if something goes wrong.",
        "Love this griddle Had the previous one for 44 years and finally just worn out from use The temperature gauge is great easy to use and easy to read Helps to regulate for all sorts of cooking and not getting all of the heat It has it's own little grease overflow Only drawback is that is not removable so you need to pick up the whole griddle to dispose of grease I use mainly to cook pancakes and it is great for it",
        "I've not sent a kid away to college without one of these and our one at home is also used frequently. It's great for those learning to cook and we've all discovered creative uses for it. Virtually indestructible, we've only had to replace one over the many years we've owned these...and that was because I dropped it on a hard floor and broke one of the handles off. A highly-recommended purchase!",
        "I love this little “liddle griddle”! I actually bought another one because my stupid cat knocked it off the counter and it broke. I cook everything on this; chicken, eggs, grilled cheese, pancakes, etc. It is small but perfect size for one or two people in a small apartment.",
        "I love my liddle griddle. I don’t have to get out pans for each thing I want to cook. I have even cooked scrambled eggs on it. Great product. I just keep on top of my stovetop and warm up or cook things in a jiffy. Cleanup is seriously easy. It is nonstick and just wipes clean most of the time.",
        "It's very small..about the size of a standard sheet of paper and very light weight. I can fix two medium sized pancakes but there isn't much flip room..You have to put the pancake exactly where it was or part of it will land on the second pancake.. Other than that..it's a workable griddle for no more than two people. I personally wouldn't fix bacon on it..too much spatter..and the instructions say to put aluminum foil under it so you don't damage your counter tops.",
        "My pans are too small for more than one pancake at a time. There are only two of us in the house, so I didn't want a large griddle. Initially, I wasn't looking for an electric griddle, but having gotten this little Presto Griddle I am surprised I didn't think of it sooner. I use it at least once a week. I've done hash browns, eggs, sausage, pancakes, french toast, toasted sandwiches, grilled fruit..... and it cleans like a dream. It is dishwasher safe (minus the heating element) but that will discolor your griddle. I wash mine by hand and it is the easiest thing to keep clean. It is also small enough that storage has not been an issue.",
        "I bought this little piece as a gift for someone with no room in their kitchen. What a perfect little griddle! I have the larger one and have always loved it, but this little one is absolutely wonderful. It heats up quickly, easy temperature dial, cleans easily, I can't say enough good about it!",
        "I like this griddle. I heats evenly, good temperature control. But, it wobbles. The legs are not the same length. I tried this on 7 different surfaces (counters, tables, desk) and it was not stable. I was going to send it back but a guest did not pay attention and knocked it off the counter. It broke one of the legs. Not fair to send back now.",
        "I purchased this griddle mostly to use for making breakfast. It's the perfect size for a few eggs, four pancakes or whatever. However I'm also using it to make burghers ,hot dogs, thaw out onion rings which come out just fine as well. It cleans up easily, does not take up much room on the table and I could not be happier that I made this purchase.",
        "It chipped after the 4th use. Very disappointing. Nothing hit it, the edge obviously is fragile. Then, after about 8 months of having it, and while just sitting on the counter, one of the plastic legs spontaneously broke. I’ll be buying another brand. Thought Presto was better than this.",
        "Best that I have purchased in ages. I live alone and can do almost every meal on this griddle.......steaks, chops, breakfast foods, fried veggies and etc. Only one item to clean up, love the fact that it's immersible. The size is great for one or two people and I have used it for almost every meal since I've had it. Would recommend.",
        "I just love this, it doesn't take up to much room. And for just being my husband and myself it is just the right size for us. Cooks everything we need. In fact this is my second one. It is in the camper.",
        "Is just the the right size and price . Perfect for two eggs and bacon for sure and more . I love how convenient it is and easy to clean . 2 years with this and still working 👍",
        "Bought as gift for son not living with me. He was working from home and cooking a lot. This was great for his pancakes on Saturday morning. Not sure if he has used it for anything else but is happy with it for that.",
        "For a long time I was looking for a griddle like this. I like this small size because it’s so practical. You can control temperature easily with the knob, it’s very easy to clean (electrical cord is detachable) , it’s light and I can use it for pancakes, omelettes, scrambled eggs, and I even toast my bread ( turning both sides) . It’s size is perfect for two to three persons. I really recommend this griddle.!",
        "My parents were still using the large griddle we grew up with. The non-stick coating was all worn off and it was ruining our breakfasts when we visited! Plus, it was taking up too much space in their kitchen. I got this for my parents to replace that old large griddle. Since its small, its easier to store. But, still its big enough to make breakfast for a small crowd when we do visit. Its about the size of a large skillet, but easier to use. You can fit about 4 pancakes at a time on it. The non-stick surface works great. I recommend using plastic/silicone tools to prevent scratching.",
        "Its nice but i dont believe it goes up to 400 degrees. Feels more like 300-330f . It have that non stick coating and easy to clean , only complaint is that it doesn't heat up that much",
        "Works great and is perfect to take on trips like camping and hotels. I travel a lot and try to save money by eating food I cook as much as possible. We also use it in our kitchen if we are having a large breakfast. The only thing I'm not super happy about is the finish is a bit rougher than I wanted, but I guess it is more durable that way. It seems to clean up easily and the label says it is fully immersible in water if you take the plug out. Great price for this little gadget too!",
        "We had a larger one of these. After about 5 years, my husband accidentally dropped it on the floor and the drip tray was damaged. The surface also experienced some aging issues. They're not expensive and we felt we got our money's worth of of that one. This one holds 2 four ounce burger patties great. We cook hot dogs on it too. We don't need much and this is also easy to store. I really do recommend it.",
        "This little griddle is very convenient for one or two people. However, I wish that it came with a lid. The tray for grease isn't removable so you have to clean it by taking the whole thing out.",
        "Just arrived. We made pancakes with it. It is a little smaller than I thought it would be but I am happy with purchase. And the pancakes did not stick. Really happy with purchase.",
        "The quality seems really good but I think the images are misleading. I received this griddle and there is no way 2 eggs and so many strips of bacon can hold on it. Was very disappointed since I have limited space so the traditional size griddle is too big. But this one is way too small",
        "Why are you waiting and reading all of these positive reviews...just buy it! I was looking for a small griddle that would fit in my small sink and this is perfect! I really have nothing bad to say about it. I live alone, but often cook for myself and two small dogs. It fits 6- 4oz chicken breasts. I have made eggs, sausage, hash browns, and chicken and it has all been cooked through and evenly. Also, the clean up is sooooo easy!! I haven't made pancakes yet, but I don't doubt they will be just right!",
        "I love my Liddle Griddle. It is the perfect size for one or two people and clean-up is a breeze. I've gifted one to each of my grown-up children and they love it, too! The only place I can find them anymore is on Amazon and I sure hope they never stop manufacturing them",
        "We love this product. My wife and I bought it for our camper and it's perfect for our use and easy to store. We can cook omelettes and sausage in it at the same time, as well as pancakes for 2, and French toast and bacon. The nonstick surface is very easy to clean in a small sink and limited space, and the surface area is perfect for traveling",
        "This skillet has worked great so far! It heats up super quickly and the heat is distributed equally across the skillet. Cleaning is a breeze and it’s small so storage is super easy. Happy with my purchase.",
        "Since my purchase here on Amazon, I've been using it multiple times almost every single day for close to a year and a half so far. Best appliance I've ever purchased and I highly recommend it!",
        "Just right for my small camper. Easy to store also.",
        "I've always used a stove top frying pan to cook. Based on cooking pancakes on the Liddle Griddle, it is just so much easier! I think because I can set the exact temperature. Can't wait to try other things! The only negative thing is my griddle had a black residue on the bottom of it that I had to scrub off with steel wool.",
        "We bought this to use in our RV.It fits in our draw perfectly.We have a small camper, absolutely love having this to cook breakfast and toast our bread on.Got rid of the bulky toaster that took up space.👍👍",
        "Perfect for my limited kitchen counter space. Am usually cooking for one, but fine for when I have guests too. So glad to find this Liddle Griddle, just what I was looking for. Have already made pancakes, French toast and grilled cheese as well as bacon and sausage. Fits perfect in the bottom drawer of my stove. Arrived with another item within 3 days.",
        "Perfect size for two people. I also have a larger unit but this one is great when I'm cooking for just the two of us. I also prefer the grease collection system. It collects at one end of the griddle (not a separate tray that will fall out). Very pleased with this unit so far.",
        "I use this little grill for wax painting. I looked at \"official\" wax warmers, saw larger regular grills in wax painting start up kits and decided to try this one. It is perfect. Large enough to set lots of tins on, small enough to fit in my limited space. Easy to wipe off wax from surface. I am sure it would be good as a cooking grill too, though I haven't used it for such. The only thing I would change is I would like a longer cord, but most small appliances have short cords, so that is just a little wish.",
        "This grill works just right for the two of us on our camping trips. Doesn't take up too much room which is a precious commodity when you only have a 16' Scamp to camp in. I generally cook 4 strips of bacon first, and they fit just right lengthwise and widthwise. After that, we cook 4 eggs and those fit just right too. The grease catcher is a great way to get excess grease from the cooking surface and move it to the side.",
        "This is the best kitchen item EVER! I am a certified member of the hate to cook club. This small griddle makes cooking so easy—YES! It is also very easy to clean, another plus",
        "I use this at work for breakfast and for lunch every day. I love this little compact beast so much!!! It's so easy to clean, heats up rapidly, and has a pretty good distribution of heat throughout!!! A MUST BUY for travel or work!",
        "I bought this griddle for our office - and around 9 each morning I go into our kitchen area and make myself an omelet! I've seen others use it to grill their sandwiches - it's really \"just right\".",
        "I know this is advertised as small, but it's so small that you can only do one pancake at a time. The heat control is in an awkward spot -- right in the way for where you're working. And because of the design of the handles, it's really easy to inadvertently touch the griddle surface and get a nasty burn.",
        "Love the size perfect for two people. Love that I don't have to get my larger one out. Also hard to find this size in a store.",
        "Made pancakes with ease. No stick at all! They cooked evenly too. The picture they have with the two eggs is fake. There is no way you are going to fit more than one egg on here. It is very small. I have to cook pancakes one at a time. But this is what i was expecting so if you want a bigger one, then do not get this. If you dont mind cooking things one at a time, then this is great.",
        "I got this for my young son whom is in the army and he could cook in the base a good breakfast eggs, pancakes, even meat. This was good investment.",
        "I love my griddle it’s smaller than I expected even though measurements are specified it actually turned out better purchasing this size easy to clean . I purchased this item used I recommend buying use and save money",
        "I bought this to replace the one that I stupidly broke. It is just the right size for my husband and I who are now empty nesters. It has fairly even heat and is easily adjustable. It doesn't take much room to store. The grease tray is easy to clean and really holds a lot of grease) for when I cook bacon.",
        "We use it for all sorts of thigs. Sausage patties, bacon, eggs, hash browns, toast. It's great for toasting hamburger buns, too.",
        "I have a large electric griddle but found it difficult to clean in my split bowl sink. This one is a great size and much easier to pull out to cook a single meal for myself. It will hold 4 burgers, or 4 grilled cheese sandwiches for my kids. Good size, good temperature control. I love it.",
        "I live by myself in a small apartment so when I saw this little griddle it seemed the perfect size. Like any cooking device you have to get used to the temperatures because of hot spots but overall it is very simple to put together and use. Clean up is also very easy. The Liddle Griddle is perfect for someone living by themselves but would be much too small for family use.",
        "Love this grill, and perfect for my very small apartment. I can cook 2 pancakes, 1 egg, and some bacon on this grill - just enough for one or two people. It's a handy-dandy for storage as it is very small, better than a pan and cleans up very easily. Would purchase again.",
        "Awesome little grill...heats up quickly...non stick...easy cleanup...I’d pay $100 for this if I had to. No more gas grills for me. Hamburgers, grilled cheese, sausage, breakfast, you name it!",
        "Love it! Works great for us, it’s perfect size for a 2 people household especially when you have a small kitchen",
        "Perfect for cooking for one, or two if you take turns. It is easy to clean and store. It heats quickly too.",
        "Love this little griddle used it in the living room while Kitchen was being remodeled. Not good for large crowds just for two people perfect",
        "This worked perfect in the small motel room space we had. We went down the shore and had a tiny sink, refrigerator, microwave and coffee maker but no cooking surface so I bought this. Worked perfectly for breakfast and we even cooked chicken thighs on it for lunch one day. Only thing that I wish were different is the edges of the surface are hot as well no defense to keep yourself from getting burned if you grab the wrong side.",
        "I have a small kitchen and it is just me, so this works perfectly. I can fit a couple of pancakes and a couple of sausages on there - no problem! If you have a lot to cook, this isn't for you, but if you just have to fix something for one (or two), this is a great size. Doesn't take up a lot of space in your kitchen.",
        "Great small griddle is perfect for 1 or 2 people nonstick easy to store heats up quickly and evenly would recommend",
        "This little griddle is used more than almost anything else in my kitchen. How did I ever get along without it? I haven't tried to toast bread on it, but I'm sure I could. It heats up at jet speed and is ready to go in 10-20 seconds. It cleans up very quickly, too. Given how much I use it (to my surprise) I'm trying to find a more convenient place in which to store it. One thing's for sure: it uses much less power than my electric stove. This was the ideal gift I bought myself.",
        "It was getting to the point that I'd avoid using a frying pan or griddle atop my electric smooth-top range because cleaning the cooktop afterward was such a chore. This is the perfect solution and so much easier. Plus the results are excellent--no fat or oil required.",
        "This is a perfect size for the two of us. It works very well, cleans easily, and is easy to store. (Just don't accidentally knock it off the counter because the legs will break, making it necessary to replace!)",
        "My husband prefers to make his eggs on a griddle. This small griddle is PERFECT for his 2 eggs & ham in the morning. The legs are level, so the eggs don't run to one side...like on a 'draining' griddle. This is also small enough to bring along when we go camping.",
        "Hate the big huge griddles, hard to store etc.. This thing is a perfect size and works great.",
        "Perfect size for two/one people. Works well for hamburger, works well for egg, pancake.",
        "Like that it heats quickly, easy access to surface w/ various size spatulas. Smaller size less heat gain in southern AZ compared to full-sized griddle. Eggs, pancakes a snap. Made Grilled Cheese and Turkey sandwich, gluten-free bread, today. Nice for chilly rainy day. Cleans up quickly, stashes under sink easily. The screws loosen from handles, tightening needed. I enjoy using it!",
        "Never even used. Way too small Its not a fair review. I just thought it would be bigger. Cant even make 2 big pancakes",
        "I was looking for a small griddle and this fits the bill. doesn't take up much room on my counter and is excellent for taking camping. Cooks evenly. Very happy with this purchase/",
        "We purchased this griddle to cook breakfast in our room while on vacation in the Virgin Islands. The size was perfect for packing in our suitcase and for our counter area. It was extremely easy to clean in the small sink we had. Also, it cooked so well, we are leaving it on the counter at home for every day use.",
        "small them I wanted. but does the job for a small. family if u have more the one child get a bigger one",
        "My wife and I have been married for 53 years and we've owned a number of griddles made by different manufacturers.By far, the Little Griddle is the easiest to use, clean and store. Over the years, we've bought 2 Little Griddles and I'm tempted to buy one as a backup unit. While the Little Griddle is easy to clean and store, there are times when it would be nice to have a clean unit standing by, ready to press into service.",
        "Works great for one or two people. Only complaint is that it rocks on a level surface so legs are not the same length.",
        "The size is perfect! I wanted to make pancakes for first week of school and missed my larger griddle so I got this petite version and I love it even more!",
        "This is a great little griddle. It is what you would expect in a griddle. The only thing I would change is the height of the edge around the griddle. When I saute onions or peppers I lose a few off the edge. Great for cooks who don't need a large griddle or don't have the space for one.",
        "Great little grill perfect for one person, easy to use and clean.",
        "Nothing. I cannot unscrew the damn screws to attach handles ! So I cannot use. What can I do? Ok I whacked the screws with a hammer and that loosened them enough to unscrew them. Anyone else have this trouble?",
        "Very nice little grill which is easy to store and just the right size for breakfast for two. Also easy to clean.",
        "I know I should of read the measurements for the product. I assumed it was something else. The legs broke in about a month. I would not recommend product.",
        "This is a great little grill. It was too small for me. I returned it.",
        "Can't believe I didn't review this already! We've used our griddle at least once per week for the last few years, and it's very convenient, cooks well, and is easy to clean. Wonderful for pancakes and burgers. My teenage daughter loves making pancakes and quesadillas on this! And it just wipes down after most uses (burgers, of course, take a little more effort to clean, but not a lot).",
        "I love this thing! It heats evenly and although it’s small I’ve cooked fajitas, pancakes, quesadillas and burgers. It’s a good size for only 1 or 2 people",
        "Traveled 7,000 miles in an RV and this is what I used most often. Love it.",
        "We rarely use this; but it works fine when we do.",
        "I can't say that I have any complaints. Made eggs, bacon and pancakes... all came out good. Heats up fast and easy cleanup. I just didnt realize how small it was but I use it everytime I make breakfast.",
        "I love having a griddle, but wanted one that did not take up so much room in the RV. This one is perfect. You can fit 4 pancakes or French toast easily enough.",
        "I bought and returned TWO of these because the temperature control DID'NT. It would heat up to max no matter where I set the dial.",
        "This was exactly what I was looking for. There are 3 of us in my household & I have used it so far for our hamburger buns and also for grilled cheese sandwiches. It is so much smaller & so handy for me a lot better than the big bulky one I have. So far it is just what I needed & wanted. Love it.",
        "I put it together quickly and it works well with fish, eggs, pancakes and beyond, with not taking much space in any kitchen. \" BRAVO ! \""
    ]
}